{
  "companyName": "Veeco Instruments",
  "companyTicker": "VECO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/veeco-instruments-veco-q2-2022-earnings-call-trans/",
  "content": "Veeco Instruments (VECO 0.05%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. Welcome to the Veeco Instruments Inc. corporate hosted Q2 2022 earnings call. At this time, I'd like to turn the conference over to Anthony Bencivenga.\n\nPlease go ahead.\n\nAnthony Bencivenga -- Investor Relations Contact Officer\n\nThank you, and good afternoon, everyone. Joining me today on the call are Bill Miller, Veeco's chief executive officer; and John Kiernan, our chief financial officer. Today's earnings release is available on the Veeco website. Please note that we have prepared a slide presentation to accompany today's webcast.\n\nWe encourage you to follow along with the slides on www.veeco.com. This call is being recorded by Veeco Instruments and is copyrighted material. It cannot be recorded or rebroadcast without Veeco's expressed permission. Your participation implies consent to our recording.\n\nTo the extent this call discuss is expectations about market conditions, market acceptance and future sales of the company's products, future disclosures, future earnings expectations, or otherwise make statements about the future, such statements are forward-looking and are subject to a number of risks and uncertainties that could cause actual results to differ materially from the statements made, including as a result of the COVID-19 pandemic. These factors are discussed in the Business Description, Management's Discussion and Analysis, and Risk Factors sections of the company's report on Form 10-K and annual report to shareholders and in our subsequent quarterly reports on Form 10-Q, current reports on Form 8-K, and the press releases. Veeco does not undertake any obligation to update any forward-looking statements, including those made on this call to reflect future events or circumstances after the date of such statements. During this call, management will address non-GAAP financial measures.\n\nInformation regarding such non-GAAP financial measures, including reconciliation to GAAP measures of performance is available on our website. With that, I will turn the call over to our CEO, Bill Miller.\n\nBill Miller -- Chief Executive Officer\n\nThank you, Anthony. Good afternoon, everyone, and thank you for joining us today. Veeco delivered another solid quarter of top and bottom-line results reflecting strong demand for our semiconductor products. The Veeco united team is executing well, innovating to advance our product portfolio, and managing our supply chain to meet customer commitments.\n\nToday, I'll take you through our second quarter highlights and discuss our markets in technologies. John will provide a financial update and guidance, and then we'll be happy to take your questions.Demand continues to be strong in the second quarter. We saw healthy order activity in our semiconductor and data storage markets, which drove an increase in our backlog. Our revenue of $164 million was above the midpoint of our guide and driven by another record quarter of semiconductor shipments with significant contribution from laser annealing and advanced packaging lithography systems.\n\nOur solid execution with the non-GAAP operating income of $23 million and non-GAAP EPS of $0.35, which were above the top end of our guided range, and we ended the quarter with $231 million in cash and short-term investments. Earlier today, we demonstrated our commitment to further improve transparency, diversity and inclusion, and our environmental responsibility by issuing our 2021 sustainability report with updated full-year metrics, and status on our recently announced ESG goals. Our customers express great interest in this area, and investors have provided positive feedback on our initiatives as well. Looking ahead, there are many examples of capacity additions, new fab expansions, and technology transitions, particularly in logic where Veeco semiconductor exposure is greatest, which gives us confidence in our future.\n\nOur previously provided full-year guidance remains intact, and we're excited that 2022 will be a growth year. I'll switch gears to our markets and technologies starting with the semiconductor market. There are several significant growth drivers underpinning our semiconductor market. They are artificial intelligence and high-performance computing, mobility, the transformation of the automotive industry, and ongoing data center and cloud adoption.\n\nVeeco is well-positioned with exciting products to address the semiconductor market. To cite a few examples, our laser annealing systems have applicability in both leading and trailing nodes, helping our customers with AI and high-performance computing, as well as mature automotive and consumer applications. Our advanced packaging lithography systems help our customers enable various 3D integration techniques to improve device performance and power consumption for data center and other high-performance computing applications. And our Ion Beam Deposition Systems for EUV mask blanks are critical part of the leading-edge front-end ecosystems, which enables the most advanced semiconductor devices.\n\nLooking more specifically at our laser annealing product line. This is because largest product line leading our growth trajectory into the semiconductor market. Consistent with our strategy and enabled by our recent capacity expansion, we had a strong shipping quarter, broadly supporting domestic and Asian customers with systems for both advanced node and mature node applications. Our San Jose facility ramp is on schedule, and our operations will be fully transferred to the new building by the end of Q3.\n\nThe increased manufacturing footprint is enabling the ramp of our laser annealing output to meet our customers' demand. And demand for laser annealing remains healthy as we see customers adopt our technology and add capacity. Because laser annealing platform is a production tool of record at the world's leading logic players. Today, we're shipping for the current capacity needs at their most advanced nodes, and continuously innovating to enable their next nodes.\n\nIn addition to logic, we're excited to introduce laser annealing to the memory market. In fact, a leading DRAM manufacturer recently signed off their evaluation system for a future node. We anticipate follow-on orders in the late 2023 or early 2024 timeframe to support our customers manufacturing plans. Overall, our laser annealing business is growing as we win process steps and new customers.\n\nNow, looking at our advanced packaging lithography product line, we continue to experience good traction in applications such as Fan-out Wafer Level Packaging, copper pillar, and bump, driven by GPU production and high-performance computing. For example, during the quarter we had multiple shipments for high-volume manufacturing, wafer level packaging applications. We expect our advanced packaging lithography products to continue to be a contributor to our semiconductor market for years to come, as manufacturers seek to increase I/O densities and strategies to integrate diverse chips in packages to improve performance. Switching gears to the EUV mask blank product line, our Ion Beam Deposition Technology has been identified as V technology of choice to deposit defect-free films to create EUV mask blanks.\n\nWe expect this product line to remain in demand as customers plan their capacity additions to keep up with the adoption of EUV lithography. ASML recently reiterated their plans to ship 55 EUV systems in 2022, 60 in 2023. And they're working on capacity expansion plans to ship 90 systems annually by 2025. With approximately one of our systems require for every 10 to 15 EUV lithography systems, we currently size this market at three to five Ion-Beam systems per year.\n\nWith that question, our semiconductor business is performing quite well and driving Veeco's growth in 2022 and beyond. Looking now at our compound semiconductor market, while we're seeing a slowdown in 5G RF-related activity in the compound semiconductor market, we're experiencing an increase in photonics applications. During the quarter we shipped multiple deposition systems to support laser DIOs for optical communication and specialty LED production. Looking ahead, we're working to penetrate the compound semiconductor market with our MOCVD solutions by targeting micro-LED and power electronics applications.\n\nOur Gallium Nitride and Arsenide Phosphide Systems are in the field under evaluation with leading customers. In the power electronics case, we're working with a foundry customer who is evaluating on propel single wafer gallium nitride system for eight-inch power applications. We believe there are opportunities in the consumer automotive and data center power markets to enable improved cost of ownership with an agent solution while delivering best-in-class film properties. In micro-LED, we're engaged in two applications working with a number of leaders in the industry for five plus years.\n\nThe first approach is more traditional, where Red, Green, and Blue micro-LEDs are produced independently and transferred to a display. We have our alumina arsenide phosphide system under evaluation for Red micro-LED opportunities. We expect this evaluation to close in the second half of this year. For the second approach, we have 200- and 300-millimeter gallium nitride systems that we're deploying for an innovative micro-LED application where the blue, green, and red pixels are produced on the same silicon wafer.\n\nBoth approaches can potentially be a good long-term opportunity for the company going forward. Our third major end market is data storage. We believe this market will provide secular growth for Veeco in the long run. Data stored in the cloud is still forecasted to grow at a 35% CAGR with the number of heads and complexity of heads expected to grow as well.\n\nThis corresponds with an increase in hard drive capacities, and the overall number of heads shipped. Today, the industry is shipping 20-plus terabyte drives with larger drives on the horizon. 2022 data storage performance is playing out as we expected. As we look forward based on strong order activity with customers today and the current lead times, we continue to gain confidence that 2023 will be a growth year over 2022.\n\nNow, let's review our 2022 priorities. With employee health a priority as we monitor the pandemic's evolution, we're staying flexible regarding safety protocols in our facilities. We further strengthened our commitment to improving our culture during the quarter by launching a companywide internal employee survey to monitor the progress of several cultural initiatives we have underway. The feedback was excellent and we're proud of the initial progress we've made.\n\nWe're maintaining our focus on converting our valuation systems into ongoing business and in fact, our evaluation program has been quite successful. During the quarter, three more systems installed at customer sites were signed-off. Our expectation is this will result in follow-on volume business in the future. Another key focus for us in 2022 is managing our supply chain to deal with global shortages of certain components, commodities, and OEM products.\n\nIt bears repeating that our supply chain team has been doing a great job, keeping our production lines operating, and enabling Veeco to reaffirm our 2022 guidance for the year. With these priorities in mind, we're committed to making a material difference and building a stronger Veeco that serves all our stakeholders.With that, I'll turn it over to John.\n\nJohn Kiernan -- Chief Financial Officer\n\nThanks, Bill, and good afternoon, everyone. Today I will be discussing non-GAAP financial data and would encourage you to refer to our reconciliation between GAAP and non-GAAP results which you can find in our press release or at the end of the quarterly earnings presentation. Turning to Q2 revenue by market and geography, revenue totaled $164 million for the quarter and was driven by record sales to our semiconductor customers, which increased 26% sequentially from Q1, 2022 and 82% from a year ago. Our semiconductor business made up 60% of our total revenue with significant contribution coming from our laser annealing products, as well as our advanced packaging lithography systems.\n\nThe compound semiconductor market contributed 19% of our revenue, and while down sequentially, revenue in this market increased 28% from Q2, 2021. This was driven by systems shipments for photonics applications. Our data storage market came in at 13% of total revenue, consistent with our guidance and expectations for the year. And finally, the scientific market made up 8% of our revenue.\n\nNow, looking at our quarterly revenue by region, the United States was 35% of our total revenue, driven primarily by sales of laser annealing and advanced packaging lithography systems. Our Asia Pacific region excluding China made up 30% driven primarily by semiconductor system sales. EMEA made up 17% of total revenue for the quarter, and finally, China made up 17% of total revenue primarily driven by sales to customers for photonics applications. Switching gears to our non-GAAP quarterly results, gross margin came in at 40.3% in line with guidance, it should be noted that we expect quarter-to-quarter variations in gross margin due to the influence of a number of factors.\n\nIn the second quarter, we experienced unfavorable mix impact in gross margin. We expect gross margins to improve in the second half compared to Q2. Operating expenses for the quarter were $43 million flat from Q1. Tax expense for the quarter was approximately $600,000 with net income coming in at $20 million and EPS was $0.35 on a diluted share count of 63 million shares.\n\nNow, moving to the balance sheet and cash flow highlights, we ended the quarter with cash and short-term investments of $231 million essentially flat from last quarter. Cash flow from operations was $3.4 million. Our accounts receivable increased by $28 million due to an increase in revenue and the timing of one-customer payments were due, some fall in just outside the quarter. As a result, DSO for the quarter increased to 70 days from 57 days in the prior quarter.\n\nAccounts payable decreased sequentially by $9 million with the corresponding decrease in days payable to 43. Inventory was $176 million down $3 million from the prior quarter, with days of the inventory decreasing to 160 days. Capex for the quarter was $4.5 million. Long-term debt, including the current portion of $20 million was recorded at $274 million on the balance sheet and represent the carrying value about $278 million in convertible notes.\n\nNow, turning to Q3 non-GAAP guidance, while our demand is quite strong, we've not seen a meaningful improvement in inbound material lead times. In this supply constrained environment, we expect Q3 revenue to be between $160 million and $180 million. And with a more favorable mix in Q2, we expect gross margin to improve to between 41% and 43%. We expect APAC to be between $45 million and $47 million, net income is expected between $18 million and $28 million.\n\nEPS is expected between $0.32 and $0.48 per diluted share, and it's based upon a $64 million share count. Please refer to the schedule in the guidance section of the earnings press release and backup section of the earnings presentation, which illustrates how Q3 EPS is calculated based on the guidance range is provided. And now, for some additional color beyond Q3, although supply chain challenges persist, we continue to experience strong demand for our products. And we're reiterating our previously guided full-year revenue range of $640 million to $680 million and diluted non-GAAP EPS range of $1.50 to $1.70 per share.\n\nOne other update before we take your questions. Currently, in accordance with U.S. GAAP, the company's U.S. deferred tax assets have a full valuation allowance.\n\nThe company will maintain this valuation allowance until there is s sufficient positive evidence to support its reversal. The company believes there's a reasonable possibility within the next 12 months that sufficient positive evidence may become available to allow management to reach a conclusion that a significant portion of the valuation allowance will no longer be needed. If this happens, from a GAAP perspective, our P&L tax benefit will be realized in the period in which the reversal takes place. Additionally, from both a GAAP and non-GAAP perspective, the effective tax rate will increase from that point forward.\n\nFrom a cash perspective, the company will continue to use its tax NOL and credit carryforwards to offset U.S. taxes, limiting the cash impact, and so such carryforwards have been fully utilized. And with that, Bill and I will be happy to take your questions. Operator, please.\n\nOperator\n\nThank you. [Operator instructions] We'll pause a moment to assemble the phone queue. We'll take our first question from Rick Schafer with Oppenheimer. Please go ahead.\n\nRick Schafer -- Oppenheimer and Company -- Analyst\n\nThanks. Excuse me. Thanks, and nice quarter guys. I know it's kind of tough out there right now.\n\nI just had a couple of questions if I could, and if I -- maybe the first one is just sort of the impact as we can all see the headlines and then tightening -- U.S. government tightening restrictions around equipment sales to China make you feel like we've seen this movie before, you know, with Huawei couple of years ago. So, what is your sense? I'm sure you're watching it, too. You know, like, where do you think this is headed? What kind of impact do you expect Veeco to potentially see here 20% of sales? I mean, are you seeing any changes or any anything different already, or do you expect to?\n\nJohn Kiernan -- Chief Financial Officer\n\nSo, thanks for the question, Rick. And as you just mentioned, we have about, you know, high teens to 20% of our revenue in China, but I would highlight it's not concentrated in any one technology. So, in addition to business in the semi-market, we also have compound semi in scientific market being served as well and with a number of different technologies there. So, what we are aware of, of the public comments from other equipment companies indicating that they've received notices from the U.S.\n\ngovernment. These notices may have imposed additional restrictions on the sale of their equipment into China for sub-14-nanometer applications. So, today, we have not received any notices from the government along these lines. And we'll continue to monitor the situation and of course comply with any applicable laws and regulations there.\n\nSo, impact on Veeco, of course, that would depend on the contents of any notice, but as of today, for any such systems forecasts would be sold into China, it's our understanding that our equipment is not for applications below 14 nanometers. So, as such, we don't believe there would be any negative impact currently to our guidance and our ability to ship equipment into China.\n\nRick Schafer -- Oppenheimer and Company -- Analyst\n\nThanks for all that detail, John. I appreciate it. And I appreciate it's a tough question to answer probably right now. And my second question it's probably for you also, I know, you've mentioned that you shipped record and Bill set it to you mention, you should record semi revenues in the quarter led by LSA and advanced packaging, but then you also mentioned gross margin was down to unfavorable mix.\n\nSo, I was just kind of trying to find a square of that circle, so to speak, and so curious where else did you see higher sales, sort of what was the offset. I guess maybe a little more color on gross margins. Thanks a lot.\n\nJohn Kiernan -- Chief Financial Officer\n\nYeah. So, we guided to that range of gross margin. So, they came in within our expectation, we mentioned that we had three evaluation tools that signed off this quarter. So, as part of the product mix, we had a couple of the evaluation tools that got signed-off that had special pricing on them.\n\nSo, lower pricing, that was one of the main contributing factors there for the gross margin guide, and for where we achieve gross margin in Q2.\n\nRick Schafer -- Oppenheimer and Company -- Analyst\n\nGot it. Thanks for the color.\n\nJohn Kiernan -- Chief Financial Officer\n\nAll right. Thanks, Rick.\n\nBill Miller -- Chief Executive Officer\n\nThanks, Rick.\n\nOperator\n\nWe'll take our next question from Tom O'Malley with Barclays. Please go ahead.\n\nTom O'Malley -- Barclays Capital -- Analyst\n\nGood afternoon, guys. Thanks for taking my question. I know you mentioned in the preamble that demand remained strong, you're seeing healthy orders. You also mentioned that you're not seeing any improvement in terms of lead times.\n\nBut could you just give us a handle for any changes in customer behavior? Are you seeing your customers act any differently than they did say at the beginning of this quarter or even six months ago just given the broader environment getting a bit weaker? Any color on your interactions with them would be great.\n\nBill Miller -- Chief Executive Officer\n\nSure, Tom. I mean, I would say, if I look back two years, I would say at the company level, seven of those eight quarters, we've had a positive book-bill and when we had a book-bill of one. And if I look at semi, we've had a book-bill well in excess of one, and we've been putting up some big growth numbers in semi, record revenue this quarter 80-plus percent growth year over year. So, we feel really good about our backlog.\n\nAnd I look forward, Tom, I would say our order book and our pipeline look very strong in semi. I will say, though, that we are seeing some weakening in the 5G space, whether it's RF filters or power amplifiers. We haven't seen any order cancellations or any significant rescheduling, I would say at this point more of the requests -- a lot more of the requests are to pull in shift dates. And so, I know we're all very closely watching the situation but from where we sit now it's still quite a positive environment.\n\nTom O'Malley -- Barclays Capital -- Analyst\n\nPowerful and then you guys are reiterating the full year -- you've given some color on the moving pieces with segments inside of that guide. When you look at the -- at some of the segments of what's implied in the second half to kind of get there, data storage really stands out where obviously you're down pretty substantially this year calendar year '22 over calendar year '21. But to kind of get to your guidance you need some strong double-digit growth in both September and December with just some of the comments that are coming from the hard drive guys reasonably without cutting capex and some weaker results. What gives you the confidence that I know you're not tracking along exactly what the market, but what gives you the confidence you can hit that strong sequential back half and get to that guidance or have things changed at all?\n\nJohn Kiernan -- Chief Financial Officer\n\nYeah. So, Tom, so let me give a guide of where we sort of expect for the full year toward the midpoint of our guidance 660 in revenue by market, and then I and Bill will cover a little bit more about what we're seeing currently in the data storage side. So, our expectation is about up 50% revenue year on year in the semi part of the market. So, you can call that around $370 million revenue in semi.\n\nOn the compound side, we expect to be up for the year compared to last year in the 20%, 25% range, you can call that in the $130 million range. And, as mentioned, data storage being down this year in '22 versus last year about 45%, which would put us in about the $90 million range for this year and then the balance being picked up by the scientific market, just shy of -- just over 10% of revenue for the year up about 10% or so in the $70 million range there. And I'll turn it over to Bill for more commentary on what we're currently seeing and, you know, sort of data storage market.\n\nBill Miller -- Chief Executive Officer\n\nYeah, Tom. So, we've -- obviously, the previous three years we were -- we saw 40 plus percent growth for three consecutive years, which is really kind of outstripping customers are adding capacity in kind of a bit of a recovery mode there if you will. But when I step back and look at long term, view data being stored in the cloud is growing at 35%, the number of heads complexity of heads continues to increase. Our customers are shipping larger and larger format drives, I know as you know we are quite well.\n\nAnd so, I don't want to comment specifically on any customer, but I would say, taken together as a market the three major data storage customers, when they placed an order with us, it's for the lead time, say, as a year and then the time to install and then qualify it. They're looking to add capacity when they're placing orders with us. They're making decisions 18-24 months in the future before that capacity is added. And so, we have seen periods of time where customers are booking business with us while their business is not doing as planned.\n\nSo, what we found is they're not always correlated between when they're placing orders on us and how their businesses are performing as a general statement.\n\nTom O'Malley -- Barclays Capital -- Analyst\n\nThank you for all the detail. Appreciate it, guys. And nice results.\n\nBill Miller -- Chief Executive Officer\n\nThanks, Tom.\n\nOperator\n\n[Operator instructions] We'll take our next question from Patrick Ho with Stifel. Please go ahead.\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nThank you very much, and congrats on a nice quarter an outlook. Bill, maybe first for you, in terms of the semi business IA and particularly on the LSA fund, it's really encouraging to hear now you've gotten a memory customer that signed off on it. Given the differences between DRAM and advanced logic, can you give us a little bit of color of what type of applications and maybe like some of the incremental opportunities as they continue to shrink knows and eventually go to kind of 3D structures in the future?\n\nBill Miller -- Chief Executive Officer\n\nYes, it's an exciting new space for us. And as I did say, in the prepared remarks, we did sign off an email with a DRAM customer. And, we're looking to have follow-on business orders, maybe late '23, early '24. So, probably kind of more higher volume manufacturing up in the '24 timeframe is kind of where we're seeing that.\n\nBut you are right, there are a number of application and opportunities. We've -- we believe we're -- we are development tool of record for one application step in memory, but there are other opportunities. And you mentioned memory stacking and like there are a lot of applications that we're doing demos with customers but they're really not as far along at this point. But clearly, there are opportunities to grow this memory space.\n\nAnd we're kind of seeing over several years that this market could be similar size to the logic piece of the laser annealing market. So, it's a good long-term growth opportunity. And clearly having this tool signed-off is quite a milestone, and then good progress that our evaluation program is proceeding to positive outcomes.\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nGreat. That's helpful. And maybe this is my follow-up question for John. You guys have managed through the supply chain really well given that you've set revenue mark that had shown sequential growth.\n\nCan you discuss the supply chain environment today? You did mention that lead times haven't really improved at all while you're getting words out there, at least in the semi industry, that there are some pockets of improvements. Can you give a little bit of the color of the landscape and how you're managing through the current situation?\n\nJohn Kiernan -- Chief Financial Officer\n\nYeah. So, Patrick, thanks for the question. So, looking at historically, or the most recent quarter Q2 longer lead times and certain inflationary pressures persisted throughout the quarter. I want to thank our supply chain team.\n\nI think they've done a fantastic job of mitigating the challenges and we've continued to be able to meet our revenue targets. Supply chain constraints did have some impact on Q2 revenue and revenue would have been higher based upon demand if we had greater supply. Looking ahead to Q3, Patrick, I wish I could report that we've seen improvement. So, we -- but we feel like we'll see improvements in Q3, and lead times are still stretching, we've yet to see any meaningful improvements.\n\nSo, our guidance of revenue for the upcoming quarter does, you know, incorporate that. We believe that we'll be operating in a constrained supply chain environment for the upcoming quarter and not really forecasting any significant improvement for the balance of the year at this point.\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you very much.\n\nBill Miller -- Chief Executive Officer\n\nThanks, Patrick.\n\nOperator\n\nWe'll take our next question from Mark Miller with the Benchmark Company. Please go ahead.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nCongrats on another good quarter. You indicated there were three eval tools sign-off. I assume one of them was the DRAM what were the other two eval tools that were signed off?\n\nBill Miller -- Chief Executive Officer\n\nYeah. One was a laser. So, one laser annealing at a DRAM customer that we just spoke about. One was a laser annealing tool as a leading-edge logic customer was quite a milestone for us.\n\nAnd the third was what processing tool for a new customer in 5G RF filters.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nYou're talking about the alumina eval closing second half '22, do you expect that to lead to follow-on orders? If so, when?\n\nBill Miller -- Chief Executive Officer\n\nWe do, it's really kind of targeted at the luxury TV market is our understanding. And we probably would expect some follow-on revenue in this -- starting in the second half of '23 and following into 2024.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nThank you.\n\nBill Miller -- Chief Executive Officer\n\nThanks, Mark.\n\nOperator\n\n[Operator instructions] It appears we have no further questions at this time. I would like to turn the conference back to your presenters for any additional or closing remarks.\n\nBill Miller -- Chief Executive Officer\n\nThank you, operator, and to all joining us on today's call. I also want to thank our customers and our shareholders along with the Veeco United team for their support as we execute on your behalf. Have a great evening. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAnthony Bencivenga -- Investor Relations Contact Officer\n\nBill Miller -- Chief Executive Officer\n\nJohn Kiernan -- Chief Financial Officer\n\nRick Schafer -- Oppenheimer and Company -- Analyst\n\nTom O'Malley -- Barclays Capital -- Analyst\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nMark Miller -- The Benchmark Company -- Analyst\n\nMore VECO analysis\n\nAll earnings call transcripts"
}