{
  "companyName": "Rackspace Technology, Inc.",
  "companyTicker": "RXT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/rackspace-technology-inc-rxt-q2-2022-earnings-call/",
  "content": "Rackspace Technology, Inc. (RXT 1.72%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nRobert Watson\n\nGood afternoon, and welcome to Rackspace Technology's second quarter 2022 earnings conference call. My name is Robert Watson, vice president of corporate finance. As a reminder, today's call is being recorded. I am joined today by Kevin Jones, our chief executive officer; and Amar Maletira, our president and chief financial officer.\n\nThe slide deck we will reference during the call can be found on our investor relations website. On Slide 2, certain comments we make on this call will be forward looking. These statements are subject to risks and uncertainties, which could cause actual results to differ. A discussion of these risks and uncertainties is included in our SEC filings.\n\nRackspace Technology assumes no obligation to update the information provided on the call, except as required by law. Our presentation includes certain non-GAAP financial measures and certain further adjustments to these measures, which we believe provide useful information to our investors. In accordance with SEC rules, we have provided a reconciliation of these measures to their most directly comparable GAAP measures in the earnings release and presentation, both of which are available on our website. After our prepared remarks, we will take your questions.\n\n[Operator instructions] I will now turn the call over to Kevin.\n\nKevin Jones -- Chief Executive Officer\n\nGood afternoon, and thanks for joining us. I'll discuss quarterly highlights and the strategic direction of our business. Then Amar will go into detail on the financial results. On Slide 5, hyper growth in the cloud market shows no signs of abating.\n\nIn the second quarter, year-over-year cloud growth for the hyperscalers was impressive. AWS grew 33%. Google Cloud grew 36%. And analysts estimate that Microsoft Azure grew 40%.\n\nThis represents $10 billion of additional public cloud revenue compared to last year's second quarter. The Rackspace Technology benefits from overall secular cloud growth, and this growth is expected to continue for the foreseeable future. In the second quarter, we executed well with non-GAAP operating profit and non-GAAP earnings per share both at the high end of our guidance. In the current market, tech investors are extremely focused on cash flow.\n\nAnd in the second quarter, both operating and free cash flow were very strong for Rackspace Technology for the sixth quarter in a row. We are proud of the fact that we've delivered $365 million of free cash flow over this 18-month period, a testament to the underlying cash-generating power of our business. We made solid progress on the strategic initiatives we announced last quarter, and we also continued to expand and enhance our partnerships. More on these accomplishments in a moment.\n\nOn Slide 6, you see a snapshot of key financial metrics for the quarter. Revenue growth was solid with total revenue up 4% and core revenue up 5% compared to last year's second quarter. Non-GAAP operating profit was $99 million, and non-GAAP EPS was $0.17. As with most U.S.-based global companies, revenue in the quarter was impacted by foreign currency headwinds, as Amar will discuss in a moment.\n\nAs noted on this slide, we had a very strong quarter for bookings. And through the first six months, bookings were relatively flat compared to the first half of 2021. On Slide 7, last quarter, we previewed changes we're executing in our business. These included aligning and repositioning the company into two separate lines of business, public cloud and private cloud, to capitalize on the immense market opportunity we see today.\n\nWe are pleased with the progress we made on this front across a number of facets, people, organization structure, reporting and go-to-market. The team is working overtime to finalize this transformation. As we met with customers, partners and other stakeholders to preview these changes, we received very positive feedback, in particular, from our key hyperscaler partners, Amazon, Google and Microsoft as well as VMware. We're nearing the point where we can provide additional details on our go-forward game plan, including any additional decisions regarding the structure of the company later this fall.\n\nOn Slide 8, we announced that DK Sinha joined Rackspace Technology as president, Public Cloud Business Unit. DK is an entrepreneurial business leader with a strong growth focus and three decades of global expertise in technology and digital transformation services. Most recently, he was president of North America for Cognizant, where he spearheaded the short and long-term growth strategy and execution for a region that represented approximately 75% of Cognizant's revenue. While there, he also built and led a global go-to-market team encompassing key functions of sales, field marketing, partnerships and industry alliances.\n\nDK also previously worked for Tata Consulting Services. I'm thrilled to have DK on the team as we accelerate our public cloud strategy. He is the perfect leader to help us capitalize on this amazing market opportunity and has already made an impact on our business. On Slide 9, in the second quarter, we announced several exciting new product offerings.\n\nWe introduced Elastic Engineering for Government. Now this offering extends our successful and innovative Elastic Engineering service delivery model to the government sector, where Rackspace Technology Government Solutions has been a leader for over 20 years. We are also proud that Rackspace Technology Government Solutions was named the leader in the 2022 ISG Provider Lens report for the U.S. public sector.\n\nWe believe this recognition will positively impact our sales efforts in this important vertical.We expanded service offerings from our recent acquisition Just Analytics to target the AWS markets with data analytics, machine learning and AI. This complements Just Analytics' strong set of offerings on Azure. We enhanced our cloud data services portfolio to incorporate the data cloud capabilities provided by Snowflake and Databricks. And finally, we've announced a new security service to architect, design, implement and operationalize zero trust access with our partner, Cloudflare.\n\nOn Slide 10, our unique corporate culture and employee value proposition continues to receive acknowledgment in the way of awards and recognition this quarter in the form of two Inspiring Workplace awards. In the second quarter, we received the Inspiring Workplaces award for 2022 in both EMEA and North America. In addition, we were certified as a Most Loved Workplace because of our commitment to fostering a culture where team members can develop and sharpen their skills, grow in their careers and feel valued for their expertise. These awards are a strong validation of our company, our corporate culture and our value proposition for our Rackers and will help us continue to win in the market.\n\nWe also invested in our team members who earned 894 certifications across various cloud disciplines in the second quarter through Rackspace University. On Slide 11, we made a great deal of progress with our hyperscaler partners in the second quarter. We're recognized as one of the top AWS partners in the Mexico market. We joined the Microsoft Intelligent Security Association ecosystem of independent software vendors and managed security services providers.\n\nAnd we completed and received formal validation of our capabilities on Google Cloud and renewed our designation as a Google Cloud Managed Services Provider in the Latin America market. Let's look at a few case studies of Rackspace Technology customers who are benefiting from our cloud expertise. On Slide 12, BMG Rights Management strives to be the best business partner for songwriters and artists in the digital age. The transition to digital streaming platforms like Spotify and Apple Music has transformed the music industry.\n\nOne stream is roughly 1,500 times more data intensive than the sale of physical media such as a CD. So with digital music consumption at an all-time high, BMG had to enhance its data management expertise to ensure it received the correct royalties on its music portfolio. Within six months of our engagement, Rackspace Technology helped BMG migrate most of its applications to Google Cloud, including the business-critical applications behind supply chain management, royalty calculation and data analytics. Ultimately, we helped BMG migrate 70% of its applications to Google Cloud, generating significant cost savings.\n\nIn addition, we're exceeding BMG's targets for migration speed due to our in-depth knowledge of on-premise environments, application modernization best practices, Google Cloud architecture and around-the-clock support. On Slide 13, we also strengthened our relationship with VMware when we were selected as their strategic partner for the Secure Access Service Edge or SASE platform. VMware will leverage the Rackspace Technology Data Center in a Box solution to deploy VMware SASE, a solution that includes cloud networking, cloud security and edge compute services. VMware SASE will be initially deployed in 15 Rackspace Technology data centers with another five data centers planned for additional phases.\n\nThis supplements our broad and deep end-to-end portfolio of managed services for VMware such as Rackspace Services for VMware Cloud, which was launched in 2021. This is also another proof point of the potential in our private cloud business. Now Amar will take you through the financials. Amar?\n\nAmar Maletira -- President and Chief Financial Officer\n\nThank you, Kevin, and thank you, everyone, for joining our call today. Slide 15 recaps our financial results for the second quarter. Revenue was $772 million, a 4% year-over-year increase. Core revenue was $733 million, up 5% compared to the second quarter of 2021.\n\nRevenue was slightly below guidance due to foreign currency fluctuations, as well as a slower ramp for the British Telecom deal. Non-GAAP operating profit was $99 million, at the high end of our guidance for the second quarter. This was down 18% year over year, primarily due to the impact to gross profit from revenue decline in legacy OpenStack and our mature managed hosting. Non-GAAP operating margin was 13%, and non-GAAP earnings per share was $0.17.\n\nSlide 16 shows the company's revenue mix in the second quarter by segment and by geography. Multicloud continues to represent the vast majority of our revenue at 82% of the mix, and it grew 5% year over year. Apps & Cross Platform at 13% of total revenue was up 8% year over year. OpenStack declined 16%, in line with our expectations and represent just 5% of total revenue today.\n\nFrom a regional perspective, Americas represents 75% of our revenue. As you can see on the chart, regional growth rates were materially impacted by foreign currency fluctuations in the second quarter. On a constant currency basis, Americas growth would have been a point higher at 5%, APJ growth would have been two points higher at 29%, and EMEA would have flipped from a 3% decline to 3% growth, a six-point swing. On Slide 17, Rackspace Technology continues to drive strong cash flow.\n\nIn the second quarter, operating cash flow was $84 million, and free cash flow was $57 million, up from $65 million and $45 million, respectively, in the first quarter. This is the sixth consecutive quarter of positive operating and free cash flow. Over those six quarters, we have delivered a cumulative $365 million of free cash flow. This demonstrates the tremendous cash generation ability of the business.\n\nTotal capex was $37 million and cash capex was $27 million with capex intensity of 5% and 4%, respectively. We expect total capex intensity of 5% to 7% and cash capex intensity of 3% to 5% for the full year, in line with our previous guidance. At June 30, cash was $261 million compared to $215 million at the end of last year's second quarter. On Slide 18, I want to remind investors that we have a strong balance sheet with no material debt maturities until 2028.\n\nIn addition, all of our debt was refinanced in late 2020 and early 2021 at historically low rates with minimal financial covenants. At quarter end, total debt was $3.4 billion, and net debt was $3.1 billion. Our net leverage is very manageable for a company with our growth and profit profile. On Slide 19, we have a guidance for the third quarter.\n\nWe expect total revenue in the range of $769 million to $779 million, core revenue in the range of $733 million to $741 million, non-GAAP operating profit of $73 million to $77 million and non-GAAP EPS of $0.08 to $0.10. Now let me provide some additional color on our outlook. Third quarter revenue guidance is impacted by the shift in our sales focus away from resale revenue toward higher-margin offerings as well as expectation for continued foreign currency headwinds. The third quarter operating profit guidance is impacted by three primary factors: first, the continued and expected decline of our higher-margin managed hosting and legacy OpenStack businesses; second, the investments we are making in people, which includes retaining, retraining and hiring additional resources to drive growth in our cloud services business and support our long-term strategy; and third, although our power costs are partially hedged, we are seeing increased data center costs.\n\nThis is in part driven by record-high temperatures around the world, and we expect the impact to moderate over the intermediate term. As you know, we spent the last few quarters establishing our go-forward strategy and designing the best operating model to execute on it. The opportunity is clear, but we need to better position the company to address it. Job 1 in this regard is realigning the company to sharpen our sales, product development and operational focus on two key markets, public cloud and private cloud, and higher-margin opportunities within them.\n\nWe have our executive leadership team identified, and we are accelerating this transition, which we expect will create some near-term disruption over the next few quarters. Hence, we are moderating our outlook. We believe the end result will be a better and stronger Rackspace technology focused on high-margin products in growing markets. Before we open for questions, I want to reiterate that our cash flow is strong with six quarters of positive free cash flow and ample liquidity and a strong balance sheet that enables flexibility.\n\nAll told, we believe we are well positioned to win in the fast-growing cloud market in the years to come and excited to share the go-forward plan with you this fall. With that, we'll take your questions. Robert, please queue up the audience for Q&A.\n\nRobert Watson\n\n[Operator instructions] Our first question comes from Bryan Keane from Deutsche Bank. Our next question comes from Ramsey El-Assal from Barclays Capital.\n\nAmar Maletira -- President and Chief Financial Officer\n\nWe're having some technical difficulties here, guys. Just give us a few minutes [Technical difficulty] OK. We still have an echo here, but let's try it again. Bryan, are you on the line?\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nThere we go. Can you guys help us a little bit just with the piece of the business that's kind of you're focusing away, which is kind of the resale? How much of the business is that kind of resale business? And then the push toward obviously the higher-margin business, like what kind of components is that? Just trying to figure out the mix of business and what percentage of revenues those mixes make up.\n\nAmar Maletira -- President and Chief Financial Officer\n\nSo Bryan, we are going to give you all the details. That's what we are actually doing right now, realigning the company across those two business units, public cloud and private cloud. And I'll be able to give you more details on what's in the public cloud business unit at this forum. So that's in the works right now, and I'll be more than happy to give you all the details.\n\nNow to answer your question specifically, Bryan, as we mentioned on our previous call, we are in the public cloud business segment. We are putting more focus and emphasis on driving higher-margin cloud services business compared to resale. And even on the resale side is there are certain resale business that are lower margin, and when it comes up for renewal, we do a thorough assessment to understand whether we can actually expand our services in those accounts and if it meets certain profit thresholds or objectives. And if not, we are letting those lower-margin public cloud resale business churn.So that's what we are doing within the public cloud -- the overall public cloud segment.\n\nThat business is growing double digits. I think we are -- we see a good demand environment in the public cloud business, and I will let Kevin talk about a little bit on the demand one you've seen on the public cloud side.\n\nKevin Jones -- Chief Executive Officer\n\nSounds great. Bryan, so look, I would say we're excited about this organization into two business units. We see really strong demand on the public cloud side of things and also strong demand on the private cloud side of things. If you look at the overall market opportunity, it's enormous, right? We believe customers have really only started the shift to move their workloads to the cloud.\n\nSo we've got many years of growth potential ahead of us and a very strong desire from customers to scale, driving demand to multicloud, causing us to become the default architecture for modern workloads. So we see demand in both public cloud and private cloud, and this is going to result in lots of opportunities for migrations, for integrations, for managed services. These are, of course, great businesses and good margin businesses for Rackspace Technology and the hyperscalers around the world, right? They continue to innovate. They're progressing now at such a pace that customers have lots of options and customers need help to handle the massive complexity of the multicloud environment.\n\nSo we're certainly continuing to double down on public cloud. And we need to do it certainly at the right margin, which is what Amar mentioned before. Now the other thing that I'll mention that we're seeing, and this is going to help with our strategy, is there's a trend toward customers wanting help beyond the infrastructure layer, right, into apps and data layers of the IT stack in particular. So that's usually a very high-value business for us.\n\nAnd then industry specialization is gaining traction as a defined need in the market. And then from a geographic perspective, look, multicloud continues to play a huge factor in what I'll call the technical revolution around the world, right? We're seeing strong demand in Europe, in Asia, in the South Pacific, in Latin America and in North America. So from that kind of the market, Bryan, I mean, from a customer perspective, I talked to a lot of customers. We're seeing some fascinating trends there.\n\nCustomers need talent. Customers are really struggling to find people with the skills they need to complete these complex cloud transitions. And we keep hearing from customers over and over. They're short for talent.\n\nThey need expertise. They need help to augment the staff. And they're seeing value in offerings like Rackspace Elastic Engineering, Rackspace Professional Services. We saw that in action with the recent win that we have with a large technology and media company, providing our cloud expertise as a service.\n\nAnd we had another big win with a U.K. banking firm leveraging Rackspace to supplement resources through a professional services agreement. And from other conversations, particularly in this economic environment, customers are trying to cut costs. So they need help from Rackspace to optimize their spend.\n\nAnd we've got financial spend optimization tools and practices that take advantage of our expertise to help customers actually reduce a lot of cost. And then finally, back to your question about public cloud, from a partnership perspective, the demand for the hyperscaler products is very -- it's going very fast. And the demand for multicloud is strong. Our new public cloud business unit leader, DK Sinha and I, we just visited the West Coast.\n\nWe met our partners out there. And I can tell you, AWS, Google, Microsoft are continuing to see massive increases in sales and revenue every quarter, had another $10 billion of new revenue in the second quarter alone. So this is exciting new growth for us. And our partnerships on the private cloud side with Dell and VMware, Dell and VMware continue to take us into customers.\n\nBig demand from customers for private cloud and multicloud as well. So partners continue to tell me, we value bringing Rackspace into the customer conversations early, right, if they're early, so we can shape the technical dialogue and then help customers get into execution mode. So overall, Bryan, strong demand environment, very encouraged by the opportunity.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nGot it. And just as a follow up, when you talk about the division into public and private cloud, there's going to be near-term disruption. Are you talking specifically about sales disruption? Or what exactly are you talking about? And the Analyst Day that was planned, I think, for September, maybe October, are we still on for that? Or is this just going to be kind of an update on the segments?\n\nKevin Jones -- Chief Executive Officer\n\nYes. Thanks, Bryan. So look, in terms of the disruption that we talked about, anytime you see a shift, you shift the sales organization, structure and its goals. So you're going to see some near-term disruption for long-term benefit, right? And with our restructure, we are realigning the go-to-market organization.\n\nSo we think it's prudent to plan for a little bit of disruption in the back half of the year as the teams kind of work through these changes. Now with that said, our leadership team is experienced, and we're confident that we're driving the company toward the right operating model. So as the go-to-market teams break the changes, the business is stabilized, we'll then accelerate. And as I've talked about, our partners expressed very strong support for the transformation we're making.\n\nUltimately, we're excited about these changes. They're going to be great for Rackspace Technology and aligning the company into two business units with clear accountability and ownership end to end. So that's a little bit about the transformation.\n\nAmar Maletira -- President and Chief Financial Officer\n\nYes. I'll take the Analyst Day question, Bryan. No, listen, we look forward to sharing more details on the financial profiles of both the public cloud and private cloud businesses. And currently, we are deep into the detailed planning of this realignment that Kevin talked about, and we'll begin the early stages of implementation of the new operating model in our fiscal Q3.\n\nSo as we speak, I think we would like to accelerate that transformation. Now once we have completed the planning phase, we can more accurately forecast the revenue and profit expectations of each of those business units. And I'll tell you, we are committed to providing the investors with more granularity on our performance, and we'll communicate more in the coming months. Thanks, Bryan.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nThanks for taking the question.\n\nAmar Maletira -- President and Chief Financial Officer\n\nThanks, Bryan.\n\nRobert Watson\n\nAll right. Sorry for the technical difficulties. [Operator instructions] Our next question comes from Bradley Clark from BMO, and then we'll go to Irvin from Evercore after that.\n\nBradley Clark -- BMO Capital Markets -- Analyst\n\nHi. Can you hear me, OK?\n\nRobert Watson\n\nYup, Bradley.\n\nBradley Clark -- BMO Capital Markets -- Analyst\n\nI wanted to ask a question about -- you mentioned that you're being a little bit more strategic on some of the public cloud deals you're going after. Specifically, it has to meet a better margin profile. I just want to understand, are you leaving deals on the table that, in the pipe, you're sort of walking away from? Or are you being more granular about what's going into the pipeline? And if so, how can we think about this being different than sort of past deals that Rackspace went after? Thank you.\n\nKevin Jones -- Chief Executive Officer\n\nVery good. Thanks for that, Bradley. I'll start and then Amar can add some color. So the first thing I should mention is we've created this public cloud business nearly from scratch over the last several years, and we scaled it to a point now that we're seeing a lot of success across all three hyperscalers, right? We're growing fast with Microsoft, with Google, with AWS.\n\nAnd what that's allowed us to do is to continue to go to market in different parts of the world with all three hyperscale. And it is allowing us to be more selective, right, and to make sure that we are pursuing deals that make the most sense for our customer and for the hyperscaler and for Rackspace. And this is the right time to shift that strategy. For the last three years, we've been building the business, and we had -- and still have a land and expand strategy.\n\nAnd look, if we'd landed in a particular customer account for -- with more of an infrastructure resale deal, and we've had it for a couple of years, and we don't see a lot of opportunity to get into higher-margin service offerings then it's prudent for us to look for other places to grow, if that makes sense. And this is possible now because we are scaled and scaling with all three hyperscalers, which is a great place to be. But Amar, I'll let you comment.\n\nAmar Maletira -- President and Chief Financial Officer\n\nNo, I think you said it very well. I think we are very, very focused on changing the mix of the business even within the public cloud business unit. And as Kevin mentioned, more focus on services. And as you see, even the customer journey is moving from more infrastructure as they go modernize their applications, as they move more data, they have to modernize data, their security offerings, and that's what we are focused on.\n\nSo it's all about selling higher-margin services and solutions into our public cloud installed base and also capturing new revenue stream. So we're very, very thoughtful and mindful on how we do that. So instead of leading with infrastructure with services is an attach. We're actually now leading with services with infrastructure as an attach.\n\nKevin Jones -- Chief Executive Officer\n\nWhere it makes sense.\n\nAmar Maletira -- President and Chief Financial Officer\n\nAnd that's the -- and where it makes sense. So that's the focus. And that's a change of focus. The demand environment remains rich.\n\nI do believe that there is a lot of opportunity going forward as we move up the stack.\n\nKevin Jones -- Chief Executive Officer\n\nSo we're moving up the stack. We acquired this company Just analytics, which has been a huge benefit for our global data business. We're continuing to expand into, as Amar mentioned, apps and security layers, leading with our tip-of-the-sphere professional services business, which performed really quite well in Q2. So that's a little bit of the shift if that makes sense, Bradley.\n\nAmar Maletira -- President and Chief Financial Officer\n\nNow as we go through this Bradley -- I'll just take this question and take it a little bit forward, right? So we are changing the mix of the business. We're looking at managed hosting business and OpenStack business declining. And where private cloud business is in a growth market. As Kevin mentioned, we see good demand in private cloud.\n\nWe have to capture the demand and public cloud, of course, is a secular growth market. So as we make all these shifts, we are going to balance growth and profitability. So if you look at our guidance for Q3, it reflects some of those. Plus there is FX headwind that we saw, plus we also saw a slower ramp in BT deal.\n\nBut if I look forward in Q4, as well as next few quarters, we do expect the core revenue growth trend that you see in Q3, basically continuing. So we should see low single-digit core revenue growth for the next few quarters as we make the shift happen. So ultimately, for us, we will be focused on revenue growth, but revenue is panicky, profit is sanity and cash is reality. And that's the reason we are very focused on generating good cash flow and good profitable growth for the company.\n\nRobert Watson\n\nAll right. Our next question comes from Irvin Liu from Evercore. And then Frank Louthan from Raymond James, you are up after that. All right.\n\nLet's go to Frank Louthan and then we'll circle back.\n\nFrank Louthan\n\nAll right. There we go. Sorry about that. Thanks.\n\nI lost audio for a minute, so you may have gone through this. But as you go through the transition, can you be clear kind of what areas are being restructured? Any change in the sales organization? And is -- are there any key positions you need to add too as you're making the transition?\n\nKevin Jones -- Chief Executive Officer\n\nVery good. Hey, thanks for the question, Frank. I'll start and then Amar can talk about some of the investments we're making and positions we're adding, etc. So if we're excited about this, we're on track with our reorganization across public cloud and private cloud.\n\nAs we've talked about, received really good feedback from our partners and our stakeholders, Amazon, Google, Microsoft, VMware, Dell Technologies, good feedback there. So where we are, we've completed the blueprinting phase and we'll be wrapping up the detailed design work and begin implementation this quarter. A big milestone was the hiring of our public cloud services leader, DK Sinha. And DK's got three decades of experience in scaling technology businesses and digital transformation.\n\nSo that was a big milestone. And then we've made excellent progress, I would say, overall, on the transformation, and we're on track. But let me just take a step back and just talk a little bit about why this transformation is so important for our company and our stakeholders. First of all, if you just look at the fundamentals of our business, they're very strong, right? And we will be uniquely positioned to win in two great markets, public cloud and private cloud.\n\nBusinesses are more agile when they're operating end to end, right? And that's what we're moving to. We're moving to an end-to-end model and public cloud and end-to-end model and private cloud. So when you're end to end, you can have faster decision making and you can accelerate progress across the board. And quite frankly, we've scaled our public cloud business so fast, it demands having its own business unit now.\n\nSo what this means is every employee in the company is going to be laser-focused on being the best in class for a public cloud and the best in class for private cloud. So this means we're going to have dedicated product teams, which leads to higher expertise across both portfolios. A simple, clear go-to-market model with accountability aligned to each business unit. And then another thing I'm really excited about is the collaboration and the goal alignment we're going to get between what the market wants, our sales teams, our product and service delivery team.\n\nSo we're going to have that closed-loop feedback process between those organizations, including, as you mentioned, our sales and go-to-market teams. So overall, pleased with the progress we're making, and I get more excited about this transformation every day. Amar, do you want to talk about the investments?\n\nAmar Maletira -- President and Chief Financial Officer\n\nYes. Yes. The investments that we are making here, Frank, just last quarter, if you recall, I did mention that we are planning a $15 million to $20 million of investments in the quarter to support both the growth acceleration in cloud services, as well as the start-up of a BT partnership. And as I noted in my prepared remarks, BT is ramping slower than we initially expected.\n\nSo some of the planned investments in Q2 are also slightly delayed. But we did execute on most of our planned investments, which includes, as I mentioned in my prepared remarks, retaining -- retraining and hiring delivery resources to support our public cloud services as well as some of the sales investments we are making in the Americas region. So based on the strong demand that we are seeing, we also have planned approximately about $5 million to $7 million of additional investments that are already baked in my Q3 guidance. And needless to say, we'll continue to manage investments more judiciously as we balance both profitability and growth given the strong market opportunity we have in cloud.\n\nFrank Louthan\n\nAnd are those investments you're making in personnel?\n\nAmar Maletira -- President and Chief Financial Officer\n\nYes, Frank, that is mainly in personnel.\n\nFrank Louthan\n\nRight. Great. Thank you very much.\n\nAmar Maletira -- President and Chief Financial Officer\n\nAll right. Thanks.\n\nRobert Watson\n\nIrvin, are you there and still want to ask the question? If not, we'll move on.\n\nIrvin Liu\n\nI am here. Can you hear me?\n\nRobert Watson\n\nYes.\n\nIrvin Liu\n\nSo yes, if I could tack on another question related to the overall realignment of your business around public cloud and private cloud. What percentage of your customers are both public cloud and private cloud customers? And then which of these two businesses do you see more prone to disruption?\n\nAmar Maletira -- President and Chief Financial Officer\n\nSo that's a great question actually. We did a very thorough analysis to see the overlap between the two segments. And the overlap is not big today, right? But it can be tomorrow. So the way we are designing the organization is if we see opportunities for a multi cloud in a particular customer, so one of the business unit will be the hosting business unit and will bring the other business units in.\n\nThe beauty of this model is, ultimately, we will be selling multi-cloud to our customer, but we will be doing that with very focused solutions across both public cloud and private cloud, and that's clearly a big advantage when we take the solution to the market.\n\nKevin Jones -- Chief Executive Officer\n\nThat's right. That's really well said. I would add, Irvin, we're getting the best of both worlds with this reorganization, right? I mean, on the one hand, we're able to offer multi-cloud solutions to customers, but we're going to have one salesperson per customer. So our salespeople will be incented to sell both public cloud and private cloud.\n\nBut their laser focus is going to be on their primary business unit where we want to make sure that we grow and grow profitably. So we've done lots of these reorganizations in our careers, and I think we found the perfect model for us. And it's made a little easier because we really only have two businesses here as opposed to some of the SIs, which got over 100 different types of service offerings. So very straightforward execution from a go-to-market perspective.\n\nWe will be offering multi-cloud offering one phase to the customer. But we're going to have, as a result of the focus, we're going to have the best in class in private cloud offerings and the best in class in public cloud offerings, therefore, the best in class in multi cloud.\n\nAmar Maletira -- President and Chief Financial Officer\n\nYes. And let me just add to this. As we realign the company and in particular, the sales organization that Kevin talked about, from a planning perspective, it's very prudent to plan for some near-term disruption. So our leadership has the runway to make the required changes and we can accelerate our transformation.\n\nAnd hence, we expect to grow moderately over the next few quarters as we pivot to this new operating model and execute our long-term strategy, again, to drive profitable growth.\n\nIrvin Liu\n\nAnd I wanted to ask another question on Q2. I may have missed this on the prepared remarks, but can you talk about how your bookings performance trended in the quarter? And just can you provide color on how overall bookings linearity trended as well?\n\nKevin Jones -- Chief Executive Officer\n\nSure. Sure. Absolutely, Irvin. I'll give you a little bit of color on our bookings performance for the second quarter.\n\nSo look, first of all, it was the third highest bookings quarter in the history of the company. Bookings in the quarter continue to be highly diversified by geography, by industry, by market segment. There were over 5,600 individual deals closed in the second quarter. We saw strong performance in our tip-of-the-sphere professional services business in both the Americas and the EMEA regions.\n\nAnd we had good traction with sales in our public sector business. Our managed public cloud service offerings, yes, they continue to be well received in the market, supported by these new offerings that we've launched. And the other thing that we're seeing, Irvin, is we're signing bigger deals, right? We're seeing increased deal sizes as customers are bringing larger workloads and purchasing multiple services. And our focus on higher-margin deals, balancing revenue and profitability, our focus there is driving good results.\n\nSo overall, very pleased with the quality of the bookings.\n\nRobert Watson\n\nOK. Thanks, Irvin. Our next question comes from Ryan Campbell from Barclays. Ryan, go ahead.\n\nRyan Campbell -- Barclays -- Analyst\n\nHi. Thank you for taking my question today. Would you be able to provide us some additional color on how pricing is structured in your contracts and how you're seeing wage inflation in the market right now?\n\nAmar Maletira -- President and Chief Financial Officer\n\nSo our pricing, I think one of the things that -- because the demand environment remains rich, we are not seeing any kind of pricing pressure, so to speak. I think this is a good market to operate from that perspective. And when it comes to labor, I will let Kevin talk about, we don't -- our model is not a labor-intensive model. We don't operate on the labor plus model.\n\nWe operate mainly on the labor minus model. By that, I mean we basically embed our technology automation with labor. And so from that perspective, we are not seeing labor inflation or cost inflation actually hit our -- have any pressure on the pricing side as such.\n\nKevin Jones -- Chief Executive Officer\n\nYes. I think that's well said. Yes, this is an interesting -- this is a great business because there's not a heavy labor model here. If you think about how we go to market, we go to market with our technology, specifically Rackspace Fabric, which is our software and IT platform.\n\nWe're automated 75% of the multi-cloud transactions, right? So that makes us have the highest automation in the industry. So we don't have a lot of heavy labor cost in our solutions. And in terms of pricing, because our solutions are standardized, we don't have a lot of pricing complexity. So it's a pretty straightforward type of pricing model.\n\nWe standardized it. We've got an excellent CFO organization to make sure that we're pricing at the right margins and price to win. So very -- compared to the industry and certainly my three decades of experience in this industry, very standardized pricing, not very labor intensive, automated kind of base platform that we use to differentiate and to win.\n\nAmar Maletira -- President and Chief Financial Officer\n\nSo Ryan, I'll take this opportunity also because the pricing typically in some other -- when we look at our competitors, who are very labor focused or labor intensive, pricing does impact the gross margins. In our case, we do not have impact from pricing on our gross margin. It's mainly mix related. For example, in Q2, we are very pleased with our 30% gross margins that we landed.\n\nIt was because we managed the mix of the business it was a very favorable mix. In Q3, we expect the gross margins to be around 27% because we are seeing the impact of mix as well as the investments we are making and onetime costs, especially on the data center side that is impacting our gross margins. Nothing to do with pricing, right? So this is about 27% gross margins. We expect that gross margin to be around 26% in Q4.\n\nAnd in fiscal '23, even that we are making this mix shift to from low margin to high margin, it will be in a transition phase, and we expect our gross margins to be mid-20%. So low single-digit core revenue growth with mid-20% gross margin plus or minus one percentage point.\n\nKevin Jones -- Chief Executive Officer\n\nFor 2023.\n\nAmar Maletira -- President and Chief Financial Officer\n\nFor 2023.\n\nRyan Campbell -- Barclays -- Analyst\n\nGreat. Thank you very much.\n\nAmar Maletira -- President and Chief Financial Officer\n\nAll right, any other questions? Robert?\n\nRobert Watson\n\nNo, there's no more questions, Amar.\n\nAmar Maletira -- President and Chief Financial Officer\n\nAll right, thank you very much, everyone, for joining our call today.\n\nDuration: 0 minutes\n\nRobert Watson\n\nKevin Jones -- Chief Executive Officer\n\nAmar Maletira -- President and Chief Financial Officer\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nBradley Clark -- BMO Capital Markets -- Analyst\n\nFrank Louthan\n\nIrvin Liu\n\nRyan Campbell -- Barclays -- Analyst\n\nMore RXT analysis\n\nAll earnings call transcripts"
}