{
  "companyName": "iCAD",
  "companyTicker": "ICAD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/icad-icad-q2-2022-earnings-call-transcript/",
  "content": "iCAD (ICAD 8.28%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to iCAD, Inc. second quarter 2022 earnings call. At this time, all participants have been placed on a listen-only mode, and we will open the floor for your questions and comments after the presentation. It is now my pleasure to turn the floor over to your host, Tony Takazawa, director of investor relations.\n\nSir, the floor is yours.\n\nTony Takazawa -- Director of Investor Relations\n\nThank you, operator. Good afternoon, everyone. Thank you for joining us today for iCAD second quarter 2022 earnings conference call. On the call today, we have Stacey Stevens, our president and chief executive officer; and Steve Sarno, our interim chief financial officer.\n\nBefore turning the call over to Stacey, I would like to remind everyone that we will be making forward-looking statements on the call today. These forward-looking statements are based on iCAD's current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from these expectations. For a list of factors that could cause actual results to differ.\n\nPlease see today's press release and our filings with the U.S. Securities and Exchange Commission. iCAD undertakes no obligation to revise or update any statements to reflect events or circumstances after the date of this conference call. I would also note that management will refer to certain non-GAAP financial measures.\n\nManagement believes that these measures provide meaningful information for investors and reflect the way they view the operating performance of the company. You can find a reconciliation of our GAAP to non-GAAP measures at the end of the earnings release. With that, I'll turn the call over to Stacey. Stacey?\n\nStacey Stevens -- President and Chief Executive Officer\n\nThank you, Tony, and good afternoon, everyone. I will begin with some high-level comments on the market environment and how this affects our current and potential customers. I will then discuss our second quarter results and provide further granularity around the key areas of focus for the company for the remainder of 2022. The market environment we have seen over the last quarter is consistent with what many companies across the healthcare industry have been experiencing and reporting.\n\nWhile access to customers has improved, customer challenges with respect to capital budgets, critical staffing shortages and supply chains remain. There are also a range of other economic concerns such as rising inflation, the threat of recession, and overall uncertainty that are continuing to affect current and future customers. While demand for our technology continues to be strong and customers are still spending, they are doing so more carefully, increasingly accounting for a range of factors with purchasing decisions such as ease of procurement, measurable productivity improvements, and lower upfront costs. This is ultimately driving the beginning of a pronounced and exciting shift in our business.\n\nAs in recent months, we are seeing a marked increase in demand from monthly subscriptions and other operational models in lieu of traditional perpetual licenses. The subscription model and other operational models have many compelling business and financial positives associated with it. First, lower upfront cost reduces the barrier to entry for customers and can and has accelerated customer acquisition. Subscription payments are also generally expensed by customers, which means that they can avoid what typically can be a lengthy and uncertain capital budget approval process.\n\nThis option not only makes it easier for customers to adopt our technology sooner, it also offers opportunities for recurring monthly billing, which is clearly a more predictable ongoing revenue stream. The long-term value of these subscription customers is far greater than a one-time license sale, and this value extends to the customer, too, as it offers them access to annual algorithm upgrades, which typically include clinical or performance improvements, as well as the ability to easily add new functionalities such as ProFound AI Risk, our personal risk assessment solution, without costly capital outlays. It is also much easier to offer proof-of-concept trials with this method, which enables us to gain new customers rather quickly after they have experienced the capabilities of our technologies firsthand. As previously discussed, we anticipated the shift in the market and began testing the subscription model earlier this year.\n\nI am pleased to report that interest in this option has grown at a faster-than-expected rate, and in order to meet this rapidly growing customer demand, we accepted more monthly subscription deals than we were expecting in Q2. In fact, one-third of our European business in the quarter came in under this new model, as well as a number of U.S. deals, which began in Q1. While our short-term revenue was lower than originally anticipated, we acquired more new customers in Q2 than in Q1, and these customers can generate significantly more long-term revenue than if they had been a perpetual license customer.\n\nOverall, the benefits of moving to the subscription model are compelling, and there is a long history of software companies making the shift to the benefit of their businesses and shareholders across a spectrum of industries, although it has taken longer for this shift to occur in the healthcare realm compared to others, it appears to be accelerating rapidly as the adoption of SaaS-type models in healthcare is reportedly growing at a rate of 20% per year. At iCAD, we have been anticipating this shift and planning for it accordingly, preparing our customer offerings and configuring our business as necessary. We believe these dynamics will continue to propel us toward this better business model, create over time a large installed base of customers, generating recurring revenue for the long term, and position the company for even greater sustained success in the months and years ahead. While the long-term business benefits of this model are clear, software companies that move from a perpetual license model to a subscription model do typically have a hurdle to overcome as they make the transition.\n\nThis is a short-term impact to reported revenue as they move previous larger one-time revenue to relatively smaller but predictable recurring monthly subscription payments. While all of the benefits of the model begin immediately, there is a challenge of the reported optics of reported revenue as subscription becomes a larger proportion of the business, and we experienced this phenomenon in the first half of 2022. At the halfway point of the year, our reported revenue was impacted by the introduction of the subscription model and the sale of 31 subscriptions. Just over half of these were ProFound AI and the remaining mix were our Density and Risk solutions.\n\nWhile the optics of this in the short term contribute to lower reported revenue, we acquired more customers in the first half of 2022 than in 2021. And now these customers will generate long-term recurring revenue and their value is therefore much higher. There is also a difference in the timing of how we recognize the revenue on subscriptions. Unlike with the sale of a perpetual license where we typically recognize revenue upon shipment, subscriptions are recognized at installations, which typically lag shipment by six to eight weeks.\n\nSo, the majority of our subscriptions in Q2 have not yet been fully recognized as they installed late in the quarter. However, we are confident that we are on the right path. Not only will we continue to reap long-term benefits from these relationships, we are helping customers improve patient care expanding the total addressable market, expanding access to our technologies, and laying the groundwork for continued success and predictable revenue streams in the months and years ahead. As mentioned on our last call, we are currently experiencing an important inflection point in our business.\n\nWe plan to continue to leverage the strength of our robust portfolio of powerful solutions throughout the rest of 2022 and beyond by expanding access to these technologies, aggressively targeting broader market opportunities, and offering more flexible ways for our solutions to meet customer needs. Now, turning to Q2 overall. iCAD's total revenue was $7.6 million, not including the subscription impact I described earlier. This result was impacted by a number of factors I mentioned, including the faster-than-expected ramp of the subscription model on the Detection side of the business, a somewhat slower ramp from both the U.S.\n\nand OUS IORT side of the business, and the generally challenging market environment. Detection revenues were $5.3 million, up 10% when compared to Q2 of 2021, not including the impact from the subscription deals. Therapy revenue was $2.3 million, impacted primarily by a decrease in IORT deals, again, both in the U.S. and OUS markets.\n\nWe managed our expenses well in the quarter and burned significantly less cash relative to Q1. Steve will provide more granularity on these elements. Regarding our Detection business, iCAD's Breast AI portfolio offers world-class solutions to overcome some of the most pressing challenges hospitals are facing today, including performance variability across imaging teams and increasing volume of workload, critical staffing shortages, and physician burnout. These technologies continue to offer unparalleled clinical performance, along with market-leading multi-vendor flexibility.\n\nAs demand for operational models grew, we were pleased to see positive performance from some of our partners in the quarter, including Arterys, who is one of our partners, serving our customers who today desire a full cloud-based model. In recent months, we have introduced a new sales strategy, positioning our triad of high-performing suite of AI solutions as a singular and complete solution for superior breast cancer detection, breast density assessment, and personalized short-term risk evaluation. While each is a compelling product on its own, we believe using the complete suite of these products offers an unmatched value proposition to clinicians and patients. This strategy also helps us to improve penetration of our Risk and Density products into the marketplace with a differentiated offering, and we are seeing increased interest among new customers in the trio of products with more new customers opting for the full suite at the outset.\n\nAs more clinicians employ the use of these technologies in clinical practice, we are learning more about the real-world benefits they offer to facilities, physicians, and patients. Our latest webinar and our ProFound Insight, ProFound Impact series, which had record attendance, truly brought this concept to life as it featured several compelling case studies presented by leading experts and radiologists who have been using ProFound AI, PowerLook Density Assessment, and ProFound AI Risk daily. These case studies not only demonstrate how clinicians are using all three technologies to find cancer earlier but also the life-changing impact it is having on patients. Additionally, the body of evidence supporting our Breast AI suite continues to grow with compelling new research supporting ProFound AI Risk published in a peer-reviewed journal, Science Translational Medicine last quarter.\n\nIn a multi-ethnic study involving more than 154,000 women at four screening sites, researchers from the Karolinska Institute found ProFound AI Risk is 2.4 times more accurate than traditional lifetime Risk models. Using U.S. guidelines, ProFound AI Risk from 14% of women studied who had a negative screen had almost 20x higher risk of developing breast cancer in the next year than the general risk population. This individualized short-term risk model offers critical and actionable information that can help clinicians personalize breast cancer screening regimens for patients based on their individual risk of developing cancer before or at their next screening.\n\nThe findings from this study were so compelling that media took note. HealthDay, the world's largest syndicator of health news and content, covered the study with an original article that was subsequently picked up in dozens of consumers and trade media outlets, reaching a total potential audience of more than 33 million. Influential trade media, such as Medscape, Imaging Technology News, and Fierce Biotech also covered this news. We also made progress across our other major initiatives last quarter, including sales force optimization penetration of the broader available market, and improving our ability to address enterprise-level customers.\n\nIn fact, today's pipeline of enterprise customers is larger than at any other time in history. Although the revamp of our new sales team is not yet complete, some of these new sales force hires are beginning to make a positive impact with one of these new team members ranking as one of our highest performing reps in Q2. We are continuing to rebuild our sales force with additional team members, and we have not yet fully realized the impact of our new hires as some territories remained open in Q2, and some of our new hires just began in their territories in Q2. We have also recently made strides in our efforts to more fully penetrate the broader market.\n\nWhile some gantry makers' current struggles with supply chain may limit our opportunity to sell into new installations, we are seeing continued success selling into the large installed base of 3D mammography systems. For example, in Q2, we won a large enterprise order at Saint Luke's Health System in Kansas City. This is a competitive account who really saw the differentiated value of iCAD's technology. We see great opportunity in this broader market, and we expect continued success moving forward as we leverage our targeted sales efforts, superior technology, and flexible procurement options.\n\nAnother key aspect of our plan is to better address the needs of enterprise-level customers. These customers represent a very important opportunity as they generally represent larger installations with longer-term strategic partnership opportunities. As a percentage of our total opportunities, these types of opportunities continue to grow, and demand for operational models is particularly strong in this segment. We were also pleased to secure another large order in Q2 from the same world-renowned academic institution I spoke about on the Q1 call.\n\nNow, turning to our Therapy business. Revenue in this segment was led by our dermatology sales, which improved as expected from a depressed Q1. As you will recall, Q1 revenues were impacted by the restructuring of one of our dermatology partners during the quarter. This partner has completed their initial financing and while we experienced improved business in Q2 versus Q1, they are really just starting to gain momentum.\n\nEnd-user demand for our Xoft technology is high, and the dermatology segment and the reimbursement environment remains positive. We are now nearing completion on an expanded body of skin clinical data with the pending publication of updated 5-year follow-up data, which has outstanding results in terms of recurrence rates. Our partners are ramping up, and we expect more robust results in the second half of 2022. We also continue to progress our multinational clinical trial studying the use of our technology in treating brain cancer and expect to add new European sites into the trial in Q3.\n\nWe remain optimistic about the impact this technology will have on patients with this deadly cancer. Next, I would like to introduce Steve Sarno, who is appointed as our Interim CFO in May. Steve brings a tremendous amount of experience to the company as he previously served in CFO roles at both private and public technology organizations, including software companies offering SaaS-based models. We selected Steve specifically for his experience and expertise in transforming companies from a perpetual model to a SaaS-based model.\n\nWe welcome Steve to the team and look forward to continuing to work together as we continue to scale our business, enhance our team, and drive increased shareholder value. Steve?\n\nSteve Sarno -- Interim Chief Financial Officer\n\nThank you, Stacey, and good afternoon, everyone. As Stacey discussed, the growth of subscription revenue, while positive for our business, will have an impact on our reported revenues as we transition to a hybrid perpetual/subscription model to ensure that everyone has an understanding of how we expect subscription revenue to affect our business over time, and we'll spend a few minutes walking through a simplified example. As you may know, with the perpetual license sale, the customer makes a one-time payment to purchase software and essentially owns a right to use that software in perpetuity. A subscription license is different and that the customer makes ongoing payments for the right to use the software and needs to renew the subscription at its end in order to continue to use the software.\n\nWe have included two slides as an example within today's press release to help illustrate the revenue streams from each model. In the illustrations, we compare the revenue profile of a perpetual license model versus a subscription model over a hypothetical six-year period. The example assumes a perpetual license cost $30,000 and that a subscription cost $1,000 per month or $12,000 per year. We also assume that there is only one license sold to beach type on January 1 of each year.\n\nNote that these are just examples and do not represent our actual revenues, expected revenues, or pricing. In the perpetual section of the example, there is one license sold each year for $30,000, and all of the revenue is recognized upon the licenses delivery in that year. There is no additional license revenue from that sale as the customer has the perpetual right to use the software. For each subsequent year, there is one additional license sold and total revenue, again, is $30,000 per year.\n\nIn the subscription portion of the example, the Year 1 subscription assumed to be a three-year term license, is recognized over time at $1,000 per month or $12,000 in revenue for each year. The revenue in Year 1 is, therefore, $12,000. In the second year, the Year 2 subscription is sold and recognized as $12,000 that year. In addition, the second year of the Year 1 subscription recognizes another $12,000 in subscription revenue.\n\nThe total subscription revenue earned in Year 2 is, therefore, $24,000, representing $12,000 earned from each subscription sold to date. Following on to that example, $36,000 would be recognized in Year 3. In Year 4, the Year 1 license is assumed to renew at an estimate of 90% of its original rate and it's this renewal feature that is the main driver of the additional revenue that makes a subscription more desirable than a perpetual license. As you can see going out through Year 6, the subscription licenses and the renewals should outperform a perpetual model.\n\nThere are two key takeaways from this illustration. First, the long-term value of subscription revenue has the potential to be significantly greater than the perpetual license model as the subscriptions renew. The second takeaway is that in the first few years of adopting a subscription model, revenue is less than it would have been under a perpetual license model until an inflection point is reached. Beyond the inflection point, the subscription revenue should begin to exceed the perpetual revenue.\n\nAlthough the early revenue from subscriptions is lower, the number of licenses sold is the same. And the key difference is that perpetual licenses are recognized when delivered, while subscriptions are generally recognized over time. As Stacey mentioned earlier, we are moving toward a subscription model because our customers are increasingly expressing interest in the benefits of a subscription option, and we believe that a subscription model will represent a more stable recurring revenue stream for iCAD with the potential for significantly greater revenue over time through renewals and the ability to sell in other products through greater customer contact. While we didn't discuss maintenance in our simple illustration, ongoing subscriptions and their renewals represent a much better revenue stream than relying on customers to sign up for maintenance every year.\n\nThis has an additional customer benefit and that the customer and their patients will always have access to our most up-to-date software, enabling better clinical outcomes. As we expand our subscription offerings, we expect we will see a reported revenue decline in the short term, not from less interest in our AI software or the sale of less licenses, but from the difference outlined earlier in how each model recognizes revenue. We're hopeful this illustration will assist you in better understanding our transition of a portion of our perpetual business to a subscription model and the impact that it will have on our revenue over time. I'll now summarize our financial results for the second quarter ended June 30, 2022.\n\nOn a GAAP basis, our total revenues for the quarter were $7.6 million, a decline of $0.2 million or 3.2% from the second quarter of 2021. Our Detection segment revenue was $5.3 million, up 10.4% from $4.8 million last year. Within Detection, our Q2 product revenue was $3.5 million, up 9.6% versus Q1 of 2021. Our Detection service revenue was $1.8 million, up 12.1% over the prior year.\n\nRevenue for the Therapy segment was $2.3 million, down $0.8 million or 24.7% versus the $3 million earned in Q1 of 2021. A portion of the shortfall is due to international customers and distributors that appear to have been more severely impacted by COVID than some of our U.S. customers and distributors. Also, as a result of some of the financial weakness we've seen in the Therapy business outside of the U.S., we have elected to take some revenue outside the U.S.\n\nat the point that cash is received versus at the time the customer takes legal title of our products. Therapy product revenue was $1 million, down 27.4% year over year, but up almost 45% sequentially as the business begins to recover. Services revenues were $1.3 million, down 22.5% year over year. Moving to gross profit.\n\nOur gross profit dollars in Q2 were basically flat with Q2 a year ago at $0.5 million. On a percentage of revenue basis, our gross profit for the second quarter of 2022 was 72.5%, an increase of 70 basis points from the 70.8% achieved in the second quarter of 2021, with the increase mainly related to mix between the Therapy and Detection segments. Total operating expenses for the quarter were $8.6 million, representing an increase of 2.3% from $8.4 million a year ago. About half of this increase was due to engineering and product development expense with the other half coming from general and administrative expenses.\n\nWe remain committed to managing operating expenses in 2022's highly inflationary environment, especially in regards to people, outside services, and supplies. We are committed to investing in research and development efforts, which we believe will yield the greatest outcomes and returns for our investors and supporting revenue growth. Our Q2 operating loss was $3.1 million for the quarter ended June 30, 2022, representing an increase of $0.2 million or 6.7% versus $2.9 million last year. The increase of $0.2 million was the result of the $0.2 million increase in operating expenses previously discussed.\n\nOur GAAP net loss for the quarter was $3.1 million or a loss of $0.12 per basic and diluted share compared with a GAAP net loss of $3.3 million or $0.13 per basic and diluted share for the second quarter of 2021. On a non-GAAP basis, our net loss for Q2 was $3.1 million or a loss of $0.12 per basic and diluted share compared with $2.8 million or a loss of $0.11 per basic and diluted share in Q2 a year ago. The main driver of the difference in non-GAAP net loss was due to a loss of $0.4 million on the extinguishment of our debt in Q2 of 2021. Our Q2 non-GAAP adjusted EBITDA this quarter was a loss of $2.7 million versus $2.1 million a year ago.\n\nMoving to the balance sheet. As of June 30, 2022, we had cash and cash equivalents of $27.2 million, a decrease of $7.1 million compared to cash, cash equivalents of $34.3 million at December 31, 2021, and $37.9 million at June 30, 2021. Cash and cash equivalents used during the second quarter of 2022 was $2.6 million, compared to $4.5 million used in the first quarter of 2022. The quarter-over-quarter decrease in cash usage of $2.6 million was mainly due to the smaller Q2 net loss of $3.1 million less $1.1 million added back for noncash items such as stock-based compensation, depreciation and amortization, and $0.6 million net balance sheet usage, mainly related to accounts payable and inventory.\n\nAs of June 30, 2022, we had outstanding receivables of $10.2 million versus $11.1 million a year ago, and $10.3 million at March 31, 2022. We are actively working to decrease our outstanding accounts receivable in the second half of 2022. This concludes the financial highlights of our presentation. I would like to now turn the call back over to Tony to lead the Q&A.\n\nTony Takazawa -- Director of Investor Relations\n\nThanks a lot, Steve. Matthew, can we open up the line for questions, please?\n\nOperator\n\nCertainly. Ladies and gentlemen, the floor is now open for questions. [Operator instructions] Your first question is coming from Per Ostlund from Craig-Hallum. Your line is live.\n\nPer Ostlund -- Craig-Hallum Capital Group -- Analyst\n\nThanks. Good afternoon, everybody. I appreciate the color on the shift involving subscription and seemingly the accelerating interest in that plan, in that model. And I know you're not going to want to answer this question or try to answer this question every single time.\n\nBut just considering where we modeled the quarter, and I think kind of where others had modeled the quarter, is there any way to -- and I'm not asking for precision, but to kind of handicap where the Detection revenue would be, were the sales all perpetual? And I know that that's not fair because some of those subscription model customers wouldn't be perpetual model customers. But I'm kind of curious if there's any way that we can kind of frame that number because I think it's very logical. And I think we can -- most of us that know that the shift was coming, can appreciate it. Just trying to get a handle on what the numbers might have looked like if this was a \"normal\" perpetual environment.\n\nSteve Sarno -- Interim Chief Financial Officer\n\nSure, Per. Thanks for the question. It's really difficult to answer because there's a lot of hypotheticals in answering that, which -- we're really kind of bound there and not being able to make some of those assumptions. But it would the number of licenses, what would the average selling price of those licenses be, and the timing of that sort of thing.\n\nSo, it's -- I know Stacey did state the number of licenses in the first half of the year. And then essentially, you'd have to make your own assumption around the average selling price. I think we can say that of those 31 licenses, they're not all the PowerLook licenses that would have the kind of the higher dollar amount. There's some licenses that are more ancillary that would be included as well.\n\nStacey Stevens -- President and Chief Executive Officer\n\nSo, I think another way to think about it, Per, is that if you look at the 31 subscriptions that we sold, about half of those were ProFound AI licenses, right, just over half. and the other half were a mixture of Density and Risk Assessment, right? And as you know, the Density and Risk Assessment carry an average selling price that is about half of what a ProFound AI license is. The other thing you got to take into consideration is that, as I said in the script, the timing of how we resurrect subscription is very different from perpetual, right? So, from perpetual as long as it leaves our dock, right, we recognize it in the quarter where on subscriptions, we don't recognize the revenue until it's installed at the customer site. So, really, unless we get an order in the first month of the quarter, we're not likely going to recognize any revenue from that subscription customer until the next quarter.\n\nright? And that certainly was the case in Q2, right? So, we're not nearly recognizing what came in, in Q2 because of the timing of the business coming in under subscription, more in the later part of the second quarter.\n\nPer Ostlund -- Craig-Hallum Capital Group -- Analyst\n\nOK. Yeah. That's all very fair. And, Steve, I appreciate your use of the word hypotheticals.\n\nI know that it's rife with hypothetic pole and so that's why, candidly, I had the caveat of it, not really being a fair question. I just -- I think it bears people hearing it again because I think there is going to be the notion of where the number came in versus where the number that folks like myself had modeled, and I don't know that it seems like the answer is somewhere in between. So, that makes sense. Stacey, when you talked in your prepared remarks about customers being interested in the suite of products, you've talked in the past about having a bundled offering.\n\nAnd curious if that's kind of how you're positioning it to customers? And have you arrived at a bundled pricing model? And to the extent that folks are interested in subscription, are you at a point yet where you're offering bundled pricing in a subscription situation as well?\n\nStacey Stevens -- President and Chief Executive Officer\n\nYeah. Thanks, Per. It's a great question. So, what I would say is that we launched the bundled pricing in Q2, right? So, it was really our first quarter that we were going out in full force with the bundle.\n\nAnd so, it's a little bit early to be seeing the success from that due to our sales cycle timing. But one way, I think, to measure it is to look at the quotes that we have out there, right? And we have a significant increase in customers who not only are getting quoted ProFound AI but are also getting the bundle with Risk and Density attached to it, right? And right now, as we kind of look forward, it's at least half of our overall quotes that are going out the door. So, that's a really positive trend, right? And we'll begin to see results from that in Q3. The other thing is that as we have more of our customers going into a subscription model, it's actually easier to add Density and Risk, right? Because they're paying a monthly payment and we won't get into the specifics about the pricing for competitive reasons, right? But it's a lot easier to add on the full portfolio in sort of a package format and convince that customer that if they're going to get on the subscription, they want to have the full value of the full portfolio, not only now that as new clinical performance and workflow enhancements are added to it, right? So, that's another way where we think more and more will be packaging the entire portfolio as opposed to just selling ProFound AI on its own for the most part.\n\nPer Ostlund -- Craig-Hallum Capital Group -- Analyst\n\nOK. Very good. I will ask one more, and then I will cede the floor. So, I think last quarter, Stacey, you talked about the sales force realignment as being something -- I think the words were one hire away.\n\nYou talked in today's prepared remarks about several -- at least it sounds like multiple territories are still open. So, is one hire away still the mantra, or was this actually maybe an opportunity to carve out more territories to try and get more boots on the ground?\n\nStacey Stevens -- President and Chief Executive Officer\n\nYeah. So, it's really been a little bit of a mixed bag here, right? So, at the time of the last call, we did have one open territory. Subsequently, we did have some attrition in the sales force, and we actually had one rep go out in the quarter, majority of the quarter with a major health issue, right? So, we really were only operating in Q2 with seven reps for the majority of the quarter. And so, now we're working to build back those territories, right? But really, we're operating in a very challenging market environment, right? So, I would say that sourcing sales talent and building our pipeline of talent is not a fixed project, right? That's going to be an ongoing initiative, right? And we expect that there could be in this environment, more attrition as we go forward, right? So, we're not looking at it as something that we're sort of done with, right? Even though still today, we have one open territory, it's a different one from the one that I spoke about on the Q1 call.\n\nBut still, we're continuing to look for the very best talent in the industry, right? And if we find some superior talent, we may decide to bring in that rep, right, and potentially look at a different way to carve territories or create new positions, right? But we're always going to be in an ongoing process of finding the absolute best talent in the industry.\n\nPer Ostlund -- Craig-Hallum Capital Group -- Analyst\n\nOK. Excellent. Thanks for all the color. I appreciate it.\n\nStacey Stevens -- President and Chief Executive Officer\n\nOf course. Yeah. Thanks, Per. Next question, please.\n\nOperator\n\nCertainly. Your next question is coming from Marie Thibault from BTIG. Your line is live.\n\nSam Eiber -- BTIG -- Analyst\n\nHi. Good afternoon, everyone. This is Sam Eiber on for Marie. Maybe I can just follow on this theme here of the subscription model and Stacey and Steve, really appreciate all the color and details on that.\n\nBut maybe as we think about it on a go-forward basis, how should we think about maybe the mix here? Obviously, it seems like things have really accelerated the past couple of months. So, maybe should we expect that to continue as some of these macro pressures on capital budgeting persist here?\n\nStacey Stevens -- President and Chief Executive Officer\n\nSo, we do expect it to continue to increase, Sam, right? It's not going to be a light switch, and we're not going to see a situation where the entire business flips into this model. There are certain parts of our business, for example, our OEM business right, which represents today about 30% of our overall Detection business. Those areas are where we have contractual arrangements with our OEM partners, and those are contractual arrangements for licenses, right? And then we still think that the biggest portion of the business will continue to be licenses, but we are expecting it to continue to increase as we go forward every quarter. And in fact, some of our largest enterprise deals are very interested in this model, right? So, it's hard to say, depending on the timing of those, what percentage it will be, but we do know that it is increasing, and we also know that there's still going to be a substantial part of our business that will continue to come in under a perpetual license that will be recognized upfront.\n\nSam Eiber -- BTIG -- Analyst\n\nOK. That's helpful. And then maybe just one more on top of that. As that gets -- becomes a bigger part of the business, will we start to see maybe that be broken out as you report quarterly metrics?\n\nSteve Sarno -- Interim Chief Financial Officer\n\nIt's certainly something that we'll consider probably once it gets over a certain threshold. And my thought would be we probably wouldn't consider it before the end of the year.\n\nSam Eiber -- BTIG -- Analyst\n\nOK. And then maybe just one more. And, Stacey, you kind of just alluded to this, is the type of customers that are maybe more interested in the subscription deal. Is it really more just those large enterprise customers that, you know, we know this new sales force is really going out to try to tap into?\n\nStacey Stevens -- President and Chief Executive Officer\n\nYeah. So, what I would say is that it's across the board. There's no one single customer definition that is interested in the subscription model, but we are seeing more and more of our enterprise customers really trending toward this model, right, and really wanting to engage in a relationship with the company for the longer term, right? And to really benefit from what now is a clearly established track record that we have of launching at least one new major algorithm improvement each year, right? So, the attractiveness of getting in under the subscription, not having to worry about some of the capital budget constraints, right? There's still a lot of distractions at the enterprises with particularly some of the critical staffing shortages. And our products more than ever, customers are focusing on the workflow and efficiency gains every bit as much as the clinical games, right? So, there's just a lot of attractiveness, right, to locking in with a long-term relationship with the company that has an established track record in the industry that has the commanding market share, right? And so, the trend is definitely accelerating in that direction, although there are all different types of categories of customers who are choosing this from the very smallest to the very largest.\n\nSam Eiber -- BTIG -- Analyst\n\nGreat. Appreciate the added color there. Thanks for taking questions.\n\nStacey Stevens -- President and Chief Executive Officer\n\nThanks, Sam.\n\nOperator\n\nThank you. Your next question is coming from Frank Takkinen from Lake Street Capital. Your line is live.\n\nCharlie Montang -- Lake Street Capital Markets -- Analyst\n\nHey, guys, this is Charlie Montang on for Frank Takkinen. And then just one question for me. Last quarter, one of our derm partners or one of you guys' derm partners underwent restructuring. What is the status of this partner? It also sounded like this partner could be a solid growth contributor going forward.\n\nDoes this remain the case?\n\nStacey Stevens -- President and Chief Executive Officer\n\nYes. So, the particular partner that we referenced on the Q1 call did complete an initial financing round and did do business with us in Q2. However, we're just really getting started, right, relative to that partner. And we also expect another one of our partners to accelerate in the back half as well.\n\nI think the really important point here is that there is very strong and growing end-user demand for the dermatology system. So, the way it works is that we sell our unit and a source and service agreement to our partners and then they craft a joint venture with the dermatologist, right, and kind of sharing some of the revenue that comes from that, right? And we help them to find some of these end-user customers, right? And we're even seeing some of our dermatology customers who were treating with our technology maybe four or five years ago who now are deciding to get back into the treatment. Now, that reimbursement has stabilized and is attractive and its competitive relative to other competing treatments, we are seeing increased interest in getting back to that treatment. So, we made a step in the right direction.\n\nThe business did rebound on the dermatology side, but we still think there's quite a bit of room to go in the second half of the year and expect to see the dermatology segment improve even further over the next couple of quarters.\n\nCharlie Montang -- Lake Street Capital Markets -- Analyst\n\nGreat. Thank you for the clarity.\n\nStacey Stevens -- President and Chief Executive Officer\n\nSure. Thank you.\n\nOperator\n\nYour next question is coming from Francois Brisebois from Oppenheimer. Your line is live.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nHi. Thanks for taking the question. Just a couple here. What is the -- what -- I guess what would be the biggest obstacle in switching the customer from license to subscription? And how long do we expect it to take to basically get to a point of steady state where maybe 10% of the business is licenses and the rest is subscription? Just how long can this transition last?\n\nSteve Sarno -- Interim Chief Financial Officer\n\nSure. I mean, there's a number of obstacles, training the sales force to sell those when they're used to selling perpetual is probably one of the biggest obstacles, and then also just getting out there that we have these available as a lot of people just think of us as selling perpetual licenses. And I think over time, this transition, I've seen it before where it tends to start out slow and usually will gain momentum over time. So, we're in the early stages of it and monitoring it closely, but we're very optimistic about it.\n\nStacey Stevens -- President and Chief Executive Officer\n\nYeah, absolutely. And I think it's important to note that even in Q2, we had not yet fully unleashed our sales team to go after the subscription kind of component of the market, right? We saw that there was growing demand. We did position this in some deals, right? But I think some of our customers didn't even realize that this was an option to be offered from iCAD, right? And there was at least one deal I know of where we almost weren't even invited to the deal because we were perceived as only offering perpetual licenses. So, the ground is shifting underneath us in terms of customer demand for these operational models, and we have to respond quickly.\n\nSo, we did make a pretty rapid pivot in Q2, but still not at the point of really having our sales team go after -- we were still trying to maximize revenue, upfront revenue, through the perpetual license. So, we didn't go after as much opportunity as we now will in Q3 and subsequent quarters. So, I think we're really optimistic about this. It's going to open up the broader addressable market.\n\nIt's going to allow us to compete in deals where we never would have been able to otherwise. We're going to win customers sooner than we would otherwise. And some of this is definitely going to be incremental business, so we absolutely would not be able to win without the subscription model.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nOK. Great. And the OEM partners that you mentioned like licenses more, what's the reasoning for that? Why would someone prefer a license?\n\nStacey Stevens -- President and Chief Executive Officer\n\nIt's really not a question of preference, right? With the OEMs, we just have contractual arrangements where we transfer a software license to them and then they bundle it with their hardware and sell it to the customer. That could change over time, right? That could change as the market changes and maybe down the road, our OEM partners may prefer more of an operational model. We'll have to work through that. But for now, that's the way we're transacting business with our OEM partners.\n\nSo, for that third of the business that it represents today, I don't see that changing in 2022.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nStacey Stevens -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question is coming from Yale Jen from Laidlaw. Your line is live.\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nGood afternoon, and thanks for taking the questions. Yeah. Hi. How are you? And the first question I have is that in terms of the recent subscriptions that do you have the one also in ProFound AI Risk or purely just ProFound AI at this point?\n\nStacey Stevens -- President and Chief Executive Officer\n\nYes. So, if you look at the 31 subscriptions that we sold in Q2, about half of those subscriptions were ProFound AI and the other half of them were Density, breast density software, and Risk. So, there is Risk in some of those subscriptions in Q2 and we expect that to continue to grow as a percentage of the overall total as we go forward.\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nAnother follow-up question here is that, given that the perpetual customers can use the software forever, except in terms of additional service revenue, service fee they need to pay. So, almost all the new customers going forward is -- would they be pushed to or preferred to become a subscription model versus perpetual licensing?\n\nStacey Stevens -- President and Chief Executive Officer\n\nYeah. I mean, when it comes to the service, we don't get full attachment rate of service to all of our perpetual license customers, right? In fact, that's an area we have been working on because we'd like to see that drive a little bit higher. But what it does is it takes that out of the mix. it's not an option in a subscription model.\n\nEveryone gets the product and annual service, all bundled into one payment. So, we actually -- in the subscription model, we'll have 100% attachment of service to those customers who in the past may or may not have bought a service contract.\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nOK. Maybe the last one is that you have been mentioning about trying to penetrate into the logical system base. And any updates at this moment you can talk about. Thanks.\n\nStacey Stevens -- President and Chief Executive Officer\n\nYeah. I mean, I think penetrating that competitive installed base is an area where we've seen a lot of success both in terms of the deals we've closed and looking at the pipeline going forward. The way I would characterize it is that the growth from Q1 to Q2 in terms of actual deals closed, we saw high double-digit increase in our deals that were attached to a competitive gantry. And as we look forward and look at our pipeline going forward, it's even significantly higher than that.\n\nSo, I think we're making some very good progress in that regard, and we expect that to continue.\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nOK. Great. Thanks a lot, and best of luck moving forward.\n\nStacey Stevens -- President and Chief Executive Officer\n\nThank you so much.\n\nOperator\n\nThank you. That concludes our Q&A session. I will now hand the conference back to Stacey Stevens for closing remarks.\n\nStacey Stevens -- President and Chief Executive Officer\n\nThank you, operator. So, in summary, for me, having now completed my first full quarter as the CEO of iCAD, I've now had a chance to fully evaluate the long-term strategy of the company and really to accelerate change in our strategy that will generate greater growth potential. I honestly could not be more enthusiastic about the progress we are making and the long-term opportunities that are in front of us. We are in the very early stages of a business transformation on the Detection side of our business, that really is going to create a large installed base of customers who can generate long-term recurring revenue, while at the same time being able to accelerate access to our life-saving technology to more patients.\n\nWe are working more larger deals than at any point in the company's history, and our goal is that every patient have access to the most advanced set of AI tools for breast cancer risk assessment and detection of breast cancer. I am absolutely thrilled to work with such a talented team who are so passionate about our mission, and I look forward to updating all of you next quarter as we continue to scale our business, enhance our team and drive toward substantial increased shareholder value. Thank you, and have a great night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTony Takazawa -- Director of Investor Relations\n\nStacey Stevens -- President and Chief Executive Officer\n\nSteve Sarno -- Interim Chief Financial Officer\n\nPer Ostlund -- Craig-Hallum Capital Group -- Analyst\n\nSam Eiber -- BTIG -- Analyst\n\nCharlie Montang -- Lake Street Capital Markets -- Analyst\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nMore ICAD analysis\n\nAll earnings call transcripts"
}