{
  "companyName": "Sera Prognostics, Inc.",
  "companyTicker": "SERA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/sera-prognostics-inc-sera-q2-2022-earnings-call-tr/",
  "content": "Sera Prognostics, Inc. (SERA 5.88%)\nQ2 2022 Earnings Call\nAug 10, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon and welcome to the Sera Prognostics' conference call to review the second quarter fiscal year 2022 results. At this time, all participants are in a listen-only mode. We will be facilitating a question-and-answer session toward the end of today's call. And as a reminder, this call is being recorded for replay purposes.\n\nI would now like to turn the call over to Peter DeNardo of CapComm Partners for a few introductory comments. Please go ahead, sir.\n\nPeter DeNardo -- Investor Relations\n\nThank you, Cole. Good afternoon, everyone. Welcome to Sera Prognostics' second quarter fiscal year 2022 earnings conference call. At the close of the market today, Sera Prognostics released its financial results for the quarter ended June 30, 2022.\n\nPresenting for the company today will be Greg Critchfield, chairman, president, and CEO; and Jay Moyes, our CFO. During the call, we will review the financial results we released today, after which we will host a question-and-answer session. If you have not had a chance to review our quarterly earnings release, it can be found on our website at seraprognostics.com. This call can be heard live via webcast at seraprognostics.com and the recording will be archived in the investors' section of our website.\n\nPlease note that some information presented today may contain projections or other forward-looking statements about events and circumstances that have not yet occurred, including plans or projections for our business, future financial results, and market trends and opportunities. These statements are based on management's current expectations and the actual events or results may differ materially and adversely from these expectations for a variety of reasons. We refer you to the documents the company files from time to time with the Securities and Exchange Commission, specifically the company's Annual Report on Form 10-K, its quarterly reports on Form 10-Q, and its current reports on Form 8-K. These documents identify important risk factors that could cause the actual results to differ materially from those contained in our projections and other forward-looking statements.\n\nAs a reminder, a webcast replay of this call will be available in the Investors section of our website. I will now turn the call over to Greg, Sarah Prognostics' chairman, president, and CEO. Greg?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nThank you, Peter, and good afternoon. Today, I will provide an overview of key business highlights during the second quarter and discuss some upcoming developments. First, on commercial progress. We placed a strong focus on early adopter systems.\n\nDuring the last quarter, we aligned our sales structure to better emphasize pursuing contracts with early adopter health systems that have various degrees of integration in ways they provide healthcare services to pregnant women. These systems customers can be excellent early adopter candidates that we target to incorporate preterm testing into their existing pregnancy services. Several examples of these include university systems, with as many annual deliveries as 8,000 per year where clinical and administrative leadership see the value of comprehensively managing the risks of prematurity inherent yet undetected in the population by traditional methods. Another example is integrated delivery network or IDNs, some of which have more than 30,000 annual deliveries where the organizations are institutionally focused on managing the health of patients with a comprehensive array of services offered in a cost-effective manner.\n\nOther examples include self-insured employers who are focused on providing superior pregnancy benefits to female employees in order to attract and retain talent and where the annual number of pregnancies can be in the range of hundreds to thousands. Managed Medicaid is another area of focus, where we are in active discussions with participating payers and state and federal officials with the goal of reducing healthcare disparities. One such state has more than 80,000 Medicaid deliveries annually. In addition, we continue our work with non-profit organizations dedicated to addressing the health disparities that occur in pregnancies with Sera's preterm technology that is well suited for unserved populations.\n\nOther systems of opportunity are certain large geographically concentrated physician networks, with the ability and desire to lead in the delivery of better care for their patients, where examples of these kinds of networks include those with 2,000 annual deliveries. And finally, we are also engaging with six large hospital systems comprising more than 71,000 deliveries per year, where tight collaboration with two clinical leadership and hospital administrations potentially enables greater uptake of Sera's strategy. In addition to the benefit of accessing large numbers of pregnancies by the systems approach, renegotiation of price has the benefit of securing more prompt reimbursement with less uncertainty post contract execution. In systems adopting our testing, our emphasis is on training and implementation with the administrative level and clinical decisions to move forward having already been made.\n\nBroad functional operating teams within Sera work to bring on these customers in efficient ways. These multidisciplinary teams from both the customer and the Sera side work to create and execute a comprehensive plan to move faster into implementation. These teams are composed of finance, clinical laboratory operations and IT functions from both groups. We believe that the coordination achieved by this approach leads to faster and more effective execution.\n\nUltimately, working in concert, they help to educate the physician practices regarding the clinical prediction performance of the pre-term test, the logistics of patient identification, requirements for sample acquisition, data integration, reporting, and follow-up. We believe that this approach may help us to post significant revenues earlier in our mid- and longer-term outlook as we penetrate a very large asymptomatic pre-term testing market with the only broadly validated, commercially available prognostic blood test on the market. Motivated early adopters always see commercial development of new diagnostic products. While we are admittedly early on, the opportunity is quite large, and this focused approach to commercialization is important to recognize that the time to bring on systems comprised of multiple customers has the potential to efficiently drive revenues for the efforts, as we build more comprehensive implementations.\n\nSoon, we will be making public -- selective public announcements of progress on these efforts that will serve as milestones along the highway toward widespread pre-term adoption. While we'd like to announce each and every one of these in the interest of transparency, certain systems do not allow publicity of any kind, and some individual systems may be smaller, but we will strive to share important developments. As the first wave of early systems adopters begin using our test, we believe that their experiences will also help to support the decision-making of other payers who prefer a derisked situation where others have already done the analysis and decided to adopt. The ability to comprehensively stratify prematurity risk in asymptomatic singleton pregnancy using the pre-term test enables more proactive steps to be taken to address the higher risk of premature delivery that is present in large numbers of pregnancies.\n\nThat capability forms the basis of Sera's vision, to improve the well-being of mothers and babies and in so doing to reduce healthcare costs. As you can see, the aggregate potential numbers I'm discussing today across all forms of these health systems, including self-insured employers are very large. As we are even mildly successful in executing on agreements with a number of these, we believe the revenue ramp will be notable over time. Now for some progress on continued innovation in our pipeline.\n\nIn May, we announced exciting and important improvements in the pre-term test performance. We demonstrated that compared to traditional methods, PreTRM testing detects five times as many pregnancies that will, in fact, have spontaneous premature deliveries with a sensitivity of nearly 90%. And at the same time, the PreTRM test demonstrated a very high negative predictive value of 99% in patients whose PreTRM tests are interpreted to be lower risk. This is very powerful stratification in addition to these performance improvement numbers, the PreTRM test was recently validated in an expanded time window for collecting blood now from 18 to 20 weeks, allowing physicians to more easily schedule patients for PreTRM risk devaluation by Sera's innovative tests.\n\nMany practices schedule anatomic ultrasound appointments as early as 18 weeks. So this expanded time window enables the patient to be conveniently evaluated by the PreTRM test without having to schedule a separate follow-up appointment. We've spoken previously of our work to validate prediction of preeclampsia. That work has progressed very well, and we are preparing it for a scientific review.\n\nSera's goal is to provide the doctor and the patient with predictions of both PreTRM and preeclampsia risk from a single blood draw taken between 18 to 20 weeks. If successful, we expect to be the only company to have the capability of addressing the two most important adverse outcomes of pregnancy with validated tests for each condition taken from the same blood draw. We believe that this work helps to achieve Sera's vision to be the pregnancy company. We also continue to innovate in a variety of ways in our business even beyond our testing technology.\n\nFor example, typically, a blood test sample must be kept cold after blood is drawn and as it is transported to the laboratory. This poses both logistics challenges and also adds to cost. We are currently working to validate a collection transport mechanism without the need to freeze the specimen, which should significantly expand the number of sites where blood can be easily collected. Another benefit of this new technology is that it is designed to save money as we increase convenience and make things simpler for our customers.\n\nJay will discuss some other cost-saving measures that are also underway. We look forward to reporting results of clinical and economic studies over the next several months. This includes work on validation studies of new biomarker signatures based on our biomarker platform, as well as health and economic analysis of the PreTRM test in new populations. And now a word on the PRIME study.\n\nWe shared before that our PRIME study is a multi-center prospective randomized controlled trial to further demonstrate the benefit of the PreTRM test-and-treat strategy. While as a result of the pandemic, clinical trial enrollment can be challenging, we are currently on track to enroll approximately 2,800 deliveries in the multicenter PRIME study by year-end 2022. This enrollment is required to enable the interim look analysis to be performed in 2023. We've taken two important actions to accelerate enrollment.\n\nFirst, we are continuing to add study sites to the PRIME study. And second, we are using the new expanded blood draw window during weeks 18 through 20, which increases the chance to enroll more subjects in a number of practices that conduct mid-pregnancy evaluations of patients as early as 18 weeks. This is important with accelerated enrollment, a positive interim look either improvement in neonatal morbidity mortality or decreased hospital length of stay, providing possibility of stopping the trial earlier. This, in turn, could have obvious benefits such as reduced costs from not having to continue the trial and giving us the opportunity to present additional earlier transformative data to payers and other customers.\n\nWe are pleased to see progress clinically, scientifically, and commercially at this stage of our development. We have the capital to make this work and are deploying it carefully to ensure a long runway without the need to raise cash. I'll now turn over the call to Jay for a review of our second quarter financial results. Jay?\n\nJay Moyes -- Chief Financial Officer\n\nThanks, Greg, and good afternoon, everyone. Today, I'll briefly review our financial results for the second quarter and provide some general color on cost reduction efforts we've undertaken and our high-level view on testing revenue throughout the rest of the year. For the second quarter of 2022, we reported revenue of $70,000 compared to $20,000 for the second quarter of 2021. Revenue for the second quarter of 2022 was also up significantly sequentially from $38,000.\n\nAs Greg noted, we are seeing traction among early adopters, and this is fostering improvement in revenue. Total operating expenses were $11.8 million and up from $7.4 million for the same period a year ago. Research and development expenses for the second quarter of 2022 were $3.3 million compared to $2.8 million for the prior-year period due primarily to increased laboratory operations and clinical study costs. Selling, general and administrative expenses for the second quarter of 2022 were $8.5 million, up from $4.6 million for the prior-year period, due primarily to increased headcount as we scale commercial operations and general corporate infrastructure, as well as increased costs relating to operating as a public company following our IPO in July of 2021.\n\nNet loss for the second quarter of 2022 was $11.5 million compared to $6.3 million for the prior-year period. As of June 30, 2022, the company had cash, cash equivalents, and available-for-sale securities of approximately $121 million. On our last quarterly call, we mentioned that we believe we have sufficient capital to implement our strategy into 2025 without raising any additional capital. Since then, we've executed cost reduction actions, including streamlining our sales force and focusing our commercial strategy on integrated customer systems, as Greg mentioned, to extend that runway even further into what we anticipate is now 2026.\n\nIn this regard, we are pleased to have the support of our investors to pursue our plans about -- without capital constraints, some companies in our space are facing right now. We have not revised the business outlook that we have previously given for 2022 year-end revenues. As a result of cost reductions and with continued adoption of the preterm test by payers, we anticipate a reduction in cash burn over time while revenue builds. I'll now turn the call back to Greg.\n\nCraig?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nThanks, Jay, and thanks to all of you for attending our call today. While the scaling of our revenue is taking longer than we like, we are pleased to see some exciting trends on our early adopter integrated systems to customers, which is a solid proof point for our business. We believe this adoption will accelerate and our conversations with integrated customers will eventually result in contracts being successfully executed as well. Finally, we are very pleased given the current macro market conditions to have sufficient cash to execute on our plans over years due to the excellent support of our investors.\n\nThis enables us to achieve our vision to make a real difference in helping mothers and babies to leave better and healthier lives. And with that, we'll open up the line for questions. Operator?\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] At this time, we will pause momentarily to assemble the roster. And our first question today will come from Patrick Donnelly with Citi.\n\nPlease go ahead.\n\nUnknown speaker -- Citi -- Analyst\n\nHi, I'm Lizzie on for Patrick Donnelly. Thank you for taking my questions. First, I was just wondering, I think last quarter you provided month-to-month updates sequentially in terms of how orders increase. Did you see any similar patterns in the prior three months as well? Thanks.\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. We saw increases in the prior quarters compared to what we reported for the last quarter here. And we're anticipating seeing that trend to continue, and we're very excited about it. And as we said, the traction that we're getting with integrated systems is already beginning.\n\nWe have contracts that have been signed, that have not been disclosed publicly, and that's something that happens because there are many organizations that don't allow public disclosure. But what we can tell you is we are making progress, and we're excited to see growth in the number of orders and ultimately in revenue.\n\nUnknown speaker -- Citi -- Analyst\n\nGreat to hear. And then just one follow-up. Are you quantifying at all physician reorder is or any numbers around there? Thanks. That's it for me.\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nWe've not really given a guidance on physician reorder rates, but what we can tell you is the source of our growth is both new physicians coming on and existing physicians continuing to order more tests. We see both things happening.\n\nUnknown speaker -- Citi -- Analyst\n\nGreat. Thank you.\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nAnd our next question will come from Brian Weinstein with William Blair. Please go ahead.\n\nUnknown speaker -- Citi -- Analyst\n\nHey, guys. This is Dustin on for Brian. Along the lines of the last question was asked orders per physician. Wondering if you could talk about maybe some of pushback you might be receiving at this point or positive feedback on the other hand that you might be receiving when you're out in the field and the sales team is trying to sell this test to the early adopters?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. The early adopter strategy is something that we've been working on, as I said, in the last couple of quarters. And what we're seeing is the very positive trends in that. As you know, when a physician orders a test and the test result comes back positive, there are certain things that physicians will do because that pregnancy is flag as being at high risk.\n\nAnd given the performance characteristics of the test is very good. Physicians pay attention to that higher risk. So, one of the questions is, how will you implement changes in strategies? The systems approach it actually allows us to augment the capabilities that are already present. And we're finding that it's easier to do that once you've made the decision to go forward, it's easier in a system to be able to get it done.\n\nThe individual physicians, there are exceptions. They have -- many of them have exceptional access to services they plug patients in, they see them. But it is easier for a systematic approach, and that's why our strategy is going in that direction. The thing I can tell you is it's very important is the administrative and clinical decision-making to move forward is done at a systemwide level.\n\nAnd in doing so, the entire system comes on board, and it's just a matter of time to educate and to implement those physician practices that are under that umbrella. And that's the exciting part about our strategy.\n\nUnknown speaker -- Citi -- Analyst\n\nGot it. OK. Similar to that, I understand the systems approach you guys are going after. But can you remind us, how the sales force is now configured to best maximize these large system opportunities? You guys mentioned today that, there were changes in your sales force that were made last quarter.\n\nSo how has that impacted order rates and the sales force going forward?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. The order rates are increasing. I'll say that, first of all. And what we've done is we focused our sales team on integrated systems, where we have metrics that we use to select which ones we know.\n\nIt depends on the size, it depends on the opportunity, it depends on the connection, and a target list of these is assembled and we go after those systems. We are talking to large numbers of them now and there's great interest in moving forward on implementation. As I said before, we will have announcements forthcoming announcements on these as we move through the next several months.\n\nUnknown speaker -- Citi -- Analyst\n\nGot it. OK. And just one more for --\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nThe one other point I'll make, and I don't want to belabor this point, but I think it's an important one to emphasize. Getting in, in many ways, it's a high-level sale to an organization, where the leadership of the organization come together, they discussed the opportunity carefully by the organization, and the organization makes a concerted decision to move forward. Once that happens, then we switch into an implementation mode where we go in, we work together with them to -- with all the various disciplines that are required to make sure that it is a seamless, integrated effort as we implement. And that's what takes a little bit of time.\n\nBut the benefit is so by converting a single physician practice, office practice to doing it. You've got a system of people, multiple customers are under that same group and that entire organization comes on board. And that's really the strength that we're seeing as we move forward. And as I said before, we do expect that the notable revenues are possible in the future because of that approach.\n\nUnknown speaker -- Citi -- Analyst\n\nGot it. OK. I know you briefly mentioned additional data besides the PRIME study coming out. Can you just talk about what that data might be in addition to what -- \n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. There will be data on pre-eclampsia coming out. And we've already posted -- we have already posted information on pre-eclampsia and our commitment has been to work toward validating predictors of pre-eclampsia this year. And as I said in my remarks, that work has gone very well.\n\nRight now, we are preparing the information to be submitted to scientific journals for review. We're very excited about that. Pre-eclampsia and pre-term births are the two most important conditions in pregnancy. And being able to give information to a doctor that reads out on both conditions from a single blood draw in that time window of 18 to 20 weeks is a great benefit to the doctor.\n\nIt performs a more complete picture of what's happening with the patient and really does address the two most important conditions of -- adverse conditions of pregnancy that can occur. So, we're very excited about that. There will be other things that we'll talk about in their due course. We've talked about making additional predictions of time of birth and other things.\n\nThose will come out in due course as we move through the next year and into the subsequent years. This year, the goal is to validate -- we've not been projections of when any of the products will yet be available but that -- the validation is a predicate for that happening.\n\nUnknown speaker -- Citi -- Analyst\n\nGot it. OK. And one final one, I think you might have mentioned other payers coming online or expected to come online. What exactly is needed to bring them to realize the benefit of this test? Obviously, PRIME has got to be a big factor, but anything else in addition to that? Thank you.\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. I think there are a couple of things. Clearly, publications, where clinical utility and economic utility are demonstrated, are very useful for all payers. Those are -- and there are readouts that we anticipate coming where that will -- those kinds of things we believe, will be beneficial in our conversations with payers.\n\nThe PRIME study is a multicenter study done -- we've actually increased the enrollment in that study, and having the enrollment increase and having a blood drop window increase inside allows us to finish that study sooner. We believe that is an important thing that the payers will want to see. Having payers see other payers that are adopted and other systems that are adopting the test is a very powerful factor. Seeing that, there is demand, seeing that people are using it and many of the implementations we're talking about, people are going to be very public with what they're doing with the information and be able to talk about how this is enabling them to take better care of pregnant patients.\n\nThe more the word gets out, the more people see those kinds of things, that will have a beneficial effect in helping to also generate more revenues for people that are -- that haven't quite decided yet, but are asking that question. When should I do this?\n\nUnknown speaker -- Citi -- Analyst\n\nOK. Thank you, Greg.\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYou bet.\n\nOperator\n\n[Operator instructions] Our next question will come from Dan Brennan with Cowen. Please go ahead.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nThanks for taking the question, guys. Maybe just starting with PRIME, I think at the end of July, clinicaltrials.gov had you guys still recruiting for PRIME? Are we still on track for it to be completed by October? And then when would we get the expected interim readout?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. The goal for this year, Dan, is 2,800 deliveries before year-end, and we're on track for that. And as I said before, the increase in the number of enrollment sites and the expanded blood draw window, we believe are driving that. And we are on track to achieve that goal.\n\nSo once those pregnancies are enrolled, pregnancy has a very important feature that we let's not forget. But if the enrollment takes place in the middle of pregnancy, you have to wait until the end to know what the outcomes are. And to see what the benefit of a test like the PreTRM test is. So, it will take several months.\n\nAnd what we're saying is during 2023, this one -- the interim look will be unable to take place. And as I said before, with an interim look, it's positive, positive one of the two primary endpoints is positive, either an improvement in neonatal morbidity mortality or a decrease in hospital length of stay. Either one of those is a -- an endpoint of which it's either positive, then the trial can be stopped and it will be finished earlier. If it isn't, then enrollment will continue to the end, and it will take longer to recruit but we anticipate that in 2023, we'll have sufficient numbers of patients enrolled to be able to conduct that interim look.\n\nWe will make announcements according to what is allowed by the study protocol. And as I said before, it is not certainly that because it works, that's the goal that we're aiming for. The study is highly powered to be able to show those endpoints. That's what we're looking for in the interim look that will occur during 2023.\n\nSo, if you go five, six months beyond the time -- the last patients enrolled, that's the time that the patient would deliver, then the time for data cleanup and analysis takes a little bit longer. So we're looking at some time in 2023 having the interim look actually performed.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGot it. And then the ability to collect it 18 weeks to 20 weeks versus 2019 to 2020, does that introduce risk in terms of it opens up more collection, but at the same time, how validated as your, kind of, analysis in the lab, maybe that there's not going to be any degradation or risk around the marker and the success at 2018 versus 2019 weeks?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nNo, there isn't any. In fact, we looked at this very carefully. We have a recent publication where we looked at the performance of the test over the window that goes from 18 weeks up to 20 weeks. And we maintain that excellent performance.\n\nThe sensitivity of 88%, nearly 90% holds true in that expanded window. Specificity, slightly increased, negative predictive value is very high. Those numbers come from that expanded window where we've demonstrated that, in fact, it does work. There may be an added benefit, however.\n\nIf you're able to detect somebody at risk even a week earlier, you can actually begin proactive interventions a week earlier. So, we think that we have the potential theme of being more beneficial than the original study of blood draw window that was limited to the two-week period.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGot it. If the prime study fails then what? How much of the business -- what's the value of the test if PRIME isn't successful?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. It's a good question. I'll answer it and I'll ask Jay if he has any thoughts on it as well. The -- there's no question that the STRATIFYER works.\n\nWe have validated it across populations in the U.S., the biomarkers performed well in other geographies. So, there's no question that we can stratify. What it says, if it -- if it were to fail, you have to understand why it was failed. It could be there's not enough patients received interventions.\n\nIt could be the intervention effects, and we're not as strong as one might anticipate, everything that we see now, all the data that we have and all the work that we've done in biomarker development demonstrates that it should work. And so the question is, if it doesn't work, it may be more a situation where the interventions are not as effective. STRATIFYER works -- it works very, very well. interventions are effective and newer interventions may need to be found to address the problem.\n\nWe don't believe that's going to happen. Our expectation is that it will continue to demonstrate value. It didn't show that problem in the first trial that was published in PTP trial, where were significant reductions in hospital length of stay and severe morbidity and mortality, they were both improved. So we'll see what the results are.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGot it. Just on the cash runway, so you extended it another year, it looks like, how many salespeople do you actually reduce? And what impact does it have on the traction of the test right now?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. We are not putting out numbers at this point in time. What I can tell you is we're starting early, and we're focusing on sales geographies and opportunities that are there. And we -- as we build -- as we move forward, our hiring rate will be based on seeing success and where opportunities are.\n\nThis is a very important principle in novel diagnostic companies, where you have something that you're deploying and you want to be able to see the effect you're penetrating the market before you invest in a much larger sales force. The ultimate size of an entire OB/GYN sales force is around 250. And that's from my experience at Myriad. We built a sales force of that size.\n\nThere are 18,000 physicians that deliver babies in the U.S. And if you look at the number that the salesperson usually has in their accounts, in their territories is somewhere in the order of 70%. You run the math as you get close to 250 for a number. That's not a number that we're driving toward at this point in time.\n\nWhat we're driving toward is implementations that work, early adoption and continued progress with data and ultimately bringing more payers on board. And then we will expand selectively, opportunistically, as their support and payment for our test. Jay, any comments from you?\n\nJay Moyes -- Chief Financial Officer\n\nYeah. I would like to mention that even with reductions we've grown our order volume. And the other thing we've also done is increase the size of our internal sales force. So a lot of it, not necessarily focused on a specific reduction but on somewhat of a reorientation and focus so that we can maximize the benefits that we get from each of our salespeople.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGot it. Maybe one or two more quick ones. So, I know when you had first pulled your 2022 guidance, obviously, the future is about the success of the study and improving contracts and coverage and then really see the ramp. But net-net, I know when you had pulled your guidance it was due to COVID with a factor lack of access to doctors' office things of that nature.\n\nWhere does that stand today? Has that gotten any better? And is there any commentary, again, albeit a very small number is what we should be thinking about for the back half of the year in terms of revenues?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. I mean the revenue guidance stays as it is. We were not revising that at this point, as I mentioned earlier in the call. I don't know, Greg, if you want to add any more color to that, but no change in the guidance.\n\nYeah. That's right. Yeah, we've not changed our guidance. I think the -- as we get further in the year, as we see more success, we'll be evaluating how we think about it and be signaling properly to see how to think about it.\n\nBut right now, there's been no change.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGot it. And consensus has revenues going to like $13 million next year and like $30 million year after. Obviously, we'll see how PRIME plays out. But I guess to the extent the data is out in the interim in 2023, it's how quickly could things ramp after that.\n\nProbably it will take some time, right? So, it's really more of a 24 event, I would think, or how do we think about ultimately if it is successful, what happens then?\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nThis is highly speculative and the confidence it goes around this is pretty broad. But you're absolutely right on the sequence. If the interlock is positive for 2023 then it will take time to get it published. It will take time for people to learn about what the benefits they had and benefits have been demonstrated to be.\n\nIt will take some time to do that. In the meanwhile, we will be penetrating additional customer systems and really working to drive this in these integrated groups of customers that we have. So, we're not sitting by idly that's just waiting for that to happen, and let's just take the fires have to be bit, it isn't. We have a way of stratifying risk.\n\nThere are things that people can do to address that risk. And the trials are designed to really get what can one do clinically with this and what are the outcomes expected to be. That -- when that happens, it will take some time. But this will all be implemented on a backdrop of continued growth of the product, continued penetration of the market.\n\nThis is a very, very large market. I want always to remind everybody, the candidate pregnancies for our test is more than $3 billion a year in the U.S. So those are people who are eligible, who would be the indicated use patients for the test. That's a very large market.\n\nAnd being able to penetrate it to any degree does have the potential to yield significant revenues over time. And that's the goal that we're focused on right now.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGreat. Thank you.\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nYeah. You bet. Thanks for your questions.\n\nOperator\n\n[Operator instructions] This will conclude our question-and-answer session. I'd like to turn the conference back over to Peter DeNardo for any closing remarks.\n\nPeter DeNardo -- Investor Relations\n\nThank you. This concludes the call, and we look forward to providing an update on our business when we report our third quarter 2020 financial results. Thank you, and good afternoon, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPeter DeNardo -- Investor Relations\n\nGreg Critchfield -- Chairman, President, and Chief Executive Officer\n\nJay Moyes -- Chief Financial Officer\n\nUnknown speaker -- Citi -- Analyst\n\nDan Brennan -- Cowen and Company -- Analyst\n\nMore SERA analysis\n\nAll earnings call transcripts"
}