{
  "companyName": "EOG Resources",
  "companyTicker": "EOG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/eog-resources-eog-q3-2022-earnings-call-transcript/",
  "content": "EOG Resources (EOG 0.69%)\nQ3 2022 Earnings Call\nNov 04, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to EOG Resources' third quarter 2022 earnings results conference call. As a reminder, this call is being recorded. At this time for opening remarks and introductions, I would like to turn the call over to the chief financial officer of EOG resources, Mr. Tim Driggers.\n\nPlease, go ahead, sir.\n\nTim Driggers -- Chief Financial Officer\n\nGood morning and thanks for joining us. This conference call includes forward-looking statements. Factors that could cause our actual results to differ materially from those in our forward-looking statements have been outlined in the earnings release in EOG's SEC filings. This conference call also contains certain non-GAAP financial measures.\n\nDefinitions and reconciliation schedules for these non-GAAP measures can be found on EOG's website. This conference call also may include estimated resource potential, not necessarily calculated in accordance with the SEC reserve reporting guidelines. Participating on the call this morning are Ezra Yacob, chairman, and chief executive officer; Billy Helms, president, and chief operating officer; Ken Boedeker, EVP exploration, and production; Jeff Leitzell, EVP exploration, and production; Lance Terveen, senior VP marketing; and David Streit VP investor relations. Here's Ezra.\n\nEzra Yacob -- President\n\nThanks, Tim. Good morning, everyone. The quality of EOG's diverse, multi-basin, and portfolio high-return assets continue to grow and improve. Yesterday's announcement of the large position we captured in the Utica Combo play demonstrates yet again that EOG's robust exploration pipeline delivers results.\n\nOver the last two years, our organic exploration efforts have brought forth Dorado, our premium dry natural gas plant in South Texas, the emerging Northern Powder River Basin oil player in Wyoming, and now the emerging Utica Combo play in Ohio. The value of our multi-basin portfolio can't be overstated. With the addition of the Utica Combo, we are now positioned to operate seven premium resource basins, which reinforces several of EOG's competitive advantages. First, our decentralized cross-functional operating teams innovate independently but collaborate to compound the impact of learnings and efficiencies across the company.\n\nSecond, our flexibility to allocate capital optimizes reinvestment across our portfolio, enabling us to develop each asset at the right pace to maximize returns. And third, our geographic and product diversity gives us the ability to plan around base and level market dynamics. Our goal is to expand and improve the overall quality of our portfolio by identifying higher-return inventory. Our approach is to build a diverse portfolio of premium assets predominantly through low-cost organic exploration, which adds reserves at lower finding and development costs and lowers the overall cost basis of the company.\n\nThe end result is continuous improvement to EOG's companywide capital efficiency. Our track record of successful exploration, coupled with strong operational execution, is how EOG has continued to improve over time and position the company to create shareholder value through industry cycles. We demonstrated our confidence in EOG's improving cost structure yesterday by increasing the regular dividend by 10%. Our peer-leading annualized dividend is now $3.30 per share competitive with the broad market.\n\nWe also delivered on our commitment to return at least 60% of annual free cash flow to shareholders with our fourth special dividend of the year. By year-end, we will have returned $5.80 per share special dividends. Combined with the regular dividend, we will return 8.80 cents per share or $5.1 billion in cash to shareholders, which exceeds our 60% cash return commitment using current forecasts. Looking forward, we expect 2023 will remain dynamic with respect to the supply chain, oil and gas prices, and other global macro drivers.\n\nOur diverse low-cost asset base puts us in an excellent position to capitalize on opportunities no matter the environment. EOG continues to consistently execute, lower our cost structures through innovation and efficiencies, and grow the quality of our portfolio to improve capital efficiency and free cash flow potential. Our transparent cash return strategy is anchored to a sustainable, growing regular dividend and backstopped by an impeccable balance sheet. EOG is in a better position than ever to deliver value for our shareholders through industry cycles and play a leading role in the long-term future of energy.\n\nNext up is Billy with an early look at our 2023 plan, followed by Tim, who will review our financial performance. Ken will then provide background and details on the Utica Combo play. Here's Billy.\n\nBilly Helms -- Chief Operating Officer\n\nThanks, Ezra. Once again, EOG delivered outstanding results in the third quarter. We exceeded midpoints of production guidance while capital expenditures beat forecasted targets. I'd like to thank our employees for their perseverance and execution to beat expectations, realized oil and natural gas prices also beat their target benchmarks in the third quarter.\n\nOur marketing teams are doing an excellent job executing our long-term strategy of diversifying across multiple transportation outlets and sales points. This strategy is also enabling the company to navigate the recent bottlenecks in transporting natural gas out of the Permian. We all have significant transport positions with the ability to move up to a Bcf a day out of the basin. In total, less than 5% of our domestic gas production is exposed to Waha pricing in the Permian.\n\nIn fact, we anticipate fourth quarter realized prices to remain strong for both natural gas and crude oil sales overall. Our crude oil and natural gas export capacity is serving us well in this regard. In the fourth quarter, we expect to sell over 250,000 barrels of crude oil per day at Brent-linked prices and 140,000 MMBtu per day of natural gas at JKM-linked prices both on a gross basis. Year-to-date through September, export-based pricing of crude oil and natural gas has added nearly $700 million of revenue uplift compared to the alternative domestic sales.\n\nOne of the major topics of the year continues to be the inflation story. The price pressure we are seeing on steel, fuel, and labor continues to be persistent. Our employees are maintaining their focus on finding ways to mitigate inflation through innovation and efficiencies in our operations. Through their efforts, we now expect our average will cost to increase by a modest 7% as compared to last year.\n\nAs a result, we have narrowed our full year capital guidance from $4.5 billion to $4.7 billion. Given the elevated and persistent inflation pressures, we have experienced this year, I am proud of our employees' efforts to mitigate a majority of this impact on our capital plan. We continue to evaluate and shape our plans for 2023. Production growth and infrastructure investments will remain guided by capital discipline.\n\nWe expect low single-digit oil growth similar to this year. We currently forecast oil equivalent growth, including gas and liquids at a low double-digit rate, somewhat higher than this year, largely driven by increased activity in our highly productive Dorado gas dry gas play. Once again, we plan to leverage our activity across multiple basins to secure services and manage cost pressures. Our initial plan includes a modest increase in activity utilizing the order of 28 to 30 drilling rigs, including one offshore rig in Trinidad.\n\nThis would be accompanied by 8 to 10 frac fleets. This would represent a slight increase of 2 to 3 rigs and 1 to 2 frac fleets over 2022 activity levels. We are seeing opportunities in different basins to lock in services at favorable rates for next year and currently expect to secure 50% to 60% of our wealth cost by the start of the year. This is within our typical range and compares with 50% of the cost secured for the start of 2022.\n\nAll in all, we expect higher capex in 2023, driven by four key factors. First, we are assuming the persistent inflation pressure continues with the cost of materials and services increasing, our initial 2023 budget is likely to reflect another 10% well cost increase on top of the 7% increase we expect this year. We will continue to work to identify additional savings and efficiency improvements to offset the impact of inflation, just as we did this year. Second, we see several opportunities to advance the development of particular assets in our portfolio in areas that are less exposed to the most severe inflation and supply chain pressures.\n\nThe increase in activity in emerging plays like Dorado, the Powder River Basin, and the Utica Combo are examples. Third, we expect to accelerate some infrastructure projects to take advantage of market opportunities. In Dorado, we've begun construction of a new 36-inch gas pipeline from the field to the Agua Dulce sales point near Corpus Christi, Texas. This will ensure long-term takeaway, fully captures the value chain from the wellhead to the market center, and aligns with our focus on being a low-cost operator.\n\nFourth. We plan to continue to progress our investments in environmental projects, including the expansion of our Carbon Capture and Storage or CCS projects. Our first CCS project is progressing and we expect to begin injecting CO2 early next year. This is yet another step toward our goal of being among the lowest cost, high return, and lowest emission producers of oil and natural gas.\n\nWe recently released our latest sustainability report for 2021, which highlights our progress. We achieved our near-term 2025 methane emissions percentage target of 0.06% last year, an 85% reduction from 2017 levels. We captured 99.8% of natural gas produced at the wellhead meeting our 2021 gas capture target. We discussed our latest initiative to further reduce methane emissions through our continuous leak detection system named iSense.\n\nWe improved our safety performance with lower total recordable and lost time incident rates, and we reduced our freshwater intensity rate by 55% since 2020. We are proud of our employees, and progress on our sustainability goals, but we still see tremendous opportunities for continued improvements. Altogether, infrastructure spending, including environmental projects, typically amounts to 15% to 20% of our capex budget. This year is running right about the midpoint of that range, whereas next year we expect it to be toward the higher end of that range.\n\nWe continue to develop our 2023 plans as we approach the new year and provide a more detailed, complete outlook in February. Now here's Tim to discuss our financials.\n\nTim Driggers -- Chief Financial Officer\n\nThanks, Billy. We were very pleased to increase the regular dividend by 10% to $3.30 per share annual rate. This increase reflects two things. First, the improvements we've made to the cost structure, efficiencies, and technology continue to sustainably improve EOG's capital efficiency.\n\nFurthermore, we expect the advantages of operating in multiple basins will drive additional improvements to EOG's cost structure and returns in the year ahead, lower the cost of supply and lower the break-even oil price to fund the dividend. Second, this dividend increase reflects our confidence in EOG's expanding portfolio of premium plays to grow the company's future income and free cash flow potential. Over the last several years, our success in organic exploration continues to add low-cost reserves and consistently drive down our DD&A rate, enabling EOG to create value through industry cycles. We also remain committed to returning at least 60% of free cash flow to shareholders each year.\n\nAs a reminder, we look at this on an annual basis, not quarter to quarter. Based on current commodity prices, we estimate the $1.50 special dividend declared yesterday, will bring free cash flow returned to shareholders to about 67% for 2022. We will start 2023 in an exceptionally strong financial position. We ended the third quarter with $5.3 billion of cash on the balance sheet against $5.1 billion of debt.\n\nWe generated $2.3 billion of free cash flow during the quarter. Along with inflows of another $1.3 billion of cash from working capital, primarily from the drawdown of hedge collateral. Now, here's Ken.\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nThanks, Tim. We're excited to announce our new oil and natural gas combo acreage position in Ohio's Utica shale. We've accumulated 395,000 acres in this play, predominantly in the volatile oil window across a 140-mile trend running north to south. Our cost of entry was less than $600 per net acre for leasehold, demonstrating the benefit of organic exploration.\n\nOne of our most distinct competitive advantages. Capturing highly productive rock through our organic exploration and leasing efforts is the primary way of improving the quality of our premium inventory at low cost, which leads to a lower companywide cost basis. The Utica is a well-known and prolific gas resource to the east of our acreage. Several years ago, our exploration team operating out of the Oklahoma City office took a fresh look at the basin from a petroleum system perspective.\n\nWe knew there was an oil rim with varying gas-to-oil ratios present. Using our experience in other basins and our technical workflows and proprietary reservoir engineering modeling tools, we anticipated that this could be an area that would be additive to our inventory when we considered our advancements in precision targeting and simulation technology, along with our low-cost drilling and completion operations. It became clear that this area had the potential to compete with our premium and double premium plays across the company. Through leasing and acquisitions, we acquired 18 legacy wells with varying geologic and production data, which supported our assessment of the area.\n\nOver the last 12 months, we've confirmed our model and the economic viability of this prospect by drilling three delineation wells in the northern part of our acreage and one in the south. These first four wells already earn premium and double premium returns when normalized to our development plan, which assumes 3-mile laterals. As a reminder, our premium hurdle rate assumes $40 oil, $16 NGL, and $2.50 natural gas. These exceptional results are due primarily to the high productivity of the interval and a large amount of liquids in the product mix from the volatile oil window.\n\nIn addition to the well performance, we also want to highlight our embedded mineral interest in the southern portion of the acreage. We've acquired 100% of the mineral rights across 135,000 acres of our leasehold for about $1,800 per acre, which is in addition to the $600 per net acre for the leases. This mineral interest significantly enhances the value of this play by adding 25% to our production and reserves stream for no additional well costs or operating expenses. This area is also where we've drilled our most prolific well, which initially produced over 2,500 barrels of oil per day and 3,500 barrels of oil equivalent per day from a 12,000-foot lateral.\n\nThe total value of this mineral interest across our southern development area is significant, especially since EOG will dictate the pace of development as an operator. Next year, we plan to drill approximately 20 wells in the northern and southern areas and utilize our multi-basin experience to climb the learning curve faster by leaning on the best targeting, drilling, and completion techniques that apply to this area. We expect our 2023 Utica Combo plan will accomplish two goals. First, to deliver double premium returns, while second further delineating the play to help asses resources and inventory.\n\nWe will invest in incremental gathering infrastructure to be to prepare for a larger development program and anticipate being able to take advantage of existing processing infrastructure in the area for the foreseeable future. This is the advantage of the timing and economic efficiency of successfully unlocking potential in an existing basin. EOG's entry into the Utica Combo play is a textbook example of why our decentralized organization that operates in multiple basins with wide-ranging geology lends itself to successful additions to the upper end of our premium and double premium inventory. We applied what we learned over the past decade in developing our portfolio to identify and unlock this overlooked resource.\n\nNow, here's Ezra to wrap things up.\n\nEzra Yacob -- President\n\nThanks, Ken. The takeaway from today's call is centered on EOG's fundamental value proposition. First, EOG's multi-basin organic exploration focus continues to improve the quality of our inventory. Capturing Tier 1 acreage across multiple high-return opportunities provides geographic diversity, product diversity, and the flexibility to allocate capital across each asset at the correct pace to optimize returns.\n\nSecond, EOG is a low-cost operator. We use technology to increase operational efficiency and capture select pieces of the value chain to keep both capital and operating costs low, thereby helping to reduce our breakevens and increase our free cash flow and income-generating potential. Third, Tim highlighted our financial performance and commitment to financial discipline that results in a 10% increase to our peer-leading regular dividend, a commitment to additional cash return with our announced special dividends, and a best-in-class balance sheet. Fourth, our recently published sustainability report illustrates our progress to reaching near-term greenhouse gas and methane emissions intensity goals and our commitment to developing new technologies and piloting new projects such as our CCS project to help reduce our environmental footprint.\n\nAnd fifth, it is EOG's employees and unique culture that continue to drive our success. Thanks for listening. We'll now go to Q&A.\n\nOperator\n\nThank you. [Operator instructions] The first question comes from the line of Neal Dingmann. You may proceed.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGood morning, Ezra and team. And congratulations on a nice result. As my first question is on jump right to it the Utica Combo play specifically looking at that Slide 10 of yours, it appears and you've talked about this, some of you guys talked about this already that the primary focus looks like it's on that about oil section or window. I'm just wondering if you all identified this is how the economics look at this window and sort of why focus here? Secondly, maybe just talk about the takeaway situation for you all there.\n\nEzra Yacob -- President\n\nYeah. Neal, this is Ezra. Thanks for the question. I'll maybe make a couple of comments and then hand it to Ken to shed a little more light on the economics.\n\nAnd then, Lance will provide a little more commentary on it on the takeaway. When you think about this basin, it's been a bit of a sleepy basin. Everyone knew that there is a liquids window there, obviously, and it hasn't really been revisited in a number of years as part of our recent exploration efforts, we went back in and really applied as Ken said some of our data from outside from other basin and some of the things that we've learned in the past few years. We really evaluated it from a geologic level, looking at the way that the process manifests itself between the north and the south, the mechanical stratigraphy that we've talked about before how our completions interact with the rock.\n\nWe had better data to better define the GOR and the phase across this area. And then, really we made a lot of progress modeling the overpressure across the play. And when you combine that obviously with technology on the operational side, that's what gets us so excited about the opportunity here. And it's really almost reminiscent of what we saw nearly a decade ago happening in the Delaware basin, where it's a bit of a sleepy basin with a lot of shale wells.\n\nIt really required some industry and EOG technology and knowledge kind of brought in from the outside to really make things work. Ken do you want to, you want to talk a little more about the wells?\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nSure. As Ezra mentioned where we are in the vault oil window and we do expect, oil, gas, and NGL production will vary some across that window. Both from north to south, but more so from the east, which will have a higher gas cut to the west, which is oilier. On an ultimate recovery basis, we expect that there will be 25% to 35% oil and similar percentages for natural gas, liquids, and residue gas.\n\nSo, when you think about that this play is really focused on 60% to 70% liquid development. And from that, as far as the economics go, it gives us premium and double premium numbers. That's $40 oil, $16 NGL, and $2.50 gas. the other thing to note on these wells is it's early, but we are expecting depending on where we're at in the play, 2 to 3 million barrels of oil equivalent for a EUR with a 3-mile lateral.\n\nSo that type of performance really leads us to a low finding cost and it'll definitely be additive to our cost basis.\n\nLance Terveen -- Senior Vice President, Marketing\n\nAnd -- hey, Neal, good morning. This is Lance. So I'll comment a little bit for you. I'll start at a high level, too, and maybe kind of drill down for you just as you think about kind of infrastructure and also takeaway.\n\nBut really, when we think about our plan, it's going to follow the same strategy that we've done in all of our plays. And I mean, one marketing is always aligned and integrated upfront and all of our exploration efforts. You've heard us many times talk about just multiple connections as critical. We want to have controlled the market and then firm offtake.\n\nWe're always disciplined in that matter that is going to be very commensurate with our plans. But when you think about the nat gas and especially like evacuating the nat gas, you got to remember like Ken just highlighted, the Utica wells will have less gas volumes in the oil window. As the liquids-rich play like Ken highlighted, 60% to 70% liquids. So when we look out here, we looked up front there is a significant available capacity that's just adjacent to our play.\n\nAnd also, if you remember, it's been built out for a long time. Much of it has been overbuilt, I would say, like in the last 10 years. So this also allows for opportunities. So we've really aligned ourselves with the current midstream operators that are in the area very strong.\n\nWe have great relationships with those. We've developed strategic relationships into the interstate pipelines to the plant tailgates. And I can tell you the liquidity is very strong in this area. It's much different and you can look into the Marcellus, but when you get into this area, liquidity is very strong.\n\nAnd so we don't see any issues at this time with sales on a go-forward basis.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGood. Fantastic details, guys, and great people. See you coming back there. My second question.\n\nMaybe just a bit on capital allocation specifically, I realize you won't have detailed '23 guides for three more months. I'm just wondering if you all have talked a bit -- I think on the plan talk today about maybe a bit more activity next year. I'm just wondering, is that just to keep production stable? Or are you still kind of considering a maintenance plan next year? And I'm wondering if you would consider a bit more growth if prices continue to be as strong and maybe cost would back off a little bit? Thank you.\n\nBilly Helms -- Chief Operating Officer\n\nYeah. Neal, this is Billy Helms. Like we had said in the prepared remarks there, it's still early to talk about what we think 2023 actual specifics will be. But the prepared comments also mention the fact that we will have more activity.\n\nWe do anticipate growing our oil production somewhere in the similar this year, somewhere in the low single digits. And on the equivalent growth, it'll be probably in the low double digits. So that's kind of how we see the plan shaping up as we as today with the macro environment, we see today that one company, that would entail probably adding two or three rigs over and above this year's activity level, in general, would probably another 1 to 2 frac fleets. So it kind of gives you an outlook of what that might look like.\n\nSo I guess, maybe just to scale it up on the capex side, where we kind of gave you some guidance this quarter for what we think our capex burn rate will be. And if you, kind of normalize that through next year and then add the cost of a little bit more activity and some infrastructure costs to kind of get you directionally where we're thinking.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nThanks, Billy. Thanks, team.\n\nOperator\n\nThank you, Mr. Dingmann. The next question comes from Leo Mariani. You may proceed.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nAll right. Why don't you dig a little bit more into Utica? Y'all talked about a well that had a 2,500 barrel-a-day rate. I guess it was 3,500 on an equivalent basis to the south. I just wanted to clarify, is that like a 24-hour rate? Is that more of a 30-day rate? And then also, I guess that's one of the four wells, can you perhaps provide a little bit of color around the other three, in the basin there as well? And, you talked about kind of 2 to 3 million BOEs recoverable on a 3-mile lateral.\n\nCan you also help us out with maybe what you think the eventual targeted well cost would be there, the 3-mile lateral?\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nYeah. Leo, this is Ken. As far as that 2,500 barrel-a-day rate that we highlighted there. We produced that for a couple of weeks.\n\nSo we're very comfortable with that rate. As far as the other four wells go, they had varying lateral lengths. We can move those to a 3-mile -- when we move those to a 3-mile development plan, they're definitely double premium type economics. That 2,500 barrels a day well that's got the 12,000-foot lateral is the longest lateral we've drilled to date.\n\nThe others do have a shorter lateral as we drilled them. One thing I really wanted to highlight on the 12,000-foot lateral well is the operations team that we have in Oklahoma City. It was the longest well that we've drilled. And once they got into the lateral, they drilled that 12,000 feet in a little over 6 days and stayed 99% in an 8-foot target.\n\nSo just outstanding operational performance there. As far as well costs go, we've really just highlighted that we anticipate being less than $5 a barrel on the F&D cost.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nOK. That's helpful. I wanted to follow up a little bit on Dorado. So you all mentioned that you're constructing a 36-inch pipe.\n\nThat's obviously a pretty good-sized pipe. So it sounds like you've got some pretty grand plans for that play. And it sounds like it's driving a lot of growth in 2023. I'm just curious as to when you think that pipe is going to be ready and imagine could take a little while to get constructed.\n\nAnd perhaps there is an even kind of larger wave of growth out of Dorado as we get toward mid-decade. And I'm assuming that maybe there are some LNG-type ambitions associated with that. So any color would be great.\n\nBilly Helms -- Chief Operating Officer\n\nYeah. Leo, this is Billy Helms. Let me maybe start with an answer, and then maybe Lance can give some more color to it. So the 36-inch pipeline, yes it's an effort to try to not only get that gas to market but also make sure we continued our focus on keeping our cost as an operator low.\n\nSo that's part of our longer-term plan. We've recognized that the value of installing infrastructure is really helping lower the long-term cost basis of the company. And so this is just another step in that vein. The 36-inch pipe will be constructed over a couple of years.\n\nSo it's not all being done in one single year. It's important to be taking it to the market center where we are. And then, the LNG, we're starting to recognize the value of having the gas in these areas. Since South Texas is where all the LNG demand is.\n\nSo it's advantageous from that standpoint. So that's kind of how this kind of works into the overall market dynamics with this play. So I'll let Lance maybe add a little bit more color to the pipeline itself in the market.\n\nLance Terveen -- Senior Vice President, Marketing\n\nYeah, sure. Hey, Leo, good morning. It's Lance. I think rides out onto what Billy talked about as well.\n\nIt's just it is very complementary and it's an integration of our operations. But again, like you heard in one of my answers earlier, controlling the market is very important. And so as we build out this infrastructure into the Agua Dulce market, we will have we're anticipating four downstream market connections. And I know you kind of asked a little bit about LNG, but I think the bigger point is just the demand pool that's anticipated out of South Texas.\n\nThere could be up to 5 Bcf a day just from kind of the South Texas region. When you think about the power gen industrial load and also Mexico and the demand pool is really real, right? You've heard us talk about Corpus Christi Stage 3, we're going to have a 720,000 MMBtu per day sale. Once that's kind of in service. We've got 140,000 that's today.\n\nBut you also have Golden Pass that's under construction and several other facilities that are getting very, very close to [Inaudible], which is excellent. And so maybe one other thing to add is that we've also contracted for a large transport position on an interstate pipeline expansion. Allowing us to reach essentially all the LNG demand pool along the Gulf Coast from South Texas to Louisiana. And that will have a direct connection off of our 36-inch.\n\nSo we're thinking very tactically, and strategically and setting up Dorado for the long term.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nThat sounds great. Thank you.\n\nOperator\n\nThank you, Mr. Mariani. The next question comes from the line of Doug Leggate. You may proceed.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good morning, everybody. Guys, I wonder if I could jump on the Utica as well. I'm just curious about -- I guess the back story as to how you accumulated this position because there are clearly a lot of players, I guess a little east of you guys, some of which might characterize their acreage as non-core.\n\nI know M&A is not your bailiwick typically, but a little background as to how you established this position and whether you'd be looking to continue to expand it. And I've got a follow-up on that, please.\n\nEzra Yacob -- President\n\nYeah. Doug, this is Ezra. Thanks for the question. Like anything, we allowed our geologic model to kind of drive where we're interested in acquiring acreage.\n\nWe were able to get in there and put it together in a variety of different ways. Probably the most noticeable one is that we were able to purchase the minerals down to the South that kind of highlighted earlier. It's about 135,000 acres of minerals that we purchased as part of a transaction. But in general, I'd say it fell right in line with our strategy of identifying where we want to be in the basin, trying to capture Tier 1 and Tier 2 acreage countercyclical, if you will, so we can continue to have a low cost of entry, which of course is critical is not only as you get out and delineate the place.\n\nBut also obviously as you really think about full cycle economics and in these resource plays.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Ezra. I know -- you guys have typically been organic in the way, of course, these things. But my follow-up is really about capital allocation and I guess to follow up to Leo's question about the Dorado, or the pipeline you're building, now you've obviously taken out -- I guess you could say, another step back to gas with Utica. What is your thinking in terms of -- is this pivot back to gas in terms of how we should think of capital allocation? I know you're typically agnostic on that.\n\nI'm just curious if we're seeing a bit of a pivot back here.\n\nEzra Yacob -- President\n\nYeah. Doug. The short answer is that we're agnostic based on our premium prices at the $40 and $2.50 natural gas pricing that we use to measure our investments. But in general, I'd say we do have a bullish view, long term on natural gas and NGL.\n\nObviously, on oil as well, but specific to Dorado, and some of these Combo plays we're seeing natural gas, we think will continue to see increased demand from power gen, some of the coal switching that we've seen this year. And also it's going to have, in the upcoming years continued exposure to the international markets with LNG development there along the Gulf Coast. NGL obviously, span the entire broad spectrum of the economy from plastics and rubber to heating to fuel blending and so on. And that's not to say those two won't experience volatility at times when supply is potentially outpacing demand.\n\nAnd, likewise, demand has to be outpacing supply. But that comes back to our approach as a disciplined operator. First, we evaluate like we just talked about based on the premium price deck that we use internally, and that means that we're investing based on returns first and foremost. Second, we evaluate the macro supply and demand fundamentals for short, medium, and long-term signals.\n\nAnd, I'd say it's one reason we are excited about the way we enter some of these positions, especially the Utica by owning the 135,000 acres with the minerals, we can control the pace of development and the remaining leasehold, and that play is dominantly held by production. And so that again is another lever that allows us to really optimize our pace of development and investment.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nWe'll look for news at the end of the month. Thanks. Thanks, Ezra. Appreciate it.\n\nOperator\n\nThank you, Mr. Leggate. The next question comes from the line of Scott Gruber. You may proceed.\n\nScott Gruber -- Citi -- Analyst\n\nYeah, it's a good morning, and congrats on the organic resource play addition. Generally, what's the rough split of the Utica acreage that's perspective for a double premium versus a single premium? And generally what spacing assumption are you guys using across the acreage?\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nYeah. Scott, this is Ken. As far as the split, it's really early in the development of Utica. We have four wells in it.\n\nWe want to do some additional drilling and testing across the acreage before we really come up with some kind of a resource, a well count, or a wells spacing estimate. As far as premium versus double premium, we actually think that we have double premium potential across the entire acreage position. So we're really just excited about the play and look forward to developing it next year.\n\nScott Gruber -- Citi -- Analyst\n\nGot it. Just back on the capital allocation question, just, over the medium to longer term, how are you thinking about, ramping the Utica? It's a little bit further down on your kind of development curve and obviously of optionality in Dorado and PRB. But it is just relative to the younger players, you'll be ramping up. How do you think Utica fits in?\n\nBilly Helms -- Chief Operating Officer\n\nWell, as Ken -- this is Billy. As Ken just mentioned, the Utica, we're very excited about the potential of the play to be double premium. And so it definitely competes from a capital allocation standpoint, but we are early in the play. So as we see things today, we'll plan on drilling some more in the order of 20 wells next year.\n\nAnd then from that, determine how what the go-forward plan looks like. As far as capital allocation for next year we're still early and still developing our plans, but as we see things today, the benefit of having these multiple basins is it gives us a lot of flexibility to move capital between the different basins. We don't have to leverage all of our activity in one basin. In particular, we're going to try to keep from seeing a lot of activity increases in areas where we're seeing the most inflation and supply chain constraints that exist mostly in the Permian Basin today.\n\nSo I would expect our activity levels there to remain pretty consistent with what we're seeing -- what we're doing today. We can pull levers in the other plays to meet whatever objectives we set forth as we move toward the end of the year.\n\nScott Gruber -- Citi -- Analyst\n\nGot it. Appreciate the color. Thank you.\n\nOperator\n\nThank you, Mr. Gruber. The next question comes from the line of Charles Meade. You may proceed.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nGood morning, Ezra, to you, and the whole team there. I'd like to ask about these four wells that you drilled in Utica. Can you talk about what you did differently, perhaps from previous operators, whether it's up you're targeting a zone or your completion designing? And also perhaps, did you test different concepts across those four wells?\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nYeah. Charles, this is Ken. As far as what we've done differently in this area really has to do with having, a number of years of experience in all of the other basins that we can bring to bear here in Utica. If you think about it, it boils down to four main things.\n\nOne of them is targeting being able to identify the target across the acreage position. The other one is understanding the phase, looking at that phase, not getting into the gas window, and not getting too far into the black oil window. The third one is pressure and how that pressure varies across our acreage position. And then the other is the operational execution that we can bring.\n\nThat's both the drilling and the completions design that we see. That all roll into what I would call the geo mechanics. And when you're all that together, it really gives us confidence in that in that area that we'll be able to develop that, with that low finding cost and double premium returns basis.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nGot it. Got it. That's helpful detail. And 20 wells next year.\n\nThat looks like it's -- maybe, should we be thinking about two rigs with the -- since it might take a while to drill these 3-mile laterals in an overpressure setting?\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nYeah, Charles. Really? Right now, these wells aren't taking that long, the 20-well program would really be done with one rig at this point in time. We may end up having two rigs if they're available at some point and then not at another time. But the average would be one rig for next year.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nGot it. Thanks for the added detail.\n\nOperator\n\nThank you, Mr. Meade. The next question comes from the line of Bob Brackett. You may proceed.\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nGood morning. I had a higher-level question, and then, I'll get some nitty gritty on the Utica. The higher-level question is you all, versus your peers, have run a fairly aggressive exploration budget this year, call it $450 million or so. What are your thoughts for 2023 and beyond and keeping the scale of that exploration budget, given that it's yielding results?\n\nEzra Yacob -- President\n\nGood morning, Bob. This is Ezra. Yeah, this year -- you're right. We've -- as we talked at the beginning of this year, we had a number of different exploration plays that a number of different places and evaluations.\n\nThis year we're drilling some initial wells, kind of wild cats in the play. Some of the plays are a bit further along and we're trying to delineate because remember our exploration program, it's not really about producers and dry holes. It's really about how or if these prospects are going to be additive to the quality of our existing inventory. That's what we're really looking for here.\n\nDepending on how you bucket size, the 20 wells we're talking about here in Point Pleasant are probably the most important thing. It'll basically be another delineation type of year for us across the 400,000-acre position that we've put together. Outside of those 20 wells that'll be the biggest part of next year's kind of exploration delineation type program if I put it there. We have some ongoing prospects in other areas we've talked about in the past some of those other ones, again, extents similar types of areas, places that have been sleeping in the past, places that are in known oil and natural gas producing areas, places where we're trying to bring modern technology.\n\nOur advancement of horizontal drilling and completions technologies and combining them with our rock, the understanding of the geologic environment, and seeing if we can turn those into premium and double premium types of plays that would be additive to us. And we'll just continue to evaluate as they go. To give you a hard number, right now though, it's just a little bit early, as Billy said, but we'll break that out in February.\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nVery clear. And then, kind of a bit nitty gritty. You mentioned the importance of targeting. You mentioned staying in an 8-foot zone.\n\nIs it a stretch to say the secret sauce here is staying in Point Pleasant?\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nNo, I mean -- Bob, this is, Ken. We do stay in that Point Pleasant. I think the secret sauce here is really a combination of everything. It's a combination of what we've learned in our other plays and then being able to operationally perform on that.\n\nSo getting the right petrophysical model to understand that targeting and understand how that targeting varies across the area. And then looking at the 8-foot window that we've kept it in really speaks to being able to perform, where this really goes back to just our culture. It really is about the people. And it's about our ability to always, attempt to get better, to work on getting better, and try to make the next roll better than the last.\n\nSo you put all that together. And that really is the secret sauce for our entire company, let alone our exploration effort.\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nIt's clear. And I'll just sneak in a third one and I apologize. You mentioned the importance of pressure. In the old days, reservoir energy in Utica was always something that was a challenge.\n\nHow have you overcome that? And is there may be a different artificial lift strategy out there to keep that tail-producing?\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nYeah, Bob, I think that's why we're in the volatile oil window. We have enough gas in the volatile oil window to help us lift our wells. At this point in time, we don't see that we'll need much artificial lift through the life of these wells. It's being right on that -- the right portion of that phase window.\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nPerfect. Very clear. Thanks so much.\n\nOperator\n\nThank you, Mr. Brackett. The next question comes from the line of Jeanine Wai. You may proceed.\n\nJeanine Wai -- Barclays -- Analyst\n\nHi. Good morning, everyone. Excuse me. Thank you for taking our questions.\n\nOur first question. Maybe just following up on Bob's question here. You've disclosed 7 premium operating basins, which is fantastic. The decentralized model has worked very well for EOG, so far.\n\nBut from an organizational perspective, how many basins would be considered too many basins because you're clearly still evaluating other opportunities? Thank you.\n\nEzra Yacob -- President\n\nYeah, Jeanine. This is Ezra. That's a fantastic question. And here it really speaks to what we think is one of our core competitive advantages.\n\nAnd that's the fact that we run a decentralized organization. That's what allows us to kind of cross-pollinate ideas between divisions. In any industry, the success of running a decentralized organization is being able to push decision-making and accountability down to the employees who are kind of touching the wells and closest to the value creation every single day. When you break it up that way and you think about it that way, we have eight operating teams, and each of those has operated as kind of a fully functioning oil company in a lot of ways if you will.\n\nThey have a full complement of geologists, engineers, accountants, land mines, marketing people, and so on, and so forth. Each of these individuals and asset teams can really handle working across multiple basins and in fact, to a different type of scale, you see the same type of leverage and benefits that we see at the corporate level that exploring different basins really adds to kind of their understanding. I go back to how Ken started this, the Point Pleasant or the Utica play is actually being looked at currently by members of our Oklahoma City team who are quite familiar with the Woodford. The overpressure, the oil window, and the Woodford play and that play really landed a lot of expertise to our understanding of mechanical stratigraphy.\n\nAgain, to reference what Ken was talking about and how the rocks actually break and interact with our completion strategy. And that's -- some of the key characteristics that have helped unlock a number of our unconventional plays.\n\nJeanine Wai -- Barclays -- Analyst\n\nGreat. Thank you. And then for our second question, in terms of operational momentum, are you able to provide any color on what activity looks like heading into year-end and early '23? We noticed that for Q oil guidance is flat at the midpoint quarter over quarter, capex is up, but that sounds like it could be timing related.\n\nBilly Helms -- Chief Operating Officer\n\nYeah. Janine, this is Billy Helms. You're exactly right. It's just the timing factor.\n\nWe're currently running all the rigs that we plan to carry into next year. We'll start looking at adding rigs in different places to go into next year. Based on our outlook for the '23 budget, which will firm up as we get closer to that time. The quarter-over-quarter volume growth is pretty flat, and that's just a function of completing wells late in the quarter that will really roll into next year and that's going to happen in several different plays.\n\nThe Permian probably, the Dorado play, and a little bit in the Eagle Ford as well. So that's just a function of the timing of those completions.\n\nJeanine Wai -- Barclays -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you, Ms. Wai. The next question comes from the line of Kevin MacCurdy. You may proceed.\n\nKevin MacCurdy -- Pickering Energy Partners -- Analyst\n\nGood morning. And just getting back to Utica, trying to do some back-of-the-envelope math on spending there next year. Would a 3-mile lateral cost in the ballpark of around $15 million? And I guess if you did 20 wells, that would kind of put you at around a $300 million spend rate in Utica next year. Is that kind of the right assumption for a rig next year?\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nYeah. Kevin, this is, Ken. What we're talking about now? Those are two 2 to 3-million-barrel wells that we've talked about and less than a $5 F&D cost. We really haven't given out a number as far as what our development costs will be because we have some additional testing and we really do want to drill some of our wells on pads and drill them in packages to see what that ultimate development cost will be.\n\nSo, you can use the $5 F&D and the 2 to 3 million barrels to get a reasonable estimate for well cost.\n\nKevin MacCurdy -- Pickering Energy Partners -- Analyst\n\nGreat. And digging into the marketing strategy a little bit in Utica. I mean, you mentioned that you had plenty of gas takeaway locally, but do you guys have a plan to get that gas out of the basin? And just kind of thinking about the knock-on effect of if the Utica grows, that might have an impact on Southwest PA basis. And is that a concern for your returns?\n\nLance Terveen -- Senior Vice President, Marketing\n\nYeah. Kevin. This is Lance, too. Good morning and thanks for your question.\n\nI'd say, even -- like I talked about earlier, like the marketing component of it is integrated very early on. So I mean, we recognize then that gas-like realizations are weaker. But still, when we look at our overall portfolio and then how the Utica combo competes, it's very competitive. And so your earlier question was just as it relates, when you think about just kind of downstream takeaway in that, again, it comes to just the liquids focus that we have anticipation, I think there's some misconception on kind of the gas race that things are going to look very similar to like the dry gas wells to the east and other competitors that are in the region.\n\nWhen we're going to see lower gas rates that are going to come out of our development. And so when we look at that on a go forward and with the relationships that we have, with the capacity that we see on the processing side, the gas sales, and the takeaway, we're not foreseeing an issue right now.\n\nKevin MacCurdy -- Pickering Energy Partners -- Analyst\n\nGreat. Thank you for taking my question.\n\nOperator\n\nThank you, Mr. MacCurdy. The next question comes from the line of Anon Narayanan. You may proceed.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nHi. This is Neil Mehta. Can you hear me OK?\n\nEzra Yacob -- President\n\nYeah. Neil, we've got you.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nOK. I'm sorry about that. Yeah, it's Neil Mehta here from Goldman Sachs. So, Ezra, I had more of a macro question here, which is we haven't seen US oil production, at least in the weekly move since April of 2022.\n\nThey've been kind of hanging around this plus or minus 12 million barrels a day range. And are you surprised that we haven't seen the pickup in US production that a lot of people are anticipating? And I want to tie that into Slide 9 of your deck, which is showing relative maturity of some of the oil plays like the Bakken, increasingly the Eagle Ford, and even the Delaware. Are we getting to the point where shale is going to have a tougher time growing and we should be thinking about peak shale production in the United States in the foreseeable future?\n\nEzra Yacob -- President\n\nYeah, Neil, it's a good question. Let me take it one piece at a time here. Since early in the year, we've been talking about how we were anticipating a little bit less US growth this year than what many people were forecasting. The reason for that, is clearly there's a little bit of inventory exhaustion going on.\n\nThese basins have been drilled for a number of years. But the biggest thing we based our models on this year was really what we're seeing with, again, what's turned into, inflationary pressures throughout the year. It's the rig counts, the frac spreads, and really the people side of it. There's definitely North American discipline in the E&P sector out here.\n\nBut there are also supply chain constraints that have continued to kind of be felt throughout the entire year this year. I do think coming out of the pandemic, we've had a consolidation across the industry. What we've been left and this is something we've talked about quite a bit too, are you've been left with less companies, and those companies that have the size, the scale, balance sheets, things of that nature to be able to continue to drill and operate. And the majority of those companies are drilling and investing in a way that's more disciplined than what was in favor prior to the pandemic.\n\nSo I think it's really three or four different things that are that have kind of come together to limit US growth. And quite frankly, a lot of those things that I've talked about are not necessarily transitory in nature. Some of these things will really continue into 2023 as well. And so that's why I'd say, entering 2023 again, I suspect our forecast on the oil side will probably be a little bit to the low end of many of the numbers that you're seeing out there.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah, that's helpful. And it helps if it's on the balance sheet. You guys clearly have a fortress balance sheet position in a net cash position now, let's talk remind us again how you're thinking about minimum cash balances and what is the parade optimal capital structure. If you think about your leverage profile.\n\nEzra Yacob -- President\n\nYes. Neil, thank you for bringing that up. It's something that we're we're exceptionally proud of. And we've always said that in a cyclical industry such as ours, the best thing you can have is not just a strong but a real pristine balance sheet.\n\nThere's never really been a cash target for us and there's not one now. We're thrilled to be, as you, kind of said, in a unique position where we're able to strengthen the balance sheet this year, but at the same time return just over $5 billion, $5.1 billion to our shareholders. We've -- as far as the ultimate balance sheet, we have a couple of strategic things. We do have a $5 billion buyback authorization.\n\nWe've talked about using that opportunistically. That's a compelling strategy to go ahead and carry a little more cash on the balance sheet than what we've done historically. But really the strategy, overall for the company is aimed at creating value in the long run, and managing the balance sheet to make the countercyclical investment is a big piece of that. We've talked about having operational in reserve cash just to stay out of commercial paper, but at the end of the day, when we think about a cyclical industry like I said, the balance sheet provides a lot of optionalities to create value.\n\nWe're committed to delivering on our free cash flow priorities and that's -- it's founded and growing and it is a sustainable regular dividend. But it also contemplates the minimum commitment of 60% of free cash flow. And both of those are supported by having a very strong balance sheet and, just in general, being focused on doing the right thing at the right time to maximize long-term shareholder returns.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nMakes sense. Thank you, Ezra.\n\nOperator\n\nThank you for your question. That concludes the question-and-answer session. I will now pass the call back over to Mr. Yacob for final remarks.\n\nEzra Yacob -- President\n\nThank you. We want to thank everyone for participating in the call this morning. And we especially want to thank our employees. They've delivered another outstanding quarter for all of EOG's shareholders.\n\nThank you for listening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTim Driggers -- Chief Financial Officer\n\nEzra Yacob -- President\n\nBilly Helms -- Chief Operating Officer\n\nKen Boedeker -- Executive Vice President, Exploration and Production\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nLance Terveen -- Senior Vice President, Marketing\n\nLeo Mariani -- MKM Partners -- Analyst\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nScott Gruber -- Citi -- Analyst\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nJeanine Wai -- Barclays -- Analyst\n\nKevin MacCurdy -- Pickering Energy Partners -- Analyst\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nMore EOG analysis\n\nAll earnings call transcripts"
}