{
  "companyName": "HubSpot",
  "companyTicker": "HUBS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/hubspot-hubs-q3-2022-earnings-call-transcript/",
  "content": "HubSpot (HUBS -0.95%)\nQ3 2022 Earnings Call\nNov 02, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and thank you for standing by. Welcome to HubSpot Q3 2022 earnings call. [Operator instructions] Today's conference is being recorded. At this time, I'd like to hand the conference over to Chuck MacGlashing, head of investor relations.\n\nSo please go ahead, Chuck.\n\nChuck MacGlashing -- Head of Investor Relations\n\nThanks, operator. Good afternoon, and welcome to HubSpot's third quarter 2022 earnings conference call. Today, we'll be discussing the results announced in the press release that was issued after the market closed. With me on the call this afternoon is Yamini Rangan, our chief executive officer; Dharmesh Shah, our co-founder and CTO; and Kate Bueker, our chief financial officer.\n\nBefore we start, I'd like to draw your attention to the Safe Harbor statement included in today's press release. During this call, we'll make statements related to our business that may be considered forward-looking within the meaning of Section 27A of the Securities Exchange Act of 1933 as amended and Section 21E of the Securities Exchange Act of 1934 as amended. All statements other than statements of historical fact are forward-looking statements, including those regarding management's expectations of future financial and operational performance and operational expenditures, expected growth, FX movement, and business outlook, including our financial guidance for the fourth fiscal quarter and full year 2022 and 2023. Forward-looking statements reflect our views only as of today, and except as required by law, we undertake no obligation to update or revise these forward-looking statements.\n\nPlease refer to the cautionary language in today's press release and our Form 10-Q, which will be filed with the SEC this afternoon for a discussion of the risks and uncertainties that could cause actual results to differ materially from expectations. During the course of today's call, we'll refer to certain non-GAAP financial measures as defined by Regulation G. The GAAP financial measure most directly comparable to each non-GAAP financial measure used or discussed and a reconciliation of the differences between such measures can be found within our third quarter 2022 earnings press release in the investor relations section of our website. Now, it's my pleasure to turn over the call to HubSpot's chief executive officer, Yamini Rankin.\n\nYamini?\n\nYamini Rangan -- Chief Executive Officer\n\nThank you so much, Chuck, and welcome to everyone joining us on the call today. Q3 was another solid quarter for HubSpot with revenue growing 38% year over year in constant currency. We added over 8,000 net new customers in the quarter, growing our customer base to nearly 160,000 globally, representing 24% growth year over year. These strong results reflect our focus on innovation and execution.\n\nOur connected platform is clearly driving value for customers, especially as they look to increase efficiencies, while lowering the total cost of ownership during the period of uncertainty. HubSpot continues to be a mission-critical platform for our customers as they depend on us to stay connected with their customers. On the last call, I spoke about the launch of CMS Free and moving marketing automation down into our start-up year. These plays, combined with our focused go-to-market initiatives, drove strong customer adoption and multihub momentum in the quarter.\n\nBefore I get into some of the trends we're seeing in the business more broadly, I want to reflect on a recent milestone for HubSpot, which was our annual Inbound event in September. This year, as you know, we hosted Inbound in-person in Boston as well as online and had tens of thousands of attendees from all over the world join us. It was clearly a week to remember with incredible speakers and fantastic opportunities to connect with our customers, partners and community. I know many of you attended as well.\n\nSo thank you again for joining us. I left Inbound feeling more energized than ever about HubSpot's future. Through my conversations with customers and partners, it becomes even more clear that we are well-positioned to drive long-term durable growth. And there are three key reasons for this.\n\nFirst, we have a unique opportunity to help our customers with solving the crisis of disconnection. I spoke at Inbound about the prices our customers are facing as a result of disconnected systems, disconnected customers and disconnection from their peers. To solve this crisis, our customers need to be able to seamlessly connect their data, connect with their customers and with each other, all in one place. That's exactly what we've been building at HubSpot with our connected customer platform.\n\nWe already see the value customers are getting from being able to connect their entire front office. For example, take GrowthLab Financial, a financial services company. Their growth was limited by disconnected tools and a legacy CRM platform. Without a central platform, their team spent hour's manually tracking prospects and didn't have the insights they needed to optimize their growth.\n\nThey consolidated onto the HubSpot CRM platform with Marketing Hub, Sales Hub and Service Hub. GrowthLab now uses automation to boost conversion and shorten deal cycles, and leverage the CRM data to get insights on revenue attribution, so they can make more data-driven decisions. Since implementing HubSpot, GrowthLab Financial doubled their revenue and saved a significant amount of time eliminating manual tasks. This is just one great example of how scaling companies can grow better with HubSpot's connected CRM.\n\nThe second reason we're well-positioned is that our market opportunity is large, expanding and underserved. We operate in massive underserved markets that are forecasted to grow to over $70 billion by 2027. Within this market, we have multiple levers to drive durable long-term growth. Our land and expand motion is working with a majority of our customers trying to treat product before purchasing.\n\nAnd our pathways for expansion have diversified with the breadth and depth we have added in our product. We're also launching into new product categories like payments and commerce, which will continue to open up new avenues for future growth at HubSpot. Even in the weeks since Inbound, we have a number of new exciting features in private beta, including payment schedules and native invoicing. We're encouraged by the long-term opportunity to help B2B companies transform their buying processes and sell easily online.\n\nFinally, our product innovation is cranking. We announced over 80 new product enhancements at Inbound to meet our customer's evolving needs and help them optimize for connection. Two product highlights where our new campaigns 2.0 tool and customer journey analytics, both are crafted to give businesses a more unified view of their customers experience, and bring data together for deeper insights. We're thrilled to see the positive feedback from data so far.\n\nAs we look ahead, we're focused on maintaining the pace of innovation, so we can drive even more value for customers and emerge stronger as the connected platform of choice for the mid-market. I'm energized by the opportunity we have, to solve the crisis of disconnection for our customers, serve mega markets and continue to drive the pace of product innovation in order to set ourselves apart. Next, I want to talk about the demand environment, we see today and reiterate our playbook for managing through it. Last quarter, I talked about the demand trends we were seeing in the business through the end of July, including a lengthening of deal cycles, and more decision-makers involved in deals.\n\nSince then, the macro environment has become incrementally more challenging. We see two clear trends in this environment based on our customer and prospect conversations. On one hand, deals are taking longer to close. There are more decision-makers involved, more approval layers and budgets are tighter.\n\nWe continue to see this across the geographies and segments we serve. On the other hand, HubSpot is emerging as a platform of choice to help customers get through these uncertain times. Our customers need more leads, better conversions and better customer experience. But they need to do it all with less.\n\nOur value proposition of easy-to-buy, easy-to-use and easy to build, resonates even more now as customers are looking to consolidate their tech stack. Despite the softer macro environment, I'm confident in HubSpot's playbook for resilient growth through the cycle. Our playbook is based on three core principles that served us well during the pandemic and again, through the macro volatility this year. We talked about these principles last quarter, but there was repeating.\n\nThe first is solve for the customer, even during uncertain times, one thing we're certain of is that, solving for the customer is good business. What this means right now is that, we are helping customers understand the value of consolidating onto a connected platform and the impact it can have on their total cost of ownership. We're also providing even more functionality at the lower end. We moved high-value features like marketing automation, down to starter, and helping early stage businesses get online with three CRM and CMS.\n\nThese plays are resonating with our customers, and you can see it in our results. Second, we will continue to invest in innovation to emerge stronger. We're being more prudent with our hiring as well as discretionary spend, but remain committed to investing in innovation. In fact, we're so thrilled to see that our product investments resulted in HubSpot being recognized as a leader in the Magic Quadrant for B2B marketing automation platforms by Gartner this past quarter.\n\nMoving forward, we'll continue to invest and innovate and functionality to help scaling companies optimized for customer connection. Lastly, we execute with focus. For us, it is all about controlling the controllables. We're focused on driving expansion through cross-sell and upsell motions and the percentage of ARR from customers with three-plus hubs grew nicely within this quarter.\n\nWe're executing on our bimodal strategy with strength in both net customer additions at the lower end and momentum among larger customers, driving double-digit ASRPC growth. And we're continuing to balance growth and profitability through more measured hiring and tighter control of discretionary spreads. heading into the end of the year, I feel energized. We have a clear opportunity ahead to drive value for our customers.\n\nOur teams are focused on execution, and we have the right playbook in place to drive growth in this uncertain environment. With that, I'll hand it over to Kate.\n\nKate Bueker -- Chief Financial Officer\n\nThanks, Yamini. Let's turn to our Q3 2022 financial results. Third quarter revenue grew 38% year over year in constant currency and 31% on an as-reported basis. Q3 subscription revenue grew 32% year over yerar, while services and other revenues decreased 13% on an as-reported basis.\n\nDomestic revenue grew 33% year over year in Q3, while international revenue growth was 44% in constant currency and 29% as reported. International revenue represented 46% of total revenue in Q3. We added over 8,000 net new customers in the quarter, bringing our total customer count to nearly 160,000, up 24% year over year. A big driver of the strength this quarter was customers adopting the starter CRM suite as HubSpot continues to emerge as a platform of choice in times of certainty and uncertainty.\n\nAverage subscription revenue per customer grew 12% year over year in constant currency and 7% on an as-reported basis to $11,200. The primary driver of this strength continues to be professional and enterprise customers adopting multiple products. Despite the more challenging macro environment, we maintained a healthy growth retention rate in the high 80s as customers look to HubSpot platform to drive increased efficiencies. Net revenue retention was 109% in Q3, down quarter over quarter as a result of slower net upgrades, particularly in the marketing contact and seat expansion motion.\n\nDeferred revenue as of the end of September was $474 million, a 26% increase year over year. Calculated billings were $444 million in Q3, growing 34% year over year in constant currency and 26% as reported. The remainder of my comments will refer to non-GAAP measures. Third quarter gross margin was 82%, up two points year over year.\n\nSubscription gross margin was 85% in Q3, while services and other gross margin was negative 49%. Third quarter operating margin was 9%, including a one point margin headwind from the impact of foreign exchange. Net income in the third quarter was $35 million or $0.69 per fully diluted share. At the end of the third quarter, we had over 7,400 employees, up 35% year over year and down six points sequentially.\n\nWe expect our hiring to moderate further in Q4 and to exit the year with headcount growth in the mid- to high 20s. As we discussed last quarter, hiring for the remainder of the year will be focused in R&D and revenue-generating sales headcount. capex including capitalized software development costs, was $25 million or 6% of revenue in Q3 and free cash flow in the quarter was $36 million or 8% of revenue. Finally, our cash and marketable securities totaled $1.4 billion at the end of September.\n\nAnd with that, let's review our guidance for the fourth quarter and full year of 2022. As Yamini described in her remarks, the macro environment has become incrementally more difficult through October. It's taking customers longer to make decisions, causing deal cycles to elongate. There are more people involved in the approval process and budgets have tightened.\n\nOur guidance assumes that these weaker macroeconomic conditions persist through the remainder of the year. For the fourth quarter, total as reported revenue is expected to be in the range of $444 million to $446 million, up 20% year over year at the midpoint. We expect foreign exchange to be a nine point headwind to as reported revenue growth in the fourth quarter, representing an incremental $4 million headwind relative to our previous forecast. Non-GAAP operating income is expected to be between $47 million and $49 million.\n\nWe expect foreign exchange to be a two-point headwind to operating profit margin in the fourth quarter. Non-GAAP diluted net income per share is expected to be between $0.82 and $0.84. This assumes 51.2 million fully diluted shares outstanding. And for the full year of 2022, total as reported revenue is now expected to be in the range of $1.705 billion to $1.707 billion, up 31% year over year at the midpoint.\n\nWe expect foreign exchange to be a 6-point headwind to as reported revenue growth for the full year of 2022. Non-GAAP operating income is now expected to be between $152 million and $154 million. We expect foreign exchange to be a one point headwind to as reported operating profit margin for the full year of 2022. Non-GAAP diluted net income per share is now expected to be between $2.48 and $2.57.\n\nThis assumes 51.1 million fully diluted shares outstanding. As you adjust your models, keep in mind the following. We continue to expect capex as a percentage of revenue to be roughly 5%, and now expect free cash flow to be about $195 million for the full year of 2022, reflective of the incremental headwind from the strengthening of the US dollar relative to our prior forecast. While it's too early to provide formal guidance for 2023, given the material moves in foreign exchange rates this year, we thought it would be helpful to quantify the impact of foreign exchange on 2023 revenue.\n\nAt current spot rates, we expect a four point or $70 million headwind to as reported revenue growth for the full year of 2023. And with that, I will hand things back over to Yamini for her closing remarks.\n\nYamini Rangan -- Chief Executive Officer\n\nThank you so much, Kate. I want to close by emphasizing that HubSpot is operating from a position of strength. We've built a robust connected customer platform that is meeting the evolving needs of our customers. We have a strong balance sheet and an incredible team and company culture that allows us to attract and retain top talent.\n\nWe're thrilled for HubSpot to be ranked number one in employee happiness among top rated large companies by comparably just last month. Our culture and people continue to be a competitive advantage for HubSpot. Looking ahead, we will continue to adapt to the realities of the environment without losing sight of our mission to become the number one CRM platform for scaling companies. Thank you so much to our customers.\n\nour partners, our employees and shareholders. With that, operator, let's open up the call for questions.\n\nOperator\n\nThank you. [Operator instructions] The first question we have comes from Brian Peterson of Raymond James. Your line is now open, Brian.\n\nBrian Peterson -- Raymond James -- Analyst\n\nThanks for taking my question, and congrats on the really strong quarter. So maybe taking a step back here, Yamini, we've heard from a number of companies that the macro got incrementally worse over the course of the quarter. It sounds like that was the case for HubSpot as well. Would appreciate any color maybe on what's changed and how you're thinking about the macro impacting fourth quarter guidance?\n\nYamini Rangan -- Chief Executive Officer\n\nYup. Thanks a lot, Brian, for the question. Yes, we are seeing many of the same trends in our customer base that we saw in Q2. It was just a bit more intensified in Q3.\n\nWe saw the longer deal cycles that we talked about in Q2. We saw more decision makers getting involved in deals and more approvals needed. Typically, we will talk to the VP of marketing sales for approval. Now we're talking to the CFO, CEO and sometimes even the Board.\n\nProduct evaluations are taking longer as buyers are generally much more risk averse and the budgets are tight now. So look, I think we're seeing a lot of things that are very much in line with what you've heard from other companies this quarter, the overall environment is just incrementally more challenging than it was in Q2. Now having said that, Brian, we continue to win and our value proposition resonates really well in this environment. Customers want a clear value case and they want to clear business case for driving efficiency.\n\nSo we're working with our champions. We're working with our point of contact with the customers to be able to articulate the business case, and then we're able to present to the C suite and board. Our customers want ease of use and ease of implementation, because the combination of those two lead to time to value and that's what matters in this environment. Now both of those, ease of use and ease of implementation, they both historically been core differentiators for HubSpot and continues to be a differentiator now, and it's really important in this environment.\n\nAnd then finally, I'd say that customers are looking to standardize on a platform. They're looking to eliminate point solutions. They are looking to reduce their budgets and they're looking to us to be able to bring more data and have a single platform, we're now no longer nice to have solution, we're just becoming a must-have mission-critical solution for our customers. So all of those are resonating within our customer base, and you can see that within our results.\n\nNow look, looking forward, we don't have a crystal ball, but we expect these conditions to persist in Q4 and possibly even into 2023. We're navigating through all of these choppy waters from a position of strength and will remain exceptionally focused on executing the playbook that I just walked through.\n\nBrian Peterson -- Raymond James -- Analyst\n\nGreat. I appreciate the color. Maybe to follow up in terms of the value of the platform. Were there certain products kind of on top of marketing that you saw a particular strength in the quarter, whether that's Sales Hub or Service Hub? I'd love to understand maybe where the cross-sell was really successful this quarter? Thanks, guys.\n\nYamini Rangan -- Chief Executive Officer\n\nYeah, Brian. I think the combination of marketing and sales is becoming exceptionally more important right now. When I talk to customers, they are expecting much more from their marketing and sales for organizations. They are expecting more leads, better lead quality, better conversion, better visibility into the pipeline and they want all of this for less, right? And that means we're definitely seeing the value of having a connected marketing and sales hub solution that's what is really key within our customer base.\n\nAnd so, when we talk about multihub, most of our multi-hub have Sales Hub and Marketing Hub involved, and we're helping our customers kind of now to get through this environment as well.\n\nOperator\n\nThank you. The next question we have from the phone lines comes from Mark Murphy of JPMorgan Chase. Your line is now open, Mark.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYeah, thank you very much. I'll add my congrats on the execution in a tough environment. So I wanted to ask you, as you're building out these more sophisticated enterprise features, which started with custom objects. Could you share perhaps how some of the upper thresholds are changing for HubSpot? If we think about kind of the upper bands for MRR or even speed counts for Sales Hub, as you gravitate to the enterprise end up -- mostly what I'm wondering is do those continue to increase even despite the macro that you're encountering?\n\nYamini Rangan -- Chief Executive Officer\n\nYeah, Mark, thanks a lot for your question. Look, from a segmentation strategy, we're very much focused on the two to 2,000 segment. So for us, the upper bounds of the segment continued to be 200 to 2,000 person employee company. The only thing is we're winning our fair share within that market.\n\nAnd as you rightly pointed out, over the past couple of years, we have invested going upmarket with features like custom objects at Inbound we announced more than 80 new enhancements and features across the entire platform and a number of these enhancements and features are really driving better UI customization, better data management, advanced permissioning, granular ability for admins to control the environment. So a lot of the features have enabled us to win our fair share going up market and in this environment, one of the things that we see is customers, as I just talked about, care about better visibility, but they also care about better time to value and cost-effective solution. So going back to really the fundamental value proposition of HubSpot were easy to use, but we have very powerful features, and that makes us exceptionally competitive in that tough market. So we're remaining true to the segmentation and winning our fair share of that market.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nI understand. Thank you, Yamini. And just as a quick follow-up, I was wondering if you or Kate, could you just clarify because I think we're trying to maybe understand somewhere in the results where we would see some of the signs of incremental strain. But just based on what you saw, are you trying to convey that the month of September and October did, in fact, feel a bit tougher say than July and August in terms of the friction in the selling cycles because I think that's generally what we're hearing elsewhere.\n\nYamini Rangan -- Chief Executive Officer\n\nYes, it should be very clear. What we saw in Q3 was just an incrementally more challenging environment than what we saw in Q2. And specifically, budgets are tight and every approval is being carefully considered. And because of that, the approval processes are longer, customers are spending a little bit more time getting a value case delivered to their fee level for approval and sometimes even going to the board.\n\nSo we're continuing to see that pressure. We're also seeing the need for a crystal care plan to deliver value, which means more time to understand implementation plans, user adoption plans, more times to understand the training plans. And all of this means that there is just a lot more rigor, more demos, and more conversations. So we definitely are seeing incrementally more challenging environment from a macro perspective.\n\nHaving said that, like we talked about, we've put in some place from being focused on the customer and those plays continue to work at the bottom end, which is where you see the strength in net adds and our multi-hub value proposition is resonating. And so we'll continue to work through this choppy environment.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nExcellent. Thank you very much.\n\nOperator\n\nThank you. We now have Samad Samana from Jefferies. Please go ahead when you're ready.\n\nSamad Samana -- Jefferies -- Analyst\n\nHi. Great. Thank you. And I'll just echo great work and focus by the whole organization.\n\nSo on ops, spotters, great job. Yamini, maybe the first one for you. I know you talked about the macro getting incrementally worse, longer cycle, more approval. But what you didn't mention is a change in the top of the funnel or maybe Inbound interest.\n\nSo just could you shed some light on, are you seeing any changes in terms of the customers that are reaching out or coming into the top of the funnel and just interest levels, maybe is that even uptick because you had Inbound in this quarter? Just maybe help us understand what you're seeing at the top of the funnel versus just in terms of the deal closings or the cycles?\n\nYamini Rangan -- Chief Executive Officer\n\nSamad, thanks a lot, and I will double down and emphasize, I think, congratulations to the entire company, both in the product and flywheel and the entire company for executing in a very tough macro environment. Look, on the demand side, if you consider a year ago, it was primarily all Inbound. So with a lot of people raising hands and coming to us mostly qualified. And so it was fairly quick to take that kind of a qualified lead and convert it into a customer win.\n\nWhat we are beginning to see is that, that level of Inbound has changed. And right now, it's a combination of that and our customer success team, our sales organization, going to new customers and going through prospects and having conversations about HubSpot. So it's a combination of people raising their hands and coming to us. And that part of it has slowed down a little bit.\n\nSo it's us going back to our installed base and having conversations on how we can add more value. So certainly, from a demand perspective, we see a pretty big shift from last year and somewhat of a shift from the first half of the year. Having said that, what I'd say is like there's just a higher bar to action within the pipeline. There's more conversations, more approvals and more demos that are needed to get to action.\n\nAnd so the way, I would characterize, it is demand has slowed. We've compensated it by going out and proactively having conversations to the customer base, and it takes much longer for us to close, and we continue to be very, very focused on executing in this environment.\n\nSamad Samana -- Jefferies -- Analyst\n\nVery helpful. And then maybe, Kate, if I could just ask a quick follow-up, I wanted to make sure, I think you said a four point FX headwind, where things stand today for 2023 revenue, was that -- one, did I hear that correctly? And two, is that the level that you had assumed when you gave the flat margin guidance at the analyst day, or should we rethink that as well?\n\nKate Bueker -- Chief Financial Officer\n\nYeah. Thanks for asking. I do think it's a really important point for us to communicate. As you know, foreign exchange has been one of those things that has moved pretty dramatically throughout 2022, but frankly, like even within the back half of Q3.\n\nAnd so you are right, given sort of current foreign exchange rates, we would have a four point headwind to 2023 revenue growth, and that's about a $70 million nominal headwind. Foreign exchange did get harder in the last couple of months. You heard us talk about our Q4 guidance as having an incremental $4 million of headwind relative to the last time we guided you should assume that 2023 saw similar trends to that.\n\nSamad Samana -- Jefferies -- Analyst\n\nOK. Thank you so much.\n\nDharmesh Shah -- Founder and Chief Technology Officer\n\nSamad, as far as we did -- as far as the 8% margin that we talked about at the analyst day, it did incorporate where rates stand today.\n\nSamad Samana -- Jefferies -- Analyst\n\nOK. Perfect. Thank you for clarifying. Have a great day.\n\nOperator\n\nThank you, Samd. We now have Arjun Bhatia of William Blair. Please go ahead. Please go ahead when you're ready, Arjun.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nYes, perfect. Thank you for taking my questions and I'll add  my congrats on the quarter. Yamini, understandably as more buyers and more approval levels get involved in the process that creates a tougher selling environment. But you did mention that you're getting a little bit more exposure, higher in the organization to the C-suite to the board.\n\nWhat does this do for HubSpot in your ability to pay yourself as a more strategic partner to make a broader platform sale to maybe buyers that you didn't have access to as much in prior years? And how equipped do you think the sales team is to make that pitch to those higher-level buyers at this point?\n\nYamini Rangan -- Chief Executive Officer\n\nYup, really good question. Certainly, more CEOs, CFOs, CTOs than we have dealt with in the past. And it is -- while the conversations take longer, they are really good conversations. And the way, I'd characterize it is that when we talk to the C we've written our customer organizations, there are a few things that matter to them.\n\nFirst is time to value. They really care about how quickly they're going to get to value and how their teams are going to see the impact. And so part of it us having a clear articulation of value as well as cost savings to the C-suite. The second is really talking about the value of a consolidated platform.\n\nThere -- over the past couple of years, a lot of these companies have ended up buying disconnected point solutions and that's costing them. And so when we have conversations with CEOs and CFOs, we talk about how we can help them with eliminating some of these point solutions and consolidating and seeing the value of a consolidated platform and that certainly resonates. Now, on the second part of your question, this has meant that we've doubled down on enablement for our sales team for our customer success team as well as the partner organization. We've rolled out TCO playbook as well as value playbook so that they can bring these conversations earlier in the sales process.\n\nThey can proactively talk about how we can help them get to time to value as well as cost savings. And that part of the enablement is something that we're doubling down, and we're doubling down in terms of execution as well. So absolutely see all of those within the pipeline.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nOK. Perfect. Very helpful. And then the other part, your new customer adds actually ticked up, and this is something that we're not seeing, I think, with your peers where new customers have seen greater headwinds.\n\nI'm curious, as you look at the new customer cohort that's coming in, are you seeing more replacement opportunities even in that starter CRM suite where customers are wanting to rip out existing solutions versus more of a greenfield opportunity than you may have seen in the past?\n\nKate Bueker -- Chief Financial Officer\n\nYeah, thanks for the question. Maybe I'll dive in. You are right. The net adds for the quarter came in a little better than we had even expected.\n\nAnd where we saw the strength was really at that starter here, particularly in the starter CRM suite. These are not customers that typically are working and replacing. These are customers where HubSpot is the first tool that they are largely using. And there's a couple of things that we think really contributed to the strength this quarter and talked a little bit about them.\n\nBut you may remember, we took a bunch of actions last quarter that were really customer-first in nature that leaned into the value proposition at the starter tier. One is that we added automation to Marketing Hub Starter. We launched CMS Free at Inbound, and we continue to experiment on pricing and packaging in that starter tier. And it's really the combination of these three actions that we believe drove the increase in net customer additions quarter over quarter.\n\nIt's not something we solve for. It's an output. Our goal is really to drive both long-term and short-term growth in the business. But this quarter, the plays that worked really drove customer additions and really focused customer additions at the low end.\n\nThe one thing that I would just add about that is there's two pieces of the KPI equation. One is the net customer additions, the other is ASRPC. And so when you see really strong quarters like this one in terms of net customer adds, particularly at Starter, what you're going to see on the other side is a little less strength in the ASRPC growth. And as a result, what I would encourage you to see in like a Q4 is that ASRPC will likely be more like 10% in constant currency.\n\nDharmesh Shah -- Founder and Chief Technology Officer\n\nAnd one thing I'd like to add just on that starter tier is that, obviously, it's nice to have the revenue from those 8,000 new customer adds. But the other way, it helps is that kind of part of our bimodal strategy, which is -- as we get more and more customers, it kind of helps with our brand in the word of mouth, which has been a strong driver of growth for HubSpot historically. And the second piece is that, we're looking to build a CRM platform that's a defacto standard in SMB. And the more customers we have, the more attractive the platform is for third-party applications to build on for solutions partners to kind of partner up with our customers.\n\nSo it's just -- it's a net positive all around. But at starter tiers, it's been a really strong driver for us.\n\nOperator\n\nThank you. The next question comes from Rishi Jaluria from RBC. Please go ahead, Rishi. Your line is now open.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for taking my questions. Nice to see continued execution in spite of the macro. I want to go back to the commentary about the opportunity to consolidate point solutions.\n\nI think that makes a lot of sense in theory, I was wondering, if you could point to any examples of that sort of behavior that you've already seen? And if there are particular areas within the Martech Stack or within CRM that you're already seeing that sort of interest from existing customers? And then I've got a quick follow-up.\n\nYamini Rangan -- Chief Executive Officer\n\nYeah. Rishi, the elimination of foreign solutions is a place where customers look to as their budget gets super constrained, right? And again, an example in the prepared remarks of one of our customers kind of consolidating, there are many more like that, that we're having conversations. We have a ERP software solution organization in North America. So we're using multiple tools for marketing as well as their sales efforts, and all of that was extremely manual siloed and so they looked to us.\n\nAnd over a period of time, we had multiple conversations in initially started with Marketing Hub and then extended to marketing and sales and eliminating six tools as we were looking to help them consolidate their go-to-market stack. And so that led to not only this improved marketing efforts, but also reducing their overall spend. So a number of customers. Now, I'm not saying that these are easy.\n\nI'm not saying that, these are quick because that's not happening within this environment. But when we start with either marketing or sales, we do have the opportunity to engage with our customers strategically and talk about their entire stack and how we can help them consolidate their stack.\n\nOperator\n\nThank you. We now have Alex Zukin of Wolfe Research. Please go ahead when you're ready.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys. So just maybe two numbers questions for me. I guess I want to understand, given the commentary on the incremental macro and demand environment, which doesn't seem to be denting gross retention today. I guess, how do we think about your assumptions for gross retention for Q4? And also net revenue retention, that 109%, do we -- like does it kind of go down and then stabilize at some notional level when we think about Q4 and beyond? And then on the margin side, I guess to the -- is it fair to assume you're reiterating kind of the margin guide you gave for 2023 at the analyst day? And is that -- just remind us how you think about that balance of growth and profitability.\n\nAgain, in the context of the first question, if you do continue to see the macro deterioration, what are the levers that you have for next year?\n\nKate Bueker -- Chief Financial Officer\n\nYes, why don't I start and then Yamini, to the extent that you have comments to add, please don't hesitate to dive in. You're right, Alex, I shared in the prepared remarks, data points for both growth and net retention this quarter remained in the high 80s. Net revenue retention fell to 109%, and that was a result of really lower net upgrade motions from that gross retention. We've talked about this.\n\nWe talked about it on the last earnings call. We talked again about it at analyst day that we thought we would see pressure on that net revenue retention in the near-term, really as a result of the macro environment factors sort of the difficulty that we're seeing there. And so I would expect that you would see Q4 net revenue retention continue to be pressured for like all the same reasons that we are seeing in Q3. I think the good news in all of this is that we have seen the customer dollar retention really stick in the high 80s, into Q3 and again into October, like our customers are staying with HubSpot.\n\nThey are doing things to optimize like cleaning up contacts and eliminating our new seats. They're upgrading seat at potentially a lower rate. But we think that it puts us in a really nice position as we start to see the economy turn to really lean into that growth with the recovery. Over the long-term, we still feel good about 110% plus.\n\nBut to your question, in Q4, we think will continue -- net revenue retention will continue to be pressured. And then on your margin question, as it relates to the 2023 margin that we talked about at the analyst day, look, if I just take a step back, I think that about 2023 as having a few things that are really driving the margin profile for the year. The first is we hired pretty aggressively in 2021. We hired pretty aggressively into the first half of 2022.\n\nAnd we want to realize the productivity efficiency from these hires. But when you think about 2023, you're going to see a full year of the cost associated with that hiring. The second thing that I would say is we have actually pulled back pretty significantly and taken a number of steps to reduce hiring in the back half of this year and reduce overall discretionary spending in things like T&E and facilities, and we're going to continue to do that as we move into 2023. And then finally, we talked a little bit about foreign exchange and the impact on 2023.\n\nThere is real FX headwind to operating margin. It's about one point in this year 2022. It's an incremental point in 2023. And so if I just sort of step back and think about all of those things, we're doing a bunch of -- or taking a bunch of actions to be really prudent in our spending and we're going to continue to do that into 2023.\n\nBut we will retain investment in certain areas like R&D and revenue-generating headcount to preserve growth both in the near-term and long-term. So all that said, we said 8%, we're committed to delivering 8% and we will share a very specific guidance with you when we announce our Q4 results.\n\nOperator\n\nThank you. [Operator instructions] We have the next question from Gabriela Borges of Goldman Sachs. Please go ahead when you're ready.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nGood afternoon and thank you. One clarification on the earlier demand comments. Is the rate of change still getting worse in 4Q or is it stable at the new lower demand level? And then for my question, I want to ask about the earlier comments on the shift in demand from more of an Inbound merchant to HubSpot catalyze mission. What are the implications for customer acquisition costs longer term? Do you think that this dynamic is more temporary or structural in nature? And I'm looking to understand as well, is it cheaper for HubSpot to sell -- to acquire $1 in the installed base or in the new customer lands? So a couple of things in there, I would appreciate the color.\n\nThank you.\n\nYamini Rangan -- Chief Executive Officer\n\nGabriela, multiple questions there. I'll try to answer those and I'm sure Kate can jump in there as well. \n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nThank you.\n\nYamini Rangan -- Chief Executive Officer\n\nIn terms of the demand, we did see an incrementally more challenging environment from a demand perspective in Q3 than we saw in Q4. It's a new level, it's not getting worse. It is an incrementally more challenging demand environment than Q2, and all of the things that we talked about, more conversations, more time to get approval, more demos. All of that adds to that incrementally challenging environment.\n\nAnd when I talked about last year, almost everything that we did was just Inbound where we had customers coming in, was in their hands coming to us, wanting digital transformation. Right now, that is not the kind of tailwind that you can hear from all of the macro commentary at abating even other peers within the industry. It's a combination of some of the Inbound demand, the digital trend is continuing, but it is kind of metered by the cyclical macro trends. And so partly, our teams have to go engage with our customers and identify opportunities for them to save cost or consolidate on a platform or continue on the digital journey.\n\nAnd yeah, I think it's cyclical in nature. I think it's based on what is currently happening from a macro environment perspective. And the overall structural need for digital and the belief that our customers have in digital transformation has not changed. Kate, do you want to add anything on the latter part of the cash question?\n\nKate Bueker -- Chief Financial Officer\n\nYeah. Why don't I do that. I think, Gabriela, what I at least tried to communicate during the analyst day is that we have a number of different motions to acquire new customers. And we are continuing to make investments in all of those motions that we think are over the long term going to drive real leverage on the sales and marketing side.\n\nSo we talked about a number of them at the analyst day. We're investing in the data and systems that are really designed to improve rent efficiency that helps a lot of this all-bound motion that Yamini is talking about. We're continuing to invest in our product-led freemium motion. We've been doing that for a number of years, and we still think there's a lot of runway there.\n\nAnd we're investing in linear growth opportunities by commerce, right? And so all of those are long-term bets for us that will take time to impact the P&L, but will ultimately drive nice leverage in our go-to-market. In the more near-term, we do have a number of plays that are focused on driving increased productivity in the sales organization. Again, Yamini talked about a number of these. We have invested pretty aggressively in sales enablement.\n\nWe're arming both sales teams and also our customer success teams with TCO playbooks that really helps them engage customers in a relevant way at the moment. We're leaning into the partner channel that's always been a successful channel and it's even more important when we see sort of upmarket more complicated multiproduct deals. And we're really looking at our own marketing organization to drive efficiencies and top-of-funnel demand investment. So all of those things we believe can translate into higher sales productivity even in this more difficult environment.\n\nOperator\n\nThank you. The next question comes from the line of Keith Weiss from Morgan Stanley. Please go ahead when you're ready, Keith.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. Thank you, guys, and thank you for taking the questions. Really nice quarter in an environment that everyone on our side of the fence, we're definitely quite worried about given the macro trends that we're seeing. In particular, we're most worried has been in Europe.\n\nAnd so I was wondering, one, if you could kind of get your guys' perspective on trends in Europe versus the U.S.? I know you guys talked about Europe a little bit last quarter. Has that -- incremental weakness, has that spread into the U.S. more so because of your team numbers were -- or your international growth was strong this quarter on a constant currency basis? And then two, when you're talking about these macro impacts, it sounds a lot like it's new customers coming in the door, but the new customer count was good. Am I misunderstanding that is the like elongation of sales cycles, is that on upsells as well as bringing new customers in the door or like where did that really rear its head? Thank you.\n\nYamini Rangan -- Chief Executive Officer\n\nYeah, let me answer the first one, and then maybe Kate can answer the second part. So international revenue grew 44% in constant currency in Q3. That's pretty good in the macro environment like this. As we mentioned before, even starting in Q1 and certainly in Q2, the trend for longer deal cycles started in EMEA.\n\nBut however, what we're seeing now is the macro environment is just broad-based. We're now seeing the trends that's starting at kind of across all segments and all geos. So really not a notable difference in EMEA versus North America for now.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nThat's helpful. Thank you.\n\nKate Bueker -- Chief Financial Officer\n\nYeah. Keith, you cut out a little bit, and I think you were asking whether or not elongated deal cycles were seen across both new customers and existing customers. The answer we are seeing elongated sales cycles everywhere. And so there isn't anything that I would necessarily call out other than what Yamini has already talked about, which is the action is just higher across the board.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGot it. So when we see your new customer count actually like improving nicely in this quarter despite those elongated deal cycles. Is it a difference in kind of like the starter addition and sort of the experimentation you're doing there, enabled better new customer additions at the low end, but the higher-end stuff is where you saw the longer deal cycles?\n\nKate Bueker -- Chief Financial Officer\n\nI mean, you are exactly right. The investments and experiments we're doing at the low end with our freemium motion and product-led growth are the key drivers for our quarter-over-quarter uptick in new customer additions.\n\nOperator\n\nThank you. We now have a question from Brad Sills of Bank of America Merrill Lynch.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. I wanted to ask a question around Service Hub. It's a big category and one where you've made a big step forward with the new release earlier this year.\n\nJust curious, is there a different sales audience here versus sales and marketing versus support, particularly as you go upmarket or is it that platform sale here where you're already in sales and marketing you've got that warm lead? Just curious to get your thoughts on just the adoption curve for Service Hub versus sales and marketing at your end of the market? Thank you.\n\nDharmesh Shah -- Founder and Chief Technology Officer\n\nYeah, thanks for the question. So I mean, as you noted in last quarter, we kind of did a relaunch of Service Hub Pro with a bunch of really pivotal features, including SLAs and mobile health desk and Inbound calling. And that's really going to kind of open the door for kind of more sophisticated service teams to be able to implement Service Hub. And to kind of get to your question, what's happening now with Service Hub, we kind of asked ourselves a post launch are more people buying Service Hub? Are they adopting the feature sets more readily? Are they happy with the product? And the answer to all those questions is yes.\n\nSo we're overall kind of happy with where Service Hub is headed. But right now, we're still seeing a lot of interest in kind of multi-hub deals, a lot of cross-sell between marketing and sales and going to what Yamini spoke of earlier, people just want visibility into the entire market sales pipeline going all the way to customer service and success. So Service Hub right now is a kind of strong participant in that multi-hub cross-sell opportunity. Over the midterm, we think it will become an increasingly -- increasing large opportunity for being a kind of front door where people come in as a result of service having then we sell marketing and sells up to those customers.\n\nBut right now, very strong, I'm looking at cross-sell motion and multi-hub deals. But we're kind of pleased with the progress.\n\nOperator\n\nThank you. We now have Michael Turrin of Wells Fargo Securities. Please go ahead when you're ready.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHi, there. Thanks. Obviously, a lot to talk about. I mean, I just wanted to take a step back and the two key metrics that we tend to focus on, just based on the disclosure, the net new customers and the ASRPC number.\n\nWith 8,000 net new added and 14% constant currency growth on that number in Q3, I'm not sure we've seen those metrics work as well and balance this quarter as what we're generally used to seeing. So I can appreciate the commentary around the starter. I think that's useful. But can you just talk more about the interplay? I know you don't necessarily manage the business to these two inputs, but the reasons that they're both coming through so well, particularly given a tough macro backdrop, I think it's just useful for us all to hear a bit more about.\n\nThank you.\n\nKate Bueker -- Chief Financial Officer\n\nYeah. Thank you, Michael. I mean, in truth, the trend that we're seeing this quarter and the KPIs are a continuation of some of the trends that we've been seeing for a while, particularly in ASRPC, our strength in installed base selling is very much aligned with the platform value that you are hearing from Yamini at that professional and enterprise. And that is what is enabling us to continue to grow ASRPC even with the larger customer ads at the low end.\n\nOperator\n\nThank you. We now have Ken Wong from Oppenheimer. Please go ahead when you're ready. We have had no response from the line.\n\nKen Wong could you come to the line if you're on muted locally? We have had no response.\n\nChuck MacGlashing -- Head of Investor Relations\n\nOperator, move on to the next question.\n\nOperator\n\nWe now have the next question from Parker Lane of Stifel. Your line is open.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nYeah. Hi. Thanks for taking the question. Wondering if you could comment on the general health of the partner channel.\n\nA lot of your agency partners are small businesses themselves. So wondering if they're seeing any added pressure here. And just overall, what is the performance of the agency partner channel look like relative to your own direct sales efforts and Inbound demand?\n\nYamini Rangan -- Chief Executive Officer\n\nYeah. Parker, really good question. I think, look, no one is immune to the macro headwinds that we are overall seeing. So I think if VPA partners will also see it.\n\nNow having said that, we have about 6,000 partners within our overall ecosystem and they contribute about 40% of our revenue. Over the last couple of years, we have invested pretty heavily in the partners in terms of enabling the partners in terms of helping them kind of really transform from being a marketing agency to a full-fledged CRM implementer and being able to take our upmarket customers and drive sales distal for of market customers. And I'd say that is working really well. Partner contribution to total rep-driven MRR, both what they're sourcing as well as what they are co-selling with HubSpot is doing well.\n\nIt was pretty high in Q2 and it continued to be pretty high in Q3, and that's sign that partners are very engaged and they are moving on the journey with us as we really provide a platform for scaling companies. So we're happy with how our partners are executing and they're executing in a tough environment. So huge thanks and shout out to them.\n\nOperator\n\nThank you. We now have Sarah Hindlian from Macquarie. Please go ahead when you're ready.\n\nSarah Hindlian -- Macquarie Group -- Analyst\n\nGreat. Thank you so much for squeezing me in. I really appreciate you it. Maybe I want to ask a little bit more of an access question.\n\nWhen you're in year-on-year meetings and you're speaking about the C-suite, I would be curious to know what you're seeing about their desire to move marketing away from some of the really predominant social platforms that seem to be stumbling a little bit right now or perhaps where strength is moving to TikTok, and how that's helping drive more conversations around Inbound marketing?\n\nYamini Rangan -- Chief Executive Officer\n\nHey, Sarah. Thanks for that. I'm going to maybe just started and then Dharmesh, feel free to jump in here as well. Look, the conversations right now are all around driving efficiency, driving time to value, and getting results that can impact the outcomes in the near-term, right? And as we think about that, omni-channel marketing is really important.\n\nWhen I have conversations with CMOs mean CEOs, who within customers, they clearly understand that it cannot be just one channel. And so a lot of it is omni-channel marketing. And this is why what we announced and launched at Inbound, which our teams worked really hard on customer journey analytics and campaigns, 2.0 functionality. Both of those really meet the needs of where the marketing organization is expected to step up and deliver right now.\n\nAnd that's the kind of conversations that we are having. In general, a lot of marketing spend is around driving direct impact to revenue and pipeline in the short term and away from things like ad spend or even spend or brand spend. That is what we are hearing based on talking to customers.\n\nDharmesh Shah -- Founder and Chief Technology Officer\n\nYeah. One quick thing I would add is that it's a combination of -- there's these new channels emerging and it has to be omni-channel. Part of HubSpot's differentiated value proposition is that because everything is on one data platform in one database, wanting to bad experience, we have the data to be able to draw the insight, not just how many people visit the website or how many engaged in social or how many through ads, like who were those customers, what was the revenue associated with that, we can do kind of full circuit reporting, which is really hard to do when you get kind of the siloed products, and that's one of the appeals of the HubSpot platform.\n\nOperator\n\nThank you. We have a final question from Siti Panigrahi from Mizuho. Please go ahead when you're ready.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nThank you. Thanks for squeezing me in. Not sure, if this questions was asked. If I look at your Q4 guidance, that looks really conservative.\n\nWhen I look at historical guide for 4Q, usually like 4% sequential versus flat this year. So wondering is this mostly FX or you have some kind of incremental conservatives impact into the guidance considering the macro environment?\n\nKate Bueker -- Chief Financial Officer\n\nYeah. Why don't I -- I'll take that. I think if you were paying attention on the call, we definitely spent a lot of time talking about the challenging environment in which we're operating, and that is certainly reflected in the Q4 guidance. In addition, you highlight FX that is also an incremental headwind for us into Q4.\n\nWe called out $4 million of incremental headwind as a result of foreign exchange movements. And so it's really both of those things that are contributing to our Q4 guidance. We are assuming that the environment stays about how it is operating today. And as always, we want to make sure that we attend -- we're confident in our ability to deliver even if it gets just a little bit worse from here.\n\nOperator\n\nThank you. I would now like to hand it back to Yamini for any final remarks.\n\nYamini Rangan -- Chief Executive Officer\n\nWell, I want to do a big call out to HubSpotters globally. They are just so focused on executing. So thank my heart call thanks to all the employees and all things to customers, partners and investors, look forward to talking to you next year.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChuck MacGlashing -- Head of Investor Relations\n\nYamini Rangan -- Chief Executive Officer\n\nKate Bueker -- Chief Financial Officer\n\nBrian Peterson -- Raymond James -- Analyst\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nSamad Samana -- Jefferies -- Analyst\n\nDharmesh Shah -- Founder and Chief Technology Officer\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nSarah Hindlian -- Macquarie Group -- Analyst\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nMore HUBS analysis\n\nAll earnings call transcripts"
}