{
  "companyName": "Xponential Fitness, Inc.",
  "companyTicker": "XPOF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/xponential-fitness-inc-xpof-q3-2022-earnings-call/",
  "content": "Xponential Fitness, Inc. (XPOF 0.70%)\nQ3 2022 Earnings Call\nNov 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings. Welcome to Xponential Fitness, Inc. third quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode.\n\nA question-and-answer session will follow the formal presentation. [Operator instructions] Please note this conference is being recorded. I will now turn the conference over to Kimberly Esterkin, investor relations. Thank you.\n\nYou may begin.\n\nKimberly Esterkin -- Investor Relations\n\nThank you, operator. Good afternoon. And thank you all for joining our conference call to discuss Xponential Fitness' third quarter 2022 financial results. I am joined by Anthony Geisler, chief executive officer; Sarah Luna, president; and John Meloun, chief financial officer.\n\nA recording of this call will be posted on the Investors section of our website at investor.xponential.com. We remind you that during this conference call, we will make certain forward-looking statements, including discussions of our business outlook and financial projections. These forward-looking statements are based on management's current expectations and involve risks and uncertainties that could cause our actual results to differ materially from such expectations. For a more detailed description of these risks and uncertainties, please refer to our recent and subsequent filings with the SEC.\n\nWe assume no obligation to update the information provided on today's call. In addition, we will be discussing certain non-GAAP financial measurement in this conference call. We use non-GAAP measures because we believe they provide useful information about our operating performance that should be considered by investors in conjunction with the GAAP measures that we provide. A reconciliation of these non-GAAP measures to comparable GAAP measures is included in the earnings release that was issued earlier today prior to this call.\n\nPlease also note that all numbers reported in today's prepared remarks refer to global figures unless otherwise noted. I will now turn the call over to Anthony Geisler, chief executive officer of Xponential Fitness.\n\nAnthony Geisler -- Chief Executive Officer\n\nThanks, Kimberly, and good afternoon, everyone. We appreciate you joining our third-quarter earnings conference call. I'll begin today's discussion with an overview of our quarterly performance and operational highlights. John will then speak about our progress against our core growth strategies, including our new partnership with Princess Cruises and our recent brand launches on lululemon Studio.\n\nJohn will conclude with a review of our third-quarter financials and an update on our full-year outlook. We're very pleased with our operational execution and resulting financial performance for the third quarter. Beginning with studio count, Xponential remains the largest boutique fitness franchisor globally, with franchisees operating over 2,400 studios and more than 5,100 licenses sold across 10 leading fitness brands. We have franchise, master franchise, and international expansion agreements in place in 16 countries around the world.\n\nAs our total studio count continued to grow, so too did our membership base, another key indicator of the strength and stability of our business model. Looking specifically at North America, total members for the third quarter increased by approximately 33% year over year to 577,000. Our Q3 North American systemwide sales also continued to grow, up 37% year over year, to 265 million. Finally, we ended the third quarter with run rate North American AUVs of 489,000, up from 417,000 year over year.\n\nAUVs for the month of September reached 496,000, underscoring the continued momentum in the business. The consistent growth in our run rate AUVs is a strong reminder that despite inflationary pressures and other macroeconomic challenges, the workouts our franchisees provide across our diverse portfolio of brands remain an integral part of our members' lives. As we continue to open more studios and grow our systemwide sales, our profitability also increases, driven by the high margins our royalties generate. Turning to revenue.\n\nFor the third quarter, we posted net revenue of 63.8 million, an increase of 56% year over year. Q3 adjusted EBITDA of 20 million or 31% of revenue was up 193% from 6.8 million or 17% of revenue in the prior-year period. As is evident from our third-quarter results, while we continue to operate in a time of inflationary and overall macroeconomic pressures, our business has remained resilient. This resiliency can be attributed to three factors: our members, our franchisees, and our business model.\n\nLet's start with our membership base. As we noted last quarter, Xponential's customers continue to prioritize their health as a necessary investment rather than discretionary spend. Our average member has a typical household income of approximately $130,000, and the majority subscribe to reoccurring membership packages with fees that represent a relatively small piece of their overall budget. With membership counts growing and churn remaining low, we are confident in the ongoing health of our membership base and demand for our boutique offerings.\n\nThe second factor contributing to Xponential's resiliency is our franchisees. As you've heard me speak to previously, we take our franchisees selection process very seriously with only 2% of our leads becoming franchisees. Our franchisees are typically corporate veterans looking for an entrepreneurial opportunity. These individuals have the tenacity, courage, and capital to successfully run their businesses.\n\nOur franchisees have also borrowed over 200 million from the SBA without any nonrepayment under our ownership. To ensure a studio's success, once we bring an individual into our franchisees system, Xponential offers ongoing monitoring of the business and key operational assistance that leverages our extensive data analytics capability. Should there be any indication in the data that studio operations are awry, we are able to respond quickly and make the necessary shifts to maintain that studio's performance. We take regular engagement with our franchisee base seriously, and we are looking forward to our annual convention in Las Vegas coming up again this December.\n\nLast year, over 2,000 individuals traveled to Las Vegas to join us. At the event, we recognize franchisees for their hard work, share best practices, provide training, showcase vendors, and most importantly, align on our goals to carry forward the momentum into the coming year. Last but not least, the third factor contributing to our resiliency is our franchise business model. As a franchise business, Xponential benefits from highly predictable reoccurring revenue stream and limited ongoing capital requirement.\n\nIn the third quarter, approximately 71% of our revenue was reoccurring, largely driven by royalties. Beyond our reoccurring revenue streams, our capital-light franchise business model and access to labor and equipment help drive our continued success and margin expansion. Based on these factors, despite the uncertain macroeconomic environment, we remain confident in our go-forward trajectory and are raising our revenue and adjusted EBITDA outlook for the full year. With that as a background, let's turn to our four strategic areas of growth.\n\nI'll discuss the first three levers and then turn the call over to Sarah to discuss the fourth. Starting with increasing our franchise studio base. We ended Q3 with 2,485 global open studios, opening 128 net new studios in the third quarter. Year to date, we have opened 355 new studios, putting us on track to reach our goal of 500-plus new studios for the year.\n\nOf note, with each progressive quarter, studio opening cohorts have gotten stronger, opening at higher sales and membership levels in month 1 and then ramping faster than studios in prior cohorts. We were also pleased to see our highest number of new studio openings in the final week of September. Our franchisees opened 36 studios in the last week of September, a strong indicator that our franchisees remain bullish on opening new studio locations as we approach 2023. We also experienced strong demand for our franchise licenses, selling 258 licenses globally in Q3 and 769 thus far this year.\n\nKeep in mind that over time, as we continue to sell through prime geographic territories in each of our existing brands, in order to maintain this elevated run rate, we would eventually need to acquire another brand. In North America, we have over 1,900 licenses sold and contractually obligated to open, along with a replenishing pipeline of organic new studio expansion that offers us four to five years of visibility into our growth. We are also excited to recently announce that our newest brand, Body Fit Training, or BFT, which has over 200 studios open internationally, has started expanding into additional locations in North America, beginning with Toronto, Canada. Much like its predecessor, Rumble, which sold over 150 North American franchise licenses in its first eight months of franchising, since we began franchising BFT in February of this year, we have sold over 150 BFT licenses in North America, positioning the brand for expansion across the United States and Canada.\n\nTurning to our second growth driver, expanding internationally. On the international front, we have almost 1,000 studios obligated to be open, and we continue to gain traction. In August, we signed a new master franchise agreement, or MFA, in Kuwait for Rumble, Club Pilates, StretchLab, and CycleBar. Then in September, we signed an MFA for Club Pilates in Portugal.\n\nThe addition of Kuwait and Portugal, both large fitness markets, brings our global presence to 16 countries. As a reminder, our MFAs are structured to provide Xponential with high-margin flow-through given that we require minimal ongoing G&A to support MFA growth. Speaking of margins, our third key growth driver is to expand margins and drive free cash flow conversion. As our business continues to grow, we are increasingly reaping the benefits of our asset-light, scalable operating model, providing us with consistent and growing margin performance.\n\nConsidering the macro environment, we're especially pleased with where our operating margins performed this past quarter. We continue to expect our adjusted EBITDA margin will be in the low 30% range for the full year 2022, and we remain on track to achieve our long-term adjusted EBITDA margin target. With that, I'll pass the call on to Sarah to discuss our fourth and final growth driver, increasing our same-store sales and AUV.\n\nSarah Luna -- President\n\nThank you, Anthony. It was an exciting third quarter and one in which Xponential, again, proved the importance of driving new and prospective membership engagement. As Anthony noted, our consumers continue to prioritize their health and wellness, actively participating in both our in-studio classes and digital experiences. Visitation rates again increased, with total visits for the third quarter growing 28% year over year.\n\nThis momentum will carry into the fourth quarter as it is always an active one for promotions and membership engagement activities, and we are especially looking forward to the bump in sales we tend to see around Black Friday and Cyber Monday, when studios are running offerings that promote new membership, retail, and merchandise sales. So, let's discuss further how we continue to connect with our members, increase retention, and reduce churn, all of which are essential to growing our same-store sales and AUVs. We remain focused on ways to attract prospective members while, at the same time, developing innovative methodologies to improve current customer experiences. We are building out our omnichannel offering, focusing on robust B2B partnerships with industry-leading companies such as lululemon; OptumHealth, which is a subsidiary of UnitedHealth Group; Bodybuilding.com, a leading dietary supplements retailer; and others, rapidly expanding the reach of our brands.\n\nOne key example of these efforts is our recently announced five-year exclusive licensing agreement with Princess Cruises. Through this partnership, Xponential has become the first cross-modality fitness franchise to put its curated brands on a major cruise line. Eight of our brands, including Club Pilates, CycleBar, Pure Barre, Row House, StretchLab, Stride Fitness, YogaSix, and AKT, will be available on-board Princess' 15-ship fleet. We are excited to bring the best in fitness to Princess' millions of guests who will be able to join live classes and also experience our workouts on demand via XPLUS made available in more than 23,000 Princess staterooms.\n\nThrough this agreement, Princess Cruises has also become Xponential's first corporate wellness partner with our multi-brand XPASS offering made available to more than 30,000 Princess employees. Continuing the topic of making our brands more accessible, just last month, four of our brands, Pure Barre, Rumble, AKT, and YogaSix, officially debuted on lululemon Studio. Launched on October 5th, this new service from lululemon builds upon more than 10,000 on-demand and livestream classes available with a lululemon Studio subscription. Xponential workouts appearing on the Mirror featured top instructors from our XPLUS platform with new classes of curated content made specifically for lululemon Studio launching every week.\n\nMembers of lululemon Studio also now can attend our in-person classes at hundreds of brick-and-mortar locations across the country by purchasing a separate XPASS membership at a discounted price, as well as participate in additional brand workouts virtually with a free trial on our XLUS app. While the in-studio experience cannot be replaced, virtual fitness experiences remain core to our overall omnichannel growth strategy and will continue to serve as an added benefit to our member experience. Just today, we officially announced our first B2B offering for our XPLUS training app, a content licensing agreement with Aktiv Solutions, the leader in functional fitness design and supply. Together with Aktiv, we will create one-of-a-kind immersive exercise equipment experiences that are tailored specifically for hotels, corporate campuses, high-end multifamily housing properties, and universities.\n\nIn each of these newly branded locations, Aktiv's proprietary fitness base will exclusively feature XPLUS content on demand that can be accessed by downloading the XPLUS app. This partnership is a unique opportunity for us to bring increased awareness to all 10 of our boutique fitness modalities while, at the same time, expanding lead generation for our franchisees at no cost. We anticipate these new experiences will open sometime in the early part of 2023 and look forward to sharing more about this unique partnership in the coming months. Thank you again for your time.\n\nI'll now turn the call over to John to discuss our third-quarter results and full-year outlook.\n\nJohn Meloun -- Chief Financial Officer\n\nThanks, Sarah. It's great to speak with you to discuss Xponential's third-quarter results. Third-quarter North American systemwide sales of 264.8 million were up 37% year over year. On a consolidated basis, revenue for the quarter was 63.8 million, up 56% year over year.\n\nAll five of the components that make up revenue grew during the quarter. Franchise revenue was 30 million, up 50% year over year. The growth was primarily driven by higher royalties, as well as increased revenue generated from franchise license fees. Equipment revenue was 11.8 million, up 74% year over year.\n\nThis increase in equipment revenue continues to be driven by a higher number of global equipment installed. Merchandise revenue was 6.3 million, up 28% year over year. The improvement during the quarter was primarily driven by a higher number of open studios and increased foot traffic. Given the growth we've seen across the system, in October, we moved our retail merchandise operations into a new 55,000-square foot warehouse in Irvine, California.\n\nThe new facility will allow us to meet the higher franchise retail demand by increasing our inventory and shipping capacity, which will continue to contribute meaningful growth in margin dollars over time. Franchise marketing fund revenue of 5.2 million was up 40% year over year primarily due to strong systemwide sales and average unit volume growth. Lastly, other service revenue was 10.6 million, up 90% from the prior-year period primarily due to an increase in credit card rebates on higher systemwide sales and higher B2B and branded fee revenues. Turning to our operating expenses, costs of product revenue were 11.8 million, up 55% year over year.\n\nThe increase was driven by higher equipment installations for new studio openings and merchandise revenues in the period. Cost of franchise and service revenue were 4.8 million, up 52% year over year. The increase continued to be driven by costs related to franchise sales commissions and from technology fee costs from a higher number of open studios. Selling, general, and administrative expenses of 32.8 million were up 35% year over year largely due to costs associated with public company expenses and higher noncash equity-based compensation, as well as expenses related to one-time legal costs.\n\nAs a percentage of revenue, SG&A expenses were 52% of revenue in the third quarter, compared to 59% in the prior-year period. Depreciation and amortization expense was 4.2 million, an increase of 75% from 2.4 million in the prior-year period. Marketing fund expenses, which include expenses related to corporate marketing, were 4.3 million, up 11% year over year. Acquisition and transaction expenses were 16.3 million versus 2.9 million in the third quarter of 2021.\n\nThis increase is due to the change in noncash contingent consideration primarily related to our acquisition of Rumble. As I noted on prior earnings calls, the Rumble contingent consideration is driven by our share price. We mark-to-market each quarter and accrue for the earnout. We recorded net loss of 13.1 million in the third quarter, compared to net loss of 8.9 million in the prior-year period.\n\nWhile overall profitability was up by 13.6 million, there were offsetting amounts of 13.4 million in higher noncash contingent consideration expense primarily related to the Rumble acquisition, 3.7 million increase in impairment of brand assets, and 0.7 million increase in noncash equity-based compensation expense. We continue to believe that adjusted net income is a more useful way to measure the performance of our business. A reconciliation of net income to adjusted net income is provided in our earnings press release. Adjusted net income for the third quarter was 8 million, which excludes the 16.3 million change in fair value of noncash contingent consideration, a 1.1 million expense related to our third-quarter remeasurement of the company's tax receivable agreement liability, and a 3.7 million expense related to impairment of brand assets, compared to an adjusted net loss of 5.8 million in the prior-year period.\n\nTo calculate adjusted net earnings per share, we isolate the portion of the net income that is attributable to Xponential Fitness, Inc., which is 4.4 million. And we reduce this number by 1.8 million to account for the dividend attributable to Xponential Fitness, Inc. paid on our preferred shares. This results in an adjustable net earnings of $0.10 per basic share on 26.2 million shares.\n\nA reconciliation of net income to adjusted net income is provided in our earnings press release. Adjusted EBITDA was 20 million in the third quarter, compared to 6.8 million in the prior-year period. Adjusted EBITDA margins grew to 31% in the third quarter, compared to 17% in the prior-year period. As a reminder, our 2022 outlook anticipates adjusted EBITDA margins in the low 30% range, and long term, we expect this number to grow to over 40% in 2024.\n\nTurning to the balance sheet. As of September 30th, 2022, cash, cash equivalents, and restricted cash were 30.9 million, up from 21.3 million as of December 31st, 2021. Total long-term debt was 136.5 million as of September 30, 2022, compared to 133.2 million as of December 31st, 2021. Moving to our outlook.\n\nBased on our current business conditions, our year-to-date performance, and our expectations as of the date of this call, we are again increasing our full-year 2022 outlook for revenue and adjusted EBITDA and reaffirming our guidance for studio openings and systemwide sales in North America as follows. We continue to expect our total 2022 global new studio openings to be in the range of 500 to 520. This range represents the highest number of studio openings in our company's history and a 53% increase at the midpoint over 2021. We also continue to project North America systemwide sales to range from 995 million to 1.05 billion or 1 billion at the midpoint, which represents a 41% increase from the prior year and the highest North American systemwide sales in our history.\n\n2022 revenue will again be higher than initially forecasted and is now expected to be between 235 million to 240 million, an increase of 53% from 2021, at the midpoint of our guided range. The increase in the range was primarily attributed to higher overall franchise revenues, higher revenue from B2B and brand fee partnerships, and increased revenues from our company-owned transition studios. Adjusted EBITDA is now expected to range from 70 million to 74 million, a 164% year-over-year increase at the midpoint of our guided range. This new adjusted EBITDA guidance range translates into a roughly 30% adjusted EBITDA margin at the midpoint.\n\nLet's now spend a few moments on SG&A. Consistent with prior-year fourth quarters, SG&A expenses are expected to increase in Q4 2022 because of our annual franchisee convention. Our annual franchisee convention is anticipated to add roughly 4.5 million in sequential SG&A expenses. Noting that we do have sponsorship revenues expected in our other service revenue line, which will partially offset this expense down to approximately 2 million.\n\nAs I noted last quarter, we continue to see cost pressure from general operations and particularly in legal. While these expenses will increase SG&A dollars in the fourth quarter, we view this legal expense as an isolated event and will again adjust for it in our EBITDA calculation. Lastly, with 10 brands and thousands of studios, as previously discussed, Xponential always has some studios that are rehabilitate and subsequently free franchises. Costs related to these temporarily owned transition studios are included in our SG&A.\n\nWhile our current count is above historical levels, we are intent on cost-effectively optimizing these studios and finding new owners for them, as we have done in the past. In terms of capital expenditures, we anticipate approximately 9 million to 10 million or 4% of revenue at the midpoint. Going forward, capital expenditures will be primarily focused on the BFT integration, XPASS and XPLUS new features, and maintenance and other technology investments to support our digital offerings. For the full year, we expect our tax rate to be in the mid- to high single digits.\n\nShare count for purposes of earnings per share calculation to be 25.3 million and 3.25 million in quarterly dividends to be paid related to our 200 million convertible preferred stock. A full explanation of our share count calculation and associated pro forma EPS and adjusted EPS calculations can be found in the tables at the back of our earnings press release, as well as our corporate structure and capitalization FAQ on our investor website. Thank you again for your time today and for your support of Xponential. We look forward to speaking with you on our next earnings call.\n\nWe will now open the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Jeff Van Sinderen with B. Riley. Please proceed.\n\nJeff Van Sinderen -- B. Riley Securities -- Analyst\n\nHi, everyone. And first, let me say congratulations on what I think really amazing metrics, especially in the backdrop that we have macro economically. Maybe you can just touch on -- I'm curious if there are any performance variations that you're seeing in your metrics among your various concepts. Just wondering about any kind of consumer behavior, what they might be gravitating toward more among concepts.\n\nAnd then also the same thing as far as franchisees. Which concepts of yours are they tending to be most excited about at the moment?\n\nAnthony Geisler -- Chief Executive Officer\n\nThank you. Yeah. We don't give guidance on a, you know, brand-by-brand basis, but directionally, you know, the entire company is moving in the right direction. As far as from a franchisee sales perspective, which is what I think your question is kind of geared toward, you know, today, that is, you know, BFT and Rumble.\n\nAnd the reason for that is because they're the most recently acquired brands. Therefore, they have the most available white space, right? So, you know, if somebody, say, want to buy a Club Pilates with 1,000 sold, you know, it's hard to do that. So, you know, for us, you know, it's really Rumble and BFT. And of course, any Club Pilates that become available, you know, those are being sold, you know, kind of throughout the year as well.\n\nSo, we still have a lot of Club Pilates sales, a lot of Club Pilates openings, just like we do across the various brands. But the majority of white space is sitting in the most two recent acquisitions that we have. So, it's just sort of a metric of -- you know, if you want, Dallas, Miami, Manhattan, those kind of things, those are, you know, more available in BFT than they are even in Rumble. But still, for all of our other brands, there is, you know, some availability and -- you know, in certain parts of the country.\n\nJeff Van Sinderen -- B. Riley Securities -- Analyst\n\nOK, terrific. And then I'm just wondering, is it too early to speak to any response, early response on Princess and lulu? Or any early color there?\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. I mean, look, on the on the lululemon Studio piece, the metrics are looking really good. You know, they have a rating program much like Yelp, where it's one through five stars, and all four of our brands are, you know, at 4.9. So, doing very well, about 2 billion impressions, which obviously lends to, you know, lowering brick-and-mortar studio CAC.\n\nYou know, that's the reason why we do lululemon deals or Princess Cruises deals. It's not necessarily for, you know, a bunch of, you know, upfront economics or ongoing economics, although we do have that. It really is for kind of lowering that CAC and even, you know, potentially lowering attrition, you know, as their brands build in people's minds. And so, if you look at Princess Cruises, for instance, not only we'll be on the ships and do B2B promotions and partnerships, but we'll be in front of, you know, 9 million people in the in-room, you know, digital perspective of what we do.\n\nSo, you know, both of those are doing very well. Both companies are very excited about the early results of what we're seeing.\n\nJeff Van Sinderen -- B. Riley Securities -- Analyst\n\nOK, great. And if I could squeeze in one more, I'm just wondering if there are any changes that you can speak to regarding kind of your marketing plans, promotional plans, as we're getting through the end of the year.\n\nSarah Luna -- President\n\nYeah. Towards the end of the year, we do do a good amount of marketing, as well as retail and merchandising sales around Black Friday and Cyber Monday. So, all of the studios are gearing up for those two retail events. And then we go to the back half of the year, the end of the year, really pushing out memberships and making sure everyone is set up for their fitness program heading into the New Year.\n\nJeff Van Sinderen -- B. Riley Securities -- Analyst\n\nOK, great. Thanks for taking my questions. And continued success.\n\nOperator\n\nOur next question is from Randy Konik with Jefferies. Please proceed.\n\nRandy Konik -- Jefferies -- Analyst\n\nYeah. Thanks, guys. I guess, Anthony, for you. I wanted for you to unpack -- you know, so you made some commentary earlier about some of the support structure you have in place because I think the one kind of thing standing out about your business and business model is the flawless kind of execution that you're able to kind of put forth to and show the market with these results.\n\nSo, I just want to get some perspective on things that you're -- you know, the corporate home office is going to be working on to kind of help support some of these initiatives around the cruise partnership stuff, the international expansion, etc. I just wanted to kind of get some perspective on looking out a few years, as you're kind of dominating the globe with all these different concepts around the world, you know, what you're kind of working on to kind of add to that support structure, which continues to kind of, you know, continue to improve your flawless execution that you've shown thus far.\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. Thank you, Randy. I mean, like -- what I think we're proving out as a company is not only can we build brick-and-mortar facilities and stack them with members and increase AUV and kind of do that job. You know, to your point, it really becomes, you know, what can we do as a company to leverage the company assets into things like Princess Cruises or lululemon or, you know, renew -- or any of these deals that we do or Celsius or C4, you know, whatever it is that the company is able to do that -- you know, stuff we're doing with Aktiv or any of those -- these types of things, you know.\n\nAnd what's nice is the internal infrastructure to do those things is not a lot. You know, it really helps, you know, us on the CAC side. Like I said to the earlier question, the co-marketing we're able to do via lululemon, via Princess Cruises, via, you know, ASH or Aktiv or any of these things that we do, constantly putting the assets of Xponential and its brands in front of the face of current customers to, you know, help with any attrition, customers that we haven't acquired yet, you know, to be able to see our products, interact with our products. So, you know, we will continue to push the company in that direction.\n\nObviously, we've seen it from other companies in the space that, you know, customer acquisition costs -- or even if, you know, at some point, there's a, you know, diminishing return where you just -- you can't pay enough to get a customer or, you know, paying for a customer when you do get them, you know, kind of blows the model out. And so, we're finding creative ways to get in front of the customer, not for free, but they actually get paid. I would call that like negative CAC where we're getting paid to put our assets in front of customers that have a like demographic to our current studio base. And so, we'll continue to invest in those type of deals and leverage and optimize, you know, the complete asset base of Xponential.\n\nRandy Konik -- Jefferies -- Analyst\n\nSuper helpful. I guess my last question would be -- I know you don't give color around individual concepts as it relates to AUV, but what I'd like to get some perspective on is, as you continue to drive higher and higher AUV, is that a function of, let's say, the most productive concept probably being Club Pilates, getting even stronger, lifting up the rest. There's the rest kind of pulling up as well. Is it the top quintile getting stronger, the bottom quintile of performers getting stronger? Just give us some maybe flavor of what's contributing to the really nice numbers you're putting up on that AUV side.\n\nThey'll be super helpful. Thanks, guys.\n\nJohn Meloun -- Chief Financial Officer\n\nYeah, I'll take that one. So, when you look at the brands, I mean, it's the brands that take off earlier -- typically are the ones that have the highest maturity from an AUV. So, the things that we talked about on prior earnings calls, that's given us really good optimism around some of the younger brands, brands like Rumble and BFT, and even our StretchLab, which I would say is kind of in the middle innings of -- it's been around for a while and growing. They're churning out much higher AUVs than we've historically seen from Club Pilates.\n\nAnthony's mentioned, you know, early on, Club Pilates had an AUV that was like kind of sub-300. Now, it's sitting 750,000 plus Presidio. Our StretchLabs are approaching that, and it's a much younger brand. You look at Club -- Rumble and you look at BFT, the early -- again small sample size, but the early units that are opening up are opening up well above like that 500 AUV.\n\nSo, as these brands continue to mature, I think even the younger ones will continue to push well above that 500 AUV, which we have always defined as the designed-for AUV, not the max. Like we never saw the max AUV prior to COVID. So, now that the system has gotten back to pre-COVID levels and we're starting to see all of these brands start to perform well above that 500, I don't think you'll see that as the cap. I think that's just kind of the ante to get to play when you get to that point of where the brand is expected to perform to.\n\nBut well above that, you know, we'll see the brands performing, you know, 500, 550 as they kind of age and get more units open. Another thing that I want to point out is the cohorts in 2022, those units that have opened up are performing and growing faster than they did in 2021 and then prior to COVID. So, it gives us a lot of encouragement as well that these units that are opening up in today's time are actually performing faster and getting to breakeven faster.\n\nRandy Konik -- Jefferies -- Analyst\n\nVery helpful answers. Thanks, guys.\n\nOperator\n\nOur next question is from Brian Harbour with Morgan Stanley. Please proceed.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nYeah. Thank you. Hi, guys. Maybe just on the other service revenue, which I think has grown quite nicely there, maybe just comment on how, you know, some of these new partnerships are kind of driving that and if you think that will continue to be the case.\n\nI don't know if there are any one-time fees in there last quarter, but I'd be interested to know just how all of those things are kind of adding economically at this point.\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. So, when you look at the other services revenue line, there's kind of two big pieces in there. The one constant is the rebates we get related to processing our membership. So, we get a rebate from our credit card company.\n\nSo, if systemwide sales continue to increase the rebate we get on processing, those monthly memberships will continue to increase. It's not very steady Eddie revenue stream that will have in that line for the foreseeable future. We've also layered into that like the XPASS, the video on-demand revenue, very steady-state, very recurring revenue streams. We have seen, I would say, a little bit more lumpy revenue in regards to some of the B2B stuff as some of the agreements we have have an upfront revenue component, but a lot of them have the tail as well.\n\nSo, signing the agreement upfront, we do get some benefit. But there's also -- if the agreement is over one year or two years or three years, we also get a tail related to amortizing any revenue over that period of the contract. So, over time, it'll be less lumpy and more steady-state, very high, reoccurring, again, driven much by the VODs, the XPASSes, the credit card rebates that we get. But in the short term, as we've signed some of these bigger agreements with lululemon and Princess and the likes, there is some upfront lumpiness associated with those agreements.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nOK. Understood. John, maybe also just on the -- your G&A comments. When you refer to the step-up, are you using like an adjusted G&A number, or are you referring to the 33 million reported? I guess I'm just trying to square -- because I know there's some items here just out in there, but I'm trying to square what we should be comparing to exactly.\n\nJohn Meloun -- Chief Financial Officer\n\nCan you be a little bit more specific on the 33 as far as like the actual for Q3 results? Are you talking about for going forward, how you should be looking about it?\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nWell, I guess I'm kind of trying -- I'm trying to determine what the number is for the fourth quarter, right? So, am I comparing your comments against the full 33 and the third quarter?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. So, the comments around SG&A in the fourth quarter as it relates to there will be a step-up in Q4 SG&A as it relates to the fact that we have the cost of our national convention. So, it is about a $4 million to $4.5 million increase in SG&A, but it is netted down by the fact that we do get sponsorship rebates that get recorded in our other service line. So, net-net, you will see a increase from Q3 to Q4 in SG&A.\n\nHowever, there is offsetting revenue that not all $4.5 million flows to the bottom line as an expense. Only about 2 million will. Is that helpful? Is that what you're kind of getting at?\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nYeah, that helps. Thank you.\n\nJohn Meloun -- Chief Financial Officer\n\nOK.\n\nOperator\n\nOur next question is from Alex Perry with Bank of America. Please proceed.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking my questions, and congrats on a strong quarter. Just first, maybe John, could you sort of help square away the revenue guidance a bit? So, you know, total revenue guidance came up, but the systemwide sales guide sort of remained the same. So, what sort of would be the delta between the two?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. I think it'd be helpful to kind of walk back to the Q2 earnings call. And I mentioned on the call that when we increase guidance, you know, the methodology we were using is -- you know, we exceeded our expectations in the second quarter by, you know, a couple of million top line, a couple of million bottom line. And we just added that to our existing guidance.\n\nWe want to remain conservative from the perspective of all this talk about recessions, uncertainty into the future. And we weren't, you know, at that point, going to raise guidance unless we felt for sure certain that -- you know, that there wasn't going to be a slowing in the business. That being said, it kind of restricted what we probably could have raised guidance in Q2 on. And based on how we performed in Q3 and got the upside, we went ahead and committed that into this guide, the guidance that we have for this quarter.\n\nThe upside really comes from a lot of the franchise revenue. As you know, we've seen really strong -- you know, from an openings perspective. We said we've had upside in some of the royalties, some of the equipment that we've had, the merchandise across the board. Overall expectations around revenue has been strong for us.\n\nSo, we -- a little bit of it is overperformance and a little bit was kind of overperformance that was there in Q2 that we were kind of holding back on from the perspective of we weren't sure what the impacts related to the business were going to be if they presented themselves as part of that kind of the macroeconomic environment.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. That's really helpful. And then maybe just my follow-up, you know, for Anthony, can you just talk about the willingness of franchisees to open clubs right now? And, you know, are they being affected at all by the rising rate environment? Are they doing anything different to finance in this environment? You know, are they seeing anything in terms of, you know, higher construction costs and labor that's giving them hesitation? And then others are calling out, you know, some supply chain headwinds like HVAC availability. It doesn't seem like you guys are seeing that.\n\nAnd then just offer that -- maybe speak a little bit to sort of profit margins at the franchisee level versus pre pandemic and sort of how those are tracking. Thank you.\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. So, to kind of give you an idea, give you some extra color, you know, we sold 120 units in September alone on the franchise sales side to kind of start at the top of the funnel. We actually opened 63 stores in September, and we're signing an increased number of leases right now. So, you know, it's one thing to look at the quarter, right, to say, you know, July, August, September but another thing to look at September metric as kind of like your last leading indicator.\n\nSo, we're not seeing any slowdown. As a matter of fact, we're kind of seeing the opposite in our most recent month.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. That's really helpful. Best of luck going forward.\n\nOperator\n\nOur next question is from John Heinbockel with Guggenheim Partners. Please proceed.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, so can you guys talk to the quickness of the ramp with the Aktiv partnership, right? I would guess most of their locations would be applicable for your work with them. How quick can that ramp? You know, do you look at that also as a -- you know, as a brand awareness effort? And then just remind us on the economics, right, of Xponential Plus, you know, to the to the corporate entity.\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. So, you know, we really leverage XPLUS and XPASS to do these deals like Princess or, you know, lululemon or things of that nature. They obviously are accretive in their own right. But, you know, we use them to be able to do deals like we're doing -- like the Aktiv deal.\n\nThe Aktiv deal was signed this week, and so pretty quick and premature to say, you know, how quickly it's going to ramp. Obviously, we are doing our best as a company to, you know, continue to be aggressive in, you know, a macroeconomic sort of pressured market, as you can see from our results this quarter and even the work that, you know, the company did in September that we've disclosed. So, you know, we will continue to ramp all these B2B partnerships, you know, to the benefit of the company as fast as possible.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nMaybe as a follow-up, Anthony, have you guys done any work -- when you look at your target customer, right, so, I mean, you've got a very small percentage of the -- you know, of households, right, with 130,000 or more of income. When you think about what they're spending on fitness, your share of wallet -- and is the bigger opportunity to create demand, right, to drive demand from that group as opposed to take their wallet away from somebody else? I mean, have you tried to size that? And is that the bigger opportunity, is to drive demand for fitness because of your offering?\n\nAnthony Geisler -- Chief Executive Officer\n\nYes, it is. But, you know, as I said earlier, you know, what we're focused on is not only doing, you know, kind of our core work, which is selling franchises, opening stores, and driving AUVs higher. It really is to continue to leverage the assets of Xponential, you know, really, across the network. And so, the answer is yes.\n\nBut the answer is also both, right, that we want to continue to drive wallet share demand and find new wallets and new ways that have somebody may not be coming to us today in a brick-and-mortar consumer sense, but they're going to use the Mirror in their house, or they're going to go on a cruise, or they're going to be part of a, you know, health insurance deal, or they're going to be a part of, you know, third party that Aktiv services, they they kind of find Xponential, really, in their life, right? That Xponential and its brands become a part of their lifestyle and not just something they do for, you know, 60 minutes, three days a week, but something that becomes a part of their life seven days a week.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Jonathan Komp with Baird. Please proceed.\n\nJonathan Komp -- Baird -- Analyst\n\nYeah. Hi. Thank you. John, can I just follow up on the Q4 adjusted SG&A that you're embedding in the outlook? Can you maybe just clarify the adjusted figure that you're looking for in the fourth quarter just to tear up any confusion? And then when you look at the full-year guidance change, I just wanted to ask, it looks like the midpoint of revenue is going up by 20 million or a little bit more, and the midpoint of the EBITDA range is going up by about 2 million.\n\nSo, can you just maybe comment on any factors that are impacting that flow-through?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. So, as it relates to the SG&A for the fourth quarter, it will be greater than Q3. So, that is based on the convention. The total year SG&A as a percent of revenue, excluding the stock-based comp, will remain consistent with what I said on the previous earnings call, around that 42% or, you know, let's call it, 40% to 42% of revenue.\n\nSo, that -- for the fourth quarter, I think that's probably a good way to look at, you know, the SG&A for the fourth quarter. As it relates to the guidance and the flow-through, as I mentioned on the call, you know, we have seen some cost pressures, and we have seen some costs related to legal, you know, some company-owned studios that has impacted us in Q3 and Q4. So, as we've adjusted our outlook, yes, we have had upsides in revenue, but there has been some cost pressures that have suppressed margins a little bit in the second half of the year. You know, we continue to kind of manage through that, you know, as we operate, but we do expect, you know, long term as you kind of roll into 2023, that to normalize back to the levels we had expected this year.\n\nJonathan Komp -- Baird -- Analyst\n\nOK, that's helpful. Thank you. And then, Anthony, maybe a follow-up on the appetite around unit development. I know you commented on the licenses all that you've seen.\n\nAny broader perspective as you look out to the number of potential openings in 2023, whether you can sustain and maybe how you feel about sustaining the level that you've seen this year? Thanks again.\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah, a little clarification. You know, so we had 120 sold. It's what I said. We had -- actually had 139 sold in September alone.\n\nBut the franchise sales are very strong. You know, we're continuing to deliver on openings this year. We will deliver, you know, of course, at or better openings this next year, right? It's always our goal as we sell more, stack up more backlog, to find ways to open more, you know, as we go forward. So, that's where we're sitting as of today.\n\nJonathan Komp -- Baird -- Analyst\n\nOK, great. Thanks again.\n\nOperator\n\nOur next question is from Warren Cheng with Evercore ISI. Please proceed.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nHey, good evening, guys. And I echo the congratulations on a great performance in the quarter. I wanted to ask a follow-up on the partnerships with Princess Cruises, lulu, the Aktiv partnerships. Are there mechanisms to capture the leads or the customer data generated by these programs? And is there any data you can share on the conversion or the new members that have found your brand through these partnerships or the impact on CAC? Anything to kind of understand just the metrics around these programs.\n\nSarah Luna -- President\n\nYes, we do have mechanisms in place for all of our partnerships so that we can attract -- so we can measure how we're attracting a new customer base through these partnerships. With lululemon, as an example, we've got a promo code in place, and that promo code allows us to see how many net new members we've added into XPASS. So, they don't actually go directly to the studio and book, but they funnel through XPASS, and then through XPASS, and they have the option to book and access each of our studios. With Princess Cruises, that one's a little bit early still.\n\nWe did launch a partnership and a promotion with XPASS and Princess Cruises in the last week and a half, and that's a promotion that goes through the end of the year. That promotion is really exciting because for every XPASS that we sell, XPASS is -- excuse me, Princess is actually matching dollar for dollar with a cruise voucher. So, we're excited to see how that's performing. Again, we're about a week, week and a half into that promotion.\n\nSo, too early to see, you know, ultimately how it does in the long term. But we're starting to now kick off some of those additional marketing promotions and partnerships. And we'll be able to have, you know, better clarity on how they're accretive to the business and to the franchise partners, you know, over the next couple of months.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nThat's really helpful. Yeah, it's been fun to see -- it seems to be new announcements every quarter. It's been fun to watch. The second follow-up I had was I wondering if you can contextualize your performance relative to the boutique fitness industry more broadly.\n\nIs this outperforming as a modality in general in this environment, or are you really out-executing competition? Thank you.\n\nAnthony Geisler -- Chief Executive Officer\n\nOK. I mean, it's hard to say, right, because you only have one other boutique fitness franchisor that's public. And so, you know, they haven't done their Q3 call yet. So, a bit premature for us to -- you know, to answer that.\n\nBut, you know, John has, you know, kind of some further color to it, and I'll let him kind of tell you.\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. I think the thing that differentiates us a little bit in the boutique is the fact that we run a membership model, which allows us to continually capture reoccurring revenue every month, where you typically see maybe more of the mom-and-pop type boutique fitness. They do packages. So, they're a little bit more sawtooth, a little ups and downs.\n\nBecause we're on a recurring membership model, we have a much more sturdy cash flow and revenue stream that we could tap into month over month.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nGot it. Thank you. Good luck.\n\nOperator\n\nOur next question is from Joe Altobello with Raymond James. Please proceed.\n\nJoe Altobello -- Raymond James -- Analyst\n\nHey, guys. Good afternoon. I just want to go back to a comment that you guys made earlier about, you know, future growth coming from some of the younger sort of brands, not the Club Pilates or Pure Barres but more the Rumbles and the BFTs. And it sounds like the younger brands do come in with a higher AUV, but they have a shorter, I guess, operating history.\n\nDoes that impact your visibility at all in terms of your ability to forecast the business given that they don't have the history of a Club Pilates, for example?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. Thanks for that, Joe. Not really because at the end of the day, the cycle from when a franchisee signs their agreement to a license to when they get open is -- it's very predictable. I mean, when you have the sample set that we've had of almost 2,500 units getting open, you quickly learn like, on average, this is what it takes to get from a license sale to an open studio.\n\nWhen you think about the scaled brands, which, you know, I kind of define as any brand that has over 200 studios, you know, the Club Pilates, the Pure Barres, the CycleBars, the StretchLabs, the BFTs, they are where we're seeing the majority of our openings today. Even though that Rumble and BFT are very young brands, as Anthony mentioned, we're selling quite a few licenses from those brands. So, as we look forward into the future, they will become a larger portion of our openings, and brands like Club Pilates and, let's say, StretchLab, even though has a lot of growth still up to come, you'll see less and less of those because the territories and the number of studios have opened up. So, long term, the mix in brands and the openings will shift, but the predictability of getting them open, it's not going to change.\n\nSarah Luna -- President\n\nAnd then I'll piggyback on that from an AUV standpoint. We start preselling as soon as we have an LOI in place, and we're able to really see lead generation, memberships that are sold even in advance of the studio being open. So, we've got, you know, handfuls and handfuls of studios that are open in the new studio brands -- or in the new brands. So, those locations are tracking very healthily, and we know how they're going to perform even before they open their doors.\n\nJoe Altobello -- Raymond James -- Analyst\n\nGot it. That's very helpful. Just maybe to follow up on that, obviously, you're you still targeting 500 to 520 studio openings this year. Is that a good run rate going forward? \n\nJohn Meloun -- Chief Financial Officer\n\nYeah. For forward-looking open studios, that's what you're looking for, I mean, at the end of the day, our long-term strategy is to maintain above a 500 run rate. Now, as you look out two, three, four years, unless we do some sort of acquisition, it'll be difficult to maintain that level because we're going to burn through our backlog of sold licenses and inventory. As we play more seeds internationally, that'll continue to help.\n\nBut overall, you know, we will need to do an acquisition to maintain 500, but we have sufficient backlog right now and visibility for the next three to four years to achieve that 500 opening or greater.\n\nJoe Altobello -- Raymond James -- Analyst\n\nWe'll worry about 2027 when it gets here, I suppose. Thanks.\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. We'll wait till 2027 and get back to you on that.\n\nOperator\n\nAnd our final question is from JP Wollam with ROTH Capital Partners. Please proceed.\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nHi, everyone. Thanks for taking the question. I want to kind of maybe jump back to the competitive landscape and maybe focus more on some of the boutique mom-and-pop shops. You know, I think we anecdotally saw a number of closures with COVID.\n\nAnd just curious, kind of in the last year, given the environment, higher costs, rates rising, is there anything you can speak to anecdotally about maybe challenges that some of those smaller independent studios are facing and whether closures are increasing? Anything to point out there?\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. I mean, I think it comes down to, you know, would you rather swim alone, or would you rather swim with thousands of other people and a large ship for support, right? I mean -- and that's really what it is. You know, these independent operators that are out there doing, you know, what I call passion projects, you know, I wish them the best of luck because I want, you know, every entrepreneur to win. Inflation happens, interest rates happen, and you're sitting out there isolated on your own island.\n\nIt's really tough. And when there's the learnings of, you know, kind of thousands of other people, you know, that are out there that we can draw from, you know, that's a lot different. And when you've got 250 people sitting in the corporate office with support to support you for every day, you go turn the key every morning in your store. You're not turning the key alone, right? You're turning the key with a lot of other people in support of you.\n\nAnd so, it makes total sense that, you know, in this industry and any industry that, you know, a good franchise or a good support system, the learnings of thousands of stores across 10 different brands, you know, makes a big difference. You know -- and it comes down to, you know, our franchisee pool as well. When you look at kind of the operators of some of these independents, you know, I make the analogy to chefs that, you know, love to cook food and want to open a restaurant so that, you know, people can taste their food. A lot of times, these independents are, you know, somebody who loves Pilates, or they love yoga.\n\nAnd so, their kind of dream becomes open a yoga studio. You know, our franchisees are, you know, corporate veterans, right? I call them corporate refugees. They know how to operate in tough environments. They're, you know, well capitalized, are used to managing people.\n\nAnd you saw the evidence of that when, you know, we went into COVID, and we came out of COVID not losing a single store but actually gaining 30%-plus locations. I mean, we opened 350 stores and processed almost $0.5 billion while we were closed. So, you know, imagine what we're able to do when we're legally able to operate.\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nYeah, that's great. I appreciate that. And then maybe just one follow-up to kind of talk about the team and how you're feeling about kind of run rate AUV. I think, John, you kind of touched on it a little bit earlier, but just when you guys are talking about kind of long term, where AUVs can you go, you know, is there still a lot of -- and I hesitate to say easy, but a lot of easy expansion for now in terms of that run rate AUV given how early units are performing? Where are we kind of really scraping to pull that AUV higher given how much we've grown and being back above pre-COVID levels?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. So, when you think about our same-store sales for Q3, you know, at 17%, we still haven't normalized back to where we were pre-COVID. You know, pre-COVID, we kind of comped at that 8% per quarter. We're still at 17%.\n\nSo, we're still kind of coming down into what we believe is our normal high to single-digit same-store sale. From an AUV perspective, I think that applies on how we're looking at the businesses. AUVs will continue to increase over time. I do think long term or even in the short term, you know, you'll see elevated same-store sales throughout 2023, probably getting back to that mid- to high single digits at the end of next year.\n\nWith that, obviously, AUVs will continue to climb. You know, what is that ceiling in which you kind of -- you know, it's kind of like a car, right? They can only go so fast because, at some point, they're pushing through air, and it's hard to move faster and faster. But I think our AUVs, we don't know where that's at yet. Is it possible that we do see getting to the high 600s? I do think that's definitely a possibility, having the entire system pushing close to a 600,000 AUV.\n\nWe're at 500,000 roughly now, and we're definitely not slowing down from a growth perspective. So, you'll see over the next, you know, probably four quarters as we progress through 2023 how we continue to progress in the comp. But for sure, these younger brands that are opening up stronger could actually influence how we're looking at AUVs given just how successful they've been as they've launched, you know, in the BFTs and the Rumbles and the StretchLabs of the world.\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nGreat. Really appreciate the color there. Best of luck.\n\nOperator\n\nWe have reached the end of our question-and-answer session. I would like to turn the conference back over to Anthony Geisler, CEO.\n\nAnthony Geisler -- Chief Executive Officer\n\nThanks again for joining today's earnings call and for your continued support. I'd like to acknowledge the entire Xponential Fitness team and franchisees for their strong operational execution in this third quarter. I'd also like to note that next month, we'll be participating in ROTH's 11th Annual Deer Valley Event and have several other conferences planned for early 2023 that we'll announce -- that we will be announcing in the coming months. We hope to see many of you at these events.\n\nThank you, and make it a great week.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKimberly Esterkin -- Investor Relations\n\nAnthony Geisler -- Chief Executive Officer\n\nSarah Luna -- President\n\nJohn Meloun -- Chief Financial Officer\n\nJeff Van Sinderen -- B. Riley Securities -- Analyst\n\nRandy Konik -- Jefferies -- Analyst\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nJonathan Komp -- Baird -- Analyst\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nJoe Altobello -- Raymond James -- Analyst\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nMore XPOF analysis\n\nAll earnings call transcripts"
}