{
  "companyName": "Full Truck Alliance Co. Ltd.",
  "companyTicker": "YMM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/23/full-truck-alliance-co-ltd-ymm-q3-2022-earnings-ca/",
  "content": "Full Truck Alliance Co. Ltd. (YMM -1.96%)\nQ3 2022 Earnings Call\nNov 23, 2022, 7:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, good day and welcome to Full Truck Alliance's third quarter 2022 earnings conference call. Today's conference is being recorded. At this time, I'd like to turn the conference over to Mao Mao, head of investor relations. Please go ahead.\n\nMao Mao -- Investor Relations\n\nThank you, operator. Please note that today's discussion will contain forward-looking statements relating to the company's future performance, which are intended to qualify for the safe harbor from liability as established by the Private Securities Litigation Reform Act. Such statements are not guarantees of future performance and are subject to the risks and uncertainties, assumptions, and other factors. Some of these risks are beyond the company's control and could cause actual results to differ materially from those mentioned in today's press release and discussions.\n\nÅ general discussion of the risk factors that could affect FTA's business and financial results is included in certain filings of the company with the SEC. The company does not undertake any obligation to update these forward-looking information except as required by law. During today's call, management will also discuss certain non-GAAP financial measures for comparison purposes only. For a definition of non-GAAP financial measures and a reconciliation of GAAP to non-GAAP financial results, please see the earnings release issued earlier today.\n\nJoining us today on the call from FTA's senior management side are Mr. Hui Zhang, our founder, chairman, and the CEO; and Mr. Simon Cai, our CFO. Management will begin with prepared remarks, and the call will conclude with a Q&A session.\n\nAs a reminder, this conference is being recorded. In addition, a webcast replay of this call will be available on FTA's investor relations website at ir.fulltruckalliance.com. I will now turn the call over to our founder, chairman, and CEO, Mr. Zhang.\n\nPlease go ahead.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nHello, everyone. Thank you for joining us today on our third quarter 2022 earnings conference call. In the third quarter, under the gradual implementation of China's ensured smoothness of freight logistics policy and the effective pandemic controls, China's road transportation industry saw a series of positive changes. We are pleased with our steady growth and strong financial and operational performance we delivered in the quarter, as we continue to enhance our capabilities from product development to technology innovation, while also optimizing user experience and operational efficiency.\n\nAll of these improvements have empowered us to navigate the challenging external environment and the highly dynamic market with great agility.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nAmid weak seasonal demand and a strong macro headwind, our solid third quarter results underscore the sustainability of our business model and our commitment to building and strengthening our industry-leading competitive edge. Looking at our operational performance, with the full assumption of new user registration on our Yunmanman and Huochebang apps, we witnessed the rapid growth of our user base in the third quarter with an increasing number of high-quality users through a series of effective user acquisition strategy. Furthermore, we consistently strengthened and upgraded our products and functionality for direct shippers, further enhancing both the fulfillment rate and retention. As a result, our GTV and the number of fulfilled orders grew by 5.7% and 20.2% quarter over quarter to RMB 69.6 billion and 43.5 million, respectively.\n\nOur average shipper MAUs reached 1.85 million, representing a 15.2% increase year over year.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nNow, turning to our financial results. Our total net revenues came in above the upper boundary of our previous top-line guidance, climbing by 45.7% year over year to RMB 1.81 billion. Alongside our efforts to expand our monetization channels and improve monetization efficiency, we continued to streamline our operational workflows during the third quarter to enhance our profitability. Our approach has yielded positive results with non-GAAP adjusted net income reaching RMB 493 million compared with a non-GAAP adjusted net loss of RMB 4.7 million a year ago.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nBuilding on this momentum, we will continue to explore and capitalize on our strengths, improving user experience, and refining our operational capabilities, while fulfilling the demands of our growing user base. Additionally, we will strive to boost our existing users' engagement and retention rate, while also accumulating new users in their frequency and accelerating their conversion into frequent users, synchronizing an increase across the existing and incremental business to drive the sustainable growth of our overall business growth.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nWe have also continuously improved our operations to make sure we are in full compliance with the regulatory requirements. We are not aware of any ongoing government investigation or subject to any other administrative penalties to-date that would materially affect our business financial position or results of operations.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nLooking ahead, China's road transportation industry will continue to transform and upgrade digitally. As the world's largest digital freight platform, we will focus on leveraging our platform's skills, enhancing our 50 capabilities and integrating with gathered transportation capacity and supply of goods nationwide. By taking this approach, we will facilitate the connectivity of the entire freight logistics network and benefit individual track truckers while driving the industry's high-quality development and creating greater value for all of our stakeholders.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nWith that, I will now turn the call over to our CFO, Simon Cai. He will go over our operational and financial results in more detail. Simon, please go ahead.\n\nSimon Cai -- Chief Financial Officer\n\nThank you, Mr. Zhang and Mao Mao, and hello, everyone. I will start by sharing some of this quarter's major initiatives and developments, and then walk you through our key financials. In the context of a challenging macro environment and a new wave of omicron clusters, we're glad to have delivered another quarter of solid financial and operational results.\n\nOur third quarter average fulfillment rates reached approximately 25%, an increase of 4 percentage points on a sequential basis, despite the weak demand in the third quarter and a particularly hot summer, which diminished truckers' willingness to take freight orders. These orders were partially off -- these factors were partially offset by the gradual easing of the pandemic and the resumption of new users registration. As expected, we experienced a surge in both new shipper and truck crew member numbers upon the full resumption of user registration on our Yunmanman and Huochebang apps at the end of June. In the third quarter, our average monthly active shippers and monthly active truckers responding to orders grew by more than 300,000 and 200,000 from the previous quarter, respectively.\n\nAlmost all of our newly added monthly active shippers are low- and medium-frequency shippers, which include a large number of direct shippers, resulting in further changes to our overall shippers' composition. Furthermore, the contribution to GTV and fulfilled orders by low- and medium-frequency frequency shippers, including 688 members and nonmembers, continue to increase over the past eight quarters. Notably, a portion of orders fulfilled by the shippers' cohort has gradually increased from less than 30% two years ago to more than 40% now. And we expect this number to continue to expand in the future.\n\nMeanwhile, driven by increasing dependance on our platform, users' transaction frequency and activity level also improved as evidenced by average quantity fulfillment per monthly active shipper and monthly active trucker fulfilling orders strengthening quarter over quarter. Thanks to our relentless efforts to improve the quality of our services. Our continued user growth has not had a dilutive impact on our user retention. In the country, the 12-month retention rate of paying shippers and the next month's retention rate of truckers who responded to shipping orders on our platform both remain high at around 85% in the third quarter, following the trend of previous quarters.\n\nWe have also established a more effective communication channel during this quarter to reengage users whose registration has failed within the last year, mainly through a combination of manual outbound calls, text messages, and precise information targeting. By the end of October, we had reactivated nearly 2 million new shippers and truckers from failed registrations, representing a significant rise in the reactivation rate. In the future, we will remain focused on optimizing the user experience, thereby converting and retaining more long-term users. We believe that offering a broader array of effective products and solutions to our expanding and increasingly diverse user base will be the key to our sustainable, high-quality growth.\n\nTo this end, we continue to optimize our platform's ecosystem during the quarter with upgraded functionalities designed to tackle shippers' and truckers' pain points. For example, we have in-housed our algo model with more frequent updates going from daily to real time to improve search efficiency and matching accuracy. Committed to continuous improvement in operational efficiency, we focused on our freight matching capabilities, reducing the rate of order cancellation by imposing tighter traffic restriction on shippers who frequently cancel orders. While refining the matching of truckers with trustworthy shippers and prime orders, we extended our data analytical tools to cover more shippers, particularly those using virtual private numbers to place orders.\n\nWe were delighted to see a lower order cancellation rate and improvement -- improved fulfillment rate on our platform in the third quarter as a result. Consequently, those ongoing efforts to improve operating efficiency, targeting better freight matching, are driving an overall enhancement -- enhanced user experience. Along with our computer process refinements and product optimizations, we expect to support further improvements in cancellation and fulfillment rates. And importantly, we reinforced the user's positive experience on the platform going forward.\n\nDuring the quarter, we also made several advancement in user retention and engagement. For instance, in the third quarter, we introduced our trucker growth program in several pilot areas, through which truckers accumulate reward points as they complete transactions. The more points they accumulate, the higher their priority status with respect to having full access to orders posted on the platform. The program incentivizes all truckers to increase transaction frequency and improve service quality, creating better user experiences for shippers and raising overall matching efficiency.\n\nFurthermore, we've successfully implemented our shipper rating system on a national scale and upgraded the system in the third quarter. Our upgrade enables truckers to more precisely evaluate shippers' behaviors with operating indicators, including number of fulfilled orders, fulfillment and cancellation rate, etc., empowering them to make more comprehensive evaluation of the quality of order postings. After six months of pilot operations, our enhanced shipper rating system has been widely recognized by shippers and truckers, leading to a 5.8% drop in the complaint rate against shippers and an 8.5% drop in the overall order cancellation rate. Finally, our online transaction service continue to deliver sustainable growth with 114.1% year over year increase to RMB 390.2 million in revenue, largely attributable to the continued ramp-up of commission transaction volume.\n\nThis quarter, we continue to expand our commission model to additional cities, which raised the commission penetration rate to above 50%. As a result of the increasing scale of this commission model, our online transaction service has gradually become the foundation of our overall increase in revenue. In summary, thanks to our optimized products and user composition, our third quarter results reflected solid progress. We continue to expand capitalizing on our core competitiveness to strengthen our industry-leading position over the long term.\n\nLooking ahead, we will remain committed to elevating the quality of our products and services, refining our highly efficient operations, and protecting users' rights and interests, sparing no efforts to create more value for all of our users, investors, and stakeholders. Now, I'd like to provide a brief overview of our third quarter financial results. Given the limited time for today's call. I'll be presenting some abbreviated financial highlights.\n\nWe encourage you to read through our press release issued earlier today for further details. Our total net revenues in the third quarter were RMB 1.8 million, representing an increase of 45.7% year over year, primarily attributable to an increase in revenues from freight matching services. Revenues from freight matching services, including service fees from freight mortgage models, membership fees from listing models, and commission from online transaction services were RMB 1.5 billion in the third quarter, representing an increase of 39.5% year over year, primarily attributable to an increase in revenue from our freight brokerage services, as well as rapid growth in transaction commissions. Revenues from freight brokerage service in the third quarter were on the 904.1 million, representing an increase of 31.2% year over year, primarily driven by continued growth in transaction volume as a result of improved user penetration.\n\nRevenue from freight listing service in the third quarter were RMB 219.7 million, up 2.8% year over year, primarily attributable to an increase in total paying members. Revenue from value-added services in the third quarter in the third quarter were RMB 294.5 million, an increase of 88.2% year over year, mainly attributable to increased revenues from credit solutions. Cost of revenues in the quarter was RMB 953.0 million compared with RMB 842.1 million in the same period of 2021. The increase was primarily attributable to an increasing VAT, related tax surcharges and other tax costs, and net of tax refunds from government authorities.\n\nThese tax-related costs, net of refund, totaled 866.7 million, representing an increase of 12.7% from RMB 768.9 million in the same period last year, primarily due to an increase in transaction activities involving our freight brokerage service. Sales and marketing expenses in the third quarter were RMB 232.9 million compared with 190.6 million in the same period last year. The increase was primarily due to an increase in salary and benefits expenses driven by higher sales and marketing headcount. General and administrative expenses in the third quarter, or RMB 206.6 million compared with R&D 190.0 million in the same period last year.\n\nThe increase was primarily due to an increase in professional service fees as well as an increase in salary and benefits expenses driven by higher G&A headcount. R&D expenses in the quarter were RMB 226.6 million compared with RMB 202.9 million in the same period last year. The increase was primarily due to an increase in salary and benefits expenses driven by higher R&D headcount. Income from operations in the third quarter was RMB 149.7 million compared with a loss from operation of RMB 201.7 million in the same period last year.\n\nNet income in the third quarter was RMB 395.5 million compared with a net loss of RMB 178.3 million in the same period last year. Under the non-GAAP measures, our adjusted operating income in the third quarter was RMB 242.8 million compared with an adjusted operating loss of RMB 81.1 million in the same period last year. Our adjusted net income for the third quarter was RMB 493.0 million compared with adjusted net loss of RMB 4.7 million in the same period last year. Basic and diluted net income per ADS were RMB 0.37 in the third quarter compared with basic and diluted net loss for ADS of RMB 0.17 in the same period last year.\n\nNon-GAAP adjusted basic and diluted net income per ADS were RMB 0.46 in the third quarter compared with non-GAAP adjusted basic and diluted net loss per ADS of RMB 0.0 in the same period last year. As of September 30 this year, the company had cash and cash equivalent, restricted cash, and short-term investments of RMB 26.8 billion in total compared with RMB 26.0 billion as of December last year. For the third quarter of 2022, net cash generated by operating activities were RMB 398.3 million. Looking at our business outlook for the fourth quarter of this year, we expect our total net revenues to be between RMB 1.79 billion and RMB 1.88 billion, representing a year-over-year growth rate of approximately 25.2% to 31.5%.\n\nI want to emphasize that these forecasts reflect the company's current and preliminary views on the market and operational conditions. The COVID outbreaks are associated with substantial uncertainties, including the geographic scope and duration of the outbreaks, the additional restrictive measures that the government authorities may take and a further impact of the business of shipper, truckers, and other ecosystem participants. All of which are subject to change and cannot be predicted with reasonable accuracy as of the date hereof. That concludes our prepared remarks.\n\nNow, I'd like to open the call to Q&A. Operator, please go ahead.\n\nOperator\n\n[Operator instructions] Our first question comes from Ronald Keung from Goldman Sachs. Please go ahead.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\n[Foreign language] Thank you, management. I want to ask about our new user registration once this has resumed. Can you share some color on the user profile behavior? Have you seen any change in the platform's activity with the pickup with the GTV and order structure resulted from these new users? Thank you.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nSo, since the resumption of new user registration, both our shipper and trucker user base have grown significantly. In terms of newly registered shippers user profiles, the majority of them are relatively medium- to low-frequency direct shippers. As of now, the daily average number of new registrations have achieved normalized growth, with both new shippers and truckers basically returning to their level before the suspension of registration.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nAs for the GTV mix, the contribution from our member and 688 member shippers to GTV and fulfilled others continue to rise during the quarter. Our number of member shippers also increased, thanks to additional enhancements to our operational strategy and the optimization of our free order posting policy for the members. On a related note, I want to emphasize that the conversion rate from a new user to a 688 member subscriber is typically higher than that from a new user to a one 688 membership subscriber, mainly because these new users are mostly direct shippers who tend to ship less frequently, while also exhibiting stronger stickiness and higher retention.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nAs you may know, the new user's contribution to GTV and our order volume growth will accumulate gradually as time goes by. Let me share with you some interesting observations about these new users. Typically, those newly registered users need one to two months to learn and cultivate new shipping habits on the platform. After which, their shipping requests and fulfillment capabilities will gradually improve.\n\nTherefore, even though our user fill is in a record growth phase, the contribution of new users to GTV and order volume will not increase in a straight line.\n\nHui Zhang -- Founder and Chief Executive Officer\n\n[Foreign language]\n\nMao Mao -- Investor Relations\n\nTypically speaking, we noticed that our overall transaction volume growth month over month in July, August, and September, the contribution of medium- to low-frequency shippers to GTV and order volume also increased sequentially. This proved again that direct shippers' reliance on our platform grow over time, laying a solid foundation for us to further refine our user competition and create and optimize user ecosystem in the longer run.\n\nOperator\n\nThe next question comes from Violet Yi from China Renaissance. Please go ahead.\n\nViolet Yi -- China Renaissance -- Analyst\n\n[Foreign language] Thanks, management, for taking my question. My first question is on freight rate. So, the platform that fulfill GTV increased year over year in the third quarter, but the number of fulfilled orders declined on a quarter-over-quarter basis, which implies a year-over-year increase in average freight rate. What are the main reasons behind the fluctuation in freight rate? And my second question is how do you see the fulfilled GTV and orders trending going forward? Thank you.\n\nSimon Cai -- Chief Financial Officer\n\nThanks for your question. The year-over-year increase in freight rate was primarily due to an increase in fuel prices in the past year. If we look at the composition of transportation costs for truckers, we see that fuel costs account for the majority at around 40% of the freight rate, followed by highway toll fees. Also, over the last few quarters, our business has witnessed a supply demand imbalance between shippers and truckers due to pandemic control measures, which also led to a spike in freight rates during certain periods.\n\nCompared with the number of fulfilled orders, our overall GTV, along with the average freight rate, will fluctuate more in the face of shifting external factors, such as a fuel prices, highway toll fees, and the pandemic resurgence. So, because of this, we believe the volume of our fulfilled orders better reflects our overall operating capabilities. And going forward, we will encourage investors to focus more on this trend.\n\nOperator\n\nOur next question comes from Jiulu Li from CICC. Please go ahead.\n\nJiulu Li -- CICC -- Analyst\n\n[Foreign language] Hey, thank you. Thanks for taking my question. Against the backdrop of a weak macro environment, do you see any impact on your overall shipment volume? And what is the trend of this -- what is trend this quarter in terms of the number of orders posted?\n\nSimon Cai -- Chief Financial Officer\n\nThank you. Overall, order postings were basically flat on year-over-year and quarter-over-quarter basis in the third quarter. We didn't see material negative impact from the changes in the macro environment. Notably, other posting from building materials related to the real estate sector also remained stable year over year.\n\nDespite rapid growth in shipper MAU in the third quarter, overall, other postings remain flat year over year, partially because our newly registered monthly active shippers are low- and medium-frequency shippers. And their contribution to other volumes remain relatively small when they were first onboarded. Aside from that, we have implemented two operational strategies in the third quarter to boost shipping volume. First, for nonmember shippers, we lowered the free posting from 10 posting per month to five posting per month, which promoted conversion of shippers into member users and improve the users' stickiness.\n\nThe second is for our existing member users. We fine-tuned our operating strategy, shifting our focus from shipment incentives last year to a stricter focus on fulfillment incentives this year. So, on a monthly basis, our overall other posting accelerated in September, offsetting the impact of hot weather in July and August. In the long run, we believe that the volume of shipments will continue to climb as our user base expands.\n\nOperator\n\nThe next question comes from Cherry Leung from Bernstein. Please go ahead.\n\nCherry Leung -- AllianceBernstein -- Analyst\n\n[Foreign language] Could you please provide an update on the progress of your transaction commissions in the third quarter? In terms of penetration, how far we add to our long-term goal and what we will do to increase the penetration rate in the future? And also, what is the current commission rate? And what is our plan to raise the commission rate going forward? Thank you.\n\nSimon Cai -- Chief Financial Officer\n\nThank you. The revenue from transaction commissions amounted to roughly RMB 390 million in the third quarter, mostly driven by the year-over-year increase in transaction volume. At the same time, our broader product offerings also stimulated an increase in transaction commission revenues. As of the end of September, we had launched the commission program in 201 cities where the commission penetration rate exceeding 50%.\n\nSince the end of last year, we have been rolling out a tiered commissioning strategy based on matching time. We developed this strategy mainly to cater to users' need, having observed that users are only willing to pay for service when the platform generates enough value to make it worthwhile for them, through features like fast match matching and high order qualities. In addition, we have seen from historical transaction data that the probabilities of disputes between shippers and truckers is still relatively high. So, our tracking data algorithm, including use of fulfillment capability and dispute judgement, has played an important role.\n\nTo that end, we are allocating more resources to developing such tools to bring more value to our users and enhance our platform's overall fulfillment efficiency. At the same time, we are also exploring new user acquisition initiatives and promoting more value-added services, such as entrusted shipment, and connecting more direct shippers to truckers, which we believe will gradually improve the user ecosystem for both shippers and truckers. We remain confident that the revenues from transaction commissions will continue to be the main driver for our platform's revenue growth and monetization improvement in the future.\n\nCherry Leung -- AllianceBernstein -- Analyst\n\n[Foreign language]\n\nOperator\n\nOur next question comes from Brian Gong from Citi. Please go ahead.\n\nBrian Gong -- Citi -- Analyst\n\n[Foreign language] Thanks, management, for taking my question. Congratulations on solid results. Management, you mentioned about our efforts to improve user experience to support user growth and enhance engagement. Can management elaborate a bit more on your progress on this improvement in the third quarter? Thank you.\n\nSimon Cai -- Chief Financial Officer\n\nSure, in the third quarter, we continue to increase our focus on user experience. Each of our business divisions has established a dedicated user experience team to systemize business rules, optimize product functions, and resolve user experience issues internally, which has once again improved the user experience, as well as our reputation. As of the end of the third quarter, we have seen a significant decrease in user complaint rates across all of our business segments. Moving forward, we will keep striving to improve user experience with a particular focus on building a customer service Q&A database and standardizing our operating mechanism for handling customer service requests.\n\nOperator\n\nOur next question comes from Ivy Ji from Credit Suisse. Please go ahead.\n\nIvy Ji -- Credit Suisse -- Analyst\n\n[Foreign language] Thanks, management, for taking my question. I have a question on the opex spending. So, in 3Q, we see the sales and marketing increased year over year. I just wanted to ask, what was our kind of focus area of investing? And how should we think about the outlook for the sales and marketing spending and over opex into the fourth quarter? Thank you.\n\nSimon Cai -- Chief Financial Officer\n\nYes, our sales and marketing in terms of spending consists of employee compensation, welfare expenses, and marketing-related costs. On a non-GAAP basis, our sales and marketing expenses increased year over year, primarily due to the increase in personnel cost as a result of increased sales headcount, while the quarter-over-quarter increase was attributable to a higher marketing expense for new user acquisition since the normalization of user registration at the end of June. Going forward, we expect sales and marketing expenses to continue to rise as we further extend our new businesses. However, as the scale of our platform revenues and operating leverage increase accordingly, sales and marketing expenses, as a portion of revenue, will gradually decline.\n\nOperator\n\nAnd that concludes the question-and-answer session. I would like to turn the conference back over to Mao Mao for any additional or closing comments.\n\nMao Mao -- Investor Relations\n\nThank you for joining us today. If you have any further questions, please feel free to contact us at Full Truck Alliance directly, or TPG Investor Relations. Our contact information for IR in both China and U.S. can be found in today's press release.\n\nHave a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMao Mao -- Investor Relations\n\nHui Zhang -- Founder and Chief Executive Officer\n\nSimon Cai -- Chief Financial Officer\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nViolet Yi -- China Renaissance -- Analyst\n\nJiulu Li -- CICC -- Analyst\n\nCherry Leung -- AllianceBernstein -- Analyst\n\nBrian Gong -- Citi -- Analyst\n\nIvy Ji -- Credit Suisse -- Analyst\n\nMore YMM analysis\n\nAll earnings call transcripts"
}