{
  "companyName": "Vertex, Inc.",
  "companyTicker": "VERX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/vertex-inc-verx-q2-2022-earnings-call-transcript/",
  "content": "Vertex, Inc. (VERX -2.29%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Vertex second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Joe Crivelli, vice president of investor relations at Vertex. Please go ahead.\n\nJoe Crivelli -- Vice President, Investor Relations\n\nGood morning, everyone, and thanks for joining us for Vertex's conference call for the second quarter ended June 30, 2022. I'm Joe Crivelli, vice president investor relations. David De Stefano, our CEO; and John Schwab, our CFO, joined me on the call today. As a reminder, this call including the Q&A portion of the call, may include forward-looking statements related to our expected future results.\n\nOur actual results may differ materially from our projections due to risks and uncertainties. These risks and uncertainties are described in our earnings release and filings with the Securities and Exchange Commission. Today's remarks will also include references to non-GAAP financial measures. Additional information, including reconciliation between non-GAAP financial information to the GAAP financial information is provided in the press release.\n\nThis conference call will be available for replay via webcast on our investor relations website. And with that, I'll now turn the call over to David.\n\nDavid DeStefano -- Chief Executive Officer\n\nThank you, Joe. Welcome, everyone, and thank you for joining us. I'm proud to share our Q2 results with you today. We delivered another strong quarter of profitable growth.\n\nTotal revenue was $119 million, up 14% year over year and exceeding the high end of our guidance. We saw solid growth across the key measures by which we monitor customer success. ARR grew in the quarter to $398 million, up over 18% year over year. NRR was 110%, up from 106% for the same period in 2021 and GRR was 96%, up from 94% and from the second quarter of last year.\n\nWe continue to grow our top line and sustain strong EBITDA margins, while investing for the future. Throughout the quarter, we saw strong adoption from both new and existing customers, reflecting the strength of our brand, momentum with investments we are making and sustained demand and market opportunity despite challenging economic conditions. Historically, over the past 60 years, it has been shown that indirect taxes provide a more consistent method of government funding during adverse economic cycles relative to income and property tax, which are the other primary sources of funding. As a result, indirect tax revenues play a key part in the global economy and serve as a primary source of revenue for governments around the world.\n\nIn fact, government revenue from indirect taxes is more than double that of income tax. And this will only continue to increase with expanding requirements for digital commerce and real-time reporting in a growing number of countries. All of this puts added pressure on companies of all sizes and market segments to automate indirect tax compliance to keep pace with changing requirements. Our company is still processing indirect taxes wit9 homegrown systems, it's a matter of when, not if they will need to automate their end-to-end tax process.\n\nWe remain confident that our total addressable market opportunity is at $22 billion and that we are still very early in the adoption cycle. Vertex is ideally positioned at the intersection of commerce and compliance with the companies that drive the global economy. We are extending our global capabilities and the power of our unified platform while strengthening our partner relationships and consistently delivering exceptional customer value and service. This focused strategy is showing up in this quarter's results.\n\nWe continue to see momentum across all areas of our business, but I would like to highlight our outstanding performance in Europe. We had several significant cross-sell deals this quarter in Europe, some of the largest companies in the world expanded their footprint with us as they move to the cloud. In many cases, these were noncompetitive opportunities given our unique capability to support the complex needs of enterprise customers and the proven track record they have with our tax content accuracy. These deals create substantial lift in our ARR and reflects why we benefit from having multiple deployment options for customers to meet them where they are in their own digital journey.\n\nThis was the case for a customer who selected our end-to-end solution as part of their global SAP implementation in 2020. This quarter, they decided to transition their global tax function to our cloud solution, ensuring they will always be on the latest solution without the burden of maintenance. As one of the world's largest industrial manufacturing companies, they are harnessing cloud across all areas of their global business wherever and whenever possible. Our ability to grow with their business and help them seamlessly make this transition and others that may occur in the future is a cornerstone of the partnership we build with our customers.\n\nOur fit-for-purpose solutions, which are powered by our ever-growing global content database and backed by strong ecosystem partnerships make Vertex the clear choice when our customers look to upgrade their tax technology. It has been our formula for enterprise market success in the U.S., and we are replicating it in Europe as we expand our global footprint. This showed up in another notable Q2 win in Europe. Our customer, a multinational engineering and technology company chose to move our cloud solution as part of their global SAP S/4HANA initiative.\n\nThis customer is one of the world's biggest users of SAP with over 150 production systems worldwide. Their current initiative will consolidate their system significantly. They needed a proven solution that could handle a platform of this magnitude across multiple systems, making our cloud offering the only choice. Our end-to-end tax automation solution for SAP are unmatched by anyone.\n\nOur family of SAP solutions, including our accelerator and recently acquired solutions from LCR-Dixon sit on the SAP platform and are designed to enrich and enhance data as it seamlessly flows across our systems. In particular, our Chain Flow Accelerator solution is proving to be a strong differentiator in European opportunities. In Q2, our chain floor accelerator was recertified by SAP for integration with SAP S/4HANA. This annual validation process with key requirements for many of our customers.\n\nAll our solutions for SAP resonate with customers as they put the power to control tax automation more strongly in the hands of the tax department. Unlike other segments of the market, enterprise deals are complex sales. Our customers rely on a team of trusted advisors working closely with our experienced subject matter experts to support their business, which is why for over 40 years, we put so much focus on having the best talent and deep relationships with the world's leading technology and consulting partners. We continue to reinforce our success in the cloud.\n\nWe recorded another quarter in which 95% of all new logos closed were on our cloud offerings. And year to date, our cloud growth is 33%, and we remain confident in our ability to maintain this through year-end. In addition to strong cloud growth, we had several large on-premise customer expansion supporting our NRR growth, which again demonstrates that our hybrid deployment capabilities, our complex businesses required to support their diverse infrastructures. Let's look at some of the new logos now that we onboard at this quarter.\n\nOne that I'd love to talk about was a six-figure competitive takeaway tied to our new healthcare customers compelling growth story. This business was scaling quickly through acquisition, while the customer was also considering three different ERP systems on Oracle Cloud. At the same time, the pandemic had wrapped up growth both domestically and internationally with the critical need for telemedicine services worldwide. Our cloud solution was selected to replace a competitor's cloud solution.\n\nWe're able to meet their long-term growth plans, thanks to the depth of our global content, the strength of our partnerships and our validated and certified integration with the Oracle Cloud infrastructure. As our customer continues to bring needed healthcare to communities around the world, particularly underserved and underdeveloped populations, we are proud that our solution can give them the flexibility and peace of mind to grow into new markets. It's another great example of how investment in our partner ecosystem is creating sustained opportunity for us to grow within their ecosystems. We've expanded our global footprint with Oracle Cloud infrastructure.\n\nI'm proud to announce we received the Oracle Change Agents Partner Award as visionary ISV Partner of the Year in Q2. This award honors our technological innovation and leadership in the Oracle ecosystem. We also continue to see increased traction with NetSuite, our unified platform and global capabilities are differentiating us in the mid-market as businesses who are looking to scale take on greater tax complexity. The title of their growing business requirements, these customers are able to leverage applications designed to optimize performance on the OCI platform.\n\nThis was the case with a midsized technology company running on NetSuite with 65% year-over-year growth. Our customer was at a tipping point. This rapid expansion drove the needs for our cloud solution to address their intensifying global requirements and tax exposure. Our integration with Coupa provided another key selling point with the ability to connect sales and purchasing through one central tax engine.\n\nThey need a single source solution provider to meet their aggressive global growth projections. In this deal, like so many others, the difference shows up in the relationships we build with our customers, technology ecosystem and the alliance partners, the Vertex brand and our proven track record sets us apart from the competition. It is the commitment of our teams and the desire to really get to know a customer and their business needs that makes us a long-term partner of choice, not just a vendor. Now, I'd like to highlight the momentum we are gaining with our new products.\n\nThe integration of Taxamo's capabilities with the Vertex tax engine is enabling a holistic solution for one of the world's largest retail e-commerce platforms. Our customers needed to overcome the tax hurdles inherent in global online marketplaces and accurately manage indirect tax compliance across multiple territories. Tax collection was fundamental, but they also needed to deal with daily transaction volumes in the millions and the rapid pace at which their sellers are uploading new products. Our winning solution combines the very best of Taxamo and Vertex, incorporating the strength of our tax engine and global tax content with advanced invoicing, threshold management and line item liability assessment capabilities.\n\nThis gives our customer a scalable full-service solution to seamlessly navigate the complex tax regulations like the ones pass last July in the EU and which continue to evolve for global marketplaces. In turn, they can create a tax service for the people creating sites on their e-commerce platform. As their business continues to grow, our solutions will help them improve market access and accelerate commerce. In the U.S., we are helping a leading convenience store chain expand their existing cloud license to connect our sales tax capabilities into their SAP Hybris e-commerce solution to manage tax liability of their prepared foods regardless of whether they are purchased in store at the register or ordered online.\n\nWith the accelerating forces of digital transformation, and e-commerce businesses are looking for ways to optimize their operations to support omnichannel environment and seamless customer experiences. In the second quarter, we conducted a research study with Forrester Consulting to explore interest in a containerized edge solution with 400 IT decision-makers and organizations in the United States, the United Kingdom and Germany. We found that 87% of IT decision-makers are rethinking their organization's current approach to tax software deployments. And 83% of those who participated are interested in containerized edge tax solution to align to their broader infrastructure moves to edge computing and containerization.\n\nThese results substantiate the strong interest we are receiving for our new edge solution for tax. Customers looking to the edge for greater flexibility and scalability regardless of where their customers engage with them. One of our existing e-commerce customers made the decision to move to the cloud with Vertex in Q2. As their growth continues to accelerate, they are bringing in edge computing to support improved performance.\n\nTaking tax to the edge is a natural extension of the transformation journey our customers are already on and allows them to further optimize their technology investments. While I've highlighted several deals within the retail industry, performance in the quarter was balanced across all our key verticals, including manufacturing, financial services and wholesale. We also saw continued strength in industries, in addition to retail, where we have developed vertical solutions to meet their unique tax needs. We saw significant expansion deals this quarter in the telecom industry.\n\nThis is a notable segment of our installed base where customers have indicated they are not yet ready to migrate to the cloud. We are able to continue supporting their needs today without disruption to their business. And we'll be there to continue to support them when they are ready to move to the cloud. In these industries, it is the breadth and depth of our tax content that drives deals.\n\nI cannot emphasize this enough. The accuracy of our tax content creates a stickiness for solutions and leads to sole-sourced cross-sell and upsell opportunities. Our content also helps us to win new logo opportunities. We are continuously investing in expanded content as it opens a broader serviceable market for our technology.\n\nEarlier this year, we introduced robust content for the oil and gas industry. In Q2, we won another six-figure deal in this space, demonstrating great ROI from our content investment. This deal was another great example of the power of trusted partnerships. Together with PWC and SAP, we were able to support this customer's cloud transformation.\n\nNow, I'd like to hand it off to John for a deeper look at this quarter's numbers, and then I will make a few closing comments before we transition to Q&A.\n\nJohn Schwab -- Chief Financial Officer\n\nThanks, David, and good morning, everyone. I'll now review our second quarter financial results and provide third quarter and full year guidance. In the second quarter, revenue was $119.3 million, up 13.7% compared to last year's second quarter and exceeding the high end of our quarterly guidance by $1.8 million. Subscription revenues increased 12.8% period-over-period to $101.1 million, and services revenues grew at 18.6% period-over-period to $18.2 million.\n\nAnnual recurring revenue or ARR, was $398.1 million in the quarter, representing approximately 18.4% growth over the comparable 2021 period. We've now lapped the Taxamo acquisition in last year's second quarter. Accordingly, on an organic basis, ARR grew at 18% as compared to 17.2% in Q1 2022. Net revenue retention or NRR remained strong at 110%.\n\nThis was up from 106% in the comparable 2021 period and consistent with the first quarter of 2022. This metric continues to demonstrate our customers' ongoing commitment to our software and our solutions. Gross revenue retention or GRR, was 95.9% at quarter end. This is consistent with prior performance, which has the averaged 94% to 96%.\n\nOur returns processing Managed Services business generated recurring services revenues of over $10.3 million year to date through the second quarter of 2022 as compared to $8.4 million for the comparable period in the prior year. This service is a competitive differentiator and generates consistent recurring revenue but is not included in our ARR. At June 30, we had 4,242 direct customers, consistent with last quarter. The inclusion of Vertex users that are sold and serviced by our one-to-many channel strategy would add 266 indirect customers to our customer count.\n\nSo that investors have a full picture of our customer counts, including indirect small business customers sold in service by our channel partners, we have provided the most recent five quarters of data in today's earnings release. AARPC is based on the direct customer count. Accordingly, our average revenue per direct customer has steadily increased and was $93,850 in the second quarter up from $89,700 in the first quarter. We continue to see strong growth in our cloud-based solutions among both existing and new customers.\n\nRevenues from cloud-based solutions grew to $40.2 million an increase of 25% over the prior year comparable quarter. As a reminder, in the second quarter of 2021, we recorded cloud-based revenues of $2.1 million from a tier-based subscription amendment to a cloud customer that we highlighted at the time. Adjusting for this amendment in the last year second quarter, cloud revenue quarter-over-quarter growth would have been 34%. As I discuss the remainder of the income statement, please note that unless otherwise stated, all references to our expenses, operating results and per share results are on a non-GAAP basis.\n\nAll non-GAAP financial measures are detailed and reconciled to our GAAP results in the earnings press release that was issued this morning. Gross profit for the second quarter was $84.3 million, and gross margin was 70.7%. This compares to gross profit of $74.7 million and 71.2% gross margin in the same period last year. Gross margin on subscription software revenues was 76.9% compared to 77.3% in last year's second quarter and 76.6% in the first quarter of 2022.\n\nGross margin on services revenues was 36% compared to 35.3% in last year's second quarter and the first quarter of 2022. As we've discussed, with investors previously in 2022, operating expenses are being impacted by investments we are making for continued growth. These investments include: first, R&D spending to enhance our cloud solutions, integrate acquired technologies and expand connectors and APIs into new platforms. This also includes additions to our R&D team.\n\nSecond, expansion of our sales team as well as additional marketing programs. And third, IT infrastructure, business process reengineering, integration costs and other initiatives to drive our operating leverage. Note that the ongoing impact of our investments is included in our guidance for the third quarter and full year, which I will discuss in a moment. Accordingly, in the second quarter, Research and Development expense was $9.8 million or 8.2% of revenues compared to $11.3 million or 10.8% of revenues in last year's second quarter.\n\nWhile R&D spending on the income statement is down year over year on both a dollar basis and as a percent of revenue, much of our spending is capitalized. With capitalized spend included, R&D spend is up $2.4 million year over year in the second quarter and $7 million for the six-month period. Selling and marketing expense was $28.6 million or 23.9% of total revenues, an increase of $6.2 million and approximately 22.3% from the prior year period. And general and administrative expenses was $28.3 million or 23.7% of total revenues, an increase of $7.5 million from the prior year period.\n\nOur growth investments in turn impacted the year-over-year comps for our earnings metrics. Adjusted EBITDA was $17.8 million for the second quarter of 2022, a decrease of $1.4 million over the prior year comparable period. And adjusted EBITDA margin for the second quarter of 2022 was 14.9%, down 340 basis points from last year. Turning to the balance sheet.\n\nWe ended the second quarter with over $85.6 million in unrestricted cash and equivalents. Total bank debt was $49.5 million and investments in securities totaled $6.9 million. For additional liquidity, we also have a $200 million of unused availability on our line of credit. And now turning to guidance.\n\nFor the third quarter of 2022, we expect total revenues in the range of $121.5 million to $124 million, representing growth of 10% to 12% from the third quarter of 2021 and adjusted EBITDA in the range of $16.5 million to $18.5 million, representing a decrease of $3.4 million to $5.4 million from the third quarter of 2021. For the full year 2022, we expect total revenues in the range of $480 million to $484 million, representing annual growth of 13% to 14% from the full year of 2021. And adjusted EBITDA in the range of $72 million to $75 million, reflecting the impact of the investments I discussed earlier. We also continue to expect that cloud revenue will grow by over 33% in 2022.\n\nAll told, the company's financial performance was strong in the second quarter. We delivered healthy revenue growth and solid profitability while continuing to make growth investments that we believe will deliver significant shareholder value in the years to come. In addition, we continue to demonstrate that our customers depend on Vertex solutions to power their commerce with strong growth in ARR, NRR, GRR and AARPC. David will now make some closing comments.\n\nDavid?\n\nDavid DeStefano -- Chief Executive Officer\n\nThanks, John. When I look back at Q2 in the first half of the year, the common thread driving our strong financial results is people, which is why we continue to invest in our ecosystem and our team. I want to take a moment to thank our Vertex team around the world. It is your ongoing commitment to developing innovative solutions and an unmatched experience that allows us to deliver value for our customers and shareholders.\n\nI'd also like to thank our customers for putting your trust in Vertex and allowing us to be part of your business success and growth. As you've heard time and again in my comments today, our partner ecosystem and the strength of the relationships we have built are a true differentiator for Vertex. Our end-to-end platform, our robust global tax content, our trusted partner ecosystem and our talented Vertex team create a winning combination that continues to drive our growth. Now, let's pause for your questions.\n\nOperator\n\nThank you. [Operator instructions] Your first question comes from Josh Reilly with Needham.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nHey, guys. Thanks for taking my questions, and nice job on the another quarter of accelerating ARR growth. If you look at your exposure by vertical, within retail, obviously, we know you have some very large customers. I'm curious, what are you seeing in their trend in terms of in-store versus e-commerce transactions? And how are these customers renewing their revenue bands year over year? Are you seeing any down-sell because of lower e-commerce transaction volumes or is it just kind of stable?\n\nDavid DeStefano -- Chief Executive Officer\n\nJosh, thanks. Thank you for calling in, and I appreciate the question. To be honest, we don't have direct visibility on a quarter-by-quarter basis of what our clients are building through e-commerce or in-store to answer that question directly. The good news is in almost all of our retailers, we have both sides of that relationship.\n\nAnd so -- and then when you add in now the edge computing solution, we're actually seeing still expanded opportunities in the retail space because of the need for retailers to be more creative in serving the point of need, and that's what containerization and edge solutions allow them to do. So we're not -- I don't have that specific data. I will say, again, because of our license bands, the way we price our product, we don't see any material downward pressure. We've been through several, obviously, economic downturns in our 40-year history and have not experienced sort of any significant repricing of contracts.\n\nYeah.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nGot it. OK, and then maybe one other way of kind of asking about business trends. If you look at your B2C customers versus some of your B2B customers, are you seeing any difference in terms of the underlying trends with those customers in terms of what their eagerness to upsell or cross-sell new additional products? And can you just remind us maybe roughly how much of your business is B2B versus B2C?\n\nDavid DeStefano -- Chief Executive Officer\n\nThe great news is we're not seeing any elongation or slowdown in our pipeline across all our verticals. One of the beauties of our content databases, we actually have the opportunity sell across so many verticals. So if one vertical is slow, we're seeing now oil and gas do some really interesting things that we've added that content. So I haven't seen any real material issues there in the shift.\n\nI would say I don't have great data to answer your B2B versus B2C, but they are fairly balanced. I would just -- I would approximate.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nGot it. Thank you, guys.\n\nDavid DeStefano -- Chief Executive Officer\n\nThanks, Josh.\n\nJohn Schwab -- Chief Financial Officer\n\nThanks, Josh.\n\nOperator\n\nNext question, Matt Stotler with William Blair.\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nHey. Thanks for taking the questions. Maybe just start off with one on cloud. Obviously, cloud deployments continue to be the majority of your new customer wins here.\n\nBut I'd be interested if you're seeing any update in kind of the shift in the installed base, right? I mean whether there's been any move or acceleration of transition in that installed on-premise space toward cloud? Or what that path looks like in expectations there going forward?\n\nDavid DeStefano -- Chief Executive Officer\n\nYes. Matt, I appreciate. We really look at cloud in three dimensions. It's the new logos, which we continue to see exceptional success by our sales teams in delivering cloud as the primary.\n\nWe see it in the cross-sells, and I'd say it's still holding at about 50% of all of our cross-sells are that. The migration base continues at the fairly annualized 3% to 4% we experience every year. Haven't seen a material shift in that. Obviously, as we monitor the ongoing evolution of OCI adoption of SAP S/4 adoption, we may see acceleration there, and it's certainly we're positioned well for that because of our content database and how well customers have relied on our content accuracy on-prem, when they're ready to make that migration to the cloud, it's a pretty seamless transition from their perspective because they want to get the same answer in the cloud that they were getting on-prem.\n\nAnd that's why we enjoy such high success rate on those migrations. But I would not say there's any unique acceleration.\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nRight. Got you. That's helpful. And a great segue into the next question, which is, I think Josh asked a couple of questions on the macro.\n\nWould be interested when you look specifically at the, I guess, adoption triggers, right? The trigger events that typically drive adoption of your solutions or moving to cloud or what have you, specifically momentum in the ERP implementation pipeline and the progress you're seeing in that pipeline. And then any other observations around significant adoption triggers that you're seeing here.\n\nDavid DeStefano -- Chief Executive Officer\n\nYeah. So we -- our adoption triggers are threefold. They are business model transitions as companies seek to create new revenue models, which obviously in challenging economic times is going to be an area of focus. And as they're doing that, that will create pressure on the in-house tax solution, which will create pain and, therefore, opportunities.\n\nYou'll also see it in the regulatory environment in one or two ways. You'll see it either in increased regulations or you'll see it in audit pressure. And we've seen through tough economic times, both things showing up. So that's another trigger.\n\nAnd then lastly, as you note, it's the system change. It could be a best-of-breed like I'm adopting a Coupa or an e-commerce platform like Adobe Magento or it could be ERP. And I would say right now, we're seeing demand across all three of those segments. We haven't seen any material slowdown in the work that we're doing across those platforms, across those drivers at this point.\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nVery helpful. Thanks again.\n\nDavid DeStefano -- Chief Executive Officer\n\nSure.\n\nOperator\n\nNext question, Brad Reback with Stifel.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. High level, guys, without getting specific on guidance for next year. But do you see margins bottoming this year?\n\nJohn Schwab -- Chief Financial Officer\n\nYeah. This is John, Brad. Thanks for the question. I think we do.\n\nI think we've talked about that we really see this year as a big investment year for us. I mean we are making significant investment both in external facing through sales and marketing as well as through some of the R&D activity that we're doing to develop some of those new products. And we have always expected this was going to be our heaviest year of investing and that we would start to see ourselves move out of it into the back part of next year for sure.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nAnd just sort of following on there, free cash flow this year, will it be positive?\n\nJohn Schwab -- Chief Financial Officer\n\nWe anticipate that it will. We don't guide to that, Brad. But from a free cash flow standpoint, we had a couple of big drivers in the current quarter when we think about some of the changes that took place. The biggest areas in ARR.\n\nWe had a couple of real big ARR collections back in Q2 of 2022 that really drove in, and it was a lot of kind of pent-up stuff from the pandemic. And then -- and that was -- sorry, and that was in 2021. In 2022, what we did see is the timing of certain of the renewals and certain of the new sales that we had in the quarter were a little bit differently time than last year. And so I think the cash flow from those things just flops period.\n\nSo I think we'll see that come back. We believe that's going to be -- that's certainly going to be positive, but we feel good about our opportunity to continue to generate cash flow and move it forward. Our aging continues to be in great shape. And again, because of the investment year from a cash flow standpoint, the PP&E and some of those spends are continuing to be very strong as we drive those product development activities.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nThat's great. Thanks very much.\n\nJohn Schwab -- Chief Financial Officer\n\nYou bet.\n\nOperator\n\nNext question Samad Samana with Jefferies.\n\nSamad Samana -- Jefferies -- Analyst\n\nHey. Good morning, gentlemen. Maybe first, just going back to the organic ARR that was a pretty strong sequential increase and good particularly in dollars added for 2Q. So John or David, either one of you could answer this question, but I'm curious, how would you think about that better than normal seasonal strength? Is that more of a function of sales execution, the timing of go lives, maybe switching from 1Q to 2Q or just better-than-expected demand? Just how should we think about that given how seasonally strong that was?\n\nDavid DeStefano -- Chief Executive Officer\n\nI think, I would say a couple of things there. I would say one is we've been investing continually in our sales and marketing, it takes -- there's a lead time before you actually are going to get return on that. And so we're seeing, I think, some of the growth because of the investments we've made there in both customer success and sales and marketing that is driving continued improvement. I do think traditionally, in our business, Q1 is a little slower than Q2 in general.\n\nSo that's not unusual for us. And then the last thing, I think the investments we've been making with our ecosystem partners and the relationships that we -- that I've called out about SAP and Oracle are really critical to our success and they continue to be important levers that we're digging into.\n\nSamad Samana -- Jefferies -- Analyst\n\nUnderstood. And then just as I think about, David, your comments on several large European wins, that just kind of stands a little bit in contrast to some maybe other software companies that are calling out Europe being a little bit of a tougher market right now. What do you think is driving your customers or your wins there beyond your distribution efforts? Is it just that the problems around tax rules has gotten too complex and they have no choice? Or is it just your vertical exposure that's still long you have success in Europe? Just maybe help us understand why that's a little bit different than maybe what some other software companies are seeing in the market?\n\nDavid DeStefano -- Chief Executive Officer\n\nSure. So I'd start with our product suite. I'm really proud of what our team has built with that chain flow accelerator now our global compliance solution as those are maturing in the market. I think gaining referenceability around those is growing.\n\nThe European market, as I've mentioned in the past, is very much a community with referenceability, anything in the enterprise market, but Europe, in particular, where referenceability matters. And so I think combination of the great work our team has done in the product suite, the referenceability we're gaining. We enjoy strong relationships with the alliance partners and consulting partners in the U.S. That is translating more and more into Europe because of their global organization as well.\n\nAnd then obviously, the strength of our SAP offerings, the whole suite of SAP capabilities we bring to bear with the LCR-Dixon acquisition we made last year, the relationships we enjoy with SAP. When you put those together, I think that's what's generating the type of results that we're excited about.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. Appreciate you taking my questions, and good to see the solid results.\n\nDavid DeStefano -- Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] Next question comes from Daniel Jester with BMO.\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nThanks for taking my question. Good morning, everyone. Appreciate the additional color on the indirect client growth. Maybe if you could just spend a minute and help us think about sort of how additive that could be in the future, what's driving that, etc.?\n\nDavid DeStefano -- Chief Executive Officer\n\nYeah. I think it's part of our strategy to be efficient in accessing a market that otherwise we don't think is very efficient to access on a direct sale basis. And so I think as we continue to advance, and again, I think referenceability will Matt, as we continue to add new partners into that equation, it will be -- it builds over time, though. It will be an additive, but I don't want to confuse you -- confuse anyone that our focus is the enterprise market and the upper end of the mid-market.\n\nThese are unique opportunities where we'd see growth but it's clearly not the primary focus of this business. Primary focus is complex mid-market and enterprise customers where we lead.\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nGreat. And then maybe two quick ones for John. First, I don't know if you've mentioned it, but did you say what organic cloud revenue growth was in the quarter? And was there any FX impacts on the second quarter or in the guide? Thank you.\n\nJohn Schwab -- Chief Financial Officer\n\nYes. Thanks, Dan. Appreciate it. There was virtually minimal impact from an FX standpoint.\n\nGenerally speaking, the majority of our revenue comes in U.S. denominated and even our European contracts. Some of those are denominated in U.S. So we do not have a big impact on exposure to FX from that standpoint.\n\nAnd from a cloud revenue standpoint, I think we talked a little bit about the growth there in terms of kind of what that's come through cloud revenue was the 25% growth that we reported out. And then on a pro forma basis, excluding the $2.1 million item from last year, that gets back up to 34%. \n\nDan Jester -- BMO Capital Markets -- Analyst\n\nAll right. Thank you very much.\n\nJohn Schwab -- Chief Financial Officer\n\nYou bet. Thank you.\n\nOperator\n\nNext question, Pat Walravens with JMP Securities.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you, and let me add my congratulations. So it's just kind of interesting is the change in the competitive landscape with Vista and Avalara. So David, could you just maybe remind us how often and when you compete against them? And what impact you think this might have on your business going forward?\n\nDavid DeStefano -- Chief Executive Officer\n\nYes. So I think we see them primarily in the mid-market. That's our -- that's been sort of the middle ground between them coming up market and us moving down market as more demand is showed up in the mid-market, and that's really where we see them. We don't really see them and I wouldn't have not seen any material change in our competitive win rates through our competitive dynamics, quite frankly, at the enterprise market.\n\nThat's really Vertex and Thomson Reuters. I don't want to speculate on what this is going to do. I certainly think it validates the space in the industry that we play in. And the reality is we've seen a lot of M&A deals in our industry over time.\n\nThomson bought Sabrix, ADP and Vista have both owned what is now HG's tax wear business and now -- so that became Sovos, and you had strike by tax charge. So we've seen a lot of industry transition. It really hasn't affected our brand, our market leadership or our strategy in any material way.\n\nPat Walravens -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\nNext question comes from Keith Weiss with Morgan Stanley.\n\nUnknown speaker\n\nHi. This is Steve Otun on for Keith. Thanks again for taking my question. So I just wanted to touch on kind of the growth that you're seeing in Europe.\n\nAnd maybe can you provide any additional color sort of on your investments in Europe and how they're paying off and what differences you're seeing between the U.S. and European market in this environment? And then maybe also you spoke a little bit to the catalyst for customers to move to the cloud. So if you can maybe zoom into particularly the in Europe, which one of these catalysts is really driving the strong cross-sell deals that you noted? And how do you expect that sort of going forward?\n\nJohn Schwab -- Chief Financial Officer\n\nYes. So the European -- thanks for the question. The European growth -- I think you have to focus on the product suite. We have built products that are uniquely aligned to the SAP ecosystem.\n\nThey are certified within SAP, which is really important to the end user to experience it the way they experience the rest of the SAP capability and the recipe offerings and -- so I think in doing that, that has created a differentiation for us in the market. When you add in some of the acquisitions we made like LCR-Dixon, which has a wonderful tool set of capabilities for SAP. It really gives us a broader approach to market than what we're seeing -- what we've seen in competitive environment. And so I think that's why we've enjoyed the success we have.\n\nAs far as looking forward, I think we're going to continue to invest in areas of Europe that are where demand is being driven. So that would be around things like we're seeing e-invoicing becoming a growing demand point. We're seeing regulatory change that is making it more complex for the native functionality of VAT, and that has -- that continues to be an opportunity area for us. And then again, I can't emphasize enough referenceability matters.\n\nIn the enterprise market, and so part of the reason I think we're gaining some traction there is we have been fortunate to secure some of the largest companies in Europe. And in doing so, that will attract other tax buyers who are struggling with some of the issues on regulations to look for who else is doing this well. And because Vertex is now developing brand over there, I think that is why we're gaining the traction we are.\n\nUnknown speaker\n\nExcellent. Thank you.\n\nOperator\n\n[Operator instructions] There are no further questions. I would like to turn the floor over to David DeStefano for closing remarks.\n\nDavid DeStefano -- Chief Executive Officer\n\nGreat. Thank you for joining us today. We look forward to speaking with you next quarter. If you have any questions, please don't hesitate to reach out.\n\nHave a great rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoe Crivelli -- Vice President, Investor Relations\n\nDavid DeStefano -- Chief Executive Officer\n\nJohn Schwab -- Chief Financial Officer\n\nJosh Reilly -- Needham and Company -- Analyst\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nSamad Samana -- Jefferies -- Analyst\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nUnknown speaker\n\nMore VERX analysis\n\nAll earnings call transcripts"
}