{
  "companyName": "Korn/Ferry International",
  "companyTicker": "KFY",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/kornferry-international-kfy-q1-2023-earnings-call/",
  "content": "Korn/Ferry International (KFY -0.32%)\nQ1 2023 Earnings Call\nSep 07, 2022, 12:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Korn Ferry first quarter fiscal year 2023 conference call. [Operator instructions] As a reminder, this call is being recorded for replay purposes. We have also made available in the Investor Relations section of our website, at kornferry.com, a copy of the financial presentation that we'll be reviewing with you today. Before I turn the call over to your host, Mr.\n\nGary Burnison, let me first read a cautionary statement to investors. Certain statements made in the call today, such as those relating to future performance, plans, and goals constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Although the company believes the expectations reflected in such forward-looking statements are based on reasonable assumptions, investors are cautioned not to place undue reliance on such statements. Actual results in future periods may differ materially from those currently expected or desired because of a number of risks and uncertainties, which are beyond the company's control.\n\nAdditional information concerning such risks and uncertainties can be found in the release relating to this presentation and in the periodic and other reports filed by the company with the SEC, including the company's annual report for fiscal year 2022 and in the company's soon to be filed quarterly report for the quarter ended July 31, 2022. Also some of the comments today may reference non-GAAP financial measures, such as constant-currency amounts, EBITDA, and adjusted EBITDA. Additional information concerning these measures, including reconciliations to the most directly comparable GAAP financial measure, is contained in the financial presentation and earnings release relating to this call, both of which are posted on the Investor Relations section of the company's website at www.kornferry.com. With that, I'll turn the call over to Mr.\n\nBurnison. Please go ahead, Mr. Burnison.\n\nGary Burnison -- Chief Executive Officer\n\nThank you, Tony. Good afternoon, and thanks for joining us. First, I'm very pleased with our first quarter results. They were up about 24% constant currency, 19% in actual dollars to about $696 million in fee revenue, and our long-term performance has also been good.\n\nOur 10-year CAGR is about 13%, while our 20-year CAGR is about 10%. When you look more broadly at the landscape today, there's a big reset taking place, not to mention a work scape that is experiencing significant labor imbalances and dramatic changes in how and where organizations get work done. These tectonic shifts under our feet are arguably the most significant since the Industrial Revolution. As a result, organizations, including Korn Ferry, will face a different climate over the next year than we've seen over the last 24 months.\n\nClients will undoubtedly be in a fight for growth, profitability and relevancy. And I'm confident that we've built a portfolio of offerings and IP that are relevant in today's and tomorrow's business environment. During times of change, it's easy to identify numerous potential initiatives, but great companies choose the most impactful and execute them relentlessly. As such, we're anchoring Korn Ferry around initiatives that will continue to drive opportunity in the months ahead.\n\nNumber one, we're executing a major account strategy that represents about 36% of our portfolio. The program includes 350 marquee and regional global accounts, generating almost $1 billion in revenue on the current run-rate basis. And that strategy is key to maintaining scalable and durable revenues. Secondly, we're driving an integrated go-to-market strategy, One Korn Ferry, which delivers almost 30% of our revenue from cross line of business referrals.\n\nOur consulting and digital capabilities represent 38% of our firm. We're going to continue to invest in these areas to expand our suite of technological and digital capabilities. And we're also excited about the potential of our new interim business with about $200 million of annual run rate on a current basis. Then that includes our most recent investment in Infinity Consulting Solutions last March, and we really welcome them to the Korn Ferry family.\n\nGiven the labor imbalances that exist, and the career nomad trend as people change jobs more frequently, we continue to pivot toward bringing our interim capabilities to market. We also see growth opportunities around the focus on sales effectiveness and bolstering tech upskilling in the marketplace. ICS has a heavy focus on technologists, and our firm is working on a digital platform to upskill technology professionals. Lastly, we're going to continue to execute a balanced, disciplined approach to capital allocation.\n\nThe times of great change can bring great opportunity. We're going to remain relentlessly focused on meeting the evolving needs of our clients, as they rethink all aspects of their strategy, their organizational leadership, and talent components needed to drive success. This includes specialized offerings in learning and professional development for these times. While cycles will continually change, the long-term premium on people endures.\n\nStrategy without talent is helpless, and talent without strategy is hopeless. Korn Ferry is the firm that helps clients drive performance through synchronizing their organization, their strategy, and their people. I'm joined this morning by Gregg Kvochak and Bob Rozek. Bob, I'll turn it over to you.\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nGreat. Thanks, Gary, and good afternoon or good morning, depending where you are in the world. Secular drivers are reshaping the world of work and continue to drive our business forward. Even in today's uncertain economic environment, global labor markets continue to be dislocated, challenged by shortages of skilled talent.\n\nAnd it really drives companies to seek new and innovative ways of finding, engaging, developing and retaining their workforce. Our strategy capitalizes on these drivers. An example of this is our timely diversification into interim talent solutions that Gary just spoke about. We're helping our clients with their increased need for finding quality talent, which, in today's times of labor shortages, is both permanent and interim positions.\n\nToday, more than ever, our broad collection of integrated talent management solutions anchored in a common set of proprietary intellectual property are perfectly aligned with the needs of the market. Now this ever-growing relevance uniquely positions us to partner with our clients to find bona fide business solutions to today's most difficult talent issues. Remember, as I've said in the past, no company has ever navigated through uncertain times or solved a sticky business issue without the help of people, and that's where we come in. Our services and solutions enable people and organizations to exceed their potential.\n\nWe continue to thrive in today's economy, and our results for the first quarter of fiscal '23 illustrate the power of our strategy and our relentless focus on execution. In the first quarter, fee revenue grew to $696 million, which was up $110 million or 19% year over year, and that was up 24% at constant currency. Every line of business grew year over year in the first quarter led by professional search and interim, which was up 101%; RPO, which was up 37%; and consulting, which was up 18%, now all of that at constant currency. Consolidated new business, excluding RPO, was also up in the first quarter, with year-over-year growth in nearly every line of business.\n\nBy month, new business was good in May, strong in June, but was followed by a slower July. RPO new business remained exceptionally strong in the first quarter, with another $149 million of new contracts. An interesting note, synergies between our professional search and interim, which includes, obviously, our recent acquisitions, with our other lines of business continues to remain strong as the cross line of business referrals actually increased the professional search and interim new business by almost 18% for the quarter. Now our digital new business was lighter than expected.\n\nFor the eight prior quarters, digital averaged about $10 million per quarter in large deals, with large being defined as those over $1 million. Going into the quarter, digital had a strong pipeline of large deals, but only $2 million in large deals closed in the quarter. The pipeline for large deals remains very strong, and we expect to return to historical levels of deal closings. Higher revenue and disciplined cost control continue to drive earnings growth.\n\nAdjusted EBITDA grew $11 million or 9% year over year to $132 million, with an adjusted EBITDA margin of 19%. Our earnings and profitability in the first quarter were impacted by both investment spending for new hires, as well as promotion pay raises. These investments in our colleagues are important to drive future growth and to keep our colleagues engaged and motivated. Our adjusted EBITDA margins were also impacted by our continued investment in interim businesses, which carry a slightly lower post-synergy adjusted EBITDA margin, but really offer us significant opportunities to capture outsized rates of fee revenue growth.\n\nAnd finally, our adjusted diluted earnings per share grew $0.13 or 9% year over year to $1.50. Our investable cash position remains strong. At the end of the first quarter, cash and marketable securities totaled about $897 million. Now excluding amounts reserved for deferred comp arrangements and accrued bonuses, our global investable cash balance at the end of the first quarter was approximately $614 million.\n\nYou heard Gary talk about our capital deployment, how that continues to be well balanced. In the first quarter, we repurchased about 370,000 shares of our stock using about $22 million, paid a cash dividend of approximately $7 million and we funded about $17 million of capital expenditures, most of which was directed toward development initiatives for our digital business. And as we previously announced, we deployed about $100 million in capital with the acquisition of Infinity Consulting Solutions, or ICS. And we did that on August 1, the first day of our second quarter.\n\nWith that, I'm going to turn the call over to Gregg to review our operating segments in more detail.\n\nGregg Kvochak -- Investor Relations Contact\n\nThanks, Bob. Starting with KF Digital. Global fee revenue for KF Digital was $83.8 million, which was up approximately 4% year over year and 10% at constant currency. The subscription and license component of digital's fee revenue continued to grow, reaching $30 million, which is up approximately 21% year over year and was approximately 35% of revenue for the quarter.\n\nGlobal new business for KF Digital was approximately $93 million, with $31 million of the total coming from subscription and license sales. Earnings and profitability were slightly impacted in the quarter by investments in both commercial sales representatives and product development initiatives. In the first quarter, digital generated adjusted EBITDA of $24.2 million, with a 29% adjusted EBITDA margin. Now turning to consulting.\n\nFee revenue grew to $166.5 million, which was up approximately 12% year over year and 18% at constant currency. Fee revenue growth continued to be broad-based across all solution areas and strongest regionally in EMEA and North America, which were up 18% and 20%, respectively, at constant currency. Consulting new business was up 1% year over year and 7% at constant currency. In the first quarter, adjusted EBITDA for consulting grew $2.7 million or 10% to $29.6 million, with an adjusted EBITDA margin of 17.7%.\n\nGrowth in professional search and interim was also strong in the first quarter, supported by steady market demand for skilled professionals and aided by new and enhanced capabilities recently acquired from both Lucas Group and Patina. Fee revenue for permanent placement was $74 million, which was up approximately $22 million or 42% year over year. Our interim fee revenue grew to $25 million, with quarter sequential growth driven in part by our recent acquisition of Patina, which provides senior-level executive and professional talent on a project basis. Our interim business average bill rate was approximately $122 per hour.\n\nAdjusted EBITDA was up $9.8 million or 50% year over year and $29.2 million -- or $229.2 million with a 29.5% adjusted EBITDA margin. Fundamentals for our recruitment process outsourcing business remained strong in the first quarter. RPO was awarded another $148 million of new business in the first quarter, consisting of $114 million of new client work and $34 million of renewals and extensions. This brings the total revenue under contract at the end of the first quarter to approximately $821 million.\n\nFee revenue was also strong, growing to $114 million, which was up $27 million or 30% year over year and approximately 37% at constant currency. Earnings per RPO continued to scale with revenue, with adjusted EBITDA at $17.7 million, which was up $3.2 million or 22% year over year with an adjusted EBITDA margin of 15.5%. Finally, in the first quarter, global fee revenue for executive search grew to $233 million, which was up 7% year over year and 11% at constant currency. Growth was strongest in EMEA and North America, which were up approximately 22% and 10%, respectively, at constant currency.\n\nGlobal new business for executive search was also strong in the first quarter, up approximately 9% year over year and 12% at constant currency. We continue to expand our team of consultants, with a total number of dedicated executive search consultants worldwide at the end of the first quarter reaching 619, which was up 54 year over year and up 32 sequentially. The 32 consultant additions in the quarter consist of 13 net new hires and 19 promotions. Annualized fee revenue production per consultant in the first quarter remained strong at $1.54 million, and the number of new search assignments opened worldwide in the first quarter was down 4% year over year to 1,682.\n\nIn the first quarter, global executive search adjusted EBITDA grew to approximately $62.2 million, which was up 1% year over year, with an adjusted EBITDA margin of 26.7%. Now I'll turn the call back over to Bob to discuss our outlook for the second quarter of fiscal '23.\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nGreat. Thanks, Gregg. In setting guidance, there were a number of factors we considered. First, let's revisit the broader landscape and the big reset that Gary mentioned.\n\nIncreasing uncertainty and economic factors like inflation that we haven't seen since the 1970s, rising interest rates, supply chain disruptions, escalating geopolitical tensions, all of this contributes to a wide range of potential outcomes. Second, we consider the fact that consolidated new business in the first quarter was up year over year, with growth across nearly all lines of business. Now on a monthly basis at constant currency, our consolidated new business without RPO and measured year over year grew 19% in May, 26% in June and then decelerated to approximately 7% in July at the beginning of the summer vacation season. At constant currency, our August new business without RPO, which historically is seasonally slower, was up 15% year over year.\n\nThird, we looked at our historical seasonal patterns of new business. And if they were to repeat, we would expect September new business to grow sequentially over August and then peak at a quarter high in October. And last, while we understand the current state of play, it is difficult to know what the future holds. So for purposes of determining our guidance, we are assuming no new major pandemic-related lockdowns or any further changes in worldwide geopolitical conditions, economic conditions, financial markets and foreign exchange rates.\n\nNow considering all of those factors above, we broke from a historical monthly new business patterns in the second quarter, and we have assumed that September new business will be on par with what we did in August, and the month sequential increase in October will be mid-single digits. So for our fiscal year '23 second quarter, we expect fee revenue to range from $678 million to $708 million and our consolidated adjusted diluted earnings per share to range from $1.34 to $1.50 and our GAAP diluted earnings per share to range from $1.28 to $1.45. Now our guidance for the second quarter includes the addition of ICS, our recent acquisition. ICS provides professional talent primarily on an interim basis in high-demand specialties like information technology, legal and compliance and finance, and accounting.\n\nIn calendar year '21, ICS generated approximately $88 million of fee revenue, with about 90% being generated from IT interim services. Now in closing, even if economic headwinds begin to accelerate and job postings begin to moderate, we believe shortages of skilled executive and professional talent will persist against the backdrop of elevated global uncertainty. Additionally, today, more than ever, our clients realize that an integrated talent management strategy is critical to their long-term success in finding a relevant partner to help them with issues, such as workforce transformation and digitization; employee retention and development; ESG, including diversity, equity, and inclusion. Accelerated revenue growth in a number of other complex talent initiatives is essential.\n\nWith the collection of assets that we have, core and integrated solutions, data, IP, content, we are an industry of one, uniquely positioned to be the partner that helps people and organizations exceed their potential. With that, we would be glad to answer any questions you may have.\n\nOperator\n\nThank you. [Operator instructions] Our first question will come from the line of George Tong with Goldman Sachs. Please go ahead.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nAll right. Thanks. Good morning. In the past, you've discussed normalized EBITDA margins being in the 18% to 19% range.\n\nCan you discuss whether you expect to land within that range in fiscal 2023? And what EBITDA margin assumptions are included in your fiscal 2Q EPS guide?\n\nGary Burnison -- Chief Executive Officer\n\nWe don't guide out more than a quarter, but I would say that we have an enormous potential given the labor trends that we're seeing in the marketplace around professional search and interim and RPO. And with that increasing pursuit of those growth opportunities comes with it a higher revenue but at a lower margin. And so right now, if you were to look at it where we currently are with the interim business and the RPO business that's getting increasing traction in the marketplace, we would assume that that's at least a 50-basis-point impact on what we had talked about in terms of long-term margins. Now if we are even more successful, particularly on the interim side, and if companies really pivot toward cost optimization and there's still a labor imbalance, the RPO business has even greater runway.\n\nAnd so with those two things, there clearly could be a pressure on what we had talked about last quarter in terms of our longer-term margins, but it really depends on whether we're able to capitalize on those growth opportunities.\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nGeorge, I would -- go ahead, George.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nNo. Just to follow up, so what margin assumptions are embedded in your fiscal 2Q guide?\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nYes. So I was just going to say it's right in the range that we talked about, 18% to 19%.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nOK. Perfect. And then a follow-up question on quarterly new business growth. It was 26% year over year in fiscal 4Q, 17% in fiscal 1Q on a constant-currency basis.\n\nWhat's a reasonable and sustainable rate of growth for new business? And how should that translate into near- to medium-term fee revenue growth?\n\nGary Burnison -- Chief Executive Officer\n\nWell, life is full of cycles, and businesses are full of cycles. I would point back to our 10-year CAGR has been 13% and our 20-year CAGR is 10%. So through different kinds of cycles, that has been our actual performance. Clearly, the levels that we saw coming out of the pandemic, the complete shutdown, those are not sustainable.\n\nAnd so you look at July and August, and new business in both those months was up 7%, 8% constant currency, kind of 3% actual. And that's probably -- that's more in line with our 10- and 20-year CAGRs.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nGot it. Very well. Thank you.\n\nOperator\n\nThank you. Our next question is from Tim Mulrooney with William Blair. Please go ahead.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nYeah, good morning. So in executive search, it looks like the number of engagements billed and number of new engagements is down sequentially and year over year. We keep hearing about how the tight labor market, how tight it still is today. And you read all these articles about the skills gap for leadership roles.\n\nBut given the recent deceleration in the numbers, I'm curious how you'd characterize the state of the labor market right now relative to, say, three to six months ago for executive search.\n\nGary Burnison -- Chief Executive Officer\n\nWell, look, we would look at executive search, and then we would look at the bigger opportunity around knowledge workers, professional level people. And I would say that on the executive side, you're not going to see what we saw a few months ago in terms of the level of demand that escalated there. So you look today, our unit count is running -- I'm taking July and August now. I'm not talking about our first quarter.\n\nBut take the unit count, it's probably above -- slightly above where we were pre-pandemic on executive search. But the fees, the productivity, the average fees are substantially higher, which reflects the broader landscape of wage inflation. When it comes to professional search and interim, I think there's a significant labor imbalance, and I just look at the U.S. workforce as an example.\n\nAnd you go back 15 years, and there's not much growth in the workforce. The last two-and-a-half to three years, there's really no growth. And as you know, the labor participation rate is 62%. So central banks are focused on demand, tamping down demand.\n\nI don't know if the problem is so much demand as it is supply, and supply clearly when it comes to labor. So I think what you're reading today is exactly what we're seeing and why we've, over the last 18 months, made such a big push toward career nomads and interim professionals and professional search.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nGot it. That's helpful. If I kind of stay on this point about the massive shortage that we have and that maybe being reflected stronger in interim and professional search. And Bob, maybe this one is for you, but you did, I think, $74 million this quarter in professional search and $52 million in the first quarter of last year.\n\nBut I do believe that there's some acquired revenue from Lucas and Patina in there. Maybe Infinity, I don't know. But if you were to strip out the acquired revenue, I don't know if you have that number handy, but how would the professional search business have performed on an organic basis in the quarter?\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nYeah. The pro search business on an organic basis, we would have seen kind of low single-digit growth in the first quarter. \n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nOK. Thank you very much.\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nAnd remember, Tim, and even thinking about what George's questions were, the M&A, I know people like to look at things organic and inorganic. But M&A is a huge part of our strategy. And when Gary talks about 10% CAGRs and 13% CAGRs, that includes M&A. And we view M&A as just -- it's no different than putting capital investment into digital to grow that business.\n\nSo we -- as we look at ourselves and the opportunities, we look at it all in.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nSo maybe I'll just ask one more then as a follow-up there. I mean, what is your appetite for more M&A in this environment? Should we expect you to take a little bit of a pause here and integrate these three assets that you've recently acquired? Or are you still comfortable pursuing more acquisitions this fiscal year?\n\nGary Burnison -- Chief Executive Officer\n\nWe're pursuing on absolutely a balanced approach, a systematic approach to capital deployment. And yes, we do have an appetite. We are going to continue to make investments. We're going to do it cautiously, carefully.\n\nAnd we're also going to balance out with our returns to shareholders.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nUnderstood. Thanks so much.\n\nOperator\n\nThank you. Our next question is from Mark Marcon with Baird. Please go ahead.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nYeah. Well, Tim's last question was going to be my first question, but let me expand that to also internal hiring. I mean, Gary, we've been through multiple cycles together. The Fed is obviously working hard to tamp down demand.\n\nAre you going to stay on the same pace from an acquisition perspective as what you've been on over the last 12 months? Or would that pace be a little bit more tempered? Or would you be -- or would you apply maybe more bargaining with regards to what price you'd be willing to pay given that it looks like the cycle is kind of peaking here?\n\nGary Burnison -- Chief Executive Officer\n\nWell, I hope it's the latter. I hope we're very smart. And certainly, we would absolutely take into account the economic context and the valuation, no doubt about it. But I do see this labor imbalance is real.\n\nAnd I think there is a supply issue, not only a supply chain issue, but a supply issue of talent. And so we do see an opportunity here to capitalize on pro search and in interim. And as Bob alluded to, what we're seeing is incredibly high levels of cross referrals on the businesses that we've acquired. So I think we'll be consistent, we'll be steady, but we'll absolutely be mindful of the economic context and valuation levels.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nAlong those lines, I mean, what are you thinking about with regards to internal hires and particularly in areas like consulting or executive search? How should we think about headcount on a go-forward basis?\n\nGary Burnison -- Chief Executive Officer\n\nWe -- number one, in the digital area, we are -- cautiously, but we are increasing the capacity there on the commercial salespeople that we have. So that is an area that we've been actively pursuing now for several months. We're going to continue to do that. We're going to be careful about it.\n\nBut clearly, that's one, and consulting is the other. So both of those areas, we haven't changed our viewpoint in terms of bringing in talent and also promoting talent. I mean, we just had a record level of promotions as well the past year.\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nAnd Mark, it's Bob. I was just going to add to that in the digital business, we're also adding product development folks. We were maybe a little bit over relying on contractors in the past. And so we're shifting to bring more of those resources in-house, so you don't have knowledge walking out the door when a contractor decides to leave.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nGreat. And then with regards to EMEA, on the executive search side, it's been surprisingly strong given some of the challenges that are occurring over there. What do you attribute that to?\n\nGary Burnison -- Chief Executive Officer\n\nWell, look, we have an outstanding team. We've got a great footprint. And when you look at the EMEA business, in July and August, I mean, on a constant-currency basis, it increased, both kind of in line with what we said globally about July and August. So that was very good to see.\n\nIt's been fairly broad-based across EMEA. The area -- the region that showed the weakness, Mark, is Asia, and that has certainly tempered the new business that we saw in July and August. The policy in China around zero tolerance has absolutely had an impact on our business levels of new business in July and August. And China is a big driver, not only of the world.\n\n33% of the world is manufacturing, but it's clearly a driver of the broader Asia Pacific region.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nYes. If we go into a recession, say, a mild one, not like the last two at or with the flexibility that you currently have? In other words, every cycle, you've done a little bit better in terms of margin protection. How should we think about it this time around?\n\nGary Burnison -- Chief Executive Officer\n\nYes. No, that's a good point. I'll let Bob answer the details, but you're right. I mean, when you look at the company's performance, peak to peak, trough to trough, during these different cycles, we've topped for sure.\n\nWe've topped previous cycles. And so Bob, what would be a good way to kind of lay a framework around that?\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nYes. So Mark, what we have in place, what we call, our operating boundaries. And if you go back to the Great Recession, during the 12 months following, when we troughed, we burned through approximately $30 million in cash. And so when we were dealing with the pandemic, we took a look at our operating boundaries and said, \"What we want to do going through the pandemic is we want to maintain cash flow neutrality.\" And for the 12 months following the trough, we actually generated about $117 million of cash.\n\nAnd so now, as we look at our scenario planning, obviously, we'd want to do better than cash flow neutral. And so what we've done is we've increased the EBITDA margin and really using that as our operating value. Now we're saying on a trailing 12 basis, we would not want to go below a 5% adjusted EBITDA margin, and that would make us probably be $160 million, $170 million positive cash flow in that period. Now we've modeled out a couple of different scenarios.\n\nAnd given where the business is today, if we're down 10%, 15%, we would still be kind of low double-digit EBITDA margins given the cost structure and everything we have in place today. But we'd be looking for no less than a 5% adjusted EBITDA margin on a trailing 12 basis.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Marc Riddick with Sidoti. Please go ahead.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nHey, good afternoon, everyone. I wanted to touch on the -- any thoughts you may have on -- anything you could share regarding the pricing dynamic that you're seeing in the various segments? And first of all, by the way, I should have mentioned that I do appreciate the breakout of RPO and pro search and what we saw there. So that's nice to see. But I was wondering if you could talk a little bit about sort of bill rates and maybe what room there may be there on pricing and sort of how you sort of feel about where you are currently given the demand drivers and what's needed by clients around the world.\n\nIt seems as though there would be some room there to operate.\n\nGary Burnison -- Chief Executive Officer\n\nWell, we -- about a year ago, nine months ago, we certainly put in place protocols to increase our pricing, and that is certainly borne out in the numbers. And so when you look at the professional search and executive search businesses, there's kind of a natural regulator there, which revolves around wage inflation. And so we've clearly seen that in our average fees, and we'll have to continue to see if that wage pressure continues. Certainly, today, there's been no let up on that.\n\nIn our consulting business, when you look at our average hourly rates, it's up 20% since pre-pandemic. I think we're about $300 an hour. Now we're at $363. In this quarter sequentially, we didn't see as big of an increase.\n\nI think we're around $363, $365, something like that. So we're continuing to put discipline around pricing. I don't see that 20% uplift for sure from where we were pre-pandemic over the next few months. But is there room to grow? Yeah, there's room to grow, but we also have to be cautious of the environment around us in the competitive landscape.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nOK, great. And then switching over to something completely different. I was wondering if you could talk a little bit about if you're seeing much in the way of differentiation among industry verticals, among customers as far as recent activity and maybe some of their targeted priorities, if you've seen much in the way of changes in that regard?\n\nGary Burnison -- Chief Executive Officer\n\nWell, the macro change is companies dealing with career nomads. So hybrid working, ,which is really code from working from home, that's clearly one. But then that plays into learning and development.How do you mentor people? How do you grow? And so that's why we are putting increased emphasis on the professional development segment of our business. So that would kind of come screaming off the page, broadly speaking.\n\nWhen you look at the industries, sequentially, if you just take a look at the first quarter compared to our fourth quarter, we certainly saw a slight downdraft as you would expect in technology. You read about it. And we saw a downdraft in financial services, particularly around capital markets, as you can appreciate. So those two things, we saw those things pencil out in the numbers.\n\nOn the other side, we've seen continued strength in industrial, and industrial is our flagship offering. It's almost 30%, 26%, 28% of the firm. And we saw growth in both the fourth quarter year over year and then sequentially even fourth quarter to first quarter.\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. Our next question is from Tobey Sommer with Truist Securities. Please go ahead.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nThanks. I wanted to start by following up on your CAGR over the last 10 and 20 years. What's the organic CAGR over those periods?\n\nGary Burnison -- Chief Executive Officer\n\nGregg and Bob, do you have that?\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nWe don't really look at it that way. We just look at the -- again, given that M&A is such a critical part of our strategy, we view that as just deployment of capital, and we look at the growth holistically.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK. Within the push to interim, could you maybe put some flesh on the bones of the target that you're aiming for? What does it look like in five years as a percent of sales to the company, if that's a reasonable amount of time? You can pick a different one if you like. And what are the sort of focal areas that you think you'll end up having the most exposure to?\n\nGary Burnison -- Chief Executive Officer\n\nTobey, to answer your first question, in our strategic plan, we would think that 30% to 40% of our growth is going to come on an inorganic basis. And I wouldn't be surprised if you look back on those numbers, and then certainly don't hold me to this because, as Gregg and Bob said, we haven't done the math. But I would presume that the inorganic piece of that is probably around that level. The thing that's very hard to measure is we do have an integrated strategy when we make investments in companies.\n\nAnd when we make an investment, we typically see at least 25% -- 20%, 25% gearing on whatever that company's revenue was, and that's borne out in the data. When you look at the cross line of business referrals, it's almost 30%, which is quite significant. So that's the hard part for us to actually do the mathematics around that. But as Bob said, it's part of our disciplined approach to capital.\n\nThe interim business, looking out on a long-term basis, that should be at least $1 billion business. And so today, again, on a run-rate basis, call that $200 million. So could you -- and this is not even talking about professional search. But could you see your way to $1 billion? And the focal point there is broadly around two areas: technologists and finance and accounting.\n\nThose are the two areas. I'm not saying we wouldn't -- we do an HR. We do legal. We do supply chain.\n\nWe do a lot of other things, but those two areas would be key. If you look at kind of trying to get four or fivefold growth into that business from where it is today, and part of that would be dependent on not only this One Korn Ferry go-to-market approach that we've got a proven track record around. But it would be around, as Bob said, the investments that we make as part of a disciplined capital allocation strategy.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nIn the consulting business, how would you characterize the split of services between sort of like up cycle businesses that sell well in an expansion versus ones that sell better in uncertain times? And maybe could you give us a couple of examples of those services that sell better in uncertain times?\n\nGary Burnison -- Chief Executive Officer\n\nWell, I think in this kind of uncertain time, there's a big wildcard because the environment is substantially different than one that I can recall. I just -- you don't see this with the kind of labor imbalance that exists. And so again, I think it's not necessarily a demand issue. I think there's an issue around supply, particularly supply of labor.\n\nSo there could be an interesting opportunity for us on the consulting and digital side around, for example, professional development. That's where we're putting a lot of emphasis there. I think there could be significant demand around sales effectiveness and what we call accelerated revenue growth. That could be up cycle.\n\nTwo years ago, we had just a phenomenal track record around DE&I. I don't think that's going to go away. There's a focus around ESG. I don't think that's going to fully go away.\n\nSo those kinds of areas are interesting today, but this is a different environment for sure. I just -- I haven't seen this where there continues to be this war for talent and this labor imbalance that exists and also just a change in attitudes around work-life balance. I mean, there's just tectonic shifts that are happening right now that haven't been present in previous troughs and peaks.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nIn the digital business, what's most promising over the next year or two that we might talk about? Because I remember, plus or minus a year ago, we talked about a pretty substantial sale you had in sales force effectiveness. What are you most interested in and think we're going to be talking about the most over the next year or two?\n\nGary Burnison -- Chief Executive Officer\n\nWe did, and that will even make the comps harder in the second quarter in terms of new business. We had a very, very large win there. I think medium to longer term, clearly, channel partners, being part of an ecosystem is going to be incredibly important for us, and that is something that we're working very hard on, but the payoff is not immediate. But if you look at any world-class consulting organization, they are part of an ecosystem where they enjoy push and pull from those partners.\n\nSo that is something that we're working hard on. And we're working hard on it, particularly around learning and professional development. So I hope that those are areas that you see. And again, I think the channel partners is a longer-term endeavor.\n\nBut I think the area around learning and professional development is something that we're talking about and particularly around the sales effectiveness. And so when you look at the digital business today, 25% of it or so is around licensing -- primarily, I shouldn't say all licensing, but primarily using our IP to, I'll use the term, license the company. So that's a quarter of it. That's been consistent and steady growth.\n\nAnd this next quarter historically should be one of our better quarters for that part of our digital business. Then half of it, another 50% on top of the 25%, another 50% is really around learning and professional development. A good part of that is anchored around sales professionals. There's -- in the United States alone, there's at least 15 million sales professionals.\n\nAnd we're going to pivot in the medium term. Again, you won't see it necessarily in a couple of quarters, but we are pivoting really hard toward technologists. There's like 65 million technologists in the world, and we're developing offerings that can upskill those technologists. So I hope we're talking about that.\n\nI hope we're talking about continued push and pull on our own ecosystem, particularly within consulting. I hope that we get even more traction there. Then the final piece is around the commercial sales capability that we have. And right now, we're -- we've made an investment in commercial salespeople, in the digital business, where I think we're running about 325 commercial salespeople.\n\nWe would think that number is going to be 350, 360 at the end of this quarter. So those are the things that I hope we're talking about successfully.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nIf I could just ask a last numbers question to understand the guidance. What's the normal historical sequential increase in new business and/or revenue in September? I understand you described it as the guidance embeds sort of a flat comparison versus August, but what would the normal change be?\n\nGary Burnison -- Chief Executive Officer\n\nYes. I'll let Gregg, and he can give the numbers. But certainly, in September from August, we would see an uplift. And that uplift, it's probably 5% to 10%.\n\nThen in October, you'd actually see another increase from September. And whether that's 10%, but it's certainly that kind of pattern. Gregg, what would be the actual numbers behind that?\n\nGregg Kvochak -- Investor Relations Contact\n\nYes, yes. I think you characterized it pretty accurately, Gary. It's going to be very high single digit, close to 10% on a sequential basis, again, September over August and then pretty close to another high single-digit increase in October over September.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. It appears there are no further questions. Mr. Burnison?\n\nGary Burnison -- Chief Executive Officer\n\nOK. Thank you. Thank you to our -- first and foremost, to our colleagues and our shareholders, thank you for taking an interest in what we're doing. I really do believe that, despite all the stuff you read about the economic climate, there continues to be this pretty dramatic labor imbalance, and we're optimistic about what we can do and how we can help companies exceed their potential.\n\nSo thank you for the time today, and I look forward to speaking again. Thank you.\n\nOperator\n\nLadies and gentlemen, this conference will be available for replay one week starting today at 3:00 p.m. Eastern Time running through September 14, 2022, at midnight. You may access the AT&T Executive playback service by dialing (866) 207-1041 and entering the access code 1548489. International participants may dial (402) 970-0847.\n\nAdditionally, the replay will be available for playback at the company's website, www.kornferry.com, in the Investor Relations section. Thank you for your participation. You may now disconnect.\n\nDuration: 0 minutes\n\nGary Burnison -- Chief Executive Officer\n\nBob Rozek -- Executive Vice President, Chief Financial Officer, and Corporate Officer\n\nGregg Kvochak -- Investor Relations Contact\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nMarc Riddick -- Sidoti and Company -- Analyst\n\nTobey Sommer -- Truist Securities -- Analyst\n\nMore KFY analysis\n\nAll earnings call transcripts"
}