{
  "companyName": "Elbit Systems",
  "companyTicker": "ESLT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/elbit-systems-eslt-q2-2022-earnings-call-transcrip/",
  "content": "Elbit Systems (ESLT 0.17%)\nQ2 2022 Earnings Call\nAug 16, 2022, 9:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to Elbit Systems second quarter 2022 results conference call. [Operator instructions] As a reminder, this conference is being recorded. You should have all received by now the company's press release that is available in the news section of the company's website, www.elbitsystems.com.\n\nI would now like to hand over the call to Rami Myerson, Elbit Systems investor relations director. Rami, please go ahead.\n\nRami Myerson -- Director, Investor Relations\n\nThank you, Joni. Good day, everyone, and welcome to our second quarter 2022 earnings call. On the call with me today are Butzi Machlis, our president and CEO; Kobi Kagan, our CFO; and Yossi Gaspar, senior EVP, business management. Before we begin, I would like to point out that the safe harbor statement in the company's press release issued earlier today also refers to the contents of this conference call.\n\nAs we do every quarter, we will provide you both with our regular GAAP financial data as well as certain supplemental non-GAAP information. We believe that this non-GAAP information provides additional detail to help understand the performance of the ongoing business. You can find all the detailed GAAP financial data as well as the non-GAAP information and the reconciliation in today's press release. Kobi will begin by providing a discussion of the financial results, followed by Butzi, who will talk about some of the significant events during the quarter and beyond.\n\nWe will then turn the call over to a question-and-answer session. With that, I would like to turn the call over to Kobi. Kobi, please?\n\nKobi Kagan -- Chief Financial Officer\n\nThank you, Rami. Hello, everyone, and thank you for joining us today. The second quarter results reflects a pickup in demand with a series of significant contracts award for our solutions in the quarter as our customers start to implement the lessons learned from the Russian invasion of Ukraine. Second quarter revenues were similar to 2021.\n\nThis growth in Europe and Egypt offset the decline in the U.S. Our revenues by geography tend to fluctuate on a quarterly basis based on the specific programs and project performance as well as milestone reached in a particular quarter. We believe the long-term revenue trend supported by the growth in the order backlog are more representative and encouraging in most of Elbit Systems geographical end markets. I will now highlight and discuss some of the key figures and trends in our financial results.\n\nSecond quarter revenues were $1.303 billion, similar to the second quarter of 2021. In terms of the revenue breakdown across our areas of operation, airborne systems accounted for 39% and land system was 21% of total revenues. C4ISR at 30% of revenues increased year over year, mainly due to U.S. to Asia Pacific customers.\n\nElectrooptics accounted for 9% of revenues, increasing year over year mainly due to night vision sales. Other sales accounted for 2% of revenues and declined year over year due to lower medical device sales. The second quarter highlighted importance of our divest geographic revenue base. In the second quarter, Asia Pacific contributed 29% of our revenues; North America, 26%; and Israel and Europe, each 20% of revenues.\n\nAsia Pacific revenues increased mainly due to UAS sales. The growth in European revenues was broad-based and included growth in training and simulation, precision guided munitions and night vision sales. Growth in European and Asia Pacific revenues helped offset lower North American sales. The non-GAAP gross margin for the second quarter was 26.5% compared to the second quarter of 2021 at 26.6%.\n\nGAAP gross margin in the second quarter was 26.1% of revenues compared to 26% in the second quarter of 2021. Second quarter non-GAAP operating income was $103.3 million or 7.9% of revenues compared with $114.9 million or 8.8% of revenues last year. GAAP operating income for the second quarter was $115.1 million versus $117.1 million in the second quarter of 2021. The operating expense breakdown in the second quarter was as follows.\n\nNet R&D expenses were 7.5% of revenues versus 7.3% in 2021. The recent conflict has highlighted the alignment of Elbit Systems product portfolio to the priority areas of our customers, demonstrating the return on our historic investments in research and development. The current investments in R&D will help upgrade existing and developed new products and solutions and ensure that we continue to supply a range of market-leading solutions for our customers in the future. Marketing and selling expenses increased to 6.4% of revenues from 5.8% last year.\n\nWe continue to invest in sales and marketing to take advantage of the positive inflection in global defense budgets and the new opportunities this creates. G&A expenses were 5.6% of revenues compared to 5.1% last year. Other operating income of $27.2 million included capital gain related to the sale of our subsidiary Ashot Ashkelon industry in the second quarter and the sale of a building in Israel. I will note the significant increase in the share price since the beginning of the third quarter.\n\nWe would expect a significant impact in compensation expenses related to our stock price linked compensation plans to employees if the shares remain at current levels or increase further. As we discussed at our first quarter results, we believe these plans help align employee compensation with share price performance incentivizing our employees to generate long-term value for all of Elbit Systems stakeholders. Financial expenses were $9.3 million in the second quarter compared to $7.1 million in 2021. Other expenses of $12.1 million includes a $10.6 million nonrecurring pension adjustment expense related to the sale of -- we recorded a tax expense of $12.8 million in the second quarter compared to $20.1 million in 2021.\n\nThe effective tax rate in the second quarter was 13.6% compared to 18.5% in 2021. Our non-GAAP diluted EPS was $1.73 in the second quarter compared with $2.11 last year. The GAAP diluted EPS was $1.82 compared with $2.30 last year. Our backlog of orders as of 30th of June 2022 was $14.1 billion, approximately $0.5 billion higher than the backlog at the end of June 2021.\n\nApproximately 52% of the current backlog is scheduled to be performed during '22 and '23, and the rest is scheduled to scheduled for '24 and beyond. Operating cash flow for the second quarter was $169 million outflow compared to a $170 million inflow in the same quarter last year. The cash flow in the quarter includes the payment of $73 million following the company decision to release exempt earnings from approval of privileged enterprises in Israel. The cash outflow also includes an inventory build related to our effort to mitigate supply chain challenges and the timing of receiving payments from various customers.\n\nWe expect to receive these payments over the coming quarters. The Board of Directors declared a dividend of $0.50 per share for the second quarter of '22. I will now turn the call over to Mr. Machlis, Elbit's CEO.\n\nButzi, please go ahead.\n\nButzi Machlis -- President and Chief Executive Officer\n\nThank you, Kobi. Orders in the second quarter reflect good demand for our solutions from customers around the world. A series of significant orders in recent months have validated the alignment between Elbit Systems portfolio and our customers' priority areas of defense spending and the mission-critical requirements. I believe that we are at the beginning of a period of global defense budget growth driven by the escalation in geopolitical tensions.\n\nWe are encouraged by the order intake in the second quarter and have learned from decades of experience, the conversion of defense budget growth to our fees and then into orders and revenues can take time, particularly when militaries are adjusting procurement processes and fort structures for new era. The Abraham Accords have also helped open new markets and new opportunities for strategic partnerships with the nations that are party to this historical agreement. We opened Elbit Systems [Inaudible] at the end of 2021 and announced our first order for DIRCM systems in March 2022. Government and militaries are analyzing the Russian invasion of Ukraine and the evolving conflict to prepare for the next one as they have done in the past with other conflicts.\n\nWe have identified five areas that should benefit from increased defense spending over the coming years. These are platform protection, command and control systems, electronic warfare, unmanned systems and network precision munition. During the second quarter, we announced significant contract for four of these five priority areas from customers in Europe and other parts of the world who are implementing the lesson learned. I would like to provide an overview of these priority areas, starting with platform protection.\n\nThe conflict in Ukraine have demonstrated the vulnerability of platforms across all domains and the critical need to protect both platforms and the occupants. Elbit Systems provides systems and solutions that enable protection of aerial enabled and ground platform from a range of threats. Our telecom systems are installed on more than 25 different type of military and commercial aircraft and have accumulated hundreds of thousands of flight hours protecting them from ground to air missiles. In July, we received an $80 million contract to supply C-MUSIC DIRCM system an airborne EW solution to an Asia Pacific country.\n\nAnd we were selected to supply a J-MUSIC DIRCM system for a Gulfstream G650 of the Netherlands Ministry of Defense. Our platform protection system includes infrared missile warning system, chaff and flare for a range of aircraft. The Iron Fist Active Protection System for armed vehicle an EW system that protect ships and submarines. The second area of priorities spend advanced command and control systems.\n\nThese C2 systems are the critical enabler of combined force and multi-domain operations. Elbit Systems Torch-X C2 solution provides visibility and connectivity to commanders and soldiers utilizing the intelligence collected by a multitude of sensors across the battlefield, identify adverse sites enabling fast decision-making and the ability to convert insight into action. Our C2 systems help shorten multiple sensor-to-shooter loop as well as supporting logistics. In June, we received a $548 million, four-years contract to upgrade the multi-domain combat networked warfare capabilities for the armed forces of an Asia Pacific country.\n\nAs part of this contract, Elbit will provide a range of networking and command and control system as well as software defined radio for air, ground enabled platforms. The third priority area is electronic warfare that provides our armed forces with the capability to utilize the electromagnetic spectrum to protect, attack and exploit the communication intelligence and other enemy activities. Elbit Systems is Israeli MOD brand supplier of EW capabilities for aerial, ground enabled platforms and domains. In recent years, we received a number of prestigious EW contract from the U.S.\n\nand German air forces and the U.K. [Inaudible] In May, we received a $69 million contract to supply electric warfare system to a country in Asia Pacific. And in June, we received -- we were awarded a $70 million contract to supply a ground-based EW and signal intelligence solutions to international customers. The fourth priority area is unmanned systems.\n\nElbit Systems has decades of experience developing and manufacturing a broad portfolio of unmanned air, ground and maritime solution. Elbit also provides the command and control system to connect and operate them as well as a range of advanced payloads. These unmanned solutions can execute a broad range of missions, reducing the risks to forces and increasing their effectiveness. At the Eurosatory in June, we demonstrated Legion-X, a multi-domain autonomous network solution for swarms of unmanned platforms in the air, on land and at sea.\n\nLegion-X enables the command and control of range of unmanned platforms of various size and capabilities in a cohesive swarms helping soldiers perform their missions in complex environments such as open areas. The fifth priority area is network precision munitions that enable armed forces to engage time-sensitive targets with power, precision and minimum collateral damage. Elbit Systems has combined the portfolio of munition acquired with IMI, our legacy precision guidance and network capabilities and the technological -- and the technologies we acquired from [Inaudible] last year to develop a range of precision munition on the [Inaudible] 120-millimeter mortar round to a ramping [Inaudible] range air to ground supersonic missile. In June, we received a $220 million contract, to supply lease out precision guidance kits for airborne munition of an Asia Pacific country.\n\nIn July, the German defense company KMW signed a cooperation agreement with Elbit Systems land and Elbit Systems Deutschland in the area of rocket artillery. We believe this agreement will leverage the leading expertise these companies have in the area of rocket artillery and will enable both companies address the growing potential in the European market for these solutions. These are just five areas of Elbit's broad portfolio. We believe that each one has the potential to generate billions of dollars of revenue over the medium term.\n\nAt the end of June, we closed the sale of our 84.9% stake in a Ashot Ashkelon industry to FIMI Opportunity Funds for USD 84 million. We regularly review our portfolio to ensure that we remain focused on the core areas of our business. As part of this review, we decided to sell Ashot Ashkelon that we acquired with IMI in 2018 and was not considered as core business of Elbit. I would like to take this opportunity to thank the hundreds of Ashot Ashkelon employees for the hard work and dedication and to wish them success in the future.\n\nElbit Systems strategy is to focus on global defense market, and I do not expect this to change. I believe it is important to remain focused on the market and technological -- technology, and to reduce disruption for a market that may appear attractive but often require different skill sets to access [Inaudible]. That said, we continue to explore opportunities to leverage our technology and solution, develop and formulate application in adjacent and new markets. In July, our U.S.\n\nsubsidiary Universal Avionics received USD 33 million order from AerSale for ClearVision, enhanced flight vision systems for Boeing 737NG. As part of this contract, Universal will supply ClearVision EFVS systems featured -- featuring the SkyLens head wearable display and EVS-5000 cameras. The ClearVision system enables commercial pilots to fly in regulated visibility situation in day and night to take off and land faster, saving time and increasing operational effectivity and safety. In August, Opgal our thermal imaging subsidiary and the Sheba Medical Center in Israel signed an MOU to explore opportunities to utilize thermal imaging technology to improve the efficiency effectiveness of surgery and treatment in four key areas: heart surgery, diabetic foot treatment, surgical incision infections and respiratory monitoring.\n\nI'm proud of our engineers that are looking for additional opportunities to utilize Elbit technologies to protect and save lives. And with that, I will be happy to take your questions.\n\nOperator\n\nThank you. [Operator instructions] The first question is from Ellen Page of Jefferies. Please go ahead.\n\nEllen Page -- Jefferies -- Analyst\n\nHi, guys. Thank you for the question. Can we talk about C4ISR has grown double digits for years now in the first half. How do we think about a normalized growth rate in that business? And is there anything chunky in there that might start to anniversary and moderate growth?\n\nRami Myerson -- Director, Investor Relations\n\nEllen, can you please repeat the question? Your line is a little bit disrupted.\n\nEllen Page -- Jefferies -- Analyst\n\nIs that better?\n\nButzi Machlis -- President and Chief Executive Officer\n\nYes. Much better.\n\nEllen Page -- Jefferies -- Analyst\n\nJust at C4ISR, you've posted double-digit growth two years in a row in the second quarter. And just how do we think about a normalized growth rate in that business and the sustainability of this demand?\n\nButzi Machlis -- President and Chief Executive Officer\n\nWe see a growing demand for C4I solution, which includes communication system, networking system, application, UAVs, thermal solutions. These are all included on the C4I. As was mentioned earlier, U.S. and the UAVs and ground unmanned systems, they are all under this definition.\n\nAnd as was mentioned earlier, we see a growing demand for such solutions. We have got experience using unmanned systems in Israel as well as in other markets, and we have delivered them to many customers and with full interoperability to different forces. And we own all the technology enhanced, and we see growing demand for this segment. So I believe that the growth will continue.\n\nEllen Page -- Jefferies -- Analyst\n\nGreat. And just on cash. You mentioned that there's a build of inventory related to supply chain disruptions and timing of collections was an impact in the quarter. But can you just walk through working capital in the back half? And just go over that $76 million cash tax payment again and how it relates to future tax planning?\n\nKobi Kagan -- Chief Financial Officer\n\nThis is Kobi Kagan. Thank you, Ellen, for this question. We had, in the quarter, a onetime payment of $73 million, which is related to the company's decision to release exempt earning from approved and privileged enterprises in Israel. So this is a onetime payment to settle this with the tax authority here in Israel.\n\nThis is, of course, would not affect the second half of the year as this is a onetime expense. We are seeing the cash flow as a full year and not a quarter -- or not on quarterly basis. And so we think that -- and we mentioned that we expect to receive payments in the coming quarters from various customers.\n\nEllen Page -- Jefferies -- Analyst\n\nOK. Thanks. Thanks a lot.\n\nOperator\n\nThe next question is from Pete Skibitski of Alembic Global. Please go ahead.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nHey. Good afternoon, everyone. Yes. Let me start with, I guess, maybe Butzi.\n\nYou had good sequential backlog growth this quarter, Butzi, but I think that didn't include the pretty large intelligence systems contract that you booked in Europe. I think it was $660 million that closed after the quarter. So that was a nice win. And I'm curious because I haven't seen an Intel contract that large booked by Elbit.\n\nAnd so it raises the question, I think. Do you see other opportunities out there to sell a contract of this magnitude to other countries in the Intel area?\n\nButzi Machlis -- President and Chief Executive Officer\n\nThank you for the question. As we all see the company is transforming in a middle of confirmation. And we are getting big contracts, and that's on top of the small and medium-sized contracts we used to get in the past. And we continue to get.\n\nSo this contract includes actually the entire portfolio of the company. And one of the main advantages of Elbit is that we are [Inaudible] we have EW solution, we have radar, we have optic solution, we have networking systems, command and control, UAVs and other platforms and with a lot of AI and data analytic capabilities on an application. So we are quite unique, and we are quite unique having such a wide portfolio. And this portfolio enables us to win mega projects and to adapt the technology to the required needs of [which] customer.\n\nSo the answer is yes. We see more demand for end-to-end solution to mega projects. And we got two very big contracts in the second quarter with the networking digitization program we get in Asia Pacific for $550 million and the $650 million we got in Europe. We see more and more demand for mega projects which is on top of the medium-sized and small projects we continue to get.\n\nAnd the whole company is transforming to perform and to get more contract like this and to perform them accordingly. So we have more production capabilities. We are working in several places, three shifts. And this is in order to meet this demand.\n\nAnd we also -- we just -- if you remember last year, the company was organized in a new way. Actually, we have four main divisions right now in Israel and not five that we used to have, and that in order to prepare ourselves better for these megaprojects which we got and we hope to continue to get. But the answer -- the simple answer is yes. We see more and more demand for combined mega projects, which involve many technologies from the group.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nThat's great. I really appreciate all the color and the context that it's great. If I could now maybe shift the conversation to margins. Could you guys give us an update on where you're at with implementation of the ERP system as well as how construction is coming along on the new IMI facility? Because I think those two initiatives are important to kind of the midterm margin expansion outlook is my recollection.\n\nButzi Machlis -- President and Chief Executive Officer\n\nI will start with IMI activity and then Yossi will continue with ERP. We are progressing according to the plan with IMI to shift the main production facility of IMI from the Central part of the country to the South. We are investing a lot of money in the new infrastructure, which is much more modern, much more efficient to increase yields and productivity, which will enable us to deliver bigger quantities with better quality and lower cost to our customers. So our plan is achieved.\n\nOne, first phase to shift some of the activities to a new facility will happen by the end of this year. The majority of the plan will be concluded around the end of 2024. That's according to the plan.\n\nKobi Kagan -- Chief Financial Officer\n\nIn addition to that, regarding the ERP system, we are on track with that. Actually, we have now about 60% of the organization, implementing the new ERP. And the next major milestone will be by the end of this year, when we will probably reach somewhere in the 80-plus percent, probably 85%. And by mid of next year, we will be -- the whole organization will be operating on that 1-year system.\n\nThe benefit from these activities, we expect them to come toward the second half of next year, start to come toward the second half of next year and definitely much stronger into the beginning of '24.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nLet me ask one more along these lines also with regard to pricing. Because obviously, we're in kind of a global inflationary environment, labor materials. And so I'm wondering, I guess, mainly with the ERP system coming along, do you feel like you're getting the pricing that you need to offset the impact of inflation? Are you getting net pricing gains? Or will that take more time? And strategically, do you feel like you're getting the prices that you need given the value you're providing to clients?\n\nKobi Kagan -- Chief Financial Officer\n\nWell, as you probably know, Pete, prices are defined by the market. And however we have in our contracts, we have linkage to indexes of labor and indexes of material in many of our contracts. So to some extent, we compensate the increase in the cost. I must say we cannot compensate for everything.\n\nWe do see in some of the integrated circuits big changes in the short term, but we expect this to change in the longer term and to return to what we call normal. But looking at our bill of material, what do they -- what is that composed of? I must say that the basic impact is it's not material on the cost. And -- but we are not immune because of these increases in some of the electronic parts that we all see as challenges. So bottom line of all this long discussion is that, yes, we are affected, but it is not material from point of view of impact of profitability and part is compensated by our contracts, which do include indexing to cost of material.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nOK. That's very helpful. That's very helpful. Let me ask one last one and I'll be completely done.\n\nButzi, on the MOU signed with KMW Krauss-Maffei on the rocket artillery, are there -- I imagine Europe has to be getting ready to conduct a lot of sales campaigns. Are there anything near term in Europe along the lines of rocket sales that you expect to book in the second half of 2022 or maybe it won't be until 2023?\n\nButzi Machlis -- President and Chief Executive Officer\n\nPete, the answer is yes, I cannot go into the details, as you can imagine, but the answer is yes. We see it on potential for new orders in Europe for guided rockets.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nRight. Thanks so much, everyone.\n\nButzi Machlis -- President and Chief Executive Officer\n\nThank you, Pete.\n\nOperator\n\nThe next question is from Ella Fried of Bank Leumi. Please go ahead.\n\nElla Fried -- Bank Leumi -- Analyst\n\nHey. Good afternoon. Yeah. Hello.\n\nWell, I have a few follow-up questions. But before if you don't mind, I really would appreciate you repeating the answer to the first question about double-digit growth or something because the line was really distorted and there were some people for the stake of two people, please tell what you told?\n\nButzi Machlis -- President and Chief Executive Officer\n\nYes. So Ella, it's Butzi. Question was with regards to C4I solutions, if we -- if I believe that the growth will continue, the answer was yes. We see a growing demand for C4ISR solutions, which includes UAVs, USVs, UGVs, different sensors, different payloads, different command and control system and thermal solution.\n\nSo there's growing demand for that. We just announced a contract for intelligent solutions which is part of this segment as well. It's a mega project, and we see more -- we see growing demand for this solution -- for this system as a result of the last conflict in Ukraine.\n\nElla Fried -- Bank Leumi -- Analyst\n\nOK. Sorry, another follow-up question. You seem to perform much better in terms of growth than many companies in your peer group. And we don't have till this quarter for everybody.\n\nBut on the annual level, you really have the best results for growth in this and then in, I think, the wider group as well. How do you explain it? What is it that some companies are decreasing and Elbit is really outperforming?\n\nButzi Machlis -- President and Chief Executive Officer\n\nI think the answer to that is our strategy. And our strategy is composed of two main pillars. The first one is a very wide and deep portfolio. There are many companies who have such a portfolio like others which includes the UAVs, electro-optics, simulators, avionics, helmets, communication and EW, electro-optic, lasers, guided munition, UAVs, USVs, UGVs, artillery sensors.\n\nThere aren't many companies that have such a portfolio and invention and everything. So we have a very wide and deep portfolio and which enables us to tailor solutions to specific needs of customers. That's number one. And all of this portfolio is -- most of the portfolio is very mature and is combat proven.\n\nThat's the first pillar. And we continue to grow the portfolio. We just announced a very nice development of new radar system, and we continue to invest in our airborne laser system, which is very advanced and unique. So a very wide portfolio.\n\nThat's the first pillar. The second pillar is our international position, our global footprint. We have dozens of subsidiaries all around the globe, which includes just some -- in the U.S., we have about 4,000 people. We have 600 people in the U.K.\n\nWe have hundreds of people in Germany, hundreds of people in Romania. We have a company in Brazil, in Austria, in Belgium, in India and Australia, in Canada and many more. And many customers prefer to buy locally today. There is a growing demand for defense solutions.\n\nPeople prefer -- companies prefer to buy [Inaudible] solutions, and they prefer to buy locally on their own industries. And we gain right now from previous investments and previous strategy to build local subsidiaries. And we win most of the program via these subsidiaries. It's a combination of growing demand in the market, large portfolio, global footprint.\n\nAll of them together bring us success in the market.\n\nElla Fried -- Bank Leumi -- Analyst\n\nAnd on the other hand, the scope and the versatility of relatively not such a huge company on this ground of the leading companies globally. Does it -- it's a challenge. I think the challenge of profitability is even intensified by this versatility. So are you planning more of creating other sensors like, I mean, you have Israel, you have U.S., you have developing activities in Asia and Europe.\n\nBut are you planning to create a bigger hubs? I don't know because the operation is very costly of all these ground [Inaudible] of versatility.\n\nButzi Machlis -- President and Chief Executive Officer\n\nIt's true that it's costly to maintain such a machine and also to protect the portfolio we have. That's the reason why we invest 7.4% in R&D.\n\nElla Fried -- Bank Leumi -- Analyst\n\nYes, you were leading...\n\nButzi Machlis -- President and Chief Executive Officer\n\nAnd which is, I believe, double the nominal number in this market. And this is to support this portfolio and to bring new innovation and new capabilities to the market. But I must -- I want you to know that although it's a big company with many subsidiaries, the Board, we try not to duplicate capabilities between the different facilities. And some of the activities, some of the IP is coming from Israel.\n\nSome of the capabilities are coming from our subsidiaries. Just to give you an example, in the U.S., we have two main capabilities, which serves the entire group, night vision capability. That's a company we acquired a few years ago in the U.S., night vision. There are central offices for the entire group.\n\nThe same is sonobuoy in the U.S. There are also centers, centers for the entire group. Sonar, we do in Canada, and they serve the entire group for sonars. HF radios, we do in Germany.\n\nThey serve the entire group for HF communication system. And the same is true also for production capabilities. We have center of excellence for different production capabilities, which enable us to leverage talent and the facilities we have all around the globe. And that's number one.\n\nNumber two, we reorganized the way we are working with our subsidiaries to make sure that we get maximum efficiency and we gain maximum on the positions we have in the different markets. And that's part of the responsibility of Mr. Gaspar, who you know very good.\n\nYossi Gaspar -- Senior Executive Vice President, Business Management\n\nI would like to add one more aspect. If you recall, in the past, we were emphasizing our international spread that actually helps us in reducing the risk in the business. And we are almost, I would say, immune to changes in various geographies of the defense budgets. While one is declining, the other is growing and so on.\n\nSo the basic risk in the business is low. I think that what we are seeing in recent quarters is exactly that. That means that when you -- your basic question was how come that you are growing and the others did not or not as much. And I think what we see now is exactly the fundamental of the strategy that use explained before of having a widespread business, both geographically and product wise.\n\nElla Fried -- Bank Leumi -- Analyst\n\nOK. I have a few more questions. One is a game in the same direction. You had -- you mentioned on the previous call that this second quarter is going to be the first quarter to show actually the impact of Ukraine war.\n\nAnd we saw it not as much as always expected, but the company that performs project. So we expect to see it in the following quarters. But the question is, do -- will we have more impact of this interest that you told us about in the previous quarter?\n\nButzi Machlis -- President and Chief Executive Officer\n\nTalking about all the new business we got. For example, one -- that -- as was mentioned, we got a $660 million contract for Intelligence Solutions in Europe. That's one example of the impact of the conflict in Ukraine. So the first phase of the impact is getting business.\n\nThen it takes some time until it goes down to the revenue level and to the profit level.\n\nElla Fried -- Bank Leumi -- Analyst\n\nBut most of it -- I'm sorry. Most of it is not in the backlog yet, right? Or is it?\n\nButzi Machlis -- President and Chief Executive Officer\n\nPart of it is in the backlog. The $660 million contract we got is in the backlog. But you're right, there are many opportunities. We see the result of Russian invention to Ukraine.\n\nBut -- and so we see a lot more potential in Europe and in other countries because of that. But we see also a growing demand not just in Europe. There is also growing demand in other parts of the world. The Abraham Accord have opened a new horizon to Elbit against a different threat.\n\nAnd as we've mentioned, we have opened a company in the UAE, and we got already some business there. There is a lot of potential for us in our region. And the conflict between the Western World and China is still there. We all saw what happened in Taiwan just a few weeks ago.\n\nSo there is a growing demand in the U.S. and in Europe, also against -- and of course, in Asia Pacific, also against the Chinese, right? So there are three main threats which are here -- which exists. And all of them create different demand, different requirements for our portfolio, which is very relevant to meet this requirement. So it's not just Russia.\n\nIt's Europe, it's our region and it's also Asia Pacific. In all these areas, the extension, there is growing demand for our portfolio. That's the reason for strong backlog we have. And I see growing opportunities and more opportunities for our company in the near-term future as well as in the long term future.\n\nElla Fried -- Bank Leumi -- Analyst\n\nI have one more technical question. You mentioned in the press release that the stock price linked plan will lay effective the next quarter as well. And about the scale of this impact, is it going to be more like the first quarter? Or is it going to be -- I mean relating to the present stock price, as I understand the stock price is not the only company than this formula.\n\nKobi Kagan\n\nWell, Ella, you know what we explained in the first quarter. And you have seen the increase in the stock price and the effect to our results. We don't know yet how we would end this quarter. And there is a formula that we are using according to the plan that we have with our employees, how to calculate the impact.\n\nSo you can make some general deductions out of that. And you can see the rate of growth in the first quarter, how it went and then compare it to what's happening in the second quarter. And that will be a very rough estimate of what will happen. We don't know -- we cannot give you guidance now.\n\nBut bottom line, we really believe the stock goes up.\n\nOperator\n\nThere are no further questions at this time. Before I ask Mr. Machlis to go ahead with his closing statement, I would like to remind participants that a replay of this call will be available two hours after the conference ends. In the U.S., please call 1 (888) 782-4291.\n\nIn Israel, please call (03) 925-5900. And internationally, please call 972-3-925-5900. A replay of the call will be also available at the company's website, www.elbitsystems.com. Mr.\n\nMachlis, would you like to make your concluding statement?\n\nButzi Machlis -- President and Chief Executive Officer\n\nI would like to thank all our employees for their continued hard work and contribution to Elbit Systems success. To everyone on the call, thank you for joining us today and for your continued support and interest in our company. Have a good day, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRami Myerson -- Director, Investor Relations\n\nKobi Kagan -- Chief Financial Officer\n\nButzi Machlis -- President and Chief Executive Officer\n\nEllen Page -- Jefferies -- Analyst\n\nPete Skibitski -- Alembic Global -- Analyst\n\nElla Fried -- Bank Leumi -- Analyst\n\nYossi Gaspar -- Senior Executive Vice President, Business Management\n\nYaacov Kagan\n\nMore ESLT analysis\n\nAll earnings call transcripts"
}