{
  "companyName": "American Express",
  "companyTicker": "AXP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/21/american-express-axp-q3-2022-earnings-call-transcr/",
  "content": "American Express (AXP 0.29%)\nQ3 2022 Earnings Call\nOct 21, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to the American Express Q3 2022 earnings call. [Operator instructions] I would now like to turn the conference over to our host, head of investor relations, Ms. Kerri Bernstein.\n\nPlease go ahead.\n\nKerri Bernstein -- Head of Investor Relations\n\nThank you, Daryl. And thank you, all, for joining today's call. As a reminder, before we begin, today's discussion contains forward-looking statements about the company's future business financial performance. These are based on management's current expectations and are subject to risks and uncertainties.\n\nFactors that could cause actual results to differ materially from these statements are included in today's presentation slides and in our reports filed with the SEC. The discussion today also contains non-GAAP financial measures. The comparable GAAP financial measures are included in this quarter's earnings materials, as well as the earnings materials for the prior periods we discuss. All of these are posted on our website at ir.americanexpress.com.\n\nWe will begin today with Steve Squeri, chairman and CEO, who will start with some remarks about the company's progress and results. And then Jeff Campbell, chief financial officer, will provide a more detailed review of our financial performance. After that, we'll move to a Q&A session on the results with both Steve and Jeff. With that, let me turn it over to Steve.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nThanks, Kerri. And good morning, everyone. Thank you for joining us for our third quarter earnings call. As you saw in our release this morning, we had another strong quarter.\n\nRevenues grew 27% on an FX-adjusted basis, and earnings per share was $2.47, up 9% over the last year. Our investments to drive customer engagement, acquisitions, and retention once again generated great results, and our credit quality remained strong. Card member spending remained at near-record levels in the quarter. Billed business was up 24% on an FX-adjusted basis over the record growth we delivered a year earlier, led by the continued strength in goods and services spending and the ongoing strong rebound in travel and entertainment.\n\nAs we said earlier this year, we expected the recovery in travel spending to be a tailwind for us. But the strength of the rebound has exceeded our expectations throughout the year. In the quarter, total T&E spending was up 57% from a year earlier on an FX-adjusted basis, driven by the continued strong demand from consumers and small business customers. Particularly noteworthy is the strength we're seeing in T&E spending in our international markets, which exceeded pre-pandemic levels for the first time this quarter on FX-adjusted basis.\n\nBusiness travel also continued to recover, and overall activity remained strong through September. Importantly, we're seeing increased customer engagement with the wide range of travel and dining benefits and services we offer as part of our membership model. For example, bookings through our consumer travel business reached their highest level since before the pandemic in the third quarter. And in dining, our Resy reservation platform continues to see strong growth.\n\nSince we acquired the platform in 2019, Resy uses have tripled to reach 35 million, and we quadrupled the number of restaurants available around the world on Resy. Goods and services spending grew 16% year over year. The continued growth in goods and services is supported by the structural shift to online commerce that was accelerated by the pandemic and has been sustained since then, the new online and mobile-oriented benefits we added to our value propositions. These benefits are particularly attractive to our millennial and Gen Z customer base, which is our fastest growing customer cohort.\n\nThe investments we've made in our value propositions also continue to drive momentum in new card acquisitions. We added 3.3 million new proprietary cards during the quarter, our highest quarterly level of acquisitions since the pandemic began. And we continue to see strong uptake of our premium fee-based products with acquisitions of U.S. Consumer Platinum and Gold Cards, as well as U.S.\n\nBusiness Platinum Cards reaching record quarterly highs. Millennial and Gen Z customers are powering this growth, comprising more than 60% of our proprietary consumer card acquisitions in the quarter. As we sit here today, we see no changes in the spending behaviors of our customers. And our credit metrics continue to be strong with delinquencies and write-offs remaining at low levels, even as loan balances are steadily rebuilding.\n\nOf course, we are thankful of the mixed signals in the broader economy. As always, we have plans in place to pivot should the operating environment change dramatically. And we've been taking thoughtful risk management actions to be prepared in the event of a downturn. But as I've emphasized many times before, we run the company for the long term and make through the cycle investment decisions.\n\nOur strong third quarter results show that our strategy investing in our brands, value propositions, customers, colleagues, technology, and coverage continues to pay off, and our performance is consistent with our long-term growth aspirations. Looking ahead, we continue to see many great growth opportunities, and we will continue to take actions to best position our business for the long term. As you'll recall, our international businesses were among the fastest growing prior to the pandemic, as more countries relaxed their cross-border travel policies and life returns to normal. We see tremendous opportunities for growth in key regions despite ongoing macroeconomic geopolitical uncertainties.\n\nTo that point, we made an organizational change a few months ago to help seize on these opportunities. We brought together our international consumer, small business, and large corporate management teams under one leader, which will increase our speed, agility, scale, and efficiency in our operations outside the U.S. As a result, you'll see this quarter, we've introduced a new international card services reporting segment. Looking ahead, we remain confident that the successful execution of our strategy, driven by our outstanding leadership team and the talented colleagues throughout the company, positions us well as we seek to achieve our long-term growth plan aspirations of revenue growth in excess of 10% and mid-teens EPS growth in 2024 and beyond.\n\nBased on our performance through the third quarter, we also remain confident in our full year revenue growth guidance of 23% to 25%, and we expect to be above our original full year EPS guidance range of 9.25 to 9.65. With that, I'll turn it over to Jeff to provide a detailed overview of our Q3 results.\n\nJeff Campbell -- Chief Financial Officer\n\nWell, thank you, Steve, and good morning, everyone. Good to be here to talk about our third quarter results, which reflect another strong quarter and great progress against our multiyear growth plan. Starting with our summary financials on Slide 2. Most importantly, our third quarter revenues were $13.6 billion, reaching a record high for the second quarter in a row of 27% on an FX-adjusted basis.\n\nNow, I would point out that we continue to see a much stronger U.S. dollar relative to most of the major currencies in which we operate. So, you do see a 300 basis point spread between our FX-adjusted revenue growth of 27% and our reported revenue growth of 24%, as we absorb some significant foreign exchange headwinds. Of course, the overall impact on our earnings, still a headwind, is less significant because we do have some offsetting positive impacts on the expense side.\n\nOur revenue performance in the third quarter drove reported net income of $1.9 billion and earnings per share of $2.47, representing EPS growth of 9% year over year, a great result considering the sizable credit reserve releases we had in the third quarter last year. Because of these prior-year reserve releases, we have also included tax provision income as a supplemental disclosure again this quarter. On this basis, pre-tax provision income was $3.2 billion, up 43% versus the same time period last year, reflecting the growth momentum in our underlying earnings. Before getting into a more detailed look at results, let me spend just a minute briefly explaining how we've evolved our financial reporting for the organizational changes that Steve discussed earlier.\n\nYou will see in the disclosures that the earnings release at the beginning of this quarter, we have moved from three to four reportable operating segments. We first took global consumer services and split the U.S. into its own segment, creating U.S. consumer services.\n\nWe then combined the international consumer business with the international portion of small- and medium-sized enterprises and large corporate, creating the new international card services segment; commercial services that include U.S. SME, U.S. large corporate, and select global corporate clients; and lastly, our global merchant and network services segment remains largely unchanged and, as always, includes our global payments network and network partnerships. You will see in the appendix of our disclosures that we have recast prior periods to conform to these new operating segments.\n\nThe new segments will also be reflected in our third quarter Form 10-Q. Now, let's get into our results, beginning with overall volumes. Looking at Slides 3 and 4, you can see the continued strength in our card member spending behavior that Steve noted earlier. Total network volumes and billed business were each up year over year at 23% and 24%, respectively, on an FX-adjusted basis in the third quarter.\n\nIf you were to compare to 2019, third quarter billed business grew 30%, accelerating above last quarter's growth rate of 28% relative to 2019. And importantly, despite the uncertainties in the current economic environment, our spending trends with performance relative to 2019 strengthened as we went through the quarter. We are really pleased with this growth and the fact you see strong growth across all customer types and geographies, driven by both sustained growth in goods and services spending and continued T&E momentum. On Slide 5 through 8, we've given you a variety of views of this strong growth across our U.S.\n\nconsumer services, commercial services, and international card services segments, and the various customer types within each. Starting with our largest segment, billings from our U.S. consumer customers grew 22% in the third quarter, reflecting the continued strength and spending trends from our premium U.S. consumers.\n\nMillennial and Gen Z customers again drove our highest billed business growth within the segment, with their spending growing 39% year over year this quarter. Turning to commercial services, you see that spending from our U.S. SME customers represents the majority of our billings in the segment and that spending from these customers continued its strong growth, up 17% in the third quarter. Our U.S.\n\nlarge and global corporate customers, though were smaller part of billings in the segment, remained an important foundation for the entire company. And these customers continued their steady travel recovery this quarter. So, overall, both billings are still 13% below pre-pandemic levels. We do continue to expect, though, that this group will fully recover over time.\n\nAnd lastly, international consumer and international SME large corporate customers within the new international card services segment were among our fastest growing pre-pandemic, as Steve said, and are now in a steep recovery mode. You can see our high levels of growth in Q3 at 34% and 43% year over year, respectively. And if you were also to look at international consumer growth by age cohort, you would see, similar to the U.S., that the highest growth levels are from our millennial and Gen Z customers who make up an even larger portion of overall billings than they do in the U.S. One other note on overall billings, the majority of our high level of growth this quarter was again driven by the number of transactions flowing through our network with some modest impact from inflation.\n\nOverall then, we are pleased with the momentum we see across the board in our spending volumes, which is tracking in line with our expectations for both the year and for our long-term aspirations. Now, moving to loan balances on Slide 9, we saw year-over-year growth accelerate to 31% in our loan balances, as well as good sequential growth. The interest-bearing portion of our loan balances also continues to consistently increase quarter over quarter, surpassing 2019 levels in the third quarter as customers steadily rebuild balances. As you then turn the credit and provisions on Slide 10 through 12, the high credit quality of our customer base continues to show through in our strong credit performance.\n\nWrite-off rates for card member loans remain well below pre-pandemic levels, flat to where they have been for the last few quarters as you can see on Slide 10. As expected, you do now see that delinquency rates for loans have started to modestly tick up but also remain well below pre-pandemic levels. Turning now to the accounting for this credit performance on Slide 11. As you know, there are two component components to our provision expense: our actual write-off performance in the quarter, which, as we just discussed, remained strong; second, changes in our credit reserves, where there are a few key drivers.\n\nOur loan balances, especially our revolving loan balances, grew strongly quarter over quarter. And the macroeconomic outlook that we flowed through our models, which was informed by third-party macroeconomic forecast, as well as the latest Fed outlook, was slightly worse this quarter relative to last quarter. The combination of our strong loan growth -- excuse me, in the updated macroeconomic assumptions resulted in a $387 million reserve build. This reserve build, combined with low net write-offs, drove $778 million in provision expense for the third quarter.\n\nAs you see on Slide 12, we ended the third quarter with $3.5 billion of reserves, with reserves for loans representing 3.2% of our balances. I would point out, even with this quarter's reserve build, this remains well below the reserve levels we had pre-pandemic, driven by our improved portfolio quality today compared to that prior time period. Going forward, we continue to expect delinquency and loss rates to move up slowly over time but to remain below pre-pandemic levels this year. I do expect to end the year with a higher level of reserves on our balance sheet than where we ended this quarter, given our expected loan growth.\n\nThe overall level of reserve adjustments will again be influenced by how the macroeconomic outlook evolves in the fourth quarter. Moving next to revenue on Slide 13. Total revenues were up 24% year over year in the third quarter or 27% on an FX-adjusted basis. Before I get into more details about our largest revenue drivers in the next few slides, I would note that service fees and other revenue was up 39% year over year.\n\nSimilar to last quarter, this strong growth was largely driven by our recovery in travel-related revenues. Our last revenue line, discount revenue, grew 26% year over year in Q3 on an FX-adjusted basis, as you can see on Slide 14, driven by both our sustained growth in goods and services spending and the continued momentum in our T&E spending that you saw in our spending trends. Net card fee revenues were up 23% year over year in the third quarter on an FX-adjusted basis, with growth continuing to accelerate as you can see on Slide 15, largely driven by the continued attractiveness to both prospects and existing customers of our fee-paying products through the investments we've made in our premium value propositions. This quarter, we acquired 3.3 million new cards with acquisitions of U.S.\n\nConsumer Platinum and Gold Card members and U.S. Business Platinum Card members all reaching record highs in the quarter and now each more than two times higher than pre-pandemic levels, demonstrating the great demand we're seeing, especially for our premium fee-based products. Moving on to Slide 16, you can see that net interest income was up 30% year over year on an FX-adjusted basis due to the recovery of our revolving loan balances. While, generally speaking, a rising rate environment would be a modest headwind for us due to our sizable noninterest bearing charge balances, in actual fact, it has been fairly neutral in terms of impact for us year to date.\n\nOver time, though, I would expect rising rate to represent a modest headwind. To sum up on revenues, we're seeing strong results across the board and really good momentum. When looking at Slide 17, I would point out that we have now seen six consecutive quarters of revenue growth above 24% on an FX-adjusted basis, as we are now showing strong growth even on top of the strong recovery led growth in the prior-year quarter. I would also point out that we have a couple hundred basis points of difference when looking at revenue growth on an FX-adjusted basis versus our reported results.\n\nSo, while we are leaving our full year reported revenue guidance at 23% to 25% for 2022, I would expect to be above that growth rate range on an FX-adjusted basis. Now, all this revenue momentum we just discussed has been driven by the investments we've made in our brand, value propositions, customers, colleagues, technology, and coverage. And those investments show up across the expense line you see on Slide 18. Starting with variable customer engagement costs, these costs, as you see on Slide 18, came in at 41% of total revenues for the third quarter, roughly in line with what I still expect variable customer engagement cost to run for the full year at around 42% total revenues.\n\nOn the marketing line, we invested $1.5 billion in the third quarter, on track with our expectation to spend over $5 billion in 2022. We feel really good about the strong demand in card acquisitions, especially premium card acquisitions, as we showed on Slide 15. And more importantly, we feel good about the spend, credit, and revenue profiles of the customers we are bringing into American Express membership, which continue to look strong relative to what we saw pre-pandemic. Moving to the bottom of Slide 18 brings us to operating expenses, which were $3.3 billion in the third quarter, essentially flat to last quarter.\n\nAs Steve and I have discussed all year, these results reflect the impact inflation has had on our operating expenses, in addition to our investments in other key growth underpinnings to support our tremendous revenue growth. You can see, based off our third quarter results, that we are tracking with our expectation for operating expenses to be around $13 billion for the full year. In looking at the year-over-year opex growth of 22% this quarter, it is also important to note that we see an impact from the prior year, including a sizable benefit from net mark-to-market gains and our AMEX Ventures strategic investment portfolio, while, this year, we saw a modest impairment charge. More generally, we continue to see operating expenses as a key source of leverage moving forward, and we expect to have far less growth in opex than revenues in our ambitious growth plan.\n\nTurning next to capital on Slide 19, we returned $1 billion of capital to our shareholders in the third quarter, including common stock repurchases of 600 million, and 391 million in common stock dividends on the back of strong earnings generation. Our CET1 ratio was 10.6% at the end of the third quarter, within our target range of 10% to 11%. We plan to continue to return to shareholders the excess capital we generate while supporting our balance sheet growth. That then brings me to our growth plan and 2022 guidance on Slide 20.\n\nWith each quarter of this year, we have demonstrated consistent progress against our 2022 guidance and our long-term growth aspirations of delivering sustainable high levels of revenue and EPS growth. For the full year 2022, we are reaffirming our reported revenue growth guidance of 23% to 25%, although I would point out, as I said earlier, that I would expect our FX-adjusted revenue growth to be above that range. And we now expect to be above our original EPS guidance range of $9.25 to $9.65. An uncertainty in the level of our final EPS for the year remains the possible impact on credit reserves and how the macroeconomic outlook evolves in the fourth quarter.\n\nWhile I expect our actual credit performance metrics to remain healthy, it's harder to predict exactly how the macroeconomic outlook might evolve. In addition, we are working toward our 2023 plan and expect revenue to remain above our long-term aspirational targets, which should create a platform for producing strong EPS growth. Of course, we'll have to see how the economic environment evolves versus where we are today. In any environment, though, we remain committed to executing against our growth plan and running the company with a focus on achieving our aspiration of delivering revenue growth in excess of 10% and mid-teens EPS growth on a sustainable basis in 2024 and beyond.\n\nAnd with that, I'll turn the call back over to Kerri to open up the call for your questions.\n\nKerri Bernstein -- Head of Investor Relations\n\nThank you, Jeff. Before we open up the lines for Q&A, I will ask those in the queue to please limit yourself to just one question. Thank you for your cooperation. And with that, the operator will now open up the line for questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Ryan Nash with Goldman Sachs. Please proceed with your question.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nHey, good morning, guys.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nGood morning, Ryan.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nSo, maybe just start on the top line, Steve. You know, solid results once again, although clearly, as you and Jeff articulated, FX was a headwind in the quarter. And I know you mentioned you're not seeing any changes. Jeff mentioned the strength over the quarter.\n\nCan you maybe just talk about, you know, what you're seeing from a spend perspective, maybe relative to what you saw 90 days ago? Any changes under the surface? And then, maybe just flesh out a little bit further your confidence in the ability to generate, you know, mid-teens, you know, top and bottom line growth into 2023. Thank you.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nWe're confident. Look, the spending speaks for itself. I mean, just look at some of these numbers. You've got goods and services up 16%.\n\nOur U.S. consumer is up 22%. Millennial spending is up 39%. You know, our T&E spending is up 57%.\n\nInternational spending is 37%. We haven't seen any change. And you can look at this quarter over quarter. And, you know, the reality is that, you know, last quarter was a record-level quarter in terms of spending.\n\nAnd this is like, I don't know, $1 billion behind or something like that. But if you look at year-over-year growth, we're not seeing any changes in consumer spending behavior at all. And look, that's not to say that things may not change, but I can only look at what I'm seeing right now. And if I look from a forward perspective, you know, the question that we get is, you know, what about T&E, can T&E spending hold so forth and so on? And look, I think you heard Ed Bastian last week, and he talked about, you know, not only what's been going on at Delta but what they see going on through the holiday season.\n\nYou know, I think you've heard Chris Nassetta as well say the same kinds of things and what's happening with Hilton, and the -- two of our biggest partners. And so, you know, when we look at our consumer travel booking, we see, you know, higher bookings than we've seen in a long, long time. I mean that goes pre-pandemic. So, if I look three out, because the next question that people ask is, what does the holiday season look like? Well, the holiday season, from a travel perspective, looks really, really strong, because people are booking three months out.\n\nAnd if you're going to be traveling, you're probably going to be going to restaurants. And if you're traveling in some place, you're probably bringing presents with you as well. So, you know, we don't see anything really changing over the next three months. And, you know, as we go into next year, we still feel really good about, you know, what our growth plan is.\n\nAnd, you know, the only thing I would say is, because I think I need to say this, is that if things change, we will be prepared to pivot. And I think people saw that during the pandemic. We've got our recession playbook, you know, you have a credit cycle playbook, and we'll pull that playbook lever if we need to pull it. But to pull it at this particular point in time doesn't make any sense.\n\nWe're seeing strong growth, and we're seeing strong credit results overall. So, right now, nothing new. And the way I would headline this is that, you know, this quarter looks like the first quarter which looked like the second quarter. And it's the third quarter.\n\nIt's another strong quarter for us. And the only thing that I would say is, you know, I mean, when you look at our model, I think, not only this quarter but this year, it really shows the strength of our differentiated business model. We have a different model than other people out there in the market. And I think that's coming through in our statistics.\n\nYear-over-year earnings growth and, you know, the top-line revenue growth is, you know, not something you're used to seeing from us, unless you've been looking at the last six quarters.\n\nJeff Campbell -- Chief Financial Officer\n\nAnd, Ryan, let me just add maybe a few other comments to try to dimension. When Steve and I used a term like, well, we know how to pivot if we need to, you know, I would remind everyone that GDP in the U.S. shrank in the first two quarters of this year. And we've been putting up revenue growth in the 24% to 30% range steadily right through that.\n\nI'd remind you that I talked about our credit reserve is influenced by macroeconomic forecast. And so, you can go look at what the Fed said in September. You can go look at what Moody's is saying. And they are predicting modest upticks in unemployment.\n\nAnd that's contemplated in everything Steve and I have said and in the guidance that we've provided. If you look at October, October is just a continuation of all that Steve just talked about thus far. So, you know, we feel good about the guidance we've given. We are acknowledging the environment we're in.\n\nBut I don't want people to overplay our reaction to the fact that growth has been pretty slow in the U.S. because we are, with our differentiated business model as Steve just pointed out, performing very strongly in this environment.\n\nOperator\n\nThank you. Our next question comes from the line of Sanjay Sakhrani with KBW. Please proceed with your question.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nThanks, good morning.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nGood morning, Sanjay.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nI guess I want to follow up on that question. Steve, you talked about the recession playbook. Maybe if we could just talk about, you know, your comments about operating the business for the long term. And if we were to see a slowdown, how we should think about managing expenses? Marketing has been boosted quite a bit.\n\nYou wouldn't want to grow as fast as you are right now in the backdrop. So, maybe you can just talk about the flex there, how we should think about the aspirational targets in the backdrop of a recession or, you know, a mild one even. And then, Jeff, could you just hit the reserve rate? I know people tend to think about that reserve rate as a result -- as it relates to CECL day one. Do you see yourself getting back to that level, given how low losses are right now? Thanks.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nSo, if you think about operating, you know, sort of in a recession operating in the playbook, I think the first thing you have to realize is that, you know, when you look at sort of credit and you look at how you acquire customers and how you underwrite customers, those are things that we do on an ongoing basis, right? And so, we've been -- we make adjustments, you know, daily, weekly. I mean the models are constantly being updated and changing, and our return thresholds are changing. And so, you know, as we say, we manage through the cycle. When we look at our card members, we manage that so that coming through that, there is profitability.\n\nOK? And so, we will continue to do that. And I'll point you back to the pandemic and what we did during the pandemic because I think that's a really good -- it's a really good model for us. So, what did we do? Well, we pulled back on your card member acquisition because, number one, we didn't have enough transparency at that particular point in time. And number two, maybe we weren't feeling good about, you know, sort of, you know, the card members that we could acquire at that point.\n\nBut we never shut it down. We still acquired Card Members. So, you would see that. The only thing I would point out is, you know, we've been trending from a marketing perspective to spend well in excess of $5 billion.\n\nIf you go back pre-pandemic, you know, that number was between $3.5 billion and $3.9 billion. And so, it gives us a lot of flexibility in terms of delevering our marketing expenditure. The other thing you have to realize is that a lot of our cost of card member services are variable in terms of spending. And so, they -- and rewards as well go up and they go down as spending increases.\n\nAnd so, I have a lot of confidence in our ability to flex our marketing numbers down. I have tremendous confidence in our ability to flex our operating expenses because operating expenses, in a lot of ways, go along with a lot of our volumes. So -- and we've proven we can do that. And, you know, I think our underwriting on -- you know, you would continue to tighten that up, but that's something that we look at on an ongoing basis.\n\nThat's not something that you sort of just sort of end up when you get into it. You're tightening that up as you go along and as you see at any signals. And then the last thing I would say is you get into credit and collections and your ability to help our card members in a thoughtful way and your ability to collect money. And I think that, you know, a lot of the programs that we introduced, you know, during the pandemic with programs that we would be taking off the playbook.\n\nAnd the last point I would say is, you know, our card base is not representative of the U.S. economy. You know, we -- when you look at the share of card that we have in this marketplace and our number of card members, it's obviously, you know, well below double digits. And they're not necessarily representative of what's going on in the broader economy.\n\nAnd the last point that I would make is a lot of people trying to equate what's going on with the stock market and going on in spending. There is no correlation in our history of that. The thing that you do worry about is unemployment and, in particular, white collar unemployment. And so, as we think about, you know, professionals that could potentially be laid off, you know, that's something that you look at.\n\nBut again, our models take all that into account. And, you know, we've been through this -- we've been through that kind of stuff before, and I think we're very well prepared for it.\n\nJeff Campbell -- Chief Financial Officer\n\nSo, before I get to credit reserve, Sanjay, I can't resist just adding, though. You said, well, what would you do in a mild recession? I don't want to get into the cool debate here about semantics, but some could argue that, from a growth perspective, we're in a mild recession, and we just grew revenues 27%. And to turn it to our credit reserves, our credit reserve adjustments do include the latest economic forecast, which has unemployment ticking up a little bit next year, and that's included in all of our forward-looking comments. As you point out and maybe to help everyone, Sanjay, I think it's on Slide 12 in our deck today, our day one credit reserve percentages of total loans were 4.6%.\n\nThis quarter, they were all the way down at 3.2%. I will point out that if you look across the industry, that is by far the lowest percentage. It's also the lowest percentage relative to day one. You know, there's differential timing that all the different financial institutions have had over the last couple of years just due to the vagaries of the way the accounting works here.\n\nBut as you sit here today, our reserve balance, both on an absolute basis and relative to that day one basis, is below the industry. And that makes sense, Sanjay, because we have, by far, the most premium book in the industry. We have, by far, the strongest credit metrics. And relative to pre-pandemic in that day one number, our credit profile is stronger today.\n\nAll the talk you hear from Steve and I and Doug and others about our record success bringing more premium consumers into the franchise over the last couple of years has an impact on credit profile as well. So, all else being equal, you would not expect our reserve percentage of loans to get back to where it was day one CECL because the average credit profile is stronger than it was day one CECL.\n\nOperator\n\nThank you. Our next question comes from the line of Mark DeVries with Barclays. Please proceed with your question.\n\nMark DeVries -- Barclays -- Analyst\n\nThanks. Could you discuss what's driving, you know, the accelerating new account growth off of already higher numbers and, you know, how sustainable you view account growth anywhere near these levels to be? Any color you can provide on the ramp in spend you would normally observe from new accounts as they age? And then, finally, did you see a surge in new account applications from Gen Z around your Jack Harlow concert?\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nI can't comment on the Jack Harlow concert. Not that I can't comment on it, I'm not aware of the surge and account acquisition. I'm sure it didn't hurt us. You know, look, I think that what you've seen here is we're not going out and just trying to grab lots and lots of cards.\n\nI mean, you know, we're out there grabbing high-value cards. And, you know, the value proposition is obviously strong. And the value propositions are really playing well with millennial and Gen Z. It's 60% of our card acquisition.\n\nAnd, well, I don't have the numbers handy with me in terms of how the, you know, ramping goes in year one spending here, but what I would point out is, you know, we're acquiring -- you know, 60% of the cards that we're acquiring are millennial and Gen Z. And that cohort was up 39%, you know, this quarter. So, you know, I think this whole concept of generational relevance in bringing people into the franchise early and bringing them in on a premium product that they can really embed their lives into has really helped us out tremendously as opposed to bringing them in on a fee-free product and then trying to upgrade them along. I think, you know, a lot of millennials and Gen Zs are using this product.\n\nAnd again, as we've always said, we are just a payment product. I mean, we view ourselves as a lifestyle brand and as a lifestyle product. And the Jack Harlow concert, you know, is a good example of kind of the things that we do to embed ourselves in people's lives. And we talked about Resy, and we talked about, you know, travel.\n\nAnd, you know, those services and those bookings are going up. And, you know, people are using that. And so, it's just more than just the payment product. So, again, Mark, I don't have the sort of, you know, first-year ramp-up spending, but, you know, 39% is a pretty good indication.\n\nAs far as, you know, we're going to acquire 3.3 million cards next quarter, I don't really have any idea. I mean we'll acquire those cards that as we underwrite them, they make sense for us to go. They will be profitable through the cycle. Could that be 3.3? Yeah, it could be 3.3, it could be 2.9, it could be 3.5.\n\nWe don't -- we're not in card acquisition targets. What we're looking at is acquiring those card members that meet our criteria. And it just so happened that it was 3.3 this particular quarter.\n\nJeff Campbell -- Chief Financial Officer\n\nSo, the only two comments I would add, Mark, are among the modest risk management adjustments we've made across the course of this year, as we have significantly actually raised our financial hurdles required for some of the new card members that we're bringing in and still just brought in a record level, which tells you something about the level of demand that we see right now through all of the trades that Steve just talked about. I'd also point out, as I said in my earlier remarks, that the average customer, whose behavior we track every single month, is coming in with much higher spend patterns, much better average credit quality, and a much greater average fee component than what we were seeing pre-pandemic.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nYou know, so, it's harder to qualify to get a card. We're getting more. I mean, just to cut to the chase.\n\nOperator\n\nThank you. Our next question comes from the line of Betsy Graseck with Morgan Stanley. Please proceed with your question.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nHi, good morning. Thanks so much for the time.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nHi, Betsy.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nHi. I just wanted to understand a little bit about, you know, how you thought the FX impacted yourself in the quarter. I mean you can see a variety of ways that you present, but just want to understand from your perspective, what the -- what the impact was on the revs and on the expense side, in particular, the reward side? And then give us a sense as to how you think about the revenue guidance range, if it was FX adjusted, you know, for the year and for what you're expecting in the fourth quarter. Thanks.\n\nJeff Campbell -- Chief Financial Officer\n\nSo, thank you for the question, Betsy. I will say, I think foreign exchange movements, very dramatic right now and more dramatic than they've been in many years. I think are a little difficult to communicate and hard for a lot of people to fully understand. So, you've seen dramatic moves in many of the currencies that are most important to us, from the yen to the euro, to the pound.\n\nAnd so, when you look at our revenue growth this quarter, that's why you saw a 300 basis points difference between the FX-adjusted revenue growth and the reported revenue growth 24%. Now, on the bottom line, it is a much more muted impact, Betsy, because, of course, we also have a very large proportion of our colleagues outside the U.S. to go with all that business that we do around the globe. The cost of rewards in all those countries is in the local currencies.\n\nSo, the impact on our earnings per share is pretty de minimis. I think we have a 10-K disclosure, where we talk about, over the course of a full year, movement maybe costing you, you know, $0.10. That's a quarter. So, that's why I don't really call it out when I think about EPS.\n\nWhen you convert all that into our guidance, it's why we're very comfortable saying we're going to be above our EPS guidance range, we left our reported revenue growth number the same as it was previously. I would expect to be a couple of hundred basis points above that reported revenue guidance on an FX-adjusted basis. So, I'll conclude by saying, in some ways, what we're saying is, our revenue performance has exceeded our expectations of 90 days ago. That has sort of offset the foreign exchange headwinds, which are a little bit greater on the revenue side than what I would have expected 90 days ago.\n\nBut at the bottom line, you don't really need to factor it in that much.\n\nOperator\n\nThank you. Our question comes from the line of Bob Napoli with William Blair. Please proceed with your question.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nThank you, and good morning. I'd love to get a little update on SMB and, you know, online spending. I mean, the SMB obviously is a critical business for you and just, you know, obviously growing strongly. But any color you could give on SMB, any changes? And then, online spend has actually been pretty steady.\n\nI mean, a lot of, I guess, discussion around what is the right growth rate for online spend versus offline over the long run. I think, it's a little bit of a decel maybe in offline but steady in online. So, just any color on SMB and your thoughts on the long-term growth of online spending.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nWell, I mean, let's just start -- we'll talk about a little about goods and services spending, which, you know, I mean, which is really when you start to talk about online and offline. Look, our goods and services spending is 16%, and it's -- you know, the growth rate is split pretty evenly. In fact, offline may be growing slightly more than online, but both in that, you know, 15% to 17% range. So -- and I think that's sustainable.\n\nI think that, obviously, online spending popped up, but offline spending is back above pre-pandemic levels. So, we feel really good about both. I think consumers are -- I mean, drive past the mall. I mean, consumers are out there shopping and spending.\n\nAnd they're also ordering online. And so, I think, it's sort of a double hit for us in a very positive way. So, we're very comfortable with the 16% goods and services spending. And that's, you know, approximately 70% of all of our spending.\n\nAs far as small business, small business continues to perform very, very well. And, you know, we've had -- in this quarter, we had 17% growth. And that's -- it's a large piece of our business. And we're doing more and more things, you know, with our checking account, with Kabbage and small business loans, and so forth.\n\nSo, we feel good about small business, and it continues to perform really well for us.\n\nOperator\n\nThank you. Our next question comes from the line of Rick Shane with JPMorgan. Please proceed with your question.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nGuys, thanks for taking my question. I want to revisit the topic we raised last quarter. Historically, your product offerings basically caused a customer base that's positively selected for spending pay and the product offering essentially habituated them to the pattern. Now, you're offering a product that offers revolve on day one.\n\nAnd as you move into a younger demographic, do you think over time, despite the upward move in terms of credit profile, that that will change credit performance that you will actually increase your beta to the credit cycle because you've changed the way you habituated your customer and how you've selected them?\n\nJeff Campbell -- Chief Financial Officer\n\nYeah. So, I think, Rick, it's a good question, because you are good to point out that there's been a significant change as we have, from our perspective, added more functionality for all of our customers on what our traditional charge products. And many to most of those customers still use them as traditional charge products and leave it paying off every 30 days, and some occasionally take advantage of their new functionality and being able to carry a balance if they want for a little bit. But when you think about the impact on the company, Steve used the term a couple of times today, our differentiated business mode, you know, if you look over time, our net interest income is about 19%, 20% of our overall revenues.\n\nAnd that's where it was many years ago. And frankly, that's where we'd expect it to be many years from now. Because as much as we see an opportunity to get a little bigger share of our both consumer and small business customers lending wallet, we grew fees 23% this quarter. And we are seeing tremendous growth in discount revenue.\n\nSo, we do get great growth and expect to continue to get great growth on the lending side, but I don't actually expect it to make a big difference in the overall mix of revenues that we have as a company or in the business model we have.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nNo, I don't think it's going to make a difference in the mix of -- as Jeff said, in the mix of our overall, you know, breakup of revenue and -- breakup of revenue. But I think what it also gives us an opportunity is to actually acquire more spending. And, you know, when we did not have that feature, you know, that group may have started off with a, you know, competitive lending card, or, you know, we may have put them on a blue cash have you part. And so what's happening is, and I think this bears this out in the spending numbers of 39% growth, that cohort is consolidating their spending.\n\nAnd they're consolidating their spending with our product, and it's giving them an opportunity to earn more rewards. And so, I don't really think it changes the credit profile. I think it gives us an opportunity to actually capture more spend and to ultimately capture more revenue. And the more important part is, I think the lifetime value of these customers is going to be a lot more than the lifetime value of where we acquired previously because we're going to run these people right through -- we're going to run these consumers right through the cycle, and they're going to be with us from day one.\n\nAnd I think that's really important. So, I don't think it changes the profile of our revenue. I don't think it changes the profile of the riskiness of our company. But I do think it gives us an opportunity to grow more spending and obviously to capture more revenue from this segment.\n\nOperator\n\nThank you. Our next question comes from the line of Dominick Gabriele with Oppenheimer. Please proceed with your question.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nHey, good morning. Thanks so much for taking my question. You know, the loan growth was up, as you just mentioned, about 31%, that's really industry-leading levels of loan growth. And I know you've talked about in the past that you're trying to penetrate your existing customer base.\n\nAnd so, you know, you've effectively underwritten these people through their spending habits over time. But you -- and you -- and a while ago, I think you provided how much of the loan growth was coming from an existing customer base spending cohort and not. Could you just provide some of the breakdowns that are giving you the supercharged loan growth versus the industry again? Thanks so much.\n\nJeff Campbell -- Chief Financial Officer\n\nLet me just start, Dominick, with a few stats that I think are important, and then Steve may want to add. I mean the biggest thing driving, of course, the 31% growth in loans, tremendous growth in spending. Right? So, we are in a recovery mode of spending and seeing tremendous progress there. And customers are also beginning to rebuild balances a little bit.\n\nSo, I think it's fair and natural. So, yes, I think when you look at those who have reported thus far, you're seeing industry-leading growth in loans. But you're also seeing industry-leading growth and spending. I think that's very, very important to put those two together.\n\nSo, I think we feel good about the trends and expect them to continue. And I would expect long term, just as we were before the pandemic, to grow a little faster than the industry on lending, and to do it while still maintaining best-in-class credit.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nYeah. And I think what's also important to realize is that this loan growth is not all revolving balances here. Right? I mean, so that's an important point. But spending growth like we've had will drive overall loan growth.\n\nAnd yes, it's -- you know, we've had a large, you know, year to date sort of spend spending in growth. But if you just look at it sort of sequentially quarter to quarter, because we had pretty much the same card growth, you only have about $4 billion in, you know, overall loan growth on a sequential basis. But you do have quite a bit year over year. So, it's not like all of a sudden, this thing just jumped up, spending continues.\n\nSpending continues -- has continued, you know, on a quarter-to-quarter basis, and that drives up lending -- loan growth, excuse me.\n\nOperator\n\nThank you. Our next question comes from the line of Moshe Orenbuch with Credit Suisse. Please proceed with your question.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Thanks. Maybe as a follow-up. I think, Jeff, you had mentioned that the interest-bearing portion, you know, had continued to grow faster, kind of helping net interest income.\n\nCan you just talk about when that level is off? How does that -- you know, and I guess, Steve had sort of mentioned just in the answer to the last question a little bit about, you know, kind of a fair amount of that growth in lending, not being kind of, you know, interest-bearing balances. So, as you look at that going forward, how do you think that -- how do you think that develops?\n\nJeff Campbell -- Chief Financial Officer\n\nSo, I would expect most for the next couple of quarters to see the revolving or interest-bearing portion of those balances grow a little bit faster than the overall loan growth because we're not quite back to pre-pandemic levels of behavior. I think our expectation is, overtime, and I think it may take a while still. You will eventually get back to pre-pandemic types of behavior. The other factor I would point to goes a little bit to Rick Shane's earlier question, which is you do have this evolution going on as we've added a little bit more functionality to some of our charge products.\n\nSo, those customers who have the traditional charge products but have that pay over time feature, and to use it less than your traditional credit card or revolving customers. So, that's putting a little bit of complexity in tracking our numbers here. But I think in terms of watching the macro trend, I would expect loan balances to grow a little bit faster than the industry. I would expect the next couple of quarters, the revolving portion to grow a little bit faster than the loan growth.\n\nAnd I would expect all of those things to really set down into steady-state levels about where they were pre-pandemic.\n\nOperator\n\nThank you. Our next question will come from the line of Don Fandetti with Wells Fargo. Please proceed with your question.\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nYes. On the international org change, does that signal maybe a faster pace of investment? I know it's always been kind of a balancing act in international markets. And then, also, is there anything new on the tech investment strategy? I saw you were referring to ramping up hiring, seems a little late in the game for that.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nYou know, I think, you know, the tech investment strategy remains the same. And I mean, there was an article on us ramping up hiring. And there's a lot of contracted conversion that we're doing. I mean anybody that's, you know, in financial services has their own employee base and has a large contractor base.\n\nAnd so, it's not necessarily an indication of increased headcount in technology, nor is it an indication of being late in the game. What it is an indication of is a balancing act between our contracted population and our overall colleague population. So, we've been pretty steady with our tech investment over the last couple of years, and we'll continue that same level of, you know, tech investment, you know, this year. And what was your first question, Don?\n\nJeff Campbell -- Chief Financial Officer\n\nICS.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nSo, the international piece of this, I think, you know, from an international perspective, I just think that, you know, when you run a global company, it is really important to make sure that you bring the best and the brightest to bear on all the problems and issues that you have. And when you think about acquiring card members, engaging card members, and retaining card members, you know, having a sort of a dual or a try market structure sometimes can slow down your speed and your agility versus having a single market leader looking at making what are the right investment decisions for that market. And so, how many small business cards we could acquire? How many consumer cards we acquire? How do you adjudicate what customers should get a small business or a consumer card? I think this will allow us not only to get products to market faster but to also make sure that we're putting the right investment in the right channels as we move across. As far as extra money being invested in international, we have an enterprise investment strategy, and we will put the money where the best returns are.\n\nSo, if we can get more returns out of investing in market A or market B versus the U.S. or vice versa, we will do that. And the other thing that I would say, look, I've been here for a long, long time. And organizational constructs change for the times that you're in.\n\nAnd for the technology that's available for the value propositions that are available, I mean this is, in some ways, a little bit back to the future. You know, we did globalize all these things, but now we feel it's better, you know, to take these global capabilities that we have and deploy them on a much more local level, with more local decision-making and more adjudication between sort of the various business units. So, we just think that will be a more effective and faster way. And, you know, coming out of the pandemic, I think speed of decision-making and agility will be really important.\n\nOperator\n\nThank you. Our next question comes from the line of Bill Carcache with Wolfe Research. Please proceed with your question.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThanks. Good morning, Steve and Jeff.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nHi, Bill.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nHi. Your [Inaudible] and the strength of the underlying trends certainly highlight the earnings power in the model. But I was hoping that you could address, you know, investor concerns that thinking back to the 2007 time frame, your models back then were saying that customers with multiple mortgages were good credits, and you guys essentially grew into that recession. And while today's environment is very different, some investors are looking somewhat by analogy to that time frame and have expressed concern that you may, once again, be growing into the next recession, and the strong spending trends that you're seeing are a reflection of the inflation problem that the Fed is trying to fight.\n\nWould love to hear your thoughts around that dynamic.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nI'll give you my thoughts, and Jeff can kind of jump in. You know, we've learned a lot since 2007, and we've changed quite a bit. And to think that 2007 is indicative of how we handle 2022, I think would be foolish for 2023. And again, I'll just point you to the pandemic, where I think one of the things that went unnoticed during this pandemic was how we handle people in distress.\n\nAnd I think we handled them very well from both a short-term perspective and a long-term perspective. And if you remember when Jeff used to present these slides here, we talked about AR in distress at times. And, you know, we managed that quite carefully. I can also say that our ability to collect is completely different than it was back then.\n\nOur models are different back then. But, you know, yeah, I think people can think what they want, but would be foolish to think that we haven't changed or learned a lot. In terms of growing into the recession, what I would say is this, 80% of our growth is driven by transactions right now. So, if you look at that spending number, this is not inflation.\n\nThis is transactions. This is higher levels of engagement. And so, you know, the notion of us we're growing because we have some tailwind of inflation is also a silly notion because, you know, we're engaging our card members more. We have more transactions.\n\nWe have more card members. And the last point, just going back to your first question, so, is -- our card base is so much different than it was in 2007 from an economic perspective. You know, it's a much more robust, resilient card base than it was back in 2007. And also, the way we grew our balances was not necessarily just through spending back then.\n\nThere's a lot of balance transfer activity. And so, I think, you know, this company is a very different than it was in 2007, you know, going into the recession. The card base is different. The way we were growing is different.\n\nWe've really become much more of a spend -- a growth company. We have a lot more premium cardholders. We have a lot more fee-paying cardholders than we did. Our growth is coming from very different sources.\n\nSo -- but at the end of the day, you know, when and if you have, you know, a big downturn, we'll see what happens. But we feel pretty good about abilities, and we feel pretty good about our models, and we feel really good about how our spending is being acquired right now. So, we're not just riding a tailwind here. We are riding real growth through customer acquisition and increased spending from existing customers because the value propositions are driving that growth.\n\nJeff Campbell -- Chief Financial Officer\n\nAnd the only thing I would add is that, just like that spend is coming from existing customers, the loan growth is predominantly coming from existing customers that we know well who have a better average credit profile. And we feel good about our winning through the cycle models that tell us these are customers who we should have in any environment. And I think I'll come back to my earlier comments about our credit reserve levels are still below everyone else in the industry. They're below relative to day one CECL, where others are.\n\nAnd that's appropriate given our strong credit profile. So, we feel good about where we are.\n\nOperator\n\nThank you. Our next question comes from the line of Lisa Ellis with MoffettNathanson. Please proceed with your question.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nHey, good morning, guys. Thanks for squeezing me in. Just a follow-up --\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nHi, Lisa. Good morning.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nHi -- on that point. Given the continued strength in your business and the fact that you're still benefiting from a lot of these sort of lagging recovery tailwinds from the pandemic, can you just update us on your thoughts on taking advantage of the current valuation environment to pursue some tuck-in M&A or other more like chunkier organic investments, for example, things that you're perhaps going to -- looking at or leaning in on in terms of, you know, accelerating areas of your business? Thanks.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nI mean, chunky organic investments, I mean, you've seen how we've driven our marketing spending and, you know, to acquire card members while, as Jeff said, making it harder and harder to get a card. So, I think that -- I think we've leaned in on our marketing investments. We feel really good about, you know, our technology investments. And, you know, look, we're always looking at opportunities to tuck things in that makes sense for us.\n\nI mean, you know, whether it was Kabbage or Resy or LoungeBuddy or acompay and so forth, we're always looking at those things that will, you know, add -- you know, will be adjacent and add to our organic core. What we're not looking for are things that are sort of outside of our universe. I think we've proven that we can expand, you know, with our customer base. We can expand the services that we're offering and looking at additional services that lead them to more spending or lead to more acquisition opportunities, which, you know, when you look at Resy, people look at Resy as a restaurant reservation system.\n\nWe look at that as a way to engage our card members. That is a way to engage with our restaurants. And we're looking at it as a way to acquire new card members. And so, you know, acompay is another one, where it's an ability to pick up more B2B spending.\n\nSo, you know, we're always on the lookout for, you know, capabilities. And, you know, if the right valuation comes along with, you know, the right set of capabilities, yeah, we'll take advantage of it. But as far as leaning in sort of on organic investments, I think we've leaned in. I think we've invested in marketing.\n\nWe've invested in card member services. We've invested in our value proposition. And we've invested in our colleagues and continue to keep our investment levels up in technology.\n\nOperator\n\nThank you. Our final question will come from the line of Mihir Bhatia with Bank of America. Please proceed with your question.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nGood morning and thank you for squeezing me in here. I just wanted to really quickly touch on the regulatory backdrop. It seems there's anything worth highlighting there from your perspective, specifically, I'm thinking of the building proposal, and if that's interesting to you there. But is there anything else also on regulatory that we should be thinking about? Thank you.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nOK. I'm sorry, I didn't hear. It was really hard -- I don't know if you're on a speakerphone or -- it was really hard to hear you. Durbin, is that the question?\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nSorry, yeah, I was just asking about the Durbin proposal and the regulatory backdrop.\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nOK. That's very clear now. So, look, you know, in terms of the Durbin proposal, it's a proposal. You know, I can't speculate how this is going to come out and, you know, whether -- it obviously is not going to impact us because we're a three-party system, so we don't really see that impacting us negatively.\n\nWill it impact us positively or will it actually happen? We continue to look at it, and, you know, we'll see what happens there. Look, as far as the regulatory environment, it's a tough regulatory environment. And I think, you know, in a lot of ways, you know, the objective is to protect consumers and to be transparent with consumers, and we applaud all of that. And so, I think, you know, the CFPB is talking about, you know, late fees and things like that.\n\nAnd these are not material parts of our revenue streams. But I think transparency with consumers is really, really important, and we obviously want to see all that. But I don't think the regulatory environment is any tougher than it's been over the last few years. And we'll continue to operate in that environment.\n\nObviously, it adds -- sometimes it adds a little bit of cost to comply with certain things, whether that means technological changes or what have you. But, you know, it's just like competition. It really -- it's always there. And you have to make sure that you're, you know, investing to meet the regulatory guidelines.\n\nAnd we'll continue to do that. But I don't see it as a big headwind for us, or a headwind at all for us, you know, as we move forward.\n\nKerri Bernstein -- Head of Investor Relations\n\nOK. With that, we will bring the call to an end. Thank you again for joining today's call and for your continued interest in American Express. The IR team will be available for any follow-up questions.\n\nOperator, back to you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKerri Bernstein -- Head of Investor Relations\n\nSteve Squeri -- Chairman and Chief Executive Officer\n\nJeff Campbell -- Chief Financial Officer\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nMark DeVries -- Barclays -- Analyst\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nBob Napoli -- William Blair and Company -- Analyst\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nBill Carcache -- Wolfe Research -- Analyst\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nMore AXP analysis\n\nAll earnings call transcripts"
}