{
  "companyName": "Dole plc",
  "companyTicker": "DOLE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/dole-plc-dole-q2-2022-earnings-call-transcript/",
  "content": "Dole plc (DOLE -1.53%)\nQ2 2022 Earnings Call\nAug 23, 2022, 8:00 a.m. ET\n\nOperator\n\nWelcome to the Dole plc 2022 second quarter results conference call and webcast. Today's conference is being broadcast live over the internet and is also being recorded for playback purposes. [Operator instructions] After the speakers' presentation, there will be a question-and-answer session. For opening remarks and introductions, I would like to turn the call over to head of investor relations with Dole plc, James O'Regan.\n\nJames O'Regan -- Head of Investor Relations\n\nThank you, Victoria. Welcome, everybody, and thank you for joining our second quarter 2022 earnings conference call. This conference call is being webcast live on our website and will be available for replay after this call. Joining me on the call today are Johan Linden, chief operating officer; and Jacinta Devine, chief financial officer.\n\nThis is Jacinta's first earnings call since assuming the role of chief financial officer on 1st of July. Jacinta has over 25 years of experience in the group and we wish her every success in her new role. Our chief executive officer, Rory Byrne, apologizes that he is unable to join us today as he is attending to a personal matter. During this call we will be referring to the presentation slides the supplemental remarks, and these are available on the Investor Relations section of the Dole plc website.\n\nPlease note our remarks today will include certain forward-looking statements within the provisions of the Federal Securities Safe Harbor Law. These reflect circumstances at the time they are made, and the company expressly disclaims any obligation to update or revise any forward-looking statements. Actual results or outcomes may differ materially from those that may be expressed or implied due to a wide range of factors, including those set forth in our SEC filings and press releases. Our earnings press release financial statements and related materials for the second quarter that can be found on our website at doleplc.com/investors.\n\nInformation regarding the use of non-GAAP financial measures may also be found in the press release, which also includes a reconciliation to the most comparable GAAP measures. The details of our statutory forward-looking statements disclaimer can be found in our SEC filings and in the presentation slides, which would be referring to today. Our financial statements for the second quarter were also filed with the SEC earlier today and contain reported financial information for Dole plc for the quarter ended 3oth of June 2022 and 30th of June 2021, and a half year numbers for both 2022 and 2021. Our earnings press release and investor presentation also reference pro forma comparative financial information.\n\nThis pro forma information illustrates Dole plc results for the second quarter and first six months of 2021, that the merger IPO and refinancing had occurred on January 1, 2020. This is consistent with the pro forma financial information presented in the form F-1 filed with the SEC in connection with the IPO. With that, I'd be turning today's call over to Johan.\n\nJohan Linden -- Chief Operating Officer\n\nThank you, James, and welcome, everybody. And thank you for joining us today. I want to begin by acknowledging that we recently marked the one-year anniversary of the completion of the IPO and the merger of Total Produce and Dole Food Company. The merger has brought together two highly synergistic and complementary organizations, establishing Dole plc as the global leader in our industry.\n\nWe are pleased with how well the integration has gone, and we continue to progress well with the synergy initiatives. In Q2, we again increased inter-company trade, which is a key objective. We are also making good progress in maximizing internal utilization of existing group assets and by working together to make investments that support the combined businesses. Additionally, we have continued with the rebranding of total produce businesses, which is an important step as we expand the presence of the Dole brand in the marketplace.\n\nIf we take a step back and reflect on the last year, there have been many headwinds the entire industry has faced. From rising input costs to global supply chain disruptions, the pandemic, and the ongoing geopolitical situation causing market disruptions, it is undeniable that it has been a year full of unprecedented uncertainty and challenges. But we have been able to react to and mitigate the impact of these challenges at a speed and efficiency far superior to what we could have done prior to the merger. We know that the key to succeeding in this industry over the long term is scale and diversification, which is why our vertically integrated business model supported by our highly strategic and diversified asset base has allowed us to continue performing well during this uncertain and challenging environment.\n\nTurning to our Q2 performance. Overall, the group has delivered results for Q2 in line with our expectations. On a pro forma comparative basis, excluding the impact of currency translation and net M&A activity, revenue increased by approximately 3.2%. Adjusted EBITDA of $109 million was in line with our expectations all behind last year.\n\nThe reduction from last year was predominantly due to expected changes in the facing of our EBITDA and a slower-than-anticipated turnaround in our fresh vegetable business. Turning to our balance sheet. We are pleased to see our leverage come down to 3.4 times at the end of the quarter, and we expect our leverage to improve further in the second half. In the second quarter, we had a strong focus on cash flow.\n\nWhile we needed to maintain some high working capital to protect from supply chain shortages, we focused on tight management on working capital and discretionary spending. We also took a disciplined approach on CapEx, focusing on essential projects. And importantly, we made further progress on disposing of non-core assets totaling $10 million in Q2, as we continue to focus on optimizing our invested capital. We are pleased to announce today a cash dividend for the second quarter of $0.08 per share.\n\nThis continues our commitment to return cash to shareholders. Turning to Slide 8 for our operational highlights. In our Fresh Fruit Division, we had a strong quarter driven by our North American business and commercial cargo. As we referred to in our Q1 call during the first half, we have implemented cost savings and risk mitigation initiatives, including putting additional hedges in place, and progressed the challenging work of rebalancing our supply and demand in bananas after the changes in the marketplace caused by the war.\n\nIn the absence of further abrupt changes in the market conditions, like we saw at the start of the war, we are now pleased with the outlook and are looking forward to a strong second half outperforming our prior year comparatives. Our diversified business, on a like-for-like basis, had a very robust quarter despite ongoing supply chain and inflationary challenges. We are very pleased to see our diversified segment consistently demonstrating their ability to trade well, and dynamically set pricing in response to exceptional market conditions. We expect that robustness to continue in the second half, and we are very pleased with the current progress we are making in these segments.\n\nWhile we are pleased with our second quarter performance overall, we are disappointed with the progress we have made in our vegetable business. Q2 showed significant improvements over Q1, but not to the levels we anticipated in our turnaround plan, and we expect now to face an unfavorable environment through the second half of 2022. Inflation continues to impact our value-added salad business. We have been able to push through some price increases.\n\nHowever, recent softness in the category's demand is creating a difficult trade-off for the industry between the pursuit of the volume needed to maximize production efficiencies and the pricing needed to offset inflationary headwinds. To combat these challenges, we are actively engaged in mitigation efforts while continuing to explore consolidation opportunities as well as achieving opportunities for growth. While we remain confident in our ability to get vegetable business back to profits, we do not now expect to see a full recovery in our vegetable business until 2023. With that, I will hand you over you to Jacinta to give you the financial review.\n\nJacinta Devine -- Chief Financial Officer\n\nThank you, Johan, and thank you all for joining us here today. Turning to Slide 10. As Johan mentioned, we are pleased with the strong results delivered by the group in what remains a difficult inflationary trading environment. Revenue for the first -- for the second quarter was $2.4 billion, a decrease of 4% against the pro forma comparison, primarily due to a negative foreign currency translation impact of $112 million and a net reduction of $69 million from M&A activity, both primarily in our diversified Fresh Produce EMEA segment.\n\nOn a like-for-like basis, revenue increased by 3.2%. This increase in revenue was driven by robust growth in our Fresh Fruits and Diversified Food segment, offset in part by a decline in the Fresh Vegetable segment, as a result of lower volumes in value-added salads due to both loss volumes following the recall event earlier in the year and due to lower industry demand. Adjusted EBITDA for the second quarter was $109 million, a decrease of $34.5 million on a pro forma comparative basis. $4 million of the decrease in adjusted EBITDA was as a result of the impact of currency translation on the reported results.\n\nOn a like-for-like basis, the $30 million decline was primarily due to the strong prior year comparisons in Fresh Fruits and to a loss in Fresh Vegetables. Turning to Slide 11. Adjusted net income for the second quarter was $41.3 million, in line with prior year and lower on a pro forma comparative basis. The decrease on the pro forma comparative is predominantly due to the decrease in adjusted EBITDA, offset in part by a lower tax expense.\n\nAdjusted fully diluted EPS for the quarter was $0.44 compared to $0.74 in the prior year and $0.70 on a pro forma comparative basis, again, driven by the reduction in adjusted EBITDA. I will now provide some more detail on each of the individual segments, starting with Fresh Fruit on Slide 13. Revenue for the second quarter increased by 3.5% compared to the pro forma comparison for 2021, continuing the good momentum from the first quarter. Revenue was positively impacted by increased pricing and commercial cargo, increased pricing in North America for bananas and higher worldwide volumes and pricing in pineapples.\n\nThis was partially offset by lower pricing in non-core markets for bananas. Adjusted EBITDA for the second quarter decreased by 32.4% compared to the pro forma comparison for 2021. The prior year comparison put the benefit of strong market conditions due to tight supply following the hurricanes in Central America in November 2020 and, as expected, these conditions did not repeat in 2022. Adjusted EBITDA was also impacted by higher ocean and inland freight, higher costs in packaging, fertilizers, and other materials.\n\nThese higher costs were partially offset by higher pricing in core markets as well as strong performance in commercial cargo. Moving to the Diversified Fresh Produce EMEA on Slide 14. Revenue for the second quarter decreased 10.7% compared to the pro forma comparative for 2021. This was primarily driven by a negative translation impact on currency of $110 million due to the strengthening of the U.S.\n\ndollar in the quarter against all major European currencies. In addition, there was a net reduction to revenue from M&A activity of $69 million in the quarter. On a like-for-like basis, revenue grew 8.1%, with growth seen across the division driven by increased pricing and additionally due to strong revenue growth in South Africa driven by different seasonal export timings this year compared to 2021. Revenue growth was partially offset by some logistics challenges in Europe, which impacted volumes.\n\nAdjusted EBITDA for the second quarter decreased by 3.9% compared to the pro forma comparison for 2021. The decrease in adjusted EBITDA was primarily a result of translating the results of European currency businesses into U.S. dollar, which strengthened significantly against European currencies compared to the prior year. On a like-for-like basis, adjusted EBITDA increased 7.4%, driven by a strong performance from our Spanish and UK businesses in the quarter, offset by a more challenging quarter for northern European businesses due to logistical challenges.\n\nTurning to Diversified Fresh Produce, Americas, and rest of the world, revenue for the second quarter increased 5.7% compared to pro forma comparative for 2021. This increase was primarily driven by a good performance in the potato, onion, and avocado categories, as well as a recovery in Chilean grape volumes after weather impacted volumes in Q2 of 2021. Adjusted EBITDA for the second quarter decreased by 5.4%. This decrease was driven by Q2 2021, having a seasonal timing benefit in the quarter compared to Q2 2022, and due to a challenging quarter in a joint venture Kiwi business.\n\nExcluding seasonal timing impacts, there was a positive development in the majority of the North American businesses in the quarter, in particular in the avocado, potato, and onion categories. Now turning to Fresh Vegetables on Slide 16, revenue for the second quarter decreased by 6.9% compared to the pro forma comparison for 2021. Revenue was negatively impacted by lower volumes of value-added seller products due both to lost volume following the value-added salad recall in December 2021 and January 2022, and lower industry demand. Revenue was also impacted by a planned decrease in volumes in fresh packed vegetable products.\n\nThese decreases were partially offset by price increases in value-added salads and significantly stronger pricing in fresh packed vegetable products supported by the reduced volume strategy. Adjusted EBITDA for the second quarter was a loss of $5.7 million. Fresh vegetables adjusted EBITDA was negatively impacted by lower revenue and lower cost absorption due to lower volumes, as well as by inflationary pressures on prices, packaging, and labor costs. These challenges in the value-added salad business were partially offset by improved performance of fresh packed products.\n\nTurning to Slide 17. Capital expenditures for the second quarter were $22 million. We have now investors' $39.4 million today spread for reinvestments in farms and glasshouses in our growing regions, and in efficiencies in logistics, warehousing, and processing closer to the markets. We are now expecting capital expenditure of $110 million for the year, a reduction of $15 million versus our prior guidance.\n\nAfter completing disposal of two noncore warehousing assets in Europe in the quarter, we have now generated approximately $27 million in sales of non-core assets year to date, and remain focused on optimizing our invested capital further in the coming quarters. Looking at working capital earlier this year, in addition to our normal seasonal working capital increases, we took additional precautionary measures by building inventories to combat potential challenges due to global supply chain concerns. As we entered Q2, we have been starting to see the normal seasonal working capital effects unwind. And while we expect our working capital to continue to come down as we move into the second half, we do still see an underlying higher level of working capital now compared to prior years, being driven by the precautionary measures we took earlier in the year and higher prices.\n\nPrior to the beginning of 2022, double entry into $600 million of interest rate swaps with maturity dates ranging from three to five years, which effectively converted $600 million of our debt from variable to fixed rates. And earlier this year, we added a further $100 million swaps, such that we now have approximately half of our outstanding debt at fixed interest rates. We are pleased that we were proactive in mitigating some of our exposure to rising interest rates. However, in light of the recent significant interest rate increases announced by many central banks, driving up underlying base rates, we expect the full-year interest expense to be approximately $60 million.\n\nWe are continuing to make good progress on management of our global tax outlay after the merger last year, and having considered our latest operation forecast for the year, we expect an adjusted effective tax rate in the range of 23% to 25%. We are pleased that we were able to further diversify our funding base in Q2, and as planned, we entered into a new two-year permitted trade receivables arrangement, giving us increased financial flexibility at a lower cost. As we continue to invest in the business and execute the strategy we outlined as part of the IPO, our net leverage at the end of the quarter decreased to 3.4 times. We expect leverage to decrease further in the second half of the year.\n\nNow, I will hand you back to Johan, who will give an update on our full year '22 outlook and closing remarks.\n\nJohan Linden -- Chief Operating Officer\n\nThank you, Jacinta. The economic environment remains fluid as we look into the second half. And today, we are currently seeing some both positive trends and some further challenges. On the more challenging side, as we mentioned when referring to our fresh vegetables business, we have recently seen some initial signs of adjustment in consumer behavior.\n\nWith evidence of consumers decreasing the demand for certain value-added products, which have a higher retail selling price. However, partially compensating for this, we have seen some signs of demand increasing in the banana category, as consumers look to substitute for more or substitute more for products with a lower retail selling price. While in our two diversified segments, our extensive range of products and markets leaves us well-placed to perform well as economic conditions change. Additionally, on the positive side, we have recently been seeing some stabilization in prices in important commodities like packaging and fertilizers, as well as in fuel.\n\nAnd we are also starting to see some signs that we are turning the corner on the availability of labor. In summary, we are pleased with the outlook in the two diversified segments and believe we have an improved outlook in our fresh fruit segment compared to Q1. However, due to a slower than anticipated return to full operating profitability in our fresh vegetables and the increasing impact on translation due to the significant strengthening of the U.S. dollar, we believe it is prudent to reduce our full-year adjusted EBITDA guidance by approximately 5.5% to a range of $330 million to $350 million.\n\nWe remain positive on the long-term outlook, and our priorities for the second half of the year remain in line with that, with what we set out for you in the last earnings call, with a critical focus on accelerating the turnaround of our value-added salad business. In closing, we are delighted to have now reached a one-year milestone of operating as Dole plc, and I want to thank again all our talented and dedicated people for the immense contributions they have made to our business in the past year. Because of the strength of our people and the support of our partners and customers, we are looking to the future with great confidence. With that, I will now hand you back to the operator and we can open the line for questions.\n\nOperator\n\nThank you. We will now start our Q&A session. [Operator instructions] And our first question comes from Patrick Higgins at Goodbody. Please go ahead.\n\nYour line is open.\n\nPatrick Higgins -- Goodbody Stockbrokers -- Analyst\n\nThanks. Hi, guys. Three questions for me, if that's OK. Firstly, just on the value-added salad business.\n\nCould you just give us some color on the wider market? And is it currently in decline as well? Or how much is still underperforming the market? And I guess how much pricing has the competitive set taken relative to Dole at this point? And secondly, I think you mentioned looking at consolidation opportunities within this business. Could you just expand on that? Does that include potentially disposing of your business to other operators? Are you looking to maybe add to your business? And what kind of size of deals would you be looking at? And then finally, could you just give us a sense of your expectations of phasing in that business into H2? So should we expect still a loss-making Q3, and then profitable into Q4, and onwards into [Inaudible]? I kind of just interested to hear how that pacing is going to work. Thank you.\n\nJohan Linden -- Chief Operating Officer\n\nLots of questions, Patrick. OK. So, first of all, we will look at the market for value-added. We have seen the category come down.\n\nSo the category had lost some space, and that has to do with some of the products within that category that they have higher prices, and people are staying away from that for lower priced products such as bananas, potatoes, onions. So the market or the category has taken a hit, and that hit has actually complicated our return to profitability. Because when you have a category that is declining a little bit, it's difficult to go out and ask for new volume, at the same time that you actually want to take price. We have taken price, and we are very happy with the price that we took during Q1, but we have a little bit more to take, and we also have seen some additional inflation during the summer as a consequence of the war.\n\nRight. So there is some more price to be taken, but we expect to take that as we are negotiating the new contracts with the customers. And yes, we have lost some market share. So it's not only the category even down, we have also lost some market share as a consequence of the recall.\n\nBut we are hopeful to claim back some of that volume going into Q1 of next year. when it comes to consolidation, yes, we did mention that, and we always look around what's going on in the market. We are always open for M&A activities, but our sole focus right now for vegetables is to return it to profitability. So that's the only focusing thing that we have for this category.\n\nAnd when it comes to the facing of the EBIDTA, we do expect Q4 to be stronger than Q3.\n\nPatrick Higgins -- Goodbody Stockbrokers -- Analyst\n\nThat's great. Thank you.\n\nJohan Linden -- Chief Operating Officer\n\nThank you, Patrick.\n\nOperator\n\nThank you for your question. Our next question comes from Adam Samuelson at Goldman Sachs. Please go ahead.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nYes, thank you. Good morning, everyone. I guess the first question is just to clarify a little bit to the $20 million reduction to the adjusted EBITDA guidance. Can you maybe [Inaudible] that between kind of reduced outlook for fresh vegetable currency? I think in the prepared remarks, Johan, you alluded to actually an improved outlook on fresh fruit.\n\nSo maybe just quantify the different moving pieces there. And specifically, I think the slide said the second quarter was in line with expectations. So just to clarify that entire $20 million reduction in the second half.\n\nJohan Linden -- Chief Operating Officer\n\nYeah. So Q2 was in line with expectations, but when we were looking into the second half, we had expected a stronger rebound on vegetables, so that is what's driving it. What has changed since Q1 is that when we were talking to Q1, we still saw a very strong category growth for value-added. And when the categories growing, it's much easier to go back and reclaim lost volume as a consequence of the recall, and it's also easier to ask for price.\n\nNow, when the category is backtracked that has forced us to reevaluate how we see our return to profitability plan. So that's by far the driving factor. Then there is also some translation, and as an impact when we compare from Q1 to now, but the main bulk of this is coming from a reevaluation of the vegetable turnaround.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nOK. All right. That's helpful. And then just as if you think about that change in EBITDA relative to kind of the change in free cash flow outlook, the interest kind of went up, the CapEx went down.\n\nThose are largely offsetting just in the way you alluded to, maybe expecting a full-year increase in working capital usage versus the prior one. Anyway, quantify that and think about kind of what the free cash flow profile of the business looks like this year.\n\nJacinta Devine -- Chief Financial Officer\n\nYeah. So what do we do expect to our normal working capital inflow, we're coming off a higher base. So because of the decisions we made to invest in inventory in the early part of the year to manage the global supply challenges. So we're expecting the normal working capital inflow but from a higher base.\n\nThe trends are very similar to what you would have seen in prior years.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nAnd sorry, just again, with the combined company, it's hard to go back to prior years to think about kind of what that phasing would be in the dollar versus the total produce kind of working capital wouldn't.\n\nJohan Linden -- Chief Operating Officer\n\nYeah. So, Adam, we are around, we're going to be if you take out the recall, which had an impact on the working capital last year. We are going to have an output this year of around $40 million to $50 million by year-end.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nOK. That's super helpful. I'll pass it on. Thank you.\n\nOperator\n\nThank you for your question. Our next question comes from Christopher Barnes at Deutsche Bank. Please go ahead.\n\nChristopher Barnes\n\nHi. Thanks. Good morning. I just had a quick follow-up on the value-added salad business.\n\nCould you just provide some more specificity on when like when do you think you'll be done with the turnaround? I think just as a follow-up to Patrick's first question, do you expect the return to positive EBITDA in the fourth quarter, or is that more a fiscal 23 endeavor? Thanks.\n\nJohan Linden -- Chief Operating Officer\n\nWe will turn it around. We do expect a positive EBITDA for the vegetable business in Q4. We have that stabilized our service to the customers. we are servicing our customers very well.\n\nAnd historically, we have seen when we do service them well. and when we do, then go out and ask for new volume that normally follows. So we are optimistic that we see demand coming back for us, and we have started to see some small wins, but we still need more.\n\nChristopher Barnes\n\nGot it. Understood. And then just as a follow-up question. I think we all have a good sense for your top one exposures by currency.\n\nBut is there any help you can give us on sensitivities from here, from currency as it relates to EBITDA? I mean, to the extent we have further dollar strength or even a weakening, how should we think about like the resultant impact to profitability? And then if you could just comment on what portion of your costs are dollar-denominated versus then local currencies? I think that'd be helpful. Thanks.\n\nJacinta Devine -- Chief Financial Officer\n\nYeah. Just to remember, we're talking about translation here rather than transaction exposures, but about 1% stressing the U.S. dollar has about a $1 million impact on our EBITDA. And so our U.S.\n\ndollar expenses, it's about 50%.\n\nChristopher Barnes\n\nGreat. Thanks. I'll pass it on.\n\nOperator\n\nThank you for your question. Our next question comes from Ronald French at Davy. Please go ahead.\n\nRoland French\n\nHi. Good morning, and good afternoon, everybody. A couple of questions, if I could, maybe just further follow-up questions on the vegetable business and value-added salads in particular. I guess generally, my interpretation is it's a complex category, it's a complex business.\n\nAnd ultimately it feels like there need to be more radical actions taken in that segment. Can you walk through other than pricing, I guess, what actions are being taken and whether it's leadership, whether it's a network, whether it's looking at different channels? And then allied to that, can you remind us how much of that business in salad is private label versus branded? And how does that shift to private label? Has that weighed on margin? It kind of feels like when you're running more kind [Inaudible], it becomes just more complex. And so that's the first question, and I'll let you answer that.\n\nJohan Linden -- Chief Operating Officer\n\nYeah. Let's see if I understood and follow all the questions here. Private label versus the branded has no real impact on our profitability. It does to a certain extent, make it a little bit more complicated because you add one SKU into production, but there is no big difference between the profitability.\n\nSo if we were to sell more in private label, that doesn't really have an impact. I don't have it in front of me, but my guess is that we have around 60% to 70% under the Dole brand, and the rest is around private label today. So when it comes to the overall, what we are doing is that, yes, we have strengthened the management within the organization. We have added analytical power from corporate.\n\nSo we have put that in. You have to have just to go through all the processes, going through all the numbers, so that has happened of late. We have also added industry expertise when it comes to operational excellence within the company, so that is also happening. And of course, we're doing a lot of contingency plans here that so our actions will depend on if we believe that we have some big wins in the near future, then we will act according to one plan.\n\nIf it's not, we will then reduce some of our fixed costs, which is actually not that complicated for us to do. It would just be some a little bit of time-consuming and planning. But if you don't believe we're going to have a big volume when we will also do some adjustments in the fixed costs. So there are a couple of contingency plans in place, depending on how we feel about demand in the near future.\n\nRoland French\n\nOK. That's a good color. Thanks for that, and then maybe my second question is just around the banana business, and the banana market more generally. You talk to your own actions around the supply side, can you remind us, I know you had it was a watch point around trade flows, and you'd called out that there was excess supply from Ecuador or not making its way into Russia.\n\nCan you kind of update us on your own view on the actions that you've taken and I guess the general [Inaudible] ahead of kind of recontracting trends into 2023?\n\nJohan Linden -- Chief Operating Officer\n\nYes. So we normally contract a little bit long. So we normally have a little bit of excess in the first half because the market is normally strong. So we want to make sure that we have volume, and that we if you don't need it in the core markets, we can sell them at profit in non-core markets such as the Black, Turkey, Middle East, or Asia.\n\nThis year, when the war happened, those markets just fell away. So we had to recaliber our supply base. So we took some supply out and to not have too much excess also going into the second half. So that was done during the tail end of Q1 and in the beginning of Q2.\n\nSo that is behind us. And when we now look into the second half, and the end of the year, and the season for negotiation, some of the contracts, mostly Europe, but also some of the American contracts now, in the second half, we feel that the market is relatively tight, so the supply is relatively tight. We have seen overall supply come down, and we expect that to continue to come down as we look toward the end of the year.\n\nRoland French\n\nOK. Great. If I could squeeze in maybe a third, and just a high-level one around, if you look at the H2 imply EBITDA in the midpoint of the range, it still needs a good semblance of growth. I think 150% and 25% growth.\n\nIs that largely coming from fresh fruit?\n\nJohan Linden -- Chief Operating Officer\n\nYes, as we did say in the prepared remarks upfront, we are optimistic about that a diversified segment that they are going to perform well, and we expect a stronger second half of fresh fruit compared to last year. So that is correct.\n\nRoland French\n\nYeah. OK. Got it. Thanks so much.\n\nJohan Linden -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you very much for your question. Our next question comes from Kenneth Zaslow at Bank of Montreal. Please go ahead.\n\nKenneth Zaslow -- BMO Capital Markets -- Analyst\n\nHey, I just want to follow-up on the banana market a little bit. How much do you think is going to be reduced this year? Have you seen any retailers pushback on any of the price increases? And how when do your contracts renew? How does that exactly work? And I'll leave it there. Thank you.\n\nJohan Linden -- Chief Operating Officer\n\nOK. So, contracts work differently in different markets and with different customers. Europe in general, you can say it's being negotiated in between, let's say now and up to November. That's when you negotiate by contract in Europe.\n\nIn America, you have rolling contracts. So that can happen any time of the year, but we have more volume being negotiated in the second half. But then, and then you contract, and then you normally contract for one year, but you can also have a two-year contract. So that's when it comes to the contract.\n\nWhen it comes to pushback, yes, we always have pushback from the customers. But in the end, we feel that we have been able to pass on the price increases that we needed when it comes to this category. And it's a little bit different from market to market. We felt very optimistic and good about Europe going into the year, and also in the beginning of the year because we then pushed through prices that we were happy with.\n\nThen, of course, the Euro came down and that has impacted us negatively. But overall, yes, we've been able to pushback on push to inflation on to our customers. When it comes to supply, we have seen so far supply come down from 3% to something, and we expect that. But that's just the expectation.\n\nWho knows? We expect that decline to accelerate going into the second half. And what it might not sound like much when we talk about a 2.5%, 3% of decline in volumes. But this is from a category that is used to have a 2% increase year over year for I think at least the last 15 years. So only the last two years have we seen the supply base come down, and we don't believe that necessarily to be negative for us.\n\nKenneth Zaslow -- BMO Capital Markets -- Analyst\n\nGiven the banana outlook and your stabilization in the fresh vegetables, do you think that 2023 would be an above algorithm year just because of the recovery from this? Or do you think that you have reset the base of which you will grow on algorithm year? And then I'll leave it there. I appreciate your time.\n\nJohan Linden -- Chief Operating Officer\n\nIt's a very valid question, and I totally understand that you're asking it, but it's too early for us to answer it. We will get back to you when we give the full-year guidance later in the year. The full-year guidance for next year. Thank you.\n\nOperator\n\nThank you for your question. Our next question comes from Bryan Spillane at Bank of America. Please go ahead.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nThank you, operator. Good morning, everybody. I'd like to get your perspective on to, I guess, two more macro-type topics. One is, as we're looking into the colder weather months in Europe, and maybe the potential for energy rationing in certain parts of Europe, certainly higher energy costs.\n\nCan you talk about just how you're preparing, or what potential preparations you're making both operationally to the extent that it affects operations, but also consumer sensitivity, if they're seeing much higher home heating costs as we move into the colder weather, and then I have a follow-up.\n\nJohan Linden -- Chief Operating Officer\n\nWhen we look at consumers, yes, we do believe that they might change their behavior. But when it comes to Europe, we are selling that is the diversified segment where we take life in there, we are selling the full portfolio of products. So if there is any change in one product, we will just be compensated, but other products we are selling. So we don't believe we will be negatively impacted by that directly.\n\nAnd also when bananas that we are big within Europe, we don't believe that will be impacted because it is a low-priced product. So we feel we're in a good position from that perspective. When it comes to energy cost, yes, all the divisions we are having are out looking and making sure that they have energy in the future. We had done some investments, we have gone into biofuel in some places where we before have gas, we have invested in some solar.\n\nSo we have taken precautions to be ready for a harsh winter. But we are absolutely aware of everything, of course, that is going on. And we do believe that it could be a year full of surprises, but we also believe that we are very nimble, and with the diversification, we have within the products and the type of products we are selling, we believe that we are in a good position.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. And then some of the meteorological forecasts into the winter now are again predicting another La Nina, maybe even one this year that's stronger than last year. Can you just remind us La Nina years how that affects or what impact that has either positive or negative on sourcing, especially out of South America and the western U.S.?\n\nJohan Linden -- Chief Operating Officer\n\nYeah. So this year, would you have seen it that the weather has been cloudier? So we have had bad weather. It's been a little bit colder, more cloud, less illumination, which has then meant that production has come down in Ecuador and Colombia. So you see volumes down in those in those countries.\n\nAnd we have seen drought than in the western United States. And if that continues, I think you will see that trend and continuing.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you.\n\nJohan Linden -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instruction] And now our next question comes from Ben Bienvenu at [Inaudible]. Please go ahead.\n\nBen Bienvenu\n\nHey. Thanks. Good morning. I was hoping to revisit the fresh vegetable category.\n\nI appreciate the color on the exit rate for profitability this year that you expect to be back positive EBITDA in the fourth quarter. I'm curious kind of putting a finer point on some of the comments you've made around mix shift and pricing for that business. When we think about the recovery or continued recovery of margins in 2023, are you expecting a recovery back to kind of what we saw in 2021? Or is it in the cards to get back to that kind of 3% margin rate, even as the mix has shifted?\n\nJohan Linden -- Chief Operating Officer\n\nI mean, the target for us is to get back to the 2020.\n\nBen Bienvenu\n\nOK. So if that's the target, I guess is the path there to get back? Is that a realistic target in 2023 or would you expect that it takes longer to that, just as we think about kind of calibrating our expectations on the recovery?\n\nJohan Linden -- Chief Operating Officer\n\nI understand the question, and we are putting all the actions in place that we feel and deem necessary to get back there. And that is the expectations that we are having on the division. And remember also that we have taken other actions already in this year. That is actually, we were taking actions when it comes to the fresh packed, meaning the whole head products, the whole head [Inaudible] and such.\n\nSo we always optimistic looking into next year on those products. And you have to remember the categories coming off from the very, very strong growth phase. The last five years, you have seen an [Inaudible] of 5%. We see a dip right now, but we believe the underlying demand is there, and we believe that the consumers will return to the products, even if we have had a small dip right now with some 5% in volume in the first half.\n\nBen Bienvenu\n\nOK. Great. And then a follow-up question on the pricing commentary that you made that your expectations, I think, changed in part because of expected, or less than previously expected kind of pricing increases. I think maybe what you noted.\n\nAre you expecting to continue to take price, maybe just in smaller doses going forward? Or how should we be thinking about kind of the posture that you all would take around price?\n\nJohan Linden -- Chief Operating Officer\n\nYes, we are expecting to continue to take price in the category, and we expect that the underlying inflation is there and it's there for everyone. We also expect the competition to do the same. So as we renegotiate contracts, we will push for price.\n\nBen Bienvenu\n\nOK. Great. Thanks so much for your time.\n\nJohan Linden -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you very much for your question, Ben. At this time, there are no further questions, and I would like to pass over to Johan Linden for any final remarks.\n\nJohan Linden -- Chief Operating Officer\n\nWell, then, thanks for all of you for joining the call today, and for the continued interest in Dole. And we are looking forward to speaking with you soon again. All the best.\n\nDuration: 0 minutes\n\nJames O'Regan -- Head of Investor Relations\n\nJohan Linden -- Chief Operating Officer\n\nJacinta Devine -- Chief Financial Officer\n\nPatrick Higgins -- Goodbody Stockbrokers -- Analyst\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nChristopher Barnes\n\nRoland French\n\nKenneth Zaslow -- BMO Capital Markets -- Analyst\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nBen Bienvenu\n\nMore DOLE analysis\n\nAll earnings call transcripts"
}