{
  "companyName": "Agiliti, Inc.",
  "companyTicker": "AGTI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/agiliti-inc-agti-q2-2022-earnings-call-transcript/",
  "content": "Agiliti, Inc. (AGTI -0.06%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Agiliti's second quarter 2022 earnings conference call. Today's call is being recorded, and we have allocated one hour for prepared remarks and Q&A. At this time, I'd like to turn the conference over to Kate Kaiser, senior vice president of corporate communications and investor relations at Agiliti. Thank you.\n\nYou may begin.\n\nKate Kaiser -- Senior Vice President of Corporate Communications and Investor Relations\n\nThank you, operator, and hello, everyone. Thank you for joining us on today's call as we provide an overview of Agiliti's results for the quarter ending June 30, 2022. Before we begin, I'll remind you that during today's call, we'll be making statements that are forward-looking and consequently are subject to risks and uncertainties. Certain factors may affect us in the future and could cause actual results to differ materially from those expressed in these forward-looking statements.\n\nSpecific risk factors are detailed in our press release and our most recent SEC filings, which can be found in the Investors section of our corporate website at agilitihealth.com. During this call, we'll also be referring to certain measures that are not calculated and presented in accordance with generally accepted accounting principles. You can find a reconciliation of those measures to the most directly comparable GAAP measures and a description of why we use these measures in our press release. To download a copy of the presentation that we will use to facilitate today's discussion, please visit our website at agilitihealth.com, select the Investors section at the top of the screen and then Events and Presentations.\n\nFinally, select the presentation titled Agiliti Q2 2022 Earnings Slides. With that, I'll turn the call over to our CEO, Tom Leonard.\n\nTom Leonard -- Chief Executive Officer\n\nThanks, Kate, and good afternoon. Thank you for taking time to join us as we review our results from the second quarter of 2022. Joining me today is our CFO, Jim Pekarek; and our president, Tom Boehning, who leads our commercial operations. While our overall financial outlook remains largely on track for the full year, in Q2, some aspects of our business performance differed from our expectations.\n\nToday, we'll provide color on the factors that impacted the quarter and share our perspective on the remainder of 2022. With half the year's work still ahead of us, we continue to expect our full year results to be within our original guidance range, but we now expect to finish at the low end of that range. As we review our results today, I want to emphasize the consistently strong underlying performance of our core business. Later on the call, Tom Boehning will provide an update on some of the factors driving our confidence in our financial outlook.\n\nAnd Jim will provide additional detail on our Q2 results and share our high-level assumptions for the full year before we pause to take your questions. I'll start by discussing the two transient factors that were a drag on our performance in the quarter, and it caused the variance from our expectations. First, you'll recall that Agiliti was previously awarded an extension of up to one year on our health and human Services government agreement for medical device stockpile management or for simplicity, the HHS Agreement. This extension rescoped our work to reflect normalized post-COVID management of the medical device stockpile and consists of both a fixed fee and a time materials-based fee structure.\n\nOur assumption accompanying our full year financial guidance was that revenue from the rescoped HHS agreement, which show a year-over-year decline of $40 million to $50 million with the difference primarily reported within our on-site business. However, in Q2, the government unexpectedly paused to time and materials work that we perform at their direction. Consequently, we now expect the full year financial impact from the HHS agreements to be an incremental $10 million to $15 million reduction to revenue compared to last year. Jim will provide additional detail during his remarks.\n\nA final note related to the HHS agreements. The Department of Health and Human Services recently published a request for proposal for its new multiyear agreement for the management of the federal emergency stockpile of medical equipment. On August 5, Agiliti submitted its formal response, and we are awaiting next steps on what is expected to be a new five-year contract award. The second factor driving variance from our expectations comes from the rental portion of our business.\n\nWe have previously described the net COVID impact of higher medical device utilization in 2021 is a $30 million to $40 million full year benefit to revenue. We further define this tailwind as the excess of COVID-driven rental revenue in 2021 over the 2019 pre-COVID baseline utilization for our rental fleet. Starting in Q2 this year, rental device utilization appears to have rebased lines at a level below that 2019 pre-pandemic level. Meaning, utilization for these peak need devices, which primarily include infusion pumps, ventilators, and patient monitoring devices and which represent a subset of our overall rental fleet, has recently stabilized at a level that would suggest $20 million to $30 million less revenue and corresponding margin in 2022 and implied by our initial guidance.\n\nI want to note that our rental rebaseline assumption is simply a conceptual jumping off point for managing and growing the business from here. This assumption may prove conservative, and we may ultimately see some reversion toward historical utilization levels. Both COVID impact and the HHS agreements have been the primary drivers of unexpected variability in our reported results, both favorable and unfavorable during our first five reporting quarters as a public company. Throughout this same period, our base underlying business has continued to perform in line with our expectations and our financial guidance.\n\nWhile COVID and the government contracts have been topical issues in recent quarters, it is the strong and predictable performance of our base business that puts us in a position to largely overcome these short-term unanticipated headwinds and reaffirm our full year guidance range. Further, we're particularly excited about the results coming from our 2021 acquisitions of Sizewise and Northfield Medical. Both are performing well and some measures performing well above our initial expectations. We're seeing strong momentum from the combination of these businesses into our solution offerings.\n\nAs we lap the next few quarters, which still include both COVID and HHS contract impacted results, we expect to carry our organic growth momentum into 2023. Let me now turn the call to Tom Boehning to offer his perspective on the business in the quarter.\n\nTom Boehning -- President\n\nWell, thanks, Tom, and hello, everyone. I'll build on Tom's opening remarks today with some context on evolving macro trends and a few brief updates on our commercial progress. First, as Tom mentioned, we are seeing strong new business momentum within our selling organization. There's been a clear shift in our customers' mind share from a focus on short-term COVID response to an increasing focus on longer-term strategic initiatives, emphasizing cost control and quality of patient outcomes.\n\nThis shift has only accelerated with the economic challenges our customers face today, and Agiliti remains well-positioned to help. As a result, within Agiliti, we are seeing the expected return to balanced demand across our solution portfolio. This mix shift away from the COVID-driven reliance on our rental offering gives us confidence in the continued strength of our core business as we move forward. Importantly, we've also broadened our solution portfolio over the last few years, leveraging our strong balance sheet and our disciplined approach to M&A.\n\nThe recent additions to our business are accelerating our success across the entirety of our solution portfolio. The addition of surgical equipment repair capabilities, for example, has elevated our customer call point and taken us more meaningfully into the procedural areas of the hospital and our local market capabilities combined with the market-leading bariatric patient beds, mobility equipment and clinical services from our acquisition of Sizewise are enabling us to compete for opportunities that neither company was doing separately just one year ago. Next, I'll briefly touch on the general subjects of labor availability, wage inflation and supply chain risks and their impact on Agiliti. Much as we've shared the last several quarters, we have not seen any meaningful impact from these macro issues within our business, and they are not a material factor in our financial results.\n\nIn prior calls, we've described how our unique operations infrastructure, local market scale and our skilled labor stack provide us business levers which we have used to effectively manage through potential challenges to date. Our customers, however, are feeling the impact of these macro forces, and we remain well-positioned to continue helping the provider organizations navigate these challenges. We have long described agility as a company on the right side of healthcare. In today's climate of capital and labor constraints, our ability to deliver meaningful cost, clinical and operational efficiencies to our customers is driving our accelerating momentum.\n\nReflecting on our acquisitions, we previously noted the completion of integration activities for our March 2021 acquisition of Northfield Medical. While a COVID-driven focus negatively impacted hospital procedure volumes and limited customers focus in this area over much of the last two years, we are seeing new contract wins accelerating for our surgical equipment repair solutions. And while we still have significant work ahead of us to complete the integration of Sizewise, our cost synergy achievement is already comfortably ahead of our expectations. More importantly, our early commercial success with this newly combined offering is another key factor giving us confidence in our financial outlook.\n\nReflecting more broadly, Agiliti maintains an active pipeline of M&A opportunities and the financial flexibility to pursue them. We continue to evaluate targets where we believe Agiliti can be better owner, meaning we seek opportunities where we can drive profitable volume through our at-scale nationwide infrastructure, extend the value we provide for our customers and enhance our competitiveness. With that, let me turn things over to Jim to review the details of our financial performance.\n\nJim Pekarek -- Chief Financial Officer\n\nThank you, Tom. I'll start with an overview of our Q2 financials and then offer some comments on our outlook for the year. For the second quarter, total company revenue totaled $274 million, representing a 9% increase over the prior year. Adjusted EBITDA totaled $70 million, a 10% decrease compared to Q2 last year.\n\nAdjusted EBITDA margins totaled 25% for Q2 of 2022. As Tom described, adjusted EBITDA margins versus the prior year were negatively impacted by the HHS agreement, as well as lower medical device rental utilization in the quarter. Our solid overall operating performance drove our net income of $5 million for the quarter. On a year-to-date basis, net income increased over $20 million compared to 2021.\n\nAdjusted earnings per share of $0.19 in the quarter compares to $0.23 in the year-ago period, driven by both a slight decline in adjusted net income and an increase of 8 million fully diluted shares outstanding, primarily associated with the company's April 2021 IPO. Taking a closer look at the second quarter across each of our service lines. We delivered revenue growth across both equipment solutions and clinical engineering and expected decline in on-site managed services revenue. Equipment solutions revenue totaled $107 million, up 48% year over year.\n\nOur October 1 acquisition of Sizewise contributed approximately $38 million in revenue in Q2. We neither expected nor saw any excess COVID-driven demand in Q2. However, as Tom described, customer utilization of our medical equipment fleet in the quarter was somewhat below pre-pandemic levels and below our expectations. A reminder that when comparing Q2 year over year, in the prior-year period, we had estimated a favorable impact from COVID-driven device demand of approximately $3 million.\n\nMoving to clinical engineering. Q2 revenue was $104 million, representing year-over-year growth of 3% for the quarter. Revenue from our HHS agreement was lower year over year as we move from the active deployment and in-market support of the stockpile devices to the longer-term pricing levels associated with the ongoing maintenance of the stockpile. Further, and as described earlier, a pause of time and materials work resulted in lower-than-expected revenue under this contract in the quarter.\n\nFinally, our on-site managed services revenue totaled $63 million, representing a year-over-year decline of 19% for the quarter. This is primarily driven by the renewal pricing and revised scope of our HHS agreement as expected. Reflecting more broadly on our on-site services, for the past two years, customers were primarily focused on COVID response and related challenges. As we have reengaged with our customers on their longer-term, more strategic cost and quality initiatives, we continue to see new on-site managed services opportunities successfully moving through our sales funnel.\n\nContinuing down the P&L. Gross margin for Q2 totaled $98 million, a decrease of $1 million year over year. Our gross margin rate was 36%, down 400 basis points from the prior-year period. The decline in margin rate was volume driven, primarily due to lower medical device placements and factors related to the HHS contract as described.\n\nSG&A costs for Q2 totaled $82 million, an increase of $1 million year over year. The increase was primarily due to SG&A costs from our 2021 acquisitions, net of achieved synergies. SG&A expenses as a percentage of revenue totaled 30%, which was an improvement of over 200 basis points versus the prior year. As we continue to integrate our recent acquisitions and organically grow our business, we expect to see further SG&A leverage over time.\n\nMoving to the balance sheet. We closed Q2 with net debt of $1.07 billion, which includes $1.09 billion in debt less $17 million of cash on hand on our balance sheet. Our cash flow from operations through June 2022 was $101 million, driven by strong operating results and lower interest costs resulting from the pay down of our second lien debt facility as part of the IPO. In addition, our cash flow from operations less cash flow from investing activities totaled over $60 million, which represents a conversion of 2.5 times our net income on a year-to-date basis.\n\nStrong cash flow generation and last 12 months adjusted EBITDA growth resulted in a reported leverage ratio of 3.3 times in Q2. In the quarter, we utilized our cash on hand to pay down over $50 million in debt obligations. This principal reduction is expected to reduce our cash interest payments by roughly $3 million annually. Looking forward, we will remain diligent in determining the optimal uses of our strong cash flow generation.\n\nWe continue to target leverage in the low to mid-three times range, as we expect to use our strong balance sheet and cash flow generation to fund future opportunistic M&A. Agiliti maintains a position of solid liquidity with $239 million available as of June 2022. This includes our revolving credit facility, as well as cash on hand. Finally, a reminder in the terms of our debt given the macro view on near-term interest rates.\n\nIn total, of our $1.07 billion in debt, we maintain an interest rate swap agreement on $500 million of our debt, which has swapped floating rate terms for fixed-rate terms. This provides a partial hedge for any anticipated market rate increases over the next year. Turning now to our 2022 outlook. We are reaffirming our full year financial guidance and now expect to come in at the low end of the range for revenue, adjusted EBITDA, and adjusted earnings per share.\n\nAdditionally, we are reducing our capex investment forecast range, in line with our current revenue outlook. I'd like to spend my last few minutes reviewing the key assumptions that inform our current outlook. As we have shared in our prior earnings calls, throughout much of 2022, our financial guidance assumed that our results would comp against the $30 million to $40 million in high-margin COVID-driven revenue tailwinds from 2021. While we saw some COVID-driven demand early in H1 of this year, our 2022 plan assumed a return to pre-COVID equipment utilization levels for the balance of the year.\n\nIn Q2, we saw our equipment utilization levels drop below pre-COVID levels. Accordingly, with an assumption that our equipment placements have rebaselined at the current level, the negative impact on revenue and margin for the full year is expected to be in the range of $20 million to $30 million. Turning to the HHS agreement. We previously shared that our new HHS agreement had consolidated several prior agreements, and its narrowed scope reflects the ongoing management and maintenance of the device stockpile.\n\nWhile we are not permitted to disclose financial and operational details of our contract, beyond what the government discloses directly, implicit in our prior guidance was the expectation that Agiliti would see a $40 million to $50 million revenue reduction in 2022. As Tom shared in his opening remarks, in Q2, we learned that certain time and materials work would be deferred until a new HHS contract is awarded. We now expect the full year financial impact of the HHS agreement to be an incremental $10 million to $15 million reduction to revenue compared to last year. With that incremental reduction impacting our clinical engineering business and roughly split between Q2 and Q3 of this year.\n\nNext, consistent with the ordinary course of our business, we continue to sign and implement new contracts for our solutions, as customers turn their attentions back to their long-term strategic and financial initiatives where our solutions play an important role [Audio gap] impact of acquisitions. Our current guidance implies underlying organic revenue growth in the high single-digit to low double-digit range. Our full year adjusted EBITDA margins are expected to be in the range of 26% to 27%. Finally, a reminder that our business historically experiences modest seasonality, with the first and fourth quarters, representing our strongest quarters based in part on the timing of the annual fluid [Audio gap] assumption that we will begin to recognize time and materials revenue under our HHS agreement starting in Q4 of this year.\n\nAny new T&M revenue would be an addition to the normal effect of seasonality on our financials. As I conclude, I want to echo Tom's opening comments by noting that we remain confident in our outlook on the year, and I expect to see continued momentum as we turn the corner to 2023. I'll now turn the call over to our operator to provide instructions for our Q&A.\n\nOperator\n\nThank you very much. [Operator instructions] Our first question comes from the line of Kevin Fischbeck with Bank of America. Please go ahead.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. I want to dig in a little bit to your commentary about kind of the rebasing of the core volumes to below 2019. It seems a little bit like you guys are thinking about this as kind of a temporary dynamic.\n\nClearly, this is a dynamic a lot of providers saw during Q2. Would love to hear how you're thinking about getting back to that 2019 baseline? Are you seeing anything in the July or August placements that point to that happening sooner rather than later? Or is this going to be a longer-term kind of normalization?\n\nTom Leonard -- Chief Executive Officer\n\nKevin, this is Tom. Thanks for the question. This is the way how do you think about this rebaseline assumption? I think of it as really a starting point for utilization for us now on the overall medical device fleet and becoming our, let's say, our jumping off point for managing the business going forward from here. In that regard, this assumption of a rebaseline may likely prove to be a conservative assumption.\n\nAs you know, providers who had -- were canceling and had lower procedure volumes over the course of the last quarter that impacts some of the utilization. We're also seeing providers somewhat concerned about their financial outlook when they do that. CFOs tends to look to tamp down expenses wherever they can. One of the areas that they'll typically push is around things like rental medical devices in their facilities.\n\nAnd it's easier to do that certainly in the summer months that tend to be slower. So while our assumption is one of effectively a rebaselining, it is likely going to reverse in some form back to the mean. What gives me some confidence in that, if you look back -- as we look back over the last two years, we have generally grown the number of rental contracts that we enjoy as a company over the last two years. And what we have seen it -- due is roughly offset what has been the impact of additional medical device purchases that customers made during COVID.\n\nAnd this is logic that has held true during each COVID wave. So the initial wave came and went, when Delta came and went when Omicron came and went. In each case, utilization subsequently resets to right about where it was in 2019. So it came as a surprise to us that it went below that.\n\nThere are potentially more factors that are driving that. We're simply calling it a rebaseline for now, just to use it as a mostly a conservative start point for how we grow the business from here.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nAnd I guess I agree that thinking about it that way is the new baseline is it feels conservative of the companies are not assuming that. But I guess if we thought about that upside potential, how do we -- is there a reason to think that it might not come back? I guess some of the companies have talked about the shift to outpatient as a theme that may be accelerated during COVID, in particular, seem to be pronounced in Q2. I guess how does that shift impact your business? And is that something that might hold back that -- or cost that we baseline to be actually the right way to think about it longer term?\n\nTom Leonard -- Chief Executive Officer\n\nSo for planning purposes, we're assuming it's factual. It's real. It persists. Again, it would be a conservative assumption, but that's what we've built into our update to our financial guidance for the balance of the year.\n\nSo if that turns out to be an overly conservative assumption, I would say, that there'd be biased to the upside.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nIs the shift to outpatient a drag to your business or --\n\nTom Leonard -- Chief Executive Officer\n\nYes. So we serve more than 9,000 customers, far more than just hospitals. Our primary customers, as we've shared before, to the [inaudible] hospitals and health systems, including the non-acute care facilities that they own. What that means is we tend to be really everywhere.\n\nThere is medical device intensity. So it doesn't matter to us if a procedure is performed at a hospital or the procedures performed at a surgical center, we are very likely there. So the shift to outpatients is something we follow as our customers follow it and has no impact on our results.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from Matthew Mishan with KeyBanc. Please go ahead.\n\nMatthew Mishan -- KeyBanc Capital Markets -- Analyst\n\nGood afternoon. Thank you for taking my question. The first one on on-site managed services. Now that we've rebased a full quarter of the ventilator contract, it seems like the time of materials is more in clinical engineering than on-site managed services? Is this the right baseline to begin from to look at that segment going forward? Or should we be thinking about that now sequentially growing as you win new contracts?\n\nJim Pekarek -- Chief Financial Officer\n\nYeah. Great question, Matt. You're thinking about it spot on. It's exactly the right way to think about it.\n\nMatthew Mishan -- KeyBanc Capital Markets -- Analyst\n\nAnd then on Sizewise, that seems to be coming in above our expectations and maybe bucking the trend on equipment utilization at the hospital. How is that acquisition being received by your customers? And then you all -- and just as a follow-up to that, you've had that for about a year now. Any thoughts on -- or updates on self-manufacturing?\n\nTom Leonard -- Chief Executive Officer\n\nSo in terms of customer acceptance, I think it's clear from the results, the combination of the capabilities we picked up when we acquired Sizewise. As we integrated them with both the capabilities that we had plus our local market logistics and service infrastructure have been very powerful for us, and it just continues to perform very well for us. We're now nine months into our ownership, thrills with transactions, thrills with the teams that have come over and expect this to continue to be a meaningful driver in our results going forward. It's one of the factors that helps us overcome those transient headwinds that we've described and give us confidence in the full -- our full year guidance range.\n\nBut in terms of the role of self-manufacturer within our portfolio, we've traditionally sourced from others. The opportunity to self-manufacture was an important aspect of the Sizewise transaction. We continue to manage through that integration really without issue. We're excited about the capabilities that we have, and we would not hesitate for the right opportunity to expand what we're doing in terms of self-manufacture of products in our portfolio.\n\nMatthew Mishan -- KeyBanc Capital Markets -- Analyst\n\nExcellent. Thank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Zach Weiner with Jefferies. Please go ahead.\n\nZach Weiner -- Jefferies -- Analyst\n\nHey. Thanks for taking the questions. Just wanted to touch on procedure volumes and a potential backlog through COVID. Obviously, we've seen procedural volumes been delayed and some folks are talking about backlog.\n\nIs that -- should that impact utilization going forward? And how should we think about that?\n\nTom Leonard -- Chief Executive Officer\n\nSo when we think about where procedure volumes would impact us in the P&L, let me start there. The two places won't be within equipment solutions. So within rental, that's one of the factors in lower-than-expected rental in the quarter as procedure volumes were off from our expectations. So as those come back, we would expect to see that benefit within equipment solutions.\n\nThe other place that it impacts us is surgical equipment repair as part of our clinical engineering business, one of the drivers and higher repair volumes is more surgical cases, so that should be a small -- a slight tailwind for us as cases come back as well within clinical engineering.\n\nZach Weiner -- Jefferies -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Amit Hazan with Goldman Sachs. Please go ahead.\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nHey, Thanks. good afternoon. I think I want to come back to the equipment Solutions commentary and just try to understand your own visibility into what's going on with your customers. As I think about volumes for hospitals in the U.S., they really have never come back to 2019 levels, I mean, throughout the pandemic.\n\nSo being below 2019 levels is not really a surprise to me. So I'm just wondering if this is a relative thing for you that you had expected some percent of normal that has not been achieved? Or give us a sense of -- what I'm really curious about here is like the precision with which you guys can actually be able to model the forward here based on what you see. So was this a relative thing or you were expecting some kind of a return to a percent of normal that didn't happen because in absolute terms, I'm guessing it probably didn't surprise you at much. I'm just trying to figure out what's new and incremental here for you?\n\nTom Leonard -- Chief Executive Officer\n\nThat's a really good set of questions. And let me kind of unpack it and feel free to push me in either direction as we go through this. What we know over the last two years is that customers made more purchases of medical devices, more than they would normally have access devices. So we knew that would be an impact on rental demand broadly.\n\nAnd as you said, we still have not seen inpatient census return to pre-COVID levels, that remains, for planning assumptions, a headwind as well. Offsetting that for us has been the increase in new contracts that we won over the last two years. The ongoing assumption on the year was that these two things would roughly offset that the increase in our contract positions would roughly offset where we would be from customers making additional purchases and the current census environment. We felt that was a solid assumption to make because through each wave of COVID, the subsequent reset brought us back to that same place right around that 2019 baseline.\n\nAgain, with new contracts generally offsetting headwinds of census and headwinds from customer excess purchases of devices. So when -- in early Q2, utilization started to go below that for the first time, that was new to us. So what we do is we started then with simply a rebaseline assumption. Let's just assume that where we are today is the new normal, and that would tie to the $20 million to $30 million top-line, bottom-line impact that we described and it's implied then by our revised guidance for the full year.\n\nIt may again be the case that that's too conservative of an assumption. Why? Well, because each and every wave we tended to end up back that 2019 baseline over the last two years. This is the first time that did not happen. And there are reasons with the summer with case volumes being off and others that are excess drivers.\n\nAnd remember what CFOs want to do is push costs out of the system when they see uncertainty. And one of the short-term costs that they often try to push is rental devices here to do in periods of low utilization like this summer, which tend to be lower throughout the year for. But ultimately, care has to be delivered if they don't manage the devices efficiently, they will end up renting more and that creeps back in. So there are a couple of things that I think represents tailwinds for us on that overall conservative assumption.\n\nBut for planning purposes, we just assume this is the new baseline. It's $20 million to $30 million top- and bottom-line impact for the balance of the year. That's our new start point. In terms of our ability to model it going forward, I would say this is the -- really the -- COVID is really been the only driver in this business.\n\nIt's a business we've been in for more than 80 years. There's a lot of data in this business. Not just in aggregate, but really -- by touches even by product line like ventilator, but even by specific manufacturers. We have an extraordinary amount of data.\n\nThis is a business that we have historically been able to model with a very high level of precision. And that's our goal with the rebaseline. This position assumes this is the new start point and then begin to think about it in the way that we always have and again, hope that those -- that assumption proves to be conservative.\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nJust as a quick follow-up to that, I'm curious if you're able to comment on July and early August, but the true kind of second question is actually on on-site managed services. And if you kind of take the government piece out of it and I think back to pre-IPO and the IPO and subsequent, this is one division that feels like it's not coming through as we had expected prior to the IPO and around the IPO. I'm curious if that's the case for you. I know you heard us -- you've said it before, COVID has definitely caused your customers to focus elsewhere.\n\nSo I get that. But we also expected some improvement by this point, as these customers come out of COVID, maybe that's our fault for being a little bit too aggressive on that. But just help us out here on why we should continue to be confident that the kind of nongovernment OMS fees should grow high single digits, low doubles, if that's the case.\n\nTom Leonard -- Chief Executive Officer\n\nYeah. I'll start with the first part of your question around seeing difference in July or August to date. I would say nothing meaningful, but I wouldn't expect to either summer again tends to be the low months, August is typically the lowest month for utilization of the fleet. So we weren't expecting and have not seen any change in utilization of the medical device sleep.\n\nIn terms of on-site managed, we described the impact year over year of the federal government contracts and what we have to overcome to show growth in that just from a comp perspective, we continue to sign new business. These tend to be larger deals. Larger deals tend to have longer implementations and she ramp -- on the revenue and ramp into the margin on those, taking longer certainly than clinical engineering, which tends to be a lot faster. And obviously, rental is instantaneous when we drop the equipment off.\n\nWe continue to be very comfortable with the progression of that business. And it's why we haven't provided guidance beyond this year, what we have historically done is appointed folks to 2015 to 2019 and the historical organic performance of that business has a good starting point for modeling that business as we get through this transition out of the COVID and into signing this business with our customers now that they're turning their attention there and implementing it, I think you'll see it comes along much as we've described.\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Matthew Borsch with BMO Capital Markets. Please go ahead.\n\nMatthew Borsch -- BMO Capital Markets -- Analyst\n\nYes. If I could, just continuing on the utilization environment topic. What are you hearing from your -- all of your clients? I'm sure it's not the same thing, but generally is explaining the lower volumes, if there's any. I guess what I'm interested in is, are they pointing to constraints on their availability of caregiver labor as a key factor or more just a lower level of -- I suppose, what you might call demand organic utilization coming through the system?\n\nTom Boehning -- President\n\nGo ahead, Tom.\n\nTom Leonard -- Chief Executive Officer\n\nNo, please. So we're seeing customers impacted by availability of labor. We're seeing higher cancellations, including due to supply chain ability to get what they need to support the procedures. We are seeing also concern and uncertainty about their financial performance, including driven by the hour cost of labor, especially temp labor, like using staffing companies that they have to turn to when they have labor shortages.\n\nSo the back row drivers plus some cost of labor challenges with things like having to access nurses through staffing companies have created some uncertainty, and they are seeing some level of cancellations and overall, not the same demands that certainly they were expecting and that we were expecting of them in this past quarter. Tom, I don't know if you have anything else you wanted to add as color to that.\n\nTom Boehning -- President\n\nNo. I think you said it, Tom.\n\nMatthew Borsch -- BMO Capital Markets -- Analyst\n\nAnd to the extent you can comment on the HHS contract extension, I'm not looking for the financial terms per se. But just understand, it's not clear to me what happened with the deferral of time and materials labor? Is that -- I mean -- how did that come through? Was it just a government decision that you were not necessarily expecting? I mean, maybe do you -- I mean, is there a why and how do you know that it's going to pick up in the fourth quarter with the continued deferral through the third quarter, if I'm understanding that right?\n\nTom Leonard -- Chief Executive Officer\n\nYeah, great question. So through the better part of the first quarter, we were still under the attention to the original agreement. We shared near the end of the first quarter. We received the up to one-year extension, but we called the current HHS agreement that contained provisions as we've described, both for the fixed cost portion, which is manage the stockpile.\n\nAnd then the time of the materials portion, which is due such other duties as the government made directors to do from time to time. Shortly after that award, because we only do that work in nets work at the government instruction, they informed us that work that we would normally do under that time of materials part of the contract would be deferred until such time as there is a new five-year contract award, which, as we've described, the RFP has been put on the street. We provided a response. We hope to see something shortly in terms of a decision on an award, but it is our current understanding that post that award normal work that needs to be completed, but it's done on a time and materials basis would restart plus in our guidance is that restart in Q4 of this year.\n\nMatthew Borsch -- BMO Capital Markets -- Analyst\n\nAnd maybe one last question, if I could. I know you talked before and maybe you touched on this, I apologize if I missed it. But are you still seeing the sort of high single-digit growth, excluding HHS in your on-site managed services segment? I know that's what you had talked about last quarter. I'm curious if that's still the case or has that been influenced somewhat by the lower-than-expected level of utilization?\n\nTom Leonard -- Chief Executive Officer\n\nSo unfortunately, at least on my phone, Jim's speaker seems to drop out, microphones seem to drop out in the middle of his remarks. What he had shared is when you take out the transient COVID and HHS impacts, which we've described and quantified for you. And then, of course, you adjust for the annualized impact of acquisitions, what our current guidance continues to imply is underlying organic revenue growth in the high single-digit to low double-digit range.\n\nMatthew Borsch -- BMO Capital Markets -- Analyst\n\nRight. It's specific to on-site managed services.\n\nTom Leonard -- Chief Executive Officer\n\nOh, I'm sorry. This is for the business overall.\n\nMatthew Borsch -- BMO Capital Markets -- Analyst\n\nNo, that's very helpful. I appreciate it. I did actually catch that Jim was coming in and out, but I guess I got that one part. I was more sort of a question within that a granular question that I understood.\n\nYou correct me, if I'm wrong, I thought that last quarter, you had said that if you strip out HHS that the organic growth specifically on-site managed services was chugging along in the high single-digit range. And I just wondered if that had changed at all as a result of perhaps utilization, even though I know that's mostly an equipment solutions factor or it hasn't changed.\n\nTom Leonard -- Chief Executive Officer\n\nJim, can you comment on that?\n\nJim Pekarek -- Chief Financial Officer\n\nYeah. It hasn't changed from Q1 to Q2 in terms of the prior guidance that we had shared, Matthew. And I apologize if my line went in and out. I did not realize that, Matthew.\n\nTom Leonard -- Chief Executive Officer\n\nAlways work during --\n\nMatthew Borsch -- BMO Capital Markets -- Analyst\n\nWe got most of the important stuff.\n\nJim Pekarek -- Chief Financial Officer\n\nAll right. We'll get the rest a bit later, Matthew.\n\nOperator\n\nThank you. [Operator instructions] Ladies and gentlemen, we have reached the end of the question-and-answer session. And I would like to turn the call back to Tom Leonard for closing remarks.\n\nTom Leonard -- Chief Executive Officer\n\nThank you, operator. So as we conclude our prepared remarks today, I do want to reiterate the key messages that we hope you heard during our call today. First, COVID and our HHS agreement have been the primary drivers of variance, both favorable and unfavorable, in our financial results since our IPO. We do currently expect to lap the periods impacted by these transient factors over the next few quarters.\n\nSecond, our unique operations infrastructure has allowed us to continue to absorb macroeconomic headwinds, including labor availability, inflation, and supply chain impacts without material impact to performance. Third, that Agiliti remains a company on the right side of healthcare. We're well-positioned to help our customers address these very same economic headwinds. And as a result, the underlying base business of Agiliti remains strong.\n\nFourth, we've been successful at identifying and integrating acquisitions that enhance our overall value to our customers and that are now meaningfully contributing to our performance. And finally, that as we lap the transient headwinds impacting our reported results, we expect to bring demonstrable organic growth momentum into 2023. With that, I want to thank you for your interest in Agiliti, and this will conclude today's call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKate Kaiser -- Senior Vice President of Corporate Communications and Investor Relations\n\nTom Leonard -- Chief Executive Officer\n\nTom Boehning -- President\n\nJim Pekarek -- Chief Financial Officer\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nMatthew Mishan -- KeyBanc Capital Markets -- Analyst\n\nZach Weiner -- Jefferies -- Analyst\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nMatthew Borsch -- BMO Capital Markets -- Analyst\n\nMore AGTI analysis\n\nAll earnings call transcripts"
}