{
  "companyName": "monday.com Ltd.",
  "companyTicker": "MNDY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/14/mondaycom-ltd-mndy-q3-2022-earnings-call-transcrip/",
  "content": "monday.com Ltd. (MNDY 0.88%)\nQ3 2022 Earnings Call\nNov 14, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day. My name is Alex, and I'll be your conference operator today. At this time, I would like to welcome everyone to monday.com's third-quarter fiscal year 2022 earnings conference call. I would now like to turn the call over to monday.com's director of investor relations, Mr.\n\nByron Stephen. Please go ahead.\n\nByron Stephen -- Director, Investor Relations\n\nGood day, everyone, and thank you for joining us on today's conference call to discuss the financial results on monday.com's third-quarter fiscal year 2022. Joining me today are Roy Mann and Eran Zinman, co-CEOs of monday.com, and Eliran Glazer, monday.com's CFO. We released our results for the third quarter fiscal year 2022 earlier today. You can find our quarterly shareholder letter along with our investor presentation and a replay of today's webcast under the News and Events section of our IR website at ir.monday.com.\n\nCertain statements made on the call today will be forward-looking statements, which reflect management's best judgment based on the currently available information. These statements involve risks and uncertainties that may cause actual results to differ from our expectations. Please refer to our earnings release for more information on the specific factors that could cause actual results to differ materially from our forward-looking statements. Additionally, non-GAAP financial measures will be discussed on the call.\n\nReconciliations to the most directly comparable GAAP financial measures are available in the earnings release and the earnings presentation for today's call, which are posted on the Investor Relations website. With that, let me now turn the call over to Roy.\n\nRoy Mann -- Co-Chief Executive Officer\n\nThanks, Byron. Good day, everyone, and welcome to our third-quarter earnings call. We are pleased to say that Q3 was another terrific quarter for monday.com. We posted strong growth with enterprise customers saw continued momentum in our new Work OS product suite with monday's CRM exceeding expectations, scaled our global workforce and operations, and did it all while generating positive adjusted free cash flow.\n\nWe ended the quarter with a revenue of 136.9 million, reflecting growth of 65% year over year on a reported basis, or 68% on an ethics adjusted basis. Adjusted free cash flow of 14 million, representing a 10% adjusted free cash flow margin. We are closely monitoring uncertainties in the macro environment and the impact it's having on our customer and our business. We currently see two primary headwinds.\n\nFirst, we continue to see pockets of stress in our customer base, in particular, in Europe with some indication of softness spreading to other regions. Second, since we have a large presence of business outside the U.S., the strong U.S. dollar has negatively impacted reported results and represents an ethics headwind to revenue growth. Despite these uncertainties, new customer demand remains solid, and acquisition efficiency improved in Q3, while others are pulling back, we continue to see opportunities and invest for growth and gain market share.\n\nWith our in-house business intelligence tool, BigBrain, we track every marketing campaign in detail, allowing us to easily adapt to changes in the business environment. Let me now turn it over to Eran to walk you through our Q3 product highlights.\n\nEran Zinman -- Co-Chief Executive Officer\n\nThank you, Roy. As Roy mentioned, our strong growth this quarter continues to be led by enterprise customers, with our enterprise base growing 116% year over year in Q3. We achieved this by delivering several key updates that are tailored to the needs of larger customers. We continue to invest heavily in the overall performance of the Work OS platform, adding more enterprise features and functionality and building our direct sales organization in order to learn larger and expand more with enterprise customers.\n\nMost notably, this quarter, we enhanced board load times by 25%, improve our mobile experience to achieve an amazing 99.8% crash-free rate, and significantly improve our strategic integrations with both Salesforce and Jira to make them as seamless as possible. As a result, as of Q3, customers with 10-plus users now represent 76% of ARR, up from 70% a year ago. Customers with more than 50K in ARR now represent 26% of ARR, up from 18% a year ago. We intend to provide these two metrics on a quarterly basis going forward.\n\nNext, I would like to highlight the continued success of our Work OS product suite, which represent a huge opportunity for monday.com. In just five months since their launch, we've seen over 3,000 new customers adopt at least one of the new Work OS products. We are extremely encouraged by the adoption that we're seeing in these early stages, especially from monday sales CRM, which consists of over half of the new Work OS product signups. Monday sales CRM is already rated as one of the best CRMs in the market, according to G2, and we continue to focus on making it even better through advancements such as new layouts and new reporting of widget type.\n\nAs a reminder, this new Work OS products have only been made available to new customers, and we are excited to roll the product out to our existing customer base in the near future. With that, let me now turn it back over to Roy.\n\nRoy Mann -- Co-Chief Executive Officer\n\nThank you, Eran. Earlier this month, over 97,000 registrants from over 174 countries came together for our annual online conference, Elevate. This exciting event offer customers training and product workshops on ways to make the most out of their Work OS, deep insights on how to boost efficiency and improve workflows, and inspiring talks from leading companies and fellow customers. We are also hosting additional invite-only events for industry leaders in New York City, London, and Sydney this month.\n\nAnd we are extremely excited to meet many of our customers and partners in person in the coming weeks. At Elevate, we opted to plant one tree in honor of every registrant in place of sending physical gifts. Now, we are taking this step further and will plant 265,000 trees across four different forests in Southeast Africa over the next 18 months. This effort is a reflection of our ongoing commitment to making the planet sustainable, equitable, and safe.\n\nThis effort is a reflection of our ongoing commitment to making the planet sustainable, equitable, and safe. Finally, such strong, consistent innovation and growth this quarter wouldn't be possible without our amazing team, which grew this quarter to over 1,550 employees around the world. We continue to invest in our people with new offices in New York City, Chicago, Miami, and Tokyo. We believe these spaces will invite even more collaboration and community for our teams while providing the flexibility they need to be successful.\n\nThese offices signify not only where we are right now, but where we are going in the future. We are very proud of the growth we achieved this quarter and look forward to carrying this momentum into the end of the year. With that, I'll turn it over to Eliran to cover our financial and guidance.\n\nEliran Glazer -- Chief Financial Officer\n\nThank you, Roy, and thank you to everyone for joining our call. Today, I'll review our third-quarter results in detail and provide updated guidance for the fourth quarter and full year 2022. We continue to deliver strong growth, driven by customers increasingly adopting the broader monday.com Work OS and our product suit across the organization. Total revenue came in at 136.9 million in the third quarter, up 65% year over year on an as-reported basis and 68% on an FX adjusted basis.\n\nAdditionally, we saw continued operating margin expansion during the quarter stemming from our platform-based lend and expense strategy and operational efficiencies. Coming off historical highs, our net dollar retention rate, or NDR, declined slightly in the third quarter, negatively impacted by a strong U.S. dollar and our increasing ability to lend larger initial bills. NDR for customers with more than $50,000 in ARR was over 145%.\n\nNDR for customers with more than 10 users was over 135%. And our NDR for all customers was over 120%. As a reminder, our net dollar retention rate is a 24-quarter weighted average calculation. For the remainder of the financial metrics disclosed, unless otherwise noted, I will be referencing non-GAAP financial measures.\n\nWe have provided reconciliation of GAAP to non-GAAP financials in our earnings release. Third-quarter gross margin was 89%. In the medium to long term, we continue to expect gross margin to remain in high 80s range. Research and development expense was 26.3 million or 19% of revenue, compared to 17% in the year-ago quarter.\n\nWe will continue to invest significantly in R&D throughout the remainder of the year as we build our product suite and scale our Work OS platform both horizontally and vertically. Sales and marketing expense was 82.4 million or 60% of revenue compared to 73% in the year-ago quarter. We anticipate sales and marketing expense as a percentage of revenue to be in the mid- to high-60s range in Q4. G&A expense was 15.2 million or 11% of revenue, compared to 11% in a year-ago quarter.\n\nOperating loss was 2.2 million, and operating margin was negative 2%. Net income was 2.6 million. Diluted net income per share was $0.05 based on 50.3 million fully diluted shares outstanding. Total employee headcount was 1,552, an increase of 63 employees since last quarter.\n\nWe continue to execute on our hiring playbook that we laid out at the beginning of the year with elevated hiring in the first half and a much slower rate in the second half. We anticipate the discount level of hiring will be consistent moving forward. Moving on to the balance sheet and cash flow. We ended the quarter with 852.6 million in cash and cash equivalents.\n\nNet cash provided by operating activities was 20 million in the quarter. Adjusted free cash flow was 14 million, including approximately 7 million from financial income. Adjusted free cash flow margin was 10%. Adjusted free cash flow is defined as net cash from operating activities less cash used for property and equipment and capitalized software costs, excluding nonrecurring items.\n\nNow, let's turn to our updated outlook for fiscal year 2022. For the fourth quarter of fiscal year 2022, we expect our revenue to be in the range of 140 million to 142 million representing growth of 47% to 49% year over year. We expect a non-GAAP operating loss of 22 million to 20 million. For the full year 2022, we now expect as reported revenue to be in the range of 509 million to 511 million, representing growth of 65% to 66% year over year.\n\nWe now expect the full year non-GAAP operating loss of 83 million to 81 million and the negative operating margin of approximately 16%. With the recent strengthening of the U.S. dollar, we estimate that at the current spot rate, FX will negatively impact our full year revenue growth estimates by approximately 300 basis points. Given the concerns about the macro economy and the market, we have provided what we believe to be achievable forward-looking guidance.\n\nPlease note that we will be introduced guidance for the full year 2023 in our fourth-quarter earnings. In sum, we remain committed to balancing healthy growth in the business while also staying disciplined on improving efficiency and profitability. We have had an abundance of great opportunities ahead and will continue to make decisions with the longer-term view. I'll now turn it over to the operator for your questions.\n\nOperator\n\nThank you. [Operator instructions]. Our first question for today comes from Steve Enders of Citi. Steve, your line is now open.\n\nSteven Enders -- Citi -- Analyst\n\nHi, great. Thanks for taking the question. I just wanted to dig in a little bit more into some of the outlook that you're seeing out there and particularly what you're seeing on the billing side. Have there been kind of any change in customer dynamics either with, you know -- with the FX impact that came in the quarter or anything around deal durations] or any split between kind of SMB or enterprise that you're seeing out there with customers?\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah, sure. Hi, Steve. This is Eran. So, first of all, you know, one important thing to start with, all our underlying fundamentals are very strong.\n\nWe continue to see very strong enterprise growth. NDR remains very high and stable, and we can see the early adoption of our new Work OS product. As we mentioned also in the previous quarter, we continue to see the same FX headwinds that we had and have an impact on our revenue growth and also NDR. And as we mentioned as well, we see some softness in Europe that also continued into Q3.\n\nOne thing to mention in addition that in September and October, we started to see some indication that the softness is kind of spreading a bit more globally. So, definitely we can see that as well. But from another perspective, in terms of performance marketing, we continue to heavily invest and take and acquire new customers. I would say that becomes more efficient for us to acquire new customers, lower bids in the market.\n\nAnd definitely, you know, it's an option for us to gain a larger market share. And also our free-to-pay conversion, overall funnel, remains very stable. So, taking all of that into account, all the fundamentals remain very strong, and we continue to gain momentum in the market.\n\nSteven Enders -- Citi -- Analyst\n\nOK. Now, that's helpful. It's great to hear. I guess just again on the kind of the profitability upside in the quarter, I guess can you dig it a little bit more about kind of what were the drivers there? Were there any kind of delay in spend that you have that maybe you shifted some things into 4Q or maybe some change in kind of hiring expectations? Can you just kind of dig in what really drove the upside here and then giving some other back and forth here?\n\nEliran Glazer -- Chief Financial Officer\n\nHello, Steve it is Eliran. So, first of all, welcome to the conference meeting for the first time. You know [Technical difficulty] we're operating in accordance with our playbook, web system called BigBrain that is measuring everything that we do. And going back to what Eran said, our performance marketing and marketing spend overall is lower than anticipated because cost per sign up went down.\n\nTherefore, we benefit from these efficiencies. Obviously, we beat the top line by $6 million, and this impacted our [Technical difficulty] on our discretionary spending. If there is not necessarily things to do, events or travel, then, obviously, we are more cautious with the level of spend. So, all of these together, combined with the way we manage the business from an efficiency perspective and the playbook that we apply, drove the, you know, great margins that we saw in this quarter.\n\nSteven Enders -- Citi -- Analyst\n\nOK, perfect. Appreciate the color. Thanks for taking the questions.\n\nOperator\n\nThank you. Our next question comes from Pinjalim Bora from J.P. Morgan. Your line is now open.\n\nPlease go ahead.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nHello, great. Hey, guys, thank you for the question, and congrats on the quarter. I want to ask on the Work OS products, it seems pretty impressive results. Is-- can you help us understand, you know, what kind of price points those things -- those new products are landing at.\n\nSeems like CRM is doing well. What about the other parts, the other three products? And then, what -- how should we think about the contribution of those products this year?\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah, Pinjalim, thanks for the question. This is Eran. So, definitely, we're very happy and excited and encouraged from the results we've seen so far with the new Work OS products. I would say all of them are successful, but CRM definitely stands out as being the most dominant one.\n\nWe mentioned that over 50% of new customers that are buying those new Work OS products are actually buying the CRM product. And just to mention, that all those new customers are basically new paying customers. So, we just opened it up as of now just for new customers. We haven't started [Technical difficulty].\n\nAll those products have a different price point, and, definitely, that's another upside that we take into account. We didn't put that into the model yet because it's still early days and small numbers, but definitely the momentum that we're seeing and the growth is very encouraging, very promising for the future. That's part of the reason why we're so excited about this.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nUnderstood. One question on for Eliran on billings. When we look at the sequential billings growth, it seems a little bit muted. I was wondering if you can tease out the FX impact on billings or if you're seeing any kind of a change in invoicing duration.\n\nAnd how should we think about billings going forward? Do you think it would lag revenue in the near term?\n\nEliran Glazer -- Chief Financial Officer\n\nSure. So, when we speak about calculated billings, we mentioned this is not the best measurement of our business. We believe revenue growth, customer growth, and NDR are the best indicators of the health of the business. Calculated billings were definitely impacted by the FX.\n\nIf you think about the fact that 30% of our ARR is in currencies that are not U.S. dollar name 10% euro, about 5% British pounds, [Technical difficulty] other currencies, definitely, it has impact on the calculated billings overall.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from Brent Bracelin from Piper Sandler. Brent, your line is now open.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGood morning, and great to see the momentum of the business and return to positive free cash flow. I want to double click into the CRM product, what's resonating with customers here on the product, is the profile of new customers changing? Is it a larger customer willing to spend more from a user perspective? Is it a smaller customer? Any color you could provide around the type of customer and what's resonating with that type of customer for the new CRM product would be great? Thanks.\n\nRoy Mann -- Co-Chief Executive Officer\n\nHi. This is Roy. So, yeah. So, I think CRM is -- we tapped into a new market.\n\nWe see new customers of a new kind, and we also see them comparing us to other companies that we were not compared to before. So, like Eran said, the type of customers that are joining us are completely new. It's like it's not existing customers. And so, obviously, they start off from like a different scale, they want different things.\n\nAnd this is very encouraging for us because it proves for us that monday is a true platform that has completely different products on it. And, obviously, CRM requests differ greatly from [Technical difficulty] the customers, email them, and, you know, manage the whole lifecycle of the customer. And one of the great powers that we see that customers buy into monday, in CRM, is its customerability. The fact that they can really do everything with it, and that they never hit a wall, that's something that a lot of -- it gives us a massive competitive edge compared to other platforms that they compare us to.\n\nHope this answer the question.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nHelpful color there, for sure. And then, I guess, Eliran, if you just think about sales and marketing efficiency, pretty dramatic improvement in just a two-, three-quarter period here. Can we just double click into kind of the drivers of it? Was there an element of lower CPM pricing that's helping here? Just walk through how you were able to drive such impressive improvement in sales and marketing efficiency? Thanks.\n\nEliran Glazer -- Chief Financial Officer\n\nHey, Brent. Yeah. So, in prior quarters and I think throughout the time that we gave, you know, the earning calls, we are operating in accordance with our playbook. And we said that we have the ability, due to BigBrain and efficiency metrics that we're operating, we have the ability to [Technical difficulty] in the performance market.\n\nSo, what happened in the last few days, because the market environment has become more challenging across the board, in general, so the cost per click or the cost per sign up is much lower today. Therefore, we are benefiting from that as we mentioned in the -- kind of in the beginning of the call. We have the ability to measure every campaign. Every campaign that we do, what is the return? Therefore, we were able to relatively quickly adjust the spend.\n\nIn addition, in H2, also we said that we are going to be more prudent on hiring and look at other discretionary costs that relates to marketing. So, altogether, this helped us to reduce the cost of marketing -- sales and marketing in general.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGreat to see. Appreciate the color. Thank you.\n\nOperator\n\nThank you. Our next question comes from Jackson Ader from SVB Securities. Jackson, your line is now open.\n\nJackson Ader -- SVB Securities -- Analyst\n\nGreat. Good morning. Thanks for taking our questions, guys. The first one, actually, if we can just follow up on that comment on hiring.\n\nYou've been rolling out a few more offices in the U.S., and I'm just curious what you're seeing in the labor market, whether it's a little bit maybe easier to hire some of the talent that you're looking for these days than it was say six or 12 months ago?\n\nEliran Glazer -- Chief Financial Officer\n\nHi, Jackson. It's Eliran. Yeah. You know, we don't see a much of a change.\n\nObviously, now when companies, there are unfortunately some reductions enforcing other companies, it's as if it's easier to hire people, but I don't -- not to tell you that this is a dramatic move because I think the good people are still working for this company. So, overall, I would say a lighter or more easier environment but not dramatically changed.\n\nJackson Ader -- SVB Securities -- Analyst\n\nOK. All right, that makes sense. And then the follow-up is on the European market. You kind of called out the struggles there.\n\nBut I'm curious whether you're seeing any maybe competitive impacts just in terms of a tough environment, maybe seeing some of the younger, smaller, more kind of start-ups received from the European market as it looks like it's going to be a tougher environment in the coming months?\n\nRoy Mann -- Co-Chief Executive Officer\n\nHey, Jackson. This is Roy. So, yeah, we definitely see less, and it's easier for us, compared to others, because of the stability of the platform, because of the fact that we mentioned a few times about the marketing and the fact that we are still out there, pushing the product. So, all in all, like for us, because of the stability of the company and the platform, we see it as a positive.\n\nAnd I would -- I can add that a lot of-- we were always -- like Eliran said with our playbook, while other companies spend way more, gave like different discounts, and those kinds of stuff -- and we don't see that anymore. So, I'd say that it's now easier for us to gain more market share.\n\nJackson Ader -- SVB Securities -- Analyst\n\nOK. All right. Thank you very much.\n\nOperator\n\nThank you. Our next question comes from Ittai Kidron from Oppenheimer. Your line is now open. Please go ahead.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThanks. And nice results. Eliran, in your prepared remarks, you talked about the decline in the net dollar retention rate, explaining it as initial lends are getting bigger. Can you give -- can you be a little bit more specific like what is an initial lend right now, and how did it change over the past year?\n\nEliran Glazer -- Chief Financial Officer\n\nSo, first of all, as a reminder, our net dollar retention rate is best in the industry. And we mentioned that, you know, over time, we are going to see a range. If you think about what we said this entire quarter, so we said that we believe that the right range will be around 145% to 150% for our customers with 50K in ARR. We said that we are going to remain around 135% for customers with 10-plus users, and between 120% to 125% for all customers.\n\nSo, there is the impact of, first of all, FX. You know, with 30% of the ARR coming from customers that are paying in non-dollar currency, obviously, your starting point is different from your ending point. This kind of impacted in few basis point our net dollar retention rate. And, obviously, in Europe, part of the macro economy environment is also, pending some customers are waiting decision- makers to, you know, waiting with decisions to kind of expand their usage of monday products.\n\nSo, the combination of these two is impacting net dollar retention rate. We don't expect any dramatic move, but this is the range that we feel comfortable with.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nOK. And then, Eran, can you talk about the competitive landscape? Has there anything changed in the past quarter? And maybe you could tie it into churn. Has anything in churn changed? Thank you.\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah, thank you, Ittai. This is Eran. So, I'll start with the second part of question. So, we didn't see anything meaningful of an impact to neither our churn or downgrade, which I think kind of ties to the stability that we've seen in our existing customer base.\n\nApart from FX, in terms of usage, we haven't seen anything significant. And, overall, I think -- just remind the first part of your question, sorry.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThe competitive landscape, anything on that front, any changes?\n\nEran Zinman -- Co-Chief Executive Officer\n\nOK. Yeah, I appreciate that. So, Roy mentioned this a little bit. So, in terms of marketing-wise, we don't -- we see that we're able to grab a larger market share.\n\nSome of the other competitors [Technical difficulty] avoid their marketing spend, which allowed us to grab a larger percentage. And also, this translates into the actual deals. And the deals that that we do see competition, which is only 30% -- 70% we will see still no competition. In the 30% that we do, we see less competitors.\n\nAnd also some of the competitors, which were very aggressive in terms of discounts became less aggressive. So, definitely, we see a momentum here where we're able to win more deals, in deals that we compete without [Inaudible]\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nGot it. Cool. Thank you.\n\nOperator\n\nThank you. Our next question comes from DJ Hynes of Canaccord. Your line is now open. Please go ahead.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, good morning, guys. Congrats on the nice results. So, at the Elevate event, you guys spent some time talking about infrastructure upgrades, you know, that should improve scalability. I'm wondering if you could just unpack that a bit.\n\nLike what were the big changes? What should that enable you to do? Any color on that front would be helpful?\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah. Thanks for the question, DJ. This is Eran. So, yeah.\n\nDefinitely, this is something that we've worked really hard on within the last six months, and we continue to heavily invest. I think part of our scale as a company, we attracted larger customers, and also our existing customers are really scaling their operation on monday. Part of it presents some challenges in terms of handling large and large data sets, improving performance, and keep improving on what they are using on. So, definitely it's a very positive trend that we're seeing, but at the same time, we need to -- we're constantly improving performance, speed, scalability.\n\nSo, definitely something we're putting a lot of focus on [Technical difficulty]\n\nOperator\n\nMy apologies. We are having some audio issues. Please hold as I find a solution.\n\nEran Zinman -- Co-Chief Executive Officer\n\nHey, can you hear us?\n\nOperator\n\nThank you for your patience. We have reestablished connection with the speaker team. DJ, if you could just repeat your question, your line is now open. Hi, DJ, your line is now open.\n\nPlease go ahead.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, guys. Can you hear me now?\n\nOperator\n\nYeah, we can hear you. Thank you.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nAwesome. All right. So, I think, Eran, you were talking about some of the infrastructure upgrades, kind of the improved scalability, you know, what the big changes were, what that enabled you to do. Any color along those lines will be helpful.\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah, thanks, DJ. Hopefully, you can hear me fine now.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nGot you now.\n\nEran Zinman -- Co-Chief Executive Officer\n\nSo, as I've said, what changed was that our customers have grew larger into our operation with the monday scale, their usage, their data sets. And apart of that, we also scaling in our own infrastructure, because we want to deliver an optimal experience for our customers. So, definitely, we put in a lot of effort over there. We see our customers using monday more and more over time, which is very encouraging.\n\nBut we wanted to have a seamless experience doing that and don't suffer from any performance or scalability issues. So, we've done a lot of changes and improvement, and we're committed to do that in the upcoming quarters.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nGot it. And then, maybe a follow-up, Eliran, just on the sales and marketing line. Can you remind me how much of that line item is people-based versus maybe more discretionary spend that you can flex up and down on the ladder, kind of what's the strategy in the current environment?\n\nEliran Glazer -- Chief Financial Officer\n\nHey, DJ, sure. So when you think about the [Technical difficulty] around 30% to 35% is performance marketing, and about 65% is payroll and related for sales, customer success, partners, headcount, and related. So, all in all, if we would like to adjust sales and marketing costs, we would relatively adjust the performance marketing. And, therefore, we are able to do quick wins if need based on our efficiency metrics.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYeah, perfect. Thank you, guys.\n\nRoy Mann -- Co-Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Derrick Wood of Cowen & Company. Derrick, your line is now open. Please go ahead.\n\nUnknown speaker\n\nHey, guys. Thanks. It's Andrew on for Derrick. Just one for me actually.\n\nWhen are you planning to open up the suite to existing customers? And can that be an incremental growth lever early next year? Thanks.\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah, thanks for the question. This is Eran. So, we're definitely going to do that in the upcoming future. But right now, we're focused on keep iterating on the product and improving it.\n\nWe get a lot of interest from existing customers about the new products. And once we feel they're mature enough, we'll definitely open them up for our existing customers. We see a great opportunity for a cross sell and upsell for existing customers. Many of them are using monday [Technical difficulty].\n\nSo, there's a lot of upside take into that opportunity, but we want to do it in a proper way. And as I mentioned, we have already seen great momentum from new customers, so we keep improving and iterating on those products.\n\nUnknown speaker\n\nGreat. Thanks. Congrats on the quarter.\n\nOperator\n\nThank you. Our next question comes from Fred Lee of Credit Suisse. Fred, your line is now open.\n\nFred Lee -- Credit Suisse -- Analyst\n\nHi, very nice quarter, particularly the enterprise customer adds and margin improvement. You've already touched on parts of this, but I was wondering if you could talk more deeply about your -- how your go-to-market strategy is changing as companies are going to cut costs? And also how is the focus of the conversation changing at your larger customers? Thank you.\n\nEliran Glazer -- Chief Financial Officer\n\nYeah. So, the first part of the question regarding cost cutting, so a lot of companies, as you mentioned, are now kind of going through their SaaS stack or reevaluating the tools that they're using. But for us, we mentioned this in the previous quarter, and, definitely, we see this trend increase. This presents a great opportunity.\n\nA lot of companies are looking into consolidation of factors that they're using. And monday is really built from the bottom up for that purpose because every customer uses monday for many use cases. Some of them are kind of reevaluating the tools they're using and thinking about moving their operation to monday. Some of them already did.\n\nWe also did an operation within the company where we kind of guided our entire customer success team and sales team to offer that proactively for our new customers. And we also see success momentum there. So, it's hard to tell how much this will scale over time. But, definitely, we've seen customers doing that.\n\nAnd monday, as I mentioned, it's a great platform to do that. So, there's definitely an opportunity there.\n\nRoy Mann -- Co-Chief Executive Officer\n\nYeah. And hi. It's Roy. I would add that like on the churn side, we see a lot of stability within our customer base.\n\nSo, you know, we talked to the platform and how much it's a core for many of our customers.\n\nEliran Glazer -- Chief Financial Officer\n\nAnd I think we missed your second part of the question, Fred, if you can you repeat that.\n\nFred Lee -- Credit Suisse -- Analyst\n\nSure. The second part was just how the focus of conversations is changing at your larger customers, if at all? Thank you.\n\nRoy Mann -- Co-Chief Executive Officer\n\nYeah. Hi, it's Roy. So, it's definitely a different conversation in terms of like the length of when we talk to new customers, the length it takes to create -- to close a deal, the number of people involved, and those kind of things are happening now. I think for a lot of us, around the world, there are lot of companies, and we see that definitely as something that companies are looking into and like changing how they acquire new tools.\n\nFred Lee -- Credit Suisse -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from Andrew DeGasperi from Berenberg. Andrew, your line is now open.\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nThanks for fitting me in. I guess my first question and a follow-up to DJ's earlier on performance marketing versus sales headcount, I was just wondering, the 35% number, what is it typically, I guess, what historically has been? And I guess how should we expect it going forward? Would it be at this level, or do you think it will ramp up?\n\nEliran Glazer -- Chief Financial Officer\n\nHey, Andrew, it's Eliran. So, historically, if you look at Monday, five years ago, and I think I mentioned it in the past, it was an 80% to 90% performance marketing. But over time, we introduced a sales-lead organization and that included salespeople, partners, customer-success managers, and obviously the marketplace. Over time, I think that we care a lot about the performance marketing.\n\nIt generates leads. It gets us to new audiences. It brings a lot of traffic, a healthy traffic, I would say. And, you know, if we continue to operate in accordance with our playbook, I would say that 30%, by and large, will continue to be -- it can be 25, it can be 32.\n\nBut around 30% will continue to be performance marketing as long as it meets our efficiency criteria. In addition to that, we'll continue to invest in bringing headcount for our enterprise accounts, midtier and SMB. So, I would say 25/30, 65/70, you know, break down.\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nThat's helpful. And then, in terms of your referral partners, I saw it jumped sequentially. I just wondered, are you doing anything different there? Should we expect that continued momentum?\n\nRoy Mann -- Co-Chief Executive Officer\n\nYeah. So, we do invest in our partner ecosystem, definitely growing and expanding. I would say departments are a little bit more affected by the headwinds that we see in Europe because most of them are not based in the U.S. So, our partner [Technical difficulty] footprint.\n\nBut for us, as we mentioned, it's a strategic part of growing our business. It's great way to go to markets and territories. And we continue to scale and grow there and also not just with referrals but also with kind of larger, more strategic partners that we partner with over time. So, for us, it's a great in those market and expansion options for our audience across the globe.\n\nAnd will continue to [Technical difficulty]\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nThat's helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from a Scott Berg of Needham. Scott, your line is now open.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Congrats on the great quarter, and thanks for taking my questions. I guess I have two quick questions here. And the first one, how are your top and funnel activities today in the current macro versus maybe what you saw three months ago to start Q3 or even six months ago to start Q2?\n\nRoy Mann -- Co-Chief Executive Officer\n\nHi, Scott. It's Roy. So, you broke up for a second. Like you were talking about the funnel that we see, like customer funnel?\n\nScott Berg -- Needham and Company -- Analyst\n\nYeah, just top of customer funnel activities in terms of maybe the size or complexity today versus last two quarters?\n\nRoy Mann -- Co-Chief Executive Officer\n\nYeah. So, like we mentioned, it's very healthy. We still see the same volume, and we keep, you know, with our efficiency metrics like gain more market share by adding more customers. The sales cycles have been longer in that respect, but we see a lot of quality customers' still strong demand for the platform across the board.\n\nSo, it's very stable.\n\nEran Zinman -- Co-Chief Executive Officer\n\nAnd maybe, Scott, this is Eran. Already, you can see in our shareholder letter, we actually attached the graph that shows the growth in new accounts and also shows the performance marketing. But as we mentioned, our top funnel remains very stable even though that in terms of efficiency, we managed to spend less in order to acquire those customers is what we mentioned. But it's very important for us to convey that we, in greater efficiency, managed to acquire a fair amount of customers over time. \n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. The last question for me is your enterprise growth is -- was very strong again in the quarter. How much of that growth is coming from new initial lends versus expansions from those types of customers today? And how do you expect that to maybe trend over the next couple of quarters as a result?\n\nEliran Glazer -- Chief Financial Officer\n\nHi, Scott. It's Eliran again. I think it's both. It is -- we're lending with the new products that we have, the CRM and other multiple use cases that we -- that are being part of our platform.\n\nSo, we lend customers. So, it's a combination of new customers and expansion of existing customer.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. Thanks for taking my questions.\n\nOperator\n\nThank you. Our next question comes from Jason Celino of KeyBanc Capital Markets. Jason, your line is now open.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nGreat, thanks for fitting me in. Really great results here. When you mentioned in a prior response, September and October, you started to see some softness spread. Looks like you're managing through this quite well, but to what magnitude can you clarify, and if it was more SMB, and if any regions are worth calling out? Thanks.\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah, Jason, this is Eran. Yes. So, as we mentioned [Technical difficulty] headwinds and all this that we saw in Europe, I wouldn't say it has any significant impact on one particular group, neither SMBs or larger enterprise. I would say it's kind of across the board.\n\nBut definitely, enterprise customers are a bit more stable or kind of don't see any kind of more major impact compared to SMBs. But overall, we're very diverse in terms of our customer base. Many industries -- as a reminder, only 30% of our customers are tech companies, 70% are non-tech. And we have over 200 different business verticals.\n\nBut all in all [Technical difficulty] given our existing customer base, but we don't see any kind of major group that's been affected more than any other group.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nGreat, thanks.\n\nOperator\n\nThank you. Our next question comes from Robert Simmons of D.A. Davidson. Robert, your line is now open.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nHey. Thanks for taking the question. So, I was looking at the marketplace, you now have 186 apps there, and I think about 20% are monetized. I guess, what's a reasonable expectation for the boost revenue you guys see from that next year? Are we getting closer to 1%, or could it be more meaningful than that?\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah, hi. So, I think like we're not going to -- we're not relying for next year on the marketplace revenue as something that we build any of our models on. And, you know, it's something that we just released not so far behind in time and the monetization of it. And I wouldn't build on that, although we do see a strong momentum.\n\nThere are a lot of interest from developers and it's very healthy. And we do see the future of monday being as an open platform and providing a lot of like third-party developers building on us great things. So, we are excited about it, but we didn't model next year with the marketplace.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nGot it. Ok. And then the decline of net rotation, how much of that is purely from FX, and how much is it from other factors like longer and slower sales cycles?\n\nEliran Glazer -- Chief Financial Officer\n\nSo, hi, Robert. it's Eliran. I would say 2% to 3%, by and large, is coming from FX, and the rest is the macro economy environment.\n\nEran Zinman -- Co-Chief Executive Officer\n\nAnd I would also add the increasing -- it's really -- like I would also add the increasing deal size initially. Like as we ramped up the sales team, and we got better and better, the initial deal size grew. Obviously, like in the past, they started with --\n\nEliran Glazer -- Chief Financial Officer\n\nLend bigger.\n\nEran Zinman -- Co-Chief Executive Officer\n\nSelf-serve motion. OK, they started very small, and so, the NDR ended somewhere. And then, we have -- as the brand grow and customer demand grew, like they want initial deal sizes that are bigger. And that also has an effect on the NDR.\n\nOperator\n\nThank you. Our next question comes from Shebly Seyrafi from FBN Securities. Your line is now open. Please go ahead.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nYes, thank you very much. So, I noticed that your headcount growth slowed to like 53 from over 200 the prior two quarters. I want to know whether there has been recently a deliberate decision to slow down headcount growth. And separately or related maybe, if your expense growth for Q4 seems to, you know, relative to your guidance, imply an acceleration in year-over-year growth versus Q3.\n\nAnd so, it seems to me that your R&D line is going to accelerate. Is that true, and if so, why is it accelerating so much?\n\nEliran Glazer -- Chief Financial Officer\n\nHi, Shebly. it's Eliran. So, welcome on board. With regards to your first question, in prior quarters we mentioned that we are going to hire most of the people in H1 frontloaded of expenses because we believe this is what would drive revenue into 2022 and the rest of the year.\n\nAnd we mentioned that we are going to be more prudent and have a more moderate hiring in H2. We are continuing to hire in places where it's really important for us to continue to innovate R&D. So, that R&D went up from 17% as percentage of revenue to 19%. And we also will continue to focus on revenue-generating headcount.\n\nSo, this is with regards to your first question. Your second question, I wasn't sure that you said accelerating top line. Just to make sure that that I understood the question.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nNo. I'm getting in my model that your R&D expense growth is going to be something like 100% in Q4 versus 84% in Q3. Is that right? Is directionally that correct? And if so, why are you going to be accelerating your R&D expense growth?\n\nEliran Glazer -- Chief Financial Officer\n\nR&D -- yeah. So, I think if I understood you, so we continue to invest, as I mentioned, in R&D. Bear in mind that there is also -- most of the hiring of R&D is in Israel. So, there is the FX impact which also impacts [Technical difficulty] It is a bulk of significant -- you know, significant part of our costing.\n\nSo, just to make sure that they understand, I believe this will cover your question.\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from Jake Roberge from William Blair. Jake, your line is now open.\n\nJake Roberge -- William Blair and Company -- Analyst\n\nHey. Thanks for taking my questions, and congrats on the quarter. Following up on the product side solutions, it's great to see the strong adoption here, and appreciate the color on CRM. But once you open those solutions to the existing base, how do you think that monetization path will work given a number of those customers may already be using some type of CRM template that you released a year or two ago?\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah, Jake, thanks for the question. This is Eran. So, the new product that we released, they provide much more value than a template. Basically, what we've done as far as those products is to go very deep future-wise in each one of those products.\n\nWe added a lot of functionality, a lot of this is proprietary to specifically CRM or developer tools. So, it's not just templates or boards or dashboard package for that purpose, but a lot of R&D effort has gone into that. So, I think already, new customers are getting a lot of value from that, and I'm sure that already -- that also existing customers will get a lot of value from [Technical difficulty]. Part of that is that we will help them -- for those who want to move, we'll build the migration tool that will help them try the new products, but [Technical difficulty] we'll soon focusing on [Technical difficulty] And overtime, we'll start offering those new Work OS for existing ones.\n\nAnd as I said, we see a lot of potential there.\n\nJake Roberge -- William Blair and Company -- Analyst\n\nGreat. That's really helpful. And then seems like growth in the partner channel is really starting to accelerate for both referral partners and the apps marketplace. Are there any specific product-type solutions that you've seen partners prioritize in the sales process or really build more tailored solutions on top of the platform?\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah. So, this is Eran again. So, apart from extending our global workforce in terms of offering kind of more opportunities for sale of our products worldwide, both partners also offer the ability of customers to customize their product, help them onboard, help them build more workflows and processes. So, probably that also drives the growth in each one of those territories.\n\nSo, we really see them as a value -add partner. So, definitely that's something that's really kind of help with acceleration. And as I said, we're continuing to invest heavily into those partners. And overtime, I think it will continue and grow.\n\nJake Roberge -- William Blair and Company -- Analyst\n\nGreat. Thanks for taking my questions, and congrats on a great quarter.\n\nOperator\n\nThank you. Our final question for today comes from Brent Thill of Jefferies. Brent, your line is now open. Please go ahead.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks. Just a question on some of your deployments. I think in the past, you've talked about one of your larger customers was pushing over 7,000 seats. Are you starting to see the 10,000-plus seat deals open up, or are you still -- is that 7,000 seats still the largest deployment you have right now?\n\nEran Zinman -- Co-Chief Executive Officer\n\nYeah. So, this is Eran. So, definitely overtime, we're increasing our -- we work -- we really kind of work in a sweet-spot fashion, meaning that we keep increasing the average enterprise deal size. Up until a year ago.\n\nit was around 2,000 seats. We increased it to 5,000. That means that we're able to close those deals quicker and quicker. And, basically, we continue to improve the product as the offers do scale the operation, and we expect this number to increase.\n\nWe see this more of a way for us to create an organic sales motion within our sales team as opposed to specific customer that we had before in terms of landing a very large deal.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nByron Stephen -- Director, Investor Relations\n\nRoy Mann -- Co-Chief Executive Officer\n\nEran Zinman -- Co-Chief Executive Officer\n\nEliran Glazer -- Chief Financial Officer\n\nSteven Enders -- Citi -- Analyst\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nJackson Ader -- SVB Securities -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nUnknown speaker\n\nFred Lee -- Credit Suisse -- Analyst\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nShebly Seyrafi -- FBN Securities -- Analyst\n\nJake Roberge -- William Blair and Company -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nMore MNDY analysis\n\nAll earnings call transcripts"
}