{
  "companyName": "Canopy Growth Corp.",
  "companyTicker": "CGC",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/canopy-growth-corp-cgc-q2-2023-earnings-call-trans/",
  "content": "Canopy Growth Corp. (CGC 1.32%)\nQ2 2023 Earnings Call\nNov 09, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. My name is Michelle, and I will be your conference operator today. I would like to welcome you to Canopy Growth's second quarter fiscal 2023 financial results conference call. At this time, all participants are in a listen-only mode.\n\nI will now turn the call over to Tyler Burns, director, investor relations. Tyler, you may begin your conference call.\n\nTyler Burns -- Director, Investor Relations\n\nGood morning. Thank you all for joining us. On our call today, we have Canopy's chief executive officer, David Klein, and Chief Financial Officer Judy Hong. Before financial markets open today, Canopy issued a news release announcing our financial results for our second quarter ended September 30th, 2022.\n\nThis news release is available on our website under the Investors tab and will be filed on EDGAR and SEDAR. We have also posted a supplemental earnings presentation on our website. Before we begin, I would like to remind you that our discussion during this call will include forward-looking statements that are based on management's current views and assumptions and that this discussion is qualified in its entirety by the cautionary note regarding forward-looking statements included at the end of this morning's news release. Please review today's earnings release and Canopy's reports filed with the SEC and SEDAR for various factors that could cause actual results to differ materially from projections.\n\nIn addition, reconciliations between any non-GAAP measures to their closest reported GAAP measures are included in our earnings release. Please note that all financial information is provided in Canadian dollars unless otherwise noted. Following remarks by David and Judy, we will conduct a question-and-answer session. We will first address questions uploaded by verified shareholders.\n\nFollowing that, we will take questions from analysts. To ensure that we get to as many questions as possible, we ask analysts to limit themselves to one question. With that, I'll turn the call over to David. David, please go ahead.\n\nDavid Klein -- Chief Executive Officer\n\nGood morning and thank you for joining our call. Before I get underway, I'd like to acknowledge the results from the midterm election yesterday. With two additional states voting to legalize cannabis last night, we're seeing continued momentum for reform. And while the overall results of last night are not yet fully clear, what is abundantly clear is that Americans continue to demand access to legalize cannabis.\n\nThe bipartisan appeal of cannabis cannot be overstated, and I hope the results of these midterms will further push the Senate to act swiftly on cannabis reform during the lame-duck period and fully unlock this once-in-a-generation opportunity across the nation. Moving back to our earnings, today, I'll speak to Canopy's progress against our strategic priorities and discuss the transformational strategy we recently announced to fast-track entry into the U.S. cannabis market through Canopy USA. Following my remarks, Judy will review our Q2 results, provide an update on our path to profitability, and comment on our short-term outlook.\n\nOur second quarter marked an inflection point for Canopy, demonstrating momentum across our key businesses and accelerating our entry into the U.S. cannabis market as we seek to seize the generational opportunity ahead of us. Q2 highlights included, in Canada, we stabilized business revenues, improved cash margins, and continue to make progress on our path to profitability. This has been achieved amid persistent industrywide challenges, as well as an increasingly difficult macroeconomic backdrop.\n\nIn our CPG business, BioSteel delivered another record quarter with very strong sequential growth. And we continue to pursue cost savings while driving focus in our business, as evidenced by the announcement that we are divesting our Canadian retail operations. Now, to provide more detail. In Canada, our efforts to premiumize our portfolio delivered a positive mix shift despite continued market fragmentation.\n\nDuring the second quarter, our Canadian adult-use B2B premium and mainstream sales accounted for a combined 58% of sales, up from 56% last year. This showcases our resilience in a market challenged by labor and supply chain disruptions in three of the largest provinces: Quebec, Ontario, and British Columbia. I'd like to take a moment to highlight our performance in the very competitive premium flower and pre-rolled joint, or PRJ, segment. Supported by the recent launch of Doja OG Deluxe Flower and PRJs, our Doja brand increased market share by two basis points versus Q1 FY '23 to 2.4%.\n\nWe're also encouraged by the demand for our new 7ACRES flower and infused PRJs that have recently entered the market. Next, in the mainstream flower and PRJ segment, our Tweed brand increased share during the quarter, helped by strong demand for new Tweed-branded Kush Mints and Wedding Cake Flower. We're looking forward to introducing additional exciting new products in the second half of our fiscal year. We continue to focus on operational changes in our cultivation, as well as post-harvest processes and genetics that are driving higher THC percentages and improved quality.\n\nWe're selling products into the market that allow for additional consumer choice like enhanced colors and distinct terpene profiles. This is a result of listening to our consumer feedback. Prime examples are the recently launched Tweed Lemon Kush, which is garnering positive comments for its flavor, and the vibrant purple color of our new 7ACRES Purple Pancakes that has received high praise. In the current quarter, we pushed the envelope with the launch of our Ace Valley sex gummies, Lust and Thrust.\n\nWe're encouraged by the initial market response to these gummies, which represent the capabilities of Canopy's insights, product development, and marketing functions. There was a clear gap in the market and a natural fit for our focus on cannabis products tailored to specific-needs states. As proof, these new gummies sold out at ocs.ca in the first week of sales, leading to an immediate reorder with expedited delivery as the OCS anticipates high demand. We also continue to support our quality products with investments in our commercial ground game in Canada.\n\nI've previously highlighted the investments we're making in our budtender engagement program, High'er Education, which, in its first year, has facilitated over 10,000 interactions focused on education and product knowledge. Additionally, our commercial team continues to engage with retailers across the country, which led to strong distribution gains for our top new flower, PRJ-based, and edible products hitting the market in the current quarter. As a result of the divestiture of our retail operations, we've reduced channel conflict, which has created an opportunity to work with over 100 additional stores. It's our expectation that our Canadian adult-use B2B cannabis business will continue to show improvement in the second half of fiscal 23 due to ongoing innovation and distribution drives.\n\nClosing out our Canadian cannabis business, in Q2, our Canadian medical revenue grew 8% year over year, driven by expanded product offerings. Next, I'll speak to progress in our CPG portfolio. First, BioSteel delivered another record quarter in Q2, helped by strategic investments that have driven distribution and velocity gains. This resulted in nearly 30 million in revenue in the quarter, which represents sequential quarterly and year-over-year growth of 67% and 299%, respectively.\n\nIn the first half of fiscal '23, BioSteel secured distribution with major retailers including Walmart, Rite Aid, and Winn-Dixie. This has helped increase ACV to 34% in the U.S., which represents a sequential increase of 520 basis points according to IRI data for the 13 weeks ended on October 2nd. Now moving to Canada. BioSteel is seeing strong market share growth.\n\nAccording to Nielsen data covered -- covering the convenience and gas channel, for the four-week period ended October 8, BioSteel's share of isotonic beverage sales in Ontario reached 11.2%, representing an increase of 630 basis points versus the prior year. BioSteel's share nationally was 7.4%, which is 450 basis points higher than the prior-year period. A homegrown Canadian brand, BioSteel was born in an NHL locker room and resonates with athletes from across the country. This is a blueprint for the growth that we're starting to see in the United States with a multiyear partnership that names BioSteel as the official hydration partner of the National Hockey League and the National Hockey League Players Association.\n\nThe partnership provides BioSteel with ringside marketing, product supply, and retail activation rights, as well as community engagement platforms. If you watch hockey, the brand is highly visible on and off the ice, and we've secured several distribution agreements in the US as a result. We anticipate additional growth for the brand as the hockey season continues and athletes, both professional and aspiring, enjoy the benefits of clean, healthy hydration courtesy of BioSteel. Earlier this morning, BioSteel completed the acquisition of a manufacturing facility in Verona, Virginia.\n\nThe acquisition of the facility from the brand's existing contract manufacturer will support the rapid growth strategy and expansion of U.S. footprint for BioSteel. This is a natural next step for the brand and creates additional business value as BioSteel continues its ascent to the top of the sports hydration category. Looking to Storz & Bickel, sales were flat when excluding foreign exchange effects, which is an improvement versus the trend established in the first quarter of fiscal '23.\n\nWith this said, we are steadfast in our view that S&B has a strong platform for growth given the brand's global reputation and highly premium positioning. As recreational and medical consumers continue to look for the highest-quality vaporizers available, we look forward to bringing additional Storz & Bickel innovation to market in the future. As you can see, the momentum is building in our Canadian cannabis and CPG businesses, and I believe we're at an inflection point as we look toward our next phase with Canopy USA. Firstly -- or frankly, I think Canopy USA represents a pivotal moment in the history of Canopy Growth as we expect to fast-track our entry into the U.S.\n\ncannabis market by bringing together Acreage Holdings, Jetty Extracts, and Wana Brands under the umbrella that is Canopy USA. We expect the closing of the acquisitions by Canopy USA will be -- will meaningfully enhance Canopy's growth and profitability over time once Canopy USA closes the announced acquisition of Acreage, Jetty, and Wana. In terms of next steps, we are appreciative that the CEO of TMX Group, the owner of the TSX, has publicly indicated support for our plans, and we remain committed to continuing dialogue with our partners at Nasdaq. Additionally, we anticipate receiving comments from the SEC on our preliminary proxy statement.\n\nHowever, we expect to be on track to hold our shareholder vote in early calendar 2023. In summary, Canopy USA is expected to accelerate growth and market expansion through the creation of a leading house of brands, capitalizing on a once-in-a-generation opportunity as we fast-track our entry into the U.S. cannabis market. Q2 marked the key inflection point for Canopy as we continue to drive innovation, distribution, focus, and efficiency in our Canadian business.\n\nAs BioSteel blazes a path forward in the sports hydration category and as our Canopy USA strategy progresses, we've taken destiny into our own hands to rapidly achieve profitable growth. With that, I'll turn it over to Judy.\n\nJudy Hong -- Chief Financial Officer\n\nThank you very much, David. And good morning, everyone. My comments will focus on, one, a brief summary of our second-quarter results; two, a review of new segment reporting that we have introduced this quarter and the performance of those segments; three, an update on our path to achieve profitability; and four, some perspectives on the balance of our fiscal '23 outlook. Let's start with a review of our second-quarter fiscal '23 financial results.\n\nIn Q2, we generated net revenue of 180 million, representing a 10% decline over the prior-year period. When adjusting for both the impact of C3 and the impacts of our Canadian retail business, which we are divesting, revenues increased 2%. Sequentially, net revenues increased 7% compared to Q1. Revenue highlights include BioSteel delivering another record quarter, nearly quadrupling its revenue versus the prior-year period; our Australian cannabis business having its sixth quarter in a row of record revenues; and our Canadian cannabis business delivered a second consecutive quarter of stable revenue despite the impacts of labor disruptions in Quebec and British Columbia, as well as the supply chain disruptions at the OCS in Ontario.\n\nGross margins and adjusted EBITDA have improved significantly year over year, driven by lower inventory charges in the current period as compared to the prior year, as well as the impact of our cost savings initiatives announced in April. Our SG&A expenses, excluding acquisition costs, declined by 10% year over year even as we significantly increase our investments in BioSteel with new initiatives like the NHL partnership. Free cash flow improved modestly on a sequential basis as compared to Q1. Now, following the completion of certain restructuring actions tied to our cost savings initiatives announced in April, which were aligned with our strategic review of our business, we have changed the structure of our internal management reporting.\n\nAccordingly, in the second quarter, we're reporting our financial results for the following five reportable segments: one, Canada cannabis; two, rest of world cannabis, which includes U.S. CBD business; three, Storz & Bickel; four, BioSteel; and five, This Works. These segments reflect how our operations are managed with the performance of these segments evaluated with a focus on segment net revenue and segment gross margin. Accordingly, we are now including these metrics in our financial reporting for the first time this quarter.\n\nCanada cannabis revenues declined 27% compared to the prior-year period, yet were stable sequentially compared to Q1 and Q4. We grew our Canadian medical revenue by 8% versus Q2 of last year. Our adult-use B2B revenue declined 40% year over year and declined 5% compared to the prior quarter. We estimate that the labor strikes in British Columbia and Quebec, as well as the cyberattack impacting the OCS, negatively impacted our Canadian adult-use revenue by approximately $2 million during Q2.\n\nCanada cannabis adjusted gross margin was a negative 15% in Q2 as margins continued to be negatively impacted by under-absorption of fixed costs and price compression, offsetting improved product mix and cost savings initiatives. Excluding depreciation and certain noncash inventory charges and the impact of Canada employment wage subsidy program, which was zero during Q2 of this year, normalized cash gross margin for Canada cannabis improved to 16% from 7% in the prior period. In the rest-of-world cannabis segment, revenues, excluding C3, experienced a modest decline year over year as strong growth in Australia was offset by a decline in the US CBD business and the impact of shipments to Israel. We have previously referred to bulk sales to Israel as opportunistic, and the current quarter did not have any shipments to Israel.\n\nAdjusted gross margin, adjusting for inventory charges related to U.S. CBD, was 23% in the current period, down from 46%, in part driven by the C3 divestiture. BioSteel delivered its second quarter in a row of record revenues, increasing 299% as compared to the prior-year period and 67% compared to Q1. Gross margins for BioSteel improved from a negative 5% in the prior-year period to 15% in the current period, with the improvement due to higher revenue, increasing operating leverage, and improvements to supply chain operations.\n\nAdjusted gross margin was 26% after adjusting for certain nonrecurring contract manufacturing costs. Storz & Bickel revenues decreased 7% as compared to the prior-year period due in part to the impact of the weakening euro in relation to the Canadian dollar. On a constant-currency basis, Storz & Bickel revenue would have been approximately 1 million higher or stable versus the prior-year period. We are seeing cautious consumer spending in an uncertain inflationary environment in select European markets.\n\nAnd we also continue to see headwinds from distributors and ongoing supply chain challenges. That being said, we are seeing strong growth in markets like Australia, and our direct-to-consumer sales in the U.S. remains resilient. Gross margins for Storz & Bickel also increased to 44% from 37% in the prior-year period.\n\nThis Works revenue decreased 24% in the current period compared to the prior year due to foreign exchange headwinds, with the pound weakening significantly relative to the Canadian dollar and slower consumer spending impacting demand for discretionary items. On a constant-currency basis, This Works revenue declined 12% versus the prior year. Adjusted gross margin in the current period is 49%, an improvement over the prior year due to product mix and less discounting activities. Adjusted EBITDA in Q2 on a consolidated basis amounted to a loss of 78 million.\n\nThis was an $85 million improvement in adjusted EBITDA loss versus Q2 of fiscal '22, primarily driven by the improvement in gross margin. We note that last year's adjusted EBITDA included 87 million in inventory write-offs. Now normalizing for the disposition of C3, the impacts of the Canada employment wage subsidy program and the inventory write-off, adjusted EBITDA in Q2 FY '23 would have improved by $20 million on a year-over-year basis. Relative to Q1, adjusted EBITDA loss widened by 3 million, which was entirely driven by increased marketing investments behind BioSteel.\n\nI'd like to now provide an update on the efforts underway to improve our profitability. On a consolidated basis, gross margin improved in Q2 versus the prior year and sequentially versus Q1 as we continue to improve our product mix in Canada cannabis segment and execute on our cost savings programs, where we have committed to delivering savings of 30 million to 50 million in cost of goods sold. While the majority of these savings are expected to be recognized in the second half of fiscal '23 and into first-half fiscal '24, we did achieve $8 million of savings in Q2, primarily relating to headcount reductions, more efficient procurement activities, and supply chain improvements. To date, the cost savings programs have realized over 11 million of the expected 30 million to 50 million in cost savings.\n\nIn addition, as David mentioned, BioSteel acquired a manufacturing facility in Verona, Virginia, which will enable BioSteel to bring production of its ready-to-drink beverages in-house. This is expected to improve BioSteel's gross margins closer to that of similar premium beverages over time. The other key initiative is reducing our SG&A expenses, where, in April, we announced that we have undertaken actions that we expect will reduce our SG&A expenses by 70 million to 100 million over the next six -- over the next 12 to 18 months. Our selling, general, and administrative expenses in the second quarter were flat versus prior year, which includes 12 million a year -- year-over-year increase in acquisition costs.\n\nAdjusting for the impact of the acquisition costs, the disposition of C3, which contributed 3 million to SG&A in Q2 of fiscal '22, and the impact of the payroll subsidy benefit, which positively impacted SG&A by 11 million in Q2 fiscal '22 and zero in Q2 of fiscal '23, SG&A expenses in the second quarter decreased by 15% or 20 million year over year. This 20 million savings is a net of the impact of wage inflation, as well as incremental sales and marketing investments in BioSteel, including the activation of the NHL partnerships, which took effect in Q2 fiscal '23. To date, the cost savings program has reduced SG&A expenses by approximately $36 million even as we have increased our investments in key growth initiatives. At the end of Q2 of fiscal '23, we announced the divestiture of our retail operations in Canada.\n\nThe operational savings from this step are expected to result in projected SG&A cost savings being closer to the high end of the annualized 70 million to 100 million target range. Pressing forward on our path to profitability, we continue to evaluate opportunities to bring additional focus to our Canadian cannabis operations, including portfolio optimization, with a focus on streamlining our SKU count as we continue to premiumization portfolio and further tighten our focus; capturing additional efficiencies across our operations and reducing costs; and applying focus and discipline to our overall SG&A costs with an eye toward variablizing spend where feasible to match spend with business levels. Let me now spend a few minutes on our cash flow and balance sheet. Our free cash flow in Q2 was an outflow of 135 million.\n\nThis comprised of cash outflow of operation of 133 million, which includes 41 million in interest payments in the quarter. Q2 capex came in at 2 million, significantly lower compared to the prior-year period. For the full year 2023, we now estimate capex to be in the range of $10 million to $20 million. In conjunction with our Canopy USA announcement, we announced two major steps we're taking to improve our balance sheet and reduce our cash interest expenses.\n\nFirst, we have entered into an agreement with certain of our lenders, under which Canopy will tender approximately USD 187.5 million of the outstanding term loan at a discounted price of $930 per thousand. The first half of the paydown will occur during this quarter. In addition, no earlier than the following the creation of the Canopy Growth exchangeable shares, we intend to negotiate an exchange agreement with affiliates of Constellation Brands to purchase for cancellation up to $100 million principal amount of our unsecured senior notes due July '23 in exchange for additional Canopy shares. These actions, plus the partial exchange transaction of our unsecured senior notes that took -- that took place in July, are expected to reduce our overall debt position by nearly $600 million.\n\nWe remain committed to further enhancing the strength and financial flexibility of our balance sheet and improve our cash burn while continuing to pursue growth investments and other strategic initiatives. Our balance sheet remains strong with a $1.1 billion of cash at hand at the end of Q2 and USD 2 billion of base shelf available. Let me now provide some perspective on our balance of fiscal '23 outlook. First, we expect continued year-over-year growth from BioSteel in the second half as the team builds on the growth in the first half with increased marketing investments, driving gains in sale velocity and distribution.\n\nOn a sequential basis, we expect Q3 to be slightly down versus Q2 with a stronger Q4 based on the timing of shipments. Our Canadian adult B2B business is expected to show continued improvement as a benefit from our premiumization strategy and new product launches. However, we expect some choppiness in the near term as we work through our portfolio optimization strategy. Our rest of the world cannabis segment is expected to show year-over-year growth in medical sales in Germany, Australia, and other international markets, while sales to Israel are expected to be minimal in the back half of the year.\n\nWhile the distributor challenges and economic conditions in the first half created some headwinds for Storz & Bickel, we are seeing improved US distribution in the third quarter, which we expect will drive sequential growth in the second half of the year though prior-year comparisons will be challenging to repeat. I'd also note that with the disposition of the Canada retail operation has already seen 10 locations closed, which will begin to impact the Canada retail revenues starting in Q3. Second, we expect the balance of fiscal '23 to show continued progress in our profitability with expectation of this year being a transition year as we work toward profitability, building on the cost structure improvement as we've seen in the first half, while also making strategic investments in key growth areas of our business. Lastly, assuming a successful shareholder vote in favor of the upcoming proposal, Canopy USA is expected to exercise the rights to acquire Acreage, Jetty, and Wana.\n\nAnd once these transactions close, we expect to consolidate Canopy USA financial performance into Canopy's financial statements. And as we continue to improve our focus in our Canadian business and once Canopy USA closes the acquisition of Acreage, Jetty, and Wana, we expect Canopy's global cannabis business to be profitable on a consolidated adjusted EBITDA basis. In conclusion, we are focused on executing our path to profitability in Canada. We continue to invest in high-potential opportunities, particularly in BioSteel business, which is seeing strong results, and we expect Canopy USA to meaningfully improve Canopy's growth and profitability over time.\n\nThis concludes my prepared comments. We'll now take questions. To begin our Q&A session -- sorry. Go ahead, operator.\n\nOperator\n\nI'm sorry.\n\nTyler Burns -- Director, Investor Relations\n\nOperator, we will take -- operator, this is Tyler Burns. We'll take a couple of questions first that we have in the queue from our Say Technologies platform.\n\nOperator\n\nOK. Thank you.\n\nTyler Burns -- Director, Investor Relations\n\nAnd that -- OK. The first question is, what is the plan for entering the U.S. market, and what is the projected time frame for this happening?\n\nDavid Klein -- Chief Executive Officer\n\nSo, there are a number of steps related to entering the U.S. market under the Canopy USA structure that we announced a few weeks ago. So, the steps are, first we were -- Canopy shareholders will vote to approve the creation of exchangeable shares. We expect that to happen in early calendar '23.\n\nAnd then, Canopy will create those exchangeable -- that exchangeable share class immediately upon a successful vote. We then would expect Constellation Brands to elect to convert their common shares into those exchangeable shares. Acreage shareholders also have to have a vote to approve the acquisition of the floating shares, and we expect that to happen in early calendar '23 as well. And then, Canopy USA will exercise the options to acquire Acreage, Jetty, and Wana.\n\nWe expect Jetty and Wana to close in the first half of calendar '23, and we expect that the Acreage closing will take longer. It could take as long as nine to 12 months in order to get all the necessary regulatory approvals. But as we said, once we get through all of that -- all of that work, as well as driving continued focus on our Canadian business, we expect that our business will be growing and profitable.\n\nTyler Burns -- Director, Investor Relations\n\nThe second question is, what is your plan if Nasdaq denies the pending acquisition?\n\nJudy Hong -- Chief Financial Officer\n\nSo, I'll take that question. So, just taking a step back, first of all, Canopy shares are listed on TSX, which is obviously a major exchange. And as David mentioned, we are pleased that the TSX is supportive of our structure and strategy of Canopy USA. In terms of Nasdaq, they have objected to the financial consolidation of Canopy USA into the financial results of Canopy Growth.\n\nSo, it's not the structure or the strategy or the plan that they have really objected to at this point. It's also helpful to understand that -- that Nasdaq is not a regulator. And so, we're not -- we don't require their approval of the transactions per se. It's also important to understand that there is no imminent risk to our listing on Nasdaq, and we're continuing to engage in constructive dialogues with Nasdaq to really ensure that we are in compliance with their rules and regulations and general policies.\n\nNow, even in the event that Nasdaq continues with an objection to the consolidation, there are a number of potential path, and that it really includes Nasdaq may accept the heightened level of disclosure for the USA assets. We could also appeal a decision by Nasdaq to delist our shares if we get to that point. So, I just want to remind people that there are a lot of things that have to happen in the next few months. And certainly, we'll share more details with -- with people as we get more updates.\n\nTyler Burns -- Director, Investor Relations\n\nOperator, Judy and David will now be happy to take questions from the analysts.\n\nOperator\n\nThank you. Ladies and gentlemen, we will now begin the question-and-answer session. [Operator instructions] To ensure an efficient call that gets to the questions of as many analysts as possible, analysts are requested to limit themselves to one question. The first question comes from Vivien Azer of Cowen and Company.\n\nPlease go ahead.\n\nVictor Ma -- Cowen and Company -- Analyst\n\nHi, good morning. This is Victor on for Vivien Azer, and thank you for taking the question. So, I just want to touch on BioSteel. Sales in 2Q were helped by the higher Walmart load and -- versus 1Q '23.\n\nAnd BioSteel continued strong velocities as we've seen on scanner data. As you look to move some of that RTD manufacturing in-house, what is your strategy on in-house versus contract manufacturing? And is there a target mix and a target gross margin you have in mind? Thank you.\n\nJudy Hong -- Chief Financial Officer\n\nYes. Hey, Victor, I'll take that question. So, some of -- some of the acquisitions that we announced on the -- the Verona facility, this is really about two things. One is it really ensures the supply of tetra pack packaging in the U.S.\n\nand -- and even in Canada because, as you may know, there is limited supply and capacity of tetra pack -- packaging just across the industry. So, it really ensures that we have supply that we can leverage internally and really ensure that we can continue to capitalize on the rapid growth that we're seeing for BioSteel across -- across both the U.S. and the Canadian market. Secondly, this is really also about margin improvement.\n\nAs you probably saw in our segment margin disclosure, BioSteel's margin this quarter was around 26%. We think, as we bring production in-house through this acquisition, gross margin certainly will see significant improvement as we reduce -- or obviously eliminate all the co-packing costs. There's additional savings that we would garner from -- from owning the production facility. So, over time, we would expect BioSteel's gross margins to mirror what you would typically see from other-premium-beverage-players standpoint.\n\nSo, all in all, it ensures supply and -- and obviously, it's margin improvement efforts as well.\n\nOperator\n\nThank you. The next question comes from Chris Carey of Wells Fargo. Please go ahead.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nHi. Good morning.\n\nJudy Hong -- Chief Financial Officer\n\nMorning, Chris.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nI think your prior expectation, correct me if I'm wrong, was for the Canopy USA vote to happen perhaps in January. And now, it sounds like early calendar 2023. Can you just to help us understand your expectation for what appears to be a bit deeper of a SEC review here and maybe explain, to the extent you can, where you think they're taking a deeper look? You know, clearly, other cannabis companies based in the U.S. have filings with the SEC.\n\nI'm wondering why your case would be different. So, I'd love any perspective there and how you think this impacts your timeline. Thank you.\n\nDavid Klein -- Chief Executive Officer\n\nI would -- I would say, Chris, that our expectation on timeline really hasn't changed all that much. We filed our proxy on October 25th. There is a period in which the SEC can provide comments. And so, maybe the -- just the change in tone into the first half of the calendar year is just more being conservative than anything else because our internal expectations really haven't changed.\n\nOperator\n\nThank you. The next question comes from Tamy Chen of BMO Capital Markets. Please go ahead.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nHi, good morning. Thanks for the question. I wanted to ask about your Canadian cannabis business, specifically the -- just the production side, the COGS. So, as I recall, a couple of quarters ago, there were some stumbles as you were working to improve the quality of your mainstream and premium flower production.\n\nCould you just give an update on that progress? Are you through all of the challenges that you've previously experienced? And is your Canadian footprint still in a position that, essentially, you need a lot more volume of mainstream and premium flower sales in order to get that segment into positive gross profit territory? Thank you.\n\nDavid Klein -- Chief Executive Officer\n\nYeah. Good -- good -- good questions, Tamy. So, as it relates to performance from our production facilities in Canada, we've made, I think, tremendous progress in terms of our ability to deliver high-quality flower, in particular, to our consumer base. And we see that with some market share growth and distribution growth in new products that we've launched.\n\nAnd it's been a combination of things that have gotten us there. We've -- we've continued to improve our growth processes. We've continued to look for ways to improve our post-harvest processing. We've introduced new genetics, and we now have a very robust pipeline of genetics that we can bring into the market.\n\nSo, we're feeling really good about our ability to supply that -- that -- that super high-quality flower into the Canadian market, right? So, I think -- I think I wouldn't say we're over all of the hurdles because we're growing a plant. And, you know, at the end of the day, the -- the agricultural -- the agricultural cycle can create its own issues from individual lots of growth to the next lot. But I would say that we're really pleased with where we are and feel pretty confident in our path forward. From a footprint standpoint, we need a footprint that is capable of delivering our aspiration to -- to be a leader in the premium and mainstream categories.\n\nAnd, you know, we'll continue to do -- you know, take actions necessary, as we always have, to improve our ability to grow and grow and grow profitable. So, wouldn't -- again, I would say that we're -- we're on -- we're on track with -- with where we'd like to be from a production standpoint.\n\nJudy Hong -- Chief Financial Officer\n\nThe only thing I would add, Tamy, is, you know, obviously, we are seeing sequential improvement from a -- from a cash gross margin standpoint. And this is happening amid rising costs, as you know, across the industry. And unlike other industries, cannabis' CPI is actually still down right now. So, we're facing rising costs, but pricing compression is -- is -- is not helpful in the industry.\n\nAnd there's still a lot of evolving dynamics happening in the Canadian market, too, right? So -- and just to give you, you know, one of the examples of -- of what we're facing with, and I think it's -- I can speak for a lot of the producers, is I think the market really needs a more equitable distribution of profit pool. So, we can adjust the footprint, we can adjust a lot of the cost structures, but the market really needs to move forward to being -- having a more equitable distribution of the profit pool. What I mean by that is, as you probably have seen, many of the producers are basically getting 30% of sales of revenue and in that -- you know, that -- that's split -- in terms of the value-chain split is just not sustainable I think for -- for -- for the industry and are not healthy for the industry as a whole too.\n\nOperator\n\nThank you. The next question comes from Pablo Zuanic of Cantor Fitzgerald. Please go ahead.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nGood morning. Judy, I guess, and David, it's a two-part question. So, Judy, maybe you can explain by what you mean by -- by heightened level of disclosure that Nasdaq would perhaps accept. And, David, for you, I guess the question is, here, we are trying to balance what the auditors want, and maybe the SEC, and what Nasdaq wants, right? So, there would be a scenario that we could come to August, right, nine months from now, Acreage transaction was closed.\n\nAnd -- and you would -- and you would -- you would remain listed in Nasdaq and, I guess, persuade your auditors not to consolidate because Nasdaq is still pending and just provide pro forma numbers, right? So, we can all see what the company would look like when it -- in terms of a consolidated basis, pro forma, with the US assets. So -- so, that -- that could be a plausible scenario, and please tell me if I'm wrong. And I guess the last one, David, as part of the same subject, you know, Acreage yesterday said that the vote is taking place January 23rd. So, if I vote -- if I'm a floating shareholder of Acreage and I get my shares, if I vote yes on the 23rd, in theory, I would get, you know, my CGC shares in August, nine months after the transaction closes.\n\nAnd then, you know, maybe you're still listed in Nasdaq because there's still this -- this paradigm that I just spoke about. And I would be, you know, voting yes but getting CGC shares that are listed on Nasdaq potentially besides the TSX. If you can just touch on that first. Maybe you can start, Judy, on the heightened level of disclosure and what I said about, you know, pro forma, not consolidating and pleasing Nasdaq that way, and I guess the comparison your auditors said that can be done.\n\nDavid Klein -- Chief Executive Officer\n\nYeah. So, thanks for the question, Pablo. Yeah, so, you know, I'll say that, in general, there's been just a lot of discussion around the structure of the transaction. We're going to continue to work with -- with -- with Nasdaq.\n\nWe'll work with our auditors. We work with the TSX. We'll work with all of our partners so that we create the -- the most value for the totality of our shareholders. And I remain optimistic that we get an answer that everyone can be -- can be comfortable with.\n\nWe just -- we have to go through the process. And, you know, fortunately or -- unfortunately or fortunately, you know, we're -- we're innovators in this space, and that means there's some messiness in how we describe it. And so, as I said, I remain -- I remain confident that we're going to -- we're going to end up in a place that is -- is good for all of our investors. And I don't -- as we talk about this structure, I don't want to lose the point that what we're doing here is we're -- we're taking Acreage and Wana and Jetty with the -- with the outstanding brands that they have and the core capabilities that each of the businesses have in -- in distinct markets.\n\nAnd we're putting them together under one umbrella so that they can create value and generate profitable growth and generate cash flow for our shareholders. And so, again, I think there's a lot of discussion around structure, and it's important because we need to structure to execute on our -- on our business model. But I want to make sure that we keep coming back to these are really good businesses that we're putting together that's going to make them even better businesses. And I -- as I said, I remain confident that we'll work through all of the issues related to listings and disclosures and audit and so forth.\n\nOperator\n\nThank you. The next question comes from Andrew Carter of Stifel. Please go ahead.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nHey, thank you very much. Good morning. I wanted to ask, thinking through Canada, we're multiple years in, as you said, Judy, the profit pool's still under pressure and the categories decelerating. So, I guess I'd ask, with 200 million of costs supporting that business back into the retail, why continue down that road, especially when Canopy USA is probably going to be your top use of capital? I guess I want to add to that, you know, if you were to take some more significant steps, what flexibility do you have under your term debt agreement to do that? And I guess the final thing is, when you close Canopy USA, will your lenders have any recourse on the Canopy USA assets? Thanks.\n\nJudy Hong -- Chief Financial Officer\n\nSo, I'll take that. First, Andrew, I do think we are making progress on our Canada path to profitability efforts. And make no mistake, we are continuing to assess all of our operations beyond what we have announced, just to really get to the point where we are profitable in Canada. And, you know, I think David mentioned really the -- the focus is we have a footprint that can support our premium and mainstream businesses that we're really focused on, additional efforts that we are reviewing, including really optimizing our portfolio, looking at variablizing our costs as much as we can, continuing to look at all of our operating costs, for both direct and indirect costs.\n\nSo, you know, I think we really do think it's important to have a self-sustaining Canada business while we really scale growth in the U.S. In terms of the -- the term loan, really, and to address your questions about any limitations on the term loan, as we think about the Canadian footprint, really no limitations to there to really call out. And from a -- from a Canopy USA standpoint, it's essentially the -- the way that it works is -- is before, they did not have any collateral of, say, in Acreage as part of their package, the lender package. Now, just the -- the Canopy Growth's exchangeable shares ownership -- through that ownership, they essentially have a -- an asset that -- that they can really think about that's credit enhancing from -- from their point of view, just given the -- the -- the ownership structure of Canopy Growth [Inaudible] to Canopy USA.\n\nOperator\n\nThank you. The next question comes from John Zamparo of CIBC. Please go ahead.\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nThank you. Good morning. I wanted to ask about your path to achieving positive EBITDA in F '24. So, two parts to this.\n\nFirst, just to clarify that, that guide now includes your U.S. assets. And second, if so, given the remaining cost cuts you're planning seem to only get you about 40% of the way there to positive EBITDA just on the existing business, can we interpret that as you do not expect the existing businesses, as is, to achieve positive EBITDA in '24?\n\nJudy Hong -- Chief Financial Officer\n\nYeah, so I'll take that. So, first, the comment we made about adjusted EBITDA positive in FY '24 was for all of our businesses, excluding the investments we're making in BioSteel, right? So, just to level set everyone, if you look at our adjusted EBITDA losses to date, really the main drivers are Canada and BioSteel. And for BioSteel, we are making a strategic choice to invest, and you're seeing that really driving the top -- top-line results that we're seeing in our performance. And we continue to expect very strong performance out of BioSteel, leveraging the investments that we're making in years to come.\n\nFrom a Canada standpoint, I think I've addressed in my prior comments that we are really committed to having a Canada business in a profitable shape. So, as we deliver on the cost savings, as we look at premiumizing our mix, and continuing to look for additional opportunities, we expect we should be in position to have a positive profitability in Canada on a go-forward basis. And then, if you layer in, then, potentially the positive adjusted EBITDA that Canopy USA could bring, you're really looking at a business that we think is pretty attractive for both growth and profitability standpoint. But all of that will likely to occur once we closed on the -- once Canopy USA closes on the transactions of Acreage, Wana, and Jetty, which, as David alluded to, could take a number of months before we get there.\n\nDavid Klein -- Chief Executive Officer\n\nYeah. And, you know, to address your question, maybe to build on some comments that both Judy and I made during our scripts, right, if you think about our business, it aligns to our new segments that we're reporting in. You know, we have our Canadian business that we're going to continue to drive innovation. We're going to drive distribution, and we're going to really work toward the focus in efficiency in our -- in our Canadian business that gets us the results that we wanted.\n\nAnd a proof point in that is the divestiture that we've announced of our retail assets. We then, you know, talk about BioSteel, which is a brand that we're investing in but showed almost 300% year-over-year growth. And, you know, we really love the trajectory we're seeing in markets like Ontario, where the brand is maybe a little more well known and established but is really starting to hit an inflection point. So, that gives us, you know, reasons to be excited about that.\n\nWe've talked a lot about our Canopy USA strategy, but that's really about growing our businesses that are profitable in really strong markets in the U.S. so that we can take a share of the $50 billion total market. But then, I also want to layer in our Storz & Bickel business, which is coming off of 20 years of consecutive growth. We are continuing to look at driving distribution in that business and working our -- working through some exciting innovation in that business as well.\n\nAnd that's a business that is -- that is stand-alone, profitable, and, again, resonates well with our consumers. And then, lastly, we really have our rest-of-world businesses, which includes our U.S. CBD. We're going to continue to function in those markets in an asset-like fashion and be opportunistic as the regulatory environment evolves.\n\nAnd so, I think putting our business kind of in that perspective using our new reporting segments, I think, is -- is a helpful way to think about it because then you can get under the components of profitability that is, as Judy described, where we have some work to do in Canada and we're investing in BioSteel.\n\nOperator\n\nThank you. The next question comes from Nadine Sarwat of Bernstein. Please go ahead.\n\nNadine Sarwat -- AllianceBernstein -- Analyst\n\nHi, thank you for taking my question. I appreciate you saying that including Canopy USA will get Canopy Growth global -- to globally profitable on a consolidated basis. But my understanding is you actually won't get access to any of those cash flows. So, beyond the cost synergies, which those U.S.\n\nassets would enjoy by being under the same umbrella, could you explain the benefits to Canopy Growth shareholders today from the creation of Canopy USA? Thanks.\n\nJudy Hong -- Chief Financial Officer\n\nYeah, I'll take that, Nadine. So, I say, from a Canopy Growth shareholder standpoint, you know, obviously, having some visibility to the performance of the Canopy USA business that Canopy Growth has already paid for in owning with majority of those assets and not showing up on our P&L, just having that visibility, we think, is -- is beneficial to Canopy Growth. The second benefit would be when you think about some of the resources, both management's time and cash uses that we are making at Canopy Growth level to really advance our U.S. THC strategy, and we talked about this before that there is not insignificant amount of money and time that's being spent by Canopy Growth to really advance our U.S.\n\nTHC strategy. So, by having this Canopy USA structure, we can really streamline the management and -- and the resources that the Canopy Growth has also been spending on Canopy USA while Canopy USA also then takes advantage of the consolidation of their businesses and really generates revenue and cost synergies over time. And -- and ultimately, you know, we do expect regulatory progress to happen at some point, right? Maybe not in the next year, but we do think that that will happen. And all of the benefits that Canopy USA would be generating, both from a profitability standpoint and the cash-generation standpoint, all of that at that point will accrue to Canopy Growth shareholders.\n\nDavid Klein -- Chief Executive Officer\n\nAnd it gives us a head start into that market so that we don't -- we don't -- we don't wait until we have a permissibility event and then put the assets together. So, I think the head start is -- is important, and I think it is a legitimate economic asset that -- that's -- that's -- that's available to our shareholders. And clearly, cash flow is available to our shareholders upon permissibility.\n\nOperator\n\nThank you. The next question comes from Doug Miehm of RBC Capital Markets. Please go ahead.\n\nDouglas Miehm -- RBC Capital Markets -- Analyst\n\nThank you. My question just relates to BioSteel. Given the growth and, it looks like, the opportunity for this product relative to the Canadian cannabis business, number one, within the next year to 18 months, do you expect BioSteel to be a larger business than the Canadian cannabis business? And then, number two, as you think about other opportunities and what's going on on the Canadian cannabis side, when you think about M&A, are other products that are similar, let's say the BioSteel, will they come to the top of the list on a return-on-invested-capital basis now, seeing what you've seen over the last while?\n\nDavid Klein -- Chief Executive Officer\n\nYeah. So -- so -- so with that, we're going to continue to drive BioSteel because we think that -- we think that we have something really special in the brand proposition and the way it resonates with professional athletes and aspiring athletes and then, you know, the common consumer. So, we're going to -- we're going to -- continue to -- to -- to drive BioSteel as hard as we can. From an M&A standpoint, as a company, we're going to remain focused on delivering against the business opportunities that we have in front of us.\n\nAs we talked about incremental focus and efficiency in our Canadian cannabis business and, you know, really stay focused on -- on -- on -- on -- on what we have with the potential on a very small scale to be opportunistic in -- in -- in building -- in building our portfolio so that we can go to market ultimately in the U.S.\n\nDouglas Miehm -- RBC Capital Markets -- Analyst\n\nOK, thanks.\n\nOperator\n\nThank you. The next question comes from Bill Kirk, MKM Partners. Please go ahead.\n\nBill Kirk -- MKM Partners -- Analyst\n\nThank you for the question. So, I think as part of the deal with Flow, you'll be -- you'll be co-packing for them at the Virginia facility for -- for a bit. So, I guess how much revenue would that co-packing arrangement generate, and what is the duration of that agreement? And then, on Storz & Bickel, Judy, I think you said you expected it to sequentially grow. Is that just normal holiday seasonality, or is there something improving sequentially with -- with discretionary purchases? Thank you.\n\nJudy Hong -- Chief Financial Officer\n\nYeah, so, I'll take the S&B and then -- and then go back to Flow. So, from an S&B standpoint, I think the encouraging thing is when you look at the Q2 performance, we were down 7%. But when you exclude currency, we're flat, right? So, sequentially, it is an improvement relative to what we saw in -- in Q1. And really the -- the challenges that we've had with some of the distributors in the U.S., a lot of that has now been worked through.\n\nAnd we're, you know, getting reorders now from -- from the distributor that had some -- some challenges and we had to pause some shipments there. So, we are seeing some of that improvement coming through. And so, you know, I think a lot of that is sort of the challenges that we had on the distribution side. You know, we're -- we're behind on a lot of that.\n\nWe've had some supply chain challenges in Q2 as well, and that's also improving. So, understand that, certainly, in the European markets where the inflationary pressure and the war in Ukraine is -- is really posing additional challenges in those markets but, you know, I think we are seeing improved trends just from working through some of the -- the internal challenges that S&B had. In terms of Flow, yeah, you're correct in that there will be a period of time that we will be -- or [Inaudible] still will be contract manufacturing for Flow's production. This is really to ensure that we are utilizing the capacity as best as we can.\n\nSo, that also helps the margins. So, it's really less about the revenue but really efficiently utilizing the capacity of that facility as best as we can.\n\nOperator\n\nThank you. Our last question comes from Michael Lavery of Piper Sandler. Please go ahead.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nThank you. Good morning.\n\nJudy Hong -- Chief Financial Officer\n\nMorning.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nI just want to come back to the Nasdaq listing, and I appreciate there's quite some time before there may be better clarity on -- on where that lands. And obviously, you mentioned the appeal potential as well. But if they push to delist and then deny an appeal, can you just clarify if your decision is to close the Canopy USA deal and delist or to give that up and stay on the -- on the Nasdaq listing, which -- how would you pick?\n\nJudy Hong -- Chief Financial Officer\n\nSo, Michael, I would just go back to what David said. The -- the decision to announce Canopy USA is to optimize the value of our U.S. THC investment, right? So, when you think about what we -- what we wanted to do and what our priority is, is really the structure allows us to optimize the value of our investments in the U.S. and really generate revenue and cost synergies for that entity over time.\n\nAnd so, we will continue to work with Nasdaq. We'll continue to have dialogues with -- with -- with them to make sure that -- that we can come to a -- a constructive decision. But if you think about our primary motivations for Canopy USA, it is really about value creation. And so, that's really where we have our eyes set on.\n\nOperator\n\nThank you. That concludes the Q&A portion of the call. I will turn the call back to Mr. Klein for closing remarks.\n\nDavid Klein -- Chief Executive Officer\n\nThank you again for joining us today. I mentioned that we feel that we're at an inflection point at Canopy, and we're really excited about where we sit today in the future in front of us. If you're in Canada, I encourage you to try one of our new premium flower and PRJ innovations or a great-tasting Tweed Iced Tea Guava or Deep Space Ginger Ale Galaxy. If you're in the U.S., I encourage you to hydrate with BioSteel RTD beverages or try a Wana gummy or a Jetty vape.\n\nInvestor relations will be available to answer additional questions. Have a great day.\n\nOperator\n\nThis concludes the Canopy Growth second quarter fiscal 2023 financial results conference call. A replay of this conference will be available until February 7th, 2023, and can be accessed following the instructions provided in the company's press release issued earlier today. Thank you for attending today's call and enjoy the rest of your day. Goodbye.\n\nDuration: 0 minutes\n\nTyler Burns -- Director, Investor Relations\n\nDavid Klein -- Chief Executive Officer\n\nJudy Hong -- Chief Financial Officer\n\nVictor Ma -- Cowen and Company -- Analyst\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nJohn Zamparo -- CIBC World Markets -- Analyst\n\nNadine Sarwat -- AllianceBernstein -- Analyst\n\nDouglas Miehm -- RBC Capital Markets -- Analyst\n\nBill Kirk -- MKM Partners -- Analyst\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nMore CGC analysis\n\nAll earnings call transcripts"
}