{
  "companyName": "Smartsheet",
  "companyTicker": "SMAR",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/02/smartsheet-smar-q3-2023-earnings-call-transcript/",
  "content": "Smartsheet (SMAR -1.33%)\nQ3 2023 Earnings Call\nDec 01, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and Gentlemen, thank you for standing by. My name is Brent, and I will be your conference operator today. At this time, I would like to welcome everyone to the Smartsheet third quarter fiscal 2023 earnings conference call. [Operator instructions] It is now my pleasure to turn over to Mr.\n\nAaron Turner, head of investor relations. Sir, please go ahead.\n\nAaron Turner -- Head of Investor Relations\n\nThank you, Brent. Good afternoon, and welcome, everyone, to Smartsheet's third quarter of fiscal year 2023 earnings call. We will be discussing the results announced in our press release issued after the market closed today. With me today are Smartsheet's CEO, Mark Mader; and our CFO, Pete Godbole.\n\nToday's call is being webcast and will also be available for replay on our investor relations website at investors.smartsheet.com. There's a slide presentation that accompanies Pet's prepared remarks, which can be viewed in the Events section of our investor relations website. During this call, we will make forward-looking statements within the meaning of the federal securities laws. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends.\n\nThese forward-looking statements are subject to a number of risks and other factors, including, but not limited to, those described in our SEC filings available on our investor relations website and on the SEC website at www.sec.gov. Although we believe that the expectations reflected in the forward-looking statements are reasonable, our actual results may differ materially and adversely. All forward-looking statements made during this call are based on information available to us as of today, and we do not assume any obligation to update these the result of new information or future events, except as required by law. In addition to the U.S.\n\nGAAP financials, we will discuss certain non-GAAP financial measures. A reconciliation to the most directly comparable U.S. GAAP measures is available in the presentation that accompanies this call, which can also be found on our investor relations website. And with that, let me turn the call over to Mark.\n\nMark Mader -- Chief Executive Officer\n\nThanks, Aaron. Hello, and welcome to our third quarter earnings call for fiscal year 2023. Today, I'd like to focus on three topics: our solid performance in the quarter, how we're improving our operational efficiency in the current macro environment; and how delivering measurable ROI for customers drives our durable long-term growth. While Pete will provide additional details, I want to call out some of our strong financials from the quarter.\n\nRevenue for the quarter was $199.6 million, up 38% year over year. We added $56 million in annual recurring revenue, bringing our total ARR to more than $792 million. We added many new customers in the quarter, such as recruiting software providers seek out, Monster Energy, the social good empowerment platform, Bonterra and Arizona Beverages. And we expanded Smartsheet's footprint significantly at Picasa, AGC Biologics and Seattle Children's Hospital, among others.\n\nOur strong expanded climb motion within our customer base continued with 235 customers expanding by $50,000 or more and 79 customers expanding by $100,000 or more. We also now have 40 customers with ARR over $1 million. And we ended the quarter with more than 11.7 million Smartsheet users. Last quarter, we discussed how our new sales reps were ramping more slowly than sales reps from previous years.\n\nThis quarter, we saw improvements in quota attainment and pipeline generation from our newest reps. We exited the quarter with a record pipeline, improved after macro-related softening in Q2. We also made significant improvements to our profitability in Q3. Our Q3 non-GAAP operating loss was negative $4.3 million significantly better than our guidance and a seven percentage point sequential margin improvement from Q2.\n\nThis improvement is a function of the adjustments we've made to our hiring plan for the year, a heightened focus on operational rigor and financial policies and inherent economies of scale in our business model. We expect these margin benefits to persist, allowing us to improve our non-GAAP operating income and free cash flow guidance for the year and beyond. The growth we experienced in the quarter came in large part from Smartsheet's ability to provide measurable ROI for customers as they navigate the macro backdrop. For example, in Q3, a Fortune 50 healthcare company expanded its Smartsheet investment by over $0.5 million, bringing their total Smartsheet ARR to nearly $2 million.\n\nSince moving to Advance Gold a year ago, they've seen a 56% increase in license growth as more teams across the organization leverage advanced capabilities to manage programs and processes at scale. Their Data Shuttle usage has increased almost 300% over the past year, and they now have 85 workflows powered by our Bridge integration product. One of the biggest benefits this customer is seeing from Smartsheet is improved efficiency, leading to a measurable ROI. For example, one team used a workflow powered by Bridge to automate a complex manual process for managing staff changes and application requests, decreasing the amount of time spent on it by more than 50%.\n\nWe also saw a leading provider of customs brokerage and logistics upgrade to Smartsheet's enterprise licensing and Advance Gold platform after determining that advance would save them nearly 3,000 hours of labor each year. Those hours saved are delivering more than $300,000 in ROI for the company while giving it the ability to handle a larger volume of quick win transactions and improve employee engagement. In another Q3 advanced deal, the leading integrated reporting platform provider, Workiva moved up to advance, so the professional services group could leverage Control Center and the Smartsheet Salesforce connector to implement a new project and portfolio management solution. They chose Smartsheet as their PPM platform because it offers both introductory and professional-grade tools for project management that can scale to enterprise levels.\n\nThis solution also gives project managers insight into project risks and time lines and makes it easy for them to see all assignments in one view, helping reduce project cost overruns. They estimate that in over three years, they will earn a 340% return on their Smartsheet investment. On the innovation front, we launched several Smartsheet capabilities and experiences at our September ENGAGE conference. where we welcome thousands of Smartsheet customers and partners in person for the first time in three years.\n\nIt was incredibly energizing and gratifying to connect with customers face-to-face and hear their Smartsheet stories. HP, Webex, AbbVie and many more presented during breakout sessions and shared how Smartsheet is empowering them to solve tough problems, deliver on promises and drive tangible results. At Engage, we launched portfolio WorkApps, which combines the power of control center for managing large portfolios with the end user simplicity of WorkApps. A global food services company recently chose portfolio WorkApps as the PPM solution for its global transformation initiatives.\n\nThe company has a complex global operating model and portfolio WorkApps gives its portfolio managers the ability to create portfolio views tailored to specific organizational roles that span multiple regions, countries and segments. By leveraging portfolio WorkApps, the company now has a clear line of sight into any given initiative across a global matrix environment, allowing leadership to drive a strategic road map and achieve KPI targets. We're also deepening our investment in the PPM space by launching new resource management capabilities such as capacity view that gives resource managers increased visibility of their capacity for planning and deploying talent. We're continually refining our governance and security controls to meet customers' current and future needs.\n\nAt ENGAGE, we shared details on data egress, a new layer of control over how Smartsheet data can be exported outside of an organization. Such robust security and governance capabilities, which protect confidential information via granular control are a key reason many companies choose our platform. For example, in Q3, a large mortgage lender chose Smartsheet over another CWM solution when the competitor's solution was unable to comply with certain mandatory requirements. This customer was impressed with Smartsheet's enterprise-grade security and like how easy it was for teams across various lines of business to start using the platform.\n\nUltimately, they felt Smartsheet was the best platform to help them meet their COO's goals for managing the business more securely and efficiently. We also announced our new desktop application, which was enthusiastically received by people. As worth of new ML-powered home and reimagined search functions. These investments streamline the daily Smartsheet experience for all users by enabling them to find and act on their work quickly.\n\nOn last quarter's earnings call, I mentioned our acquisition of the Outfit brand management templating and creative automation platform, which we have integrated with Brandfolder. The synergy of the Brandfolder Outfit solution is already providing its value for customers in a meaningful way. In Q3, we landed a $300,000 plus deal with a major appliance manufacturer that will be using Brandfolder plus outfit as their single source of truth for digital asset management and production. Each brand within the company will use Brandfolder to track and manage assets, helping reduce assets for all.\n\nOutfit will provide a self-service model for building automated asset templates that they can distribute to wholesalers and retailers to ensure consistent brand marketing. This Outfit powered content automation solution will help the company reduce a 14- to 16-week creative and distribution process to four weeks, driving a 400% faster time to market for their marketing campaigns. By providing transparent and efficient content creation distribution and tracking capabilities. The new system allows the company to utilize its existing in-house creative team while eliminating significant outside agency-related costs.\n\nAs you've heard today, despite the current macro environment, we had a strong quarter and remain well positioned for continued growth. Just last month, in their Q4 2022 report, Smartsheet was named a leader in the Forrester Wave for collaborative work management tools. The report recognized that Smartsheet continues to provide an extremely broad set of use cases among the leaders in this Forrester Wave. And that Smartsheet strengths are the extensive availability of work types, flexible use case creation and end user automation capabilities.\n\nWith people under greater pressure to choose the right CWM solution for their needs, reports like this are important in helping guide their decision-making. In closing, Q3 was another solid quarter for our company, especially considering the global macro headwinds. With our performance in the quarter, a continued focus on operational efficiency and the way we're delivering ROI for customers, I remain confident in our ability to deliver long-term durable growth with improving profitability. Now, Let me turn you over to Pete.\n\nPete?\n\nPete Godbole -- Chief Financial Officer\n\nThank you, Mark, and good afternoon, everyone. As Mark mentioned, Q3 was a strong quarter that reflected durable growth and improving profitability. We exceeded our guidance on both the top and bottom line as customers continue to turn to Smartsheet for their diverse set of mission-critical work management needs, and we benefit from improving economies of scale and an intense focus on operational efficiency. We saw particular strength among our enterprise customers as these customers continue to deploy our capability-based products to streamline their most mission-critical workflows.\n\nCapabilities grew to 29% of subscription revenue in Q3, aided by strong growth in our advanced offering and Brandfolder. I will now go through our financial results for the third quarter. Unless otherwise stated, all references to our expenses and operating results on a non-GAAP basis and are reconciled to our GAAP results in the earnings release and presentation that was posted before the call. Third quarter revenue came in at $199.6 million, up 38% year over year.\n\nSubscription revenue was $186.1 million, representing year-over-year growth of 40%. Services revenue was $13.5 million representing year-over-year growth of 12%. Turning to billings. Third quarter billings came in at $219.6 million, representing year-over-year growth of 36%, approximately 92% of our subscription billings were annual with 4% monthly.\n\nQuarterly and semiannual represented approximately 3% of the total. Multiyear billings represented less than 1% of total billings. Moving on to our reported metrics. The number of customers with ARR over $50,000 grew 43% year over year to 2,962 and the number of customers with ARR over $100,000, grew 55% year over year to 1,346.\n\nThese customer segments now represent 60% and 46%, respectively, of total ARR. The percentage of our ARR coming from customers with ARR over $5,000 is now 89%. Next, our domain average ACV grew 25% year over year to $7,951. We ended the quarter with a dollar-based net retention rate of 129%.\n\nThe full churn rate remains below 4% given the current macro environment, we expect our overall dollar-based net retention rate to be in the mid-120s by the end of the year. Now, turning back to the financials. Our total gross margin was 81%. Our Q3 subscription gross margin was 87%.\n\nWe continue to expect our gross margin for FY '23 to remain above 80%. Overall, operating loss in the quarter was negative $4.3 million or negative 2% of revenue, which represents a seven percentage point sequential margin improvement. The margin improvement was the result of cost-saving initiatives we discussed in previous quarters, which included moderation of our hiring plan and cost rationalization. Additionally, we led portion of our revenue outperformance dropped to the bottom line, demonstrating the operating leverage inherent in our business model.\n\nBased on our improved gross retention, we also moved to our four-year amortization period for our commission base -- commission expense from a three-year amortization period. This accounting change contributed about three points of margin improvement in Q3. Free cash flow in the quarter was negative $4.6 million. Now, let me move on to guidance.\n\nBefore I go into the details, a few comments on our approach to guidance. The macro environment dynamic, which impacts near-term visibility. We are, therefore, electing to remain appropriately prudent as it relates to our top line performance. For the fourth quarter of FY '23, we expect revenue to be in the range of $205 million to $207 million and non-GAAP operating loss to be in the range of negative $2 to $0.\n\nWe expect non-GAAP net loss per share to be negative $0.02 to $0.00 based on weighted average shares outstanding of 131.5 million. For the full fiscal year '23, we are raising our billings guidance to $878 million to $885 million, representing growth of 33% to 34%. We are also raising our revenue guidance to $760 million to $762 million, representing growth of 38%. We expect services to be 7% of total revenue.\n\nWe are improving our non-GAAP operating loss to be in the range of $45 million to $43 million and non-GAAP net loss per share to be $0.31 to $0.30 for the year based on approximately 130 million weighted average shares outstanding. We are raising our free cash flow guidance for the year to $5 million. To conclude, Q3 was another strong quarter. We continue to demonstrate our ability to drive durable growth with improving profitability as the most demanding businesses in the world turn to Smartsheet for their mission-critical and data-intensive work management needs.\n\nNow, let me turn it back to the operator for questions. Operator?\n\nOperator\n\n[Operator instructions] Your first question comes from the line of John DiFucci with Guggenheim Securities. Your line is open.\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nThank you. Thanks for taking my question. I wanted to dig in on your comment about improved pipeline conversion given the softening macro backdrop. You raised billings guidance for the year modestly, which is certainly positive.\n\nAs we think about next year, are you assuming that pipeline conversion stays at current levels or improves throughout the year? And how should we think about pipeline conversion relative to workforce productivity, some of the investments you've made on the front and the sales force continues to ramp. Sorry for the long question. That's my bad habit.\n\nPete Godbole -- Chief Financial Officer\n\nJohn, this is Pete. I'll take your question in parts. The first part of your question was pipeline conversion essentially, what I talked about last time was ramping our new reps, we saw our pipeline conversions related to rep productivity improve from that sense. And what we saw in terms of the physical view closing and pipeline, October was a strong month for us as it relates to pipeline closing.\n\nSo those are the two elements of dimension on sort of how pipeline conversion looked. One, from a rep standpoint, and the other from the business deals and how they closed. Can you repeat the second part of your question you asked about, so I just want to take them in sequence.\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nAs we think about next year, should we assume that pipeline conversion stays at the current levels, or should we assume it gets better or who knows macro backdrop, maybe that changes for the worst, too. How should we think about it? How do you think about it as it relates to guidance?\n\nPete Godbole -- Chief Financial Officer\n\nSo we haven't come up with guidance for next year. But what I would tell you is two things, it's going to be a function of sort of what the macro is because that's going to decide sort of the number of deals and how those are progressing. We will go into the year with a sales team that's very ramped, and that's going to be positive to conversion.\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nOK. That all makes sense. Well, thanks. Nice job, guys.\n\nPete Godbole -- Chief Financial Officer\n\nThanks, John.\n\nOperator\n\nYour next question is from the line of DJ Hynes with Canaccord Genuity. Your line is open.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, guys. Congrats on the nice set of numbers here. Mark, one for you. I'm curious how, if at all, you've evolved the go-to-market messaging in the current environment? I mean, obviously, ROI is important in any sale.\n\nYou mentioned it several times in your prepared remarks. I'm wondering if there are certain products or use cases that get more emphasis in a tougher environment?\n\nMark Mader -- Chief Executive Officer\n\nI think when you break it down in its most simplest terms, we're helping companies drive revenue or achieve cost savings. And when you can apply a program or process, something is scaled to one of the things that they're trying to achieve and using plans speak like that, you typically have an opportunity to have a conversation. So when we think about things like control center, Data Shuttle moving information more quickly and efficiently across systems. We think about having fewer hands on things so you can get shorter cycle times.\n\nThese are all very hard ROI calculations you can make. So I think the shift, the continued shift from the soft benefits in terms of employee engagement, which is super important, but harder to calculate a benefit from. Customers are responding to how we've oriented ourselves into such discussions. And I think that goes across not only selling seats to somebody, but also introducing our capabilities, which are really the underpinning for a lot of those calculations.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYes. That's helpful. And then as a follow-up, look, I mean, a strong quarter improving conversion rates, record pipeline. Does it at all make you kind of rethink the moderation in hiring plans that we've talked about? And I realize this stuff doesn't whip around in 90-day cycles.\n\nBut I guess I'm getting kind of the commitment to longer-term margin expansion based on what you're seeing?\n\nMark Mader -- Chief Executive Officer\n\nI think we had a really robust start to the year. We brought on a healthy number of team members. And we have not gone through a massive layoff in our company. So we have retained really good strength.\n\nWe've invested in ramping those individuals. And as Pete just said, I think going into the end of the year with a ramp team, a larger ramp team than we had a year ago, that actually gives us quite a bit of confidence to out and execute. So I think it would be in a different position had we finished the year with a very [Inaudible] all of that great talent we brought on the beginning of the year. So I feel like we're still the beneficiaries of some of those earlier in the year moves.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nThat's great to hear. Congrats, guys. Appreciate the color.\n\nMark Mader -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question is from the line of Brent Thill with Jefferies. Your line is open.\n\nBrent Thill -- Jefferies -- Analyst\n\nMark, you were in the CRO last time we went through the recession. Obviously, you're in a completely different position. But any learnings parallels that you're seeing in KPIs you're monitoring going into calendar '23?\n\nMark Mader -- Chief Executive Officer\n\nYes. I think one of the big lessons, Brent, is just being quick, and the another sole notion survival of the quickest. I think you have to pair that, though, would be thoughtful. And it's like we're not just solving for Q3, we're not just solving for Q4.\n\nFY '24 is right around the corner. Pete and I are started talking about FY '25. So it's like these are all important dimensions. And I think one of the learnings is not to get too over-rotated on that next 90-day window.\n\nAnd I think Pete has been a good partner to me in helping manage some of that balance. So I think that's probably the largest takeaway.\n\nBrent Thill -- Jefferies -- Analyst\n\nYes. I mean, Pete, just as a quick follow-up on the rep productivity. I mean, it's kind of counter to what we're hearing at other companies. What do you think inverted the quota attainment for you, what changed there? Was it something that happened in the demand environment? Was it one particular geography? What -- was there anything you can put your pulse on because that's kind of counter to what we're hearing in other companies right now?\n\nPete Godbole -- Chief Financial Officer\n\nYes, the rep productivity that I was describing was for our newer reps. We had a series of what I call well-timed and absolutely meticulously defined initiatives of how we would ramp the newer reps into territories they had never managed accounts, they had never managed. And I think we're seeing the dividends of that play. So we've seen the productivity of those reps client.\n\nNow remember, we had a significant class that we ramped in. So when you're looking at the weighted average of the impact of that many people getting ramped up with a systematic set of plays, that's what we're seeing.\n\nMark Mader -- Chief Executive Officer\n\nI think it's also an important, Brent, to recognize that we're making a relative statement. We were not pleased with where we were last quarter in terms of rep productivity on certain cohorts. We're seeing improvement there. So heading in the right direction.\n\nI think that is a statement though against what we saw last quarter as opposed to we are exceeding at all levels on all fronts. I think we still have a good room to go to continue to improve.\n\nBrent Thill -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nYour next question is from the line of Pijalim Bora with J.P. Morgan. Your line is open.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nGreat. Thanks for taking the questions and congrats on the quarter. Mark, I just wanted to understand a little bit. I guess it's a great quarter.\n\nIt seems like numbers are great, but we are hearing a lot of consternation from other companies as well, right? Last quarter was you had faced some difficulties. So I'm trying to understand how does the macro feel for you? Is it the improvement that you did within some of these messaging plays that helped you this quarter versus the normal discussions on a macro front. Is that kind of similar to last quarter? Or is it -- does it feel a little bit better or worse?\n\nMark Mader -- Chief Executive Officer\n\nI think it feels quite similar. I think the way we're engaging in those conversations are starting to produce yield for us. But I would say that the tenor within the customer environment is quite similar. I would say how we're responding to that has proven to be positive.\n\nAnd I think that is a function of reps feeling more confident, thus being able to present these solutions in ways that resonate with them. But I would say it is as much getting yourself higher in that priority list for customer consideration as opposed to the amount of budget customers have starting to swell again. So I think it's really our placement in that stack rank, that's helping us.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nYes. Got it. One follow-up. I wanted to ask you about WorkApps.\n\nWe have some -- we have had some conversations with some of your customers who are talking about consolidation, not just around work management applications, but consolidation of other third-party apps, in-house apps, scheduling app or something else, right, which are being built on top of WorkApps. Are you seeing that? Is that kind of a driver for the enterprise plan at this point where people are trying to save money to more with less?\n\nMark Mader -- Chief Executive Officer\n\nYes. I think any time you have a -- the beautiful thing about the platform as opposed to a point tool is that it can be utilized in a multitude of ways. And I think any time someone sees a set of technologies that they can utilize across multiple use cases and drive a higher yield for an amount of spending. That's a good thing.\n\nSo I think WorkApps is a contributing for us there. I wouldn't say WorkApps is the tip of the spear. It's one of a whole multitude of things that we're presenting to clients. I think in the coming years, I think WorkApps will continue to gain steam, the release we had an ENGAGE by connecting it to control center, which has been a really successful offering for us.\n\nCustomers are really happy to see that. I think we'll see some benefits of that marriage between touch control center and WorkApps in the quarters to come.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nGot it. Thank you so much. I'll get back in the queue.\n\nOperator\n\nYour next question is from the line of Josh Baer with Morgan Stanley. Your line is open.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thanks for the question and congrats on a strong quarter. I wanted to ask one on macro and sort of in relation to guidance. We can see the deceleration in the implied Q4 billings guidance and the commentary just around the decline in the net retention rate.\n\nSo I was hoping you could talk about some of the macro assumptions that's embedded in that guidance? And when you talk about prudence, what does that mean if you could add some details there?\n\nMark Mader -- Chief Executive Officer\n\nAbsolutely. So Josh, the growth decel implied in our billings guidance is a function of the strong comp from Q4 from a year ago. And we've combined that with sort of a prudent outlook given the macro environment, which includes an expectation of lower customer budget spending sort of compared to prior periods. And that's what substantiates the macro in your question, which is we're seeing a macro that's worsening.\n\nBut the good news is when I gave you guidance a quarter ago, I gave you a composite guide of Q3 and Q4 and we had projected that Q4 would be softer given a worsening macro that was built in. So that's the basis of the assumption.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nOK. Great. That makes a lot of sense. And then, if you could just add any commentary on the linearity of sort of demand trends month-to-month throughout the quarter and into November.\n\nHave you been seeing things get worse over the last months leading into Q4?\n\nPete Godbole -- Chief Financial Officer\n\nSo the -- October was a strong month for us relative to the, what I call the close rates and the pipeline close rates we saw. November turned out steady to our expectations. We expected the macro cycle to be in play, and it produced results that are very consistent with our expectations. So remember, in Q4, there is a great deal of business to be booked in December and January.\n\nSo that's what's built into our assumption as we've guided to the quarter.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nPete Godbole -- Chief Financial Officer\n\nSure, Josh.\n\nOperator\n\nYour next question comes from the line of Scott Berg with Needham. Your line is open.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Congrats on good quarter and I guess that two questions here. First of all, Pete, you talked about capabilities where I think it was 29% of revenues in the quarter. As the company continues to move upmarket more, what does that mix look like at kind of, I don't know, peak levels? And then, how should we think about the ARPU lift that you're gaining from those customers that are adding on some of these capabilities today?\n\nPete Godbole -- Chief Financial Officer\n\nSo the -- are they commented statement of sort of where we see capabilities? And I think when you talk about a percentage of capabilities of total, it sort of implies that there isn't going to be as much growth on the user license part of it. We see both as really solid drivers. We see the width of our use case, if you remember the information Mark provided on the latest reports, we have a wide variety of use cases that drive what I call our expand motion. Think of capabilities as the client piece of it.\n\nWe think of that number as being -- as growing over time because they are fast growing relative to our core license business. And we gave some guidance during our last analyst day on how big they could be but we're stretching the surface on that part of it. So I do feel like as customers start to unlock the scale that they need after they've deployed the solution, you're going to see more and more customers small and large start to use them in the most demanding way.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. That's helpful. And then from a follow-up perspective, maybe this is for Mark. I wanted to see if you can talk about the competitive environment a little bit.\n\nAnd I asked the question in the framework. You had a competitor report their results tonight that were not nearly as strong as yours we'll go with that. Are you seeing anything different out there that might be driving the strength of your business versus others maybe not continuing as well.\n\nMark Mader -- Chief Executive Officer\n\nIt's harder for me to make a relative statement, Scott. I think as I said earlier, I can share what customers appear to be responding well to in our offering. And I think the capabilities alongside the core licenses, that is a composite that people are responding to. And it manifests itself not only in growth but also retention.\n\nIf you have multiple value points that you can deliver to somebody, I think you have a healthier relationship. And I think that's helping drive our business.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. That's all I have. Congrats on the good quarter.\n\nMark Mader -- Chief Executive Officer\n\nThanks, Scott.\n\nOperator\n\nYour next question comes from the line of George Iwanyc with Oppenheimer. Your line is open.\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nThank you for taking my question and also my congratulations. Mark, maybe could you give us a bit of perspective on the desktop app and what kind of feedback you're getting from this launch at this point?\n\nMark Mader -- Chief Executive Officer\n\nYes, George, I think one of the things that always find funny over the many years we've been doing this is some software companies get so excited about the next most extremely high-value user feature than someone says, but I really want the easy thing. And I think the desktop is is such a beautiful example of that where people want to see in the tray on their machine. They want to be able to get quick access to it. They don't want the task that represent all their work in Smartsheet comingle with a bunch of other tabs in their chrome or Safari browsers or Microsoft browser.\n\nSo these are very simple things that people respond to. And I think when someone is living in your app and you can make their life easier, either through a better design or more quicker access, they're thankful for it. I think some of our team members were surprised at ENGAGE, and this is something which you just can't substitute with the digital conference. When you look at the number of people queued up at a boot wanting to learn about this same versus many other things, you really get that topical sense for low this matters.\n\nAnd the desktop app is one of those. It's been something we've been working on for some time, thousands of people, many thousands of people are using it today. I think it's still an EAP. It will be really shortly broadly.\n\nSo we'll continue to invest behind that.\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nAnd with that, maybe can you give some perspective on when people are in the app, are you seeing them engaged with multiple products in a more broad way with the overall platform?\n\nMark Mader -- Chief Executive Officer\n\nWhen you say more products you mean more elements of our product or integrations with --\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nYes, more elements of your product.\n\nMark Mader -- Chief Executive Officer\n\nYes. And I think as we dovetail things like Brandfolder into the experience and our resource management more into our core experience, by lowering that hurdle height for people to easily traversed, yes, we are seeing that happen. The one thing that I'm quite looking forward to, and I shared this on a prior call, as we remove -- further remove the friction from people being able to explore our entire portfolio as Pete said a second ago, today, a lot of those capabilities are really our consultative sale. And what Praerit and the engineering team are working on continue to let people discover, explore, realize the value and then ultimately buy those in a self-directed manner.\n\nSo I think in the coming two years, you're going to see a much greater diversity in people using more things in our product because we're lowering that friction.\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Alex Zukin with Wolfe Research. Your line is open.\n\nEthan Brook -- Wolfe Research -- Analyst\n\nHey, this is Ethan Brook on for Alex Zukin. Congrats on the quarter. I wanted to ask -- I appreciate the color for where NRR will go next quarter. But as you think about looking to next year, is like the mid-120 brings the right way we should think about I guess where NRR will stabilize.\n\nAnd if we look to next year, it's high 20s growth the right way we should be thinking about it?\n\nPete Godbole -- Chief Financial Officer\n\nEthan, we're not talking about next year because that's a part of the whole construct of how we see next year. It's related to what we see bookings, billings, all those elements. So it's a little premature to talk about sort of where that number will be. I think longer term, we see great capability for that number to grow just based on our history and sort of the products we've got in the pipeline.\n\nSo that's the way I'll leave it.\n\nEthan Brook -- Wolfe Research -- Analyst\n\nGreat. And then, congrats also on the great improvement in incremental margins from like negative 20 to negative 3%. I guess is this the kind of the pace and rate we should think about margin improvement going forward? And I guess how are you thinking about balancing, I guess, improving this margin, [Inaudible] a little bit more? Can we expect a little bit more on the margin side? And also, I just want to ask, is the 10% free cash flow margin for calendar '24 still on the table?\n\nPete Godbole -- Chief Financial Officer\n\nSo Ethan, I appreciate the question. We've made significant strides by really focusing on operational improvements and moderating hiring. So we've seen that play out in the margins you've just seen. What I would tell you is we're going to continue that effort by trying to go after efficient growth, and that's going to be something we'll continue for several years as we go through it.\n\nThat being said, we're not going through specific callouts of how much margin improvement there is and what rate it clips at. There's a little bit of work to be done before we get to that point.\n\nEthan Brook -- Wolfe Research -- Analyst\n\nThank you, guys. Congrats, again, on the good quarter.\n\nPete Godbole -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nYour next question comes from the line of Rishi Jaluria with RBC Capital Markets. Your line is open.\n\nRichard Poland -- RBC Capital Markets -- Analyst\n\nHi, this is Richard Poland on for Rishi Jaluria. Thanks for taking my question. I guess just in terms of the macro environment versus what you saw 90 days ago, is there any way to kind of bifurcate what you're seeing between SMB and enterprise and just kind of -- are there any pockets of either demand improvement or demand softening that you'd call out within that?\n\nPete Godbole -- Chief Financial Officer\n\nSo Richard, this is Pete. What we've seen is we've seen, if you would parse the segments of the market differently. I would say in the U.S. mid-market, we've seen sort of global impacts more broadly so.\n\nI would say we've had strength in the enterprise based on just the number of transactions we've been able to book with these enterprises. So those would be like the texture on it. I think you're looking for that level. I think in terms of verticals, we've seen strength in manufacturing, global energy architecture, construction, if you will, and some of the weaker verticals for us have been technology, probably consumer good, and media, if you will.\n\nRichard Poland -- RBC Capital Markets -- Analyst\n\nGreat. That's very helpful. And then just as I think about SBC, I mean, stock-based compensation came down nicely in the quarter. Should we expect that to continue to trend down.\n\nJust kind of any update on your thoughts around how you think about stock-based comp?\n\nPete Godbole -- Chief Financial Officer\n\nYes. Stock-based comp is really important to us because it's a key element of how we look at the business. I think you should expect a few things to happen. I'll answer your question right at the outset, do we expect stock-based compensation in the future to decline as a percent of revenue? Yes, it should decline.\n\nThat's the way the results will come out. Now, when you think of stock-based compensation, think of it as a number of people times the how much you offer them being the driver. We've essentially, going forward, moderated our hiring plan because we don't need to hire the same pace. We're doing this very differently.\n\nSo what you're going to see is a positive impact on the number of people we're bringing in and the impact it has on stock comp. That being said, stock comp is dictated by the history of what you've done in the past. So when you look at it, you say large part of it is already set by the prior hires that we've put in place. But -- so those are the two effects that play into the total stock comp that gets created, and we're focused on making sure that it goes down year over year as a percent of revenue.\n\nRichard Poland -- RBC Capital Markets -- Analyst\n\nWonderful. Thank you.\n\nPete Godbole -- Chief Financial Officer\n\nOf course.\n\nOperator\n\nYour next question is from the line of Terry Tillman with Truist Securities. Your line is open.\n\nRobert Dee -- Truist Securities -- Analyst\n\nGreat. Thanks for taking the questions and congrats on the quarter. This is Robert Dee on for Terry. Curious to get an update on the newer onboarding experience and some of the other recent initiatives around helping users start quickly.\n\nHave you all started to see greater usage and penetration with newer customers today versus newer customers from say a year ago, what have been the specific drivers of that, if so?\n\nMark Mader -- Chief Executive Officer\n\nYes. We have a number of measures there, Robert. And one of the things that we've seen a nice uptick in is the percentage of new participants who are successful in creating their first solution, the first thing that they're starting to try and work with. We saw really nice improvements in that.\n\nThat was one of the early success factors that we were trying to solve for. There are a number of other designs and elements that are being rolled in later this quarter targeted for Q1 and Q2, which I think will also have beneficial results in terms of conversion rate. But really pleased with what the team has put out there in terms of improving that experience. One other really nice benefit from what the team put in, we have greater visibility into what somebody's intent is and that can come on a few fronts.\n\nThe more we understand someone's intent, the better we can serve them, both in terms of consulting, advising templates to them, how we support them. So overall, it helps us serve better, help someone get navigated and started better. So pleased with the improvements.\n\nRobert Dee -- Truist Securities -- Analyst\n\nThat's great. And just one quick follow-up. Hoping to dive a little deeper on Brandfolder, how attach rates and penetration for the solution been performing relative to expectations? And what trends are you seeing in the overall digital asset management market from a demand perspective?\n\nPete Godbole -- Chief Financial Officer\n\nSo Robert, we were pretty pleased with our performance with Brandfolder. We're seeing broad resonance as people look at the combined Brandfolder Smartsheet solution together. I think what's really helped is, one, the customers' impact which comes from both those solutions together. And this year, we launched a model where we basically turned on our core Smartsheet sellers to help in selling Brandfolder, that's paid pretty good dividends for us as well.\n\nAs far as the digital market and Brandfolder, I'll let Mark speak to that a little bit.\n\nMark Mader -- Chief Executive Officer\n\nI think there's still a huge opportunity for us to educate our customers and prospects about what's available to them and I think, well we have examples that we can point to like this big appliance manufacturer who's doing pretty impressive stuff in terms of content automation. A lot of times when we share those stories with people, they're unfamiliar that that's even possible. So I think while digital asset management has been around and sort of many -- some customers are fluent in it, the majority are not, and it's still in an education phase. I think with our -- as we talked about ramp up reps, we talk often about our newest cohort.\n\nI also think about ramping in productivity with our existing reps on new lines of business like Brandfolder and Outfit. And I think, I would say with the median rep on our team who's experienced is much better suited today to speak to that value proposition. So again, I think it's a very different phase in terms of stage, in terms of market understanding, and we're leaning into it.\n\nRobert Dee -- Truist Securities -- Analyst\n\nAppreciate the color. Thanks again.\n\nOperator\n\nYour next question is from the line of Jake Roberge with William Blair. Your line is open.\n\nJake Roberge -- William Blair -- Analyst\n\nHey, guys. Congrats on the great results. Pete, you've talked a lot about cost rationalization and moderation of your hiring plan helping on the margin front. Given you beat by over $16 million on the operating margin front, could you dig a little more into the areas you're finding leverage in the model.\n\nAnd then, when we think about moderation in hiring, do you expect that to continue into next year when comparing it to this year's hiring plan?\n\nPete Godbole -- Chief Financial Officer\n\nSo the $16 million beat you're referencing is for the quarter, right? So I just want to make sure I answer your question.\n\nJake Roberge -- William Blair -- Analyst\n\nYes, for the quarter.\n\nPete Godbole -- Chief Financial Officer\n\nGreat. So I'd say the two elements of that beat are coming from -- I'll lay it out for you, probably half the beat is coming from the revenue leverage that we've had as we've moderated and controlled costs. So revenues have grown up. We've moderated our hiring and people-related costs that go with it.\n\nthat's produced sort of more than half the effect. About three points or three percentage points of it have come from -- we've looked at the customer duration that's associated with a greater gross retention rate, and that's meant a lower commission expense, that's accounted for about 3% of it. So that gives you some texture. And the rest of it is just hard core operational cost containment.\n\nLooking at every dollar that you're spending and asking whether it has value in terms of the priorities you've set up. That's the first part of it. And the second part of your question was on hiring in the future. We don't expect to have a similar sized hiring class coming on board and hiring expectations in the future will be significantly smaller.\n\nSo we're going to see the benefit that we've created this year in a continued manner next year as we think of the operating leverage.\n\nJake Roberge -- William Blair -- Analyst\n\nThat's really helpful context. And then, some of your peers have called out some headwinds from a user perspective, given slower hiring rates and some layoffs at tech companies. Have you seen any large customers reduce headcount as a result of those headwinds, or just given your enterprise customer base and that focus, are you more immune to those issues than some other peers?\n\nMark Mader -- Chief Executive Officer\n\nI think for the last five years, our whole mindset about penetrating the enterprise has been what we call the earned enterprise. So what we don't do is we don't go in and sell what we think at the time is a big air or a deal and go wall to wall. We say, how can we mobilize, how can we deliver value and then we grow over time with them because very few of our large customers are full wall to wall where your dollar retention is reliant on the next person they hire. We're actually somewhat insulated from that.\n\nThe other piece that's helpful to us is because some of our ARR is grounded in value components that we call capabilities, it's actually not tied out to a user license. And if you want to keep benefiting from that, you will keep subscribing to it. But it is not hinged on that next hire. And I think that's where our mixed model or hybrid model is turning out to be quite helpful.\n\nJake Roberge -- William Blair -- Analyst\n\nThat's really helpful. Congrats again on the great quarter and thanks for taking my questions.\n\nMark Mader -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nYour next question comes from the line of Steve Enders with Citi. Your line is open.\n\nUnknown speaker -- Citi -- Analyst\n\nHi. Thanks for taking the question. This is George on for Steve. Just want to congrats on great execution in a difficult environment.\n\nI wanted to circle back on the discussion earlier about rep productivity. I think when you were talking last quarter, you were talking about expected improvement over the forward three to six month time frame. But I am just curious, obviously we have seen improvements over these first three months. What are you thinking about -- how are you viewing improvement potential in Q4? And is there any of that baked into the guidance?\n\nPete Godbole -- Chief Financial Officer\n\nGeorge, this is Pete. I just wanted to quickly say, we are really pleased with how the field teams have sort of gone about improving productivity of newer reps who have started. We've seen the benefits of it as they've become productive. Our expectation is we will continue to see productivity improvements in those reps because our plans involve multi-quarter changes and how we get them productive.\n\nThat's baked into our guidance. So you should think of our guidance as an overlay of improving new rep productivity, combined with the macro that we have thoughtfully and prudently considered.\n\nUnknown speaker -- Citi -- Analyst\n\nGot it. That makes sense. And then, just one quick follow-up on the billings upside came in quite ahead of -- Are we still remodelling. I was wondering if you could just dig into kind of what drove that upside and if there's anything unusual or onetime in nature that we should be aware of?\n\nPete Godbole -- Chief Financial Officer\n\nGeorge, there was nothing unusual or onetime nature in those numbers. So it's organic bookings which translates into billings.\n\nUnknown speaker -- Citi -- Analyst\n\nGreat. Thanks for taking the questions.\n\nPete Godbole -- Chief Financial Officer\n\nOf course.\n\nOperator\n\nYour next question is from the line of Michael Turrin with Wells Fargo. Your line is open.\n\nMichael Berg -- Wells Fargo Securities -- Analyst\n\nHi, this is Michael Berg on for Michael Turrin. Thanks for taking my question. Congrats on a great quarter. I wanted to dive into expansion rates again quickly, they have been pretty nicely in the quarter.\n\nAnd I know the exit rate expectations are still the same. Maybe with a discussion on potential seat expansion issue, you can walk us through the mix of seats versus capabilities on driving that expansion rate number and if that's changed meaningfully over the past quarter or two?\n\nPete Godbole -- Chief Financial Officer\n\nI'll start with the question. And then from a meta standpoint, Mark will chime in, in terms of how that's operating. We're not seeing a big difference between the seats and the, what I call, capabilities. Obviously, capabilities are still growing faster than the sear part of it, that is factored into the expansion rates we see.\n\nWe gave you some stats on capabilities. We said that they're 29% of revenue. And if you looked at them sort of a year ago, they were 24%. So clearly, people are expanding with capabilities.\n\nbut you're seeing a healthy mix of people with seats as well in that mix. So that's kind of a meta point of like how expansion rates are moving.\n\nMark Mader -- Chief Executive Officer\n\nYes, I think -- I don't think I have much to add to that.\n\nMichael Berg -- Wells Fargo Securities -- Analyst\n\nThat's it for me. Thank you.\n\nMark Mader -- Chief Executive Officer\n\nThanks, Michael.\n\nPete Godbole -- Chief Financial Officer\n\nThanks, Michael.\n\nOperator\n\nYour next question comes from the line of Jackson Ader with MoffettNathanson. Your line is open.\n\nKyle Diehl -- MoffettNathanson -- Analyst\n\nHi, guys. This is Kyle Diehl for Jackson Ader. Thanks for taking our question. Just to dig a little bit deeper onto that expansion kind of the time line that you guys are seeing.\n\nIs the time line for expansion slowing at all? Or do you kind of see that slowing in the near term future here? Or has that kind of remaining constant as to what you've seen historically?\n\nPete Godbole -- Chief Financial Officer\n\nSo the -- if you think of expansions and you convert them into its core fundamental, you're talking about bookings and how quickly they materialize. Obviously, expansions are a key part of bookings and billings. So you should think of it as being -- we've seen an elongation in sales cycles and we've seen deal compression. So let's talk about how that actually plays itself out.\n\nThe way we've seen elongations, people just stay longer with a number of potential reviews that take place for any purchase, those are happening. The second part of it is the deal compression. The way that would happen with these capabilities and expansion is you can either buy a package, which is likely packaged up value in advance or you can still buy pieces of it, we don't tell customers how they should buy it, but they buy a la carte capabilities that hit a specific need, those represent if you buy the a la carte capabilities, you're getting a smaller bite in bookings. Obviously, over time, you're going to get all the bookings, but it means a different size.\n\nSo that's how expansions play out.\n\nKyle Diehl -- MoffettNathanson -- Analyst\n\nOK. Great. That's helpful. And then, I guess just in terms of next year's IT budgets, historically are you able to attribute a decent or a majority of revenue growth to IT budget expansion? How do you see it playing out if IT budgets kind of come down next year.\n\nDo you see that as having a meaningful impact on the top line growth?\n\nPete Godbole -- Chief Financial Officer\n\nSo I would say that the budgets for our funding. Remember if you're dealing with -- this isn't one purchaser and one department. There are hundreds and thousands of people in enterprise who are buying it. See you have as much of people with line of business budgets that are buying it as they are IT folks in there.\n\nSo I think it is fairly broad based in terms of budget.\n\nKyle Diehl -- MoffettNathanson -- Analyst\n\nThat makes sense. Thank you.\n\nPete Godbole -- Chief Financial Officer\n\nOf course.\n\nOperator\n\nYour next question comes from with line of Fred Lee with Credit Suisse. Your line is open.\n\nFred Lee -- Credit Suisse -- Analyst\n\nThank you, gentlemen, for taking my question. Very nice quarter, particularly in this environment. I was wondering if you were seeing any change in behavior from your competitions, specifically privately held companies that might be slowing their investment in market expense and then a quick follow-up after that.\n\nMark Mader -- Chief Executive Officer\n\nNo. Given the thousands of transactions we do in the quarter, the median transaction is still really helping if someone progressed from their status quo, which isn't grounded in a CWM player and getting into CWM for the first time. So it's difficult for us to speak. It will not be really well grounded for us to speak to these huge patterns that we see.\n\nWe have seen -- you do see it manifest itself in some other ways in terms of you definitely get a sense that those companies are hiring less. I think some of the people who joined companies, would have now been let go, obviously talk to people in the community, and I think there's less chatter around people considering going to such companies. I think that's one of the things that more established companies will benefit from in the coming quarters. In terms of what we're seeing in market, nothing that we've really heard from customers on that front.\n\nFred Lee -- Credit Suisse -- Analyst\n\nAnd just a quick follow-up on the net retention metric eventually in the 20s by the end of the year, I was wondering if you could drill down a little bit on what's contributing to the sequential decline in the metric?\n\nPete Godbole -- Chief Financial Officer\n\nSo Fred, the net dollar retention rate metric is a full year look back. So we look at what happened over the full year, if you will. So when you think of what comes into the calculation when we report out at the end of Q4, is you're going to be replacing a very strong quarter with a macro that was very different, expansion need that was very different without something that's in a different macro phase. So you're just swapping out one quarter for the other, and that's where you see look back of a full year in expansion rates dropping to where we've guided.\n\nFred Lee -- Credit Suisse -- Analyst\n\nUnderstood. Thank you, very much, and great quarter.\n\nPete Godbole -- Chief Financial Officer\n\nOf course. Thank you.\n\nOperator\n\nThere are no further questions at this time. I will now turn the call back to Mr. Aaron Turner.\n\nAaron Turner -- Head of Investor Relations\n\nGreat. Well, thank you for joining us, everyone, and we will speak with you again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAaron Turner -- Head of Investor Relations\n\nMark Mader -- Chief Executive Officer\n\nPete Godbole -- Chief Financial Officer\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nGeorge Iwanyc -- Oppenheimer and Company -- Analyst\n\nEthan Brook -- Wolfe Research -- Analyst\n\nRichard Poland -- RBC Capital Markets -- Analyst\n\nRobert Dee -- Truist Securities -- Analyst\n\nJake Roberge -- William Blair -- Analyst\n\nUnknown speaker -- Citi -- Analyst\n\nMichael Berg -- Wells Fargo Securities -- Analyst\n\nKyle Diehl -- MoffettNathanson -- Analyst\n\nFred Lee -- Credit Suisse -- Analyst\n\nMore SMAR analysis\n\nAll earnings call transcripts"
}