{
  "companyName": "Welltower",
  "companyTicker": "WELL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/welltower-well-q2-2022-earnings-call-transcript/",
  "content": "Welltower (WELL -0.43%)\nQ2 2022 Earnings Call\nAug 10, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning. My name is Chantal, and I'll be your conference operator today. At this time, I would like to welcome everyone to the Welltower second quarter 2022 earnings call. As a reminder, today's conference is being recorded.\n\n[Operator instructions] Thank you. Matt McQueen, general counsel. You may begin.\n\nMatt McQueen -- General Counsel\n\nThank you, and good morning. As a reminder, certain statements made during this call may be deemed forward-looking statements in the meaning of the Private Securities Litigation Reform Act. Although Welltower believes any forward-looking statements are based on reasonable assumptions, the company can give no assurances that its projected results will be attained. Factors that could cause actual results to differ materially from those in the forward-looking statements are detailed in the company's filings with the SEC.\n\nAnd with that, I'll hand the call over to Shankh for his remarks.\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nThank you, Matt, and good morning, everyone. I'll review high-level business trends and describe our capital allocation priorities before handing the call over to John, who will detail the operational trends and provide more details on the operating platform that he is building. Our total revenue is up 29% year over year, driven by both organic revenue growth and contribution from significant capital deployment activity over the last 18 months. On a same-store basis, our senior housing operating portfolio revenue is up 11.5% year over year, driven by a 5% occupancy growth and a 4.5% RevPOR growth.\n\nAll this translated into a 15.4% same-store NOI growth in Q2. Our annual EBITDA is back above $2 billion. Annualized in-place SHOP NOI is at $895 million. Though shy of $923 million of pre-pandemic numbers, our revenue has surpassed pre-pandemic levels.\n\nHowever, I'm not happy with these results, which I would characterize mediocre at best. Why? Because the size of our portfolio is much bigger today, given the significant amount of capital deployment over the last 18 months and yet our quarterly results are not reflecting the cash flow that this portfolio is capable of generating. I'll give you a few things to reflect on. First, we have about 120 senior living -- senior housing properties that are generating negative cash flow today.\n\nIn other words, if we just shut down these buildings, our earnings would be significantly higher. Clearly, we would not do such a thing as they were recently developed or going through a value and repositioning program. Hence, the timing mismatch. Second, while I don't like to fix it on short-term trends and instead focus on long-term prospects of the business, I'll offer a few observations on the second quarter.\n\nWe started the quarter with results coming in better than expected, only to get hilt simultaneously by multiple challenges primarily related to another COVID spike during the last couple of weeks of June. Only this time, we didn't see it coming as the testing requirements have been lowered in recent months, particularly for those residents who are not experiencing symptoms. In instances, while few residents or team members develop symptoms in an entire building, would be tested only to find out many asymptomatic residents and staff actually were COVID-positive. This created some disruption to move-ins, but particularly impactful to the use of agency labor in June.\n\nOur operators are walking through as we speak and made very good progress in July. Let me dig into some recent trends even a bit more. From a demand standpoint, we always see first half of July as two last weeks, similar to the last weeks of December as families celebrate 4th of July weekend and don't usually move parents and grandparents in. This July, we lost an additional week.\n\nAnd as a result, almost a whole month was shut from a move-in perspective before we gain significant traction later in the month with tour activities returning to the levels experienced in June. We and our operators have a few theories of why that might be the case. One, the hyper-positivity rate of COVID over 20%. Despite people on a reporting to government, families know from home testing they're COVID positive and are delaying move-ins as they wait for this wave to subside.\n\nAnd number two, travel. Summer travel has surged as families took advantage of looser COVID restrictions. Again, I would describe this as our conjecture because we don't know for sure. But we are clearly seeing broad-based demand recovery continues, particularly toward the second half of the month in terms of leads and tours, which led to a recent rebound in move-ins across the portfolio over the last couple of weeks.\n\nOn the cost side, it is important that you understand the progress we made on the agency labor. In the U.S., most of our operators are decreased from June to July, resulting largely from a favorable net hiring trends. The July books have not closed yet, we're expecting a decline in agency labor expense in high-single-digit from month of June. In terms of net hiring, our operators have continued to make significant momentum with July increase alone in headcount nearly equal to the net hires of past six months of the year combined.\n\nAs a result, we're already starting to see benefit of this trend, which should reduce the dependence on agency labor in the second half of the year. The downside of high-frequency data is that you get a lot of noise. And I strongly believe that's what you're seeing in the numbers today, a lot of noise. I encourage my team and will encourage you not to confuse any short-term high-frequency noise whether good or bad as a signal and project that into the future prospect of the business.\n\nFor a few quarters, I've been talking about the run rate earnings or the true earnings part of this portfolio being significantly different from our current reported earnings. Clearly, some of the anticipated second half growth has slipped into the next year, but this should only be a timing mismatch. As we focus on '23 and '24, I continue to believe that this earnings part will shine through. Before I move on to the capital allocation priorities, let me make a comment on ProMedica.\n\nWhen we bought HCR ManorCare portfolio out of bankruptcy, we did not outsource our underwriting to rating agencies. Clearly, there was no way for us to predict a global pandemic or a day when almost every hospital system in the country would lose money similar to what happened in Q1 of this year because of COVID. We got comfortable because our basis of $57,000 per skilled nursing bed, we saw very minimal risk of pharma and capital loss, which is at the core of how we think about risk. Of all the structuring belts and whistles aside, which we're very proud of, we fundamentally believe investment basis not cash flow in a given building at a given point in time determines investment success.\n\nHaving said that, the ProMedica team has been able to make reduced agency labor almost by half over the last four months and significantly narrowed their operating losses. We have below-market basis and thus, below-market rent here. I remain very comfortable with our rent and longer-term expected IRR from this investment that we discussed with you when we did this deal four years ago. Turning to the capital deployment.\n\nI cannot overstate how favorable of an environment we find ourselves in today. During the second quarter, our off-market, privately negotiated transaction machine kept humming, having deployed an additional $1.1 billion of capital. Today, there is definite stress in the lending environment given the significant rate and credit volatility and increasing recession talk. Cap rates are going up across the board and most institutional capital is waiting to see where the chips fall.\n\nWe're seeing many high-quality opportunities, and we think the environment will only get more favorable as Fed continues to raise rate at a rapid clip. Our pipeline remains robust, having replenished after all of our Q2 and Q3 closings. Our fundamental investment thesis remains intact. One, we need to buy at a favorable basis relative to replacement cost; and two, we need to be able to add value through our platform.\n\nWe're not spread-investing deal junkies and instead remains laser focused on total return or unlevered IRR. I continue to believe this year will be a record year for Welltower from a capital deployment standpoint. Cost of capital has surged for everybody, including governments and access to capital remains very sparse for most people. In this environment, we remain in a very favorable capital position with $2-plus billion of equity capital that is raised but not settled and almost full availability of our $4 billion line.\n\nSellers who did not like our price six months ago are realizing that glossy broker package and nonbinding LOI are not cash in a bank. This environment reinforces the value of a counterparty like Welltower, which always acts on a very simple principle. We say what we do and we do what we say. And in that vein, as our long-term investors have come to expect from us, we exercise utmost discipline on every transaction we look at, large or small, and will not chase any deal.\n\nAs we have said in the recent past, price is the price, and we only act in a manner that creates long-term value for -- part share for our owners. With respect to capital deployment over the last 18 months, some of you have asked me if I'm satisfied with the performance of these properties. In many cases -- in the case of many of these acquisitions, including some larger ones, the answer is no. The same-store challenge that I have described above are accentuated in many non-same-store properties, which are being repositioned through operator changes.\n\nHowever, I do believe that we have turned the corner as we approach the completion of our operator transition and system integration for the COVID class of acquisitions. We should see significant progress from these properties as we enter next year. Please recall, we make investment decisions based on long-term IRR with an exit cap rate going up every single year from the duration of the ownership. And we feel strongly about achieving those return targets as we have discussed with you.\n\nAs frustrating as near-term challenges of operator transition might be for reported earnings and trust me, I share those frustrations with you, we have to do what's right for long-term interest of our owners. I will give you two examples. Vintage and Gracewell, two of the most ill-fated HCN acquisition from many months ago. Despite some of the most coveted locations and capex plans, these assets did not live up to our expectations.\n\nWe finally pulled the plug over last 12 months, frankly, because we're not permitted to do so earlier. Our Gracewell assets were transferred to Care UK and the Vintage assets were mostly transferred to Oakmont with one each to Kisco and Cogir. Oakmont has already made incredible progress with the first tranche of the asset they received last fall, with occupancy up 13%, and I believe you will see this repeated in the most recent tranche as well. Care UK is having similar success with Gracewell assets taking occupancy above 80%.\n\nAnd I believe they will be stabilized or get close to it in 2023. We made similar decisions for our other properties, which come with some short-term gain. But as we capital allocators strive every day to create per share value by compounding over a long period of time. While we hope near-term priorities do not conflict with those long term, practically speaking, we often encounter situations where those time horizons diverge.\n\nAnd it is critical for our investors to understand that at these crossroads, we'll always follow the path to long-term value creation at the expense of short-term gains. The good news is that all of these, as my partner, John Burkart, would say, is baked in the cake. With that, I'll hand the call over to John, who will describe to you perhaps the most exciting set of initiatives that will transform the business as we know today and creates tremendous value for our residents, team members, operating partners, and most importantly, our shareholders. John?\n\nJohn Burkart -- Executive Vice President, Chief Operating Officer\n\nThank you, Shankh. My comments today will touch upon the performance of our operating business and provide additional color regarding our vision for senior housing as well as an update on our platform initiatives. Starting with our medical office portfolio. In the second quarter, our outpatient medical business sequentially increased occupancy by 30 basis points and delivered 2.5% same-store NOI growth over the prior year's quarter.\n\nWe continue to see strong retention rates over 89% in the quarter, good demand, and rising new lease rates. Now turning to our senior housing operating platform portfolio. The recovery in the sector continues. As Shankh mentioned, revenue in our same-store portfolio accelerated to 11.5% in the second quarter compared to the prior year's quarter.\n\nAll three regions showed good revenue growth led by the U.S. and U.K. with growth of 13.1%, 14.7%, respectively. The revenue for the quarter was driven by a 500 basis point increase in occupancy and another quarter of healthy rate growth.\n\nSequentially, the portfolio increased occupancy 100 basis points during a period in which sequentially average occupancy has historically been slightly negative. While expenses grew at a rate of 10.5%, our operators continue to control export or expense per occupied room, which only grew at a rate of 3.5% in the second quarter on a year-over-year basis. And as Shankh indicated, we're encouraged by recent trends in terms of agency hiring and new hiring, which we believe should drive a deceleration in the second half expense growth. Despite short-term challenges driven by COVID, the tight labor market, and inflationary pressures, the portfolio delivered 15.4% year over year same-store NOI growth in the period, the second highest in the company's history with the U.S.\n\nportfolio generating over 20% same-store NOI growth. Going forward, we expect the portfolio to deliver outside NOI growth over a multiyear period with strengthening supply demand backdrop compounded by our efforts to optimize the business, which I'll get to shortly. Regarding the overall market, the traffic this summer has been influenced by COVID in various ways. For example, the traffic was very good in June and then fell significantly as expected for the 4th of July weekend and continue to remain low until it accelerated in the last couple of weeks of July.\n\nWe had total July traffic was about equal to total June traffic. We expect to increase traffic in the later part of July to lead to increased move-ins in August. The average occupancy for the portfolio in July was up over 40 basis points in the same-store portfolio. I also want to quickly comment on recent management transitions within the SHO portfolio.\n\nAs we make adjustments to our operators' portfolios and the related assets are in transition, we appropriately remove them from the same-store portfolio as they tend to underperform early in the transition and subsequently outperformed later in the transition which can create noise in the same-store portfolio performance. This is very similar to removing an asset for full renovation. Transitions take substantial amounts of time from the point of notice to the actual transition of management which negatively impacts staffing, sales leads, and other operational aspects of the asset. The challenges the new operator faces upon takeover are significant.\n\nHowever, over time, they get resolved. And of course, the assets performance improves over the pre-transition baseline, which is the purpose of the transition to begin with. The fact that we have 59 assets in transition is meaningful and that management is willing to take short-term earnings pain for improved performance in the future. If we had not removed transition assets from the same-store portfolio, our year-over-year NOI growth for the quarter would have been 14.9%.\n\nBottom line, strategic transitions are undoubtedly worth it, and they can drive significant value despite creating near-term noise for the same-store portfolio. Shifting to an update on the operating platform. Previously, I mentioned the opportunity to fundamentally change the growth potential of this business by creating a full-scale operating platform and bringing operational excellence to our senior housing portfolio. In terms of industry life cycle, I would place the senior housing business in the infancy phase, but rapidly transitioning into the growth phase.\n\nThis is very similar to the multifamily business years ago, whose transformation I witnessed firsthand. Businesses that are in infancy phase of the industry life cycle focus on effectiveness, which is essential. Without it, the business would not be able to exist long term. As an industry transitions from the infancy phase to the growth phase continuing to remain effective as the core objective is essential.\n\nHowever, the winners focus on operational excellence, including efficiency. The analogy that I've used is the diner business of the 1950s. To survive and thrive, you had to serve a good meal, a good burger, fries, and shake in the case of the McDonald Brothers. However, to grow as the industry moved from its infancy to growth phase, a focus on operational excellence was imperative, including an obsessive focus on efficiency, which is what Ray Kroc did when he franchised McDonald's.\n\nThe senior housing operators faced many small business challenges, including the inability to recruit and retain top talent and key functions from technology and data analytics to process and facilities management due to their size and inability to compete from a compensation perspective. Additionally, the fee-based structure limits the economic incentive to fully invest in optimizing the business as an owner operator would. For example, if a fee manager has paid 5% of revenues, the most they would logically spend to collect $1 of revenue is $0.05, whereas owner operators would theoretically invest $0.99 to collect $1. As you all know, we have worked to change this unfavorable incentive structure through our aligned RIDEA 3.0 contracts.\n\nAnd we are now working on our next generation of contracts that will provide Welltower with a greater ability to help address senior housing operators small business challenges. These challenges are across the board, including basic functions to illustrate in a relatively simple areas such as billing. In the two reviews we performed, we identified that Care revenue was underbilled by 25% or more, meaning that the necessary quality of care was provided to the resident. However, they were under billed.\n\nOther challenges are much greater, including keeping up with modern consumer expectations such as buildingwide, high-speed internet connectivity, identifying and integrating quality technology systems, and creating and delivering real time, insightful and actionable reporting to improve operational results. Focusing on operational excellence is more than a digital transformation. It's about people, processes, data, and technology, recognizing that everything starts with people. Our residents living at our communities, the employees serving those residents, and the operators leading the effort.\n\nWe start by focusing on the customer experience and the employee experience and optimizing the various processes. Then we evaluate the data that may -- that we may leverage to draw meaningful insight into the business in a way that improves the experience of the various stakeholders. Finally, we implement cutting-edge technology to simplify and automate the processes as we will provide real-time actionable, insightful information, improving the customer and employee experience while optimizing results. This isn't simply about buying the latest software.\n\nIt's about fundamentally transforming the business. Over the years, many businesses have transformed from buying books to used cars to buying homes and finding vacation rentals. Digital transformations have fundamentally changed these businesses and improved the overall experience. One of the key imperatives of operational excellence is the recognition that data is the asset.\n\nThere is no entity in this space better positioned to leverage data than Welltower as we are effectively building the operating platform to improve the overall experience on what we call Alpha, our data analytics platform that has been developed over the last 6 years. Welltower will improve the customer and employee experience and create shareholder value through leading transformation of the business. I have gone from full immersion and observation to planning and now action mode. I will not give away all the details of my future playbook, but I will say the following.\n\nWe are moving very fast. Several recent highlights include forming an internal multidisciplinary team of experts focused on improving the senior housing operations in Q2, hiring a chief technology officer in Q2 to lead the technology aspect of the operating platform, completing the implementation of Welltower's ERP last week, which is central to this effort. And frankly, I want to thank the Welltower team that executed this massive project with great speed and excellent execution. Initiating a data analytics pilot on the correct information that we have available with an expected rollout over the next 6 months, this step alone will enable us to start driving value.\n\nFinally, creating the sales force automation plan with expectations to launch a pilot in early 2023. We have numerous other modules in the works and we'll update as appropriate. Although this is a huge effort, Welltower is uniquely positioned to execute it faster than historically possible. Our strategy is to leverage existing quality modules and only create new modules where they don't exist or where they give us a strategic advantage, such as our revenue management module, which we're developing.\n\nAnother unique benefit that Welltower has relates to the number of top-quality operators in our portfolio. We are separating the pilots of the modules into parallel initiatives, each with a different operator, which will minimize the potential delays that can be caused by a lack of employee bandwidth or overall fatigue and have slowed down other transformations. Ultimately, as we perfect each module, we will then rapidly roll it out to the broader group. This business transformation will continue to deepen and widen the moat Welltower has built while improving the overall experience of all stakeholders.\n\nI'll now turn the call over to Tim.\n\nTim McHugh -- Chief Financial Officer & Senior Vice President\n\nThank you, John. My comments today will focus on our second quarter 2022 results. The performance of our triple net investment by each quarter, our capital activity, balance sheet liquidity update; and finally, our outlook for the third quarter. Welltower reported second quarter net income attributable to common stockholders of $0.20 per diluted share and normalized funds from operations of $0.86 per diluted share, which included $17 million of private relief funds from the Department of Health and Human Services, approximately $11 million or $0.02 per share more than what was assumed in our initial guide for the quarter.\n\nThis quarter representing our second consecutive quarter with a year-over-year normalized FFO growth since the start of the pandemic, a positive 8.9% or 7.7% when normalized on HHS funds received and year-over-year changes in FX rates. We also reported our second consecutive quarter of positive total portfolio same-store NOI growth of 8.7% year-over-year growth. Turning to our triple net lease portfolios. As a reminder, our triple-net lease portfolio coverage and occupancy stats reported a quarter in arrears.\n\nSo these statistics reflect the trailing 12 months ending March 31st, 2022. In our senior housing triple-net portfolio, same-store NOI increased 9.9% year over year, driven by improvements in rent collections and leases currently on cash recognition and the early impact of rental increases tied to CPI. Trailing 12-month EBITDAR coverage increased 0.01 times to 0.83 times in the quarter. Next, our long-term post-acute portfolio grew same-store NOI by positive 2.8% year over year, and trailing 12-month EBITDAR coverage is 1.31 times.\n\nAnd lastly, health systems, which is comprised of our ProMedica Senior Care joint venture with the ProMedica Health system, which had same-store NOI growth of positive 2.75% year over year and trailing 12-month EBITDAR coverage was negative 0.29 times as operation continued to be impacted by high agency utilization in the first quarter. Turning to capital market activity. We continue to enhance our balance sheet strength and position the company and capitalize on our robust and highly visible pipeline of capital deployment opportunities by utilizing our ATM program to efficiently fund those near-term transaction. At the start of the second quarter, we sold 18 million shares via forward sale agreement at initial weighted average price of approximately $87.67 per share for expected gross proceeds of $1.6 billion.\n\nWe currently have approximately 22.5 million shares remaining unsettled, which are expected to generate future proceeds of $2.0 billion. Taken together, our unsettled equity proceeds includes some committed OP units on pipeline deals and $257 million of expected property dispositions and loan payoff proceeds, totaled $2.3 billion in equity capital, providing ample capacity to fund our current investment pipeline. During the quarter, we closed on an amended $4 billion unsecured revolving line of credit, along with an upsized term facility comprised of a $1 billion term loan and a CAD 250 million term loan. At quarter end, when factoring cash and restricted cash balances, our liquidity position exceeded the $4 billion of borrowing capacity on our line of credit.\n\nAnd when combined with the previous mentioned $2.3 billion of unsettled equity proceeds and expected disposition proceeds, we remain in a very strong liquidity position. Lastly, moving to our third quarter outlook. Last night, we provided an outlook for the third quarter of net income attributable to the common stockholders per diluted share of $0.12 to $0.17. And normalized FFO per share of $0.82 to $0.87 or $0.845 at the midpoint.\n\nThis guidance includes $7 million with HHS funds expected to be received in the third quarter. Excluding HHS funds, guidance represented a $0.005 increase at the midpoint from 2Q normalized FFO. The $0.005 increase composed of $0.025 from incremental SHO NOI growth and SHO investment activity and $0.01 from performance across the rest of our investment segments and from lower sequential G&A costs. This is offset by $0.03 of higher floating rate interest costs and unfavorable FX rates.\n\nUnderlying with FFO guidance is estimated third quarter total portfolio year over year same-store NOI growth of 7% to 9%, driven by subsegment growth of outpatient medical, 1.75% to 2.75%, long-term post acute of 2.5% to 3.5%, health systems of 2.75%, senior housing triple net of 5% to 6%, and finally, senior housing operating growth of 15% to 20%, driven by year-over-year revenue growth of 10%. Underlying this revenue growth is an expectation for approximately 400 basis points of year-over-year average occupancy growth and continued robust rate growth. We continue to be pleased with the momentum of the top line recovery in our senior housing operating portfolio, driven by a combination of rate and occupancy growth. As I remarked last quarter, as we realize the recovery in our core portfolio, we have made the conscious decision to steadily allocate capital to distress under-operated, and often initially diluted properties, along with high-quality development projects.\n\nWhile this capital allocation is the effect of offsetting some of our core growth today, it was substantially amplified in years to come. And with that, I'll hand the call back over to Shankh.\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nThank you, Jim. If I may distract you all from the short-term noise and focus on the main drivers of long-term earnings and cash flow per share growth, there are really four large buckets that we must pay attention to: occupancy, rates, labor cost, and external growth. In 2021, whenever we're hit by a massive COVID wave, it felt as though we are taking one step forward and two steps back in terms of occupancy, rates, and labor costs. Thankfully, the health impact of COVID has been getting more mild and the psyche of the population has significantly improved.\n\nNow we are taking two steps forward and one step back in terms of occupancy and labor cost and it appears from the July trends that we're making that one extra step back forward very quickly. So COVID impacts are getting less pronounced and rebounds are getting quicker as we learn how to live with COVID. Despite the reported issues of agency labor, the team member count in our communities has grown significantly offlet and we have not seen any let up -- though we have not seen any let up of the cost of labor, there is no question that we have seen the availability of labor increase meaningfully offset. The portfolio has almost the same net hiring in July as we had in the first six months of the year combined.\n\nThough our operators have had success in net hiring members over the last few months, as you can see from the case studies on Slide 7 and 8, it appears that the labor market is finally on demand from the significant success of hiring trends in July. Assuming these trends continue, this bodes very well for agency labor cost as we get a second half of the year. And where we continue to make the largest strides is through pricing power. The recent COVID spikes have not in any way dulled our operators' ability to push through strong rates.\n\nWhat is particularly encouraging is the street rates, which are up from high-single digits all the way up to 15%, 20% in case of some large operators. Given the sharp acceleration in growth of the senior population and plummeting new supply of few projects penciling for developers today, our confidence in driving occupancy and rate growth for the next few years continue to strengthen. As for external growth opportunities, our prospects, which have been very good are only getting better, the willingness of owners to transact has grown over the last two years as they struggled with COVID-related challenges and debt maturity. And now with recent surge in borrowing costs and tighter lending standards that are keeping many bars at bay.\n\nIf we overlay all this with how John is fundamentally transforming our business, I have not been more excited of the future prospect of our firm. We know we need to translate all of this into significant higher earnings run rate and cash flow per share and our team, which thinks and acts like long-term owners is hyper focused on that mission. With that, we'll open the call up for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Michael Griffin with Citi. Your line is open.\n\nMichael Bilerman -- Citi -- Analyst\n\nHey. This is Michael Bilerman here with Griff. Shankh, I was wondering if you can just step back and look, I appreciate the comment about the downside of using high-frequency data and the noise and effectively not to confuse the short term, whether it's good or bad to protect on the future. And you guys have been very all over COVID providing us a lot of business updates.\n\nAnd I think back in June, you use that data to lift guidance, right? And you issued the business update. And so I'm trying to understand whether you're thinking about a change and how you communicate to the Street and the reads that you're feeling, right? Because you took that data and you lifted the Street and you raised a bunch of equity and now things are a little bit lower. And I'm wondering, as you think about that short term, whether it makes sense to really start putting out the building blocks for all these things that you've done, I mean 20% of the portfolio has been bought since the late to 2020 and start to pencil that out on a three- to five-year basis and go through all the building blocks of all the deals you've done, the 120 assets that are negative cash flow and all these things to try to model out where that future growth really is because of all of these, what you call them noise today?\n\nJohn Burkart -- Executive Vice President, Chief Operating Officer\n\nYeah, Michael, I'll start with that and then Shankh can come in. I think the point on NAREIT and the guidance change there. I think Shankh spoke to this in the script. But we've tightened guidance at NAREIT based upon the trends that we saw and those trends reversed toward the end of the quarter and up toward the lower end of that range.\n\nSo I hear you on the high frequency of data and frankly, what we've been trying to do give updates because the longer-term view has been tougher to project. And given COVID is a backdrop, right? And we've been trying to balance essentially since we've been able to provide less of that long-term view to provide more of that short-term information. And I will speak for Shankh, if you can give a comment on this. But I think part of the commentary on the short-term noise is just trying to see the long-term trends continue to be strong in the recovery side.\n\nAnd we're certainly focused on that, and we continue to evaluate that piece of it. And although we understand the market's need for frequent updates on data, we're trying to make sure that you see how we're looking at it and keeping our long-term focus on kind of the core fundamentals of the business.\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nYeah. I'll just add one thing, Michael. As I mentioned, if you look at when we got hit by wave five when we were at second half, it was about a week after NAREIT. And that impact, which is sort of followed through about the middle of July.\n\nAnd you probably have noticed that we provided another business update a few weeks ago, is to make sure that everybody knows that our view has changed because of things that we talked about in NAREIT. So there was another business update, not just the ones that you mentioned. So we have -- we provide information as investors know. They see what we see.\n\nBut fundamentally, as I mentioned in my last quarter call that all our -- we tell you how we think, but if we get hit by a COVID wave, we're better off. I mentioned that in the last call, I mentioned that in five calls before that, and that continues. The good news here is with every passing wave, we're seeing the impact is lessening. And we're seeing the rebounds are getting faster.\n\nBut the fact of the matter is we just went through one and rather we're sort of coming toward the tail end of one. And we have no way to project how and when we're going to see COVID in our communities. That's just not what we can do, and I'm not aware of anybody else can do. We're just telling you as we are seeing things, but we're hoping at least we're trying to help you understand the fundamentals of the business, right? For example, if you can see, there's a tremendous amount of, obviously, noise on the agency labor.\n\nIf you look at, that was obviously reported quarter of June, we see a pretty meaningful improvement in July. But if you truly see the improvement that we are excited about, it's the net hiring number because July net hiring number doesn't impact July agency numbers, right? It's sort of -- there's a lag between when you hire people versus when they impact your numbers because you got to train them and there's a lag between when you hire them and then they hit the floors, etc, right? So we're just telling you what we are seeing. And it's important that we communicate if trends change because of COVID and otherwise. But we -- I hope that you appreciate that we remain transparent, and we report things to you as we see things.\n\nAnd if things change, things change.\n\nOperator\n\nOur next question comes from Vikram Malhotra with Mizuho. Your line is open.\n\nVikram Malhotra -- Mizuho Securities -- Analyst\n\nThanks for taking the question. So maybe, Shankh and John, Tim, as well, I just want to kind of take the pricing power comments you echoed and just think about leaving costs aside, as you mentioned, COVID comes and goes, it's tough to predict. But would it be unfair or unreasonable to say given what you're seeing on the bumps, the releasing spreads, as we head into '23, given demand-supply, pricing power should only accelerate, and I should not be surprised if we see call it, a mid-to-high single-digit RevPOR growth for a couple of quarters? And lastly, can you just translate that pricing power into your latest thoughts on margins in the senior housing space?\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nVikram, I'm not going to get into sort of giving you guidance on pricing power in particularly for next year's pricing power. But I will tell you that we are seeing that Street rates are significantly accelerating. There has been talks -- not talks. I mean I was in the U.K.\n\nfor a few weeks. Our U.K. operators are talking about giving a midyear pricing increases in September-October time frame. I've not seen that before.\n\nThere are some talks of U.S. operators thinking about something of that nature. But most importantly, Street rates are just going up very significantly. So all this should translate into continued pricing power in our portfolio, especially if you look at next year, demand-supply is even more favorable, right? But we're trying to optimize the revenue growth and frankly, so from our standpoint, we think that pricing power should continue.\n\nAs you can appreciate that we had pricing power last year, right? So we obviously had RevPOR growth. We continue to push that, and we'll -- as we move forward, you'll see that we'll continue to push that pricing power. As I've suggested before, the two types of pricing power that you should see. Frankly speaking, the one you are seeing today arises from the need of pushing pricing because of cost inflation, and that's sort of we're sort of going through that.\n\nBut as we stabilize different buildings, you will see another set of pricing power which is we're raising prices because we don't have a lot of rooms to sell, right? So hopefully, you see a lot of that going through next year.\n\nOperator\n\nOur next question comes from Daniel Bernstein with Capital One. Your line is open.\n\nDaniel Bernstein -- Capital One Securities -- Analyst\n\nHi. Good morning. I just wanted to ask something quickly about the differences in labor cost growth between AL, then Care and IL wellness, and how that's factoring kind of into your capital allocation of what you want to buy and invest in?\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nYes. So on the wellness side, there's not a lot of cost, right, on the people side. So you don't have that. Though, I will say that sort of cost mostly driven by taxes as well as the energy cost increase.\n\nOur capital allocation is not driven by what we think of labor. You can just price that in. It is driven by what is the opportunity set, was the price relative to what the replacement cost is. So that's how we think about it.\n\nAnd if we have to think -- let's just say that you come with this idea that labor cost is going to be high forever, which I don't think it's going to be the case. Labor cost has been a problem for this industry for a very long period of time. And as I said, we are finally probably see that it's on the map, right? We'll see whether how that plays out, but we'll likely probably see the first sort of shot across the bow. But you can absolutely price that in.\n\nWe're price-driven investors, not necessarily. So we take some thematic ideas and just run with it because you can price that in. Hopefully, that's helpful, Dan.\n\nOperator\n\nOur next question comes from Jonathan Hughes with Raymond James. Your line is open.\n\nJonathan Hughes -- Raymond James -- Analyst\n\nHey. Good morning. Could you just talk about the recurring capex spend trajectory? I see it is expected to kind of more than double through September from last year's pace. Is that higher spend due to some deferred or lower spending in the past few years during lockdowns and we're just catching up? Or much higher construction costs, a bit of both? And then kind of an extension of that, how that capex spend should trend in the next year and help fuel, increased competitiveness of your properties and ultimately, revenue growth potential? Thanks.\n\nTim McHugh -- Chief Financial Officer & Senior Vice President\n\nYeah. I'll start with that, and then John can add anything. Part of it is -- we have been certainly in 2010 -- 2022 playing a bit of catch-up in the costs of senior housing space and just the buildings being less accessible over 2020 and 2021. And then efficient for us a lot of the acquisitions we've made have had substantial value-add opportunities.\n\nSo we've highlighted that with some of the larger ones and explicitly stated how much kind of redevelopment capital or value-add capital we put into it. But I think that's what's driving that right now is a combination of a little bit of deferred or catch-up capital from a period of time in which the buildings were for safety reasons less accessible. And on top of that, we put a lot of capital to work into opportunities that have high return value-add investment.\n\nJohn Burkart -- Executive Vice President, Chief Operating Officer\n\nYeah. And I'll just add. You're actually pulling something from a certain sense from a future script because I talked about the operating platform. The next initiative that I'm focusing on in a big way or workflow really relates to capital and internal investments, what I'd call it as how we reposition the portfolio, our senior housing business portfolio age is at the absolute sweet spot, just right under 20 years old on average, providing tremendous opportunities to reposition those assets.\n\nSo I'm actually building out a capital team right now, and we will align our capex with our value-add initiatives and drive pretty substantial value over the coming three to five years. So it will be a very big effort, and we're at the very front of that effort right now.\n\nOperator\n\nOur next question comes from Austin Wurschmidt with KeyBanc Capital Markets. Your line is open.\n\nAustin Wurschmidt -- KeyBanc Capital Markets -- Analyst\n\nHey. Great. Thank you. I'm just curious for the 120 senior housing facilities currently generating negative cash flow, what is the NOI drag from those facilities? Can you give us what percent of the $538 million of total NOI upside in SHOP that they represent? And do you expect them to stabilize at a faster pace than the overall portfolio?\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nWell, Austin, we're not going to give you a number on how much capital -- how much cash flow that's losing today? Maybe I'll talk to Tim and see if we can kind of quantify that for you. Should they grow faster, the answer is obviously, yes, right? They are losing money because they're at a lower occupancy. And as they stabilize over, say, a number of years, just from the base they're coming out of, and if you think about the trajectory of the margin, they should grow faster. But a lot of these properties have been recently built or we bought the properties at a very, very low occupancy, right? So if you look at the last tranche of, for example, the StoryPoint acquisitions we did, I think the average occupancy was like 40%, right? So if you think about it, average age of the portfolio, I think that we bought is between two to four years, and they're at 40% occupancy.\n\nSo there's no question, there's a lot of those buildings that opened in last year, year and a half, and we bought a lot of these things, right, from developers, from multifamily developers, from banks. They're just a drag. But the point here is they're not a sequential sort of a linear progress to your NOI growth, right, as they go from a negative sort of margin to the margin inflection and that sort of margin grows after you hit the J curve, right? So that's sort of the way to think about it. I mentioned that for you to understand that something very simple, right? Just take an example of our East 56th Street property.\n\nThat property opened even and a half months ago. It's what? It's probably low 30% occupied today. And our average rate of those residents that we have received of the people who are living there is $23,000, $24,000, OK? Clearly, that has negative margins. But you would think about it as we thought about that property when we developed it, we're getting significantly high rates and trajectory of lease up is doing better than we thought.\n\nStill, that's a negative value add. So as you think about negative value, as you think about putting a multiple on our income, understand that you are valuing 120 buildings at a negative value. That's all. So I'm not going to add anything more to that at this point, but something to just reflect on what's sort of dragging on our earnings and cash flow today.\n\nOperator\n\nOur next question comes from Derek Johnston with Deutsche Bank. Your line is open.\n\nDerek Johnston -- Deutsche Bank -- Analyst\n\nHi, everybody. Good morning. On John Burkart's operational initiatives, what's his team hoping to accomplish and really to build confidence these endeavors can bear fruit, how are you guys measuring success? And what's the upside here?\n\nJohn Burkart -- Executive Vice President, Chief Operating Officer\n\nThe measuring success -- actually, let's go back to what I hope to accomplish is, again, really bringing modern processes, technology, etc, to the business. And to give you an example, a very specific example. So one of the things I tested when I came in as I tested how we respond to our customer, customer experience. And what I found out after about 200 customer inquiries, was that 50% were never returned.\n\nAnd of the 50% that were returned, the average time was about 13 business hours. So if a family member needs help on a Monday, and my father falls or something like this and I decide he needs to go into assisted living. I might get a call back on a Wednesday or I might not ever. That's a horrible experience and that is a very solvable situation.\n\nIf you look at the current CRMs that are in place, they're basically relying upon the salespeople inputting data. It's like I write a sticky note. I put it in a file. That's my CRM.\n\nIt's glorified because it's electronic, but it's the same thing. So for example, I went to one of our large operators and gave them their results, which were six out of six calls did not get returned, six out of six, zero return and they said, \"Gee, I'm shocked because I'm looking on my desk at our report, our pretty report, PowerPoint report that shows that 85% of the phone calls that come in, we respond to it in an hour.\" So that's shocking, but this is all something that we can work ourselves through because you can just test it yourself. That said, but first, tell me how does that get reported. And he said, \"Well, it gets reported because our salespeople report it themselves.\" Well, there in lies the issue.\n\nThe tracking systems weren't in place, etc, etc. It's really a bunch of sticky notes from a receptionist that get lost and picked up by the janitor and the calls get lost. So that's the type of professionalism that we're going to apply to the business, and the results will be to the financial benefit, most obviously, increased occupancy, increased rates and a better overall experience for the consumers. So that hopefully answers the question.\n\nAs far as the details and time lines, we're obviously not giving that out.\n\nOperator\n\nOur next question comes from John Pawlowski with Green Street. Your line is open.\n\nJohn Pawlowski -- Green Street Advisors -- Analyst\n\nThanks for the time. I appreciate the case study pages showing that you're hiring in recent months. I guess I still don't have a sense for the magnitude of understaffing, assuming occupancy starts climbing. So to the extent we get positive surprises on the occupancy upside is next six to 12 months, are you going to have to lean on agency expense to kind of meet that demand? Or do you think properties on average or staff properly right now to handle additional occupancy?\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nI think, John, that's a very fair comment, which I should -- we talked about July was obviously a very positive month for net hiring. And we hired for the portfolio overall, our operating partners have hired as many people in July as they did 6 months ago. But what we haven't told you that hiring puts us finally to a 2% plus above what the total number of employees were last year. We should have added that.\n\nIt's a fair question -- comment from your end. So as you recall, this whole agency sort of cost drama started about a year ago, and we have finally worked our way through that with this July hiring, we're finally about 2% above where total employee count was on a net basis above last year. So what you're saying is possible, but I would say probably unlikely as we are finally seeing, as I said -- I talked a little bit about that, that our operators have been talking about the overall availability of labor is increasing in June. It feels like, again, I'm going to be very careful how I describe it because it is not that we know everything that's happening.\n\nBut it feels like that finally that labor market is under-met from -- at least from an availability for sure, it's on demand. And hopefully, that translates into price of labor in not a distant future, but at this point, at least, we're hopeful -- not just hopeful, we're seeing it in the numbers that agency lever, which were obviously pretty ugly number in June, but has came down in July. And hopefully, obviously, there's net hire numbers in July, you'll see that should impact pretty positively as we get toward the end of the quarter.\n\nOperator\n\nOur next question comes from Steven Valiquette with Barclays. Your line is open.\n\nSteven Valiquette -- Barclays -- Analyst\n\nThanks. Good morning, everybody. I wanted to actually touch on the study that you just answered, but I guess the -- just to frame it slightly differently, not to get redundant here. What percent of total open positions across all the senior housing were filled in July? If you think of it that way, are we talking 75%, nearly 100%? I think that's 2% above where you were before, it's still kind of hard to -- I guess, frame that perfectly in our own minds.\n\nSo another thing is just on the double staffing, what's the typical time period of training where you have that double staffing? Are we talking weeks or months? Just any rule of thumb would help around that, too, as we think of magnitude of potential expense reduction for 3Q versus 4Q, etc. Thanks.\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nSo net hiring in July was about 3%, just about 3% of total employee count. And you should think about the second half of your course should think about weeks, not months. So July hire should impact August and September sort of agency numbers. There is a case study that you can see on Page 7 and 8.\n\nPage 8, will show you, this is an interesting case, right? Page 7 and 8 has two large operators, which constituted roughly half of our agency labor costs. Page 7 would show you an operator who has already made the strides and the cost has come down meaningfully. Let's just say, call it from a $2 million a month to, call it, $0.5 million a month. Rough numbers in a matter of four months, call it, from April to July.\n\nThe Page 8 shows you an operator, which actually has it. The numbers have been pretty much flat from June to July. But if you look at the number of hours booked, that has come down pretty significantly which tells you if that trend continues, they should see significant improvement in August and September, right? So didn't take just two examples. I want to give you diversity of example and two consequential examples with sort of two constitute of pretty much half of the total cost.\n\nBut hopefully, that sort of gives you a sense of what we are seeing. Rather than predicting the future, we're sort of giving you the positioning of our portfolio, which probably should help fully translate that into the future.\n\nOperator\n\nOur next question comes from Mike Mueller with J.P. Morgan. Your line is open.\n\nMike Mueller -- JPMorgan Chase and Company -- Analyst\n\nYeah. Hi. I was wondering, can you tie together the 4.5% same-store revenue growth -- RevPOR growth? And maybe talk a little bit about the sequential trend there relative to Q1? And can you dissect a little bit and talk about roll downs and just, I guess, pricing by unit type?\n\nTim McHugh -- Chief Financial Officer & Senior Vice President\n\nYeah. Yep. And I will -- on the RevPOR side, I think the way to think about it is we talked about this last quarter, but we get a large amount of -- half of our portfolio roughly resets on Jan 1. So you see that occurred -- that part of the portfolio actually happened to also be heavily weighted toward our higher acuity unit types.\n\nThe Jan 1 increases tend to be the daily billers. The daily billers are the part of the business that have your higher acuity assisted living weighting. So you saw those increases in the first quarter and what you're seeing now kind of spreading from the first quarter to the second quarter is we've talked about in this business, historically, you've seen kind of 10% or high single-digit roll-downs between move-in and move-out rates. A lot of it's acuity related, but that's actually -- that got as wide at 20-plus percent last year and it started to tighten into the mid- to low single-digit range.\n\nSo you're seeing some of those Jan 1 increases, I'd say bleed off a little bit with there is still some negative leasing spreads on that, and that's being offset by annual increases that are hitting throughout pretty much evenly throughout the year and the other half of the portfolio.\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nAnd as I mentioned, my last call, right, if you have pretty much a scenario, which we haven't seen in a long time, which is if Street rate continues to go up, the weight is going up. That gap will continue to narrow. And sort of -- it is conceivable that they come very close. We have seen a couple of operators where actually it has crossed over.\n\nBut there's a -- portfolio-wise, it is conceivable that they come very, very close and that negative releasing spread that comes from the acuity clip that Tim talked about goes away. And so but remember, what we are also talking about, this is sort of a problem that you chase again as you raise -- you send the in-house increase letters again, right? So and you change that number again, right? So this is a phenomenon. But frankly speaking, we haven't seen in a long time, eight or nine years where Street rates are getting very close to in place. So we're pretty encouraged by that.\n\nOperator\n\nOur next question comes from David Rodgers with Baird. Your line is open.\n\nDavid Rodgers -- Robert W. Baird and Company -- Analyst\n\nYeah. Good morning. Shankh, you and Tim both mentioned ProMedica, I think, in your prepared comments. And you went through some of the coverage ratios and agency labor statistics and basis.\n\nBut I was kind of curious the fact that you spent a little bit more time this quarter, was that just related to where their coverage has gone and you're reiterating comfort with that? Or are you having conversations or have they approached you about maybe making changes? I guess that would be the first question. And the second question is what about that portfolio relative to the other portfolio that you own has made them kind of lag in some of the recovery statistics that you've mentioned? Thanks.\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nYeah. So I'm going to be -- I'm going to repeat what I said before. First is, understand, a lot of that portfolio has a skilled nursing, which has been impacted, obviously, very significantly. And it has been a very significant hit from agency labor in that portfolio.\n\nWhat we report is a one-quarter lag sort of a four-quarter average type of EBITDAR. What I mentioned, if you look at -- reread the transcript, you will see that the improvement that they have seen has happened really in the last four, five months. And that they have significantly narrowed their loss as occupancy has gone up and agency labor has come down, right? So that's sort of the overall underlying picture of what's happening. It is very important for you to understand, as we have described before, that rent doesn't come from the four walls of those -- right, that went with the only reason we did that transaction, -- they -- and we mentioned this before, that rent was guaranteed by the mile shift, right? So that's very important for you to understand where that lies.\n\nAs I mentioned again, I'm going to say this again, as I've mentioned before, right? We fundamentally believe that below-market basis translate into below-market rent, like there's nothing -- there's no special insight into that. If you have a low basis and your market rent constant, you will get to a lower market rent, right? So on an average basis -- for example on the average basis, the ProMedica portfolio is roughly around $7,000 per bed of rent. If you look at any other skilled nursing provider, let's just take an example of Omega, you will see the average rent is about $10,000, right? So that sort of gives you a sense of if everything was exactly the same, the rent is 30% below, right? So they sort of give you order of magnitude. I'm not talking about specific because it's hard to compare assets from portfolio one to portfolio two, but that would give you a sense, which gives us a lot of comfort that about: a, first, our income from that portfolio; and b, what we strive to do, which is to achieve long-term returns as we deploy capital.\n\nAnd as I mentioned, I'm going to mention it again, I remain very comfortable that we're not losing our sleep over that income or that return from that portfolio.\n\nOperator\n\nOur next question comes from Nick Yulico with Scotiabank. Your line is open.\n\nNick Yulico -- Scotiabank -- Analyst\n\nThanks. I was just hoping to understand for the operator transition assets in senior housing. What's embedded in the guidance for the third quarter about any incremental sequential NOI drag there since I think you said those assets are not in the same-store calculation? Thanks.\n\nTim McHugh -- Chief Financial Officer & Senior Vice President\n\nYeah. Correct. They're not in the same store. So the assets, just to clarify, the assets that we -- in our July business update, that we talked about transitioning, those are still in the same-store portfolio, they completed the quarter in -- under the management of the prior manager.\n\nAnd then they're coming out going forward. From a sequential basis, we expect a slight drag from a non-build perspective, about 0.5% from those transitions.\n\nOperator\n\nOur next question comes from Rich Anderson with SMBC. Your line is open.\n\nRich Anderson -- SMBC Nikko Securities -- Analyst\n\nHey. Thanks. Good morning, everyone. So I think we all get the message here on the short term versus the long term, but I want to see if I can get some kind of quantitive evidence of that.\n\nSo the occupancy guide for the third quarter is 400 basis points year over year, and that seems to imply 120 basis points sequentially, which compares to 100 basis points sequential in the second quarter. So we didn't get the seasonal pop in occupancy and understand for the reasons you described. When you were sitting in your seat at NAREIT and you were thinking about the third quarter at the time, how much do you think we lost by virtue of what happened with the COVID wave in June and the kind of the lost month of July? And where do you think the sequential number, landing at 120 basis points as of now, would have been, if not for the disruptions that you faced after NAREIT?\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nYeah. So let's just -- I'll take the essence of your question, and there's no debate about the fact that for -- specifically for third quarter, and I mentioned this in my script that some of the growth has leaped into next year because we're not getting that growth in the third quarter. Why? Because we lost the month of July, right? So if you lose your traffic that much in first half of the month, it's very, very -- it's almost impossible to recover from that as you think through the sales cycle of tours translate into sales, right? So it's very important for you to understand that lost month with sort of -- it's a very important month, right? So we got an average occupancy growth in that month, as John said, about 40-plus basis points, there should have been double that. And that's was not the case because we got hit.\n\nSo the only good news here, as I will suggest to you, and I think John mentioned this in his script, that we started first, call it, first 10 days, first 15 days of July, but tours were 40% below June, like with just the market just went away. By the time we ended the month, we caught up on a cumulative basis almost to the 95% of June. So if you think about, you start at a 40% hole, and you end up at a 5% hole, that sort of suggest to you, there's a remarkable progress made in the second half. And that's sort of we're seeing that now the move-ins are coming back on back of the tours.\n\nBut by no coercion, but absolutely no coercion, Rich, that we -- because of this COVID hits are sort of, just call it, try to be specific on something that it can be that we saw between mid-June to mid-July, has hit our June numbers on an expense basis, which sort of recovered in July or at least hopefully recovered a lot in July, and it hit revenue because all the tours went away, it hits revenue in July. I hope that sort of gives you a sense of how this wave hit us and how that translates from one side of the quarter from the other side of the quarter.\n\nOperator\n\nOur next question comes from Michael Carroll with RBC Capital Markets. Your line is open.\n\nMichael Carroll -- RBC Capital Markets -- Analyst\n\nYeah. Thanks. John, I know you're hesitant to provide too many details on your data plan, but I wanted to touch on your comments in your prepared remarks that Well is initiating on a data analytics pilot that's expected to roll out over the next six months. I guess what does this actually mean? And how does this different from the company's current data analytic programs that you have right now?\n\nJohn Burkart -- Executive Vice President, Chief Operating Officer\n\nYes. So, it's better to look at it versus the operating platform. So the operating platform will drive -- will provide tremendous amounts of data because we'll be able to gather all the nuanced information from the web hits the traffic all the way through. But currently, we can gather more information from our operators, and that's really the opportunity that I'm taking midterm is to gather some more.\n\nSo we've been working with our operators to connect. And in this particular case, we connected with our cloud system to pull down on a daily basis the information that they currently have from the platforms that they're currently using. So we haven't done that level of detail before. We get good reporting from them, but now we're upping that gain.\n\nAnd so from an interim basis, that will inform us much better than we have right now from an operating level. The company -- what the company has done from the investment side is untouchable. But from an operating perspective, there's some more opportunities that I'm going after and that should help us from an asset management level.\n\nOperator\n\nOur next question comes from Juan Sanabria with BMO Capital Markets. Your line is open.\n\nJuan Sanabria -- BMO Capital Markets -- Analyst\n\nHi. Good morning. Just a longer-term question, I guess, you noticed some transitions happening and near-term drag for a long-term opportunity. But at this point, how should we think about the risk of further transitions into 2023? Are you confident that we're past 90% of any potential transitions? Or is that just part of the business where there's always going to be some laggards and maybe like I think about kind of Goldman calling 10% of the staff annually.\n\nIs that kind of the way we should think about? There's always going to be some underperformer you're going to kind of rectify that as things go? Or is this kind of -- we're at the end of that, given where we are in COVID and cyclically?\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nSo, Juan, I think the way you should think about it for the COVID class of acquisitions that we have done, the transition, operator transition, system integration, all of those things are reaching nearing completion, right? So they are nearing completion. Now from the perspective of what you are asking, which is more of a philosophical question than a planning question, right, we are of the belief that you have to earn your keep if you want to manage our properties. It's very simple, right? Managing our properties, which had substantial amount of capital is a given. And you see that in all other businesses, whether it's a competitive business, whether just take an example of multifamily, right? And if you look at people who are managers, fee managers, they expect to earn their right to manage for fee.\n\nAnd frankly speaking, in senior housing business, there has been very significant amount of complacency, and we have not seen that. So as long as people perform, we have absolutely no desire to move assets because it's disruptive. No one wants to do that. But if people don't perform, there will be transition.\n\nIt's a lot of capital for our shareholders' capital are tied up into these buildings, but we're not going to see tier and take underperformance. That's just not what we do. Near-term underperformance because something happened to an asset, completely understandable. But as John mentioned to you, some of the basic operating standards are expected.\n\nAnd if people don't perform, they're not going to be in our portfolio.\n\nOperator\n\nOur next question comes from Michael Griffin with Citi. Your line is open.\n\nMichael Bilerman -- Citi -- Analyst\n\nIt's Bilerman, again. I just had two quick follow-ups. Shankh, just on ProMedica, who is funding the operating cash flow losses today? Or is the entity just taking on increased debt for that? So maybe you can just talk through the capital structure and how all of that's happening? And then secondarily, just going back to my opening question about sort of longer-term and focusing on all of the initiatives and investments that you've made. I think Burkart, when you were at Essex, you've put out a three-year plan, and I remember UDR and ACO and there was a lot of that, do you think the company would benefit a little bit about -- you have done a lot of sending out all of the impacts and opportunities to start to understand the earnings as well as the asset value, NAV because it just feels that the market is focused to short term and you can provide a lot more details.\n\nYou've dropped little things like the Transit 59 transition, the $120 million negative cash flow, but actually getting the details and really putting the building blocks to your three-year return based on everything that's involved, I think, would be really helpful. So if you can address those two things, that would be good. Thanks.\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nSo I answer the first question. ProMedica is funding and the operating cash flows. As you guys know, it's an entity that has -- how their funding is very simple, that entity has -- really have $2 billion of cash on their balance sheet, so they're just using that cash to fund it. So John, do you want to add anything?\n\nJohn Burkart -- Executive Vice President, Chief Operating Officer\n\nYeah. I mean I will continue to provide more insight into the platform. And as I'm a very simple person, as you know, I call it the whole [Inaudible]. Literally, we'll start all the way from traffic, i.e., web and that type all the way through sales force management, all the way through the operating platform, the ERP, so to speak through every other aspect of the business, HRIS, etc.\n\nAnd we'll start to lay out more information. I will say from the past the -- my experience -- the companies typically aren't laying out specific time lines for dollars. You lay out paths as to what you expect to accomplish and how that will positively impact the business, but not necessarily time that to dollars, and I don't intend to do that. But I'm glad to give more clarity over time.\n\nWe're running extraordinarily fast at this point in time, and we'll provide some more detail on the coming calls and at NAREIT, etc.\n\nTim McHugh -- Chief Financial Officer & Senior Vice President\n\nAnd Michael, just a continuation to answer to your first question. I think overall, you should certainly hear from us that we've adapted the way that what we've disclosed over the last two and a half years in a pretty dynamic environment. So a lot of it has been driven certainly by what we think is important. And a lot of this has been driven by feedback from individuals such as yourself and investors.\n\nSo I hope you've seen that and certainly continued to have dialogue with the market on what is helpful to be seen, and we'll continue to adapt what we disclose based upon that. So you shouldn't think there'll be any change in the way that we -- our approach to that.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt McQueen -- General Counsel\n\nShankh Mitra -- Chief Executive Officer and Chief Investment Officer\n\nJohn Burkart -- Executive Vice President, Chief Operating Officer\n\nTim McHugh -- Chief Financial Officer & Senior Vice President\n\nMichael Bilerman -- Citi -- Analyst\n\nVikram Malhotra -- Mizuho Securities -- Analyst\n\nDaniel Bernstein -- Capital One Securities -- Analyst\n\nJonathan Hughes -- Raymond James -- Analyst\n\nAustin Wurschmidt -- KeyBanc Capital Markets -- Analyst\n\nDerek Johnston -- Deutsche Bank -- Analyst\n\nJohn Pawlowski -- Green Street Advisors -- Analyst\n\nSteven Valiquette -- Barclays -- Analyst\n\nMike Mueller -- JPMorgan Chase and Company -- Analyst\n\nDavid Rodgers -- Robert W. Baird and Company -- Analyst\n\nNick Yulico -- Scotiabank -- Analyst\n\nRich Anderson -- SMBC Nikko Securities -- Analyst\n\nMichael Carroll -- RBC Capital Markets -- Analyst\n\nJuan Sanabria -- BMO Capital Markets -- Analyst\n\nMore WELL analysis\n\nAll earnings call transcripts"
}