{
  "companyName": "Alphabet (A shares)",
  "companyTicker": "GOOGL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/alphabet-a-shares-googl-q3-2022-earnings-call-tran/",
  "content": "Alphabet (A shares) (GOOGL -0.25%)\nQ3 2022 Earnings Call\nOct 25, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome, everyone, and thank you for standing by for the Alphabet, Inc. third quarter 2022 earnings call. [Operator instructions] I would now like to hand the conference over to your speaker today, Jim Friedland, director of investor relations. Please go ahead.\n\nJim Friedland -- Director of Investor Relations\n\nThank you. Good afternoon, everyone, and welcome to Alphabet's third quarter 2022 earnings conference call. With us today are Sundar Pichai, Philipp Schindler and Ruth Porat. Now I'll quickly cover the safe harbor.\n\nSome of the statements that we make today regarding our business, operations and financial performance may be considered forward-looking, and such statements involve a number of risks and uncertainties that could cause actual results to differ materially. For more information, please refer to the risk factors discussed in our most recent Form 10-K filed with the SEC as updated in our Form 10-Q for the quarter ended September 30, 2022, expected to be filed with the SEC later today. During this call, we'll present both GAAP and non-GAAP financial measures. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release, which is distributed and available to the public through our Investor Relations website located at abc.xyz/investor.\n\nAnd now I'll turn the call over to Sundar.\n\nSundar Pichai -- Chief Executive Officer\n\nThank you, Jim, and good afternoon, everyone. Our financial results for the third quarter reflect healthy fundamental growth in Search and momentum in Cloud. Our reported results reflect the effect of foreign exchange. The growth in our advertising revenues was also impacted by lapping last year's elevated growth levels and the challenging macro climate.\n\nWe are sharpening our focus on a clear set of product and business priorities. The product announcements we have made in just the past month alone have shown that very clearly, including significant improvements to Search powered by AI, new ways to monetize YouTube Shorts, which will support the creator ecosystem, the strong series of hardware launches and a new partnership and product announcements at Cloud Next. These will all drive value for users, partners and our business. We have also started our work to drive efficiency by realigning resources to invest in our biggest growth opportunities.\n\nOver the past quarter, we have made several shifts away from lower priority efforts to fuel higher growth priorities. Our Q4 headcount additions will be significantly lower than Q3. And as we plan for 2023, we'll continue to make important trade-offs where needed and are focused on moderating operating expense growth. Throughout Google's history, periods of dedicated focus have enabled us to emerge strongly and unleash new areas of computing innovation.\n\nFor example, over a decade ago, focusing the company's efforts on mobile helped us to build and grow our business for the shift to mobile computing. We are at a similar point now with AI, another transformational technology. Our investments in AI and deep computer science mean that we can deliver a wide range of breakthroughs across our products and services to help people, businesses and communities. Turning to the quarter.\n\nFirst, our core information products. At our Search On event, we shared how we are using AI advances to deliver a more natural and intuitive search experience. These advancements will soon help to surface things you might find helpful before you even finish typing. We are also making visual search more natural than ever before.\n\nPeople now use Google Lens to answer more than 8 billion questions every month using just a photo or an image. Now we are supercharging our visual search capabilities to help people find what they are looking for at businesses nearby. Philipp will also talk in more detail about our work to make it easier to shop on Google, a key focus. Google Lens also has an amazing translation feature.\n\nIt can now blend translated text seamlessly into the background of images, like menus or street signs in just 100 milliseconds, shorter than a blink of an eye. Through advanced language models, AI is unlocking new experiences that support more natural and conversational ways to interact with computing. LaMDA is one of our most promising models for this. It's now available to demo in our AI test kitchen, which offers a way for people to experience and give feedback on emerging AI technology.\n\nDeepMind also debuted its most helpful and safest language model yet. Sparrow can talk to users, answer questions and provide evidence-based answers using Google Search. Moving to YouTube, another big priority. We remain focused on long-term growth for our community of viewers, creators and advertisers.\n\nTo that end, we announced some exciting changes at our Made on YouTube event last month. First, improving the monetization of Shorts. This is a big deal for creators and for our business. We'll introduce revenue sharing on Shorts early next year.\n\nThis update makes YouTube the only platform where creators can monetize their content across short, long and live formats at scale. Shorts continues to show great user momentum, and we continue to invest in our mobile video tools for creators. We are seeing mobile-first creators investing more in the platform, creating content that helps the broader community grow. TV is a big area for us as well.\n\nNielsen reported that YouTube was the leader in streaming TV viewership in the U.S. in September for the first time. Turning next to hardware. Hardware is an important area of investment for us.\n\nWe are investing deeply from the silicon to the OS to powerful software experiences because it's a big opportunity to move computing forward and build deeper relationships with people who love using Google products. It also really helps to guide the Android ecosystem beyond just building the underlying platform. Earlier this month, we introduced the Pixel 7, the Pixel 7 Pro and the very first Pixel Watch. We've also previewed more detail about the Pixel Tablet, which is coming in 2023.\n\nPixel combines our foundational technologies, AI, Android and our Google Tensor G2 processor to bring state-of-the-art AI directly to the device. The Pixel 7 and Pixel 7 Pro offer industry-leading photography features that can unblur or sharpen photos and shoot cinema-quality videos. We recently had our highest selling week ever for Pixel, and I'm really proud of the positive reviews so far. Along with great devices, we introduced our latest release of Android.\n\nAndroid 13 offers new personalization features, improved privacy controls and a more seamless experience with connected devices. Next, Google Cloud. We see continued momentum with Q3 revenue of $6.9 billion with Google Cloud Platform's revenue growth rate above the aggregate. I've long shared that cloud is a key priority for the company.\n\nThe long-term trends that are driving cloud adoption continue to play an even stronger role during uncertain macroeconomic times. Google Cloud helps customers solve today's business challenges, improve productivity, reduce costs and unlock new growth engines. At Cloud Next, we unveiled more than 100 new products and announced new and expanding relationships with Toyota, Prudential plc, Coinbase and AppLovin. The shift to hybrid work continues with organizations evolving to support an increasingly distributed workforce.\n\nI'm proud to share that Google Workspace is now used by more than 8 million businesses and organizations worldwide. That includes Korean Air, as well as the U.S. Army, which is transitioning 250,000 personnel to our secure communication and collaboration platform. In the past year, we have announced nearly 300 new capabilities to support hybrid work.\n\nEmpowering a distributed workforce brings an increased need for cybersecurity to keep workers' data and critical business systems safe and secure. It's top of mind for nearly every CEO I speak with, and customers, including the City of Los Angeles, Roche and Banorte put their trust in Google Cloud's industry-leading products, our new Chronicle Security Operation Suite, Unify Security Analytics, Automation Response and Threat Intelligence. This has helped Vertiv analyze 22 times more security data while cutting investigation time in half. In September, we closed our acquisition of Mandiant and are proud to welcome more than 2,600 colleagues to Google.\n\nWith Mandiant, we add industry-leading threat intelligence and incident response capabilities to help customers stay protected at every stage of the security life cycle. Customers partner with Google Cloud because we offer a single platform that can analyze data across any cloud. Our leadership here is winning customers across industries, including the state of Hawaii and the Australia Securities Exchange. Our capabilities help solve difficult business challenges like supply chain and logistics while also creating new growth opportunities.\n\nAnd as companies globally are looking to drive efficiencies, Google Cloud's open infrastructure creates a valuable pathway to reduce IT costs and modernize. In addition, with our new Media CDN product for large media streaming workloads, we are helping Major League Baseball and Paramount+ deliver flawless experiences to their customers. And with Google Cloud Edge, Rite Aid is more efficiently helping patients in their pharmacies. Across all of these areas, I'm proud of the trust and enthusiasm our customers are placing in Google Cloud.\n\nBriefly on our Other Bets, Waymo announced that Los Angeles will be its third ride-hailing city, joining Phoenix and San Francisco. Waymo will begin by mapping several neighborhoods in LA as it prepares to serve people there. Wing just surpassed 300,000 commercial deliveries. It's servicing new areas in Australia and announced its first drone delivery trials in Ireland.\n\nTo close, times like this are clarifying. As we head into 2023, we are going to focus on our most important priorities as a company. To support our growth, we'll continue to invest responsibly for the long term in a way that is responsive to the current economic environment. I want to thank our employees around the world for their contributions over the last quarter.\n\nWe help people, our partners and society when we focus on what we do best and execute on that really well. Over to you, Philipp.\n\nPhilipp Schindler -- Senior Vice President and Chief Business Officer\n\nThanks, Sundar, and hello, everyone. It's great to be joining you all today. Google Services revenues of $61 billion were up 2% year on year, negatively affected by a sizable foreign exchange headwind. Search and other revenues grew 4% year over year to $40 billion, led by travel and retail, while both YouTube Ads and Network had modest year-over-year revenue declines.\n\nOther revenues were up 2% year over year with growth in YouTube non-advertising and hardware revenues offset by a decrease in Play revenues. Play revenues were lower due to a number of factors, including a decline in user engagement and gaming from the elevated levels seen earlier in the pandemic. Among other factors, this shift in user behavior also created downward pressure on our advertising revenues, with lower revenues from ad promo spend on YouTube, Network and Play Ads in Search and Other. I'll highlight a couple of other trends that affected our ads business in Q3, and Ruth will provide more detail.\n\nOn the second quarter earnings call, we noted a pullback in spend by some advertisers in YouTube and Network, and these pullbacks in spend increased in the third quarter. In Search and Other, the largest factor in the deceleration in Q3 was lapping the outsized performance in 2021. In the third quarter, we did see a pullback in spend by some advertisers in certain areas and search ads. For example, in financial services, we saw a pullback in the insurance, loan, mortgage and crypto subcategories.\n\nThere's no question we're operating in an uncertain environment, and that businesses big and small continue to get tested in new and different ways, depending on where they are in the world. When it comes to how we're helping, our focus remains unchanged. The same AI driving breakthroughs in everything from protein folding, flood forecasting and language understanding is also fueling innovation across our Ads product. Via insights, automation and easier-to-use advertising tools and formats, we're helping businesses stay agile, build resilience, anticipate the future and show up for customers in more connected, visual and consistent ways.\n\nWe're helping them understand demand, deal with inventory challenges, increase loyalty and much more. In challenging times like these, advertisers are carefully evaluating the effectiveness of their budgets. Search tends to do relatively well in such an environment, given its strong measurability and focus on delivering ROI. It's also well suited to quickly adjust to changes in consumer behavior.\n\nAnd when Search is coupled with our automation products across bidding, creatives, targeting or Performance Max, it can drive performance even further. Let's talk retail, an important vertical for us. No matter where shoppers are buying, whether it's in store, online or both, we have the solutions to help them deliver results wherever their customers are. Take online fashion retailer REVOLVE, who used its global influencer network along with our category insights and automated tools to acquire new customers at lower costs.\n\nAs festivals and events returned to summer, REVOLVE used lower funnel solutions across search and shopping to engage with consumers in high-demand apparel categories, helping it cross $1 billion in trailing 12-month net sales for the first time. And then there's Magazine Luiza, a large Brazilian retailer, who embraced omnichannel by measuring and bidding directly to store sales. Coupled with in-store pickup and notations via PMAX, Magazine Luiza drove a 38% ROAS over 30 days and has since expanded the strategy to all eligible products, including 8 million-plus new offers. And whether shoppers know exactly what they're looking for or are just seeking inspiration, we're innovating to make it easier and more engaging for people to shop online across our services.\n\nFrom finding the best deals across all types of merchants, including 200 million-plus available daily deals in Q3 to new ways to search. Now when you type shop followed by whatever item you're looking for, you'll unlock a visual content stream of ideas that feel just like window shopping but online. And then there's YouTube. Not only can users now buy more products and videos, but shopping as entertainment experiences are bringing the magic of our creators to the shopping experience.\n\nLike in September, when Kylie and Kris Jenner hosted an exclusive shopping stream event to celebrate the debut of a new Kris collection for Kylie Cosmetics. And at Adweek last week, not only did we announce that product feeds are coming to Discovery, but that creators will soon be able to take products from brands across their videos, Shorts and live streams. This means viewers can shop products seamlessly while they watch their favorite content, while merchants can drive incremental reach and engagement for free listing offers when tagged by creators that viewers love and trust. I already touched on YouTube's performance in the quarter.\n\nLet's deep dive into what we're focused on. First, we're helping advertisers understand how they can drive effectiveness with every campaign they run on YouTube. Full funnel is a key way to do this. Buying YouTube across consideration, awareness and action allows marketers to meet customers at different stages in their purchasing journey, which we know are increasingly complex while delivering toward a key business goal.\n\nCreative and Media work together across the funnel to create new demand and convert current demand. Castlery, a single full furniture retailer activated a full funnel approach as part of its U.S. expansion. It used brand and action formats, identified its most relevant audiences and built a robust measurement framework to boost sales and awareness, including a 65% increase in U.S.\n\nbrand searches. Castlery is using the same strategy for the upcoming holiday season. Two other areas where we're continuing to invest, Connected TV and Shorts. First on CTV.\n\nEyeballs keep moving away from traditional TV. On average, global viewers are watching 700 million-plus hours of YouTube content on TV daily. And according to Nielsen, during the 2021-2022 U.S. broadcast seasons, YouTube reached more viewers during primetime on CTV than any linear TV network.\n\nBrands continue to take notice. Like Instacart, who tapped into CTV to maximize its TV screen strategy for its The World is Your Cart brand campaign featuring Lizzo. It drove breakout searches for its product and above-average brand lift across awareness, consideration and purchase intent. And it also engaged a significant increase in audience on top of TV with 66% lower CPMs.\n\nAnd then there's Shorts. 1.5 billion users every month, 30 billion daily views. Engagement is strong. We've always said that we focus on building great user and creator experiences first and then follow that with monetization over time.\n\nAs of September, ads on Shorts have officially launched via video action, app and Performance Max campaigns. As Sundar mentioned, we also extended the YouTube Partner Program and announced our revenue sharing model for Shorts creators, the first of its kind for short-form content. It's early but we're encouraged by the progress we've made this year in Shorts monetization and support for sustaining the creator ecosystem. I'll close with something I've said before and I think it's worth reiterating.\n\nOur success is only possible when our customers and partners succeed. Whether it's helping individual YouTube creators or Play developers make a living and build thriving businesses or bringing the best across Google to our partners, our focus on driving growth for our partners and key ecosystems remain steadfast. I'm proud that over the past three years, we've paid creators, artists and media companies over $50 billion. In terms of how we're helping our partners innovate, I'll share two highlights.\n\nFirst, a transformative partnership with Transion, the No. 1 OEM in Africa and Pakistan, will help to close the digital divide by doubling annual activations by 2025 and build helpful products for the next billion users. And then in commerce with FEMSA Digital in Mexico, we're bringing together solutions across Ads, Cloud, Maps, Waze and beyond to bolster its data and analytics capabilities so it can better reach and retain its beverage and retail customers. On behalf of many, a massive thank you to our customers and partners for their collaboration, trust and feedback and another massive thank you to our sales, partnerships, product, engineering and support teams.\n\nThe hard work, dedication and ingenuity of Googlers, especially during more challenging times, is truly second to none. On that note, over to you, Ruth.\n\nRuth Porat -- Chief Financial Officer\n\nThank you, Philipp. Our financial results for the third quarter reflect healthy fundamental growth in Search and momentum in Cloud. Our reported results clearly reflect the effect of foreign exchange. My comments will be on year-over-year comparisons for the third quarter, unless I state otherwise.\n\nI will start with results at the Alphabet level, followed by segment results and conclude with our outlook. For the third quarter, our consolidated revenues were $69.1 billion, up 6% or up 11% in constant currency. Our total cost of revenues was $31.2 billion, up 13%, primarily driven by other cost of revenues, which was $19.3 billion, up 20%. The biggest factor here was costs associated with data centers and other operations, followed by hardware costs.\n\nOperating expenses were $20.8 billion, up 26%, reflecting the following: first, the increases in R&D and G&A expenses, which were driven primarily by headcount growth; and second, the growth in sales and marketing expenses, which was driven primarily by increased spending on ads and promotions, followed by headcount growth. Operating income was $17.1 billion, down 19% versus last year and our operating margin was 25%. Other income and expense was a loss of $902 million. Net income was $13.9 billion.\n\nWe delivered free cash flow of $16.1 billion in the quarter and $63 billion for the trailing 12 months. We ended the quarter with $116 billion in cash and marketable securities. Let me now turn to our segment financial results. As a reminder, we provide fixed foreign exchange revenues only at the consolidated level and by geographic region.\n\nAll segment revenues are reported on a GAAP basis. Starting with our Google Services segment. Total Google Services revenues were $61.4 billion, up 2%. Across our advertising revenues, the year-over-year deceleration in growth rates versus the third quarter of last year was largely driven by lapping very strong performance, most notably in Search and other revenues.\n\nAdditionally, the year-on-year deceleration on YouTube and Network reflects a pullback in spend by some advertisers as we first noted last quarter. In terms of the revenue lines, Google Search and other advertising revenues of $39.5 billion in the quarter were up 4%. YouTube advertising revenues of $7.1 billion were down 2%. Network advertising revenues of $7.9 billion were down 2%.\n\nOther revenues were $6.9 billion, up 2%, reflecting several factors: first, subscriber growth in YouTube Music Premium and YouTube TV continued to drive ongoing strong growth in YouTube non-advertising revenues; second, we delivered solid growth in hardware revenues, primarily from sales of the Pixel 6A. Finally, the growth in these two areas was offset by a year-on-year decline in Play revenues, reflecting a slowdown in buyer spend due to a number of factors, including lower engagement levels in gaming compared with earlier stages of the pandemic. In terms of costs within Google Services, TAC was $11.8 billion, up 3%. Google Services operating income was $19.8 billion, down 17% and the operating margin was 32%.\n\nTurning to the Google Cloud segment. Revenues were $6.9 billion for the second quarter, up 38%. GCP's revenue growth was again greater than Cloud's, reflecting significant growth in both infrastructure and platform services. Strong revenue growth in Google Workspace was driven by growth in both seats and average revenue per seat.\n\nGoogle Cloud had an operating loss of $699 million. As to our Other Bets for the third quarter, revenues were $209 million and the operating loss was $1.6 billion. Let me close with some comments on our outlook. Our results in the third quarter reflect an increased headwind from foreign exchange, given the ongoing strengthening of the U.S.\n\ndollar versus last year. Excluding the revenue benefit from hedging, there was a six-point headwind year on year or five points with the hedge benefit compared with a slight tailwind in the third quarter of 2021. Looking to the fourth quarter, based on strengthening of the U.S. dollar quarter to date, we expect an even larger headwind from foreign exchange.\n\nIn addition, as we have previously said, the impact of foreign exchange is greater on operating income than it is on revenues, given that our expense base is weighted more toward the U.S. with most of our R&D efforts located here. Turning to our segment results. Within the Google Services segment, Search and other revenues had healthy fundamental growth in the third quarter, which was affected by the impact of currency movements.\n\nAs I already noted, the largest driver of the deceleration in year-on-year growth of Search compared with 3Q '21 was lapping the outsized growth in 2021. The sequential deceleration in the year-on-year growth of Search in the third quarter versus the second quarter was also driven by lapping with an additional headwind from pullback in advertiser spend in some areas. In YouTube and Network, the sequential deceleration of year-on-year growth in the third quarter versus the second quarter primarily reflects further pullbacks in advertiser spend. In the fourth quarter, the very strong revenue performance last year will continue to create tough comps that will weigh on the year-on-year growth rates of advertising revenues.\n\nWithin other revenues, we expect an ongoing headwind from the slowdown in buyer spend on Google Play due to a number of factors, including lower levels of user engagement in gaming that impacted results in the second and third quarters. As Philipp mentioned, among other factors, this shift in user behavior was also a headwind to advertising revenues, with lower revenues from app promo spend on YouTube, Network and Play ads in Search and other. Turning to Google Cloud. Our results reflect momentum across GCP and Workspace.\n\nCustomers globally are adopting our products and services to digitally transform their businesses. We are excited about the opportunity, given that businesses and governments are still in the early days of public cloud adoption and we continue to invest accordingly. We remain focused on the longer-term path to profitability. In terms of profitability, we have an effort underway to ensure we redeploy investments against our most compelling opportunities.\n\nAs we noted on our second quarter call, our actions to slow the pace of hiring will become more apparent in 2023. With respect to Alphabet headcount, we added 12,765 people in the third quarter, including more than 2,600 of those joining Google Cloud as part of our acquisition of Mandiant. As in prior quarters, the majority of hires were for technical roles. In the fourth quarter, we expect headcount additions will slow to less than half the number added in Q3.\n\nWithin this slower headcount growth, next year, we will continue hiring for critical roles, particularly focused on top engineering and technical talent. Turning to capex, we continue to make significant investments in technical infrastructure with servers as the largest component. Thank you. Sundar, Philipp and I will now take your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Eric Sheridan of Goldman Sachs. Your question, please, Eric Sheridan.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThank you very much. Maybe two questions, if I can. Sundar, first, I think what investors are very curious about is how much this change in terms of aligning investment against your priorities is a reflection of what you expect to happen over the next six to 12 months in the broader macro environment versus a longer-term perspective of maybe maximizing for productivity and efficiency. Would love to get your philosophy on that.\n\nAnd then Philipp, a lot of comments in there about YouTube and the potential for growth going forward. Can you go a little bit deeper on what you're seeing in terms of both the opportunity set to drive revenue and turn a possible headwind to a tailwind with respect to Shorts and Connected TV over the medium to long term. Thanks so much.\n\nSundar Pichai -- Chief Executive Officer\n\nThanks. Look, I would say it's a combination. Obviously, as a company, over time, we've had periods of extraordinary growth, and then there are periods where I viewed it as a moment where you take the time to optimize the company to make sure we are set up for the next decade of growth ahead. I view this as one of those moments.\n\nIt gives us a chance to make sure we are, with clarity, identifying what are the most important areas and making sure we are directing our incremental investments toward those and as well as where we can realign. So I view this as an opportunity to do that and also being responsive to the current macro environment we are seeing.\n\nPhilipp Schindler -- Senior Vice President and Chief Business Officer\n\nYes. And from my side, Eric, in the third quarter, as I mentioned, there was a further pullback in spend by some advertisers across both brand and direct response. But overall, I feel YouTube remains in a really good position to continue to benefit from the streaming boom. In direct response, we think there's a lot of room to run to make really YouTube more shoppable, more actionable from video action campaigns to product feeds, app campaigns, live commerce features.\n\nAdvertisers are turning to YouTube to convert intent into action and really drive performance at scale. Product feeds are coming to Discovery ads soon and recent expanded to Shorts. We're already seeing results. And in fact, on average, video action campaigns with product feeds saw an over 70% increase in conversions on Shorts versus those without.\n\nOn the brand side, as I said earlier, eyeballs are moving away from linear TV, and we're helping brands move beyond traditional. Let's -- to efficiently really achieve their reach and awareness goals. And obviously, you mentioned that as well, Connected TV is an important part of this strategy. When you think about it, YouTube is really the best place for advertisers to reach new consumers across multiple formats and screens from shorts to long-form, podcast, music, all the way to CTV.\n\nOperator\n\nThank you. Our next question comes from Brian Nowak of Morgan Stanley. Your question, please, Brian Nowak.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nThanks for taking my questions. I have two. The first one for Sundar or Ruth. Sundar, just to go back to the comment about earlier in the quarter, becoming 20% more efficient.\n\nI thought tonight, your comment on investing responsibly over the long term, about being responsive to the environment is helpful. But if I look at sort of the Excel sheet, I think you'll have added about 51,000 new people to the company since the start of last year. Can you give us some examples of internal KPIs or quantifiable analysis you're running just to ensure you're generating ROI for investors from all your hiring. Just sort of run through these analyses? That's the first one.\n\nThen the second one, Philipp, just on Shorts, are you seeing Shorts lead to incremental time spent from those users? Or is it more so you're seeing the time shift from other forms of YouTube over to Shorts?\n\nSundar Pichai -- Chief Executive Officer\n\nBrian, I think, look, I think we gave some -- we've been clear that we are going to moderate our pace of hiring going into Q4, as well as 2023. I think we are seeing a lot of opportunities across a whole set of areas. And every time, talent is the most precious resource, so we are constantly working to make sure everyone we've brought in is working on the most important things as a company and particularly so. And that's a lot of what sharpening our focus has been about.\n\nWe are reviewing projects at all scales pretty granularly to make sure we have the right plans there, and based on that, the right resourcing and making course corrections. And this will be an ongoing thing. It is something we'll continue doing going into '23 as well.\n\nPhilipp Schindler -- Senior Vice President and Chief Business Officer\n\nYes. And to the second part of the question, as we discussed before, we've always focused on building a great user and creator experience first, followed by increasing monetization over time. We continued to experience a slight headwind to revenues as Shorts viewership grew as a percentage of total YouTube watch time. And as I alluded to earlier, the initial progress on Shorts monetization has been encouraging.\n\nAnd we're focused on closing the monetization gap between Shorts and long-form content on YouTube over time. And more specifically, consumers are increasingly consuming short-form video, and we're seeing this across multiple platforms, including YouTube. And as I said earlier, Shorts are being watched by 1.5 billion-plus logged-in users every month.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thank you, both.\n\nOperator\n\nThank you. Our next question comes from the line of Doug Anmuth of J.P. Morgan. Your question, please, Doug Anmuth.\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nThanks for taking the question. Ruth, you highlighted momentum in Cloud and growth accelerated in 3Q. Are you seeing any changes in Cloud demand as existing or potential customers perhaps rethink their priorities? And then how should we think about the pace of investments at Cloud going forward? Do you still believe that you're in more catch-up mode? Or should we expect a more stable rate of investment and greater profit improvement? Thanks.\n\nRuth Porat -- Chief Financial Officer\n\nThanks for the question. Yes, we are pleased with the ongoing momentum. It's across a wide range of industries and geographies. And it really comes back to the team's focus on helping them solve unique business issues and innovate in new areas as they digitally transform.\n\nI think more to your question, and we talked about this about last quarter, in some cases, certain customers are taking longer to decide, and some have committed to deals with shorter terms or smaller deal sizes, which we attribute to a more challenging macro environment. Some are impacted due to reasons that are specific to their business. But overall, as you can see from the results here again, we're pleased with the momentum in Cloud and do continue to be excited about the long-term opportunities. So that's why I made the comment that we do continue to invest meaningfully in this business.\n\nWe're still focused very much so on the path to profitability and free cash flow strength here, but we are continuing to invest in the business. And this fits within Sundar's overall comments as we're looking at how we prioritize. And they're certainly making sure they're focused on every element within their business. But fundamentally, to the heart of your question, we're continuing to invest here.\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Nathanson of MoffettNathanson. Your line is open, Michael Nathanson.\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nThanks. Sundar, I have one for you and then one for you, Ruth. I want to ask you about TikTok but not as it relates to YouTube, more about Search. It looks like younger consumers are spending more time on TikTok searching for product reviews, recommendations, advice.\n\nI'm interested in learning if you've seen any changes in your search behavior by demographics in Google. And then do you think search has become more visual and less text-based going forward in order to maintain more relevance for its younger users? So that's one. And then Ruth, can you kind of just dig in a bit on the opex growth in Google Services. You called out other cost of revenues being up 20%.\n\nIt looks like as a percentage of revenues, it's nearly an all-time high. Can you talk a bit about how much of that cost base is fixed versus variable? And anything on outlook on what's driving kind of the spike this quarter and maybe what you expect going forward there on the cost of revenues? Thanks.\n\nSundar Pichai -- Chief Executive Officer\n\nLook, I think it's always important that we try and understand our user segments and their needs so that we can make sure the products are helpful and working for them. And we also conduct thousands of studies a year to understand how user needs are evolving. And as part of it, there are some studies which obviously show people, particularly younger users in certain categories, maybe fashion inspiration as an example, look for more visual ways to engage. And so these are all learnings we are constantly taking in and we use it to improve Search.\n\nAnd if you saw Search On, we had many explorations and product directions, which move in that direction. So I think it's a healthy way of iterating and innovating to build the best products and services for our users.\n\nRuth Porat -- Chief Financial Officer\n\nAnd then in terms of your question regarding margins, two parts really. On other cost revenues, the biggest driver of the year-on-year increase in other cost of revenues does continue to be data centers and other operations. The change really here this quarter in Q3, the second largest driver was hardware. And then CAC moved from its usual No.\n\n2 spot down to No. 3. And there were really two key factors for the change in the rank order between hardware and CAC. Probably pretty self-evident but just to spell them out, the year-on-year decline in YouTube Ads revenues obviously muted the growth in CAC.\n\nAnd then the growth of Pixel Phone sales due primarily to the launch of Pixel 6A drove that shift. What we're looking at overall sort of to your broader question about profitability in Google Services is the overall pace of investments. And now we're looking at how with the change -- mix change and ongoing opportunities to drive revenue growth and how it flows through all the way to op inc growth. And so to Sundar's opening comments and as we've been talking about, some of the margin upside last year was due to timing issues with a very strong growth of revenues and there was a lag in investments.\n\nAnd what we're focused on here is how do we continue to manage on a go-forward basis to deliver durable long-term results.\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Ross Sandler of Barclays. Your question, please, Ross Sandler.\n\nRoss Sandler -- Barclays -- Analyst\n\nHey, guys. Hate to beat the dead horse on the Google Services margin, but Ruth, you just mentioned mix shift. I think that's a lot of what's going on here. And given the trajectory that you're seeing in Search and in Play, which we estimate are where most of the profit's coming from in that segment versus some of those lower-margin items, YouTube subscription, hardware, etc., maybe you could help frame the next like couple of years.\n\nIs this going to land below pre pandemic, which I think was around where we are here at 32%? Could we see the 2Q '20 low of 27% for Google Services margin? Any help just framing where that might land would be helpful. Thank you.\n\nRuth Porat -- Chief Financial Officer\n\nWell, I'll, as I'm sure you would expect, leave the modeling to you, but there are two elements of it. And I think Sundar and Philipp really talked about the first part, which is the ongoing opportunity we see with Search, with YouTube, with some of the actions that we're taking, the opportunity with AI applied to both, the opportunity as we continue to build-out monetization on YouTube Shorts in particular. So we're continuing to focus on both, the driver here, revenue, as well as the investments that we're making. And I want to make sure, to Sundar's comments about sharpening our focus, that we are economizing, utilizing resources as effectively as possible.\n\nSo it is both the efforts we're taking around expense management and building for durable performance, as well as the efforts we're taking, which are in the investment line but drive top line performance. I would say we also contextualize it and I tried to do that in response to Michael's questions. And we said this last year, we've noted that some of the margin upside last year was due to timing issues. And we had a very strong growth in revenues, surge in revenues and a lag in investments that we said was a timing difference, and you are seeing some of that here.\n\nBut to the main point, we're looking at both what we can do to continue to support long-term revenue growth, but while doing so, being mindful of the pace of investment. I'll leave the modeling to you.\n\nOperator\n\nThank you. Our next question comes from Brent Thill of Jefferies. Your line is open, Brent Thill.\n\nBrent Thill -- Jefferies -- Analyst\n\nRuth, on the pullback by some advertisers, is there a common thread that you can draw on common underlying characteristics that are pulling back versus those that are continuing to lean forward? Can you talk about that dynamic and what you're seeing?\n\nRuth Porat -- Chief Financial Officer\n\nWhy don't I start and then I'll pass it to Philipp for a bit more color potentially? Because I want to make sure that one of the comments that we made in the opening comments was very clear, which was the year-on-year story in Ads was really lapping the very strong third quarter. And so to get to your question, you're really talking about sequential decline in our year-on-year growth. I think what's notable in Search, we had really healthy growth in Q3, excluding the impact of foreign exchange. The sequential deceleration in Search in the third quarter versus the second quarter was again primarily driven by lapping, and just I want to make sure that that was clear.\n\nThere was some pullback from advertiser spend in some areas so I've noted that in opening comments. And then in YouTube and Network, the sequential deceleration of year-on-year growth in both the second quarter -- the third quarter versus the second quarter was really further pullbacks in advertiser spend.\n\nPhilipp Schindler -- Senior Vice President and Chief Business Officer\n\nYeah, that's exactly right. And as I said earlier, in Search and other ads revenues, while lapping the outsized performance was the largest factor in Q3, we did see some advertiser pull back in certain areas in search ads. And I think the example I called out was in financial services, in the areas of insurance, loan, mortgage, crypto subcategories. And we also noted a pullback in spend by some advertisers on YouTube and Network.\n\nAnd these pullbacks in spend increased in the third quarter. And we also noted lower revenues from AppPromo spend on YouTube and Network.\n\nOperator\n\nThank you. Our next question comes from Mark Mahaney of Evercore ISI. Please go ahead, Mark Mahaney. Apologies, we'll need to go to the next question that comes from Maria Ripps of Canaccord.\n\nYour line is open. Please stand by.[Technical difficulty]\n\nRuth Porat -- Chief Financial Officer\n\nHolding to see if there are technical difficulties. Thank you, all. And if the operator could keep us posted here, maybe even trying to -- yes. Thank you.\n\nOperator\n\nYes, ma'am. Thank you so much for your patience. Again, our next question comes from Mark Mahaney of Evercore ISI. Mark Mahaney, please go ahead.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nJust checking. Can you hear me?\n\nRuth Porat -- Chief Financial Officer\n\nThank you. We can hear you, Mark. Thank you.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nGreat. Thank you. Thanks, Ruth. OK.\n\nTwo questions, please. One, Sundar, you've been with the company for a long time. You've seen these cycles before. Can you put any context as to the -- as economic conditions wax and wane, the impact that has on Google? Like how does this environment look to you versus prior cycles that the company has managed through? And then Ruth, on the cost side, I understand the comments.\n\nI understand the comments about the headcount adds and what you plan to do in the fourth quarter. But could you talk about non-headcount-related costs and the opportunity you see or the need you see for managing those down? And do you see that there are significant opportunities to do that as well. So again, non-headcount costs. Thank you very much.\n\nSundar Pichai -- Chief Executive Officer\n\nThanks, Mark. Well, a couple of things. I think compared to the past, I think are going through this, I mean there is, as we have said before, there is more uncertainty as we go through. We definitely see indicators on both sides so that makes it a bit more unique.\n\nNumber two, I would say the strength of Search both as a product for users, as well as for advertisers in terms of delivering ROI through a tough time in the ad market, I think, is great to see. Third, just like when we went through it last time, ahead of us was a decade of mobile and the opportunities it brought. And to me, sitting now, looking at all the work that's going on in AI, we've been an AI-first company for the past seven years in all the investments. And it looks like a big opportunity ahead.\n\nSo keeping all that in mind, focused on the long term, using this moment to be disciplined and prioritize and focus, I think, will set us up well for the next decade ahead.\n\nRuth Porat -- Chief Financial Officer\n\nAnd then in terms of your second question, I think the core to Sundar's comment is with the rapid pace of growth that we've experienced, we see opportunities to focus more. And that drives opportunities to redeploy amazing talent we have into the highest priority efforts that we have and to be as effective and efficient as possible. There are, obviously, to your question, non-payroll-associated expenses that also then attach. And so an operating environment like this adds urgency to prioritization.\n\nWe want to make sure we're using all resources as effectively and efficiently as possible. At the same time, as we've tried to be very clear, there are very exciting areas that we will continue to invest in. And so part of this is resource optimization, constraint optimization, however you want to describe it. We want to free up where we can to ensure we have capacity to invest as needed in opportunities that deliver these durable long-term results that we've talked about.\n\nAnd so we're trying to be smart about redeploying where we can, finding efficiencies where we can while still investing for long-term growth.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThank you, Ruth. Thank you, Sundar.\n\nOperator\n\nThank you. Our next question comes from the line of Maria Ripps of Canaccord. Maria Ripps, your line is open.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGreat. Thanks so much for taking my questions. First, you talked about strength in retail and travel. Can you maybe talk about automotive advertising and whether you're seeing any signs of recovery as supply has been normalizing? And if so, how might this rebound sort of compared to prior cycles? And then secondly, just on Performance Max, it seems like it continues to do pretty well here.\n\nSo based on your conversations with advertisers, are there any specific features or functionality that you would call out as significant drivers of the product attractiveness? And is there any color you can add maybe around relative ROI of PMax?\n\nPhilipp Schindler -- Senior Vice President and Chief Business Officer\n\nYes. So there's really no additional color. Thank you very much for your question, but there's really no additional color on other verticals apart from the ones I mentioned already that I think we should share here at this moment. On the Performance Max side, we've touched on earlier and in prior quarters and just as a little reminder, it's our fully automated Google Ads campaign tied with the most channel and inventory coverage, that really helps advertisers deliver a better ROI.\n\nAnd we've been listening to feedback from advertisers and have continued to roll out more features since its initial launch to increase transparency and help advertisers steer the automation more effectively. And there are more future updates to come. In July, we launched a number of new settings, including seasonality setting that lets marketers make quite typical adjustments for seasonal campaign bidding and an optimization score setting that gives an indicator for performance improvement and gives the recommendations for better results. So all in all, we're excited about what's ahead for PMax, the further simplification of our products in general, and frankly, the value we can keep driving for business of all sizes, especially when they need it most.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGreat. Thanks so much for the call.\n\nOperator\n\nThank you. Our next question comes from Justin Post of Bank of America. Justin Post, your line is open.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. I guess a follow-up about artificial intelligence. First, capex is up 31% year over year.\n\nCan you talk about a little bit what's driving that and can that be pulled back a bit? Is that Cloud or really building out the AI capabilities? And then maybe, Sundar, as you think about Search where it is today and you have much better visibility on AI capabilities than we do, how could some of those capabilities be mixed into Search? And when would we as investors maybe see some of those benefits? Thank you.\n\nSundar Pichai -- Chief Executive Officer\n\nThanks, Justin. Look, I mean, I think on the AI front, we are still in very early innings. We've been very good about, as our research teams are making progress, bringing it into Search so pretty much transformer-based models, including BERT and MUM and Search now. So it's driven a massive improvement in search quality and helped us extend the lead in quality over other products.\n\nWe are definitely using it to make it multimodal. And I think going back to some of the earlier questions about making sure Search is visual, things like Google Lens bringing visual search into -- being able to point your phone at things and ask questions, all that really helps set up Search well for the future of where computing is headed. But AI not only affects search, it affects all our products. It makes YouTube better, ads better -- and through Cloud, we are bringing it to other companies as well.\n\nSo we'll keep that in mind. And maybe to -- so we'll keep that in mind. Thanks.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nAnd then maybe, Ruth, on the capex, where is most of that going to and how do you think about that going forward?\n\nRuth Porat -- Chief Financial Officer\n\nThe majority of capex does continue to be for our technical infrastructure. And as we've talked about on prior calls, servers really has been the largest driver of the investment dollars. The technical infrastructure team has consistently focused on levers to improve utilization and efficiency and they continue to do so. We are investing, to Sundar's comments, in building out the compute in support of all that we're doing with our AI teams and are excited about that.\n\nAnd obviously, you had seen some more activity earlier in the year regarding real estate. We feel good about where we are. We're continuing to fit out our offices, etc., for utilization in this new return to hybrid work environment, but we're trying to make sure that we're doing that at an appropriate measured pace, and that's really it. Thank you very much.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nThank you, Ruth. Thank you, Sundar.\n\nOperator\n\nThank you. That concludes our Q&A session. I'd like to turn the conference back to Jim Friedland for closing remarks.\n\nJim Friedland -- Director of Investor Relations\n\nThanks, everyone, for joining us today. We look forward to speaking with you again on our fourth quarter 2022 call. Thank you, and have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJim Friedland -- Director of Investor Relations\n\nSundar Pichai -- Chief Executive Officer\n\nPhilipp Schindler -- Senior Vice President and Chief Business Officer\n\nRuth Porat -- Chief Financial Officer\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nRoss Sandler -- Barclays -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nMore GOOGL analysis\n\nAll earnings call transcripts"
}