{
  "companyName": "Designer Brands",
  "companyTicker": "DBI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/designer-brands-dbi-q3-2022-earnings-call-transcri/",
  "content": "Designer Brands (DBI -0.71%)\nQ3 2022 Earnings Call\nDec 01, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning and welcome to the Designer Brands, Inc. third quarter 2022 earnings call. [Operator instructions] After today's presentation, there will be an opportunity to ask questions. Please note, this event is being recorded.\n\nI would now like to turn the conference over to Jesse Miller. Please go ahead.\n\nJesse Miller -- Senior Director, Investor Relations\n\nGood morning. Earlier today, the company issued a press release comparing results of operations for the 13-week period ended October 29, 2022 to the 13-week period ended October 30, 2021. Please note that remarks made about the future expectations, plans, and prospects of the company constitute forward-looking statements. Results may differ materially due to various factors listed in today's press release and the company's public filings with the SEC.\n\nThe company assumes no obligation to update any forward-looking statements. Joining us today are Roger Rawlins, chief executive officer; Jared Poff, chief financial officer; and Doug Howe, president of DSW. Now, let me turn the call over to Roger.\n\nRoger Rawlins -- Chief Executive Officer\n\nGood morning and thank you, everyone, for joining us today. We posted another consecutive quarter of solid results and made material progress on our brand-building journey. We ended the quarter with comparable sales up 3% compared to the third quarter of 2021, which was on top of strong comp net sales growth last year of 41%. We are incredibly proud of these results as we lapped a record third quarter in 2021 and invite you to review our earnings infographic on our investor relations site that highlights some of these accomplishments.\n\nNotably, we made tangible progress against our long-term plan of doubling sales of our owned brands by 2026 while also maintaining our sales levels of national brands as we continue to strengthen relationships with our top partners. As you know, our owned brands strategy will continue to be the key driver of our growth over the next five years as we have the unique ability to intimately understand our customers so we can design, source, and sell the products they love. We're excited to share that in the third quarter, owned brands sales grew 25% compared to the same period last year. Our direct-to-consumer sales through our retail stores and websites delivered a 33% increase to last year, and wholesale distribution also grew at 8%.\n\nAnd what makes this even more impressive? This growth is coming at a time when the industry is flooded with inventory. And while we see this inventory pressure across the industry, our ability to self-liquidate excess product through our own retail clearance section is the key differentiator of our unique business model that gives us confidence in our ability to continue to build our owned brands penetration and extract as much margin as possible along the way. Doug will dive more into our owned brands strategy in just a few moments. As we've been transforming into a brand builder, we've been making strategic investments in talent and experience.\n\nTo that end, over the last two years, we have created new positions and teams inside of Designer Brands, including a chief supply chain and sourcing office, brand-level leadership, and international sourcing groups in new parts of the world. Additionally, we just announced last week the appointment of two new board members: Rich Paul, CEO and founder of Klutch Sports Group, the powerhouse agency representing some of the biggest athletes across major professional sports; and Tami Fersko, chief operations and supply chain manager of Centric Brands, a leading global lifestyle brand collective, who brings strong leadership in this space, including past executive roles at sourcing and branding leaders Li & Fung and The Jones Group. Both Rich and Tami bring extensive brand-building expertise and knowledge of the footwear industry, and we look forward to their input on our strategy. As we've been calling out since the introduction of our initial fiscal 2022 guidance, the third quarter was planned to be the quarter in which our strategic efforts to bring back our clearance shopper were expected to be running on all cylinders.\n\nAnd I'm happy to report we were wildly successful. Our clearance sales were up 28% compared to the third quarter of 2021. We were pleased to see this critical part of our business model return to full strength, especially at a time when the industry faces large inventory challenges and more consumers are looking to cut back on discretionary spending. Given the material success we have had in growing our own brands and given the structural changes we have made in our overall retail business, we have seen our gross margin rates materially and substantially improve from legacy levels.\n\nAnd while we will always be subject to the impacts of macro conditions and consumer sentiment, these structural changes should keep our margin profile consistently above legacy levels we delivered in 2019 and prior. In the third quarter specifically, we saw some of those pressures take hold. First, many of the largest footwear industry players, especially athletic brands, are massively over-inventoried and have become very aggressive in their own DTC businesses, including exact styles we carry in our retail assortments. We noted last quarter that this was an area of potential risk as the effects of competitors lowering price impacts the entire industry.\n\nAdditionally, as you've heard many other brands and big-box retailers discuss, we saw a drop in discretionary demand starting in the last two weeks of October. This drop came on very suddenly and appears to be widespread and continuing across much of the consumer market. With these impacts, we are returning back to a range within our original 2022 EPS guidance. Our revised guidance still includes mid-single-digit retail comp sales growth and full year adjusted EPS in the range of $1.75 to $1.80.\n\nThis still puts our EPS significantly above 2019 given our structurally improved gross margin profile. Jared will go into more detail around some of the numbers and efforts we are implementing across the business to minimize the impact of this uncertainty as much as possible. In closing, I want to take this opportunity to thank our associates for remaining nimble and continuing to support Designer Brands. I'll now turn it over to Doug Howe, president of DSW.\n\nDoug.\n\nDoug Howe -- President, DSW\n\nThank you, Roger, and good morning, everyone. I want to talk first about the incredibly exciting developments and milestones we achieved in this third quarter. Our journey as a brand builder is continuing at an exciting clip, and we continue to deliver against our long-term strategy of doubling owned brands net sales by 2026 and maintaining national brands. Designer Brands' strategic differentiator is the unique synergies between the brands we build and our best-in-class retail infrastructure.\n\nWe have a unique ability to connect with our customers and identify their needs and present them with the widest assortment of brands they love across a highly developed and in-place omni infrastructure. In the quarter, our owned brands represented 27% of DBI revenue, compared to 22% in the third quarter of last year. This puts us well on our way to our goal of making our owned brands approximately one-third of our total revenue by 2026. That is a huge accomplishment on our path to elevating DBI's status as a brand builder.\n\nI want to specifically highlight two of these owned brands and some exciting progress that was made in the quarter. We are very enthusiastic about the momentum we are seeing with Crown Vintage, a brand that is vintage-inspired at its core and free-spirited in its soul, with shoes and accessories that invite customers to embrace their individuality. In the quarter, we launched a collaboration partnership with Emma Roberts for our Crown Vintage brand, which included a robust marketing campaign across national and social media channels. This campaign received over 6 billion press impressions and 120 million social media impressions and was the strongest social celebrity content we have ever had.\n\nYou can see some of the beautiful campaign imagery on our Q3 '22 infographic. As part of this launch, we hosted pop-up shops in both Los Angeles and Nashville that generated over 1 billion impressions, including 25 million organic social media impressions. Crown Vintage searches on Google have been up significantly, with index scores trending up over last year in the same period by 43%, indicating the consumer interest we're generating beyond DSW channels. Additionally, as we move through the fall and winter, we are proud that Crown Vintage was the No.\n\n1 demanded brand in women's boots at DSW during Septober and can sit comfortably in the neighborhood with other brand partners such as UGG, Lucky Brand, and Vince Camuto. Similarly, Kelly & Katie met some incredible milestones in the past few months. In the third quarter, Kelly & Katie grew in the triple digits as it continues to resonate with our customers and, in fact, was one of our top three brands sold at DSW, with two styles in the top 10 styles at DSW for the third quarter. We're excited about the progress we are making in our owned brands portfolio and look forward to continuing our brand-building journey with the official launch of our first athleisure brand, Le Tigre.\n\nYou can expect more exciting upcoming announcements in the near future. We continue to hold true to our goal of having the best possible assortment available both in stores and online, which is allowing us to attract a broader customer base. Specifically, as it relates to clearance, we have reactivated 2 million shoppers who had not shopped with us since the pandemic due to our lack of clearance product. At DBI, we have a long-standing history of rich customer data.\n\nWe know how to best leverage that data to design and market to our customers in effective ways to meet them with the products they demand and the way they want to engage. Our Warehouse Reimagined store in Houston is another example of how we are meeting our customers' needs across the board. We have received overwhelmingly positive feedback from customers relative to how light and bright the store feels, with customers describing the store as warm and welcoming with a better shopping experience. Our Warehouse Reimagined store allows for increased capacity and smaller square footage, which has resulted in a double-digit sales productivity increase.\n\nThe expanded kids section has also increased customer engagement. Also, brand new to our shopping experience, we have listened to our customer and have launched Scan & Go self-checkout at this location. Customers have responded, and we have seen nearly a third of transactions run through these kiosks. Intimately knowing our customer and regularly speaking with them is such a vitally important tool for us as we continuously evolve our brands and our shopping experience and is a massive competitive advantage for all parts of Designer Brands business.\n\nTurning to the seasonal focus in the third quarter, we mentioned on our last earnings call our increased attention to back to school during the third quarter as we lean into this newest season for DBI, which we only started capitalizing on in earnest in 2021. Overall demand increased 4% on top of a 2% increase last year compared to 2019. And we were especially pleased with our kids business that delivered a 2% increase in sales on top of a 40% increase last year compared to 2019. Let me turn to Septober, which, as you all know, is an incredibly important season for us.\n\nOur owned brands performed exceptionally well during this time period. In our women's boots category, five of the top 10 brands sold were owned brands, with Crown Vintage holding the spot as the No. 1 demanded brand during Septober, as was mentioned earlier. Additionally, those five women's boots brands posted 28% growth compared to the same period last year.\n\nWe did see some unplanned softness in the rest of our assortment as temperatures were much warmer than normal across most of the Septober period. Additionally, as Roger referenced, we saw a sudden drop-off in consumer traffic and demand that most of the consumer discretionary markets saw starting in the back half of October. If we look to historical build for the balance of the year and apply that trend to where we ended October, we feel there is pressure to the original plan for Q4. This, coupled with a continued massively competitive promotional posture of the branded athletic business right now, is what is giving us reason to be cautious and bring down balance-of-year expectations.\n\nBefore I pass it over to Jared, I want to thank the team for their hard work throughout the quarter. I was really impressed with how the team stepped up time and time again to read, react, and adapt as necessary. With that, I'll pass it over to Jared. Jared.\n\nJared Poff -- Executive Vice President, Chief Financial Officer\n\nThank you, Doug, and good morning, everyone. Please note that the financial results that we will reference during the remainder of today's call exclude certain adjustments recorded under GAAP unless specified otherwise. For a complete reconciliation of GAAP to adjusted earnings, please reference our press release. I want to echo Roger and Doug's comments around the pride we have in our third quarter results.\n\nWe delivered on our strategic goals of owned brands growth and the reestablishment of our critically important clearance business and customer while also seeing the fruits of our changed and diversified business model come to bear. We put up numbers that demonstrated the power of this evolved Designer Brands, and I couldn't be prouder of what the teams continued to accomplish. Let's first review our results. For the third quarter, sales increased 1.4% to $865 million compared to the same quarter 2021.\n\nFor the third quarter, total comps were up 3% on top of a strong 40.8% comp last year. Within this growth, we saw positive sales across all of our segments. U.S. retail comps for the third quarter were up 1.1%, compared to up 43.9% in the prior year.\n\nVC.com comps were up 27%, compared to a gain of 50.4% in the prior year. And Canada continues to see strong growth and posted comps of 18.8% for the quarter on top of 15.2% in the same quarter of 2021. Gross profit for the quarter was $285.8 million. As planned and as previously communicated, our consolidated gross profit rate for the quarter decreased to last year as we strategically and intentionally reestablished our clearance business and won back that lapsed clearance shopper while coming in meaningfully above 2019 given the structural changes we've made in our business.\n\nOur gross profit rate for the quarter came in at 33%, 370 basis points above 2019's rate of 29.3%. In the third quarter, consolidated adjusted SG&A was $221 million. Given our sales increase and the expense mitigation tactics we implemented as soon as we saw some of the macro pressures surface, we were able to hold our adjusted SG&A ratio relatively in line with last year at 25.5% of sales in the third quarter, compared to 25.1% of sales last year. Adjusted operating profit in the third quarter was $67.1 million and 7.8% of sales, 340 basis points above 2019's operating profit rate.\n\nWe had $4.8 million of net interest expense during the third quarter, compared to $7.7 million in the prior year. Our effective tax rate on adjusted results was 25.9% in the third quarter. Third quarter adjusted net income was $46.1 million or $0.67 per diluted share. Turning to our inventory, we ended the third quarter with inventories of $681.8 million, compared to $602.1 million last year.\n\nAs planned and as previously communicated, we continue to decline in our inventory comp versus last year and expect for this to continue as we round out the year. Inventory levels were elevated at the end of the second quarter, and we flagged they would be coming down throughout the year. Accordingly, we ended the quarter with retail inventories up 14% on a square footage basis compared to the third quarter of 2021, materially down from up 33% at the end of the second quarter. We expect to end the year much closer to last year's inventory levels.\n\nUnlike other large brands who have had to turn to liquidators as part of their solution to slow-moving inventory, we have a self-liquidating machine through our DSW clearance business that allows us to perform better than others when needing to clear through inventory. As a brand builder, this is a massive differentiator to our model and is why we needed to reestablish our clearance business, which we did. Importantly, as we move into the fourth quarter, our liquidity position remains strong. During the quarter, we repurchased 1.3 million shares.\n\nRepurchases year to date through Q3 were 10.7 million, which is equivalent to roughly 15% of our 73 million shares outstanding at the beginning of the year. We ended the quarter with $62.5 million of cash and our total liquidity, which includes cash and availability under our revolver, was $193.4 million. We had $130.9 million available to draw on our revolving credit facility. In addition, we are pleased to share that we received a $120 million of the $160 million CARES Act tax refund due to us from the IRS in November, which was immediately used to pay down debt.\n\nAnd we ended November with well over $300 million of total liquidity. We continue to await the receipt of the remaining $40 million, which we expect as soon as the standard audits of the applicable prior tax years conclude. As mentioned, we could not be more pleased with the success we've had with our strategic initiatives. However, macro pressures, including a constrained consumer and an excess of inventory in the industry, resulted in a drop in demand in the last two weeks of October.\n\nWe expect similar dynamics to persist; and therefore, we feel it is prudent to revise our full year guidance. Given the challenging macroenvironment, we continue to closely manage our business and our costs in a strategic and effective manner. We are cutting investments where prudent in the near term to better assess the longevity of this macro pressure but also want to remain cognizant of the critical growth we want to continue in our owned brands business and retaining our top talent in this hypercompetitive labor market. With all of this as a backdrop, we are revising our full year guidance as follows.\n\nRetail comp sales growth is still anticipated to come in in the mid-single digits but is now projected at the lower end of that range. Non-DBI wholesale growth is expected to be 20% to 30% over last year and adjusted EPS is now expected to be $1.75 to $1.80 for the full year, actually squarely in line with our initial 2022 guidance of $1.75 to $1.85 we issued at the beginning of the year. We continue to be very proud of the structural changes we have made in our business that allow us to better perform even when these macro pressures arise. As a comparison, 2019 saw sales actually a bit higher for total DBI than what this revised guidance would imply, but adjusted EPS in 2019 was only $1.47.\n\nWith the meaningful growth in our owned brand sales; the growth in athletic and top 50 national brands, which require less discounting; and our digitally focused and targeted approach to marketing at our retail business, replacing the broad-based direct mail discounts of the past, we continue to see sustained leverage in our gross profit rate versus 2019. And this sustained margin profile change, along with our more strategically diversified revenue or profit streams across more meaningful business segments, keeps me excited about what this means for Designer Brands as we move past these macro issues and continue to make meaningful progress toward our long-term strategic plans. As we navigate this challenging environment, we will continue to lean on our strategic pillars, being adaptable, nimble, and utilizing our DTC infrastructure to move inventory and grow owned brands. With that, we will open the call for questions.\n\nOperator.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Our first question comes from Jay Sole from UBS. Please go ahead.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much. Roger, if you could just talk about the change that you've seen in the competitive environment consumer behavior into the fourth quarter, maybe just tell us a little bit more about sort of like the gross margin change in 4Q that's leading to the change in the guidance for the full year and sort of, you know, what you expect in the fourth quarter relative to third. Do you think the fourth quarter will be a little bit more competitive than what you've seen so far or do you see they're about the same or do you see maybe getting a little bit better? Thank you so much.\n\nRoger Rawlins -- Chief Executive Officer\n\nThanks, Jay. You know, I think there are two major macro trends that we've experienced throughout Q3 that we are clearly -- I think with our guidance showing that that's our expectation that those trends will continue into Q4. And that is when you look at how the consumer is responding, they are looking for value. And obviously, inflation has been a big driver of that.\n\nAnd Doug can talk to this, but our DSW clearance business, which was planned to be up in a material way, it posted a 28% comp. The customer is voting that they want value passed. So, you know, that's number one. And then the second one is just the amount of excess inventory that we see, again, what's out in the market and the amount of items being sold into the secondary goods market.\n\nAnd obviously, you know, we play there and try and sell things to some of those people. And when you see what offers are being given on product you have, you know, it's clear there is excess inventory. And, you know, I'm quoting -- I'm not quoting directionally from the things that we get when you look at, you know, the three big athletic players, the Swoosh folks up 60 -- over 60%, Skechers up over 40, Adidas up over 50 in inventory. Those goods are being pumped into the market.\n\nAnd with their direct-to-consumer place, that puts pressure on that athletic category, in particular. So, those are the two big things that we have seen happen. And we don't see that slowing down as we go through Q4.\n\nJay Sole -- UBS -- Analyst\n\nGot it. And then maybe if you can just talk about this, the slowdown that, you know, happened in the second half of October and the first half of November. You know, there's some discussion if it was weather related, maybe the election was distracting to people, perhaps the compares were pretty tough from last year because of the pull forward that happened because of supply chain issues and of the omicron. You know, do you think that that's been -- that's really the reason that we've seen a slowdown, or is it more the consumer is weakening because of inflation? I mean, where do you stand on that?\n\nRoger Rawlins -- Chief Executive Officer\n\nI think -- you know, we don't really allow our team to talk about weather. But whenever you look at how our business performed and our sandal business was really strong in Q3, boots achieved our goals, but it was still a negative comp for the quarter. So, you know, our sandal business was really good. So, there was some weather.\n\nBut at the end of the day, it comes back to those two things I mentioned. The customer is clearly voting. They're looking for value, and we're seeing it in how they're -- what they're buying from us. And then the second piece is there is just a lot of inventory that's out in the market that is, you know, frankly, competitive because those brands are competing with us through their DTC channels.\n\nJay Sole -- UBS -- Analyst\n\nGot it. OK. Thank you so much.\n\nRoger Rawlins -- Chief Executive Officer\n\nYup. You're welcome. Thanks.\n\nOperator\n\n[Operator instructions] Our next question comes from Gabby Carbone from Deutsche Bank. Please go ahead.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nHi. Good morning. Thank you for taking my question. So, just want to circle back to that clearance customer again that's coming back into your stores.\n\nJust curious if you can get into how that's impacting traffic and units per transaction. Thank you.\n\nDoug Howe -- President, DSW\n\nYeah. Hey, Gabby, this is Doug. Again, you know, we had talked about the fact that this is an opportunity for us, obviously, with regards to regaining that clearance customer back. And as we said in the transcript, 28 -- we had a 28% increase in clearance sales in the quarter.\n\nSo, again, that's actually a model that, you know, we can lean into. We definitely saw that accelerating as we moved throughout the quarter. So, to Roger's point, you know, customers are definitely migrating more toward value. So, there's favorability, obviously, you know, in our model with regards to the clearance customer.\n\nAnd then the other thing that is a key differentiator is, you know -- which I couldn't be more proud of, is the results that we have with our owned brands. So, obviously, those connote significant value, and those, you know, generated 22% of our overall volume at DSW in the quarter and it was over a 30% increase. So, you know, those two factors, we believe, are going to be differentiators for us as we move forward because, again, the customer is clearly focusing on value.\n\nRoger Rawlins -- Chief Executive Officer\n\nGabby, I think -- this is Roger, and I think even to Jay's question, if you think about what it is we do and how we respond to this. As Doug said, the big thing for us is lean into that clearance prop. So, knowing that our customer comes to us, that sort of is rooted in who we are from day one, I think it's one more opportunity for us to pivot assortment and our thinking and leverage that as a way to, you know, compete and grow share. And then, you know, obviously, leveraging all of our owned brands that -- especially the ones that are exclusive to DSW, is a way to continue to pass value to the customer.\n\nAnd, you know, to Doug's point in the script where, you know, we're talking about our owned brands growing at 25% year over year. I mean, that's just remarkable. And that's been our game plan for the last three years, and it's continuing to work. But the competitive landscape is different, and that we're going to keep leaning into those things that we've been doing now for the last three years.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nGot it. I just have a quick follow-up. I was wondering if you can discuss how you're planning maybe your brand portfolio outside of DSW over the next couple of quarters as we're continuing to see, you know, retailers plan inventory pretty conservatively for next year.\n\nRoger Rawlins -- Chief Executive Officer\n\nYeah. I mean, I don't want to get into the forward-facing view until we give you some guidance for next year. But yeah, I mean, we -- what we do know is that if you're more conservative in your inventory plan, you always have the ability to chase upside. And right now, we're dealing with the pain of the industry being over-inventoried, and we will not let that happen.\n\nAnd I think we have a history and tradition of, you know, managing our inventories in a pretty tight manner. And that's our approach as we move forward, is we will be much more conservative, I would say, in how we're approaching our inventory positions, specifically as we look at what we're going to sell outside of our core DSW business and shoe company businesses.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nGot it. OK. Well, thank you very much for that color.\n\nRoger Rawlins -- Chief Executive Officer\n\nYup. Thanks, Gabby.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Roger Rawlins for any closing remarks.\n\nRoger Rawlins -- Chief Executive Officer\n\nThanks, everybody, for listening. And I know we have a lot of associates, and I just want to recap. If you think about the big things you accomplished this quarter of growing your top line by 3%, and that's on top of, remember, last year, we grew our business by 41%. So, there's not a lot of folks I see out there in our space that had those kind of results for the third quarter.\n\nYou grew our owned brands, meaning the things that we own and control, by 25% and penetrated at 27%, versus 22% last year. Remarkable. Then you add into that our direct-to-consumer channels that grew by 33%. Our gross margin rate up 370 bps to where we were in 2019.\n\nAnd then just the amazing progress that Mary Jo and Nancy and the whole team up in Canada have demonstrated growing 19% and grabbing huge market share. The strategies we've put in place over the last four or five years are working. And just keep doing what you're doing, and I can't thank you enough and hope everybody has a fantastic holiday. Talk to you soon.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJesse Miller -- Senior Director, Investor Relations\n\nRoger Rawlins -- Chief Executive Officer\n\nDoug Howe -- President, DSW\n\nJared Poff -- Executive Vice President, Chief Financial Officer\n\nJay Sole -- UBS -- Analyst\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nMore DBI analysis\n\nAll earnings call transcripts"
}