{
  "companyName": "Sportradar Group AG",
  "companyTicker": "SRAD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/16/sportradar-group-ag-srad-q3-2022-earnings-call-tra/",
  "content": "Sportradar Group AG (SRAD 4.84%)\nQ3 2022 Earnings Call\nNov 16, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day and welcome to the Sportradar third quarter 2022 earnings conference call. [Operator instructions] After the speakers' presentation, there will be a question-and-answer session, and instructions will be given at that time. As a reminder, this call may be recorded. I would like to turn the call over to Christin Armacost, manager of investor relations.\n\nYou may begin.\n\nChristin Armacost -- Investor Relations Manager\n\nThank you. Good morning, everyone, and thank you for joining us for Sportradar earnings call for the third quarter of 2022. Before we begin, I would like to point out that the slide we will reference during this presentation can be accessed via the webcast on our website at investors.sportradar.com. These slides will be posted on our website at the conclusion of this call.\n\nA replay of today's call will be available on our website. After our prepared remarks, we will open up the call to questions from investors. In the interest of time, please limit yourself to one question plus one follow-up. Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue and future business outlook.\n\nThese statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast. For more information, please refer to the risk factors discussed in our annual report on Form 20-F and the Form 6-K furnished with the SEC today, along with the associated earnings release. We assume no obligation to update any forward-looking statements or information, which speak as of their respective date. Also, during today's call, we will present both IFRS and non-IFRS financial measures.\n\nAdditional disclosures regarding these non-IFRS measures, including a reconciliation of IFRS to non-IFRS measures, are included in the earnings release, supplemental slides, and our filings with the SEC, each of which is posted to our investor relations website. Joining me on the call today are Carsten Koerl, chief executive officer; and Ulrich Harmuth, interim financial -- interim chief financial officer. And now, I'd like to turn the call over to Carsten Koerl.\n\nCarsten Koerl -- Chief Executive Officer\n\nThank you, Christin, and thank you all for joining us today. And welcome to Sportradar's Q3 earnings call. We are pleased to report a very strong quarter, with strong revenue growth, as well as an expansion of profitability and cash conversion, showcasing our sustainability, scale, and operating leverage of our business model. Now, I'm touching on the operational goals.\n\nWe are proud of these results, and we remain focused on our core operational objectives. Expanding our high-margin rest of the world business based on our upsell and cross-sell strategy to move customers up the value chain. Second, leveraging our significant investment into people, technology, and make relationships in the U.S. market.\n\nThat is to say we expect to grow our revenue base and the underlying market growth, which is further accelerating by the growth share in in-play betting. Number three, drive efficiency across the organization by leveraging our global footprint, streamlining processes, and optimizing our resources. And last one, continue to make investments into strengthening our market position and expanding our addressable market. The execution against these objectives has resulted in solid operational performance and financial results through the first nine months of this year was exceeded our expectations.\n\nFor our third quarter, we delivered strong year-over-year revenue growth of 31%. We delivered an adjusted EBITDA margin of 20% this quarter, compared to 15% in the third quarter last year and 16% in the second quarter 2022, 400-basis-percentage-points uplift. Let me remind you that these strong results have been achieved despite significant adverse market conditions in some of the regions that we serve, as well as the potential of global recessions. We further managed to generate strong operational cash flow with a conversion rate of 93%.\n\nWhile this cash conversion has been favorably impacted by foreign exchange rates this quarter, we continue to generate cash to invest into organic and inorganic growth opportunities. This remains one of our business priorities and has enabled us to prepay 200 million of our bank debts this quarter. Our revenue growth was predominantly driven by the rest of the world betting business, where we continue to expand our business with existing customers. This is reflected in a 117% net retention rate this quarter compared to the same period last year, strongly driven by our ability to move customers up the value chain.\n\nManaged betting service, as our highest value service in the data value chain, grew 84% compared to last year, attributed to cross-selling new products into existing customer base. Our advertising business, which is a relatively new product in our portfolio, grew by 62% versus last year. During the quarter, our managed trading service generated an annualized betting turnover of 19 billion run rate. To put this into perspective, this compares to approximately 11 billion British pounds in stakes that FanDuel accepted in the first six months of 2022, the second strong growth contributor in our U.S.\n\nbusiness, which reached profitability in the third quarter of 2022 for the first time ever. Our CFO will go into more details, but I'm very excited to report the first positive adjusted EBITDA margin of 11% for our U.S. business segment in this quarter, the first time since we became a public company. Based on the continuous growth in the U.S.\n\nbetting, the number of states will have regulated betting, as well as a good adoption of in-play betting, we see that our early investment into people, products, technology, and sports rights are paying off. The positive adjusted EBITDA results further demonstrate that Sportradar business model of generating profits in growing markets because of operational leverage and increasing share of in-play betting also works very well for the U.S. marketplace. Revenue in our U.S.\n\nsegment grew by 61% compared to last year's quarter. This remains largely a result of the growth of the underlying betting volume as we are participating in the NGR of our customers. However, when we look at the rest of the world business, we see the biggest growth driver for Sportradar's revenue is in-play betting. More than 90% of our rest of the world revenues are driven by in-play.\n\nWe believe we can see similar success in the U.S. with this segment. The U.S. market is still in a very early inning of the in-play betting and the real-time shares of GGR are between 15% and 35%, depending on the sports, compared to an in-play share of 80% in the European markets.\n\nWith the development of live betting products for the U.S. sports and the growing customer acceptance, we strongly believe that the in-play betting could become the biggest future growth driver for the U.S. betting market and Sportradar's revenues in the United States. Continuing with the U.S., I want to highlight a few of our successes and recent developments.\n\nLast month, we signed a landmark deal with our partners at FanDuel, an early extension of our existing relationships as the preferred data and odds supplier throughout the 2030-2031 NBA season. The early extension of this is a testimony of how long-term league deals provide us with the ability to expand the relationship with our customers and move them from a pure content distributor to an embedded technology provider. Under the new contract, we will work closely together with FanDuel to develop products, leveraging the NBA's state-of-the-art player-tracking technology to create new opportunities for same-game parlays and in-play betting, highlighting Sportradar's strength in live betting. We will also provide our Live Channel Trading and content distribution platform, providing video streaming eight seconds faster than a TV broadcast.\n\nThis broadening of our relationship with FanDuel fully aligns with our U.S. strategy to leverage our long-term relationships to support our key U.S. customers with their product development and creating exciting user experiences. Another innovative relationship we announced is Tennis Data Innovations.\n\nWe expand the distribution of ATP Tour official data to betting operators. The partnership is creating new secondary feed directly from the umpire chair to provide the fastest, most reliable, and most accurate data in in-play betting markets and enhance fan experience. We also announced our largest rest of the world paid social advertising deal with Kindred, a large international online gambling operator. Kindred will use Sportradar's AI and machine learning technology to engage more efficiently with sports fans and bettors across the Meta platforms of Facebook and Instagram.\n\nLast, we are pleased to mention that we have won the American Gambling Award for Data Supplier of the Year. This award is presented by Gambling.com and recognizes excellence in data service delivery. A true statement to the service we provide to our customers and the successful year we had so far in 2022. The American Gambling Awards are highly competitive, and we are excited to receive our exclusive Golden Eagle trophy.\n\nOn the previous earnings call, we mentioned the reorganization of our management team. From January 2023 onwards, Sportradar will globally organize content creation and acquisition, product development, and commercial execution while retaining a dedicated go-to-market approach for the United States. This new structure will lead to a streamlined organization, allowing a more efficient process, faster decision-making, and the ability to serve our global customers even more efficiently. Finally, after having spent the better part of October meeting with investors and analysts, I want to address a key concern many of you the possibility -- have told us the possibility of a recession and the impact on Sportradar.\n\nTo address that, I would like to spend a few minutes on Sportradar's growth model, which is based on four levers. Number one, Sportradar serves a global betting market that is expected to grow 11% annually throughout 2027. Historically, the global betting markets have grown throughout all crises, with the only exception being in 2020 when, due to the pandemic, a large number of sports competition was suspended. Second, Sportradar consistently managed to grow almost three times faster than the underlying market due to our ability to up and cross-sell customers, moving them higher up the value chain and expanding into new regulated markets.\n\nOur model enabled us to grow 6% in 2020, despite the underlying betting market contracting by around about 11%. Number three, based on the growing revenues, we can expand our margin by leveraging significant scale in our business model with a streamlined organization for global content acquisition, global product development, and global technology and infrastructure. And lastly, our profitability generates significant growing cash flow that we invest into our future, expanding our product portfolio, geographical reach, and increasing our addressable market. We have built this model over the last 20 years.\n\nAnd while the question about impacting of a potential recession looms in investor minds, it is also on top of the mind of Sportradar's management team. I want to leave you with some of the history as you think about our Q4 and beyond. Despite various economic recessions in the past, including the pandemic events, since its inception, this company, Sportradar, has always had a positive growth year over year. Further, despite the turbulent market and economic conditions, we exceed our expectations for the first three quarters of this year.\n\nBecause of this foundation and our continued innovation as a market leader, we believe there are many reasons to be optimistic about our future for continued profitable growth. With that, I would like to turn the call over to Ulrich Harmuth, our interim CFO. Ulrich has been working very closely with me at Sportradar over the last 10 years. Ulrich was previously responsible for corporate development and M&A and was instrumental in driving all aspects of our IPO last September.\n\nUlrich has a deep understanding of the company and its financials, and I have no doubt that he will lead the financial organization to achieve greater success in the months to come. Over to you, Ulrich.\n\nUlrich Harmuth -- Interim Chief Financial Officer\n\nThanks, Carsten, for the kind words. I'm very excited to lead the finest team and partner with our management team to continue to deliver strong results. I look forward to talking to our investors and discussing the strong investment thesis for Sportradar. Let me now provide you further details on the strong results for this quarter.\n\nRevenues in the third quarter increased 31% to 179 million versus the third quarter of 2021. Growth was strong across all of our segments. Once again, the majority of growth came from our rest of world betting business, which contributed 22 million of our growth. The U.S.\n\ngrew 61% compared to last year. We reported an adjusted EBITDA of 37 million for the third quarter, up 69% year over year, resulting in an adjusted EBITDA margin of 20%, compared to 15% in Q3 of last year. The third quarter is typically Sportradar's strongest quarter with regards to profitability as the major U.S. leagues are on season break and sports rights costs are only amortized over the months the leagues play.\n\nOur levered cash conversion was 93% and the unlevered cash conversion was 104%, both positively impacted by foreign exchange rates. Even after the prepayment of 200 million of our bank debt, we still have more than half a billion of cash and cash equivalents on our balance sheet. Now, looking at our segment revenues. Our rest of the world betting revenue grew 28% in the quarter to 101 million, representing 56% of our total revenue.\n\nGrowth was primarily driven by an uptick in our higher value add offerings, including managed betting services, or MBS, and live odds services. More specifically, MBS revenue grew 84% year over year to 38 million. Our live odds business grew 12% due to upselling content to existing clients. Rest of the world betting adjusted EBITDA increased 8% to 48 million.\n\nThe associated adjusted EBITDA margin declined to 48%, versus 57% in the prior period as a result of inorganic investments into artificial intelligence capabilities, as well as temporary savings in sports rights and scouting costs in the prior year due to the COVID-19 pandemic. The rest of the world AV segment grew 14% year over year to 33 million. This growth was largely driven by cross-selling audiovisual content to existing data customers and expanding the AV portfolio with existing AV customers. Rest of the world AV adjusted EBITDA increased 32% to 13 million.\n\nThe segment adjusted EBITDA margin increased to 38 million from 33 million, mainly due to -- as a result of revenue growth. Now, turning over to the United States. The U.S. segment continues to be our highest growth segment and reached a major milestone by turning profitable on a quarterly basis this quarter, the first time since the IPO.\n\nRevenue grew 61% year over year to 32 million, with strength across the board. Betting and gaming revenues grew 144% year over year due to growth of the underlying betting markets and good signs of adoption of in-play by U.S. customers, as revenues doubled year over year, albeit from a small base. We also saw strong growth in our audiovisual product and in our media solutions.\n\nAs highlighted before, the U.S. business generated a profit this quarter, underscoring the scalability of our business model and the ability to convert our U.S. league contracts into profitable business. Third quarter U.S.\n\nadjusted EBITDA was a positive 3 million, compared to a loss of almost 7 million last year. The U.S. adjusted EBITDA margin was 11%, versus a negative margin of 34% last year. At this stage, I would like to also comment on Sportradar's foreign exchange exposure, which mainly results from converting our U.S.\n\ndollar-denominated U.S. segment into euros, our reporting currency. In the third quarter, Sportradar Group generated U.S. dollar-denominated revenues of 39 million against U.S.\n\ndollar-denominated costs of 44 million, resulting into an almost perfect natural hedge. Now, turning to costs. Personnel costs for the quarter increased by 17 million to 68 million, in line with our expectations. When normalizing the growth in personnel cost for acquisitions into capabilities for our managed betting services, in particular, Vaix and NSoft, the organic growth rate of personnel costs has been 27% year over year.\n\nPurchased services and licenses in the third quarter of 2022 increased by 18 million to 48 million compared with the third quarter of 2021 as a result of increased costs of content creation and processing, as well as content costs for our advertising business. Other operating costs decreased by 19%, or 5 million, compared to last year's quarter due to high costs related to Sportradar's IPO in September of last year. Lastly, sports rights costs increased by 6 million to 35 million in the third quarter of 2022. Growth was driven by new deals with the ATP, the UEFA, and the International Cricket Council, as well as the 10-year extension of the NHL contract.\n\nSports rights costs as a percentage of revenue decreased to 19%, versus 21% last year. In the third quarter, Sportradar generated a strong adjusted free cash flow of 34 million, up from 33 million last year. Our unlevered cash flow conversion was 104%, down from 161% last year. And our adjusted cash flow conversion has been 93% in the quarter, compared to 158% in the same period last year.\n\nCash flow in Q3 2021 was extraordinarily high due to high expenses related to the IPO in September of last year that we only paid in Q4 last year. Cash flow in the third quarter was positively affected by favorable FX gains as the euro continued to weaken during the quarter. Cash flow has increasingly become the focus for our company, and we started several internal projects to increase the cash conversion, in particular, by managing our working capital more proactively by reducing the days sales outstanding for our customers. Furthermore, we have also reacted to rising interest rate levels.\n\nAfter having repaid half of our term loan in the third quarter, as Carsten mentioned, we plan to prepay the remaining portion of the term loan in the fourth quarter. As a result of our strong cash conversion, we retain a strong liquidity. In the third quarter, we have increased the revolving credit facility by further 110 million to now 220 million. Together with our current cash position of 512 million, this leaves us with a total liquidity of 732 million.\n\nEven after the planned prepayment of the remaining 220 million of term loan, we will still be in a strong position to support our operational business with organic investments and pursue acquisitions to further accelerate our profitable growth and expand our addressable market. Finally, let me give you an update on our guidance for the full year 2022. Based on the strong performance in the third quarter, partially influenced by the mentioned seasonality effects on sports rights costs, we are raising our expected revenue outlook to a range of 718 million to 723 million, or a 27% to 29% growth rate, coming from a prior range of 695 million to 715 million. Further, we are raising the bottom end of our adjusted EBITDA guidance and also narrow the overall range to a new range of 124 million to 127 million, representing a year-on-year increase of between 22% and 25%, from a prior range of 123 million to 133 million.\n\nWith that, I will turn the call back to Carsten for some closing remarks.\n\nCarsten Koerl -- Chief Executive Officer\n\nThanks, Ulrich. In closing, I want to remind everyone of our key priorities. We continue to focus on growing our core betting products and further expanding our market position in the U.S. while improving our profitability and cash generation due to the operating leverage in our business model.\n\nWe remain prudent stewards of managing your capital, balancing risks and opportunities, all in the name of long-term shareholder value creation. With that, I turn it over to the operator for Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from Ryan Sigdahl with Craig-Hallum. Your line is open.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nHey, Carsten. Congrats, Ulrich, and really nice job on the quarter, guys. Two for us here, one on strategy and maybe one more specifically on guidance or current operations. So, first, U.S.\n\npositive EBITDA, really nice to see that inflection a lot quicker than we were anticipating here. But is that sustainable going forward or how much of that, said differently, is the result of kind of a sports calendar within Q3 on your official rights cost?\n\nCarsten Koerl -- Chief Executive Officer\n\nWell, I might take this question. Ryan, nice to hear you. No, we see, going forward, profitability in the U.S. segment, and it's mainly driven with what we can convert from pre-match into live, which is the interesting piece here.\n\nSo, we have between, depending what sport it is, 15% to 35% at the moment proportion of live betting, the NFL, the weakest; the NHL, as you know, the strongest. These numbers which we get from our clients. And every margin point which we convert now here is where Sportradar at the moment of 1.2 million roundabout. And this is revenues which comes practically without any additional costs.\n\nSo, this trend is giving us great confidence that we are continuing to go down the road, which you see now and you saw that now quarter by quarter in the last four quarters, we continue to reduce the losses. Now, we reached first-time-ever profitability. So, because of that trend, we are very optimistic. Of course, we are also optimistic by seeing our media business, which is growing strongly in the U.S.\n\nSo, that gives us confidence in this outlook.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nThat's really great to hear. Second follow-up question here. Just given the recent litigation settlement with Genius and U.K. football really defending and reinforcing official rights, does that change your operational focus on leagues where Sportradar has official rights and, by far, the largest portfolio of those versus open-sourcing data for nonpartner leagues?\n\nCarsten Koerl -- Chief Executive Officer\n\nWell, I think, on the litigation piece, you saw the announcement, and I do not need to dive deeper into this. And yeah, to the nature of your question, no, it doesn't change. This was a settlement which we reached with Football Dataco, and this is extremely important for us. We have now a sublicense.\n\nWe can access the data, and we will incorporate this data into the suite of our products. And financially, it means that we pay a license fee, but we are able to sell the Football Dataco content to our customers and generate additional revenues with a positive EBITDA contribution. This was not possible before because we have no access to this data.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nHelpful. Thanks, guys.\n\nOperator\n\nOur next question comes from David Karnovsky with J.P. Morgan. Your line is open.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. A big one for Carsten and for Ulrich. Carsten, I think last quarter you spoke to a value-based pricing model with some of your bigger operators.\n\nWondering if now maybe you could provide some details around this, if anything, to your time in the FanDuel? And then for Ulrich, you did release a preliminary outlook for 2023. I just wanted to see if you could walk through some of the drivers at a higher level, and then is there anything you could say on free cash flow conversion outlook? Thanks.\n\nCarsten Koerl -- Chief Executive Officer\n\nSo, the value-based pricing is, of course, in connection with our reorganization in the management. As reported, we have now started that transformation process that will look from a sales perspective on a global basis. We cluster our clients in a different way like we did it before. We pay more attention to our big clients, and we're trying to do more for the smaller clients to uplift them.\n\nAnd the value-based pricing is one of the modules for this. There are many more things which we are considering here, and we are already seeing the fruits of this transformation process in the quarterly numbers. With this, I hand over to Ulrich.\n\nUlrich Harmuth -- Interim Chief Financial Officer\n\nYeah. Thanks, Carsten and David. It's good to hear from you. So, on the 2023 guidance, on the revenue side, we see continuous strong momentum in our two key growth segments, which together account for almost 75% of our growth.\n\nThe first one being the rest of world betting business, where we grow primarily as a result of moving customers up the data value chain, as we've seen also in this quarter, moving customers to our match betting services. And the second one is the growth in the U.S. betting business, driven by three factors. First of all, our growth based on our customers' growth since we are participating in their revenues.\n\nSecondly, the increased adoption of in-play betting, where we simply -- Sportradar have a bigger revenue opportunity compared to pre-match. And thirdly, you know, as a result of the expansion of our customer relationships that we've just seen with FanDuel. Therefore, we are very confident about our revenue growth. And with regards to the margin expansion, you know, we've basically seen in the third quarter the operational leverage in our business.\n\nWe have grown our revenues by 31%. Sports rights costs only grew by 20%. Personnel costs only grew by 27% when normalizing for M&A effects. And our operational expenses even declined.\n\nAnd, you know, taking all these factors into consideration and despite adverse market conditions, we feel very strongly and very positive about the business prospects for the next year and are confident to be able to continue our path to grow revenues while expanding our profitability and our cash flow in parallel.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from David Katz with Jefferies. Your line is open.\n\nDavid Katz -- Jefferies -- Analyst\n\nMorning, everyone. This may be another version of some of what you discussed, but I'm just eyeing the guidance and seeing with the revenue amount of growth as compared to the EBITDA growth. Can you just discuss a little further what the, you know, impact to flow-through is on that guidance and, you know, why there isn't just a bit more of the revenue reaching the bottom line? Thank you.\n\nCarsten Koerl -- Chief Executive Officer\n\nUlrich, that is a question for the CFO.\n\nUlrich Harmuth -- Interim Chief Financial Officer\n\nYeah. No, happy to answer that. I think, you know, we discussed this already on previous calls. So, we have some adverse market conditions that we have to face.\n\nAnd as a result, we also had to change somehow our product mix and some of the high-margin revenue that we were expecting coming from some of the markets that we can serve at the moment are simply not hitting our EBITDA line, and we grow faster than we projected in our advertising business and that is a lower-margin business, and that's the reason why we increased our revenue guidance and, you know, despite the adverse market conditions, only increased the lower margin of our EBITDA guidance.\n\nDavid Katz -- Jefferies -- Analyst\n\nPerfect. Thank you.\n\nOperator\n\nOur next question comes from Michael Graham with Canaccord. Your line is open.\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nThank you and congrats on the U.S. profitability. Just, you know, could you maybe at a high-level talk about, you know, now that you expect the U.S. to be profitable, just the pace of margin expansion that we should expect to see there at a high level? And then I thought it was interesting, you mentioned acquisitions in your prepared remarks.\n\nIf you just maybe talk broadly about, you know, what types of assets you think the business might need.\n\nCarsten Koerl -- Chief Executive Officer\n\nYes, Michael, happy to take on this question. So, looking now to the U.S., like highlight that the main thing is really for us focusing on whatever is real time. Real time is generating the highest value for Sportradar in all the business lines. Real time, in this specific case, means live betting.\n\nSo, whatever we can do here to create innovative services where we stimulate live betting is what we do, and we do this very consistent with our league partners. We are doing workshops with our clients and with the league partners to figure out what kind of product can help best to stimulate this. It's simply there is a big trend there. And yeah, like I mentioned several times, we see that the U.S.\n\nis following the past, what we learned in all other markets in the world. So, that is giving us here confidence. Now, looking to those investments, it's things like how can we improve with a new algorithm, new pricing models that we trade a little bit better, and that makes for us a big, big difference. So, if we are hiring the profitability of our managed trading services only with 0.5 percentage point, that means, for us, bottom line, 10 times more cash, which we get with this, considering that it's 5% to 6% profitability on a single bet, which you have there.\n\nSo, this are exciting things. Of course, there's a lot of things ongoing in visualization, which also leading into this trend, how can you visualize the match better to get more fan engagement? More fan engagement is leading into live betting. And the third one, which we see there is, of course, the state-by-state opening. We have not expected that California is opening up.\n\nOur models are saying 2024. So, there is still a good chance that our models are right with California also opening up for sports betting. But we see that the strategy of state-by-state opening is going very, very well, hand-in-hand with our predictions. And of course, that's beneficial for us.\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Shaun Kelley with Bank of America. Your line is open.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nHi, everyone. Thank you for taking my question. I just wanted to ask about the sort of cadence for the rest of world margins. So, I think you've kind of called out some of the adverse market conditions and, I think, you know -- and some of the drivers for the margins this quarter.\n\nCan you just help us think, going forward, as we start to lap, you know, I think probably particularly issues in the Ukraine, should -- in '23, should rest of world growth, you know, growth rates and margins start to look a little -- you know, start to look a little bit more in line with revenue growth as we kind of move past some of the headwind -- kind of these one-time headwinds that you're probably experiencing right now? Is that the right way to think about it?\n\nCarsten Koerl -- Chief Executive Officer\n\nUlrich, can you go on this? It's a number question on the projections.\n\nUlrich Harmuth -- Interim Chief Financial Officer\n\nYeah.\n\nCarsten Koerl -- Chief Executive Officer\n\nTo see for a perfect place for [Inaudible]\n\nUlrich Harmuth -- Interim Chief Financial Officer\n\nHappy to do that, Shaun, and very nice meeting you. So, the current numbers for 2022 obviously completely reflect all adverse market conditions. And therefore, going forward, we do not expect that there's anything additional hitting our margin. And therefore, I would agree that going forward, you will see revenues grow in line with our adjusted EBITDA, grow in line with our revenue growth.\n\nEven -- you know, we should actually be able to see also some operational leverage in our rest of world betting business.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nOK, great. Thank you. Understood. And then maybe just, you know, can we just talk maybe big picture about sort of the longer-term margin outlook in the U.S.? And then, Carsten, you've been very clear on adoption of in-play being particularly important to that.\n\nBut, you know, is there any kind of reason or change in your thinking around sort of the progress of U.S. margins eventually approaching, you know, sort of your international levels? What are some of the puts and takes there, particularly thinking about the, you know, kind of NBA contract coming on in '23 and beyond and what that could mean for, you know, rights costs over here as well?\n\nCarsten Koerl -- Chief Executive Officer\n\nThat's more a mid- to long-term project and always a bit tricky to give some. But look, you see the strong growth, 144%; and the betting core business in the U.S at 110%; audiovisual, 87%. There's still a lot of runway. We -- if we get more audiovisual content, of course, that will boost our products.\n\nAnd we are actively speaking here with sports and leagues about this. Looking now from a growth perspective, we have 10-year deals with two of the big four with the NBA and the NHL. And the challenge here is how can we create value for our clients by not blindly upselling data. How can we embed ourselves into the value chain, into the products that we generate this revenue for our clients? We are super confident that we deliver this, and the FanDuel deal is showing you in which direction this is going.\n\nSo, I think we did clever decisions by having long-term deals with two of the big four properties, and we are working very closely with MLP on the same direction. So, it's about how can you create a product which is generating profitability for the clients and not only blindly upselling the data which they have to integrate by themselves. So, it's a kind of combined action between us, the leagues, and the betting operators. And the ambition always is to create this value.\n\nYes, there is a price uplift with the NBA contract. I recall how much critiques I got when I announced this in September last year that this is a landmark deal for us. And now, we demonstrate that we get the biggest operator in the United States on a 10-year commitment for this deal, which comes with all this creation of new services. So, we're pretty confident that this will scale and follow the blueprint which we have in the rest of the world business.\n\nWe see no reason why that should not be the case.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question comes from Bernie McTernan with Needham and Company. Your line is open.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thank you for taking the questions. Maybe to start, Carsten, you just mentioned that the FanDuel deal. Would just love more color on the deal, especially there was some mention of supplementary betting services that are included.\n\nI was wondering if that includes maybe a minimum commitment on the ads product. And then also, I think you mentioned that there were U.S. AV rights for the NBA as well. So, just wondering if there's any color in terms of what games you would have access to, if that's true.\n\nCarsten Koerl -- Chief Executive Officer\n\nCan you repeat the second question, please? I had [Inaudible]\n\nBernie McTernan -- Needham and Company -- Analyst\n\nYeah. If there's -- I believe you said on this call that there was AV rights or streaming rights associated with the NBA deal. So, interested in just what games you would have access to.\n\nCarsten Koerl -- Chief Executive Officer\n\nOK. No AV and streaming rights are associated for the U.S. piece of the deal. Internationally, we have the NBA streaming and AV rights and preselling just to clients, not only to FanDuel.\n\nSo, it's nothing specific. For FanDuel, there are four, I think, remarkable points. First, it's the largest customer, and we managed to get the largest U.S. sportsbook into a 10-year relationship on this property.\n\nSecond, we are uplifting them on the value chain of our products. So, we are not only the preferred data supplier. We are integrating into the products of FanDuel with various ways. I will give you the details on this.\n\nThird, big piece is tracking and the live channel. So, first time ever, we can use tracking data to create attractive player proposition bets, hoping and helping the clients that they can have more parlays in running, which is consistent with our strategy that we convert pre-match into live. And number four, it's a signal for the whole market that this is the direction you need to take. And we see already a lot of pickup on this one.\n\nLet me answer the side question on -- which you ask about ads. We at Sportradar are not in favor to force our clients into a direction that there must be a minimum guarantee for a channel which is complementary but not core sports betting. So, we are performing and we are gaining market shares, which you see into the ads performance of 110% uplift quarter by quarter. But we are not forcing the clients with a minimum guarantee that they have to go with ads services with us.\n\nSo, we want to demonstrate this product's strengths, the bookings, and prove this all the time instead of having a huge application for the client.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nThat's great. And maybe just to follow up on that last point on the significant growth that you're seeing in the ads product, is that adding more customers? Is that more spend per customer? We just love to, you know, get some more insight in terms of what's driving the growth.\n\nCarsten Koerl -- Chief Executive Officer\n\nThe main thing what is driving the growth here is, of course, the programmatic advertising and a more sensitivity from the customers on spend in channels like broadcast. That's, by the way, something which we see also in the rest of the world. Here, the growth is 46%. And yeah, we reported a big new client, which is now joining us.\n\nThat's Kindred. That's one of the big worldwide operators, multinational operators. And they're going now on our paid social, which we have with Facebook and Instagram, and that's an extension of the ads services. So, we see growth with existing clients, and the numbers I gave you, and we see new clients coming in.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thanks for taking the questions, Carsten.\n\nCarsten Koerl -- Chief Executive Officer\n\nNo problem.\n\nOperator\n\nOur next question comes from Jason Bazinet with Citi. Your line is open.\n\nJason Bazinet -- Citi -- Analyst\n\nI was just going back, looking at my notes when before you guys went public. And I don't think the U.S. was supposed to turn profitable for -- I don't think you ever gave it time, but it was certainly sort of beyond '23. And it seems like the [Audio gap]\n\nOperator\n\nThere are no further questions. I'd like to turn the call back over to Carsten Koerl for closing remarks.\n\nCarsten Koerl -- Chief Executive Officer\n\nYeah. Thanks, everyone, for joining the call today. In closing, I want to reiterate our ability to meet and exceed our revenues and profits expectations despite the ongoing economic challenges we face. We will continue to expand our top line with a focus on growing our betting rest of the world business, as well as the U.S.\n\nbusiness. In parallel, we relentlessly drive leverage into our business model to grow our bottom line and our cash flow. The first quarter with a positive EBITDA contribution from the U.S. is a clear indication that our business model also works in the United States market.\n\nAnd I want to personally thank our Sportradar team for their persistent commitment day in, day out to serve our customers and league partners by continuing to build our business. I couldn't be more proud of what we have achieved so far and remain incredibly confident in our prospects for the future. Thank you for joining the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristin Armacost -- Investor Relations Manager\n\nCarsten Koerl -- Chief Executive Officer\n\nUlrich Harmuth -- Interim Chief Financial Officer\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nBernie McTernan -- Needham and Company -- Analyst\n\nJason Bazinet -- Citi -- Analyst\n\nMore SRAD analysis\n\nAll earnings call transcripts"
}