{
  "companyName": "Masimo",
  "companyTicker": "MASI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/masimo-masi-q2-2022-earnings-call-transcript/",
  "content": "Masimo (MASI 0.75%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to Masimo's second quarter 2022 earnings conference call. The company's press release is available at www.masimo.com. [Operator instructions] I'm pleased to introduce Eli Kammerman, Masimo's vice president of business development and investor relations.\n\nEli Kammerman -- Vice President of Business Development and Investor Relations\n\nThank you, and hello, everyone. Joining me today are chairman and CEO, Joe Kiani; and executive vice president and chief financial officer, Micah Young. This call will contain forward-looking statements, which reflect management's current judgment, including certain of our expectations regarding fiscal year 2022 financial performance. However, they are subject to risks and uncertainties that could cause actual results to differ materially.\n\nRisk factors that could cause our actual results to differ materially from our projections and forecasts are discussed in detail in our periodic filings with the SEC. You will find these in the investor relations section of our website. Also, this call will include a discussion of certain financial measures that are not calculated in accordance with generally accepted accounting principles or GAAP. We generally refer to these as non-GAAP financial measures.\n\nIn addition to GAAP results, these non-GAAP financial measures are intended to provide additional information to enable investors to assess the company's operating results in the same way management assesses such results. Management uses non-GAAP measures to budget, evaluate and measure the company's performance and sees these results as an indicator of the company's ongoing business performance. The company believes that these non-GAAP financial measures increase transparency and better reflect the underlying financial performance of the business. Reconciliation of these measures to the most directly comparable GAAP financial measures are included within the earnings release and supplementary financial information on our website.\n\nInvestors should consider all of our statements today, together with our reports filed with the SEC, including our most recent Form 10-K and 10-Q, in order to make informed investment decisions. In addition to the earnings release issued today, we have posted a quarterly earnings presentation within the investor relations section of our website to supplement the content we will be covering this afternoon. I'll now pass the call to Joe Kiani.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nThank you, Eli. Good afternoon, and thank you for joining us for Masimo's second quarter 2022 earnings call. This is the first time we are reporting results that include our recently acquired consumer business after we closed the transaction in April. The new business performed very well in the quarter, with sales exceeding expectations.\n\nWe also achieved a solid rebound in the revenue growth rate for our healthcare business for the quarter, with revenues rising 17% versus the prior year period, including the boost from shipping most of the delayed first quarter orders in the second quarter. In addition, our installed base grew 7% over the past 12 months as we are experiencing strong persistent demand for our innovative technologies. As we closed the consumer business transaction in April, we've been moving at full speed to create many exciting new consumer health products with the collaborative R&D efforts that draws expertise from both sides of our business. We now have combined teams of engineers who are working diligently to develop very exciting new products.\n\nThe long-term potential for Masimo has never been greater than it is today. Our high level of conviction about the future success of our company is reflected in the 3 million shares we repurchased in the second quarter. On a related note, I'm glad to report that our board has issued a new authorization to repurchase up to another 5 million shares. Now I'll ask Micah to review our second quarter results in more detail and provide you with an update on our 2022 financial guidance.\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nThank you, Joe, and good afternoon, everyone. Before I get started, I'd like to direct you to our earnings presentation on the Masimo website, which covers much of the detail that we will be discussing today. The financial measures I will be covering today will be primarily on a non-GAAP basis unless noted otherwise. Further, I will also be referencing pro forma financial measures, which include historical results for Sound United prior to the acquisition date of April 11, 2022.\n\nIn our presentation today, we will be referring to this business as our non-healthcare segment. Our second quarter results reflect a rebound we expected in growth for our Healthcare segment as we fulfilled many of the delayed orders from the first quarter after effectively addressing the supply chain issues that have limited our shipments in Q1. The strong and persistent demand for our breakthrough technology is visible in our driver shipments for the quarter, which reached over 77,000, and exceeded our guidance of 75,000 per quarter this year. This represents our fourth consecutive quarter of roughly 75,000 units shipped.\n\nWe have now shipped nearly 2.4 million technology boards and instruments over the last 10 years. At the end of the second quarter, we estimate that our installed base has grown by 7% over our installed base at the end of second quarter of 2021. For the second quarter of 2022, we reported consolidated revenue of $565 million, which exceeded the high end of our guidance range. On a pro forma basis for the full quarter, our consolidated revenues would have been $572 million, representing 12% reported growth and 15% constant currency growth.\n\nFor our Healthcare segment, second quarter revenues were $357 million, representing 17% reported growth and 19% constant currency growth. As Joe mentioned, growth was helped by shipping most of the delayed orders from the first quarter that were related to supply chain issues earlier this year. On a year-to-date basis, our healthcare revenues were $661 million, representing 9% reported growth and 11% constant currency growth year-to-date. For our consumer non-healthcare segment, second quarter revenues were $208 million April 11, 2022, through fiscal quarter end.\n\nOn a pro forma basis, for the full quarter, our consumer non-healthcare revenues would have been $215 million, representing 4% reported growth and 10% constant currency growth. This business had solid growth across all regions and categories led by the premium brands of denim, Marantz and Bowers & Wilkins. The combination of strong demand with effective management of supply chain challenges produced better-than-expected sales performance during the quarter. Moving down the P&L.\n\nFor the second quarter of 2022, we reported consolidated non-GAAP gross margin of $54.7. Our margins were adversely affected by the impact of segment mix, foreign currency headwinds and supply chain inefficiencies. For our healthcare business, second quarter non-GAAP gross margin increased 160 basis points to 66.3% compared to 64.7% in the prior year period. The year-over-year improvement was a result of favorable product mix as we derived a higher proportion of our revenues from adhesive sensors versus capital equipment.\n\nFor our consumer non-healthcare segment, second quarter non-GAAP gross margin was 34.8%. For our consolidated business, our non-GAAP operating profit increased 49% to $107 million and represented 18.9% of total revenue. And our non-GAAP earnings per share increased 44% to reach $1.35 per diluted share. In the second quarter, we invested $401 million to repurchase 3 million shares of our common stock, representing over a 5% reduction of our shares outstanding.\n\nIn summary, we delivered strong performance in the second quarter with revenues, operating margins and earnings per share exceeding the high end of our guidance range. Our consumer non-healthcare segment delivered 10% constant currency growth on a pro forma basis. Our healthcare segment fulfilled most of the delayed orders, and boosted our growth for the second quarter. Further, our healthcare revenues grew 11% on a constant currency basis for the first half of the year, and we have now shipped approximately 75,000 drivers for four consecutive quarters, illustrating the strong and persistent strength in our healthcare business.\n\nI'm happy to say that our healthcare business is thriving, and we are winning new customer accounts very consistently, while keeping virtually all of our existing accounts around the globe for our SET oximetry products. At the end of the second quarter, our contract backlog was $1.2 billion, which represents a 30% increase over the prior year, and provides a good window of the durability for our future growth. We're seeing steady adoption of our connectivity technologies such as our Root, [Inaudible] and Patient SafetyNet across multiple hospital settings. Notably, the number of beds connected via Iris Gateway and Patient SafetyNet grew 20%, and our Root installed base increased over 30% over the prior year.\n\nFurther, our service revenues associated with our connected beds and our hospital automation platform increased by more than 20% compared to last year. Now I'd like to provide you with an update on our 2022 consolidated financial guidance which includes our two segments. Due to the acquisition and shifting macroeconomic conditions, we are providing consolidated guidance ranges for both the fourth -- the third quarter and the full year. It is important to note that our guidance incorporates substantially increased foreign currency headwinds from the strengthening of the U.S.\n\ndollar against most major currencies. These negative currency effects will essentially flow through our income statement to adversely affect our margins and operating income. For the third quarter of 2022, we are projecting consolidated revenue of $515 million to $545 million. For our healthcare segment, we are projecting third quarter revenues of $320 million to $330 million, which incorporates $10 million of year-over-year currency headwinds.\n\nThis reflects 9% constant currency growth at the midpoint of the range. For our non-healthcare segment, we are projecting third quarter revenues of $195 million to $215 million, compared to pro forma revenues of $227 million for the third quarter of 2021. On a pro forma basis, our guidance incorporates $23 million of year-over-year currency headwinds, implying flat constant currency growth at the midpoint of the range. Notably, this business is facing its toughest year-over-year comparison due to an exceptionally strong third quarter of 2021, which was above trend line due to new product stocking orders at a large retail customer in combination with the fulfillment of backorder products.\n\nOn a consolidated basis, we are projecting non-GAAP gross margins of approximately 53%, operating profit ranging from $72 million to $80 million, and earnings per share ranging from $0.85 to $0.97 for the third quarter. Now moving on to our updated full year 2022 financial guidance. For the full year, we are projecting consolidated revenues of $1.985 billion to $2.045 billion. Compared to our prior guidance provided back on May 3, this represents a net reduction of $15 million, which is comprised of $44 million of additional FX headwinds, offset by an increase of $29 million due to strong sales performance.\n\nOn a pro forma basis, our guidance implies consolidated revenues of $2.24 billion to $2.3 billion for the full fiscal year 2022, compared to $2.15 billion in fiscal year 2021. Further, our pro forma consolidated revenue guidance incorporates $100 million of year-over-year currency headwinds, flying 9% to 12% constant currency growth. For our healthcare segment, we are projecting revenues of $1.330 billion to $1.345 billion, which now incorporates $30 million of year-over-year currency headwinds. Compared to our prior guidance, this represents an additional $13 million increase in FX headwinds.\n\nThis represents -- this update reflects 10% to 11% constant currency growth over the prior year, which is in line with our prior guidance range. We are also maintaining our projection for shipments of at least 300,000 technology boards and instruments this year. For our consumer non-healthcare segment, we are projecting reported revenues of $655 million to $700 million from April 11, 2022, through fiscal year-end. Compared to our prior guidance, this represents an increase of $26 million to $31 million due to strong sales performance offset by $31 million of additional FX headwinds.\n\nOn a pro forma basis for the full year, our guidance implies consumer non-healthcare revenues of $913 million to $958 million for fiscal year 2022, compared to $909 million in fiscal year 2021. Further, our guidance incorporates $70 million of year-over-year currency headwinds, applying 8% to 13% constant currency growth. For our consolidated business, we are projecting non-GAAP gross margin of 55%, which assumes healthcare gross margins of 65.5% and non -- consumer non-healthcare gross margins ranging from 34% to 35%. Compared to our prior guidance, this represents a reduction of 130 basis points which is comprised of 70 basis points from additional foreign currency headwinds, 35 basis points from supply chain inefficiencies and 25 basis points from segment mix.\n\nFor our consolidated business, we are projecting non-GAAP operating profit ranging from $346 million to $364 million. Compared to our prior guidance, this represents a net reduction of $19 million to $22 million. This is comprised of $25 million of additional FX headwinds, offset by $3 million to $6 million of improved operational performance. As a result, we are now projecting consolidated non-GAAP operating margins ranging from 17.4% to 17.8% for our consolidated business.\n\nCompared to our prior guidance, this represents a 90 basis point reduction due entirely to incremental FX headwinds. Without the currency headwinds, our operating margins would have been projected in the range of 18.3% to 18.7%. Moving further down the P&L. Our non-GAAP, nonoperating expense for the consolidated business is expected to be approximately $23 million in 2022.\n\nThis is primarily comprised of the interest expense associated with the new credit facility. We are also projecting a non-GAAP tax rate of 25.7% and weighted average shares outstanding of 55.3 million. Based on all of these assumptions, we are projecting non-GAAP EPS in the range of $4.34 to $4.57. Compared to our prior guidance, this represents a net reduction of $0.12 to $0.16, which is comprised of roughly $0.35 of additional FX headwinds, offset by an increase of $0.19 to $0.23 from improved operational performance combined with share repurchases.\n\nWithout the additional FX headwinds, our non-GAAP EPS would have been projected in the range of $4.69 to $4.92. To summarize, we delivered strong performance for the first half of 2022 that exceeded expectations. Excluding the additional currency headwinds, we are raising our full year revenue, operating margin and EPS guidance due to our strong underlying operational performance. Further, our full year 2022 revenue guidance implies 9% to 12% constant currency growth on a pro forma basis.\n\nFor additional details on our 2022 financial guidance, please refer to today's earnings presentation within the investor relations section of the website at masimo.com. With that, I'll turn back the call to Joe.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nThank you, Micah. We have moved expeditiously forward with our plans to become a prominent company in the consumer health and wellness space. Our W1 biosensing watch is now in limited market release. We've been moving and receiving excellent feedback and expect the full market launch of the W1 to occur this quarter.\n\nOur biosensing smartwatch, which we refer to as Freedom, will follow next year, and that watch will have a much larger feature set than the W1, including Android watch features. Our strategy to be a leader in the deployment of clinically relevant monitoring devices within the hospitals and home settings is now taking shape as we initiate the development of new products that integrate our healthcare technologies with our consumer non-healthcare technologies. These innovative products are intended for home health and wellness use, as well as hospital and healthcare use. Our mission is dedicated, to improving lives taking noninvasive monitoring to new sites and applications while improving patient outcomes and reducing the cost of care.\n\nWith that, we'll open the call to questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question today is from Mike Matson with Needham & Company. Your line is open.\n\nMike Matson -- Needham and Company -- Analyst\n\nYeah, thanks for taking my question. I guess -- let's see where can I start. With the consumer strategy in the smartwatch, maybe you could talk about what you think it is about your smartwatch, the W1 or the upcoming Freedom watch, which is really going to kind of help differentiate you in the market versus some of the bigger companies out there like Apple or Samsung.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nWell, during the limited marketed release phase, I'll tell you what our customers are telling us. They have never had a product that allows them to do the things they've been wanting to do. So for example, the continuous and accurate information of oxygen saturation and pulse rate, it's not been there. And whether it's used for sending patients home from hospitals, patients that are at risk that want -- that need to be monitored remotely or even athletes that use some of that information for better training and better preparing for competition, they're telling us it is different, it's unique and it's compelling.\n\nIn addition, we have some unique new parameters that have never been released in a commercial watch before for both healthcare and consumer wellness, which we're hoping to release with the launch of W1. And then as far as Freedom, I want to just tell you the things I've said before and know more because of the competitive nature of this business. But we believe we have a compelling design, we believe with the addition of the Android features and some unique features that, again, have never been made available before. We think we have a great product.\n\nSo we think we have a product that should command 100% market share, which is what you want to have, what you want for your team to feel. So the question is, do we have now the right distribution channel and the right sales force to hopefully make the most out of it. And time will tell, but we've never been better prepared, and we -- I can tell you, the whole united Masimo team is excited. We're all grateful for the efforts that they have put in to date, but we're going to have a lot of work ahead of us.\n\nAnd I think it's revitalizing our team.\n\nMike Matson -- Needham and Company -- Analyst\n\nOK. Great. Thanks. And then the guidance for the third quarter, particularly for EPS is -- there's a pretty big differential there versus where we were modeling things.\n\nIs that just maybe a function of sort of the seasonality with the new consumer business kind of in the mix or something? Just -- I understand what happened with the overall kind of annual guidance and whatnot to your currency, but it just seems like there's a kind of a bigger delta there in the third quarter guidance versus consensus.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nWell, Q3, even for our healthcare business has historically been the lightest quarter. As you know, our business is typically aided by people having procedures, which they have less of them, elective procedures in the summertime, but also the flu season, which comes in Q4 and Q1 time frame. And I think on the consumer side, a lot of business gets done in the holiday season in Q4. And so I think they're kind of the same boat.\n\nSo we don't -- there's nothing that we're alarmed about. It's just the way we see the whole year.\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nYeah. Mike, just to add to that, to Joe's point, their strongest quarter for the consumer or nonhealthcare segment is, of course, the fourth quarter. And there's a lot of investment that goes into the business throughout the year, preparing for that fourth quarter. So that's having some impact on the year-over-year comparison.\n\nThe other thing is FX headwinds are very significant. So if you look at it versus our prior guidance just for the third quarter alone, about 170 basis points of FX headwinds on our operating margins as well. So something to keep in mind. \n\nMike Matson -- Needham and Company -- Analyst\n\nOK. Got it. Thank you.\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nAnd one more thing, Mike, their business is -- when you look geographically, you know how our business is, 30% of our revenues are outside the U.S. The Sound United business is about 60 -- probably about two-thirds of their business is outside the U.S. So there's definitely a heavier FX headwind coming from that business.\n\nMike Matson -- Needham and Company -- Analyst\n\nOK. Got it. Thank you.\n\nOperator\n\nThe next question is from Jason Bednar with Piper Sandler. Your line is open.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nHey, good afternoon. Thanks for taking the questions. Joe, I wanted to start with the recent announcement to part ways with Kevin Duffy, the prior CEO of Sound United. I can't help but ask, you indicated when you announced the transaction six months ago that retaining Sound leadership and talent was the top priority and is what you saw as the biggest risk to a successful integration or outcome from the acquisition.\n\nCould you help us understand what changed in kind of the three months post deal that required this leadership transition? And maybe help us feel comfortable that the risk level here hasn't risen, and fill us in on what you have planned in terms of backfilling that leadership position.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nSure. Sure. Well, I think as you go through this journey and you're working side-by-side, sometimes it feels like it's a good fit and sometimes it doesn't feel like it's a good fit. And it wasn't a good fit for either Kevin or us.\n\nWe have left on amicable terms, and he has been wonderful in exit process, and has committed to helping us post his last day, which was August 5. The good news is we have a very strong team below Kevin that have really been running the business. The way that business is run, there are five, basically, presidents, these are brand presidents that were responsible for ours, the Wilkins one of them, one of them Marantz, one of them Denim, one of them Definitive Technology and other one Polk. And these -- overall, we're very happy with that team.\n\nWe also -- there's a wonderful head of engineering. There's the Chief Operating Officer that those brand leaves reported to, an incredible supply chain and operations leader. So -- and underneath them, a very strong bench. We've had a chance to meet a lot of them.\n\nSo yeah, we still feel great about the team. We obviously are going to do our best to keep everyone that we really think we need for the journey. And along the way, these things will happen, may happen, and we certainly did not anticipate it. So to be honest with you, I did not believe we would be parting ways with Kevin.\n\nBut it is what ended up happening, and we're going to be good. I'm really excited about the future. We're going to be naming a new leader to lead that team from the Sound United team, and we're just going through the process right now, and we have a lot of good candidates to choose from.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nAll right. That's helpful. Thanks for that. And then maybe to follow-up on Mike's question, and just to maybe dig in a little bit deeper because I think this is the first time you've talked a little more openly about the mass market consumer watch.\n\nJust any details that you're willing to give us on Freedom beyond what you disclosed there. I'm not sure if you're willing to move forward with a price point yet on that product. But also just any go-to-market activities you have planned. How you're going to go about that? What kind of investment spend we should be prepared for as you enter full market release of W1 and the launch of Freedom? And then maybe, Micah, I'm just curious how you'd have to start thinking about modeling in contributions from something like W1 and Freedom.\n\nAre you willing to throw out any year one or year two targets at something like $10 million or $20 million in revenue reasonable?\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nYeah. We would love to share with you all the things that we're excited about the Freedom. But I think for the benefit of all of our shareholders, it's better that we don't. What I can tell you is Freedom will have the same bio-sensing technology as W1 with -- at minimum, the feature set that come with the Android watches that are out there and some other cool stuff.\n\nAs far as what have we been doing to prepare, as you know, our strategy has always been to provide any of our customers clinically relevant products. It becomes even more important for people that are further away from clinical oversight. So the purpose of W1 is to prove it under clinical oversight, hospital-to-home environment, and it's a very clinical selling process, which we have nearly 1,000 salespeople that will be doing that for us. And then as we get to Freedom, that's the product that we are going to need to help from the Sound United team that we've invested quite a bit to acquire and to hopefully motivate and keep going.\n\nIt's a phenomenal number of people that have spent some of them decades doing this, but before them, their predecessor -- I can't say the word anymore. But the previous team before them, 50 to 100 years of time have built this incredible distribution channel that's 20,000 distribution points strong. And of course, we're planning to do additional things as well. I think all of these are -- have been modeled.\n\nWe look forward to sharing as much of it as we can with you at the Investor Day meeting in December. Micah, do you want to add anything to that?\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nYeah. Jason, I think as you know, we're always thoughtful and prudent with our guidance. We're still learning a lot about how we're going to commercialize some of these new consumer health products, sizing the markets and also the target consumers for those products. So we don't want to get ahead of ourselves there.\n\nThe good thing is, is we don't have to. I mean the business is growing double digits. And we've got a very strong business today. So we're going to be thoughtful before we start to bring that into our guidance as we move forward into next year.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nSo -- sorry, I know it's going to be small, but just -- is it safe to assume that whatever you're assuming for W1 is baked into this year's guidance with respect to the full market release?\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nWell, just from a practice perspective, we've learned the hard way not to put anything in our guidance until the product is released. So, so far, the guidance we've given you does not have the W1 revenues that hopefully will come, except for whatever we have received in a limited market release period.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nOK. Understood. Thank you.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Jayson Bedford with Raymond James. Your line is open.\n\nJayson Bedford -- Raymond James -- Analyst\n\nGood afternoon. Can you hear me OK?\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nYes.\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nYes.\n\nJayson Bedford -- Raymond James -- Analyst\n\nPerfect. So maybe just to follow along the last line of questions, and then I have a question for Micah. The full market release of W1, what does that entail? Meaning, is this a global launch? And I assume the sale will start in a hospital setting? And if so, how will the logistics and economics of this work?\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nYes. It is going to be a global launch. We're direct in about 40 countries, and we have distribution in another 90-plus countries. So it will be a global launch.\n\nAs far as -- there's two paths with W1. We are submitting our FDA 510(k) for that product that will be for hospital and clinical use, as well as we're going to be targeting prosumers. These are -- actually, these are people who want to be fit, these maybe people that are concerned about their health. They may have COPD.\n\nThey may have heart conditions that they just want to monitor themselves. So those will be our targets. And we plan to augment our sales force with e-commerce, both from Masimo, as well as potential partners that will join. And we are looking at partnering with some organizations that have a healthcare focus to consumers that we may join forces together to further the availability of W1 for as many people that want to take advantage of it.\n\nJayson Bedford -- Raymond James -- Analyst\n\nOK. Thanks, Joe. That's helpful. Micah, just on the healthcare business in 2Q, but recall 1Q was about $25 million short because of the supply issues.\n\nIs that how we should view the 2Q overage? I'm just trying to get at an underlying growth rate? And if there's any comment between kind of drivers and consumers?\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nYeah. Great question. So the way I look at it internally here is -- I look at it year-to-date. Year-to-date, we're growing 11% on a constant currency basis.\n\nAnd that really takes into account the timing of all those shipments. It's really hard to parse it out and see what each quarter would have grown. But if you look at year-to-date, we grew 11% constant currency. That's how we're viewing the strength of the business right now.\n\nJayson Bedford -- Raymond James -- Analyst\n\nOK. Thank you.\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nYou're welcome.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nThank you. Thanks for joining.\n\nOperator\n\nThe next question is from Rick Wise with Stifel. Your line is open.\n\nRick Wise -- Stifel Financial Corp. -- Analyst\n\nGood afternoon. Hi, Joe. Hi, Micah. I'll start with the healthcare business.\n\nThere's been a great deal of just broad-based concern, not just specific to Masimo, about the capital environment, hospital, financial health. And I mean -- gosh, it seems like you had an excellent quarter, and backlog strong, etc., etc. Are you concerned at all about the capital environment? Are you concerned about the pace of new spending or the timing of new spending? Just at a high level, I'm wondering if you're seeing anything that we should be sensitive to?\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nWell, our healthcare business has never been a capital-intensive business. It's really been technology as a service model, if you will. And we purposely have done that. It doesn't mean we don't have capital revenue.\n\nWe do have a small amount of capital revenue. So of course, any reduction in that will reduce that, but that's a minority of our revenue. So we're not greatly concerned about that. But obviously, at the same time, we're all in the same boat, and we like to see our OEM customers drive, and with their capital sales.\n\nAnd so all in all, we're good, but we hope to see things improve for them.\n\nRick Wise -- Stifel Financial Corp. -- Analyst\n\nNothing unusual. Good. And turning to gross margins. Micah, maybe you could expand on your comments there.\n\nI mean you spelled out very clearly the pressures that FX and supply chain are having. But I guess two questions. One, what's next? And what steps are you taking to try to particularly -- can't do much about currency, but what can you do about supply chain and sourcing and -- is that going to get -- what's your expectation? Things get stayed the same or gradually get better? And separate but related on the Sound United gross margins. How do we think about this going forward? Do we need to get the watch launch to get margins up? I'm sure you're not satisfied with margins in the current range.\n\nHow do we think about the second half, and the outlook for next year and beyond? Thank you.\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nYeah. Rick, great question. So as I mentioned earlier in prepared remarks, we've got -- we're facing about 130 basis points of total headwinds, half of that being FX, or more than half. If you look at our underlying operational margins, down 60 basis points on our -- from prior guidance, about half of that is segment mix and the other half is some of these supply chain inefficiencies.\n\nI mean every company right now is facing supply chain challenges. I think some of them -- I still believe there's a lot of -- these challenges are transitory. And I think we're going to be facing them for the back half of this year, maybe the first part of next year. But a lot of it has to do with just -- there's not a consistent -- when you look at vendors and everything, there's not a consistent flow of components and raw materials, which creates a lot of inefficiencies in our production process because we're not only having to expedite the freight on those components coming in, but then it creates inefficiencies in our manufacturing lines because we're waiting on those components.\n\nAnd then once we get them through the manufacturing line, we have to expedite them to our customers to make sure we are meeting our customers' needs, and that's the most important thing for us. So it's a challenging environment. I can't predict when it's going to get better, but I would think that we're probably seeing the worst. And from here, hopefully, it does get better as we start to move into next year.\n\nI think that's going to give us great opportunities to drive more improvements in our gross margins back over time, but we just got to navigate through this. And the team has done a great job. We've validated multiple vendors now. I think it's woken up a lot of companies out there who are focused on just pure efficiency going to trying to get as much volume with one vendor, and it's helped us to really distribute some of that production and some of our vendor base, and we're in a better spot.\n\nPlus we're building inventories, safety stock. You are seeing that investment coming through our financials. But I think we're going to be in a better spot moving forward to make sure that we're meeting those needs of the customers and putting them first.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nYeah. Maybe I'll add a couple of things. On the hospital side -- hospitals are having a tough time. They're having to bring in traveling nurses, paying them $175 an hour.\n\nThey're seeing a lot of companies raise the prices. So we have taken the approach of not doing that. We have not put in on the healthcare side, the extra cost, the inflation that we're all facing, and hoping that it will be temporary and that we can help our customers at a time where they need help. On the -- but if it continues and if it sticks, then we'll have to adjust our prices, which we have held back for two years now.\n\nOn the consumer side, I don't believe we should be in any business that has that lower margin. I think when you make incredibly valuable products like Bowers & Wilkins, Marantz and these brands do. I think they should be getting a premium that will improve the margins. Now they have been raising their prices to adjust for the increased costs that they've been seeing both in COGS and shipments, but our plan is to work with them to improve their margin greatly.\n\nBut you said it, Rick, we did not buy Sound United only because they make great audio products. We bought them because of what we thought we could do with them with Freedom and other consumer healthcare products. That will model a lot after our healthcare business, which will be technology as a service. So they will -- we anticipate not only good margins on the capital in that world, but we anticipate recurring revenues from a service model that we think will be useful for our customers.\n\nRick Wise -- Stifel Financial Corp. -- Analyst\n\nThat's very helpful. Thank you. If I could just follow up on that just briefly. Joe, when the deal was announced, I had the sense that you and the team were going to -- I don't know whether that was an Analyst Day or at some point, we get a deeper sense perspective on your long-term thinking.\n\nWe're getting some bits and pieces tonight for sure. When do you think we might hear from you about your longer-term vision? Yes, I'm sure that's part of the Freedom and the W1 launch. But when do you -- when should we expect to hear from you in that more fulsome manner? Thank you.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nSure. Rick, we would love nothing more than to get you inside our head because I think you'll find it hopefully, interesting but exciting. But we have to be cautious not to let our competitors get inside our head as well. So long story short, I think you're going to get a good, healthy dose of what we're thinking this December at Investor Day.\n\nHave we -- do we have a date yet?\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nDecember 13.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nDecember 13. We're going to drag you out of anywhere it's raining or snowing and bring you to California. Hopefully, you'll come. And then I think when we launch Freedom, obviously, we'll share more.\n\nAnd then there's a couple of really what I think will be breakthrough products. And when they're out, I think then you'll see what we had in mind. But the full story might take a couple of years before it comes out. But we'll try to share with you as much as we can December 13.\n\nRick Wise -- Stifel Financial Corp. -- Analyst\n\nThank you, Joe.\n\nOperator\n\nThe next question is from Marie Thibault with BTIG. Your line is open.\n\nMarie Thibault -- BTIG -- Analyst\n\nHi, good afternoon. Thanks for taking the questions, Joe and Micah. I wanted to follow up here on some comments, Joe, that you just made about the consumer side of the business, and those premium-priced products. We certainly heard from some other consumer tech companies this quarter that with consumer confidence at a low, there is concern about the discretionary spending.\n\nWould love to get your thoughts, maybe what you're hearing from your brand presidents in terms of customer appetite for these great Sound United products?\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nYeah. Well, we, first of all, believe most of the Sound United products are geared toward very affluent, wealthy people, which are for better or worse usually more shielded from some of the weakness in economies when they occur. In addition, we've met with them, had a really productive meeting where we looked at the what-if things to slow down a lot more. Because certainly, you're seeing it in the low-end products in the consumer product lines, that are out there from TVs to soundbars and things like that.\n\nAnd still, the forecast that we've given you is in line with the worst case of what they could project. So I -- while I don't have historical data, like I do for the healthcare business, I've been running here for over 30 years, to give me the confidence on everything that has to do with Sound United. I feel that theoretically, they are in the high-end world. So that part makes sense to me.\n\nAnd my belief in the team and the way they thought about it, it seemed like good critical thinking and a lot of conservative modeling. So yeah, we think we should be OK.\n\nMarie Thibault -- BTIG -- Analyst\n\nOK. That's very helpful. Thanks for that. And then on the Investor Day, I realize it's been pushed out a couple of months from what we'd hoped in September.\n\nWhat was sort of the thinking behind that? What is it that, I guess, led to some of that delay? And would we expect to hear more on the hearing aid product as well in December? Just any updates on that product category.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nYeah. We pushed it out one, you can imagine the effort that it's taken for Micah and his team to consolidate the financials for the company that was not public, and wasn't really being run to go public. So I think we don't want to break the horse that was giving us the ride. But then secondly, we know you guys want more, and we feel like by December, hopefully, we'll be able to share more.\n\nAnd yes, we definitely will share with you information about the hearables.\n\nMarie Thibault -- BTIG -- Analyst\n\nOK. Perfect. Looking forward to it. Thanks for taking the questions.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nThanks, Marie.\n\nOperator\n\n[Operator instructions] The next question is from Michael Polark with Wolfe Research. Your line is open.\n\nMike Polark -- Wolfe Research -- Analyst\n\nGood afternoon. Thank you for taking the questions. Maybe I'll start on just capital deployment cash flow question. I mean the balance sheet has been materially altered in just six months here post Sound United, and now a hefty buyback.\n\nI'm doing math, $750 million net cash entering the year, now just about $700 million of net debt. I guess curious for updated thoughts on your comfort level here with this kind of different profile. Number one, any kind of target leverage metrics you might want to toss out about where this is comfortable on the high end or where you want it to go over the midterm? And then just related as kind of a lot of moving pieces with Sound United coming in and curious where you think kind of durable free cash flow is for the enterprise over the next year or two?\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nYeah. Mike, this is Micah. So if you look at -- I'll just I'll go through those questions and I'll step through those. So in terms of our leverage, I've always been comfortable with three times or less, in that zone.\n\nOur net leverage is under one and a half times. We generate strong cash flow as a company. So it's under one and a half times. We're getting a very good interest rate on the debt.\n\nWe're in a good position there to service that debt with our cash flow and then even invest back even more in the business. And so that's number one. As we look at capital deployment, the reason -- we have a lot of confidence in the long-term growth of this business, and that's why we're reinvesting in our shares for Masimo. So that's something that we looked at it, and we think that reinvesting back into the company and our shares was a great capital deployment for us.\n\nAnd in terms of cash flow, the softness we're seeing in cash flow is, number one, we've had some acquisition-related costs that are transaction-related. So we had to pay those in the first half that suppressed our free cash flow. But if you pull that out, we still are seeing good strong cash flow that we expect for this year. The other thing is we're investing in inventory.\n\nIf you saw what happened in Q1, it's something we don't want to repeat, so we're trying to make sure we got sufficient safety stock levels. And I think that's very prudent for the company to do and make sure that we're putting our customers first, as I mentioned before. So hopefully, that answered some of those questions, and I'm open for any follow-ups you have on that.\n\nMike Polark -- Wolfe Research -- Analyst\n\nMy follow-up topic was just a timeline and upcoming milestones for the legal proceedings with Apple. Any major events you expect over the next three to six months before year-end that we should be monitoring?\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nYes. We had our ITC case against Apple, and we anticipate a ruling by our judge by September 15. And then by January, the commission will make their decision and assuming they both go forward with joining the infringing Apple Watch, we should have something in place by March, April next year, subject to presidential review. And then our patent case -- excuse me, our patent case has been stayed in the federal court but our trade secret case will happen in March, and there will be a jury case with Judge Selna.\n\nAnd so we expect some time in April, we'll have a decision there. I was in the ITC case for about half of it. For about half of it, I was asked to leave because of Apple confidential documents that were going to be disclosed. The portion I was in, I felt very good about our case.\n\nAnd from what I understand, the documents that I couldn't see were not favorable to Apple. So you never know what's going to happen, but we feel good about it. And hopefully we'll have some news September 15.\n\nMike Polark -- Wolfe Research -- Analyst\n\nAppreciate that. If I could sneak one more topic in. Is there an update on Opioid SafetyNet? I feel like we were talking about it every quarter. There is a pathway in Europe commercially.\n\nThere was a regulatory pathway here in the U.S., and I haven't heard an update there for at least a couple of quarters. So if there's any additional color on where that effort stands that you can provide? I'd appreciate it. Thanks for taking the questions.\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nAbsolutely. Yeah. We're pushing part around the world with SafetyNet alert, mainly made for opioid. It's been going well.\n\nIn the U.S., we're waiting. We're waiting for FDA clearance. I believe we've given FDA everything it's requested. So we're -- again, if you remember, this is a product that the FDA chose as one of eight products out of over 250 companies that could help the opioid epidemic, and gave it a breakthrough status as well.\n\nSo I know the FDA is also eager to release the product, hopefully soon. We didn't report on it because I think we're getting tired of waiting too. But we're looking forward to the launch. And if anything, over the last two, three years, the problem has gotten worse.\n\nLast 12 months, 100,000 people in the U.S. who were killed due to overdose. 20% of those, we believe, were due to prescription opioids. So we believe we have the right solution.\n\nWe believe it will save -- if it's deployed it can save tens of thousands of lives a year. So we'll let you know as soon as we get our clearance. I think that's our last question. So thank you all for joining us.\n\nI hope you all enjoy the rest of your summer, and we look forward to the next quarterly call and seeing you all on December 13. Bye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEli Kammerman -- Vice President of Business Development and Investor Relations\n\nJoe Kiani -- Chairman and Chief Executive Officer\n\nMicah Young -- Executive Vice President and Chief Financial Officer\n\nMike Matson -- Needham and Company -- Analyst\n\nJason Bednar -- Piper Sandler -- Analyst\n\nJayson Bedford -- Raymond James -- Analyst\n\nRick Wise -- Stifel Financial Corp. -- Analyst\n\nMarie Thibault -- BTIG -- Analyst\n\nMike Polark -- Wolfe Research -- Analyst\n\nMore MASI analysis\n\nAll earnings call transcripts"
}