{
  "companyName": "MannKind Corporation",
  "companyTicker": "MNKD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/mannkind-corporation-mnkd-q2-2022-earnings-call-tr/",
  "content": "MannKind Corporation (MNKD -1.86%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the MannKind Corporation's second quarter 2022 earnings call. As a reminder, this call is being recorded on August 9, 2022, and will be available for playback on the MannKind Corporation website shortly after the conclusion of this call until August 23, 2022. This call will contain forward-looking statements. Such forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ materially from the stated expectations.\n\nFor further information on the company's risk factors, please see the 10-Q report filed with Securities and Exchange Commission this afternoon, the earnings release and the slides prepared for this presentation. Joining us today from MannKind are Chief Executive Officer Michael Castagna and Chief Financial Officer Steven Binder. I would now like to turn the conference over to Mr. Castagna.\n\nPlease go ahead, sir.\n\nMichael Castagna -- Chief Executive Officer\n\nGood afternoon, everyone, and thank you for listening in. Today, I'll give a quick update on our performance for the quarter. Steve will go through the financials, and then I'll close on the pipeline and company updates. As you can see, this is the quarter we've all been waiting for.\n\nWe're super excited about MannKind and the growth story that's becoming. Overall, we had 58% quarter-over-quarter growth, and we have several new sources of revenue. As you all know, we closed V-Go in May. We booked sales starting in June.\n\nThat product is off to a great start, and I'll give a bit more details on that. We also were able to book a portion of the DPI Commercial Manufacturing revenue, which Steve will go into more of $4.7 million and Royalties, which will not be broken out as a percentage, but more as a dollar value as we go forward of roughly $300,000. And then you can see Collaboration and Services and Other, about $1.2 million. You may recall, previous years and quarters, a lot of that was the amortization of the payments that we received from UT over the time period of that contract.\n\nSo I think it's good to look quarter to quarter now as we look at the way the revenue is looking given that contract ended last October. Total revenues for the quarter were up 58% in Q1, and we think that as you continue to look out, we'll see more royalties, more manufacturing, more Afrezza, more V-Go. And so we really feel this is the foundation of the growth story that we've been working toward the past several years. So a couple of highlights here on the orphan lung side.\n\nAs you all know by now, the FDA approved our Tyvaso DPI for PAH and ILD. And then we began manufacturing and commercial product sales with UT in June with royalties recognized. You will notice that Steve talked that some of that inventory that was built in June is hung up on the balance sheet and will carry over the deferred next quarter. On the pipeline, clofazimine completed the SAD and MAD trials, single-ascending dose and multiple-ascending dose.\n\nWe'll have those top line results here shortly, and we'll publish those publicly at the appropriate time. The other two pipeline assets are starting to move forward is nintedanib MNKD-201, as well as MNKD-501 TGF-beta outside and that development is progressing, and I'll give a few updates on these at the end of the call today. On the endocrine side, we saw a 7% growth in Afrezza from 2021. We saw TRx grow 12% from Q1 to Q2.\n\nUnfortunately, we did do a Primary Care Product for the last six to nine months, and that did not produce the results we expected relative to the expense. And so we terminated that at the end of June. And so that expense will not be going forward much further than July. So that's some of what we'll see as we go forward in terms of expense production on the PCP pilot.\n\nOn the INHALE-1 pediatric trial, that's going as expected. We added a few new sites in the last quarter, as well as about 80 patients now and on track to hit our goals between now and the end of the year. And we also have the Afrezza Basal Combination study, ABC. And that's the one looking at maintaining a pump, adding Afrezza to a pump or switching off a pump to Tresiba Afrezza.\n\nAnd that's on track to give us results in early Q4. It's a small study, but I think will be very important results to give us opportunities for 2023 and beyond. And on V-Go, we'll get a little more detail there, but we had booked net revenue of $2.1 million just for the month. Zealand will book revenue for April and May.\n\nFrom a liquidity perspective, as we look out over the future, you can see four sources of revenue. Additionally, Mann Group converted $10 million in debt in Q2. So now we have $10 million less in debt that we'll capitalize as we go forward. That does include some accrued interest that will be taken off the principal.\n\nTyvaso DPI, you can see here the final packaging, the FedEx truck leave our Danbury facility. We are a 24/7 manufacturing. We continue to look for ways to drive more efficiency to the manufacturing process to get more cartridges per hour as we can. And we are -- also broke ground on the expansion.\n\nAs you all may or may not know, UT is pursuing two studies called the TETON and the PERFECT study, which are much larger patient population than the PAH and ILD. And so we have built the original plants a couple of years ago. That was to handle the first two indications of [Inaudible] always knew we had to expand as UT starts to ramp up those trials over the next year or two. Again, those results, we need to get far ahead of that in terms of order and equipment building out the facility in order to be ready for that approval when and if it should occur.\n\nSo that program here last quarter in Danbury. One of the big shifts we made for MannKind and Afrezza in the first quarter, specifically February, was really to look at market share in particular, new prescription market share relative to the ultra-acting class. And the reason is that class consists of Lyumjev, Fiasp and Afrezza has been growing. And more and more doctors continue to adopt ultra-acting insulins.\n\nWhile I don't necessarily believe Lyumjev and Fiasp will qualify, the reason doctors are writing those because they believe they're faster, and I think their clinical data would say otherwise. The fact is Afrezza is competing indirectly or directly against those two launches, we felt it was good to start measuring our market share and incentivizing our corporate executive management team, all of our employees, as well as the frontline sales reps. And you could see that that had a direct impact in our market share growth over the last four, five months here as we close out the quarter. So we did hit a level of 12, and we continue to grow through March all the way to June.\n\nAnd additionally, on the right side here, you can also see these are prescriptions that don't show up in Symphony, but we have a free goods program, a cash pay program and Afrezza Assist with your referrals coming in will ultimately become the funnel for new patients. And you can see on an average quarterly basis, a weekly basis that those have gone up from 122 to 223 over the last couple of quarters here. So that's also exciting. That kind of gives us the polls to come as we go forward.\n\nWhen you look at new prescriptions, we delivered 14% sequential NRx growth, which will lead you to the 12% TRx growth. So we need our NRx to grow faster than TRx in order to feel good about the next quarter as we look out. We also amplified our clinical message with healthcare providers. We were -- had a major presence at ADA, AACE and ENDO.\n\nIt was pretty impressive when I attended ADA. Typically, you'd walk in, and AstraZeneca and Novo Nordisk, [Inaudible] have the biggest booths. You couldn't get in without walking through them. And this year, MannKind was right up front and among the bigger booths.\n\nAnd the large people that generally have been committed to diabetes are some of the smaller or no goods. And it was really a technology conference, and that's what ADA is focused on. So I think the team really tried to showcase MannKind here because this is the first conference that people will go back to live back in June with ADA. So we'll continue to see -- focus on the remaining impact from the conferences and the investments that the marketing team made there.\n\nI want to talk a little bit about V-Go because we haven't had the chance since we closed that deal to have a deep dive on it. We really want to strengthen our commitment to mealtime solutions when it comes to running our endocrine business. We have about 60 sales reps. And when they go in, if the doctor doesn't want to write Afrezza of which we see a large majority of our customers after six years still not running an Afrezza prescription, it's not efficient.\n\nAnd so V-Go is a device we watched many years, and they were doing at one time almost 2,500 prescriptions a week. And that was a lot more prescriptions than Afrezza at that time. And we look at it now, it's been on a decline. But they had a lot of utilization and a lot of prescribers that love the product.\n\nAnd those aren't necessarily prescribers who prescribe Afrezza or tried Afrezza. And we thought being able to build more efficiency and sales force being able to make MannKind more committed to mealtime solutions is really something that can differentiate us as a company. There really is no diabetes company today focused on mealtime solutions. They're all focused on cranial control or devices and then trying to get insulin on the go.\n\nWe felt this was a very nice synergy with our portfolio. And when you look at the purchase price below, $15 million. That includes all the IP, $11 million of inventory and $3 million of equipment. So if you add up those two lines, we basically got V-Go for a net $1 million.\n\nSo this was a good investment of shareholder money. We will return when we will get our return on that investment and hopefully grow and provide more solutions to the diabetes space than we ever had. We expect first year revenue to be $18 million to $22 million and accretive in 2023. And that's a 12-month year, not necessarily the rest of this year.\n\nCommercial infrastructure, we've hired an additional 15 sales force, as well as a leader to lead the V-Go business and a medical person in addition to the manufacturing people. So this did increase our headcount, but all that is in our expectations. And overall, we have the former Zealand employees who joined us up in Boston and we're outside of Boston and Marlborough, who are continuing to run the supply chain manufacturing network. So we're very excited about V-Go.\n\nI think you can see in the first quarter, it looks very good. When you look at the next slide here, the big thing was about stabilization. This has been on a 15-month decline mainly because they stopped promoting it back in March of '21. And prior to that, it was through a bankruptcy.\n\nAnd so it's just had a tough history. And so we were very happy to be able to get people on board and start to stabilize that decline in Q2. And hopefully, as we look at Q3, we start to turn that negative to a positive growth. And I would say the leading indicator of NRx and the NRx ratio over TRx is indicating that we are starting to make an impact.\n\nAnd we know the prescribers are excited to have V-Go and MannKind and really can't wait to give it in the hand of the rest of our sales force. Right now, we're only promoting it to those 15 reps. And those are the top reps in the top centers that probably cover 50% of the units. And to my earlier comment on prescriptions and coverage, you can see now in a given month, we have almost 9,000 patients filling a prescription for a MannKind product.\n\nAnd that gives us about 2% market share of all rapid-acting scripts. And so that's not just ultra acting. That's all rapid acting, including Novolog, Humalog. And that gives us a reason to [Inaudible].\n\nAnd we expect to continue to grow that share over the coming years and also reach nurse practitioners and PAs who are heavier users of V-Go and also heavy prescribers of insulin. So we feel like this is a really good opportunity to increase our share of voice, increase our commitment to diabetes and the endocrine business and give our sales force another tool to help provide solutions to patients who aren't in control for the most time. I'm going to stop there and turn it over to Steve. Thank you for listening.\n\nSteve Binder -- Chief Financial Officer\n\nThanks, Mike, and good afternoon. I'm pleased to review select second quarter and June year-to-date financial results. Please supplement this call by reading the condensed consolidated financial statements and MD&A contained in our 10-Q, which was filed with the SEC this afternoon. As Mike pointed out, this is the first quarter for three new sources of revenue for MannKind.\n\nWith the approval of Tyvaso DPI in May and the subsequent launch by United Therapeutics, we have begun to recognize manufacturing revenue and royalties in our second quarter P&L. In addition, with the purchase of V-Go effective May 31, we have recorded net revenue for the month of June. This slide shows revenue for the second quarter in the left table and June year-to-date revenues in the right table. Looking at revenues for the second quarter of 2022, Afrezza net revenue was $10.6 million versus $10 million in 2021, a growth rate of 7%.\n\nThe increase was mainly driven by price, including a more favorable gross-to-net percentage. Growth in underlying paid TRx demand of plus 8% was substantially offset by a decrease in channel inventory. Year-to-date Afrezza growth came in at plus 13%, which was mainly due to favorable price, including a more favorable growth to net percentage, higher underlying patient demand and favorable cartridge mix. Next is our net revenue for V-Go, the newly acquired wearable insulin delivery device where we had $2.1 million in net revenue for the month of June.\n\nWe expect V-Go net revenue for the 12 months post acquisition to be in the range of $18 million to $22 million. Moving to collaboration and services. Revenue for the second quarter was $5.9 million versus $13.3 million for 2021. The second quarter includes the sale of Tyvaso DPI commercial product to UT.\n\nThe decrease in revenue from the second quarter of 2021 was mainly due to the recognition in the prior year of amortization of United Therapeutics milestone payments. I will dive more deeply into the UT manufacturing revenue and deferred revenue on our next slide. The June year-to-date revenue of $8 million is mainly lower because of the prior year at UT milestone amortization as well. Also new for MannKind, we recognized $300,000 of royalties associated with the sale of Tyvaso DPI by United Therapeutics in the second quarter based on a low double-digit royalty.\n\nWe have previously communicated that we will provide the exact royalty rate upon approval of Tyvaso DPI, but we have agreed with United Therapeutics to keep the royalty rate confidential for competitive reasons. The next slide breaks down the collaboration services revenue that was discussed on the prior slide, but we also added the associated deferred revenue, which sits on the balance sheet. The UT associated revenue includes manufacturing services and additionally, next-gen R&D services, which are mostly pass-through costs. For the second quarter, we recorded collaboration services revenue associated with UT of $5.4 million, including manufacturing services revenue of $4.7 million.\n\nAnd we deferred $4.1 million of revenue to the balance sheet in the second quarter, of which approximately half is associated with inventory that sits on our balance sheet and is expected to be sold to UT in the third quarter when we will recognize the associated deferred revenue to income. Beginning in the second quarter, we have started to recognize prior period deferred revenue for manufacturing services and expect to do so throughout the life of the manufacturing contract with UT, which runs 2031. There was a total of $29.8 million of deferred revenue associated with UT on our balance sheet as of June 30, 2022. Now let's look at the profitability of Afrezza and V-Go.\n\nAfrezza gross margin increased from 56% in the second quarter of 2021 to 68% in the second quarter of 2022. And the gross profit associated with Afrezza increased 31% to $7.3 million. The increase in the second quarter gross margin versus 2021 was due to an increase in Afrezza sales coupled with a decrease in cost of goods sold mainly due to a $2 million fee incurred for the amendment of our supply -- insulin supply agreement in the second quarter of 2021. When looking at the profitability for the first half of 2022, Afrezza had a gross margin of 72% and gross profit of $14.8 million driven by higher sales and lower cost of goods sold.\n\nThere will always be some variability in Afrezza gross margin between quarters due to the timing of manufacturing spend and activity as we are not at maximum production capacity for the product. The far right table shows V-Go gross margin of 40%, which is about where we expected the margin for this medical device to be based on a review of the seller's financial information. Prospectively, we will focus on improving the margin for this product. Let me conclude with some final comments about liquidity and performance.\n\nWe continue to transform the balance sheet. In the second quarter, there was a reduction of $10 million of debt that was converted to equity by the Mann Group, resulting in reduced debt and interest expense. We spent $15 million to purchase V-Go, including inventory and equipment valued at approximately $14 million, which infers that we get a bargain purchase price. With rising interest rates, we are well-positioned with very little interest rate risk due to the low fixed rate for most of our debt.\n\nFor our one floating rate loan with MidCap, we anticipate rising interest rates and negotiated an interest rate cap with a maximum exposure of less than 1% above the current rate. Also associated with the MidCap loan, we did not exercise our right to borrow up to $60 million under Tranche 3, which was accessible to us once Tyvaso DPI was approved by the FDA and was available until June 30. Operationally, we are showing continued progress in generating sales growth and gross profit for Afrezza, which should turn Afrezza into moneymaking brand. We have added V-Go to the endocrine business unit, which will expand our footprint with insulin-prescribing physicians, as well as help synergize our cost base and infrastructure.\n\nOur collaboration with UT is strong and has a ton of potential. We are producing Tyvaso DPI in a 24/7 basis and are seeing increased efficiency in our manufacturing output while recognizing manufacturing revenue and royalties for the first time during the second quarter. We are excited about our future as we now have four growing sources of revenue in addition to an early stage but established product pipeline. Thank you, and I'll turn it back over to Mike for additional comments.\n\nMichael Castagna -- Chief Executive Officer\n\nThank you, Steve, and more importantly, thank you for keeping track of all the complexities we've established over the last few years here. So I'm super excited about the pipeline. This is something that -- these are decisions that we've made years ago. And every year, they take a little bit of time when they get closer and closer to fruition.\n\nAnd so just like Tyvaso, we made that decision in 2017. We did the partnership with UT in 2018 and expected an approval almost three years later. It's a little longer but still got approved. And now that's going to be a major growth driver for MannKind as we go forward as value creator.\n\nAnd I'm not going to go through the top half of Afrezza. And I'll talk about some of the Afrezza stuff in a second. But I want to focus really on the bottom end, which is really around MNKD-101, that wrapped up and that's going to quickly go into phase 2/3. And to meet with the FDA.\n\nAnd then nintedanib is early, but that will move very quickly, too, once we get to the FDA. You start to see an emerging pipeline that can drive value for years to come. And this is not something that we currently see a lot of value on when we talk to investors because the first milestone for a lot of people who've invested in our stock over the last two years has been getting Tyvaso DPI across the finish line. So as we continue to grow Afrezza, we continue to grow V-Go, we continue to see Tyvaso contribute to MannKind, I think you're going to see a lot more activity around the pipeline and readouts around the pipeline on safety and some of the animal models we're doing.\n\nAnd that's going be a very exciting emerging story from this point forward. And then finally, we've got these two other programs that commenced, Cannabidiol and the small molecule from Fosun. The Cannabidiol dosed the first patient, I think, last quarter. And so that's another exciting one that's now progressing there at Receptor Life Sciences, which after many years, took a long time to get there.\n\nBut now they're finally on track to move forward in the FDA -- with the FDA support. On the pipeline side, I've already talked about the pediatric and Afrezza Basal. Those are both in line. We will have that Basal Combo study results here probably early Q4 is my guess.\n\nAnd then on the pipeline, clofazimine completed this. We expect that data readout. And then nintedanib, we have completed the animal PK/PD. I don't know if we'll put a release out on that, but obviously, we feel good about what we saw.\n\nAnd this program will continue to progress here in Q3 and beyond. And the last one, which is a sleeper program. TGF-beta is a known pathway that works. This class of drugs has had multiple toxicities over 20 years, but we believe this molecule is unique and that it has a short half-life.\n\nAnd we're able to dose it through our health platform at roughly one-tenth a dose that was previously dosed with when it was at Pfizer. And so that animal PK we got in Q2, we're doing dynamic work here in Q3, and we'll continue to progress the TGF-beta program. And the pathway is going to be really important at some point in the near future. So overall, this is probably emerging pipeline because most companies our size did not have the breadth of revenue coming in, as well as the robust pipeline that we are continuing to develop and hire for around our teams.\n\nWhen you look at the milestones we laid out back in Q1, we continue to hit all those milestones that we've put out at the beginning of the year. Some were anticipating the V-Go acquisition. And in Q2, we also completed enrollment in ABC studies so that seems to be completed in Q4. Here in Q3, we'll have the phase 1 readout next month and the animal PK/PD completed.\n\nSo Q3 is relatively on track. And by the end of the year, we have a lot of FDA activity happening and Afrezza is going really, really hard to hit all those milestones, but there's a lot coming all at once. So overall, the company is in great shape. You can see as we go forward, I think the real question at the end of the day is are we on the path to profitability.\n\nAnd by the fact, as Steve stated, we did not take the $60 million tranche loan because we don't see a need for additional capital. We can manage our expense base. We can see Tyvaso growing. We can see how the pipeline is going to come in and when those expenses build.\n\nAnd we also see where expenses are coming down such as the PCP pilot or the pediatric study finishing up in the near future. So overall, we feel very good about where the company is from a cash maintenance perspective. And when you look over these milestones on the left side, what's investing with income generating. And then you look at the next five years from '25 to '30, you could see a company that really does have multiple revenue streams growing at significant rates for the next eight years.\n\nThat doesn't mean we die in 2030, but there's other things moving right now to keep us going beyond 2030. But at this point, you can see a nice, bright future, multiple levers, pipeline coming together in a very, very exciting future. We're pretty much near 400 employees now and growing. And so that just creates a whole new company, a whole new culture and then also a new shareholder base.\n\nSo we continue to see new shareholders come in. Our institutional investors continue to increase. We continue to take new tours of Danbury and introduce people to the company. So overall, the company is in great shape, and I just want to say thank you to everyone's support.\n\nWe're super excited in filing Tyvaso, cross the finish line. And that really enables the rest of the company to continue to function in an optimal way. So thank you to UT who has been an incredible partner throughout this journey and a huge supporter of MannKind and all of our shareholders have been with us for some time. So let's stop there and open up to questions.\n\nOperator\n\nThank you so much. [Operator instructions] And our first question comes from the line of Gregory Renza from RBC Capital Markets. Please go ahead.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\n[Inaudible] on for Greg. Congrats on the quarter, and thanks for taking our question. Maybe just a couple on Tyvaso DPI. Could you provide some clarity regarding the agreement with UT regarding the manufacturing margin? Understanding you have to keep the royalty rate confidential, but just wondering about the manufacturing margin there.\n\nAnd then secondly, just wondering how has the macro environment regarding inflation, labor and supply shortages may have impacted your manufacturing capabilities? Thank you.\n\nMichael Castagna -- Chief Executive Officer\n\nI think the first one on UT manufacturing margins, we're not going to provide that clarity yet. I think let's get full manufacturing for a full quarter or two. And we'll continue to discuss internally whether or not we provide that particular markup on those manufacturing revenues that are coming in. It was too early in Q2 as well in the full quarter, and it was a partial quarter of production.\n\nSo we don't want to create any confusion. That's why you have too much there. The second question, Steve, I think -- I didn't capture, but I think it's around inflationary impact.\n\nSteve Binder -- Chief Financial Officer\n\nSure. Yeah. So let me touch on that. So this year, we are seeing a mix of some rising costs, in particular, around energy.\n\nWe're also seeing some savings as we increase our volumes of purchases of certain supplies that go into making our products that drive the cost per unit down. So this year, we don't see a significant increase in costs. I think next year, you probably will see a little bit of an increase. But so far, nothing significant or material to our balance sheet or our P&L at this point in time.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nThank you very much.\n\nMichael Castagna -- Chief Executive Officer\n\nAnd closing on that, I think the only area we continue to see is the people side, we've been very fortunate to not have a lot of turnover at company, a lot of excitement among our employees. They're all shareholders, so they're all committed to our journey and what we're doing. And so I think that's the area that we see a lot of inflation across society, but we've kind of tried to manage that through efficiencies and delay hiring and things like that to make sure we're not incurring additional expenses anticipated this year.\n\nOperator\n\nAll right. Thank you so much. And your next question comes from the line of Brandon Folkes from Cantor Fitzgerald. Please go ahead.\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nHi. Thanks for taking my question, and congratulations on all the progress. Maybe two just for me. Maybe just, Steve, just any commentary on channel -- sorry, inventory in the channel for Afrezza? Where does that sit now relatively? Is it at a normalized level at the end of the second quarter? And then secondly, how should we think about product priority going forward just in terms of Afrezza versus V-Go and kind of maybe where you can move revenue quite quickly? Just any commentary in terms of those two products in the reps' bags going forward? Thank you.\n\nSteve Binder -- Chief Financial Officer\n\nSure. Let me take the first one, Mike. I'll take the channel, and then I'll drop it off to you for the revenue. So yes, the channel inventory moves around as much as $0.5 million quarter to quarter.\n\nIt's not up to us. The wholesalers are the ones who are managing their own inventory levels. So we see it. It happens in some quarters, not every quarter.\n\nIs it normalized now? It's in the right ballpark. I don't see material changes happening. Yes, we had an offset this quarter that, say, offset our growth in patient TRx increase. It was unfortunate, but we did have an 8% growth in the prior year in paid TRx.\n\nBut I don't think, again, it's going to be material quarter to quarter, but it will fluctuate.\n\nMichael Castagna -- Chief Executive Officer\n\nAnother thing I'll add, Steve, is we did see a 13% decrease in days on hand, so they did drop a few days of inventory. So that impacted Q2 a little bit. But if you normalize for inventory, there'll be slightly higher sales on the present. I think your second question, Brandon, was how do we think about V-Go versus Afrezza as we think about the future.\n\nIs that what I heard?\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nCorrect, yes.\n\nMichael Castagna -- Chief Executive Officer\n\nYeah. So there's a very big difference in margin to the company, as well as how many scripts it takes to breakeven on one versus the other product. And we knew that when we purchased it. But I think when you combine, it's really about trying to get doctors to try something different because we know 80% of people on mealtime insulin are not a goal.\n\nAnd yet they're just not progressing these patients to better solutions. And so that's really our focus is how do we start to at least let the reps close those doctors. If they're not going to write Afrezza, they can write V-Go. If they're not going to write V-Go,they can write Afrezza.\n\nBut we really need to do something different, number one. And more importantly, offer patient choice. I think after six years of us promoting this, we're just finishing up research right now. And what we're hearing is, the doctors -- the patients are asking for Afrezza.\n\nThe doctors aren't offering it. And I think we've got to really shift that mindset going into next year about patient choice and giving the patients some right around that. And I think that will be really important as we go forward when it comes to Afrezza and V-Go for that matter of that. And let the patient pick, especially type 2s, there are so many of them, what do they want best to manage their lifestyle and their mealtime control.\n\nAnd so we will continue to watch. We don't expect to cannibalize one product or the other. And that's why we remind you guys to see, we don't have 98% of patients on a MannKind product. And that's really the focus of how do we bring more of those patients into our portfolio and our family.\n\nAnd so with V-Go now, for example, we can add a nurse trainer in certain markets because there's no volume to support. A nurse trainer keeps them busy enough. That's not always been the case when you add just Afrezza. So I think as we go into the end of this year going into '23, we're just starting to talk about how do we best maximize that impact, how do we best support the sales force so they can maximize their effect.\n\nAnd I think we'll see always a dedicated V-Go sales force because these are the top accounts, top reps, top experienced at V-Go. And I think the question is on the Afrezza side, when and how do we integrate, what does that look like? And do we have overlapping accounts or separate accounts? All that work is just starting. So I wouldn't give you much guidance until we probably get to the next quarter. I think we'll have it [Inaudible].\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nGreat. Thanks very much, and congratulations again.\n\nMichael Castagna -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you so much. Your next question comes from the line of Thomas Smith from SVB Securities. Please go ahead and ask your question.\n\nThomas Smith -- SVB Securities -- Analyst\n\nHey, guys. Good afternoon. Thanks for taking the questions, and congrats on the progress. Just on Tyvaso DPI, can you comment on kind of the early days supply chain as you guys manufacture the drug product? Any challenges you see on the supply chain side of things here as UT gets out there and launches DPI into the market?\n\nMichael Castagna -- Chief Executive Officer\n\nNot right now. Fortunately, we have some time to build up some inventory while they were launching, right? So they -- I don't know how much you know about the pulmonary market, but basically it takes two to four weeks usually to start a patient between getting them started, getting insurance done, getting the forms in, getting the patient trained properly. They have a -- these are lifelong treatments usually. So that process is on UT side.\n\nAnd so they can see every week referrals coming in. And I think they said on the earnings call, the initial launch was really about -- it was really about conversion. So those people on 48, 64 micrograms converting over one-to-one. And then the next part was the titration pack, which launched in July.\n\nAnd that's going after the naive patient population. So how do you start to see naive bucket come in next? And then later in the fall will be the next packaging. So UT has a multi view of the world how they're launching this and what they're doing. So we don't expect any supply constraints as everything is past validation.\n\nEverything is on track, and we don't see issues there. We got no inventory build that we shouldn't be any stock out or how fast it goes, we should be a good spot. And then the second part, which you may not realize is we're actually the distributors. So we also ship it to the pharmacies every week when those orders come in.\n\nAnd that process is going smoothly as well. That's another area we worry about hiccups as it's the first time we were doing something like that. But everything is built. We've got a big, large storage refrigerator and trucks come every week, and we're very excited about it.\n\nThomas Smith -- SVB Securities -- Analyst\n\nOK. Great. And just a couple on V-Go. Appreciate all the color on the acquisition and the strategy.\n\nCan you just help us understand how you're thinking about longer-term revenue potential here? And then can you also help us understand how you're thinking about the cost structure a little bit? Are you planning to make additional investments here on [Inaudible]. And I guess help us think a little bit about the longer-term gross and operating margin profile and how that compares versus Afrezza.\n\nMichael Castagna -- Chief Executive Officer\n\nYeah. I'll say on the V-Go device, they've lost half their volume roughly over the last two years, and that's obviously hurt the margin of that product. And so I think that's one of the things we'll be looking at is as volumes start increasing, how do those markets have proven to what extent? And is there anything we can do to improve them even further? At this point, we don't have plans to add any additional cost. There's enough production there to handle a lot more volume.\n\nNow if we decide to move production or make it more efficient or automated, that's a different story. But we just got the product less than 60 days ago roughly. And so I think there's still a lot to learn, but the team there is doing a great job in managing the supply chain at V-Go. Think about them making almost 3 million V-Gos a year.\n\nSo maybe more than that by now. So there's a lot of device production that happens with V-Go into the marketplace, and it's a pretty complex supply chain. So I think it's how we'll manage. We'll continue to look at it.\n\nWe want to be comfortable that it was at least stable in the short-term, and then we'll look at ways that maybe volume drives it, the automation drives it. We have a good team at MannKind, as well as former Zealand team that really understands device manufacturing, device scale up. So I think that's something we'll look at in the second half of this year. On the long-term expense base overall revenue, I do think V-Go will show some growth in the near-term.\n\nI think there's a lot of pent-up demand. There's a lot of people thought that that was going away. So I think you'll see that come back a little bit faster than one would expect. We'll see in the coming months how the -- noise on the street at least is very positive.\n\nOn the expense base, we expect to pretty much manage our expense base tightly. We're not looking to increase our cash burn as it comes to Afrezza and V-Go combined. We're looking to build efficiencies as we go. We see ways to grow faster.\n\nWe are welcoming those opportunities from the marketing sales team to do that. But as you know, we've tried so many different things over the years. We really want to see productivity out of the existing investments we're making before we add more. And so that's how we're thinking about it.\n\nIf we see something that's growing or an area that's growing, and we replicate that nationally with you in a heartbeat. But at this point, we're buying the brands to cash flow breakeven and ultimately cash flow positivity as we look at '23 and beyond.\n\nThomas Smith -- SVB Securities -- Analyst\n\nOK. Got it. That makes sense. Great.\n\nThanks, guys.\n\nOperator\n\nThank you so much. And our last question comes from the line of Steve Lichtman from Oppenheimer & Co. Please go ahead and ask your question.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nHey, guys. Congrats on the quarter. This is Amir on for Steve. And I just had a question around the pump switch trial.\n\nAnd just to be clear, were you guys expecting to get the data in the second half of this year? And then can you remind -- and as a follow-up to that, can you just remind us what your goals are once you have the data on hand? Thank you.\n\nMichael Castagna -- Chief Executive Officer\n\nYeah. Yeah. We always expect -- it's a 12-week trial. It's only 28 patients that are randomized.\n\nSo we actually went a couple above just to make sure we hit our end points of 25 patients. And so that randomized -- I think the surprise for us was how quickly that enrolled. Usually, these things take a little longer. But it's a small trial, very manageable, two sites.\n\nAnd those two sites did an incredible job in about 45 to 60 days. They complete enrollment. And so therefore, we'll get those results much faster than we expected because the enrollment went so quickly. But now everyone's enrolled, just multiply it by three months.\n\nAnd we should be able to get those results roughly in September, October time frame. And then we have not yet -- we make sure get the results and then do they come out in a late winter or somewhere. Do they come out at ATTD or ADA next year. But we'll decide at the appropriate time do we put out information on those results when they come.\n\nIf you know this market, the entire market is all about insulin pumps on pipelines, and no one is really looking to run a switch strategy away from insulin pumps or adding Afrezza in a multitude of ways on top of it on top. So this is a pretty groundbreaking study. Albeit small, it's going to give us some really, really important insights to think about as we go into 2023 and beyond. So we really hope to shape our strategy with the previous question, what do you do from investments.\n\nIf we get superior results then that's one thing. If you get an equal result, that's a different strategy. If you get a suboptimal result, that's another strategy. So our overall goal is change in A1C, and the working assumption is no difference between the control arm and the two others arms.\n\nSo if we see an improvement in hypo, improvement in time and range or improvement in A1C, then that would be the upside scenarios that we're looking for. But if we can demonstrate that people can maintain A1C control and safety by switching off a pump, I think the market does not believe that's possible. And so that's something we'll be looking at very closely.\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nThank you so much. Yes, we don't have any questions for now.\n\nMichael Castagna -- Chief Executive Officer\n\nOK. OK. I see a couple other analysts. So OK.\n\nWell, we'll have one-on-ones. People need any questions or comment, you can reach out to us. And otherwise, thank you for your time today. I look forward to really getting through here in Q3 and sharing with you further results and growth as we go forward.\n\nSo thank you, everyone, for your time. Have a great week.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Castagna -- Chief Executive Officer\n\nSteve Binder -- Chief Financial Officer\n\nUnknown speaker -- RBC Capital Markets -- Analyst\n\nBrandon Folkes -- Cantor Fitzgerald -- Analyst\n\nThomas Smith -- SVB Securities -- Analyst\n\nMore MNKD analysis\n\nAll earnings call transcripts"
}