{
  "companyName": "Apache",
  "companyTicker": "APA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/apache-apa-q3-2022-earnings-call-transcript/",
  "content": "Apache (APA 1.68%)\nQ3 2022 Earnings Call\nNov 03, 2022, 11:00 a.m. ET\n\nOperator\n\nHello, and thank you for standing by. Welcome to APA Corporation's third quarter 202 results conference call. [Operator instructions] It is now my pleasure to introduce vice president of investor relations, Gary Clark.\n\nGary Clark -- Vice President, Investor Relations\n\nGood morning and thank you for joining us on APA Corporation's third quarter 2022 financial and operational results conference call. We will begin the call with an overview by CEO and president, John Christmann. Steve Riney, executive vice president and CFO, will then provide further color on our results and outlook. Also on the call and available to answer questions are Dave Pursell, executive vice president of development, Tracey Henderson, senior vice president of exploration, and Clay Bretches, executive vice president of operations.\n\nOur prepared remarks will be less than 15 minutes in length with the remainder of the hour allotted for Q&A. In conjunction with yesterday's press release, I hope you have had the opportunity to review our third quarter financial and operational supplement, which can be found on our investor relations website at investor.apacorp.com. Please note that we may discuss certain non-GAAP financial measures. A reconciliation of the differences between these non-GAAP financial measures and the most directly comparable GAAP financial measures, can be found in the supplemental information provided on our website.\n\nConsistent with the previous reporting practices, adjusted production numbers cited in today's call are adjusted to exclude noncontrolling interest in Egypt and Egypt tax barrels. I'd like to remind everyone that today's discussion will contain forward-looking estimates and assumptions based on our current views and reasonable expectations. However, a number of factors could cause actual results to differ materially from what we discuss today. A full disclaimer is located with the supplemental information on our website.\n\nAnd with that, I will turn the call over to John.\n\nJohn Christmann -- President and Chief Executive Officer\n\nGood morning and thank you for joining us. On the call today, I will review highlights from the third quarter, provide commentary on our fourth quarter outlook and conclude with an early look at our 2023 plan. APA continues to enjoy a robust free cash flow profile provided by our unhedged exposure to a globally diversified product price mix. With activity in Egypt and the Permian Basin now at levels capable of driving sustainable corporate production growth, our free cash flow is also expected to grow, assuming flat year over year oil and gas prices.\n\nTurning to the third quarter results. We have had several key highlights. Global production was in line with our guidance range as outperformance in the U.S. offset unplanned facility downtime in the North Sea.\n\nPermian Basin assets were strong contributors across the board from the core Midland Basin development program to the newly acquired properties in the Texas Delaware. In Egypt, drilling and recompletion programs are progressing closer to our original plans for the year. New well connections exceeded our revised third quarter guidance and production momentum is picking up into the fourth quarter. The challenges associated with the activity ramp are not totally behind us, but we are making good progress.\n\nThe North Sea after returning to production from seasonal turnarounds incurred an unusually high amount of unplanned downtime in August and September. Most of these issues have been mitigated and volumes have returned to a more normalized level as reflected in our forward guidance. During the third quarter, we generated more than $600 million of free cash flow, purchased nearly 10 million shares of APA common stock at an average price of $33.85 per share and announced a doubling of our annual dividend rate. In Suriname, we advanced our exploration and appraisal program with the first oil discovery on Block 53 at Baja and a successful flow test of the CrabDagu discovery well in Block 58.\n\nAnd on the ESG front, I am very pleased to announce that we have successfully delivered on our 2022 goal to reduce flaring in Egypt. Today, new projects are reducing routine upstream flaring by 40%, enabling us to compress the gas into sales lines and deliver to Egyptian consumers for cleaner burning affordable fuel. More information on our third quarter results can be found in the operational supplement posted on our website. Turning now to our fourth quarter outlook.\n\nCapital investment is projected to be around $450 million, and our full year guidance of $1.725 billion remains unchanged. We expect adjusted production will increase by around 5% from the third quarter, driven primarily by an increase in new well connections and recompletion activity in Egypt and a rebound from planned and unplanned platform maintenance downtime in the North Sea. Given the age of the North Sea facilities, we expect facility run times will generally be lower and more variable than in the past. As a result, we are now providing a production guidance range to accommodate a broader spectrum of potential future outcomes.\n\nIn Suriname on Block 58, we are currently participating in the drilling of two wells, a second appraisal well at Sapakara South and an exploration well at Aware. Results will be provided as they become available. Despite a few challenges during 2022 we will exit the year in a strong position financially and operationally. We are on track to generate around $2.7 billion in free cash flow for the year.\n\nConsistent with our 60% capital returns program, we anticipate returning at least $1.6 billion of this in share buybacks and dividends. While there is more to do, we have significantly strengthened our balance sheet, reducing net debt by more than $1.4 billion through the end of the third quarter and production volumes are now trending sustainably higher in the U.S. and Egypt. As we plan for 2023, our objectives remain the same.\n\nWe will maintain capital discipline, target moderate production growth, work tirelessly to mitigate rising costs and continue to deliver meaningful emissions intensity reductions. Our capital budget next year will be around $2.0 billion to $2.1 billion. This assumes five rigs in the Permian Basin and up to 17 rigs in Egypt, while activity in the North Sea and Suriname is projected to remain consistent with 2022 levels. Similar to our approach in 2022, this early view incorporates what we believe is an appropriate view of inflationary impacts on the capital program.\n\nThe majority of the expected inflation is associated with U.S. rig and frac costs as contracts are renewed at the higher current rates. Inflationary pressures in our international portfolio should be more muted. Despite the planned increase in capital investment in a like-for-like price environment, we estimate APA's free cash flow will grow in 2023.\n\nNote, this excludes any uplift from our Cheniere gas supply contract commencing in the second half of the year. Steve will provide more details on this contract, which gives us access to premium natural gas price points in Europe and Asia. Following three years of production decline since the beginning of the COVID pandemic, we look forward to returning to growth in 2023. At the corporate level, we are targeting mid-single-digit year-over-year growth, driven primarily by higher oil production across all assets.\n\nIn the third quarter, our Permian Basin results were particularly strong due to a variety of factors, including good underlying base production and new well performance. The timing and number of new completions and relatively minimal maintenance, midstream and weather-related downtime. As we look into the fourth quarter of 2022, in the first quarter of 2023, we expect Permian production will be flat to down as we experienced a lull in new well connections and reflect the potential for winter weather-related downtime in our outlook. Planning for next year continues and we will have much more detail to provide with our fourth quarter results in February.\n\nIn closing, we have a constructive outlook on the long-term demand for natural gas and oil. This hasn't changed despite the potential near-term demand impacts of a recession and the ongoing debate over the pace of global decarbonization trends. We continue to plan our business using relatively conservative commodity price scenarios, allocate capital to our highest return projects and target long-term single-digit sustainable production growth. APA will continue to return 60% of free cash flow to shareholders through buybacks and dividends while also continuing to strengthen the balance sheet.\n\nLastly, we remain committed to reducing emissions within our operational footprint, and we will be introducing specific CO2 equivalent emissions intensity goals around this objective in the near future. And with that, I will turn the call over to Steve Riney.\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nThank you, John. For the third quarter of 2022, APA Corporation reported consolidated net income of $422 million or $1.28 per diluted common share. Our quarterly results include items that are outside of APA's core earnings. The most significant of these was a $275 million charge for the impact of the U.K.\n\nenergy profits levy. This was partially offset by a $93 million release of tax valuation allowance due to the use of tax loss carryforwards during the quarter. Excluding these and other smaller items, adjusted net income for the third quarter was $651 million or $1.97 per diluted common share. Most of our financial results in the third quarter were in line or better than guidance.\n\nFor the quarter, we reported a net gain of $12 million on the sale of oil and gas purchased for resale. This was better than the guidance we provided in August of a $10 million loss. As a reminder, we sell our gas in basin at Waha Hub or El Paso Permian based pricing. Our marketing organization fulfills obligations on various commercial agreements, including our long-haul transport contracts using purchased product.\n\nThe reported gain or loss on the sale of oil and gas purchased for resale is a result of this latter activity. In the fourth quarter, based on recent strip pricing, we expect this activity to result in a net gain of approximately $70 million. GPT expense, which is costs incurred for gathering, processing and transmission was above guidance for the third quarter. This has been a trend for much of 2022 and is primarily a result of the higher natural gas prices in the U.S.\n\nGPT expense increases with gas price because some of our gas processing contracts are based on the percentage of proceeds and accounting for such contracts results in costs going up and down with movements in gas price. G&A of $69 million was considerably below our guidance. As with prior quarters, this was primarily the result of the required quarterly mark-to-market of our cash settled stock-based compensation plans. Underlying G&A for the quarter was around $90 million, a little lower than average.\n\nTurning to the balance sheet. You will notice that our total debt increased $244 million to $5.5 billion in the third quarter, as we utilize the revolver to partially fund the closing of the Texas Delaware Basin acquisition at the end of July. As we've discussed on prior calls, the revolving credit facility is an asset that can be utilized when attractive opportunities arise. We've demonstrated this over the past two years using the revolver to fund timely debt tenders, share repurchases and asset acquisitions.\n\nOver time, we will look to pay down the revolver with available free cash flow that is not committed under the capital return framework. A few other things before we turn to Q&A. Please refer to our financial and operational supplement, which includes additional information related to our third quarter results, as well as our updated guidance for the fourth quarter of 2022. This can be found on our website.\n\n2022 will be a very strong year for free cash flow at APA. As John mentioned previously, at comparable prices, we expect to see increasing free cash flow in 2023. This excludes any financial benefit from our Cheniere gas supply contract. At recent strip pricing, the anticipated benefit to 2023 would be around $570 million, assuming the latest possible start date of August 1, which is a slightly later date than we have spoken of previously.\n\nOne final note on U.S. income taxes. At this time, barring any contrary guidance that may be issued by tax authorities we do not expect to be subject to the new 15% corporate alternative minimum tax until 2024. Thus, we currently anticipate no U.S.\n\ncash income taxes for 2023, as accumulated NOLs should more than offset projected taxable income. As always, please follow up with Gary and his team with any questions or if you need any other help related to our updated guidance. And with that, I will turn the call over to the operator for Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Doug Leggate with Bank of America.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning, everybody. Thanks for taking my questions.\n\nJohn Christmann -- President and Chief Executive Officer\n\nGood morning, Douglas.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, John.  I got one on Suriname to kick us off, and then I'll go to one of the financial questions, if that's OK. John, I realize that you've got a couple of wells drilling right now. But I'm also aware that Hess and Shell, I guess, Shell, as you operator had a discovery that looks on trend, if I'm not mistaken, with your prospect. So I'm wondering if you can characterize a your expectations or what the current status is? And whether I'm reading that right, that there might be some read-through from confirmation of a working hydrocarbon system.\n\nAnd I guess, Hess has not really -- you haven't any details as to whether that was a success or not, but it looks like they are reviewing it as we speak.\n\nJohn Christmann -- President and Chief Executive Officer\n\nNo. Doug, the well we're drilling in the kind of the northwest portion of our block is a You will remember Bonboni, it's 25 kilometers west of Bonboni, where we found an active or working hydrocarbon system. It appears that they have a working hydrocarbon system north of us as well. So I think that's all good news.\n\nThe big thing here will be trap. But Tracy Henderson is here, and I'll let Tracey provide a little bit more color.\n\nTracey Henderson -- Senior Vice President, Exploration\n\nDoug, I think your comments are really spot on. We are sort of updip in trend from the well we know as much as you do in terms of what's been in the public domain, but it sounds like a positive result at least with respect to the petroleum system. So what this does do, as John mentioned, we had seen Bonboni in the upper -- or oil in the upper part of Bonboni previously. So what this does is basically push the mature proven kitchen further north into Block 42, so well north of our Block 58 Northern boundary, which is good news for the petroleum system.\n\nAnd I would say it also increases the fetch area in the Block 58 or the Block 58 Northern prospects. I would counter that though with saying with these deepwater fans all along sort of that entire margin, the biggest critical risk factor is trap. So we will still need to be very focused on what our trapping geometries are, but from a petroleum system standpoint, if you have a working trap, this is good and it increases your confidence that you can charge them.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nI hate to do a kind of Part 1b, but just while we're on the topic of Suriname, do you have any color on Sapakara South at this point as it relates to whether that can help inform an FID in 2023?\n\nJohn Christmann -- President and Chief Executive Officer\n\nWell, a couple of things I have to say, Doug, on Sapakara South. No. 1, it's strongly supported from a seismic perspective, and it's an updip test of Sapakara South. Our operations are ongoing.\n\nAnd I'll say it could be a very material add to that area. So we're very excited about it in terms of FID and so forth. We've got the appraisal at Sapakara South, which is ongoing. We also got appraisal at Krabdagu, which will follow sometime early next year.\n\nSo we're excited about that, and we'll just have to get with you when we're ready.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nMy follow-up is for Steve. And I guess, Steve, I'm going to try and layer in a couple of things to this, I guess. But obviously, Cheniere doesn't want to start this contract as soon as -- as early as you would like it to start. I think it was pretty clear given LNG prices.\n\nBut I guess what I'm really trying to get to is your comments about free cash flow. You said, if I'm not mistaken, that the free cash flow -- the cash flow would be higher next year on a similar price deck, excluding Cheniere, if I heard that correct. But you've also flipped this Waha trading contract or gathering contract to a kind of almost a $300 million run rate on revenues. So when you wrap all that together, it looks to us that the free cash flow could be up even at a substantially lower commodity deck.\n\nSo can you help me understand if I'm reading that correctly?\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nYes, Doug, I think we're just going to have to be -- probably be patient to finish the planning process for '23 and to -- we'll get to that in February, and we'll give all the details on that. But as John indicated, if we have -- if we end up with a capital program that's kind of similar to where we've been running for the last two years -- or two years, two quarters, which would be the $2 billion to $2.1 billion. If we allocate that similarly to the way we've been allocating and delivering activity for those last two quarters, if we end up in a price environment similar to 2022, then we will be up on free cash flow for next year. There have been some things that have changed a bit since the last time we talked about '23, which was in February, we've got a little bit more activity that's leading to that increase in capital spending because we do have an extra rig in the Permian.\n\nWe've got a couple of extra rigs going into '23 in Egypt. There are some new taxes, in particular, the energy profits levy in the U.K., and there's talk now about possibly increasing the rate on that that we did say we don't believe we're going to be subject to the U.S. alternative minimum tax in 2023, and that would certainly be good if we can defer that until 2024. So there are -- and we've talked about the North Sea, perhaps being a little less predictable in terms of production volume.\n\nSo having a wider range of possibilities in -- and we know that Egypt has gotten off to a little slower start in '22 than we had hoped for, and therefore, that will carry over a bit into 2023. So we've tried to be really transparent about where we are going into 2023 relative to the last time we talked about it in February. But we think we've got very good momentum. We're fixing some of the issues that we had in the second quarter certainly looks better in third quarter results and going into fourth quarter better, and I think we'll go into 2023 better.\n\nSo a long-winded way of saying, let's wait until February for the details on the capital program and the capital allocation and what that means for production volume. But we feel very good. We feel like the plan that we laid out last February is still very much intact with the transparency of the few things that have changed since then.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nI'll wait until February. Thank you, fellows. And we'll see you next month or next week.\n\nOperator\n\nAnd our next question comes from the line of John Freeman with Raymond James.\n\nJohn Freeman -- Raymond James -- Analyst\n\nGood morning.\n\nGood morning, John. Just a follow-up on the last line of question. I definitely appreciate the early look on 2023, understanding that there's still some moving parts. But if I just wanted to kind of tap on to what you're saying, Steve, where if you're running kind of in aggregate in the U.S.\n\nin Egypt, it looks like on a year-over-year basis, maybe an incremental four and a half rigs versus what you did this year. Is there a way to sort of parse out of the $2 billion to $2.1 billion capex number? How much of that kind of year-over-year increase is kind of activity driven versus cost inflation?\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nYes. I'd say that -- and John might have some comments on this as well. But I'd say look at the last two quarters, where we've -- especially fourth quarter, we're going to be running basically at what we're planning for, for 2023 preliminarily. Most of that was the same in the third quarter.\n\nWe did have a bit of time where we didn't have the Ocean Patriot in the North Sea in the third quarter. But on the last two quarters, we've been running just a little under or this last quarter and next quarter, we're running a little under $500 million a quarter, and that would give you a $2 billion on an annualized spend rate. And that's -- so that's a preliminary view with maybe a little bit of inflation built into that go into possibly $2.1 billion. And that's just -- that's the preliminary view.\n\nWe are still early days on the planning process, and I'd just caveat that with that could change. So let's wait and see in February. But I'd characterize it broadly as the bulk of the change in capital spending is because of the change in activity.\n\nJohn Freeman -- Raymond James -- Analyst\n\nOK. Great. And then, my follow-up question on Egypt. You all did a really good job of playing catch up, getting the completion cadence in the second half of the year back up pretty meaningfully after the growing pains in the second quarter.\n\nBut John, you mentioned that it's not totally behind us in terms of some of the -- what you are going through in Egypt. Can you just sort of maybe give a little bit more color to what you're speaking to because at least on a completion cadence, it looks really good, where you all going to exit the year at in Egypt?\n\nJohn Christmann -- President and Chief Executive Officer\n\nYes. We're in pretty darn good shape, but we've worked hard to get here in a pretty short time period. And a lot of it is just addressing manpower issues and training -- and so we're in pretty good shape, John. And I think we're close to where we wanted to be, but you're still working through some things there, but we're in pretty good shape.\n\nJohn Freeman -- Raymond James -- Analyst\n\nGreat. Thanks, guys. I appreciate it.\n\nOperator\n\nOur next question comes from the line of Neal Dingmann with Truist.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGood morning. Thanks for the time, John. First question, a little bit on what Freeman was just asking. John, my first question is on production growth.\n\nSpecifically, you all, I think, characterized '23 as potentially seen, I think, what you deem this kind of moderate growth. But to me, looking at your '23 domestic and Egyptian activity plans, it seems like production could be even maybe a bit better than moderate? I know you don't have '23 guide yet, but I guess what I'm wondering is how you view sort of next year's contributions incrementally when you think about Egypt versus domestically given to me all the domestic opportunities, including the new play there?\n\nJohn Christmann -- President and Chief Executive Officer\n\nYes, I would just say, and Steve went into pretty good detail on an update of the early look on a  three-year plan, and it's very dynamic, and we're working that and we'll come back in February. But in general, you're still looking at mid-single digits on a BOE basis at the corporate level is what we're looking at. And that's going to be driven by oil in Egypt. We should have cleaner run next year in the North Sea, although we're going to have a range -- and then obviously, we've had really good performance in the U.S., specifically in the Permian.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nOK. Great detail. John. And then, secondly, just on shareholder return, I'm just wondering, would you all say you're still leaning in the stock buybacks, I guess what I'm trying to get a sense of that 1.6 buyback plan, what remains year-to-date.\n\nJohn Christmann -- President and Chief Executive Officer\n\nI would just say, I'll underscore, we're committed to the returns framework, and we will deliver a minimum of the 60%.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nThanks, John.\n\nOperator\n\nAnd our next question comes from the line of Bob Brackett with Bernstein.\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nGood morning. I had a question on the Cheniere gas supply contract. You mentioned the scale of a $570 million opportunity. Could you break that down for us in terms of volume implied and maybe the price differential between Henry Hub and whether you think about TTF or JKM?\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nYes, Bob, that -- so the contract is $140 million a day and the $570 million, I won't recall exactly what day, but it's based on strip pricing for -- and we assumed an 80% TTF, 20% JKM mix, which we have the right to elect and that was versus the same period strip for Houston Ship Channel. And then, it has all of the deducts that we get from that contract for liquefaction for shipping, for shrinkage and for regas and things like that.\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nVery clear. And that's sort of starting up in September through the -- that $140 million a day is four months or five?\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nIt would be five months. By contract, the latest that contract can start is August 1. It could start earlier. I'm not holding my breath.\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nGot it. Thanks much.\n\nOperator\n\nAnd our next question comes from the line of Janine Wai with Barclays.\n\nJeanine Wai -- Barclays -- Analyst\n\nHi. Good morning, everyone. Thanks for taking our questions. Maybe we just go to the North Sea here.\n\nYou mentioned in your prepared remarks, lower and more variable run times, just kind of given the age of the asset. Now we potentially have some higher EPL kind of overhanging here. The current 2023 outlook as it stands today, as you said, the North Sea activity should be consistent with 2022. But we're just wondering what the potential range of outcomes could be there, whether it's related to changes in the regulatory environment or by your choice.\n\nAnd we know it doesn't quite work like sale, but what kind of base decline is the North Sea on.\n\nDavid Pursell -- Executive Vice President, Development\n\nYes, Jeanine, this is Dave Pursell. I don't have the numbers in of me. But think about the two different assets. We have 40s, which is a mature waterflood, that's going to be on a the base decline there is going to be on a high single-digit annual decline.\n\nThese are high water cut low decline wells -- barrels a bit different. There's water -- there's pressure maintenance through water injection in many of those assets, but the -- you'll see more conventional type declines in barrel. So they'll be higher than 40s. And so, we can circle back and get to the blended number.\n\nBut it's going to be somewhere in the mid- to high teens just based on memory, but we can -- we'll tighten that up.\n\nJeanine Wai -- Barclays -- Analyst\n\nOK. Great. And then, maybe turning to the revolver. I think, Steve, you said you consider it to be an asset to utilize and there's attractive opportunities, you'll look to pay it down over time.\n\nI guess our question is how much is too much on the revolver? And how does this really factor into your appetite for future bolt-ons?\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nYes. And I know our controller won't like me calling that an asset, but we view it as such in the non-accounting sense and it's for that very reason. We can -- we used it for the bolt-on acquisition in July in the Delaware Basin. We use it for debt tenders.\n\nWe've used it for share buybacks. In particular, we use it during periods where we have a period where we have no material nonpublic information and we can use it for open market repurchases of shares in periods where we can be a little more selective at the pace at which we buy back shares during those periods of time. So the revolver comes in very handy at those times. We -- especially with the price environment that we're in, we're pretty comfortable with the revolver where we've got it now and where it's been for most of the year.\n\nBut we do need to get that paid down and preserve it longer term for that optionality around potential bolt-on acquisitions if we find the good opportunities.\n\nJeanine Wai -- Barclays -- Analyst\n\nThank you for the detail.\n\nOperator\n\nAnd our next question comes from the line of Charles Meade with Johnson Rice.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nGood morning, John and Steve, and the rest of the team in general. John, I'm hoping to get you to elaborate a little bit more your thinking on supercar south to and what kind of piece of the puzzle this might be? I mean my understanding is you could drill appraisal wells in many locations, but the location you do because you're hoping it will answer some questions for you and move you toward sanctioning projects. So can you talk about what the goals were with this location. I think you mentioned it's up dip and how that could play into the moving the project forward in '23?\n\nJohn Christmann -- President and Chief Executive Officer\n\nYes. The thing I would say, if you look at Sapakara South, it was a very, very high-quality discovery. You had 30 meters of pay -- actually 32 meters full to base. Low GOR, around 1,100 and you had really, really high perm 1.3 to 1.5 Darcy rock.\n\nAt the time of that, we announced a connected volume, which we later updated to more than 400 million barrels. So Sapakara South is really world-class rock. We also said at the time that we believe there was additional resource there that needed to be appraised. And that's exactly what this well is doing.\n\nIt's moved up dip, and we are appraising and we've got really, really good seismic support. We think the seismic is working. And it could add materially to that Sapakara South discovery.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nOK. Got it. Well, it would be interesting to catch up whenever you guys have the information to share there. And second question, I think this is perhaps for Steve, but maybe for you, John, I think Neal was going at this a little bit earlier.\n\nPutting the pieces in your press release, you guys say that you're going to return at least $1.6 billion of cash in the form of dividends and buybacks. And then, you guys had a helpful slide in your presentation where you say you're at kind of 1.1 right now, and you've got another 130. Actually, you're at one right now, and you've got maybe another 130 of dividends that are going to come in 4Q. So that -- if I'm doing the math right, that's about $450 million for the last -- or actually maybe you did $80 million in But it's on the order of $400 million for November and December.\n\nAnd that's a big chunk. Are you guys going to be able to -- are you guys going to have to enter into some kind of a tender to get those shares in? Or is this something you think you can do just participating in the regular daily bid?\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nYes. Charles, let me -- I'll just run quickly through the similar math that you were going through. We do expect now at recent strip prices that free cash flow this year will be $2.7 billion, as John said. So that would imply a minimum committed returns of $1.6 billion.\n\nYear-to-date, we've done $127 million of dividends. We've bought back 26 million shares at $34. So that's $884 million of buyback. And as you said, that's just over $1 billion so far this year.\n\nSince inception by the way, that's 15% of the company that we bought back at a little over $31 a share. So at $2.7 billion of free cash flow that would imply for the fourth quarter total returns of $600 million. The dividends will be about $80 million. And so, that implies buybacks of $520 million and we've done right around $80 million of that in October.\n\nSo your math was pretty darn close that with all of that, if you landed right on 60% would be about $440 million of additional share buybacks. Historically, we've delivered those buybacks through 10b5-1 programs and through OMRs. As I said, we use OMRs when we don't have material nonpublic information, we are drilling two wells in Suriname. So we do understand that situation and the risk associated with that as John said, we're committed to that program.\n\nSo you should assume that we have plans in place to make sure that that will be delivered because it will be delivered by the end of December.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nGot it. So I appreciate you corrected my math, Steve, and it's kind of a wait and see, but you guys have planned to get there, if I'm understanding it correctly.\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nThat's correct. We will get to you.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Paul Cheng with Scotiabank.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nGood morning. Two questions, please. The first one is a little bit of the John, when you're talking about mid-single -- mid-single-digit oil production growth for next year. Is it based on the fourth quarter or based on full year 2022 level? Because if it is based on full year 2022 level, that suggests that your next year oil production may be lower than the fourth quarter level.\n\nAnd with the increased activities -- and is there any reason why that the average production will be lower on the oil growth for next year than the fourth quarter level? That's the first question. And second one is very simple. On the Permian, you're saying you're going to run five rigs, but do you include anything in the Alpine High. And then, what's your view given the current commodity prices between the gas well and oil only weight as well.\n\nJohn Christmann -- President and Chief Executive Officer\n\nSo No. 1, '23 is a work in progress. So we're working on that. We said we'd come back in February.\n\nBut in general, we said BOEs will be up mid-single digit. It's going to be driven by oil. And it is year over year is -- but we'll come back with that in detail. That's really pretty much the shape of the three-year plan that we put out last February.\n\nWhen we look at the Permian, five rigs, yes, today, we've got two in the Midland Basin, three in the Delaware. There will be activity at Alpine High. And we do like the mix, and we think those wells compete very well today with where the gas price deck is and the oil price deck.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nJohn, should we assume you're going to have at least one rig at Apline High, or is that just not necessarily it maybe --\n\nJohn Christmann -- President and Chief Executive Officer\n\nI would say today, today, just assume there's likely three in the Delaware and Alpine High will be part of that program.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAnd our next question comes from the line of Leo Mariani with MKM Partners.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nHey, guys. I was hoping to jump back to the North Sea here real quick. Just kind of looking at the production over the last couple of years, certainly, you guys have been hit with a lot of downtime there. You're forecasting higher production here in the fourth quarter.\n\nJust wanted to get a sense if there's like some things you're doing different operationally where you're kind of feeling more comfortable that you're going to be able to kind of deliver maybe some higher rates here going forward in the North Sea.\n\nJohn Christmann -- President and Chief Executive Officer\n\nI'd just say a lot of it's -- we're coming out of our maintenance turnaround season. And we've had to play catch up in '22 for '20 and '21. The Covid years hit pretty hard there and we were limited on what we could do on the tars. And you've just got aging infrastructure.\n\nAnd when things go down, it takes a little longer to get things back up. But I think we've got a lot of that behind us. And we will be guiding with wider ranges in the future. But right now, we've got good momentum and things are running fairly smooth.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nOK. And just jumping over to Egypt here. Just looking at your kind of gross oil volumes, look like those were down a little bit here in 3Q versus 2Q. Can you just give us some indications as we get into kind of 4Q and early next year, do you think 3Q is the low point on those gross oil volumes, and we start to have some nice growth into kind of the end of the year.\n\nAnd then, do you see kind of what type of growth do you see in Egypt next year? Do you see that driving a lot of the overall production growth of the company?\n\nJohn Christmann -- President and Chief Executive Officer\n\nYes. I think some of that is just timing of the well connections we had this quarter, and we've got good momentum really across the whole portfolio going into the fourth quarter, we're off to a good start and we had some wells that have come on and things. So we do think Egypt is going to be one of the big drivers in '23 and beyond.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nOK. Thanks, guys.\n\nOperator\n\nOur next question comes from the line of David Deckelbaum with Cowen.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nThanks for taking my question, guys.  Just wanted to ask if I could. Following up quickly just on North Sea. John, I think your comments were just on the aging infrastructure. Is there sort of a more of an outsized maintenance capex spend that goes into North Sea and '23? Is there an imminent need to upgrade facilities? And how does that sort of square with where production would be in the fourth quarter.\n\nAre we back to a more sustained level ex downtime heading into next year?\n\nJohn Christmann -- President and Chief Executive Officer\n\nI don't think it's any outsized. I think we really played catch-up in '22 and '23. There are always decisions that you make as you get into later years like at 40s on equipment, and those are decisions we make routinely going forward. But those are all things you're constantly weighing the pros and cons of as you're looking at operating facilities as they get later in their life, but don't anticipate anything significantly outsized from normal and we should be in a period today with most of that behind us where things are going to run a little smoother.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nAppreciate that. And maybe if I could just ask for a little bit more color on the Cheniere contract. I think you all had marked today based on strip pricing. Can you give us a sense on just how those netbacks work? Are the costs that are coming out of those LNG contracts on a fixed or variable basis.\n\nAnd what's a good ballpark to apply on sort of an MMBtu basis for costs relative to where the headline TTF price might be?\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nYes. Unfortunately, it's difficult to give a kind of a generic approach to figuring it out because some of the costs like shrinkage and fuel and things like that will come out effectively at it's a loss of volume. So it comes out at the TTF and JKM price, and some of them are contractual dollar amount costs that do have some provision for inflation over time. So a good example of that would be the liquefaction fee.\n\nSo it's not that easy to give a kind of a generic rule of how it will work through different prices of LNG or Houston Ship Channel for that matter. So that's why we just give it as a as a margin over Houston Ship Channel. Because I mentioned earlier in my prepared remarks that we actually sell all of our product that we produce in basin in the Permian. And we enter into pipeline contracts and things like that, primarily as a participant in the industry to keep less liquid markers like Waha Hub more attached to the bigger, more liquid markets.\n\nAnd then, we have a marketing organization that manages those contractual obligations. And for that reason, we look at the Cheniere contract as a margin over purchased product because we will purchase product on the Gulf Coast and deliver that to Cheniere. The pricing that we get is that netback calculation and they buy the product, they take title to it at their plant in let. So we don't have any title to product as it goes through their plant or the liquefied product as it comes out.\n\nWe don't manage shipping or anything like that. We don't do the selling. They do all of that for us.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nThanks for the color there.\n\nOperator\n\nOur next question is a follow-up from Doug Leggate with Bank of America.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nI'm sorry guys for lining up again. But John, I guess, I'm listening to all the questions about the North Sea. I'm listening to the higher windfall tax risk, the less predictability, the life expectancy the field, etc, etc. And I guess the obvious question to me seems to be -- is this a core asset for Apache? Is there a point at which -- whether it be you get another core area and Suriname perhaps at some point does the North Sea become surplus to requirements, basically, is it for sale?\n\nJohn Christmann -- President and Chief Executive Officer\n\nYes. I mean, the thing I would say, Doug, is that today, North Sea is a core asset for us. Obviously, you've had some factors out there today that impact the ability to invest future and you have to continually weigh in that. We benefit from the Brent pricing and the high netbacks and the free cash flow.\n\nBut we also have a portfolio that is dynamic. And so, you're always looking to expand your ability to invest in other assets. And as things change, sometimes out of your control, it shrinks some of that. But today, it is core but it's something we're always taking into account as we're laying our future plans.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nAppreciate it, John. Thank you.\n\nOperator\n\nI'm showing no further questions. So with that, I'll hand the call back over to President and CEO, John Christmann, for any closing remarks.\n\nJohn Christmann -- President and Chief Executive Officer\n\nThank you for joining us on our call today. We started the fourth quarter with strong momentum across our global operations, which will carry into 2023. In Suriname, we're drilling an appraisal well at Sapakara South and an exploration well at Aware. We will share results when they are available.\n\nWe remain on track to deliver on our capital returns framework. We will deliver at least 60% of 2022 free cash flow to our shareholders through dividends and buybacks. Our teams continue to work on our plans for the 2023 program and longer, and we look forward to providing more details to you in February. Operator, I will now turn the call back to you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGary Clark -- Vice President, Investor Relations\n\nJohn Christmann -- President and Chief Executive Officer\n\nSteve Riney -- Executive Vice President and Chief Financial Officer\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nTracey Henderson -- Senior Vice President, Exploration\n\nJohn Freeman -- Raymond James -- Analyst\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nBob Brackett -- AllianceBernstein -- Analyst\n\nJeanine Wai -- Barclays -- Analyst\n\nDavid Pursell -- Executive Vice President, Development\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nPaul Cheng -- Scotiabank -- Analyst\n\nLeo Mariani -- MKM Partners -- Analyst\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nMore APA analysis\n\nAll earnings call transcripts"
}