{
  "companyName": "Cognex",
  "companyTicker": "CGNX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/cognex-cgnx-q3-2022-earnings-call-transcript/",
  "content": "Cognex (CGNX -0.86%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Cognex third quarter 2022 earnings conference call. At this time, all participants are on a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Ms. Susan Conway, senior director of investor relations. Thank you. Please go ahead.\n\nSusan Conway -- Senior Director of Investor Relations\n\nThank you. Good evening, everyone. Welcome to our third quarter earnings conference call for 2022. Leading today's call are Rob Willett, Cognex's president and CEO; and Paul Todgham, our chief financial officer.\n\nI'd like to remind you that our earnings release and quarterly report on Form 10-Q are available in the investor relations section of our website at www.cognex.com/investor. Both contain detailed information about our financial results. During the call, we may use a non-GAAP financial measure, we believe it is useful to investors or if we think it will help them better understand our results or business trends. You can see a reconciliation of certain items from GAAP to non-GAAP in Exhibit 2 of the earnings release.\n\nAny forward-looking statements we made in the earnings release or any that we may make during this call are based upon information we believe to be true as of today. However, things can change, and actual results may differ materially from those projected or anticipated. For a detailed list of risk factors, you should refer to our SEC filings, including our most recent Form 10-K and our Form 10-Q filed tonight for Q3. Now I'll turn the call over to Rob.\n\nRob Willett -- President and Chief Executive Officer\n\nThanks, Sue. Hello, everyone. Thank you for joining us. When we spoke with you in August, we were in the middle of managing two challenges in our business: one, concerned June fire at our primary contract manufacturer and the other related to overcapacity at a few of our large logistics customers.\n\nLet me start by giving you an update on how we have been addressing both of those challenges. Turning first to the fire. We believe that business disruption is now behind us. The leadership team and I appreciate the hard work and collaboration of Cognoids and our suppliers in the aftermath of the fire.\n\nThey demonstrated the best of our culture during a difficult time. Together, they helped replenish the significant component inventory positions that were destroyed in the fire and fulfill customer demand more quickly than we anticipated. These efforts led to strong shipments at quarter end, which allowed us to reduce the negative impact of the fire on Q3 revenue to roughly $40 million, or about half of what we estimated in our original guidance. This also resulted in exceeding the updated guidance we published in September.\n\nMoving next to logistics. As we reported in August, our largest customer and other e-commerce technology leaders are taking a post-pandemic timeout to absorb excess capacity. This follows two years of heavy investment through Q3 of 2021, which you may recall was a record-setting quarter for both our logistics revenue and Cognex overall. Despite slower current spending by a few customers, we believe our long-term prospects and logistics are as exciting as they have ever been.\n\nThere are several reasons for our confidence. First, Cognex customers include many e-commerce and omnichannel retailers that are early in their adoption of machine vision. Second, we believe more growth collectively will come from Europe and Asia than the Americas. Third, there are other market adjacencies and logistics such as Pashto and Post, where we have a small presence today and superior solutions that position us well to grow.\n\nAnd lastly, we see many applications beyond barcode reading where our machine vision technology is increasingly being used to solve new problems in logistics fulfillment. We believe that logistics will continue to be an important growth driver for us. It has emerged as the largest, and we expect it will remain the fastest-growing sector in our served market. We estimate the logistics segment to be a $2 billion market growing by 20% long term.\n\nOur differentiated technology and the opportunities we see in logistics gives us confidence we can continue to be a share gainer and grow this part of our revenue by 30% over the long term. Next, let me turn to a broader view of our served market and our expectations for longer-term growth. The excitement we have about our future was apparent at our Analyst Day event in September. We see tremendous value in bringing the investment community to our headquarters in Natick.\n\nThey had an opportunity to meet in person with Cognoids, experience our culture firsthand, and see live demos of our products. We received a lot of great feedback from the event. At Analyst Day, we introduced an updated view of our served market. The new estimate is $6.5 billion, up 55% from our previous estimate of $4.2 billion that we shared with you in 2019.\n\nWe believe the market will grow by 13% over the medium to long term. As a reminder, we calculate our served market estimate ourselves because there is no reliable third-party source. Our served market reflects a relatively narrow definition of how big our business could be if we won every dollar of opportunity in the markets where we are focused. Also, at Analyst Day, we updated our long-term target for Cognex revenue growth to 15% on a compound annual basis.\n\nWe expect to continue to outperform market growth, thanks to our strong product pipeline, our focus on high-growth end markets and the strength of our reputation with leading manufacturers. At this point in the year, I spent a lot of time with our sales force, conducting in-depth reviews of our customers by geographic region. I'm excited about the new products and solutions we are introducing. They will help us scale our business more quickly and will enable a wider and less technical profile of customer to use our sophisticated and powerful technology.\n\nOur new modular vision tunnels are an example of this. These pre-configured standard solutions are part of our plan to develop the opportunity for Cognex machine vision and logistics. They make it easier and faster for customers to solve complex vision problems using Cognex technologies, products, and our Edge Intelligence data analytics software platform in high-speed, high-throughput operations. Another example is the DataMan 8700 LX, the latest addition to our highly successful next-generation series of industrial handheld readers.\n\nLX stands for extreme label reading and is highly accurate in reading the most challenging label-based codes in a fraction of a second 150 milliseconds. The 8700 LX outperforms other handheld products available today and is being embraced by leaders in cloud computing and high-performance EV battery manufacturing, among other segments. Lastly, we were pleased to publish our first comprehensive sustainability report during the quarter. We have a great story to communicate.\n\nCognex machine vision and deep learning technology plays an important role in making manufacturing more efficient and reducing its environmental impact. This report was developed by a cross-functional team of Cognoids. It demonstrates the strong progress we are making on our ESG journey. I'll stop here for now.\n\nPaul, the microphone is yours for details of the quarter.\n\nPaul Todgham -- Chief Financial Officer\n\nGreat. Thanks, Rob, and hello, everyone. Revenue was $210 million in Q3. That level represents a decline of roughly 25% from both last year's record-setting performance and Q2 of 2022.\n\nIt was better than we expected when we gave our updated Q3 guidance, but still lower than we would have anticipated earlier in the year. The business disruption from the fire caused revenue from most end markets to decline in Q3 year on year and all to decline on a sequential basis. The quarter was also impacted by lower revenue from large customer projects in logistics. And with approximately two-thirds of our revenue coming from outside of the United States, currency exchange rates had a negative impact, leading to a 5 percentage point drag on revenue growth in the quarter.\n\nLooking at the change in revenue for Q3 from a geographic perspective. Each primary region was also negatively impacted by business disruption from the fire. Asia decreased mid-single digits, excluding a 6 percentage point negative impact from currency exchange rates. Large order revenue from consumer electronics made a positive contribution in the quarter.\n\nRevenue from Europe decreased low teens, excluding a 12 percentage point reduction from currency exchange rates. Lower revenue from logistics and declining business confidence impacted revenue across the region. In the Americas, revenue decreased by more than 40% year on year due to the slowing of large investments by a small number of customers in logistics. Gross margin was 73% in Q3 compared to 70% in Q3 of 2021 and 72% in the prior quarter.\n\nGross margin was better than our guidance due to leverage on our fixed costs given the higher-than-expected revenue level, while partially offset by unfavorable FX. The 3 percentage point increase year on year is due to a more favorable revenue mix this quarter. The improvement in gross margin on a sequential basis is due to lower broker premiums for stairs components. In regards to broker buys, the premiums we've been paying are trending down.\n\nHowever, we expect the negative impact on gross margin will pick up again in Q4. While the supply environment is improving, it will take a few quarters to higher price components that are in inventory to work their way through our P&L. Operating expenses in Q3 included a noncash charge of $3 million related to the fire, primarily for idle production capacity given temporarily lower business levels. Excluding that charge, the combined total of RD&E and SG&A line by 2% year on year and 4% on a sequential basis, which was slightly favorable to our guidance.\n\nLower incentive compensation and the favorable impact of currency exchange rates more than offset the incremental investments we've been making in sales and engineering headcount and other related costs. Operating margin was 19% in Q3 of 2022 compared with 31% in Q3 of 2021 and 24% in the prior quarter on a GAAP basis. Excluding the fire loss, operating margin was 20%, 31% and 30%, respectively. The leverage we have in our income statement worked against us in Q3 despite the benefit provided by a better gross margin and lower operating costs.\n\nThe effective tax rate in Q3 was 16%, excluding discrete tax items as expected. Reported earnings were $0.19 per share in Q3 compared with $0.44 in Q3 of 2021 and $0.34 in Q2 of 2022. On a non-GAAP basis, earnings were $0.21, $0.40 and $0.41 per share, respectively, excluding discrete tax items and the fire loss. Turning to the balance sheet.\n\nCognex continues to have a strong cash position with $818 million in cash and investments and no debt. Proceeds of $27.6 million from insurance claims related to the fire were received in October and after the balance sheet date. As we announced tonight, our Board of Directors has increased the quarterly cash dividend by 8% to $0.07 per share. We believe this demonstrates their continued confidence in Cognex's financial strength and long-term growth prospects.\n\nBefore I turn the call back to Rob, I'd like to welcome Nathan McCurren as Cognex's new head of investor relations. Nathan joined us last week from Lime, where he served as head of investor relations and treasury, and brings to Cognex prior experience across IR and other finance functions at Iron Mountain, Goldman Sachs, and General Mills. He joins Sue Conway, who many of you know. Sue established our IR program and developed it over the past 26 years.\n\nWe're excited for Nathan to now lead the Investor Relations team and enhance our engagement with the investment community. Now I'll hand the microphone back to Rob.\n\nRob Willett -- President and Chief Executive Officer\n\nThanks, Paul. Let's talk now about our guidance for Q4. We expect revenues for Q4 will be between $235 million and $255 million. That range represents a strong rebound from an artificially low level in Q3 due to a return to more normal production lead times.\n\nIt also includes a remaining $20 million catch-up on customer deliveries following the fire. At the midpoint, we expect revenue will be roughly flat on a year-on-year basis. We expect to continue to experience lower large project activity in logistics. Reflected in this guidance is a 10 percentage point headwind to year-over-year growth from the strong U.S.\n\ndollar. I want to clarify that this is a 10 percentage points, not basis points as there was a typo in the press release. We believe gross margin in Q4 will be in the low 70% range. The supply environment is improving, and that's leading to lower broker buy activity.\n\nHowever, the impact of what we've already purchased and is in inventory will take a few quarters to flow through our income statement. We expect the combined total of RD&E and SG&A will increase by low single digits on a sequential basis due to the timing of incentive compensation. The effective tax rate in Q4 is expected to be 16% excluding discrete tax items. Now, we'll open the call up for questions.\n\nOperator, we're ready to go ahead with questions.\n\nOperator\n\nThank you. The floor is now open for questions. [Operator instructions] The first question today is coming from Joe Giordano of Cowen. Please go ahead.\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nHey, guys. Good afternoon.\n\nRob Willett -- President and Chief Executive Officer\n\nHi, Joe.\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nHey,I just wanted to get a sense on the fourth quarter like how much of this is underlying demand and how much is kind of backlog delivery? I know you called out $20 million specifically is like a catch-up. But how much is just stuff that you've been booked over the year? And how much do you feel like is truly new business and reflective of what conditions on the ground are?\n\nRob Willett -- President and Chief Executive Officer\n\nYeah. Let me kind of speak to that more generally for everyone on the call. So, our revenue guidance in Q4 is roughly flat year on year. Our expectation for the quarter, it's driven primarily by four things, right? There are two headwinds and two tailwinds.\n\nAnd Joe, I think you're talking about one of the tailwinds that we have. So first of all, headwinds, a few large customers and logistics are currently spending less on new fulfillment centers than a year ago. And we also expect a roughly 10 percentage point negative impact from currency rates in the quarter. The tailwinds, things that are helping us, expected growth from the broader factory automation market and then there's about $20 million of revenue shifted from Q3 resulting from a catch-up on customer deliveries following the fire.\n\nSo, I think that $20 million gets a little to your question, Joe. Business activity in the broader factory automation market is holding up, although it's less robust than it was a year ago, particularly in Asia, and we're not expecting a big budget flush this year overall. So, it's generally kind of how I would think about the fourth quarter.\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nJust given where we are in the year in November, I'm guessing you have a pretty good idea of where your big markets, your critical markets are going to come in. So maybe if you can take us through logistics, consumer electronics, where there's been a lot of negative headlines in automotive, maybe as to what growth looks like for 2022 full year for those markets.\n\nRob Willett -- President and Chief Executive Officer\n\nYeah. Yeah, yeah. Yeah, I mean, I'll start out and encourage Paul to say a little more. Generally, we don't give sort of that full year position until after the year is over.\n\nI think what we've already said is that we're expecting a growth in our electronics market. I think we've said around in double digits, low double digits. Obviously, we're expecting significant contraction in our logistics business, right? Automotive overall, I think probably moderate performance in that market and similar in other markets overall. So that's kind of -- and then obviously, we've got headwind from currency, which is pretty significant at this point.\n\nPaul, would you like to give any more color?\n\nPaul Todgham -- Chief Financial Officer\n\nNo, I mean, I think that's right. After Q3, we're now down on logistics year on year. So, we know -- we said we'd be down for the year. We're now there.\n\nAnd with Q3 going to be the most down as we've sort of communicated last quarter. Consumer electronics is playing out really as we expected and communicated in our last earnings call. And again, automotive gets a little bit clouded by the fire impact and currency and so on. But we're generally pleased by what we're seeing in EV and there's tentativeness elsewhere.\n\nThe broader market in Europe, for instance, there are some tentativeness in automotive. \n\nJoe Giordano -- Cowen and Company -- Analyst\n\nAnd just last for me. Is there any way to kind of like -- I know you talked about the gross margin in the quarter? How much benefit in the quarter are you getting from less like large customer deliveries of mixed negative logistics stuff versus like the benefit that you got from less broker? I'm trying to just understand like what that looks like. How much up versus how much down and then where net out? You know what I mean?\n\nPaul Todgham -- Chief Financial Officer\n\nSure. Yeah. So you'll recall, a year ago was our low point for gross margin. We reported a 69% gross margin.\n\nAnd at the time, we were calling out three factors. One was broker buys. One was a strategic project in the logistics space that was particularly low margin, it was sort of a co-investment in something that would lead to productized solutions like the machine vision tunnels that we -- the modular vision tunnels that Rob spoke to today. And the third was some supply chain issues that were particularly impacting some of our highest margin Vision products.\n\nSo those are the three factors that kind of jointly brought us from our typical mid-70s to the 69% or 70% we did. This quarter, the broker buy impact was pretty comparable year on year, I would say. And again, that's a little bit artificially low just by virtue of what we sold in this quarter, and it's going to be a little higher next quarter, which is why we brought our guidance down slightly versus what we've communicated. So that's the impact.\n\nFX was about a 120 basis point negative impact to gross margin for the quarter. And then our pricing actions are offsetting our component cost inflation, which really is our strategy. So those are the real drivers. Revenue mix was favorable this quarter versus a year ago.\n\nIt's favorable within the quarter -- within the year in Q3, just by virtue of a little lower logistics mix this quarter, and we'll have a little more of that next quarter.\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nThanks, guys.\n\nOperator\n\nThank you. The next question is coming from Joe Ritchie of Goldman Sachs. Please go ahead.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nThanks. Good afternoon, guys.\n\nRob Willett -- President and Chief Executive Officer\n\nHi, Joe.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nI know that you guys don't give guidance for a full year. But I'm hoping that you maybe can kind of contextualize like how to think about logistics in 2023. I know that your long-term growth rate is you expect to grow 30%. But I'm trying to just get an understanding of your views on the market versus your ability to potentially outgrow the market with, as you mentioned earlier, new use cases and applications for your technology.\n\nRob Willett -- President and Chief Executive Officer\n\nYeah. I think to kind of contextualize that, we have significant and growing base of regular logistics customers, right? And they're growing, and they're growing very strongly outside the U.S. And that -- and we expect that to continue, right? And we're expecting continued strength in that to be one of the fastest-growing parts of our business. It's less than half of our logistics business, but it's -- I mean last year, it was.\n\nAnd -- but the growth dynamic and the broadening of those customers and the geographic broadening is really a great thing for us. Then we have this other dynamic that we're speaking to a lot, which are large technology e-commerce players, and there are a few of those, right? And one, I think we focus on a lot of your questions often do, but there are a few of those customers, and they really are going through a similar phenomenon where they're taking this kind of time out from investing, having really overbuilt capacity and seeing some more challenging environments post-pandemic, right? So, I think the big challenge and one that's hard to call is when will that investment cycle turn, and those companies start investing more heavily again. I don't think it's in the first half of next year. I feel confident in saying that.\n\nBut at some point, we're very confident it will return. And we just have so much value to add and we all see that. And we have so much new technology to bear beyond barcode reading that we're very confident about that coming back. But I certainly am not expecting it in the first half of next year.\n\nPaul Todgham -- Chief Financial Officer\n\nAnd Joe, I'd maybe add -- so the full year view on logistics is tough to call because of kind of the timing of when that might come back. But we are up against tough compares in the first half. We -- Q1 this year 2022 was our highest quarterly revenue level and also our highest quarterly growth rate, and we did have a strong quarter in logistics in Q1 this year, kind of broad-based across all of our logistics customers, including large customer activity. So, we're up against a tough compare.\n\nAnd then the question really is, when does the large customer business come back in the -- is it back half of 2023? Is it 2024?\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nYeah, Paul, that's helpful. And maybe sticking with you for a second and talking about the gross margins a little bit more. So, can you maybe just help me understand again why the gross margin step down in the fourth quarter? What is it specifically about what you sold through in Q3 that maybe helped gross margins? And then as you start to think about the first half of next year, if logistics doesn't come back as you have that tough comp, I mean, you should get a pretty decent benefit at least on the gross margin side from mix. if there's any way to quantify that, that would be helpful.\n\nPaul Todgham -- Chief Financial Officer\n\nYeah. Yeah. So first, maybe just the biggest phenomenon for our gross margins over the last five quarters has been our broker buys. So -- and it helps to understand, there's really sort of two factors with broker buys.\n\nThere's the volume of the buys we're making and then the timing of when that flows to the P&L. So, there is a lag effect. We commit to the value. We receive it in inventory before it becomes a finished good that's then sold through.\n\nSo, what we're seeing right now, Joe, is the volume of the buys, it spiked a bit right after the fire as we quickly replenish inventory, and it's come down very significantly through the rest of Q3. So, we're optimistic that we are headed in the right direction with regard to a return to our normal levels. And now we're dealing more with the lag effect of -- it will take a few quarters for that to flow through our P&L. So, part of why Q4 is a little worse than Q3 in our guidance is that factor.\n\nWe're going to take a little more broker buys to the P&L. We have a little more FX expected. We quoted a 10 percentage point impact on Q4 versus the 5 percentage points we had in Q3 as a revenue impact, and that there's a corresponding impact to gross margin. And then overall revenue mix, which -- in Q3, we benefited from quite high electronics business, which is generally gross margin accretive to us.\n\nIt's high software content and a lower logistics mix. So that lower logistics mix may benefit us to some extent next year. But I think it's smaller than the broker buy factor that's really been driving our gross margin over the last five quarters.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nOK. That's helpful. Thank you both.\n\nOperator\n\nThank you. The next question is coming from Josh Pokrzywinski of Morgan Stanley. Please go ahead. \n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nHi. Good evening, Rob, Paul, and Sue.\n\nRob Willett -- President and Chief Executive Officer\n\nHi, Josh.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nHi, there. So, first question on the fourth quarter guide and this $20 million catch-up. If you could just remind us how much is left, if any? And if there's any change to the part of the business that you thought was sort of lost as a function of out-loaded product, there was some way to backfill that with newer stuff or some other work around you on?\n\nPaul Todgham -- Chief Financial Officer\n\nYeah. So strictly, the financials. Back in August, we said we had an $80 million impact of the fire in Q3, $20 million of that business we thought would be lost and $60 million of it we thought would shift from Q3 to subsequent quarters. And then in a follow-up, there was sort of how long might that take? And we said kind of two quarters.\n\nSo, we thought there might be some impact in Q4 and some in Q1. The $20 million fire loss impact we estimated really was dead on. In some cases, it was a product that was being sunset and maybe a couple of last buys of that product that once the components were lost, we weren't going to get back into the product or unable to get back into it. And some of it is maybe just quick cycle readers or vision systems for which if a customer couldn't get it in time, they would either not do the project or get it from a competitor.\n\nSo that's pretty much played out as we've expected. We're still in the process of migrating customers to newer products and so on, but that wasn't really a major factor in the product loss, I would say. And then of the $20 million shifted, we really think we're going to realize all of that in Q4 rather than have any overhang going into next year. Again, the replenishment has been quicker than we expected.\n\nAnd so, we thought a couple of months ago or three months ago, we might be holding some product back to deliver to customers. But because of how quickly we've gotten back into supply, we're not needing to do that at all, and business is good. Supply chain businesses are good.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nGot it. Very comprehensive, super helpful. I appreciate it. And just on logistics.\n\nI know that you are kind of reluctant to want to call the full year, especially the first half, second half dynamic. But maybe thinking about outgrowth differently and kind of your customer mix versus how you think the market may be different. I think folks like Honeywell and Qian are teeing up kind of down 30-ish type numbers. You talked about 10 points of outgrowth in kind of your core business.\n\nWould you think about if the market were to be down that much, your outgrowth formula would hold? Or there's some sort of mix or comp issue that you think would be more of a distinguishing factor?\n\nRob Willett -- President and Chief Executive Officer\n\nAnd to clarify that, Josh, are you talking about this year, current year or next year? \n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nNext year, 2023. \n\nRob Willett -- President and Chief Executive Officer\n\nRight. Yeah. I think the first thing I would say is we have some -- you know this about Cognex, we're the technology leader in our industry, and we have exposure to some of the most sophisticated companies in the space, right? So -- and that's a wonderful thing because they teach us so much. And many of the technology leaders then go from them to other places and bring Cognex technology with us.\n\nBut in this case, it does expose us to a few big players who really are not looking to invest, particularly in greenfield sites as we move into next year. And our exposure that was more than 50% of our business last year was related to that. So, I would think our exposure to that part is going to be down more than the companies that you quoted to perhaps have a broader exposure to broader conveying and material handling, right? But on the upside, I think we have exposure to the base -- the rest of our business, the large groups of customers who we're gaining share in, we have great technology to offer them. So, I would expect there, we would be outgrowing the general industry as customers are really looking to add and spend more on technology enhancements than perhaps on basic conveying and material handling.\n\nSo that's perhaps a little context for you.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nThat was a great answer. I found that really helpful. Thanks, Rob. And best of luck, guys.\n\nRob Willett -- President and Chief Executive Officer\n\nThank you. \n\nOperator\n\nThank you. The next question is coming from Jake Levinson of Melius Research. Please go ahead.\n\nJake Levinson -- Melius Research -- Analyst\n\nGood evening, everyone.\n\nRob Willett -- President and Chief Executive Officer\n\nHi, Jake.\n\nJake Levinson -- Melius Research -- Analyst\n\nJust wanted to get a sense of -- or do you have visibility, I guess, I should say, into the inventories in the channel? And I'm just thinking, you've obviously got some markets like logistics that are not in such great shape. I'm sure there's some fire impact in there potentially to make things even more complicated, but any color you could give would be helpful.\n\nRob Willett -- President and Chief Executive Officer\n\nSure. Jake, I'd say a wonderful thing about Cognex is that there is really almost no inventory in our channel, right? We have a -- we sell about two-thirds of our business is direct and a third is through partners. And for those partners, we very much encourage them not to hold inventory. We think it's a wonderful thing about our model, and we deliver product to them very quickly, of course.\n\nWhen we had a fire, that's a problem. But they're really -- we actually have found that the rest of the automation universe that we're selling into has much longer lead times than we do, right? So, PLCs, as you're probably aware, a lot of them are on six-month lead times and other automation equipment. So, we supply quickly around products, and there's very little kind of a dampening in our channel around that. There are just very few examples, certainly much less than 10% of people who sell Cognex carry any significant inventory at all.\n\nJake Levinson -- Melius Research -- Analyst\n\nOK. Got it. And just switching gears for a second. On the consumer electronics side, not looking for a 2023 view here, but just trying to get a sense of you've got data points showing that people are buying through smartphones and PCs and whatnot after the last couple of years, but it seems like the capital spending side, maybe is holding in better.\n\nSo just curious what your -- are your customers investing ahead of new product launches or new types of technology within that? I'm just trying to get a sense of the difference between maybe the production rates versus the capital spending side. \n\nRob Willett -- President and Chief Executive Officer\n\nYes. I think, Jake, there are a few things going on there. One is we kind of asked this question around this time every year. And our answers will have really a good picture of the electronics business next year come April.\n\nThat's when things sort of really kind of locked in for the year. It's been a good year for us relative to the rest of our business in electronics. And I think maybe a phenomenon again where we're really connected to the technology leaders in the industry that's sort of more high-end and more advanced consumers of manufacturing technology. So, they've been investing, and that's very promising.\n\nSo, what kind of drives that kind of up or down year, generally kind of new technologies coming into the market, whether it's in smartphones itself or in other similar type technologies or consumer electronics technologies? And there's always a lot of exciting stuff going on in that industry. It's more a matter of when is it coming to market. And how much the timing plays out next year versus in future years. So that's what we know in April.\n\nBut there's another phenomenon going on, which is of interest here is, I think many of the players in electronics are looking to diversify their supply chains. And so, we're seeing investments and incremental investments outside of China, which is a positive thing for Cognex, and I would expect that to keep playing out over the coming years. I think we're well positioned, and we've seen this trend coming and we're supporting strongly and being asked to the big players in that space moving to multiple different markets where we have strong presence and are investing. So I do think that's a net gainer for us.\n\nAnd obviously, particularly recently, as we've seen with COVID lockdowns and some challenges going on. I only think the kind of impetus toward that is going to increase as we move through the next few years.\n\nJake Levinson -- Melius Research -- Analyst\n\nThat's great. Thank you. I'll pass it on.\n\nOperator\n\nThank you. The next question is coming from Jim Ricchiuti of Needham and Company. Please go ahead.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nHi. Good afternoon. I'm wondering if you could talk a little bit more about that $20 million catch-up that you're anticipating in Q4. Can you give us a sense as to which markets that might be concentrated in?\n\nRob Willett -- President and Chief Executive Officer\n\nYes, Jim, it's very broad-based. Certainly, automotive would be among it, but electronics and other markets, we -- it's really a general catch-up across our general product range, not specifically logistics, I would say, but more general factory automation.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nAnd not necessarily have a larger project focus associated with it?\n\nRob Willett -- President and Chief Executive Officer\n\nNo. \n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nOK. Rob, at Analyst Day, you guys talked about opportunities that you see in some of the underserved markets, at least underserved for Cognex. And I'm wondering how you're going to be going about that in terms of redeploying existing sales resources. Or do you anticipate having to step up hiring as you go after some of these other market peers that you talked about?\n\nRob Willett -- President and Chief Executive Officer\n\nYeah, Jim, thanks for that question. So, we're in the process of Cognex of bringing to market some really exciting technology called Edge learning. And what that is, is it's very, very powerful deep learning vision that's kind of pretrained and deployed to smart cameras or basic vision systems but then easy to sell, right? And so that's going to bring us to a lot of customers that we really couldn't serve before, right? Customers who aren't sophisticated, aren't programmers of automation or machine vision technology. So, as we roll that out, we're going to need more coverage, right? And the sophistication or the technical sophistication of the sales force, we're going to need to do that is going to be less, right? So certainly, we do expect to be recruiting and training and deploying over quite a long period as that product range rolls out, more sales noise, as we call them, to do that.\n\nAnd we'll expect to see that, I think, we'll be talking about that in quarters to come. \n\nPaul Todgham -- Chief Financial Officer\n\nAnd I think, Rob, it's fair to say, outside of sales, we really are sort of as we are setting plans for next year and so on, we really are deploying -- redeploying existing resources and whether that's on the engineering team or G&A functions. It's really the sales phenomenon.\n\nRob Willett -- President and Chief Executive Officer\n\nYeah. It is a sales phenomenon.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nGot it. Thanks very much. \n\nOperator\n\nThank you. The next question is coming from Jairam Nathan of Daiwa Capital Markets. Please go ahead.\n\nJairam Nathan -- Daiwa Capital Markets -- Analyst\n\nHi, thanks for taking my question. So I just wanted to concentrate a bit on the Asia ex China number. It was down about 20%, excluding currency. And in the past, it has been -- I think you guys have talked about autos being strong.\n\nAnd I was just wondering what are some of the puts and takes there on fire impact, a bigger, bigger impact in that region?\n\nRob Willett -- President and Chief Executive Officer\n\nYeah. I'll come in and I'll invite Paul also to comment. I think sales activity in Asia outside of China was pretty mixed in the bid. We did observe slowing activity and project delays in Japan and Korea.\n\nOne phenomenon I would point to is, well, what customers continue to have aggressive plans for electric vehicle manufacturing. Some of the plans that we're seeing are moving and investment that we were seeing getting lined up for those markets in Asia, excluding China. As a result of some of the government regulation that's been going on, are now shifting geographies and investments we were expecting to see, certainly in Korea and Japan and some other markets are now being deferred and being moved to Europe and America. So that's certainly a phenomenon.\n\nIn semiconductor, continue to grow, but growth rate was slowing. So, I think it's a little bit of color. And then I think we continue to see good progress in logistics, but we do have some larger e-commerce players in that market that we're speaking about who really also had a similar phenomenon to what we're talking about, and one very large and successful player in that market really did slow down their spending very sharply post-pandemic.\n\nPaul Todgham -- Chief Financial Officer\n\nYeah. And, Jairam, I just want to make sure there's no confusion over the data. China was roughly flat versus a year ago, with about 5% growth in constant currency, offset by 4% in currency. And really, it was other Asia, which is Korea, India, ASEAN, Japan, and so on, that was down about 20% in constant currency for the factors Rob cited.\n\nSo, within China, we had strength in electronics and then we did see some fire impact certainly and other factors to sort of offset and then more broad-based bunches in other Asia, as Rob described.\n\nJairam Nathan -- Daiwa Capital Markets -- Analyst\n\nOK. No, thanks for the detailed answer. Just on logistics, like you talked about expanding beyond barcode reading and expanding into some of the parcel and post customers. So, I'm just trying to understand like what kind of timing should we think about like where you are in the process.\n\nAnd when should we start seeing some wins -- business wins there?\n\nRob Willett -- President and Chief Executive Officer\n\nWell, I think the modular vision tunnel that we just about today is certainly a very strong first step into some of those markets. And we saw already in trials with a number of key companies in those markets. So that's -- I think that's the first step, and I think you're going to see a lot more technology from us coming that will make us very competitive in those markets over the next number of quarters. So, I think it's the beginning, and it's starting to feel much more tangible around Cognex.\n\nJairam Nathan -- Daiwa Capital Markets -- Analyst\n\nOK. And a final question, if I may, on seasonality in 2023. So, should we without the fire impact next year, should we kind of go back to normal seasonality of 1Q being the weakest and improvements in 2Q and 3Q?\n\nRob Willett -- President and Chief Executive Officer\n\nI think we've got this phenomenon Q1 of last year -- sorry, this year was very strong because of logistics. In fact, I think it might have been our strongest quarter, and that's really not expected in Q1 of next year. I think if we strip that out, then we're dealing with some of the normal seasonality, which Q1 tends to be lower quarter for factory automation. And I've seen no reason it wouldn't be, again, given some of the dynamics we see in Europe and elsewhere.\n\nSo, I think we certainly have some of those factors playing I did just want to go back to something you said earlier. So, I made the point that we see growth outside of China for investments. So -- and the reason that may not be apparent when you look at the other Asia numbers and some of those purchases may be being made inside China, right, for contractors who may be then moving it outside of China or out through our European region. If that's confusing to anybody.\n\nI'm really speaking to underlying trends in geographical movement rather than where you may see the bookings. Sorry, the revenue.\n\nJairam Nathan -- Daiwa Capital Markets -- Analyst\n\nYeah. No. Understood. Thank you.\n\nThank you for the details.\n\nOperator\n\nThank you. The next question is coming from Matt Summerville of D.A. Davidson. Please go ahead.\n\nWill Jellison -- D.A. Davidson -- Analyst\n\nHi. This is Will Jellison on for Matt Summerville today. Good evening.\n\nRob Willett -- President and Chief Executive Officer\n\nHi, Will.\n\nWill Jellison -- D.A. Davidson -- Analyst\n\nI wanted to start out by referencing something you said at the very beginning of the call, and that is with the business impact of the fire largely behind you at this point. Can you speak to any lessons or best practices you feel Cognex might have gained from the experience in terms of supply chain management or how to handle supply risk moving forward?\n\nRob Willett -- President and Chief Executive Officer\n\nYeah. We've done a lot of analysis and soul-searching on that question, Matt, and we're not quite done. We continue to work on it. One thing to point out is, I think we had recognized this as a risk factor in our business for some time, and we're in the process of addressing it, and the fire came when we were not in the final quarter, I would say, but approaching it.\n\nAnd there's a sports metaphor, they're not an annual calendar metaphor, anyway. But we've -- we're in the process of starting up a second contract manufacturer, a very substantial and accomplished business. And I think had we been there, we would have been in a much stronger position. We've certainly looked a lot at where we hold our inventory and our strategic component inventory and having that in more diverse location is important.\n\nI think like a lot of companies, we're thinking about kind of diversifying our regional presence where we source and manage products from. I think like a lot of companies through this kind of period we've been going through with supply chain, just making sure that we have very strong relationships with our component and technology suppliers is important. I think -- that's one where we've come out of this really well. I would say, I think one of the reasons we've outperformed what we had expected to do is despite some very different component supply environment that we've been in the relationships we have with our component suppliers are very, very good, and they came through for us.\n\nThey moved us to the front of the line in some cases, in many cases. Why? Because we're very sophisticated users of their components, processors, imagers, they really like working with us, and we have very collaborative relationships. But the other thing is we pay on time, and we're very proud of Cognex of being a company that's good to its word, it treats us supply as well and pays on time. And I think that came through for us in this relationship, where the CEOs of some pretty major component suppliers came through to help us.\n\nI think if there's maybe another thing, we did -- coming out of this, not maybe we absolutely did. We did a comprehensive assessment of our insurance programs. And I think we were pleased with how we were insured in many regards, but still are opportunities and tunes up that we've done as we've gone through this difficult lending experience. And then finally, as you would expect, we've taken more protective measures around such things as fire protection, etc., across the business in multiple locations globally.\n\nSo, it's been an important learning experience for us, which thalassemia team will continue to engage, and we have a meeting next month, where we will be doing a full debrief on that internally.\n\nWill Jellison -- D.A. Davidson -- Analyst\n\nUnderstood. That's great. Thank you for that color, Paul. And my follow-up – excuse me, Rob, thank you for that.\n\nI wanted to ask a follow-up about Edge Intelligence. And I'm thinking how interesting it is that it unlocks this opportunity for you to serve those markets that you haven't quite paid as much attention to in the past? -- what I want to better understand about Edge Intelligence is if there's any sort of IP protection or high degree of know-how that helps that software and your ability to create value with it, not be imitated by somebody who might want to serve those same markets in the future?\n\nRob Willett -- President and Chief Executive Officer\n\nYes. Yes. Thank you. I just want to just a point of order, which is we have these two terms going on at Cognex, which I know confuses everybody.\n\nWe have edge learning and edge intelligence, right? And the comments I made previously were about learning, which is taking -- and I think that you're asking -- I think your question is really about that deep learning technology that we're applying to the edge, right? That's -- yes, yes, good. So, Edge learning, yes, it's -- so we have some fabulous technologists at Cognex that have come to us largely through two acquisitions that we've made over the last six-or-so years and the acquisition of ViDi and SUALAB. And these are foremost technologies in taking deep learning, a technique where you create a very sophisticated model and show examples. It's example-based training of what's good and what's bad.\n\nAnd we -- and then we can that this technique of edge learning takes that very sophisticated pre-trained model and deploys it into very simple hardware that then is easily programmed. And if you have a chance to see demos either with us here or on our website, you can see that we can train these products and the Insight 2,800 is perhaps the best example. If it's so far -- we're just a few examples of good and bad, very simply programmed. So that's -- and this technology is the technology we've developed in-house.\n\nIt's proprietary to Cognex. No one else has it. in our market today. And our ability to apply that in a factory context, rather than in a kind of lab or a consumer-type context is, we believe, very powerful and something we continue to develop and think we have a significant lead in.\n\nWill Jellison -- D.A. Davidson -- Analyst\n\nThank you, Rob.\n\nOperator\n\nThank you. Our next question is coming from Damian Karas of UBS. Please go ahead.\n\nDamian Karas -- UBS -- Analyst\n\nHI. Good evening, everyone.\n\nRob Willett -- President and Chief Executive Officer\n\nGood evening.\n\nDamian Karas -- UBS -- Analyst\n\nCovered a lot of ground. Thanks for all the helpful details. And I'm sorry if I missed this, but related to your commentary about working down some of the broker premium costs from inventory. I'm just curious what's the spread between the spot purchases today and those inventory levels just to kind of give us a sense for the level of the gross margin tailwind that you should have ahead?\n\nPaul Todgham -- Chief Financial Officer\n\nYeah. Sure, Damian. So, this is Paul. It was smaller this quarter, but when it was at its worst, which was really Q4 last year, Q1, Q2 this year, it was about a 400-basis-point impact on our gross margin, give or take, 50 basis points or so.\n\nSo, very significant. And I do think as you're covering many companies, you hear a lot of talk about freight and component cost inflation and some element of broker buys. My read from studying our peers is we're sort of unique in this being such a large phenomenon. And partly, that's because we do airfreight already today.\n\nSo, we haven't been substituting ship for air like some peers or others in the automation industry have. And that we've been, I think, doing quite a good job of offset core component inflation with the pricing actions we took since implementing a pricing strategy sort of mid to -- around the summer of last year that we've been executing against. So, what it's been, this quarter, it was lower than that, maybe call it half of that or so. And I do expect to see that winding down, but we're going to be carrying some amount of that into the first half of next year.\n\nDamian Karas -- UBS -- Analyst\n\nOK. Great. And could you just remind us how much exposure you have in semis? And how should we think more broadly about the customer mix within consumer electronics? Thanks.\n\nRob Willett -- President and Chief Executive Officer\n\nYeah, broadly, semiconductor is about 5% of Cognex's business. It's been performing very strongly over the last year. So, it's probably a little north of that at -- yes, at the moment, like 7% or so. And yeah, it's – my take on it is we've seen a lot of strong investment.\n\nWe're going to kind of see that moderate for a while now. And then we're all reading about big investments that are going on in new regions. So, I expect that will start to come back later, but I'm not expecting that to be a factor next year for us. It will probably be in further years out.\n\nThat's my take on it at the moment.\n\nOperator\n\nDamian, do you have any additional questions? We'll move on to -- the next question is coming from Rob Mason of Baird. Please go ahead.\n\nRob Mason -- Baird -- Analyst\n\nYes. Good evening. Thanks for taking the questions. Rob, I wanted to see just real quickly, if you could maybe wrap up your geographic deep dive.\n\nWhen you mentioned the geographies in your prepared remarks, you called out some of the swing factors, logistics being one obvious. But when you spoke to Europe, you talked about a lower confidence level there, but you did not make a similar comment about Americas, and I'm just trying to understand if there's a distinction to be made there and if there's lower confidence in Europe, how it's manifesting itself right now?\n\nRob Willett -- President and Chief Executive Officer\n\nYeah. Hi, Rob. I think that's a good question. And I -- I think there is a difference.\n\nWhen you look at our Americas numbers, they look bad because of logistics, right? But if we peel that away, I mean, outside a few large logistics customers, we actually saw emerging strength in our Americas broader market. We actually saw the quarter business activity tracking ahead of our own forecasts. We saw larger products -- projects moving forward at a better rate than earlier in the year. We observed investments, I would say, more around kind of reshoring, relocating back to the Americas, in places, particularly such as Mexico.\n\nSo, we're a pretty strong player in the Americas market. And we were pretty pleased to see that, and it was perhaps stronger than we expected. And kind of in contrast to what some of the understandable challenges that they're seeing in Europe with their energy crisis and they're heavy reliance, I think, on internal combustion engine automotive, which is still something that I think is a drag in our markets there. It will turn around as EV investment starts to come in, but they're not there yet, nor are we there yet in America.\n\nRob Mason -- Baird -- Analyst\n\nThat's helpful. And within the Americas, you would just put that activity, that stronger activity under the umbrella of broader automation, you wouldn't necessarily call out any particular verticals.\n\nRob Willett -- President and Chief Executive Officer\n\nNo. I mean, automotive is a very important vertical for us in the U.S. So obviously, that's a part of it. But no, we saw general strength Yeah.\n\nYeah. We saw them. Yeah, yeah, definitely.\n\nRob Mason -- Baird -- Analyst\n\nOK. Very good. And just last question. The currency headwind that you noted for the fourth quarter, I'm not sure I would have modeled that high on my own, and it's a big step-up sequentially.\n\nIs that if we run that out, run currency -- current spot rates forward, would that be the type of currency headwind you would take into the first half? Or is there something unusual about the fourth quarter in your geographic mix?\n\nPaul Todgham -- Chief Financial Officer\n\nI don't know I haven't necessarily looked at the first half yet, Rob. But obviously, we'll be -- if I think about next year, we didn't have major currency impact in Q1 and Q2, we had a little bit. So, I think it will be moderated a bit by -- we did – year to date, we've had about 5 -- 4 points of currency year to date, 4 points in Q3. So, you can kind of back into Q1 and Q2 from that.\n\nSo, I would say that's a compare that we're not up against Q4 to Q4. So, it will moderate a little bit just based on that, I would say, Rob.\n\nRob Mason -- Baird -- Analyst\n\nOK. Very good. Thank you.\n\nOperator\n\nThank you. The next question is a follow-up coming from Joe Giordano of Cowen. Please go ahead. \n\nJoe Giordano -- Cowen and Company -- Analyst\n\nAppreciate it. Let me take a quick follow-up here. Rob, you mentioned logistics, you think maybe the bigger opportunity for you is in Europe and Asia? Is that any meaningful percent of your logistics business at this time? And what's like a realistic time frame if it's not, when it could be?\n\nRob Willett -- President and Chief Executive Officer\n\nYeah. I mean we have a nice and growing business in logistics outside the Americas. I'm not sure I'm ready exactly the size for you at this point. But no, they're starting to be significant and where Asia definitely is large and getting large and as is Europe.\n\nSo, yeah, that's -- and then we've had success with some large customers here in America, which has kind of skewed our business here. But obviously, we're an American company, and we have great resources we can deploy quickly here. So, it's not unusual to see growth start first here and go elsewhere. But now, we're building off a nice base of business in both those markets, and we're starting to see sophistication around e-commerce fulfillment and other logistics markets there.\n\nSo we're feeling positive about those.\n\nPaul Todgham -- Chief Financial Officer\n\nAnd Joe, the only thing I would add is although most of our large customer business is concentrated in the Americas, it isn't exclusive of the Americas. So, there may be a little bit of noise in the numbers, for instance, in Q3, logistics was a contributor -- the biggest contributor to our revenue decline in Europe, and that was more large customer activity than the broader base of business that we've been growing and continue to grow.\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nOK.\n\nOperator\n\nThank you. This brings us to the end of the question-and-answer session. I would now like to turn the floor back over to Mr. Willett for closing comments.\n\nRob Willett -- President and Chief Executive Officer\n\nWell, thank you for joining us tonight, and thanks for a very engaged discussion. We appreciate it, and we look forward to speaking with you again on next quarter's call. Good night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSusan Conway -- Senior Director of Investor Relations\n\nRob Willett -- President and Chief Executive Officer\n\nPaul Todgham -- Chief Financial Officer\n\nJoe Giordano -- Cowen and Company -- Analyst\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nJake Levinson -- Melius Research -- Analyst\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nJairam Nathan -- Daiwa Capital Markets -- Analyst\n\nWill Jellison -- D.A. Davidson -- Analyst\n\nDamian Karas -- UBS -- Analyst\n\nRob Mason -- Baird -- Analyst\n\nMore CGNX analysis\n\nAll earnings call transcripts"
}