{
  "companyName": "Inseego Corp.",
  "companyTicker": "INSG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/inseego-corp-insg-q2-2022-earnings-call-transcript/",
  "content": "Inseego Corp. (INSG 2.87%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nHello, and welcome to Inseego Corp's second quarter 2022 financial results conference call. Please note today's event is being recorded. All participants today will be in a listen-only mode. [Operator instructions] After today's presentation, there will be an opportunity for analysts to ask questions.\n\n[Operator instructions] On the call today are Ashish Sharma, CEO; and Bob Barbieri, chief financial officer; and other members of the management team. During this call, non-GAAP financial measures will be discussed. A reconciliation to the most directly comparable GAAP financial measures is included in the earnings release, which is available on the investors' section of the company's website. An audio replay of this call will also be archived there.\n\nPlease also be advised that today's discussion will contain forward-looking statements. These forward-looking statements are not historical facts, but rather are based on the company's current expectations and beliefs. For a discussion on factors that could cause actual results to differ materially from expectations, please refer to the risk factors described in our Form 10-K, 10-Q, and other SEC filings, which are available on our website. Please also refer to the cautionary note regarding forward-looking statements section contained in today's press release.\n\nAt this time, I would like to turn the call over to Ashish Sharma, CEO. Please go ahead.\n\nAshish Sharma -- Chief Executive Officer\n\nThank you, operator, and welcome to Inseego's Second Quarter Fiscal 2022 Earnings Call. We had a solid quarter with revenue of $61.9 million and an adjusted EBITDA loss of $1 million. Importantly, we saw our gross margin improved to 29.5% in Q2. This is a reflection of our long-standing focus on 5G products and improving our mix toward higher-margin recurring revenue.\n\nFrom a business perspective, what we are most excited about is that we started to see several enterprise customers convert 5G pilots into full-fledged large multilocation deployments. This progress within our enterprise business and our growing pipeline of opportunities are a few of the key things that underpin our confidence in a strong second half of this year. Before highlighting how our business is evolving, I want to touch on a few things. First is our drive to generate positive free cash flow.\n\nWe remain disciplined with respect to investments in our business and anticipate improved operating leverage now that we have a number of key product certifications behind us. Further, between the growth in our higher-margin businesses and a keen eye on our costs, we can see Inseego approaching free cash flow breakeven by the end of this year. Second is the importance of the $50 million credit facility we just closed. This facility gives us ample capacity to fuel the growth we see later this year and into 2023.\n\nBob will touch on both of these shortly. Lastly, we believe 2022 represents a positive inflection point in our business. For the last few years, we've discussed the promise of 5G and the impact it will have on end customers. While it has taken longer than we would like, we are finally starting to see that promise become a reality.\n\nHow so? From two perspectives, from our carrier partners as their 5G network coverage improves dramatically and from end-user customers who can now benefit from these high-speed networks and are making purchase decisions for 5G deployments. Our broad suite of 5G solutions positions us well to capitalize on the long-term trends we expect to play out over the next five years. So on to the exciting developments, we are seeing in our enterprise business. There are two key drivers.\n\nFirst are the new C-Band rollouts, which many believe creates an ideal balance of range, penetration, and speed for carriers and their customers. This allows 5G to solve last-mile issues with a lot more network capacity in areas where fiber just isn't feasible. This is critical for businesses with distributed sites and workforces. We are certified for the C-Band rollouts with all the major carriers in the U.S., and we are working together to bring these services to enterprise customers.\n\nSecond is the introduction of new cost-effective 5G data plans for businesses. As an example, we saw that T-Mobile announced their new 5G for business data plans in May of this year. This is proving to be a significant catalyst for enterprise adoption of 5G for fixed wireless access. Now let me outline the progress through the three different routes to markets we are pursuing.\n\nFirst is our stock business. This is where T-Mobile purchases our products directly and delivers to their customers. We are already seeing significant customer activity through this effort and continue to build a new pipeline of opportunities. As a reminder, our Wavemaker 5G indoor router FX2000 has been stacked and available to T-Mobile's business customers since November of last year.\n\nRecently, we have seen activity levels increase dramatically. Also, we've had Fortune 500 retail customers convert from pilots into full-scale deployments. Moving forward, we expect our pipeline to continue to grow with improved sell-through as T-Mobile sales teams reach more end customers. This will result in significant restocking of the FX2000 with T-Mobile over the balance of the year.\n\nSecond is what we call sell rate, where we jointly sell our entire 5G FWA portfolio alongside T-Mobile sales force. We've sold our product to over 400 distinct new customers since the launch. I will provide some examples in a bit. As many of you are aware, our ability to capture new enterprise customers has the potential to completely transform our business.\n\nHow? Simply put, these sales carry significantly higher product margins than when sold under the stock program. Most importantly, these sales also have very high software attach rates. This means we can earn recurring revenue each month for every device over a multiyear contract period. Capturing our fair share of this emerging enterprise 5G FWA market is one of the ways we see Inseego delivering increased revenue growth, improved gross margins, and sustainable positive free cash flow.\n\nAnd third is our VAR channel. As previously mentioned, C-Band delivers much more capacity for bandwidth-intensive business applications. This makes the availability of C-band a key driver for FWA adoption here in the U.S. Importantly, we now have multiple 5G FWA products certified with both AT&T and Verizon.\n\nWorking with their top partners, we have started shipping initial orders and have already started to build a large pipeline of enterprise opportunities with both of these carrier customers. We believe we are the only company with such a broad portfolio of purpose-built 5G FWA products that are C-Band certified. This places us in a very unique position in the market. So that's how we go to market.\n\nNow let me touch upon some examples of 5G enterprise FWA use cases so you can better understand the scope and scale of the opportunity. Now, where are we seeing traction? It's in the verticals where there is a need for primary connectivity for remote workforce, branch office connectivity, distributed sites, and security and remote management. That means construction, retail, healthcare, education, utilities, manufacturing, and logistics. In the construction sector, for example, we are seeing interest from national homebuilders where our 5G FWA solutions are ideal for remote work sites and for development projects in the field where fiber just isn't available.\n\nIn the retail sector, a handful of nationwide and regional customers have trialed our products and are now commencing rollouts. These deployments can range in size from hundreds of locations to thousands. Another prospective customer with an employee base of 120,000 is preparing to test our solutions for their remote workforce. Then we have a large national retail chain and a leading car rental agency trialing our solutions for secure and reliable primary connectivity in both rural and urban settings.\n\nIn Europe, we are now in pilot with a smart traffic light manufacturer, a leading gas supplier who is leveraging our solutions to manage remote sites, and a large paper and recycling company to enable their smart warehouse initiatives. Let's turn our focus to our expanded software portfolio. Building upon our best-in-class portfolio of 5G fixed wireless devices, we recently launched our 5G SD EDGE solution. This expands our software capabilities beyond cloud management to complete corporate IT management.\n\nWith Inseego's 5G SD EDGE, enterprises now have the tools to secure, automate and orchestrate the management of their wireless wide area networks, much like they do with their wide LAN. While W-LAN was primarily used for backup connectivity in the 4G world, 5G offers significantly more capacity, which, combined with an increasing need for segregated networks and workflows to combat security threats, will drive significant adoption of 5G W-LAN for primary connectivity. We believe this solution will offer a much more simplified approach to enhance security and network policy management compared to traditional on-premise WAN management solutions. We are already in pilots with multiple customers, and we expect our first launch customers this quarter, much like our other software offerings attaching 5G SD EDGE to our enterprise sales will further increase our subscription revenue streams, increase customer stickiness and expand our gross margin.\n\nOf course, we will have plenty more to talk about it as it leads to our software stack in time. This includes our ongoing efforts to enhance and integrate our existing Ctrack applications into our 5G edge cloud. Before I turn it over to Bob, I just want to mention one more important launch. While our growth aspirations are clearly aligned with enterprise adoption of 5G FWA, we continue to deliver new innovation and best-in-class mobile connectivity products to market, as we've always done.\n\nWe are launching the MiFi X PRO. This marks the third generation of our 5G mobile hotspot and the company's 10th generation MiFi since inception. A Tier 1 carrier in North America will be the first customer to roll out this product in Q3. I'm also very happy to report that another Tier 1 carrier, Telstra in Australia, will be launching this solution soon as well.\n\nOur mobile hotspot product line continues to be the preferred choice for business customers looking to power their mobile workforce. This is primarily due to the industry's best performance and advanced security we provide in our hotspots. I want to thank our employees for their dedication and pursuit of our strategic imperatives. And I would now like to turn the call over to Bob, who will provide more details on our Q2 results.\n\nBob Barbieri -- Chief Financial Officer\n\nThank you, Ashish. Let me now review the results of our second quarter fiscal 2022. Please note that all metrics and comparisons made are non-GAAP on a pro forma basis, adjusting for the divestiture of Ctrack South Africa, which was completed in July 2021. Please refer to our earnings release for additional details on the GAAP to non-GAAP reconciliation.\n\nQ2 revenue was $61.9 million, up 6% from the prior year and up slightly on a sequential basis. Our growth reflects continued strong demand for our 5G solutions and increasing traction with enterprises, particularly offset by anticipated declines in 4G products sold directly to our carriers. Next-generation solutions, which are comprised of 5G devices and all of our cloud software assets, increased 25% over Q2 fiscal 2021 and represented 66% of total revenue in this quarter as compared with 50% of revenue in the year-ago quarter. Second quarter IoT and mobile solutions revenue was $55.2 million, up 7% from the same period last year.\n\nSimilar to Q1, our growth was again driven by demand for our 5G mobile hotspots, further uptake of our solutions by enterprise customers, and steady growth in our attached software revenue, which partially offset by declines in our 4G product sales. Enterprise SaaS solutions revenue was $6.7 million, which was relatively flat on a sequential and year-to-year basis. As noted last quarter, we're in the process of enhancing our software assets and integrating them into our 5G edge cloud. Consolidated gross margin was 29.5%, up from 27.3% in Q1 and 28% in Q2 of last year.\n\nGross margin for IoT and mobile business was 27.4%, an increase of over 300 basis points from 23.9% in the prior period and 24% in the prior quarter. The gross margin improvement on both a sequential and year-over-year basis reflects a higher mix of enterprise sales. Gross margin for the enterprise SaaS segment was 47.8%. Q2 non-GAAP net loss was $9.5 million or $0.09 per share, an improvement from a loss of $0.11 per share in the prior quarter and a loss of $0.08 per share in the year-ago quarter.\n\nWe reported an adjusted EBITDA loss of $1 million, which was up from a loss of $3.3 million in Q1 and $1.7 million loss in the year-ago period. The change was largely due to the combination of higher revenue and gross margin arising from our increasing mix of enterprise sales. For additional details on our non-GAAP and adjusted EBITDA results, please refer to the reconciliation tables in our press release. Cash, cash equivalents, and restricted cash at the end of Q2 was $24.4 million.\n\nWe note that our cash balance last quarter was bolstered by an early payment by a carrier customer. This quarter, our receivables return to a more normalized level, and we significantly reduced our accounts payable balance. For the balance of the year, we expect our quarterly cash usage to be significantly lower than in Q2 as our revenue growth reaccelerates, and we remain disciplined with our investments in operating costs. As Ashish mentioned, we're making significant strides toward our goal of being free cash flow positive and expect to approach breakeven by the end of 2022.\n\nWe believe our current cash position is sufficient to carry us through the transformation to an enterprise 5G company, but also want to ensure we have substantial financial flexibility. As announced today, we have closed on a working capital line of credit that provides us with up to $50 million in liquidity, of which $4.5 million was drawn at closing. This facility was available to us based on the nature of our receivables being largely from high-quality investment-grade customers with long tenures and with seller payment records, as well as the quality of our inventory. This line of credit provides us flexibility to support our customers and the growth we expect this year and into 2023.\n\nWith that, let me turn it back to Ashish for his closing comments.\n\nAshish Sharma -- Chief Executive Officer\n\nAnd I hope you can see from our comments the promise of 5G is becoming a reality, and we are uniquely positioned to capitalize on its rollout years to come. We are focused on continuing to provide best-in-class solutions to our carrier partners and, increasingly, to enterprise customers through our 5G FWA and software solutions. We made continued progress against our key initiatives in Q2 with our key carrier partners now starting to turn their attention to 5G enterprise FWA and the successful launch of our next generation of 5G products we are primed for a strong second half of 2022. As more and more of our enterprise pipeline move toward purchase and deployment in the coming quarters, we expect to benefit from a high attach rate of software sales, which will ultimately help us to continue to improve margins and profitability and to generate positive cash flow.\n\nInseego is at an inflection point, and we look forward to keeping you updated on our progress in future quarters. Before we move on to the Q&A, I'm very pleased to announce that Jeffrey Tuder has been elected chairman of the board. Jeff's extensive industry knowledge, combined with his unwavering integrity and expert judgment, have been invaluable since he joined the Inseego board in 2017. Jeff is the perfect choice for chairman of the board, and I'm confident that he can help lead the company into the future.\n\nNow, let's go to Q&A.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] Today's first question comes from Tore Svanberg with Stifel. Please proceed.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nYes. Thank you. And congratulations on the continuous progress here. Ashish, I know it's hard to quantify, obviously, the second half, but you referenced a very strong second half.\n\nCan you put some numbers or certain metrics around that? And maybe as related to that, what would be the breakeven point given the higher gross margin now?\n\nAshish Sharma -- Chief Executive Officer\n\nHey, Tore. Hope you're well. Good talking to you. And look, this is the business transformation that we've all been waiting for, right? And this quarter, you start to see us move to the next phase of the company where you could see clearly the margin bump we got with our new enterprise business that we've been working for quite some time to stand up.\n\nWe've had the portfolio and the products all ready to go for quite some time. And now with the carrier push on the new 5G at the Blair plants, particularly targeted toward enterprises, you start to see those results come through. And that's the main driver, along with the next-gen hotspot launches. That's making us so optimistic about the second half of this year.\n\nSo those are the two different engines that we did not have in the first half of the year, and that's what's changing here. I think your second question about at what levels we get to breakeven, I mean, I would say, Tore, it's still a very early 5G market, right? So, we've got a lot of customer traction. Enterprise customers are loving the product, but they're all individually still assessing and figuring out their own plans on how to roll out the deployment. We started to see some do it this quarter, and that shows in the results.\n\nSo, it's hard to pinpoint a fixed number. But directionally, what we see, what we saw this quarter, and if we stay with that same pace, then we're very comfortable that come the end of this year we'll be getting very close to breakeven on the positive cash flow.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nVery good. And as a follow-up, the IoT and mobile business, about $55 million. Can you give us a sense for the mix there now between both 4G versus 5G and also what the percentage is related to enterprise?\n\nAshish Sharma -- Chief Executive Officer\n\nYeah. I would say, Tore, majority of the enterprise is on 5G. There's very small number in there for 4G. All of the enterprise is 5G, and the rest, all of the revenue there is really hotspot.\n\nSo, I would say that the growth that we are seeing is in the right areas. It is with 5G, and it is with and FWA and the hotspot, and in this quarter has been pretty steady with what we've seen in the previous quarters.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nVery good. Just one last question for Bob. Bob, the inventory, obviously, was up quite a bit. You're at 98 days right now.\n\nAnd I was just hoping you could talk about that particular build. Is this in anticipation of the second half? Or is there anything else sort of all the moving parts going on there?\n\nBob Barbieri -- Chief Financial Officer\n\nI think there's a couple of things, Tore, and thank you. One is certainly we don't want to signal an anticipatory large ramp. Certainly, we can't wait for that to happen. But we've moved a lot of our shipping to kind of manage our cost stack back to ocean.\n\nAnd so, what that has done is kind of slowed the pace of the inventory coming in, but temporarily has raised the inventory balance, but we believe that cost trade-off is beneficial to our margins.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you, very much.\n\nAshish Sharma -- Chief Executive Officer\n\nThank you, Tore.\n\nOperator\n\nOur next question comes from Scott Searle with ROTH Capital. Please proceed.\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nHey, good afternoon. Thanks for taking my questions. Maybe to follow up on Tore's question, Ashish. In terms of the visibility in the outlook, is there anything that you could help us quantify in terms of what you're seeing in that backlog or that pipeline in terms of the size, magnitude, number of customers, maybe the size of deals, and particularly on the enterprise front? And then I had a couple of follow-ups.\n\nAshish Sharma -- Chief Executive Officer\n\nOK. Hey, Scott, good talking to you. So, a couple of data points I can point, right, the size of the pipeline through the three different routes to markets you've got, I would say the size of the pipeline is like triple quadruple since we last spoke, right? So, we're on a very fast pace of getting products out to a lot of customers and engaging them in trials, the pilots, and starting to now convert them into full deployments. So that's one number, I would say that the pipeline is super strong.\n\nThere is a lot of interest. And I would just say that the networks that we are seeing, right, the C-Band network from Verizon and AT&T and then the mid-band network from T-Mobile are incredible. I mean the performance is just simply incredible. So that gives us just a great view into what's to come here in the second half of the year and then move into next year.\n\nAnd I would say, look, the opportunity size could go from small units for trials to a couple of hundred units for pilots to a few thousand units all the way up to -- I think I mentioned one large customer has got a workforce of over 100,000 employees, right? So, work from -- remote solution that could be pretty significant for us. So, I think the pipeline consists of all different sizes of these customers. And I would just say another data point is we closed some initial customers in Q2 with very sizable opportunities where they're rolling out 5G FWA at thousands of their locations over the balance of this year.\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nOK. Very helpful. And Ashish, if I could follow up on that, just in terms of the sales cycle there and deployment cycle, could you help? It sounds like things are accelerating, but is there a timeline you put around that in terms of the digestion period now? Is it 90 days? Is it 180 days? Is it compressing then going forward?\n\nAshish Sharma -- Chief Executive Officer\n\nYeah. I would say that the purchasing decision could be made anywhere from 30 days to several months. It really depends on the purpose of the rollouts, and there are different purposes each customer has. But in general, I would say, on average, the customers are going from pilots into full deployment between three to six months.\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nOK. Great. And if I could, just on the financial front, Bob. Any 10% customers in the quarter? I know you typically had big numbers from Verizon and T-Mobile.\n\nI'm wondering what the percentages were there. And on the opex front, R&D has come down. Is that the sustained level that we should be assuming? Or is there a bit of an inflection? Because I think software capitalization has kind of bottomed out now at a lower level. I'm assuming that there are no changes on that front.\n\nOr how should we be thinking about R&D going forward into the second half? Thanks.\n\nBob Barbieri -- Chief Financial Officer\n\nYeah. Thanks, Scott. And first, let me answer the second -- I'll just start with your first question. Certainly, we had the same two customers.\n\nYou mentioned Verizon and T-Mobile, both over 10%, so not much different than what we've seen in the past. And those combined for generally over 50%. And that's been kind of a similar pattern, so no unique change there. With respect to R&D, yeah, we've kind of managed -- I think in prior calls and when you've been with us personally, we talked about a significant reinvestment for the 5G opportunity.\n\nSo, we've done that. And then so our new R&D spend rate is kind of enhancing that. And you're looking at what I would consider the new normal. So, we're not looking for any more inflections up.\n\nIf anything, perhaps slight moderation down as we kind of digest what we've already done. And so anyway, that's kind of the look of the opex. I just want to add one thing. That's also consistent with what we previously spoke of that, as the company grows, not a lot of new opex is required.\n\nSo we could see that kind of driving the bottom line and the cash generation.\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nGreat. Thanks so much. I'll get back in the queue.\n\nAshish Sharma -- Chief Executive Officer\n\nThanks, Scott.\n\nOperator\n\nOur next question comes from Mike Walkley with Canaccord Genuity. Please proceed.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nThanks for taking my question. Good to see a little uptick on the gross margins with the mix. Just building on that, longer term, where do you see maybe fixed wireless as a mix relative to hotspots versus where it is today? And how's that changes, where could gross margins trend to from the current business run rate?\n\nAshish Sharma -- Chief Executive Officer\n\nHey, Mike, this is Ashish. So let me take that. So obviously, we're just beginning with this, right? We've been primed up for this for the last couple of years. We made the investments.\n\nWe built a portfolio. We believe the size of the FWA market is significantly larger. And I'm talking particularly the enterprise market, not the consumer market. The FWA -- 5G FWA enterprise market is significantly larger than the market that we had access to before with the hotspots.\n\nSo, we believe, for us, as the market ramps up here, I mean, we just saw one large carrier pushing FWA hard. And then we got Verizon is coming back strong here with C-Band and the build-out they're doing and the plans they are coming out with. Then we have international markets still tracking a little bit behind, but they're all going to come online over the next, whatever, 12 months or so. So, you start to see that FWA for us becomes a lot more meaningful.\n\nAnd it's not just the size of the market from a hardware perspective. It's the ability to sell a complete stack up there. We're selling cloud on top of that. And then now we've got this 5G SD EDGE solution, which is a complete security and enterprise management solution on top of cloud management.\n\nSo, we get that opportunity to sell a lot more layers of solution on enterprise. So, for us, that's a great market, and it's not years out. It's starting to happen now. And we think over the next several quarters it's going to start to -- continues to steadily ramp up every quarter.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nGreat. Thanks. And Ashish, just on that, how do you view your competitors in that market? And you have Cradlepoint who was bought by Ericsson going after some of the same enterprise. You talked about wireless was a spot and they have a 5G router and gateway business.\n\nSo how do you view the competition? And what's the feedback on why you guys are differentiated and winning some early business?\n\nAshish Sharma -- Chief Executive Officer\n\nYeah. Great question, Mike. So first off, right, just by the virtue of a very sizable, very large market in the making here, there would be a lot of competition, and that's great. It's good to have a sizable market where you can play in.\n\nI mean a couple of different competitors you mentioned have slightly different focus than the focus we provide and the approach we provide to those customers. Our differentiation is a couple of things. One, you look at the best -- and we provide and build the best of the best of the modem in the industry, and we always have the latest 5G technology in the mix, right? And the most economical price point to those enterprises because we're not building the clunky old type of SD-WAN boxes with heavy interprocesses and all that. We don't do that.\n\nWe build a very thin edge, which performs the best way. It gives you the access to the best pipe to the 5G networks. And on top of that, the solutions I'm talking about, in particular, the 5G SD EDGE solution, it's a major disruptor in the market because the economic value prop we are providing to the end customer with the ease of use is unparalleled in the market today. Nobody has a security and a distributed networking solution like that in the industry.\n\nThat's our differentiation.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nThat's great. And last question for me. You touched on it earlier with T-Mobile on pricing. Can you just talk about the carriers and what you're seeing in terms of how they're going to price it to the enterprise and that timing of when it might help the market even take off faster?\n\nAshish Sharma -- Chief Executive Officer\n\nHey, Mike, that's already started, right? So, in Q2, T-Mobile already released multiple very compelling business plans, and that's been the catalyst for the progress we started to see this quarter. I understand the same. And then we're starting to see other carriers internationally and domestically all work through those plans, which are directly tied to the mid-band or upper band rollouts, right? So, they need more spectrum to be able to put better compelling plans, and that's what they're really working toward. And like I said, early days, but look, the opportunity is significant.\n\nThe performance of those networks on the mid-band is just incredible.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nOK. Thanks. One last one, I'll pass on -- just any supply issues to worry about in the second half? Or do you feel pretty good about component availability to meet your second-half potential ramp?\n\nAshish Sharma -- Chief Executive Officer\n\nNo issues, Mike. I mean the thing I would highlight is we still continue to operate in an elevated cost -- supply chain cost environment. But we've done a remarkable job, our ops team has done a remarkable job managing the supply. And that's one of the reasons a lot of our carrier customers love us because we've always been there.\n\nWe've had the product, and we've managed the supply chain really well going back to the beginning of the pandemic a couple of years ago.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nGreat. Thanks for taking my questions.\n\nAshish Sharma -- Chief Executive Officer\n\nThank you, Mike.\n\nOperator\n\n[Operator instructions] The next question comes from Mike Latimore with Northland Capital. Please proceed.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nHi. This is Aditya on behalf of Mike Latimore. Could you give some color on if the inflation, on the recessionary fear, are having any impact on your enterprise SaaS business?\n\nAshish Sharma -- Chief Executive Officer\n\nHey, Aditya, this is Ashish. Let me try to address that. So first off, I would say that, yeah, we see the macroeconomic environment out there, a lot of fear of the inflation and what happens to the broader economy. I would say that we're really not seeing an impact of that on our business.\n\nAnd perhaps the reason is look at the industries we are starting to serve now with the 5G FWA business. I talked about the education market. I talked about construction, healthcare, utilities, manufacturing. And you look at these industries we serve, these are all essential industries, right? So, we're bringing a very disruptive economical WAN solution with complete security stack through 5G into those markets.\n\nSo, for these customers, this is a much better and economical way to deploy the WAN services and the broadband services. So, to me, we're not seeing any impact of the macroeconomic environment on our business or on our customer pipeline.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nAll right. Could you also tell me what the current headcount is and what do you expect it to be by the end of the year?\n\nAshish Sharma -- Chief Executive Officer\n\nI would say, Aditya, the current headcount is we've got some offshore contractors and permanent headcount, but it's -- I would say it's in the range of a little north of 500 employees.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nDo you expect that to increase by the end of this year?\n\nAshish Sharma -- Chief Executive Officer\n\nNo. No, we're managing our costs very well. And like Bob said earlier, we've got the team in place, and we've got our channels in place. We don't expect to increase that.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nAll right. Fine. Thank you.\n\nAshish Sharma -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAt this time, we are showing no further questioners in the queue. And this concludes our question-and-answer session. I would now like to turn the conference back over to Ashish Sharma for any closing remarks.\n\nAshish Sharma -- Chief Executive Officer\n\nThank you, operator, and thank you, everyone, for joining us on the call today. We look forward to updating you all next quarter on our continued progress. Thank you again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAshish Sharma -- Chief Executive Officer\n\nBob Barbieri -- Chief Financial Officer\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nMore INSG analysis\n\nAll earnings call transcripts"
}