{
  "companyName": "Outbrain Inc.",
  "companyTicker": "OB",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/outbrain-inc-ob-q2-2022-earnings-call-transcript/",
  "content": "Outbrain Inc. (OB -1.90%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to Outbrain Inc.'s second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Anthony [Inaudible]. Thank you, and over to you, sir.\n\nUnknown speaker\n\nGood morning, and thank you for joining us on today's conference call to discuss Outbrain's second quarter 2022 results. Joining me on the call today, we have Outbrain's co-founder and co-CEO, Yaron Galai; Co-CEO David Kostman; and CFO Jason Kiviat. During this conference call, management will make forward-looking statements based on current expectations and assumptions. These statements are subject to risks and uncertainties that may cause actual results to differ materially from our forward-looking statements.\n\nThese risk factors are discussed in detail in our Form 10-K filed for the year ended December 31st, 2021, as updated in our Form 10-Q for the quarter ended March 31, 2022, and in our subsequent reports filed with the Securities and Exchange Commission. Forward-looking statements speak only as of the call's original date, and we do not undertake any duty to update such statements. Today's presentation also includes references to non-GAAP financial measures. You should refer to the information contained in the company's second-quarter earnings release for definitional information and reconciliation of non-GAAP measures to the comparable GAAP financial measures.\n\nOur earnings release can be found on our IR website, investors.outbrain.com the News and Events section. With that, let me turn the call over to David.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nHi, and good morning. We are pleased to report that despite continuing macroeconomic headwinds, we delivered on the guidance we provided for Q2, with extra gross profit of $59.3 million and adjusted EBITDA of $5.9 million. We also grew revenues by 2% or 6% on a constant currency basis. At a high level, on the one hand, we are gaining significant market share with media owners.\n\nWe are growing our number of active advertisers, and we are growing our number of engagements with users. So overall positive metrics. At the same time, the worsening macroeconomic environment and declines in the advertising market are negatively impacting our financial results. Therefore, operationally, we are focused on making the long-term investments that will position us to be stronger coming out of this downturn and also at the same time, deepening our cost reduction efforts to drive efficiency.\n\nLet's move to our business and start with the supply side. We have continued to win significant market share with new large month-year publisher deals. These wins greatly increase our supply footprint and set the company up for much faster growth when advertising demand recovers. In Q2, we launched our partnership with several new large publishers, which we have previously announced, such as Axel Springer.\n\nAnd we also launched a direct-to-device partnership with Xiaomi on the platform side. We renewed long-term deals with many publishers, including MediaMath, Box, Scripps, and others. We're expanding on existing published outages by leveraging our acquisitions to grow our footprint in one of our core expansion areas, high-quality brand-safe video placement, any programmatic channels, leveraging many years of experience with our business technology. We have implemented our quality rating with several large publishers and are getting positive feedback as to the impact on quality and now PM.\n\nAlso, post quarter, we extended our global momentum of premium publisher wins to the U.S. And in August, we signed a multi-year exclusive agreement and launched on a top U.S. publisher. By adding this publisher, we are now the exclusive content recommendation partner of four of the top five editorial news publishers in the U.S.\n\nBy the way, the fifth is doing an in-house solution. So if there is a must-be open web feet for advertisers in the U.S., Outbrain it is. We expect to announce additional major wins in the near term. A few words about the short-term impact of this tremendous supply growth.\n\nThese are typically multi-year deals, and we model and analyze them looking at the totality of the potential length of the partnership. We are choosing to gain as much smart market share locked on the long-term contracts. However, the initial rollout and getting to full optimization can take time, and combining this with softness on the advertiser side, is negatively impacting our short-term results, as you will see from our guidance. On the technology and Algofront, Smartlogic adoption on our core network continues to grow, comprising over 80% of mobile and over 50% of desktop partner integration.\n\nWe are continuously improving the performance of Smartlogic and believe this is one of the key differentiators in our publisher wins and that this platform will continue to support our growth. Now, let me turn to the demand side. We continue to see demand softness in the industry and significantly drive down pricing. Compared to last year, we've seen high double-digit year-over-year declines in CPCs, also impacted by foreign exchange.\n\nBut our advertiser base has expanded, our co-engagement metrics have grown year over year, delivering growth to our performance marketers, and we are seeing great progress in our direct business with enterprise brands, which grew by double digits in Q2. As we mentioned in previous calls, we are focused on expanding our brand business. Our quality focus is helping us land brand budgets and wind premium publishers who are looking to improve their user experience and limit certain categories of performance advertisers. This type of brand budgets, particularly in Europe, where brand and agency budgets account for more than 60% of our demand are more impacted in the short term by the softness in the market, but we believe this is the right long-term direction for our brand as the premium quality player in the market.\n\nTo further support this effort, we launched an initiative this quarter called Brand Studio. A dedicated team and resource hub designed to enable these major brands to quickly get up and running with successful campaigns on Outbrain's platform for maximum engagement and memorable interactions. Currently, we are working with a globally recognized food and beverage brand, along with the premium auto brand for this new offering. According to our internal data, initial results for the premium auto brand show more than three times higher engagement than benchmarks for comparable formats in the auto category and 18% more dwell time across the publisher page compared to industry benchmarks.\n\nLet me sum up. We ended another quarter on target and are building and investing in the future. That said, we remain very cautious about our ability to accurately predict the future macro impacts on the business. Conditions have deteriorated globally, but we are particularly impacted by our large presence in Europe and Japan, which account for over 40% of our revenues and were results of further negatively impacted by exchange rates.\n\nTherefore, as you will hear from Jason, we are revising our outlook downward at this time. I'm personally disappointed to be in such a position, but these are difficult times in terms of the high level of uncertainty as to the outlook. Having on to cycles, these kinds of uncertainty and challenges provide a real opportunity to recalibrate and make sure we act in a fiscally responsible manner. I believe that we will come to dispute as a stronger and more disciplined organization.\n\nWe have made adjustments to our cost base, responding to this environment which Jason will elaborate on, and we continue to monitor the trend. We are focused on controlling the things we can control, and we are focused on making the long-term investments that will position us to be stronger coming out of this downturn. From a strategic perspective, the supply wins in H1 and our competitive position in major markets is a great testament to the strength of our technology, our monetization and engagement capabilities, and the quality of our trusted partnerships. While the current macroeconomic situation is challenging, we also see it as a driver of opportunity to lock up gains in supply that we expect will pay off for our shareholders when economic conditions stabilize and we see stronger demand.\n\nWe believe that the secular trends driving our industry, such as the shift of marketing budgets to digital, the importance of more measurable results for advertisers, and the duplication of third-party cookies provide Outbrain with tremendous opportunities. We believe that continuing to focus on our core business, our commitment to premium publishers, and expansion of quality brand and agency advertising is the right one for our shareholders. So despite the headwinds, we will remain focused on investing in our top growth area. We have a strong balance sheet with over EUR 150 million of net cash to support our growth strategy.\n\nWe believe our long-term investment thesis is compelling and we have great conviction in the opportunity in front of us. With that, I will turn it over to Yaron.\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nThanks, David. Before I update about Keystone, I want to explain some of our framework for managing the two-sided marketplace that David mentioned. It's especially important to understand how our marketplace operates at times of macro demand uncertainties. We like to think of our two-sided marketplace using the bed and blanket metaphor.\n\nThe bed symbolizes our supply partnerships while the blanket symbolizes the advertising budgets we bring in to cover the bed. In \"normal times\", the blanket and the bed are well matched, resulting in strong yields for us and for our partners. We typically grow our bed and bigger longer-term step changes by signing new partnerships. We then, over time, enlarge our blanket by adding more advertisers and over time, expanding their budgets.\n\nThe macro headwinds right now are making the blanket side harder than usual to predict. But we're still bullish on our ability to grow our advertiser blanket into the future when those headwinds see. The indicator we look at internally is our ad coverage, which historically was at right about 100%. That is also currently the case.\n\nWe cover our entire bed with blanket, albeit right now with softer pricing. That's a typical demand-supply in balance. This indicator is at the core of how we're intentionally building our bed blanket for growth. We view this period as a great opportunity to play offense on the bed-building side by locking more long-term partnerships at an accelerated pace.\n\nYou can see that in our growth of new business, which was at roughly 10% in the first and second quarters. These are higher than the roughly 7% growth of new business that we've seen for quite a few of the preceding quarters. To summarize this, I'll focus on our land-and-expand approach, we're confident in our ability to expand our partnerships over time as macro conditions stabilize and advertising demand rebounds. We gained that confidence by the fact that we're at roughly 100% ad coverage albeit a softer pricing rates right now.\n\nAnd therefore, we're using this macro environment to focus on accelerating the land part. This approach is somewhat contrarian. It would probably be easier to slow down the growth of new supply and to make the blanket feel thicker or yield higher. But we believe that leveraging periods like this as opportunities will serve Outbrain's shareholders well in the long term.\n\nThis enhanced investment in our publisher side is a good segue to our next topic. I'm excited to update you on our progress with Keystone, which you may recall, we introduced on our last earnings call. As a reminder, Keystone is a platform for maximizing media owners overall diverse business outcomes while optimizing the user journey and experience. Keystone introduces the new business model for Outbrain and will be delivered as software as a service solution.\n\nWe will be formally launching the product later this quarter. We initially rolled it out with two early design partners, including a very large U.S. news publisher. The technology puts Outbrain higher up on a publisher's value chain, expanding it way beyond the advertising layer.\n\nI'm now excited to update that we've doubled to four design partners, including our first one in Europe, a premium financial publisher. We're continuing to work with these early design partners to develop it into the best user journey optimization platform for media owners. Keystone is an investment in extending the strategic value we bring to the media owners we work with. Now, as many of them seek to diversify with new sources of revenue such as subscriptions and e-commerce, our Keystone technology will be well positioned to perform the same best-in-class optimization as it has been doing for editorial content and ads for many years.\n\nAnd with that, I'll hand it over to Jason Kiviat, our CFO, to discuss the financials this quarter.\n\nJason Kiviat -- Chief Financial Officer\n\nThanks, Yaron. As David mentioned, we achieved our Q2 guidance for both ex-TAC gross profit and adjusted EBITDA despite seeing further deterioration of demand beyond the levels we shared on our last call in May. Revenue increased 2% year over year to approximately $251 million and increased 6% on a constant currency basis. This growth was the result of growing our supply as well as improvements to our technology that drive engagement being largely offset by the material demand headwinds seen across our industry.\n\nAdding new media partners in mid-quarter contributed 10 percentage points of revenue growth year over year, and our net revenue retention was 91%, reflecting the impact of the demand environment, reducing monetization levels on our platform. The 91% net revenue retention rate for Q2 reflected a few opposing factors. First, and consistent with what David shared, it reflects healthy growth of our supply or ad impressions that was more than offset by a reduction in yields on our platform. Yields on the platform were driven down by overall pricing pressure from the lower advertising demand.\n\nWhile revenue increased, ex-TAC gross profit decreased 11% year over year to approximately $59 million and decreased 8% year over year on a constant currency basis, driven by a few factors. One was unfavorable mix of revenue. As we said in the past, we typically see our margin fluctuate by one to two percentage points up or down due to mix. Two, lower yields year over year and lower performance on certain media partners, driven in part by the lower yield.\n\nIn addition, the onboarding of certain new supply is typically an investment period. While we have seen it in the past, the soft demand environment, particularly in Europe, where we added meaningful supply has put more pressure on both the new deals and existing relationships during the period. We expect to go out of this headwind in the coming quarters. Moving to expenses.\n\nOther cost of revenue increased approximately $3 million year over year driven by our investment to increase serving capacity to facilitate yield growth through our algorithmic and optimization improvement efforts. Operating expenses increased approximately $10 million year over year. Approximately $7 million was from higher personnel-related costs, reflecting increased headcount year over year, including from our BI acquisition in January. As noted in the prior quarter, we also have higher costs associated with being public and are seeing higher marketing, T&E, and facility expenses as activity impacted by COVID comes back to more normal operations.\n\nAs mentioned last quarter, we were implementing a series of cost reduction efforts to adjust to current business headwinds. We've since increased our efforts in recent months and management expects the benefit of these actions to reduce costs by an additional estimated $12 million in the second half of 2022 as compared with our prior guidance issued in May. More than half of these savings are personnel related with an emphasis on process improvement and efficiencies. In total, we took our annual cash costs down by more than 18% versus our original 2022 plan.\n\nAdjusted EBITDA was $5.9 million in Q2. On a constant currency basis, adjusted EBITDA was $5.2 million. Next, moving to liquidity. Free cash flow, which we define as cash provided from operating activities less capex and capitalized software costs with a net use of cash in the period of approximately $9 million.\n\nThe use of cash was due to lower profitability and timing of server purchases. For the full year 2022, we expect a total of $17 million to $20 million of capital expenditures. We ended the quarter with $391 million of cash and cash equivalents on the balance sheet and $236 million of long-term convertible debt. Lastly, we announced previously that on February 28, our board authorized a $30 million share repurchase program.\n\nThrough July 31st, we have repurchased approximately 2.3 million shares for a total of $12.6 million, including commission, with remaining availability under the program of $17.5 million. Now turning to our outlook. As David discussed, we have seen a volatile H1 of 2022 that started off generally on target for our growth plans before seeing increasing demand headwinds over the course of the year. The patterns we've seen this year and continue to see into Q3 produced continued uncertainty for H2.\n\nAs we look forward, we expect Q3 to be a low point in view of the ramp-up of our new publisher deals and seasonality, particularly in Europe, combined with the overall advertising softness. In our guidance, we assume moderate sequential growth in Q4. With that context, we have provided the following guidance. For Q3, we expect gross profit of $48 million to $52 million, and we expect adjusted EBITDA of breakeven to negative $4 million.\n\nFor full-year 2022, we expect to expect gross profit and adjusted EBITDA of at least $228 million and $18 million, respectively. This guidance assumes no further material changes in macro conditions. Now I'll turn it back to the operator for Q&A. Thank you, sir.\n\nLadies and gentlemen, at this stage, we will be conducting a question-and-answer session.\n\nOperator\n\n[Operator instructions] The first question is from Ross Sandler from Barclays.\n\nRoss Sandler -- Barclays Capital -- Analyst\n\nGuys, can you hear me?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nYes.\n\nRoss Sandler -- Barclays Capital -- Analyst\n\nOK. Just making sure. David, so I noticed your service is up on Fox's website. So is that one of the new large publisher wins in the U.S.\n\nthat you're talking about? If so, what kind of minimum guarantee did you guys do on that one? Or is this a standard rev share agreement? And then second one, I guess, for David or Jason, the 3Q guide assumes about a 20% decline ex-FX, not surprising given what we've seen broadly in the digital ad landscape. But any additional color on the linearity, what you're seeing right now, and which categories or geographies are dropping off the most on a constant FX basis?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nRoss, I'll take the first one. So yes, we mentioned we won a big one. I mean, if you see us on Fox, we are on Fox, F-O-X. Actually mentioned on the call, we renewed with Fox, so that's my accent.\n\nIt's V-O-X, but new big deal is Fox. So that puts us, as I mentioned, being the partner for four of the top five. So we have CNN, Fox Washington Post, Neopost, so no political affiliation. So we're happy with that position.\n\nWe don't go into specifics of deal, but I would say that the Fox deal is not part of our guaranteed portfolio. They've worked with different competitors. It's a long term where we aligned interest with the publisher. So very excited about that one.\n\nAnd then second question to Jason.\n\nJason Kiviat -- Chief Financial Officer\n\nSure. Can you hear me?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nYes.\n\nJason Kiviat -- Chief Financial Officer\n\nOK. Great. Yes. So on Q3, we've seen demand deteriorate over the course of this year, even down further from when we gave our guidance in early May a few months ago.\n\nAnd we see that Q3, we expect it to be the low point of the year. And part of that is because, as you know, we're pretty heavy in Europe. It's about 40% of our business is there. And Q3 is generally just the low seasonal point for us, especially in Europe anyway.\n\nOne more point on Europe, we tend to see higher brand and agency business there that 60% or more of our business is prime and agency, and those segments have been -- particular agencies had been pulling back spend faster than other advertisers as we've seen. We do expect Q4 to recover a bit. We're cautiously optimistic on seasonality and spend patterns, but between elections and the World Cup, and the holiday season, we do expect some seasonal uplift there as well as a ramp-up on the optimization of some of this new supply integrating onto our platforms. That includes, as you pointed out, Fox and Axel Springer, we announced last quarter as well as the benefit from the cost-saving actions taken that we mentioned on the call.\n\nOperator\n\nThe next question we have is from Andrew Boone from JMP Securities.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nTo start off, can we talk about, going back to the bed and the blanket analogy, how long does it take you guys to hold the blanket a little bit wider and recover some of that demand more broadly? As you guys have seen in the past, when you guys add a major publisher, how do we think about the timing of when you guys can start to pull it back in a more normalized environment, understood macros in issue today? And then secondly, going back to one of Ross' questions. But can you talk about any industries that may have been weaker? Were there any advertisers that may have been pulled back for context here? I think some people are worried that crypto and gambling pulled back. Do you guys have any exposure there? Or is there anything you want to highlight?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nMaybe, Yaron, you want to take the first? I'll take the second.\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nSure. So in terms of the bed and blanket, as I said, the bed is a step change kind of thing. So we add new partners we just discussed. And that is a big step change in the size of the bed, covering the blanket takes more time.\n\nThese are individual decisions by advertisers, they need to set up their campaigns either for one and expenditure their budget over time. There's -- again, as I said in equipping normal times, there's that lengthiness is pretty predictable. We know how to ramp up as we make those step changes in the bedtimes, we know how to ramp up the components we know how long that's going to take. In this macro environment, it's taking longer than usual.\n\nStill happening. Again, as I said, we see 100% ad coverage on our bed. So that's what's giving us comfort in getting more demand. We're seeing the advisors that are seeing positive return on that spend for market that keep spending.\n\nSo again, we covered these higher bed, but it's a interplane that is going to take longer. It's hard. It's really hard to predict with the things happening in the macro environment exactly how long it's going to happen. But given that we're still saying coverage, we have to on that, and that's why we're playing offense on adding more distribution or supply partnerships like we mentioned.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nMaybe Andrew -- it's David. I'll add to that. I mean we're very confident in the deals, I mean, they take some time because of the weakness that may take a little bit more time. These are multi-year deals, three to six deals, some of them.\n\nSo we know how to model them. We've done it in the past. And it is part of our overall strategy. I mean, we are trying to get as much of exclusive access to feed inventory at attractive terms.\n\nWe then leverage that feed presence into other parts to expand on our strategy of full-page monetization. And we leverage the fee data that we have, the presence there plus our beta technology, in order to be a bigger partner for the publishers on other placements, made article and top of articles. So the field is critical also and the bidding technology for that. And on the demand side, we are very focused on brands and higher premiums.\n\nSo VI acquisition is part of that. So that helps us on those placements on the mid-article to monetize them in a much better way. The growth we see on brands and agencies, which I touched upon in a second to the weakness, too, but in terms of the strategy, the strategy is really being able to offer to those and agencies that the full page, the fee, the in-article video and invested in Brand Studio, which I mentioned. So that's just overall the strategy and getting into these deals and securing exclusive access to that inventory is part of it and we're very confident in the model.\n\nIn terms of the demand impact, we're seeing more negative impact generally on brand. I mentioned our presence in Europe. Japan is very large. It's almost half of the company.\n\nIt's in mid-40%. So we see clearly weakness there. So more weakness in Europe, more weakness generally on brand than performance. And in specific verticals, I mean, we're pretty diversified by automotive, which is a significant one relatively fast.\n\nWe're still at 100% fill rate, but we see a decline in automotive. We saw some declines in tech. We don't have any particular exposure to cripple at all and to gambling at all. So there's no exposure there.\n\nOperator\n\n[Operator instructions] The next question we have is from Shweta Khajuria from Evercore.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Possible to get a sense of incremental revenue opportunity from Keystone. You now have four partners. I know maybe this year, maybe, too aggressive to have an expectation from that product coming in or being meaningful.\n\nBut how should we think about that? And has anything changed with your go-to-market strategy for that product as you try and scale that?\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nThanks, I'll take that. So we not only have not shared any financial projections on this. We even haven't looked at the product portfolio. So we're looking at later in this quarter.\n\nNew products like this take time to build out, and this is a long-term bet and investment on our side. What's exciting to me is it expands our TAM in some ways. So one way is let them play outside of the fleet, so helping with cultures that are moving to different sources beyond or above the ads, I think for the e-commerce and subscriptions. So this is going to play not necessarily within the app, but any other tax that the publisher owns and chose use case of one significant increase in TAM.\n\nAnd obviously, that is not as planned in those revenue spaces that are additional to the advertising and subscription e-commerce levers, all those areas where publishers are on the piece of diversified. The other way this expands our TAM is it play with media owners and punters that are not necessarily using operating from its health. So one example of the design partners was using in the past someone else for the feed and using Outbrain for Keystone. So that's an additional expansion of Tempress.\n\nAnd the importance of Keystone for us is really with better aligning with how think you're publishing, in general, is going to look. And I think we're hearing this from many different directions where advertising is obviously one of the most important is not the most important in our revenue source for best cultures, but they're all looking at subscription, subscriptive, especially with everything that's happening with the future of cookies. They're looking at e-commerce or retail media. And so this really gives a footstep in fall.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nI would add just one point on that. I mean the whole Keystone strategy is super helpful in our core feed business. I mean every discussion we have with the top-level people and publishers, I mean this comes up and part of the bet on as bet when companies choose long-term partners, it's looking at technology, technology opener, and vision. And this part is very important of the being on page and being more entrenched with those publishers create stronger relationship, more data.\n\nSo there's a lot to it and increases the TAM but also really strengthen the core position.\n\nOperator\n\n[Operator instructions] The last question we have is from Laura Martin from Needham.\n\nLaura Martin -- Needham and Company -- Analyst\n\nSo maybe a couple. The first one is on guarantees. So can you remind us how the guarantees work because it seems to be lowering your yield is bad, your take rate went up by 300 basis points? So I don't exactly understand why we're taking softer demand and allowing your yield to fall when basically, you're just paying out a higher rev share to everyone by doing that. So can you explain? And what percent of your TAC with guarantees in the quarter, please?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nLaura, thanks for your question. It's David. So guarantees account for about 20% of the overall portfolio. Some of these are complicated.\n\nSo you have different steps, step-ups. You have different directions that come into play when you exceed certain levels. So it's really difficult to pinpoint a very specific number, but they account for 20%. When demand is soft and RPMs and are coming down because primarily of CPC, I mean it does potentially negatively impact those deals.\n\nBut the 20%, it's our natural course of business point or some of them. I mentioned one, which is actually a rev show, so different type of arrangements.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. So stay on the strategy point then. Why would you ever add supply, which low -- because you have soft demand, which lowers your average yield, which then steps up by 300 basis points your payout rate, which just hurts you actually?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nOK. So we -- yes, we report on a quarterly basis, but we have a vision and strategy. So these deals, I mean, always, even when the demand environment was stronger, they take time to ramp up. I mean to optimize the site, to deploy there and create those optimization takes weeks and months potentially.\n\nSo it's just part of the model. And we believe very much in the long term. So once we have that fee, I mean, these deals are -- we don't go into deals to lose money. So we do make money on the deals and we look at the models on and three, four, five, six-year basis.\n\nSo I think we see now great opportunity. We are very committed to growing our leadership in most -- I mean if I look at most of the big markets today in the U.S., I mentioned the 4-5, I think in Germany, right, very strong position, Japan on a very strong position, France, Spain, so major markets where we really have that. I mean, that creates a great anchor of great interest for advertisers who one had the access to exclusive open web inventory. That helps us to move up the chain into mid-article, video, out-stream and in-stream video, and other placements that make the whole package much, much more attractive for brand and agency advertisers.\n\nSo that's the strategy, and we believe it's correct. And in the short term, it's primarily low the softness is primarily driven again by our mix. 40-plus percent, Europe and Japan is not great these dates in terms of mix. It also has an FX impact.\n\nBy the way, our brand and agency business is about 45% overall as a company. But in Europe, it's about 60%. So these are budgets that are more impacted currently, and we're still very focused on the strategy and believe this is the right way to build shareholder value long term. I think focusing on quality, premium demand, all page monetization for publishers, stronger mode, and relationship with Keystone.\n\nI mean that's our approach we're very focused on the core, and we're not pivoting to other areas.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. Great. Could you talk about channel shifts? I'm interested in as we think about video, which is all the rate here on Wall Street. Can you talk about what's happening with your video mix as part of your total revenue mix?\n\nDavid Kostman -- Co-Chief Executive Officer\n\nSo video generally, is pretty stable, anywhere around high single digits, low double digits like around the 10% plus/minus. We are currently -- I mean, we don't have a real strong presence on CTV. We are working on that. I mean the acquisition, the integration is going well.\n\nWe're integrating into the core. We see good traction with publishers and looking into the future strategically, we want to play there. I think part of -- when you look at the whole universe and you take the macro view, the companies that are enjoying still better growth rates right now are the ones that are enjoying shift of budgets from linear TV to CTV. So it's not that the advertising market is slower, but the shift of budgets to CTV, we're not enjoying that today.\n\nI hope in the coming years we will have stronger strategy there.\n\nLaura Martin -- Needham and Company -- Analyst\n\nAnd then my last one for Yaron. When do you think -- congratulations on the four partners on Keystone? It feels like your Evo plan is working. What is your point of view about when we could start to see material revenue from Keystone?\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nThanks. All right. So first, as I mentioned with the start of this question, we have not formally launched the product. These are design partners we're working closely with.\n\nWe are generating revenue from in terms of the inflow revenue at launch at first in front of customers and to have goods. Also, maybe I'll answer both of your questions. I think the second question is, we've taken the mix in these four customers on both geographically and size of partners. And we're seeing that the -- where we think the basic impact is probably going to be at the larger pumpers.\n\nSo that's definitely to be going forward. We think those are -- have a lot of opportunity of diverse revenue sources and significant audiences to optimize for. That's where we're going to in the future. But I guess it is small product I think in the future quarters, updating about this.\n\nLaura Martin -- Needham and Company -- Analyst\n\nSo the answer to my question is like '24? It sounds like you're pushing it off to the future. So it's 2024 as an answer to my question. That's where we're going to have material revenue?\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nAgain, we'll be giving guidance on the entire view of the business quarter to quarter as we do, and that would be obviously embedded in there in terms of being flagged, we first need to get this resonated in launches and show goes from there, the long-term investments.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nI wanted to add to the previous question, Laura, on the margin. So we got, we are very focused on the ex-TAC dollars. Obviously, that's also impacted now. But what we're doing right now will position us extremely well when demand rebounds.\n\nAnd you want to see them, hopefully, I mean, we expect and believe that we'll yield back to accelerated growth, and we are very confident in those investments we're making right now for the future.\n\nOperator\n\nLadies and gentlemen, we have reached the end of our question-and-answer session. Now, I would like to turn the call back to David Kostman for closing remarks.\n\nDavid Kostman -- Co-Chief Executive Officer\n\nThank you. Thank you all for joining. We look forward to seeing you on our next call. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nUnknown speaker\n\nDavid Kostman -- Co-Chief Executive Officer\n\nYaron Galai -- Co-Founder and Co-Chief Executive Officer\n\nJason Kiviat -- Chief Financial Officer\n\nRoss Sandler -- Barclays Capital -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nLaura Martin -- Needham and Company -- Analyst\n\nMore OB analysis\n\nAll earnings call transcripts"
}