{
  "companyName": "Global-e Online Ltd.",
  "companyTicker": "GLBE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/global-e-online-ltd-glbe-q2-2022-earnings-call-tra/",
  "content": "Global-e Online Ltd. (GLBE 1.32%)\nQ2 2022 Earnings Call\nAug 16, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Global-E second quarter 2022 earnings call. This call is being simultaneously webcast on the company's website in the investors section under news and events. For opening remarks and introductions, I'll now turn the call over to Erica Mannion at Sapphire investor relations. Please go ahead.\n\nErica Mannion -- Investor Relations\n\nThank you, and good day. With me today from Global-E are Nir Debbi, co-founder and president; and Ofer Koren, chief financial officer. Nir will begin with a brief review of the business results for the second quarter ended June 30, 2022. Ofer will then review the financial results for the second quarter ended June 30, 2000 -- sorry, excuse me, June 30, 2022, followed by the company's outlook for the third quarter and full year of 2022.\n\nWe will then open the call for questions. Certain statements we make today may constitute forward-looking statements and information within the meaning of Section 27A of the Securities Act of 1933. Sections 21E of the Securities Exchange Act of 1934 and the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995 that relate to our current expectations and views of future events.\n\nThese forward-looking statements are subject to risks, uncertainties and assumptions, some of which are beyond our control. In addition, these forward-looking statements reflect our current views with respect to future events and are not a guarantee of future performance. Actual outcomes may differ materially from the information contained in the forward-looking statements as a result of a number of factors, including those set forth in the section titled Risk Factors in our prospectus filed with the SEC on September 13, 2021, and other documents with or furnished to the SEC. These statements reflect management's current expectations regarding future events and operating performance and speak only as of the date of this call.\n\nYou should not put undue reliance on any forward-looking statements. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee that future results, levels of activity, performance and events and circumstances reflected in the forward-looking statements will be achieved or will occur. Except as required by applicable law, we undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise after the date on which these statements are made or to reflect the occurrence of unanticipated events. Please refer to our press release dated August 16, 2022, for additional information.\n\nIn addition, certain metrics will be discussed today are non-GAAP metrics. The presentation of this financial information is not intended to be considered in isolation or as a substitute for or superior to financial information prepared and presented in accordance with GAAP. We use these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe that these measures provide useful information about operating results and hence, the overall understanding of past financial performance and future prospects and allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making.\n\nFor more information on the non-GAAP financial measures, please see the reconciliation tables provided in our press release dated August 16, 2022. Throughout this call, we provide a number of key performance indicators used by our management and often used by competitors in our industry. These and other key performance indicators are discussed in more detail in our press release dated August 16, 2022. I will now turn the call over to Nir, co-founder and president.\n\nNir Debbi -- Co-Founder and President\n\nThank you, Erica, and welcome, everyone. Unfortunately, Amir could not join the call today due to the passing of his father. And I would like to start by sending deepest condolences to Amir and his family on behalf of the entire Global-E team. Back in mid-May, when we discussed our Q1 results and forward outlook, we mentioned the heightened uncertainty toward Q2, resulting from macro-induced factors in the war in Ukraine.\n\nHowever, today, I'm happy to report to you that the initial signs of improvement we saw in early May turned out to be indeed the precursors to further improvement in the second half of the quarter. The Russian, Ukrainian and Belarusian markets, which in total represent less than 2% of our activity, remain closed for the time being, given the unfortunate continuation of the war in the region. However, activity in other regions in Europe moderately picked up back from May onwards, despite macro concerns. Coupled with our team's continued strong execution, this resulted in our strongest quarter ever.\n\nQuarterly GMV amounted to $534 million and quarterly revenues amounted to $87.3 million, both above the top of our outlook range. Furthermore, as Ofer will elaborate on later in the call, while there remains somewhat heightened uncertainty in the conditions of the global macro environment, we are increasing our previously stated guidance for the remainder of the year to reflect the stronger performance in Q2 in the Borderfree acquisition. But first, going back to our Q2 results, we continue to experience fast growth during the second quarter of the year, with GMV growing 64% year on year and revenues growing 52% year on year. Our adjusted gross profitability continued to strongly improve coming in at 41.8%.\n\nOur adjusted gross profit amounted to $36.5 million, growing at 77% year on year, again, outpacing our strong top-line growth. This was a result of our growing efficiencies of scale leverage, the continued realization of COG synergies with flow and a more favorable mix of revenues. In terms of our operational expenses, we continue to reinvest in growing the business and building the infrastructure required to seize the huge market opportunity that lies ahead of us. However, at the same time, and given the various macro headwinds we foresaw at the beginning of the year, we continue to exert strict cost control throughout the quarter to ensure our ability to continue delivering healthy and sustainable growth while remaining cash positive.\n\nIn addition, we have been able to realize synergies from our recent acquisition of Flow Commerce faster than expected, thereby lowering the drag on our bottom line. These factors, coupled with our faster-than-planned top-line growth, resulted in a very strong adjusted EBITDA of $11.1 million, well above our outlook range, representing an adjusted EBITDA margin of 12.7%. Switching gears, I would like to update you on some of the many positive developments in our business over the past quarter. On the merchant activity front, demand for our services continues to remain strong as more and more brands around the world put direct-to-consumer and cross-border sales, it's across chairs of the growth strategy.\n\nAs such, during the quarter, we continued launching with many new brands and expanding our activity with existing ones. Q2 saw the launches of many new brands on our platform, including leading fashion Brands, Rag & Bone and Zadig&Voltaire. The Spanish cosmetics brand, Freshly Cosmetics, is the official tennis merchandise store of Wimbledon and the luxury watches brand, Zenith, which is part of the LVMH Group. We also continue to add celebrity brands and other fast-growing digitally native brands, such as Justin Bieber's fashion brand, drew house, the highly successful training apparel brand, NOBULL, as well as SKKN, another brand by Kim Kardashian, augmenting our successful partnership with Kim's clothing brand SKIMS.\n\nFurthermore, our entry into the APAC region continued to gain strong momentum with the launches of Triangl Swimwear out of Hong Kong and Ryderwear, our first live Australian merchant as well as the signing of our first ever Japanese merchant. During Q2, we also expanded our activity with brands such as Adidas and Suunto, all of which added additional lanes to be operated by globally. Last but not least, I am proud to announce that during Q2, we went live with one of the world's most well-known and respected consumer brands, Disney. As part of the push to expand the direct-to-consumer sales, Disney chose globally to power its cross-border sales across several markets in the APAC region, leveraging both our extensive capabilities and expertise as well as our unique multi-local infrastructure.\n\nAs before, we remain highly optimistic regarding our ability to continue growing this portfolio of brands as our new bookings, forward-looking pipeline of brand is stronger than ever. On the strategic partnership front, we have continued to deepen our collaboration with our growing ecosystem of partners around the world, including, for example, our first and highly attended client event in Tokyo, Japan, held in partnership with our local partner, Trans Cosmos. Our partnership with Shopify continues to develop on track. On the direct solutions side, dozens of merchants of different sizes are already live on our new native integration into the Shopify platform and dozens more are in various stages of planning and integration.\n\nIn addition and as planned, during the quarter, we have already booked our first live order as part of the beta trials of the new white label merchant of record solution on Shopify, built upon the Flow Commerce technology. Work on this innovative solution for SMBs continues full steam ahead toward a phased rollout later in the year. Corporate work on the full post-merger integration of Flow Commerce into Global-E is now all but complete. And as I have already mentioned, we have been able to realize many of the planned synergies earlier than expected.\n\nOur corporate development team is now focused primarily on the integration of Borderfree, which we acquired out of Pitney Bowes. This was our second acquisition that was closed at the beginning of Q3. With a talented team of software engineers and other professionals from Borderfree, all highly passionate about cross-border, now becoming part of their respective teams at Global-E around the globe. Besides the list of marquee U.S.\n\nbrands who work with Borderfree and will now have access to globally advanced localization platform, we expect the merger of Borderfree into globally to provide several key benefits and synergetic values. First, we expected it will enable us to expedite our planned expansion of both range and the quality of online marketing and demand generation services we provide to our merchants. Over the years, Borderfree has developed a set of unique capabilities and assets in the field of cross-border demand generation, which we expect we will be able to offer to the much broader audience, merchants on our platform. Second, as part of this acquisition, we were also able to strike a strategic mutually beneficial partnership with Pitney Bowes, providing us with access to some of Pitney's advanced logistical solution as well as providing Pitney's clients with access to Global-E best-in-class cross-border enablement solution.\n\nAnd finally, some of the proprietary cross-border software components and architectural elements, built by the highly skilled engineering team at Borderfree, will be combined over the coming quarters into the Global-E code base, yielding a best-of-breed set of services and considerably shortening the time to market of various elements, which were on our technical road map. As Ofer will elaborate on later, we do expect the Borderfree acquisition to somewhat weigh on our margin during the next few quarters given the differences in financial profiles and efficiencies. But as with the Flow acquisition, we should be able to utilize both our scale and our expertise in order to gradually realize relevant synergy and potentially improve the financial margins over the coming quarters. There are many more exciting developments happening across the business.\n\nWhile we continue to leverage our position as the world's leading cross-border enabler to capture more and more of the immense and growing market opportunities that lies ahead of us and to help our fast-growing list of merchants to realize our international sales potential. But in the interest of time, I will pause here and just say in summary that we are very pleased with our strong results in the second quarter of 2022 and remain very much on track both strategically and financially to achieve our 2022 and long-term goals. And with that, I will hand it over to Ofer, our CFO, to go over the financial results in more detail and provide some additional color regarding our outlook for Q3 and the full year of 2022.\n\nOfer Koren -- Chief Financial Officer\n\nThank you, Nir, and good morning, everyone. This has been a record quarter on all fronts as we continue to demonstrate fast growth and strong execution, coupled with cash generation amid the macro environment, which continues to be volatile. The demand for an acceptance of our direct-to-consumer cross-border offering by merchants continues to be very strong with signings of new merchants continuing at a record pace. Our rapid growth continued in Q2 as we generated $534 million of GMV, an increase of 64% year over year.\n\nAfter experiencing weaker consumer demand through March and April in Central and Eastern Europe and in some of the Western European markets impacted by the war in Ukraine and the macro environment, we have seen significant recovery through May and June. While the overall e-commerce market growth in the first half of 2022 has been softer, merchants are continuing to prioritize and accelerate the shift toward direct-to-consumer and the cross-border opportunity remains massive. In Q2, we generated total revenue of $87.3 million, up 52% year over year. Service fee revenue were $39.3 million, up 86%, and fulfillment services revenue were up 33% to $48 million.\n\nService fee revenue continued to grow faster compared to fulfillment services revenue, driven by the growth of our multi-local offering, merchant revenue mix in the quarter and the revenue mix of flow, which is characterized by a higher share of service fees. From a geographical standpoint, U.S. outbound revenue continued to grow rapidly. In Q2, U.S.\n\noutbound revenue was up 104% year over year, driven by strong growth on the Global-E platforms U.S. outbound business coupled with the high share of U.S. outbound on the Flow platform. In addition, our penetration efforts into new markets are starting to show initial positive results.\n\nWhile still relatively small in share, APAC and the Middle East outbound revenue have grown 213% year over year. Our non-GAAP gross profit growth yet again outpaced top-line growth. In Q2, non-GAAP gross profit was $36.5 million, up 77% year over year, representing a margin of 41.8% compared to 36% in the same period last year. As Nir mentioned, this was primarily driven by the higher share of service fee revenues, the realization of Flow cost of goods sold synergies and our increased scale leverage.\n\nI would like to remind you that as of Q1, we are reporting adjusted gross profit, which adjust the gross profit for amortization of acquired intangibles as is common post acquisitions. GAAP gross profit was $34.3 million. We expect Borderfree to weigh on our gross margin in the next six to 12 months until we are able to realize the available cost of goods sold synergies. Moving on to operational expenses.\n\nThroughout the quarter, we continued to invest in the development and enhancement of our platforms to further broaden and deepen the Global-E enterprise platform capabilities and to develop the new SMB offering on the Flow platform. R&D expense in Q2, excluding stock-based compensation, was $12.3 million or 14.1% of revenue compared to $5.5 million or 9.6% in the same period last year. Total R&D spend in Q2 was $17.6 million. The increase of R&D expense as percentage of revenue is mainly driven by the consolidation of Flow.\n\nAlongside R&D, we continue to invest in sales and marketing, enabling us to generate a strong and diversified pipeline while maintaining efficiencies. Sales and marketing expense, excluding Shopify warrants-related amortization expenses, amortization of acquired intangibles and stock-based compensation, was $8 million or 9.2% of revenue compared to $4.3 million or 7.5% of revenue in the same period last year. Shopify warrant-related amortization expense was $37.4 million. Total sales and marketing expense for the quarter were $51 million.\n\nGeneral and administrative expenses, excluding stock-based compensation, acquisition-related contingent consideration, were $6.3 million or 7.2% of revenue compared to $3.3 million or 5.7% of revenue in the same period last year. As a reminder, the contingent consideration expense reflects the portion of the Flow transaction consideration, which is held back for the founders, contingent upon a certain employment period and expense over time. Total G&A spend in Q2 was $15.1 million. Adjusted EBITDA has increased significantly compared to the previous quarter, driven by higher-than-expected top-line growth, faster-than-planned synergies realization with Flow and additional focus on cost management discipline due to the macro volatility.\n\nAdjusted EBITDA totaled $11.1 million, representing a 12.7% adjusted EBITDA margin, increasing from $7.6 million in the same period last year. We have realized synergies that have driven a significant improvement in Flow's adjusted EBITDA, and we now expect Flow to reach breakeven by the end of this year. Turning to the balance sheet and cash flow statements. We ended the quarter with $285 million in cash and cash equivalents, including short-term deposits and marketable securities.\n\nNet operating cash flow generated in Q2 was $31.9 million compared to a net operating cash flow of $6.9 million in the same quarter a year ago. Moving on to our financial outlook and guidance for the third quarter and full year 2022. We expect Q3 GMV to be in the range of $600 million to $614 million. At the midpoint of the range, this represents a growth rate of 72.4% versus Q3 of 2021.\n\nOf this, Borderfree is expected to contribute $50 million to $54 million of GMV. We expect Q3 revenue to be in the range of $99.5 million to $102.5 million. At the midpoint of the range, this represents a growth rate of 70.9% versus Q3 of 2021. Adjusted EBITDA is expected to be in the range of $8.5 million to $11.5 million.\n\nPlease note that Borderfree's take rate in Q3 is expected to be similar to Global-E's take rate, while Borderfree's adjusted EBITDA is slightly negative. As Nir mentioned earlier, we are increasing our previously stated outlook for the remainder of the year to reflect the stronger performance in Q2 and the Borderfree acquisition. For the full year of 2022, we now anticipate GMV to be in the range of $2.45 billion to $2.55 billion, representing 72.5% annual growth at the midpoint of the range. Of this, Borderfree is expected to contribute $125 million to $135 million of GMV.\n\nExcluding Borderfree, we are raising our full year GMV guidance to $2.32 billion to $2.42 billion. Revenue for the full year is expected to be in the range of $406 million to $426 million, representing a growth rate of 69.6% at the midpoint of the range. We are also increasing our full year adjusted EBITDA guidance, which was previously at $38 million to $42 million, and now we expect it to be in the range of $41 million to $46 million, despite a slightly negative contribution from Borderfree. In conclusion, while macro headwinds continue, our execution remains strong on all fronts as we continue to tap into the massive opportunity ahead of us.\n\nWe will continue along with our partners to further enhance our offering to enable merchants to grow their direct-to-consumer cross-border businesses effectively and efficiently. We believe this will enable us to continue demonstrating fast top-line growth while leveraging our scale to further improve efficiencies. And with that, Nir and I are happy to take any of your questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Will Nance with Goldman Sachs. Please proceed with your question.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys. Good morning. Condolences to Amir. Sorry to hear about that.\n\nI wanted to ask a question on the recovery on some of your markets in early May that seem to have continued throughout the quarter. Wondering if you can talk about some of the trends that you guys have seen more recently or that you may be expecting in the back half of the year, maybe tie that together with the guide? I assume that there's some incremental FX headwinds that you're having to absorb with the updated guidance as well. So maybe when we just think about the guidance of exporter free for the remainder of the year, how are you thinking about the puts and takes of macro FX versus some of the strength that you guys have seen more recently in the second quarter? Thanks.\n\nOfer Koren -- Chief Financial Officer\n\nHi. Hi, Will. It's Ofer. Thank you for the question.\n\nAs we've communicated, this year has been quite volatile. After we've seen a weaker March and April, we did see business pick up in May and June, partially due to the fact that we've seen some of the markets coming back, mainly in Central, Eastern Europe and some of the European markets that were affected from the war and the macro environment. So not everything came 100% back, but we did see things picking up. And then we've seen a lot of merchant activities, putting a lot of focus on direct-to-consumer, both existing merchants that have been pushing their business forward, and we've seen a lot of new product launches and marketing activity during May and June.\n\nAnd as we continuously communicate, we have a very strong pipeline. So we've seen merchants launching the new activities with us. And all of that is accumulated into a strong May and June. And then when we looked at the guidance, on the one hand, we incorporated the Q2 results, obviously, that's already history.\n\nAnd on the other hand, we did take into account that, one, there is still high volatility in the market and some macro uncertainty. There may be some FX headwinds, but some of it has been a bit eased in the last few weeks, so it remains to be seen what will happen. And basically, that's what we baked into the updated guidance, which reflects the better-than-expected Q2 and the addition of Borderfree.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. That's helpful. And then maybe if I can follow up on just a question about how you're thinking about demand for cross-border e-comm. Given all the commentary so far this earnings season about the return of cross-border travel that -- it seems like the expectation is that will continue to be strong and recover nicely over the next, call it, over the remainder of the year.\n\nHow you guys are thinking about the interplay of people traveling cross-border more frequently and how that would impact the demand for kind of online cross-border e-commerce?\n\nNir Debbi -- Co-Founder and President\n\nYeah, I think that when we went into our Q1 already and in the guidance we gave for 2022, we baked in some COVID relief as we assume that people will go back to traveling in 2022. So this was already included in the number, as we expected some localization there. However, we do believe that the longer-term trend that started, I would say, more than a decade ago and still continues of e-commerce, especially cross-border e-commerce growing much faster than physical commerce and growing in share over the entire retail sales will continue, and we do see this trend of growth. Global e-commerce is still growing even within COVID relief, the growth in e-comm is still positive on a global scale.\n\nSo we are quite optimistic about that. When we take it into our new bookings and looking into merchant interest into D2C here, we see a substantial increase. And this trend continues, and it's reflected in the growth that we see in new bookings coming in and with large, I would say, brands and enterprises that are partnering with us to support the future rollout of global D2C.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. Understood. Appreciate you taking my questions. Nice results this morning.\n\nNir Debbi -- Co-Founder and President\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Josh Beck with KeyBanc Capital Markets. Please proceed with your question.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThank you, team. And my condolences as well. I wanted to ask about a broader trend that we've seen in e-commerce. I think the message from a lot of these companies this quarter has been somewhat of a normalization toward 2019 levels when we think about the pace of e-commerce penetration gains within the broader market.\n\nObviously, you have new customers, which are certainly helping drive growth, new corridors as well. When you think about this broader macro trend across customers and verticals, how are you trying to contemplate that into the guidance? And also just thinking about algorithm in the future years as well.\n\nOfer Koren -- Chief Financial Officer\n\nJosh, thank you for that. It's Ofer. I think that obviously, all the trends that you mentioned are out there, and we have seen a softer e-commerce environment. The reopening is there, as Nir mentioned and so on.\n\nAnd there are some uncertainties regarding the macro environment. However, I think that what differentiates us is the fact that the direct-to-consumer channel is in the focus of the merchants and is gaining share over other channels. So this channel is definitely growing and growing in a nice pace. And we believe that this is a secular trend that will stay for us for a long time as merchants prioritize this channel for a reason.\n\nThey want the close relationship with the consumer, they want to have the data, and they want to enjoy the margins at the end of the day. I think this is what differentiates direct-to-consumer cross-border from the sort of general e-commerce market.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThat's very helpful. Maybe just a follow-up on one of the Borderfree synergy demand. Could you help us maybe understand how applicable you see these types of capabilities across your merchant base something they've really been requesting? Also, anything you can share on the revenue model. I assume this gets bucketed under the services business, but would be curious to learn more there.\n\nNir Debbi -- Co-Founder and President\n\nHi, Josh. This is Nir. So when we made the acquisition of Borderfree, what we looked for was certain synergies as well as capabilities that we bought. So one you mentioned demand generation is something that over the last couple of years, we started to develop based on demand from our merchants.\n\nAs we have a much wider merchant base that have grown very fast with us and over time, became, I would say, very local in many markets, they are looking to how can they accelerate more the growth. And for that, we mentioned is important and to do it efficiently in a time where demand generation becomes, I would say, more problematic due to a different privacy and regulation related to privacy. We believe that there is a place for us to take, I would say, a more proactive approach there. What Borderfree has and developed over the year is a unique asset related to demand generation that we believe that we can build on as a base to offer it to all our broader merchant base and to build on in order to fuel their and our current store sales.\n\nSo we do see a very high potential there. The other thing we looked at the acquisition was a partnership with Pitney Bowes, allowing us access also to, I would say, sophisticated logistical services into certain markets, especially into Canada, which is a key market for U.S. brands as well as a partnership on the merchant side, giving Borderfree -- giving Pitney Bowes larger client base access to a globally advanced logistical -- advanced localization services. We also believe that we will be able, as we did with Flow to realize synergies coming out of our expertise and scale enjoying, I would say, a better profile on the financial side as well.\n\nHopefully, that answers your question.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nPerfect, Nir and Ofer. Very helpful.\n\nOperator\n\nThank you. Our next question comes from the line of Samad Samana with Jefferies. Please proceed with your question.\n\nSamad Samana -- Jefferies -- Analyst\n\nHi. Good morning. Thanks for taking my qusetion and congrats on the strong results. Maybe first, just with the strong rebound that you've seen in terms of demand, can you help us maybe understand, Ofer, what you're thinking in terms of the net retention number for your existing customers? Like what's assumed in the revised guidance, especially the exporter free guidance for the year?\n\nOfer Koren -- Chief Financial Officer\n\nHi, Samad. So as you know, we are not disclosing a number on a quarterly basis. However, as we communicated in the previous quarter, we do believe that the NDR would be around our historical levels, not the numbers we have seen in 2021 and 2020 but something around the average of the previous years. And this is what our plan is based upon.\n\nAnd so far, I think we've been -- after revising the guidance in the previous quarter, things have been on track to get there.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. And Nir, maybe one for you. Have you seen any change either an acceleration or pull forward or maybe a little more hesitant in terms of what customers are doing in go-live times or the length of sales cycles just -- in either direction, have you seen any change in merchant behavior that informs your outlook for the rest of the year?\n\nNir Debbi -- Co-Founder and President\n\nSure. Then basically, to be honest, we've seen the other way around. We've seen much more interest coming in and a lot of it from larger brands that, I would say, stayed on the fence before related to go direct to consumer on a global scale. I would say the recent example we just launched with is Disney, where we are going to support our merchandising store out of APAC, a few markets in APAC in this phase.\n\nBut we've seen many others that are doing the same. Our new bookings over the quarter is significantly higher than last year and significantly higher than what we had. I think it was a record quarter for us in new bookings. So it gives us, I would say, some confidence related to our outlook into the rest of the year and further down from there.\n\nHopefully, it answers your question.\n\nSamad Samana -- Jefferies -- Analyst\n\nDefinitely. Thanks, again, and great to see the strong results.\n\nNir Debbi -- Co-Founder and President\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Koji Ikeda with Bank of America. Please proceed with your question.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, everyone. Please give Amir my best. Nir or Ofer, a couple of questions from me. So just kind of asking on the guidance.\n\nI know on the prior call, you really called out and in the prepared remarks today, you called out Russia, Ukraine, Belarus, Central and Eastern European softness. That was really kind of the premise of the guide down in the GMV last quarter. But it really sounds like Central and Eastern European has improved. So just curious, really kind of want to hammer down from a geographical perspective, are the assumptions kind of from the previous guide from a geographic impact perspective, are those assumptions the same within the updated guidance today or are there any other regions to call out?\n\nOfer Koren -- Chief Financial Officer\n\nSo thank you for the question. It's Ofer. I think that regarding the geographical effect in the guidance, I would say that we have seen the markets that were directly impacted from the war with some -- also some additional impact from market -- from macro conditions. Those have improved, not necessarily to 100% but improved very much during Q2.\n\nAnd basically, we expect them to continue the same or at a similar pace throughout the year. Unfortunately, people get used to everything, including war. So we think we saw a drop, then we've seen partial and nice comeback, not to 100%. And basically, this is what we are taking into account in our guidance.\n\nOther than that, we have seen some strengths and weaknesses in different geographies, but nothing out of the ordinary. I mean there is always some dynamic during the year.\n\nNir Debbi -- Co-Founder and President\n\nHowever, we need to take into account there are high uncertainties in the macro environment, and this we also took into account into our guidance.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Got it. Thank you. And then just one follow-up from me.\n\nI wanted to ask a question on Disney. Clearly, a fantastic win, the global mega brand. So I was wondering if you could walk us through how this win with Disney came about. Was this a Disney Asia division win or maybe was this something more HQ-driven with Asia being the first target market with maybe more to come? Thanks, guys.\n\nNir Debbi -- Co-Founder and President\n\nYeah. So Asia is indeed, I would say, as we see it and also Disney, a part of a larger, I would say, approach with Phase 1, a deployment into certain markets in APAC. On the back of a success on those markets, we do expect a rollout into additional geographies, not only within APAC. So it's a discussion that has been going on for quite a while, as you can assume, Disney is a reputable brand, the level of project management and requirements to go live was extensive.\n\nAnd we do believe that over time, as we did with many other merchants, large merchants we launched with as well as retail groups, we would see a land and expand also with Disney.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, guys. Thanks for taking the questions.\n\nNir Debbi -- Co-Founder and President\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of James Faucette with Morgan Stanley. Please proceed with your question.\n\nSandy Beatty -- Morgan Stanley -- Analyst\n\nThanks. This is Sandy Beatty on for James. I wanted to quickly follow up, APAC, obviously, a point of strength for you guys. Can you just talk about the demand drivers there, particularly from a merchant perspective just in terms of outbound, how you're thinking about the potential of the region? You have these larger brands that are potentially moving over.\n\nObviously, more organic wins as well. Can you just provide a little bit more color there?\n\nNir Debbi -- Co-Founder and President\n\nYes. So we are at the initial stages of penetration into APAC, but we are very, very confident looking at the future as we see the pipeline of new bookings being, I would say, going from strength to strength over the quarters. I recently visited Tokyo, Japan for the event we had there with our partner, Trans cosmos, and we've seen extensive interest from amazing Japanese brands looking to go D2C. We've seen tremendous success in our -- in building a pipeline in Australia, fueled by our partnership with Australia Post and the DHL team in Australia.\n\nSo we do believe that over time, we would see APAC taking, I would say, a significant chunk in the mix of corridors of outbound sales from -- so we are -- today, I would say, much more balanced than we used to be years ago, mainly European outbound today were much more balanced with U.S. taking a significant chunk of our activities, we assume that over time, with the momentum we see in APAC, APAC will take it through.\n\nSandy Beatty -- Morgan Stanley -- Analyst\n\nGot it. Thank you. And then just one on gross margin. It looked particularly strong this quarter.\n\nCan you just walk us through some of the upside drivers there just between multi-local mix shift, scale, obviously? And how you're thinking about trajectory on a longer-term basis particularly as you integrate these new acquisitions?\n\nOfer Koren -- Chief Financial Officer\n\nYes, so I think you already mentioned the three drivers behind the strong gross margin this quarter, but maybe I can add some color on that. One, we had a good mix in terms of service fees and fulfillment services. So this obviously has an impact on gross margin. Two, and this is important.\n\nWe have been able -- and I think we've mentioned it a few times to realize cost of goods sold synergies with Flow faster than we originally anticipated. So I think toward the end of Q1 and the beginning of Q2, we already implemented some changes. We needed to wait and see that everything works well, and we are seeing very good results on that end. So we significantly improved Flow's gross margins over the last quarter.\n\nAnd we also had -- as you mentioned, we continuously invest to gain efficiencies based on leveraging our scale. This is something we do on a continuous basis. So I think those are the three main drivers behind the number. In terms of going forward, we will have Borderfree weighing a bit on our gross margin.\n\nAs currently, the gross margin of Borderfree is lower than ours. We think that over the next three, four quarters, we can improve that as we did with Flow. And putting aside Borderfree, I think we expect to see the same dynamics. We don't expect to have an improvement of 200 basis points every quarter.\n\nHowever, over time, we do expect to be able to gradually improve our gross margins.\n\nSandy Beatty -- Morgan Stanley -- Analyst\n\nPerfect. Thank you for taking my questions.\n\nOperator\n\nThank you. Our next question comes from the line of Alex Sklar with Raymond James. Please proceed with your question.\n\nAlex Sklar -- Raymond James -- Analyst\n\nSo following up on some of the earlier answers, questions on the macro. What can you tell us in terms of growth of merchants in your pipeline or demo activity or some other metrics that you're tracking to help put some quantification behind that pipeline strength commentary?\n\nNir Debbi -- Co-Founder and President\n\nSure. It's Nir. Thank you for the question. So basically, in terms of the growth in pipeline, it's from I would say the demo bookings that we've seen a substantial two-digit increase and go throughout the funnel into the signings of new merchants.\n\nAnd I can tell you that year over year, we are at over 100% growth for the entire half 1 of 2022, and this momentum with and Q2 is even higher than Q1 on that. So it's a substantial increase in new bookings, I would say, that supports our, I would say, increased guidance into the second part of the year and also support our long-term growth. Hopefully, that answer...\n\nAlex Sklar -- Raymond James -- Analyst\n\nYeah. No, that's great color, Nir. And I guess maybe this kind of goes hand in hand, but just following up on the Shopify partnership. The native integration launched, I think, early in the quarter.\n\nBut what can you tell us in terms of how that played out versus expectations once you have that native integration up and running?\n\nNir Debbi -- Co-Founder and President\n\nSo we're happy with the adoption of it. And I think we see a tremendous acceptance of friends requesting to go on the native Shopify integration. And we are very, very optimistic looking into the future as our partnership with Shopify evolves and strengthen. I think we can say we are very appreciative of the product and engineering team as well as the commercial teams in Shopify as being on the -- being built and embedded within the checkout requires a lot of much closer cooperation than we had in the past, and they are giving it, and they have a true partner, and we're very happy about the way this evolves.\n\nWe do expect next year to have, I would say, hundreds of merchants, new and existing that would go live on this native integration. Some of them, as I said, out of our current classic integration, some of them are new, but we do expect it to scale up and improve our launch time on Shopify as well as the overall merchant and customer experience.\n\nAlex Sklar -- Raymond James -- Analyst\n\nOK, great. Thank you very much.\n\nNir Debbi -- Co-Founder and President\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Scott Berg with Needham & Company. Please proceed with your question.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Congrats on a great quarter, and thanks for taking my questions here. I guess, Ofer, I do -- wanted to start off with your EBITDA guidance for the full year. You had a strong second quarter, obviously, results with the cost controls and the synergies that you mentioned.\n\nBut I see that you did not carry through the entire second quarter outperformance into the second half. How should we think about your growth investments here? It looks like you're continuing to invest aggressively in the business. But is there anything new that you've identified maybe in the last quarter or two that would be interesting to note in terms of what the opportunities out there look like? Thank you.\n\nOfer Koren -- Chief Financial Officer\n\nYes. I think that the main factor that we should add to this discussion is Borderfree. Borderfree has adjusted EBITDA negative, not a large number, but still has a negative impact on the overall result. And this is baked into the guidance.\n\nOn top of that, as you mentioned, we were -- in Q1, Q2, we were controlling costs. We do have some agility in our model, and we did discuss that in the previous quarter. If you remember, we did update our guidance, but we didn't change the adjusted EBITDA number for the year. So now after the second quarter, which was a much better than expected, we're still controlling costs, but we are, as you said, also investing so we can support next year's growth and of course, growth in the future as well.\n\nSo those would be I think the main points impacting our adjusted EBITDA guidance.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. Helpful. And then from a follow-up perspective, Nir, I know you've all discussed a lot on Flow Commerce and Borderfree here today. But as you think about the Borderfree benefits that you listed out before, especially some of the services from Pitney Bowes.\n\nAre those benefits starting to impact your sales cycles for your core Global-E type of customer or ar those to realize maybe, I guess, in the next year?\n\nNir Debbi -- Co-Founder and President\n\nYeah, thank you for the question. I assume we would see most of the benefit only next year as it requires technical integrations and set up. We're in the process of building the processes as well as the tech side of the integration. Following it, I would expect it to benefit both winning of new clients with additional service capabilities.\n\nBut more than that, it will enable us to offer, I would say, some additional services to current client base I would say, giving a better customer service to their own consumers in different areas. So it would come both ways. But most of it, we would see only in, I would say, I assume early Q1 or Q2 2023.\n\nScott Berg -- Needham and Company -- Analyst\n\nCongrats on a strong quarter again, and thanks for taking my questions.\n\nNir Debbi -- Co-Founder and President\n\nAppreciate that. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Brent Bracelin with Piper Sandler. Please proceed with your question.\n\nUnknown speaker\n\nHello. This is Clark on for Brent. First question is, over the course of the past eight months of 2022, could you tell me about what you've seen in the different segments or product categories within GMV, whether that was luxury or fashion or cosmetics. Are there any segments or product categories that you've seen more stabilization or more improvement sequentially in Q2 from Q1?\n\nOfer Koren -- Chief Financial Officer\n\nThank you for the question. I think that generally speaking, we have seen similar trends within the different segments. However, if I can point out some differences, we have seen slight decrease in sporting goods and sporting wear. I think it relates to the opening up and people going back to work.\n\nSo that would be one observation. I think a second observation would be that we have seen the digital native brands and the new brands growing a bit faster than the others. So I think those are the two main observations.\n\nUnknown speaker\n\nAll right. Great. And then second, a lot of questions on the Borderfree capabilities being applied to the Global-E platform. But I wanted to ask about the Inverse.\n\nWondering if you could talk about what you're most excited about or where you see the most opportunity in terms of offering Global-E capabilities to take this team Borderfree customer base?\n\nNir Debbi -- Co-Founder and President\n\nSure. And I think that -- it's Nir speaking. Given Global-E is more than -- is almost more than 10x, I would say, the size of Borderfree, we have much more data and know how to optimize the merchant proposition as well as additional capabilities that were not required at the size of Borderfree. And once we can bring those into the Global-E client -- into the Borderfree client base, I would expect to see a nice, I would say, impact on positive conversion rates turning international traffic into more sales than what they had in the past.\n\nSo I think we can bring capabilities that could boost current merchant sales on Borderfree. We do, of course, already started the journey. We analyzed where we can do, I would say, quick changes with the Borderfree engineers and account management team. And over time, we will be able with some additional bills that we are currently doing do much more for the brand.\n\nSo we are very excited about that.\n\nUnknown speaker\n\nThank you very much.\n\nNir Debbi -- Co-Founder and President\n\nThank you.\n\nOperator\n\nThank you. Ladies and gentlemen, our final question comes from the line of Pat Walravens with JMP Securities. Please proceed with your question.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. And let me add my thoughts and prayers for Amir and his family. So Nir with Borderfree [Inaudible] more M&A? And if so, what kinds of things are out there that would be interesting? And then maybe also, let me just add on that.\n\nAre you finding that some of the smaller companies that might have interesting technologies are running out of cash and are more available than they used to be?\n\nNir Debbi -- Co-Founder and President\n\nThank you, Pat. So I would start with the latter. We see more interest of companies that are, I would say, either running out of cash or don't see a very bright horizon ahead of them reaching out to us, either direct or through the third parties looking if we're interested in making additional transaction. So yes, there is interest.\n\nHowever, when we look at it from the Global-E side, we are focusing currently on, I would say, realizing the potential out of the Flow Commerce acquisition, especially the build of, I would say, the white label solution into Shopify. We have a lot of our hands realizing the benefits from the Borderfree acquisition. But we are looking ahead. And we might look, I would say, for some tactical acquisition, not on a large scale, if we see that we can, I would say, complement additional capabilities in area of interest.\n\nWe spoke about demand generation earlier, but we can see something in an area of interest for Global-E, and we look at the time to build it and the investment versus maybe acquiring, I would say, new capabilities and maybe the skills with it at a faster pace, we might consider that.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you, and congratulations on such a great quarter, guys.\n\nNir Debbi -- Co-Founder and President\n\nThank you.\n\nOfer Koren -- Chief Financial Officer\n\nThanks, Pat.\n\nOperator\n\nLadies and gentlemen, this concludes our question-and-answer session. I'll turn the floor back to Mr. Debbi for any final comments.\n\nNir Debbi -- Co-Founder and President\n\nThank you. On behalf of Ofer, myself and the entire Global-E team, I would like to thank you all for joining today and for your ongoing support as we continue on our exciting and ambitious journey. With yet another great quarter, we very much look forward to seeing you again on our future earnings calls. Goodbye, and take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nErica Mannion -- Investor Relations\n\nNir Debbi -- Co-Founder and President\n\nOfer Koren -- Chief Financial Officer\n\nWill Nance -- Goldman Sachs -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nSamad Samana -- Jefferies -- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nSandy Beatty -- Morgan Stanley -- Analyst\n\nAlex Sklar -- Raymond James -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nUnknown speaker\n\nPat Walravens -- JMP Securities -- Analyst\n\nMore GLBE analysis\n\nAll earnings call transcripts"
}