{
  "companyName": "Petco Health and Wellness Company",
  "companyTicker": "WOOF",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/petco-health-and-wellness-company-woof-q2-2022-ear/",
  "content": "Petco Health and Wellness Company (WOOF 0.64%)\nQ2 2022 Earnings Call\nAug 24, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to Petco's second quarter 2022 earnings conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Benjamin Thiele-Long, Petco's director of executive and business communications. Benjamin, you may begin.\n\nBenjamin Thiele-Long -- Director of Executive and Business Communications\n\nGood morning, everyone, and thank you for joining Petco's second quarter 2022 earnings conference call. In addition to the earnings release, there is a presentation infographic available to download on our website at ir.petco.com, summarizing our second quarter 2022 results. On the call with me today are Mr. Ron Coughlin, Petco's chief executive officer, Mr.\n\nBrian LaRose, Petco's chief financial officer. In a few moments, I will invite Ron and Brian to provide their perspective on Petco's financial and operating performance for the quarter and our outlook and priorities for the quarters and year ahead. Before they begin, I would like to remind you that on this call, we will make forward-looking statements regarding our current plans, beliefs and expectations which are not guarantees of future performance and are subject to a number of risks and uncertainties and other factors that could cause actual results and events to differ materially from results and events contemplated by such forward-looking statements. These risks and uncertainties include those set out in our earnings release and our filings with the Securities and Exchange Commission.\n\nThese forward-looking statements are made only as of the date marked and except as required by law, we undertake no obligation to update or revise any of them, whether as a result of new information, future events or otherwise. In addition, today's presentation contains references to non-GAAP financial measures. Reconciliations of these non-GAAP financial measures to the most directly comparable GAAP financial measures are included in our earnings release and our presentation, as well as in our filings with the Securities and Exchange Commission. And finally, during the question-and-answer portion of today's call and to allow us time for questions from as many participants as possible, we'd be grateful if you could keep to one question and one follow-up.\n\nWith that, let me turn it over to Ron.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nGood morning, everyone, and welcome. As always, I'd like to begin my remarks clearly and simply. The Pet category continues to grow. Petco's business continues to grow.\n\nOur customer base continues to grow, and our unique competitive moats continue to deepen. Despite the current economic environment, the Pet category is once again proving its unique defensive growth characteristics, and the focused execution of our 29,000 Petco partners, both improve the lives of countless pets and pet parents and delivered tangible progress against our strategic priorities, including further expansion of our Vet network and capabilities, continued mix shift toward premium products, the addition of over 100 experiential fresh frozen pantries in pet care centers, and double-digit growth in recurring and loyalty customers. Importantly, our nondiscretionary categories of consumables and services continue their strong upward trajectory. As expected and similar to other consumer categories, inflationary pressures have softened the discretionary areas of our business.\n\nThis transitory response is consistent behavior during previous recessions and past experience indicates a return to growth with economic improvement and the passing of the stimulus overlap period. Additionally, our team has done a nice job managing supply chain challenges and their impacts while maximizing sustainable customer and business growth. Importantly, in aggregate, we feel comfortable with our inventory position, both in quantity and makeup. Having operated in the current economic environment for several months now, we have greater clarity in terms of consumer and cost dynamics and have adjusted our assumptions for the full year.\n\nBrian will share these shortly. Turning to key numbers. Comparable sales were up 4%, equating to 23% and 34% on a two and three-year stack. Net revenues grew by 3%.\n\nOur unique model and powerful marketing continued to win new customers. Our active customer base grew by double digits year over year, and we added 325,000 net new customers in the quarter. This is our 14th consecutive quarter of growth in our customer base. Recurring customer revenue grew by 54% year over year, driven by repeat delivery, insurance, top box and Vital Care members.\n\nTotal active Vital Care customers reached 282,000 in the quarter, including customers we've converted into Vital Care with the acquisition of Thrive. Customers joining Vital Care have been increasing their visits and spend by double digits, with a lift in spending across all categories and delivering a 3.5 times higher LTV in average customers. This is up 10% from last quarter. The additions we made with Vital Care 2.0 in March have resonated with pet parents who clearly see the value in this program, especially in the current economic climate.\n\nThe average pet parent can save over $300 annually and from Petco's standpoint, we capture far greater share of wallet with around 30% of Vital Care customers new to food and 40% new to services, both up versus Vital Care 1.0. We have a robust road map of enhancements to come, allowing us to add many more members and capture further share of wallet. We look forward to sharing more details soon. The value of loyalty membership is significant, especially when combining Vital Care with our existing 1.6 million Grooming and Nutrition Perks members, we continue to increase visits and spend by almost 50% and 40%, respectively, year over year, and they have over two times higher LTV than average customers.\n\nDemand for services has proved resilient delivering 13% year-over-year growth, translating to a robust 62% growth on a two-year basis, driven by strength in both Grooming and our Veterinary business. Services are such a differentiator versus online and Max competitors and pet parents, who see the value in our training, veterinary services and grooming. They also act as a feeder for Petco into a broader health and wellness ecosystem, including OTC solutions, Rx food, Rx medicines and insurance. Specifically, our Veterinary services, a strategic long-term growth driver and competitive moat for Petco.\n\nThis has been a quarter with exceptional progress. We closed the Thrive acquisition in May, and integration is going ahead of our plans. We've now added over 600 veterinarians to our network in the last six months, alone. We opened 11 new vet hospitals in the quarter and remain on track for a target of 50 new hospitals for the full year.\n\nWe also made significant enhancements to our online booking systems allowing customers to seamlessly view deployment availability across multiple locations and driving a 30% increase in online hospital bookings. Every day becomes more obvious that our vet model positions Petco to women customers. Not only does our full-service hospital mix of preventative, diagnostic and treatment give pets the best possible care, but our ecosystem of mobile in-store clinics provides the cost and convenience to fit every pet parent's needs. And we are rapidly becoming a disruptive innovator in the vet space, evidenced by our collaboration with Butterfly iQ+ that technology bringing their cutting-edge handheld ultrasound system to all of our hospitals by the end of the third quarter.\n\nThis not only allows us to provide pet parents peace of mind with on-site diagnostics, it also removes the need for referrals out of our hospitals and enables us to capture that high-margin revenue. It's also a talent magnet, being one of the most sought-after technologies veterinary professionals asked for before choosing which hospital to join. In merchandise, as in Q1, consumables continue to surge, demonstrating the recession-proof nature. Sales grew 12% year over year and 37% on a two-year stack.\n\nThis strength is great for the long-term health of our business as consumable customers have a higher retention rate and bring a 30% higher LTV than customers who don't buy consumables that much. Our over-index to the pet parents to take the best care of their pets and who are the highest-spending customers continues to power a multiyear shift to healthier premium food even in this hyperinflationary environment. These include high-end Kibble brands like ORIJEN, Royal Canin, Hill's, Taste of the Wild, The Honest Kitchen that can't be found in the mass or grocery channel. And pet parents are continuing to migrate to more premium, fresh frozen brands like JustFoodForDogs, Instinct and Freshpet.\n\nWe opened our second JustFoodForDogs kitchen where we actually make the food in our sports arena Pet Care Center in San Diego. These kitchens really bring the fresh food experience to life creating unique brand-building experience at Halos, an entire market to drive awareness and trial. To summarize, make no mistake about it. We continue to drive a positive mix shift toward more premium and super premium foods.\n\nWe're also mix shifting toward own brand consumables. Our WholeHearted brand took more share from lower quality, more broadly distributed brands with over 30% growth year over year. When you combine the growing strength of our WholeHearted brand, with the macro trends of premiumization and fresh frozen, the future is clear to us. That's why today, we're delighted to announce the launch of WholeHearted Fresh Recipes as a pull of next step in our nutrition leadership.\n\nIn collaboration with JustFoodForDogs, we're launching an exclusive new human-grade fresh and frozen own brand pet food as part of the WholeHearted line, available Pet Care Centers and online beginning this month. I was thrilled to see a brand new WholeHearted cooler in our Carmel Valley location near the office two weeks ago. Overall, our owned and exclusive brands continue to distinguish our business from competitors. Our supplies remain a cornerstone of Petco's offering, including our owned and exclusive Reddy brand, which even now offers clearing beds and clothing to help us keep cool in these record-setting temperatures.\n\nStructurally, our suppliers are highly profitable, extremely well positioned and at scale, providing significant financial advantage versus online-only competitors. The lapping of year-ago stimulus and the current inflationary environment does create transitory pressure on the suppliers' business growth, but it's a pressure which history has shown dissipates as lapping dynamics and inflation moderates. Importantly, our customer insight grounded innovation engine continues to be a core competence. In the quarter, we launched an exclusive partnership with Clif with plant-based jerky, a smart crossover from human food.\n\nIf you're grabbing a Clif bar on a hike, why can't get to the border county have one, too. We also exclusively launched back country recreational year, meeting pet parent's desire to spend more time outdoors with their pets with fun floating, stay dry rain gear and even a doggy tent. The brand is off to a super strong start. Our Pet Care Centers delivered their ninth consecutive quarter of positive comp sales, fueled by growth in basket via continued mix shift toward premium merchandise and our ability to pass through pricing.\n\nResult of both the uniqueness of our offering and the incredible capabilities of our Petco partners to connect on a highly personalized level. This past quarter, I visited Pet Care Centers in Arizona, Idaho, Washington State, Texas, California and New York. In each case, I met passionate Petco partners focused on improving the health and wellness of pets, keeping each other safe during attracted -- pandemic environment and building a stronger Petco business. I am in all of the spirit of Petco partners across our network.\n\nIn the labor market that remains competitive, Petco stands out as a caring, fund purpose-driven environment for our partners, helping pets and pet parents on a daily basis. Correspondingly, in the last quarter, we saw applications to work at Petco increased 16% over prior year. Our Mexico business continued its upward trajectory with sales up double digits year to date. I'm very excited to share that our neighborhood farm and pet supply strategy is now live and resonating with the local community.\n\nEarly indications from our first location in Floresville, Texas, which opened in June are exceptional. Financial performance and customers are exceeding our expectations, with particular strength in supply of companion animals, meeting an unmet need in this market. During the grand opening, multiple customers came up to me and said, Thank you. Thank you.\n\nThank you. We needed a pet-focused retailer here, and I no longer need to drive to San Antonio all the time. It was also the first opening we remember having horses in attendance. We're excited in what we're learning in the now addressable multibillion-dollar farm-and-feed market across segments like Equine, chicks and bovine.\n\nWe're looking forward to the multiple-planned additional openings for Q3 and Q4. Our Digital business continued to drive powerful, profitable growth through innovations, including in-app repeat delivery sign-ups and multi-location fulfillment for same-day delivery. In Q2, total digital sales were up 10% or 143% on a three-year stack. We've more than doubled our Digital business over the last three years.\n\nOur digital customer spend is now up over 20% year over year, continuing to outpace our key online competitors' recent trends. We also expanded digital margins year over year through distribution efficiencies, including our renewed DoorDash contract and rapid acceleration in our Ad Network revenues. But it's a role that a digital plus brick-and-mortar play in our ecosystem that is more significant. The deployment of our Pet Care Centers is micro distribution centers creates an unmatched competitive advantage and agility.\n\nWe continue to not only fulfill nearly 80% of the digital orders through our Pet Care Centers but delivered a record number of same-day delivery orders in the quarter, a 60% increase year over year. Needless to say, same-day delivery provides a competitive moat versus our key online competitor. Now, stopping there. We added 75 new brands to our online assortment so far this year, including much loved brands like Danie Pet, a digitally native and science-backed multivitamin supplement and tech-focused offerings like ring webcams and iRobot vacuums.\n\nFinally, on digital, our advertising network is now firmly a jewel in Petco's crown with over 200% growth year over year, our platform and bespoke data capabilities provide a compelling offering for vendors connected pet parents and convert them down the marketing funnel. We're confident our pipeline of in-flight enhancements will support projected triple-digit growth year over year for full year 2022. Before I hand it over to Brian, I'd like to take a moment to focus on our North Star, our purpose, and it starts with our partners. We've been focused on improving wages for the last four years.\n\nAnd as a result, our average total hourly compensation is currently over $17 per hour. This month, we announced we're lifting the floor with every non-trainee at Petco, either brand-new or tenured will make $15 base wage per hour or more by the end of the year. We believe this is the right thing to do, particularly given cost of living increases, and it recognizes the extraordinary contributions our Petco partners make every single day. It will enhance retention and make us an even more attractive destination for talent.\n\nPetco partners also celebrated our community at pride events across the country, joining virtual events from Happy Hours panel discussions on LGBTQIA+ communities in the veterinary field, joining the Annual Pride parade at our hometown San Diego and even joining a pride feed spin class led and DJ by our very own, Brian LaRose. In June, we published our environmental, social and governance report for fiscal year 2021, giving an in-depth look at our sustainability progress. In it, we outlined the proactive steps we're taking as a leader in our category for finding sustainable solutions that positively impact the well-being of pets, people and the planet we share. Of particular note, over the last year, we've engaged with over 350 product vendors as part of our efforts to increase our sustainable product mix to 50% by the year 2025.\n\nWe eliminated nearly 8 million pounds of cardboard and 66,000 pounds of plastic through a digital fulfillment, and we also published our first EPA Scope 3 carbon footprint. And together with Petco Love, we continue our mission to help and save pet lives. We've now delivered over 917,000 free vaccines to date to under-resourced communities putting us in arm's reach of our $1 million vaccine commitment in partnership with Merck. We also saved over 95,000 pet lives in the quarter alone and have reunited over 10,000 pets with our loving families to date through Petco Love Lost.\n\nIn closing, our ecosystem and results-driven orientation is enabling growth and we continue to make a difference in lives every single day. With our recently evolved leadership structure, we're laser-focused on putting customer centricity and operational excellence at the center, meeting the customer need of a one-stop experience for the pet health and wellness. As always, thank you to all our amazing Petco partners and customers. Despite the environment, this is an exciting time for Petco and we remain grateful to our partners who are on the journey with us to deliver purpose-driven performance every day.\n\nWith that, let me hand it over to Brian.\n\nBrian LaRose -- Senior Vice President, Finance\n\nThanks, Ron. At the halfway mark for the year, we remain confident in our position as the leader in pet health and wellness and are proactively managing the macroeconomic environment. Across the entire business, teams have done an amazing job at remaining laser-focused on driving performance every day and controlling our controllable while delivering against our strategic priorities and making investment decisions with a long-term perspective. Looking at the quarter specifically, we delivered yet another quarter of strong net revenue at $1.48 billion, up 3% year over year with comparable sales of 4% or 23% on a two-year stack with continued strength in average basket trends.\n\nTotal Services grew 13% year over year and 62% on a two year stack across Vet, Grooming and Training. Momentum in consumables continued up 12% year over year and 37% on a two-year stack and delivering a 30% higher LTV over our other customers. It's clear our team is executing extremely well, and we were able to leverage our structural advantages versus our competitors, including the ability to offer BOPUS, same-day delivery and Ship from store by leveraging our Pet Care Centers as micro distribution centers. You'll remember in our last couple of earnings calls, we outlined that supplies in companion animal will be lapping a stimulus-driven elevated prior year comparable.\n\nLike others, we've seen some softening in discretionary spend with supplies in companion animal down 9% year over year. Finally, before we move down the P&L, we closed on the purchase of the remaining stake in our Thrive joint venture in May at a cash price of $35 million. This is a real accelerant in our vet business, bringing approximately 800 veterinary professionals to Petco, combining the hospitals under a single brand and delivering an improved ROI. In addition, during the second quarter, we incurred approximately $11 million of acquisition-related integration costs, bringing total year-to-date spend to $13 million representing the majority of the $15 million to $20 million total estimate we communicated last quarter.\n\nAnd although early stages, we're pleased with what we're seeing on integration and return on investment. Moving down the P&L. Gross profit decreased $5 million or 1% to $594 million. Gross margin was 40.1%, down 170 basis points year over year and 110 basis points on a quarter-over-quarter basis driven by the mix impact of consumables, onetime Thrive integration-related costs and elevated freight costs.\n\nGross margin when adjusted for the Thrive cost was 40.6%. SG&A as a percent of revenue improved from 37.8% in Q1 to 36.8% in Q2, down 100 basis points, demonstrating our cost discipline. Thrive transaction and integration-related charges included in SG&A accounted for approximately 30 basis points, translating to an adjusted SG&A rate of 36.5%. On an absolute basis, SG&A expense was $545 million, up $19 million or 3.5% from prior year.\n\nExcluding Thrive, SG&A would have been $540 million, up $14 million or 2.7% from prior year as we remain adept in managing costs while continuing to invest for sustained future growth through infrastructure and our people. And while there will always be puts and takes in aggregate, our network inventory levels remain well managed and in line with demand. Q2 adjusted EBITDA was $142 million, a decrease of 8.5% from prior year, with an adjusted EBITDA margin rate of 9.6% compared to 10.8% in the prior year, a decline of 120 basis points. Quarter over quarter, adjusted EBITDA was up 60 basis points.\n\nQ2 adjusted EPS was $0.19, a decrease of $0.06 from the prior year and up $0.02 quarter over quarter. Based on 266 million weighted average fully diluted shares, as well as a normalized effective tax rate of 26%. We continue to have strong liquidity, ending the quarter with $569 million, inclusive of $125 million cash and cash equivalents and $444 million of availability on our revolving credit facility. Looking at cash flow for the first half of the year, we generated strong cash from operations of $100 million and had $136 million in capital expenditures which increased 36% year over year as we continue to reinvest in future sustainable growth across vet, fresh frozen and digital infrastructure.\n\nTo echo Ron's remarks, the halfway point of our fiscal year provides a distinct opportunity to both reflect and examine the balance of the year ahead. Today, we have greater clarity of the extent of the incremental headwinds likely to impact our business and our customers, which means we also have greater clarity on how to stay ahead of them. Looking ahead, the current economic environment necessitates that we be pragmatic while also ensuring we can still make long-term investments essential to our future success. Specifically, while momentum has continued into Q3, we believe it is prudent to adopt an appropriately cautious outlook for the full year.\n\nWe, therefore, are making the following adjustments to align with our current expectations as follows. Revenue of $5.975 billion to $6.05 billion, adjusted EBITDA between $580 million and $595 million, $250 million to $275 million of capital expenditures, adjusted EPS between $0.77 and $0.81, assuming $90 million of interest expense, 26% tax rate and a 267 million weighted average diluted share count. When thinking about our guidance, there are a few things to keep in mind. Our ongoing ability to proactively manage the dual vectors of inflation, both in terms of impact to shipping and to the customer through efficiencies in our Pet Care Centers, same-day delivery and membership offerings.\n\nOur consumables and services businesses continue to be nondiscretionary with strong growth expected to continue. We believe the current pressures on supplies in companion animals are transitory in nature and anticipate an improving trajectory as inflation and other economic pressures dissipate. While in-stocks continue to improve as vendors are scaling to meet the demand, our in-stock position is currently slightly better than where we started the year. And we fully anticipate the typically seasonal uplift of the holidays from Q3 to Q4.\n\nAbove all, Petco remains a strong, profitable growth company with a unique and innovative ecosystem in a resilient category that remains highly relevant for consumers over the long term. In short, we remain focused on our goals and we'll never stop pushing ourselves to succeed. This continued drive for operational excellence and sustained profitable growth wouldn't be possible without our Petco partners. Their unwavering optimism and attention to detail and their ability to help pet parents maximize the health and wellness of their pets.\n\nThank you for your time. And with that, we'll move to questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Kate McShane with Goldman Sachs. Please go ahead.\n\nKate McShane -- Goldman Sachs -- Analyst\n\n Good morning. Thanks for taking your question. I wondered if I could just focus on traffic versus ticket during the quarter and the cadence of same-store sales throughout the quarter. I know you mentioned you have momentum going into Q3, but I wondered if you could give a little bit more context around that.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nThanks, Kate. So this marks the ninth consecutive quarter of comp growth was in brick-and-mortar. So we've continued to show momentum in brick-and-mortar. And that's due to our unique portfolio, our partners in the aisle, e-commerce assets and the pricing leverage.\n\nOur basket has continued to increase, ticket size has increased. We also have a healthy and growing services business, which creates a unique ecosystem, as you know. And we have differentiation versus mass and grocery. We continue to see great engagement in the Pet Care Centers.\n\nThere is trip consolidation, largely driven by gas prices. But all in all, between the basket and the ticket size, we continue to drive positive revenue growth and increased efficiency because we're getting more sales with lower trips, so that's an efficiency driver for us.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nAnd as a follow-up question, we just wondered if you could talk about some of your strategies around pricing just given the amount of inflation that we've seen, particularly in consumables, just how pricing has changed for you maybe quarter on quarter? And if there's been any change in the promotional environment given the softness in some of the discretionary?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. No, thanks for the question, Kate. So we took pretty holistic pricing actions in the second half of last year, which we've talked about. Since then, we just spend more moderated.\n\nWe have taken some pricing actions. Whenever we do that, we do deep analytics on a SKU-by-SKU basis to test the elasticity of that pricing model to make sure that we're actually not keeping demand off the table. So we've taken selective pricing actions in the first half of the year, not like we did in the second half of last year. Consumables remain strong.\n\nSo we have not seen a trade down impact. We've not seen any sort of elasticity impact from pricing actions we've taken to consumables. So we feel really good about where we're positioned from a pricing standpoint. In terms of promotional activity, we've not seen a dramatic change there.\n\nThe market remains strong. Consumables remains strong, and the market overall, including our competitors, remains very balanced.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nI would just add, you still have more demand than supply. So from a fundamental standpoint that drives pricing rationality. And then, the other piece of your question, Kate, was around Q3. And as Brian said, we're pleased with the momentum that has continued into Q3 on both total revenue, as well as traffic trends.\n\nOperator\n\nOur next question comes from Steph Wissink with Jefferies. Please go ahead.\n\nSteph Wissink -- Jefferies -- Analyst\n\nThank you. Hello, everyone. I want to follow up on Kate's question and your response, just with respect to in-stock levels. Any sense of when you might be back at grade in terms of matching supply and demand?\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nSo it's a dynamic we've been talking about. There is not one of our vendors that planned for the millions of new pets that happened in 2021 and there continues to be more adoptions versus pre-pandemic into this year. So that's the bad news. The good news is, it is all scaling.\n\nI was at a brand-new plant for Honest Kitchen in Dallas several months ago. I met with the host team. They just announced big investments. So capacity is coming on real time and correspondingly, we're seeing improvements in our in-stocks and enhancements to our ability to match supply to demand every week.\n\nSo it's all getting better. A lot of that capacity got approved in '20, early '21, and that's now starting to come on. So it will get better and better as we progress through the second half of the year and into '23.\n\nSteph Wissink -- Jefferies -- Analyst\n\nOK. That's helpful. And Brian, one for you. I'm just trying to square up the guidance in terms of the revision-to-earnings versus the revision-to-sales? It doesn't look like a significant revision-to-revenues.\n\nSo just trying to kind of back into what you're assuming in the middle of the P&L for the back half that's lending to a more significant profitability cut?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. No, thanks for the question. Look, let me start with, as you stated on revenue, we grew with the quarter and we are setting ourselves up for sustained growth in the future. So what we're taking in terms of guidance is a balanced approach.\n\nWe're managing the short term. We're continuing to reinvest for the long term. So we have a $40 billion incremental TAM opportunity in front of us. So we continue to lean into that investment.\n\nWhat you're seeing in terms of the guidance is there are a couple of vectors in play. We do have a very strong consumables business, which continues to grow double digits. We expect that to continue. We have a resilient services business where we have not seen a demand impact in terms of elasticity, we expect that to continue.\n\nWe're seeing some softening in that discretionary space in terms of supplies in companion animal and so we're taking a more balanced approach to that. Now, the good news with that category is that category has proven through prior turbulent economic cycles that they return to profitable growth as the economy improves. So we're not sitting still, Stephanie. We're taking -- we have proactive programs in place to rolling out to accelerate those discretionary categories, whether it be Vital Care, whether it be Nutrition Perks, and so we are setting guidance in terms of what we currently see in the economic environment.\n\nWe're in a different space than we were 90 days ago, and we believe that our guidance reflects what we currently see in the market.\n\nSteph Wissink -- Jefferies -- Analyst\n\nOK. Brian, just to clarify. So would you like us to more heavily impact the gross margins based on mix? Just given that you saw some nice SG&A progress in the quarter, you want us to continue to carry that forward into the back half.\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes, I think that's right. Look, we -- the team did a great job on SG&A. If you look quarter-on-quarter, we improved 100 basis points quarter-on-quarter in terms of SG&A leverage. If you look at gross margin, there are kind of three factors there, Stephanie.\n\nFirst, yes, as you know, there was a onetime Thrive impact of 50 basis points. Second, as I just talked about, there's a transitory mix pressure in terms of consumables growth impacting gross margin. There are also some elements of supply chain, in particular, freight that impacted gross margin. But we've made structural improvements in our gross margin profile in terms of improvements in consumables mix as we shift into premium.\n\nWe've improved our digital gross margin, that profile of business in terms of distribution savings and Ad Networks. And look, when we look mid-to-long term, we expect some of those things to abate, but we are taking a more cautious and conservative outlook in terms of our guidance on the bottom line.\n\nSteph Wissink -- Jefferies -- Analyst\n\nVery helpful. Thank you so much.\n\nOperator\n\nOur next question comes from Anna Andreeva with Needham & Company. Please go ahead.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nGreat. Thank you so much. And good morning, guys. Two quick follow-ups from us.\n\nCan you talk about the gross margin puts and takes as we go through the year? You called out freight as one of the pressure points during the quarter. Are you seeing freight costs moderate as oil prices have been coming down here? And then secondly, on supplies, you mentioned strong trends quarter-to-date. Has that category improved at all? And what are you implying for supplies for the year?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. Let me take the first one, Anna. So in terms of some of the inflationary pressures, it's really important to remember that in areas like freight, we don't get a real-time adjustment on some of those charges. So for example, the cost inputs that we received in Q2, a lot of those are capitalized in inventory and they get flushed through the P&L as we roll that inventory and sell it through.\n\nSo over the midterm, as inflationary pressures abate and inventory turns over, we would anticipate some relief in those areas. It's just not immediate. So to be clear, we will see more favorable costs, but they're not reflected in Q3. I would expect that gross margin and EBITDA from a seasonal standpoint would be improved in Q4 relative to Q3 as we had that seasonal uplift in the fourth quarter.\n\nIn terms of your -- the second part of your question was related to -- I'm sorry, can you repeat that?\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nIt was supplies.\n\nBrian LaRose -- Senior Vice President, Finance\n\nSupplies, yes.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nI'll take that one. So first, I want to reiterate, a strong consumables business is fantastic for our business. It's sticky and the LTV is 30% higher than a non-consumables customer. On a three-year basis, supplies is up almost 30%.\n\nSo we have been scaling supplies strongly. It's highly profitable and it gives us financial advantage versus our key competitor because of the strength of our supplies business. Inflation is pressuring that business. It's a combination of inflation and the year over year on stimulus.\n\nAs those abate, we expect those to come back. And that's reinforced by consumer research that says that of the folks that aren't buying these types of products, 40% are actually postponed purchases, not canceled purchases, so we anticipate that coming back. And we're excited about coming into holiday. We do great business on Halloween, we do great business on Christmas and Hanukkah and our team has fired up, we have great merchandise against that.\n\nSo we are -- as Brian said, we're not passengers on the bus. We're launching initiatives to catalyze purchase in these categories. But as you said, we're taking a cautious projection for the time being, given the economic uncertainty.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nOK. That's helpful. I appreciate it. Can I squeeze another one in? What are you guys seeing in terms of the overall growth in the pet space? There's been some chatter about higher relinquishments coming in.\n\nJust curious what's your view.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nYes. This is something that we both track closely and quite frankly, I care a lot about. The fantastic news is relinquishments are below pre-pandemic levels. So there's the episodic new story on this, but through Petco Love, we're in touch with the majority of rescue scale, rescues around the country and relinquishments are below '19 levels, which is great news.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nThank you so much.\n\nOperator\n\nNext question comes from Seth Basham with Wedbush Securities. Please go ahead.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot and good morning. My first question is just a little bit more clarity on the outlook from the margin pressure standpoint. The biggest factors pressuring your margin outlook for the balance of the year are those from mix or supply chain or investments in loyalty programs or otherwise?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. I think you nailed the order, Seth. The first -- the biggest impact is the transitory mix pressure, which we would expect to reverse in the mid-to-long term as the economy improves. The second biggest impact would be the freight and distribution costs, which, as I said a little bit earlier, we capitalized some of those costs inventory as those turn, we would expect those to improve.\n\nBut I mean, your third point is valid. We are balancing our approach here. So we are managing the short term, but we continue to invest. We have a massive opportunity in front of us, a $40 billion incremental TAM.\n\nWe continue to invest in that opportunity to make sure that we come out of this economic cycle stronger and set up for the long term.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThat's helpful. And then, my follow-up question is just looking at the Heartgard category. Where do you see inventory levels being right now for the industry? And do you think that area of the industry gets more promotional in the back half of the year and could impact margin rate for you guys?\n\nBrian LaRose -- Senior Vice President, Finance\n\nNo, look, Seth, we feel really good about our inventory levels. There's a lot of noise in the market in terms of this sector and inventory levels we do not have those same challenges. We feel really good. The team has done a great job into inventory levels.\n\nIf you look at the year over year increase, that was driven a lot by cost. From a unit standpoint, our units are up just slightly ahead of revenue from a year-over-year basis and relatively flat quarter-on-quarter. So I feel really good about our inventory position. And going back to the promotional environment, we have seen rationality in the promotional environment across consumables, across supplies, and we do not anticipate that change.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThat's helpful. And if I could just throw in one more follow-up for Ron. Just thinking about Vital Care and how the sign-ups there are trending helped to your expectations and the spend per customer? Are those on track and you think that creates more opportunity in this higher inflationary environment for your customers?\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nYes. Thanks for the question, Seth. So I'll take the latter part first. Absolutely, Vital Care provides opportunity in this economic environment.\n\nCustomers can save over $300 annually. So it is the right program at the right time, and it's differentiated. Nobody has anything like it. In terms of sign-ups, we are ahead of our internal plan, and there will be news in the coming months -- month in terms of ways we're going to catalyze even further sign-ups and accelerate sign-ups.\n\nSo we're very excited about Vital Care in terms of where we are. 2.0 is outperforming 1.0 and there will be more news shortly that will further accelerate Vital Care and it's right on trend right now in terms of customers. For that mid- to lower end customer, it is absolutely the right program to help them save money. And for the high-end customer, it really helps us to gain more of their share wallet.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from Zack Fadem with Wells Fargo. Please go ahead.\n\nDavid Lance -- Wells Fargo Securities -- Analyst\n\nHey, guys. This is David Lance on for Zack. I guess first one for me would be how your expectations for the category have changed in the second half of the year with the lower top line outlook?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. Look, David, our expectations for the category haven't changed. We still believe this category is a great opportunity for us, 7% long-term expected growth. And if you look at our long-term algorithm, we still expect to gain share in that category over the long term.\n\nSo what we're seeing in terms of the second half outlook is transitory. Those discretionary categories are pressured. What we've seen in prior economic cycles if those categories are temporarily impacted, they do respond well as the economy improves, and we would have no different expectations this time around.\n\nDavid Lance -- Wells Fargo Securities -- Analyst\n\nGreat. And then, just one follow-up. Can you talk about what you're seeing with some of the recent initiatives with the shop-in-shop with Lowe's and Rover?\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nYes. We're really happy with the shop-in-shop with Lowe's. It's going well. And actually, just to give proof of our ecosystem coming to life, we're actually now running Petco clinics in the parking lots of those locations as well.\n\nSo we're excited about that. And it's a great complement actually to our small town rural initiatives as well. So it's going well.\n\nOperator\n\nOur next question comes from Steven Zaccone with Citi. Please go ahead.\n\nSteven Zaccone -- Citi -- Analyst\n\nGreat. Thanks very much for taking my question. Good morning, guys. So maybe to follow up on the revision-to-EBITDA guidance.\n\nSo the new guidance calls for EBITDA down 2% to up 1% on revenue growth of up 3% to 4%. The analyst day earlier this year, you talked about EBITDA growth tracking faster than revenue as a framework. So as you take a look at the year, do you see the primary drag to EBITDA this year is onetime in nature? I guess if consumables strength continues into next year, would this be an ongoing drag to EBITDA margins?\n\nBrian LaRose -- Senior Vice President, Finance\n\nNo, thanks for the question, Steve. We do believe it's onetime in nature. So we are still really confident in the long-term algorithm that we laid out at investor day, where, as you said, we expect EBITDA to grow faster than sales growth. What you are seeing this year is transitory in nature that mix shift from supplies and companion animal into consumables.\n\nLook, the good news about that is consumables customers, if you look on a long-term basis, have 30% higher LTV than a typical customer. So that's good news for us. And if you look at back at past economic cycles, the impact to supplies in companion animal are transitory, they are temporary. We expect that to rebound.\n\nSo -- and then if you look at cost, what we're seeing in terms of input costs from DCs, as well as freight is also transitory. We would expect that to abate and start to normalize in the second half. So as we look to '23 and beyond, we would expect EBITDA to return to our long-term output.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nAnd we're already seeing improvements in freight costs.\n\nSteven Zaccone -- Citi -- Analyst\n\nGreat. The follow-up I had was on -- you mentioned that you haven't seen any sort of trade down in the business. And I guess I'm curious. Pet has seen this premiumization that's been a secular trend.\n\nWhat gives you confidence that won't be at risk to a trade down of just people scaling up to buy more premium food?\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nWell, the first thing is this is, as you cited, a long-term trend, right? This is a decade-long trend. And underneath it is a powerful consumer insight and powerful segmentation which is humanization has been a trend for the last decade. And the humanization trend is across all segments, but particularly so with Gen Zers and Millennials. And as Gen Zers and Millennials become a greater proportion of the pet parents that creates upward pressure on premiumization or upward trend on premiumization.\n\nSo it only continues -- and the microcosm of that is fresh frozen, right? Fresh Frozen is predicted to go from $1 billion plus right now to $4 billion to $5 billion over the next three years. It's surging -- and that is, to me, the epitome of the transition toward more premium and humanization. So we're not seeing anything slow down. And in fact, actually, it's not just on consumables.\n\nYou look at Reddy -- our Reddy business is -- continues to grow double digits. And so, premiumization even in supplies continues concurrently.\n\nSteven Zaccone -- Citi -- Analyst\n\nThanks for the detail. Best of luck in the second half.\n\nOperator\n\nOur next question comes from Simeon Gutman with Morgan Stanley. Please go ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey. Good morning, everyone. I wanted to talk about services for a minute. You mentioned that consumer discretionary, there was some weakness.\n\nIs there any overlap or a line of sight into either the vet spending or the grooming side? Have you seen anything change in frequency? And then how are you thinking about it for the second half?\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nYes. Both businesses are strong. Trips are up, revenues up double digits and our vet business continues to have a positive impact on center store sales. So, similar to my commentary on premiumization, people aren't cutting back on grooming or vet visits.\n\nAnd that's providing us with strength and buttressing our trips. There's a demand part of that equation and there's a supply part of that equation. And one of the things that makes us really excited is we added 600 vet professionals to our network in the first half of the year, 800 veterinary professionals via Thrive when you include the tax. So our capacity has seen a significant increase which will only continue the momentum that we're seeing.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThe follow-up is on the supplies and companion animal. I guess, can you take us through the sequential change over the last couple of quarters in this? And what I'm trying to zero in on is the impact either of gas prices that it had on this versus general normalization against COVID trends versus industry trends. Is there any light that you can shed or the way you assess it? Because we've seen some gas price let up, did the business improve a little from that or it's not that we're normalizing against COVID, and it's not about the near-term fluctuation in, let's say, gas prices?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. Let me take a couple of steps that, Simeon. So first, we look at it on a couple of different ways. One of the things we've taken a look at is on a three-year trend because you have to normalize some of the dynamics over the last couple of years on three-year trend, the supplies and companion animal business is very strong, up over 20% on a three-year stack.\n\nIf you look Q1 to Q2, we saw consistency in the business is what I would say. If you look at what we published in the presentation on the site, minus 9% in Q1, minus 9% in Q2 on a year-over-year basis, again, three years strong, over 20%. In terms of gas prices, as I said a little bit earlier, while some of those have started to come down in terms of our P&L and how that impacts consumers, our P&L, we'll see some of that flush through later in the back half of the year as inventory turns. We have seen some trip consolidation in terms of our consumer behavior as gas prices have sort of stayed elevated despite some little bit of decrease.\n\nAnd again, going back to where this category is resilient, we have seen time to time again through prior economic cycles that this category responds. And as Ron said earlier, 40% of some of these -- of the purchases in supplies and companion animal are delayed, not canceled. We would expect that to come back.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThanks. Helpful. Thanks and good luck.\n\nOperator\n\nOur next question comes from Chris Bottiglieri with BNP Paribas Exane. Please go ahead.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nHey, thanks for taking the question. Just wanted to follow up on your last comment, Brian, it looks like the hard goods mix was flat quarter-on-quarter. What drove the gross margin decline ex of that acquisition? It looks like it was down 60 basis points. Is that all transportation? Or was it like the mix within hard goods or mix to consumables weaker this quarter?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes, both. So you hit it right on the head, Chris. So it was both -- it was mixed within that hard goods and it was transportation costs. So again, if you look in the market, I think there's some market noise about transportation costs starting to abate.\n\nThat is true. You do not get a real-time adjustment from that as some of those costs get capitalized and turn through inventory. So on a quarter-on-quarter basis, those transportation costs were a headwind. And then, if you look at the mix impact, as you said, it was relatively flat year over year, but there's mix within the mix as well.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nGot you. OK. That's helpful. And then, on SG&A, it looks like you're looking to raise the kind of base wage to $15 an hour.\n\nI guess how far are you off that level today in Q2? And what does that mean for spend in the back half? And then just a broader question. Maybe speak more of the labor environment, what you're seeing if that's flattening up a bit? Like it sounds like your applications are up like pretty enormously. So I kind of just want to hear your perspective on each of those.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nYes. Thanks, Chris. So first, our total wage is up above $17. So we've been working on this for a multiyear journey to get this to a good place.\n\nIt's been a personal objective of mine to get every single partner at Petco above $15, which is why we feel great about making the move. It was already baked into our long-term model to get over $15 as kind of the base in light of inflation and the impact that's having on people. We felt like now is the right time. In terms of the labor environment, Petco is a great place to work.\n\nYou get to leverage your passion for pets. We're a mission-based company. We take good care of our people. And as a result, our applications, as I said, are up double digits and actually up 30% on a quarter-over-quarter basis.\n\nSo we're able to attract talent, and these moves we're making on compensation only make it more so.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nThank you for the time.\n\nOperator\n\nOur next question comes from Elizabeth Suzuki with Bank of America. Please go ahead.\n\nElizabeth Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nJust wondering if you could go through capital allocation priorities, just given that you took down the capex guidance a little bit, but you also took up your interest expense assumption for the year. So presumably as rates are rising, and that cost is going up. So how are you thinking about where you want to deploy cash going forward and thinking about your leverage?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. It's a great question. So let me start with -- we have not come off of our long-term leverage guidance that we laid out at analyst day. In terms of prioritization, we still have a lot of investments with high ROI that we feel excited about.\n\nIn the first half of the year, we leaned in heavily into that. We also leaned in heavily to Fresh Frozen. So we expect to be in over 1,000 locations for JFFD by the end of the year. As we launch -- as we announced today, we have a WholeHearted Fresh Frozen launch that we are really excited about in the second half.\n\nThose are high priorities. That remains a high priority. The balance in terms of the takedown for capex for the year is just being pragmatic about how we balance that cash. As you said, we increased our interest expense guidance from $76 million for the year to $90 million.\n\nAs we look at our overall cash envelope, we felt it prudent to bring down that capital expenditure to $250 million to $275 million range. That said, we are not trading off our long-term investments. We will continue to lean into that. We will continue to lean into Fresh Frozen.\n\nWe will continue to lean into digital assets to improve our capabilities.\n\nElizabeth Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Michael Lasser with UBS. Please go ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. Brian, it looks like you're embedding pretty consistent comp into your outlook in the back half of the year, both on a one and a three-year geometric basis. This is despite what's probably been the vast majority, if not more than the majority of the comp being driven by inflation and you will lap some of the price increases that you took in the back half of the last year starting this year.\n\nSo do you expect that your units are going to accelerate as these -- as the inflation starts to abate? And if that's the case, would you also expect a corresponding improvement in our supplies business over the next couple of quarters?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. No, thanks for the question, Michael. Look, I mean, you hit it. If you look at our three-year stack, we actually see on a three-year basis, a slight acceleration in the second half.\n\nSo mid-30s on a three-year stack with a little bit better in that second half. We do expect more vet builds in the second half. So if you look at what we said, we said 50 to 60 beds for the year. We did 15% in the first half.\n\nWe would expect the vast majority of those to be in the second half. We have about 15 net PCC store adds in the second half of mix of small town rural and traditional PCCs. From a supply and NCA basis, look, we're being pragmatic about our approach to guidance in the second half. We do expect this category to return.\n\nBut I think we're in a different spot than we were 90 days ago. And as we look at the second half of the year, we felt it was appropriate to guide as we did to be pragmatic about how that category returns.\n\nMichael Lasser -- UBS -- Analyst\n\nMy question is -- please go ahead, Ron.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nSo Mike, I was going to add that we also have an improving the inventory situation. So that helps us in the second half as well.\n\nMichael Lasser -- UBS -- Analyst\n\nThat's helpful. And then, my follow-up question is understanding that you're running the business for the long term, how would you expect free cash flow to unfold over the next couple of quarters given that it was under pressure year over year in the first half of the year?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes, I'd expect it to get better in Q4, Michael. Q4 is a seasonally strong quarter. As we look at free cash flow, we look at it obviously on a couple of vectors. I was really pleased with the operating cash flow in the quarter that the team generated particularly around the way they manage inventory levels.\n\nWe will continue to lean into capex, although we've brought the guidance down. It is still a significant investment in capex for the year, which we feel really good about that long-term ROI. As we cadence through the balance of the year, I would expect free cash flow to improve in Q4.\n\nOperator\n\nOur next question comes from Peter Benedict with Baird. Please go ahead.\n\nBrian LaRose -- Senior Vice President, Finance\n\nOK. Maybe we don't have Peter. Maybe let's go to the next one, operator. We can come back.\n\nOperator\n\n[Operator instructions] Our next question will come from Oliver Wintermantel with Evercore ISI. Please go ahead.\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nYeah. Good morning, guys. A question regarding your net adds. Can you maybe tell us a little bit more about which areas were the most important to add to the net adds.\n\nWas it consumable, customer or services? That would be helpful.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nYes. There was strength across both. And I should say -- this is 14 consecutive quarters that we have added customers. It speaks to the strength of our marketing, speaks to the strength of our partners in the aisle, speaks to the strength of our digital offering, so 14 consecutive quarters of net adds.\n\nSo we're really pleased with it. There was strength across consumables, strength across services. If you think about -- we're now up to 200 vet hospitals that's bringing new people into our location. You think about our Perks programs, they're quite unique in terms of getting discounts on food, getting discounts on rooms that are differentiated and in a tough inflation environment, those are really appealing to customers.\n\nSo the adds are across both 14 consecutive quarters of adds.\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nGot it. And maybe this one is for Brian. Going back to that -- the question about leverage. And I think you said if you get to that leverage target that you set out by end of '23, we might look at some buybacks.\n\nJust see if anything of that thinking has changed.\n\nBrian LaRose -- Senior Vice President, Finance\n\nNo, nothing's changed there, Oliver. So we remain committed to what we laid out at analyst day. Although the current year guidance has changed, we have levers to actually improve that. So whether it be working capital, improvement in earnings, as I said a little bit earlier, we still believe the long-term algorithm and that return to EBITDA growing faster than revenue as we head into '23.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nWe are focused to getting to that destination.\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nGot it. Thanks very much and good luck.\n\nOperator\n\nOur next question comes from Peter Benedict with Baird. Please go ahead.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nHey, guys. Can you hear me now?\n\nBrian LaRose -- Senior Vice President, Finance\n\nYes. We thought we lost you, Peter.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nI don't know what happened. I don't know what happened there, apologies. Just, I guess, a quick question on -- you guys mentioned momentum continuing into 3Q. I'm just trying to understand what you mean by that.\n\nCan you expand on that? Is that comps were better in July than they were for the quarter and that's continued? Or what's kind of behind that comment? That's my first question.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nYes. What we'd say is our growth has continued into the third quarter. I think we're going to expand beyond that. We see transactions heading in a better direction.\n\nSo overall, we're seeing continued growth momentum, we're seeing transactions heading in the right direction. The -- from a mix standpoint, we're not seeing a dramatic change at this point.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nOK. That's helpful, Ron. And then, just with respect to the WholeHearted Frozen Fresh offering that you guys have come, can you maybe talk a little bit about -- I don't know how many SKUs you guys are planning to have? What's the pricing structure relative to the other kind of Frozen Fresh product that's in your store? How you price it relative to premium Kibble? Kind of where does it fit? And then lastly, just the timing of the refrigerated offering that was mentioned in this morning's press release.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nThank you. So they're synonymous. Refrigerated offering and the new WholeHearted operator is synonymous. So the human grade Fresh Frozen is synonymous with refrigerated offering.\n\nWe're really excited about it. Even before -- before I get to Fresh Frozen, our WholeHearted brand is up 30%. It is a great product at a great value. The way we think about it in Kibble is similar to how we're thinking about it in Fresh Frozen.\n\nIf you have the classic good, better, best, we have the best with JustFoodForDogs and this is the better. And it's actually manufactured by JustFoodForDogs. So obviously, they see it as complementary as well. In fresh frozen, one of the impediments to fresh frozen is access, right, from a cost standpoint.\n\nSo having a more affordable, but still a fantastic fresh frozen offering, we think is TAM expanding to fresh frozen and is unique in the marketplace. So we're really excited about it. We wanted to have another growth leg on a WholeHearted while respecting kind of the super-premium, premium Kibble vendors space, and this gives us that growth vector for WholeHearted and it makes us even more competitive in the Fresh Frozen space. But to the pricing piece, it's classic good, better, best, this is a better play complementing the best play on JustFoodForDogs or the Instinct of the world.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nGot you. Makes sense. Thanks so much.\n\nOperator\n\nOur next question comes from Steven Forbes with Guggenheim. Please go ahead.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nGood morning and thanks for taking my question. Brian, I wanted to start with the active customer engagement trends. So curious, if we look at the 2021 and 2020 customer cohorts, are they behaving any differently than the pre-COVID cohorts inclusive of spend by category as we think about this consumables-versus-supply dynamic? And then how are you thinking about retention trends within the active customer base as we look out to 2023, just given the growth that you've seen in the business?\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nYes. Thank you, Steve. We're really happy with the fact that we continue to add customers, right? 14th consecutive quarter speaks to the strength of our model, speaks to strength of our marketing. The customers that have been with us one year or longer have solid retention and look like prior customers, which speaks to the strength of our model.\n\nThe low level of turnover that we see tends to be low-value customers that were acquired during the pandemic. What's really exciting to us is the programs that actually move the needle on this front. So programs like Vital Care, where I said 30% new to food, 40% new to services with us higher retention, Perks programs, repeat delivery going up significantly, 54% growth in recurring growth from recurring revenue customers. So we feel like we have levers.\n\nWe know we're adding customers. The customers that are leaking tend to be low-value customers.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nAnd then maybe as a quick follow-up on that. You mentioned Vital Care membership exceeding internal expectations and just the commentary there. I mean, do you -- is there enough evidence here that Perks and Vital Care is sort of a new acquisition vehicle for you guys? And are you seeing greater conversion among new customers immediately into those programs?\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nAbsolutely. There is a significant portion of our Vital Care customers that are new Petco customers, so it's not just a conversion. But the real, real magic of Vital Care is to share the wallet impact that it has. And it really is the manifestation of our core strategy of being the only player in the market that has the insane ecosystem.\n\nAnd Vital Care is a manifestation of that. But it is bringing in new customers, Perks are bringing in new customers but the primary focus of Vital Care is around share wallet, which is doing a fantastic job with. So we can't move fast enough in getting more people into Vital Care. And as I said, there'll be some news in the coming month or so on further accelerating Vital Care with some good news there.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nThank you. Best of luck.\n\nOperator\n\nThat concludes the question-and-answer session of today's call. I would now like to pass it over to Mr. Ron Coughlin for closing remarks.\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nThank you, operator. To our analysts, we appreciate your time and your questions. To our investors, thank you for showing faith in us every single day. Petco continues to grow in a category that remains strong and resilient even in times of economic headwinds.\n\nAbove all else, our teams remain committed to driving operational excellence while putting the customer at the heart of everything we do and delivering against our long-term strategic priorities with purpose-driven performance. Thank you for your time.\n\nBenjamin Thiele-Long -- Director of Executive and Business Communications\n\nThat concludes Petco's second quarter 2022 earnings conference call. The team will be available after the call if you have follow-up questions. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBenjamin Thiele-Long -- Director of Executive and Business Communications\n\nRon Coughlin -- Chairman and Chief Executive Officer\n\nBrian LaRose -- Senior Vice President, Finance\n\nKate McShane -- Goldman Sachs -- Analyst\n\nSteph Wissink -- Jefferies -- Analyst\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nDavid Lance -- Wells Fargo Securities -- Analyst\n\nSteven Zaccone -- Citi -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nElizabeth Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nMore WOOF analysis\n\nAll earnings call transcripts"
}