{
  "companyName": "Natures Sunshine Products",
  "companyTicker": "NATR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/natures-sunshine-products-natr-q2-2022-earnings-ca/",
  "content": "Natures Sunshine Products (NATR -0.83%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone, and thank you for participating in today's conference call to discuss Nature's Sunshine's financial results for the second quarter ended June 30, 2022. Joining us today are Nature's Sunshine's CEO, Terrence Moorehead; CFO, Joseph Baty; and general counsel, Nathan Brower. Following their remarks, we'll open the call for your questions. Before we go further, I would like to turn the call over to Mr.\n\nBrower as he covers some important items. Nathan, please go ahead.\n\nNathan Brower -- Executive Vice President and General Counsel\n\nGood afternoon, and thanks for joining today's call. Before we start, I'd like to remind everyone that this call will be available for replay through August 23 on the Investor Relations portion of our website, which is ir.naturessunshine.com. Of course, the information on this call speaks only as of today's date, which is August 9, 2022. The company disclaims any duty to subsequently update the information provided on this call.\n\nThe information on this call includes forward-looking statements. These statements are not guarantees of future performance, and the actual results are subject to various risks that could cause them to be materially different from the results discussed or anticipated. For a discussion of these risks, please refer to today's earnings release and the company's SEC filings. Consistent with prior calls, non-GAAP financial figures may be provided during today's call.\n\nWe believe these non-GAAP financial figures assist in comparing period-to-period results in a consistent and accurate manner. Please refer to today's earnings release for any required reconciliation of non-GAAP numbers. Now I would like to turn the call over to the CEO of Nature's Sunshine, Terrence Moorhead. Terrence?\n\nTerrence Moorehead -- Chief Executive Officer\n\nThank you, Nate, and good afternoon, everyone. I want to thank you for joining today's call to review our second quarter results as we continue to move forward in the face of unprecedented headwinds. The War in Ukraine, inflation, global supply chain pressures and the lingering impact of COVID-19 have all been a challenge, but our vision to share the healing power of nature with people around the world remains undeterred. Despite the extraordinary challenges in the market, we were able to deliver second quarter sales of $104 million on a reported basis or $109 million removing the impact of foreign exchange, which is slightly up versus prior year.\n\nYear-to-date sales are up 5.2% versus prior year in local currency, which is significantly ahead of the industry. We believe these outcomes illustrate the resilience and power of our brands and the advantages of our diverse portfolio. As expected, second quarter margins contracted due to inflationary pressures on cost of goods, inventory reserves associated with the conflict in Ukraine and continued investment in our growth strategies. For the quarter, adjusted EBITDA came in at $9 million, negatively impacted by about $4.4 million versus the prior year due to the above-mentioned factors.\n\nImportantly, our transformation requires continued investment, and we don't want to jeopardize the strong gains we've made by backing off the strategies we believe will provide long-term sustainable growth. Our strong balance sheet affords us this valuable opportunity, particularly in the current macroeconomic environment. With that said, we're working to tighten SG&A to provide margin relief where possible. Our new supply chain lead, Martin Gonzalez, has only been on the job for about eight weeks, but he's already championing an effort to drive out costs and improve supply chain productivity by refining processes, leveraging local supply networks, and improving efficiency.\n\nA closer look at the second quarter results shows sales were led by exceptional performance in Asia Pacific, where we continue to see historical sales, with 19% growth versus prior year in local currency and 26% growth year to date. Strong fundamentals, new product launches, and limited inflationary pressures helped the business drive customer growth in the second quarter. Asian consumers appear to feel more positive about the economic situation than their European and American counterparts according to consumer research. And the desire to spend after two years of the pandemic appears to be greater than the negative impact of any economic or global uncertainty.\n\nIn Japan, second quarter sales were up an impressive 38% in local currency versus prior year as consumers continue to be highly engaged throughout the period. This was one of our strongest quarters in Japan, driven by new products, the opening of a new sales center, and continued strength of our Subscribe & Thrive autoship program, which continues to represent about 50% of Japan sales. Subscribe and Thrive has been gaining momentum for the past 12 to 18 months as our distributors have increasingly incorporated it into their sales process. Distributors recognize that the only way clients are going to get healthy is if they commit to regularly taking their supplements and that's why approximately 70% of new customers are brought into the company via a Subscribe & Thrive program.\n\nYear to date, Japan sales are up 36%, and the commitment to strong fundamentals should continue to support healthy growth moving forward. In Taiwan, the competitive nature of our top distributors continues to fuel growth as sales in the second quarter surged 164% in local currency. Our team in Taiwan appears to be building the business the right way, focusing on field fundamentals and customer growth. Centered around a few core products and the highly regimented process, we continue to attract new customers and transfer sales fundamentals across the business.\n\nA new autoship Subscribe & Thrive program and digital capabilities are under development and should be available sometime in 2023, but there's still plenty of room for this team to drive growth as we move forward. Year to date, Taiwan sales are up 196% versus prior year in local currency. In China, consumer sentiment has suffered from the recent surge in COVID cases and the resulting lockdowns. As a result, second quarter sales were down 5.7% on a local currency basis as the negative impact of COVID lockdown had a significant impact on the consumer's ability and willingness to spend.\n\nFortunately, our manufacturing operations are located outside of Shanghai, and we've been able to continue operating without disruption. The COVID lockdowns have not only impacted sales and orders in Shanghai, they've also impacted the business across the country as consumers have been much more cautious with their spending and have been much more hesitant about making personal contact with others. With the lockdowns finally ending, we feel confident in our ability to restore growth as the market recovers. We expect to see strength of building by the end of the year, and we continue to feel good about our ongoing potential in the market.\n\nYear to date, China is up nearly 17% and our long-term outlook remains strong. In South Korea, second quarter sales were down 7.6% in local currency as the market continues to rebound from the long-term effects of the pandemic and the COVID restrictions that put our business on hold for two years. Fortunately, the restrictions have finally been lifted, offering South Korean consumers some much-needed relief. Of course, it will take time for things to return to normal, but with the COVID barriers removed, we've already started conducting face-to-face meetings and have reopened our branch facility after a two-year hiatus.\n\nOnce again, it will take time to close the gap from the significant COVID losses, but our focus on new customer acquisition and reactivating and engaging existing customers will help. In fact, the team just had one of their most successful new product launches, which demonstrates the power of our team when we have the freedom to leverage their strengths. While South Korea is still struggling with the residual effects of COVID, we expect to see positive momentum in the latter portion of the year, continuing into 2023. In Europe, the business struggled to overcome macroeconomic and geopolitical headwinds, but still, exceeded expectations.\n\nSales in the second quarter were down 16% on a local currency basis as consumer pessimism reached an all-time high, spending patterns changed due to inflation, and the warrant Ukraine continued to create uncertainty. In Western Europe, rising prices followed by the invasion of Ukraine have eclipsed COVID-19 as the No. 1 concern for most consumers. In response, European consumers are reprioritizing their budget, buying smaller quantities, delaying purchases or trading down, turning to private label discounters or more affordable brands.\n\nAs a result, our second quarter sales declined 23% in local currency. Remember, however, we still haven't launched our transformation initiatives in Western Europe, so these results were somewhat expected. Importantly, we're still on schedule to relaunch the business in Western Europe later this year and into 2023. In the second quarter, we successfully introduced a new digital platform that includes a new website, new web tools, Subscribe & Thrive autoship capabilities, an affiliate program, customer sharing tools, and replicated websites for all of our distributors.\n\nIn the third quarter, we will work with our new ad agency to introduce components of the new rebranding. And by the fourth quarter, we'll start introducing new products designed to support customer acquisition and market penetration. We should expect to start seeing positive momentum in Western Europe as we move through 2023. In Central and Eastern Europe, sales were down 15% versus prior year in local currency, a remarkable achievement given the extreme more torn conditions under which the team is operating.\n\nOur distributors in Central and Eastern Europe continue to show that determination as their desire to share our products remain strong, and their commitment to our business remains unwavering as does our commitment to them. Performance in markets like Poland continue to drive results and offset losses elsewhere. The situation is still highly volatile, but we continue to demonstrate an ability to sell through the inventory that's on the ground. Year to date, sales are only down 5% versus prior year in local currency.\n\nIn North America, sales were down 8.5% in the second quarter, largely driven by average order declines. While our customers are still ordering their Nature's Sunshine supplements, we have a select group of customers buying about one unit less per order on average. This appears to be consistent with what's happening in the market as consumers are offsetting inflationary pressures by buying smaller quantities, delaying purchases, trading down to private label, trying different retailers or trying new brands. In response, we've seen more and more competitors aggressively slashing prices, offering consumers heavy discounts on products they normally buy.\n\nAs a premium brand built on quality, we formulate our products using superior ingredients, including wild crafted and specialty blends that don't necessarily offer the same latitude to dramatically slash prices like some competitors. To help counter the impact to produce consumer spend, we're increasing our focus on reactivating lapsed and inactive customers using our newly enhanced CRM capabilities that allow us to target consumers more effectively. Second quarter sales were also negatively impacted by an increase in the number of product shortages versus Q2 of the prior year, with less than $1 million of lost sales or about 20% of the North American sales decrease for the quarter. Product shortages are driven by the limited availability of a few key ingredients that impact multiple products.\n\nDespite the global supply chain crisis and related sourcing issues, we saw a dramatic improvement in product availability versus the first quarter of 2022 and expect to see continued improvement through the remainder of the year as our supply chain team works to restore pre-pandemic service levels. Despite the overall sales decline, our digital business continues to build momentum, adding new customers and contributing sales growth in the quarter. We continue to invest in our DTC business and are making changes to both our creative and media planning to accelerate growth through the balance of the year. Finally, in Latin America, second quarter sales were down 15% in local currency, driven by product availability issues, increased macroeconomic pressures and significant social unrest that slowed sales in several markets.\n\nThe temporary interruption to our customer growth initiatives has slowed our progress, but the market has responded well to our transformation initiatives, and we continue to be confident that the market offers significant growth potential. Year to date, sales are down 8% in local currency, but again, we're still on the front end of our transformation and are very pleased with the progress our new leadership team has made building talent and creating a road map to deliver sustainable growth. Turning to our global strategies. We continue to execute our plans and are making steady progress.\n\nToday, I'd like to give you a brief update on two of our global growth strategies; Brand power and Digital-First. And let's start with Brand power because, as you know, the power and attractiveness of a brand becomes increasingly important as consumers of course, to make tough trade-offs about where and how to spend their money. We see this dynamic unfolding more frequently in today's high inflationary environment where consumers are choosing between brands based on a variety of factors such as price, quality, reliability, results, service, relationship and more. In many ways, a company's brand represents the desirable set of attributes beyond price that keep consumers coming back even when price is an issue.\n\nOne of the main reasons we see so many people come to Nature's Sunshine and stay with us is because once they get to know our brand, they understand that when they buy Nature's Sunshine supplements, they're not only getting the best, highest quality products in the world, they are also buying from a company they can trust. So it's extremely important that we continue to focus on ways to strengthen our brand to ensure we continue to be relevant to today's consumer in a more meaningful way than just price. With that as a backdrop, Nature's Sunshine continues to boldly move forward. And in the second quarter, we took the extraordinary step of transitioning our US manufacturing operations to 100% solar energy, a major step forward for our company and for our brand.\n\nWhat this means is that all the products produced in our US manufacturing facility, which is about 80% of our sales worldwide are now made with 100% pure renewable energy from the sun. As you can imagine, this is an important move and a meaningful differentiator for consumers that appreciate where their products come from and how they're made. Remember, 66% of consumers say they would pay more for sustainable brands, and for millennials, that number increases to 73%. What's more? 64% of core supplement users try to buy brands that are transparent about what's in their products, how they're made, and how they're sourced.\n\nThese same consumers also associate be more eco-friendly with higher quality. So this is yet another move to solidify Nature's Sunshine as a brand of choice. You've also heard me talk about making a shift toward mega branding as we move into 2023 and beyond. As our brand power strategy continues to evolve, we will provide added focus on a few key products to help drive growth, and we've already started to identify a few potential mega brand products for 2023.\n\nThe first is Chlorophyll, a long-term staple for Nature's Sunshine that supports a healthy gut and body with a proven ability to drive sales. A great tasting product that's truly effective, consumers around the world love our Chlorophyll. Rejuvenaid is another product that has mega brand potential, delivering some of the best cardiopulmonary benefits in the market. Rejuvenaid is an incredible product driven by the power of beats and our clinically proven S7 complex, whether you're concerned about high blood pressure, cholesterol, or if you just want clean energy to fuel performance, Rejuvenaid is an incredible product.\n\nFinally, a significant new product innovation will launch in 2023 that will support foundational nutrition and make it easier for customers to shop with Nature Sunshine. I'm not going to talk about the details today, but I will say that sharing the healing power of nature will be much easier and more effective than ever before. Our extensive and diverse product line will continue to be a differentiated source of advantage, especially for those who need specialty applications. However, our mega branding strategy will be instrumental in helping focus our messaging and strengthen our consumer identity.\n\nThese gateway products will help introduce new consumers to the vast array of high-quality Nature's Sunshine products that other consumers have loved for years. Moving to Digital-first. We continue to drive sales and strengthen capabilities across the business. In the first half of 2022, DTC initiatives delivered positive results, with sales expected to be up by as much as 50% for the year.\n\nEarly results have demonstrated an ability to not only drive new customer acquisition, but also reactivate lapsed and inactive customers. While we've seen meaningful success, we're still in the early stages of the strategy and are learning more about consumer buying patterns and preferences. So we expect to see continued growth as we build momentum, and DTC becomes a more important part of our business. In fact, our progress to date is quite notable.\n\nIn the first half of 2021, DTC was about 5% of North American sales. Today, DTC represents about 13% to 15% of sales with an expectation that it will reach 18% to 20% by the end of the year. Also, it's important to point out that all of our distributors have the exact same digital tools that we're using. So we hope to see them become more engaged with the technology over time.\n\nThis is a powerful tool that can help expand and diversify their businesses. So we'll continue to encourage distributors to leverage and expand their digital network as a source of future growth. To take DTC to the next level, we're adjusting our creative to broaden consumer appeal, making changes to our website to improve conversion rates and making changes to our media strategy to increase efficiency and effectiveness. These changes will take place over the next six to nine months and are expected to help continue to drive growth.\n\nIn 2023, we will continue to expand our digital capabilities with the launch of our unique personalization initiatives. Personalization is an exciting opportunity for consumers to build their own personalized nutrition thought plans by answering a few simple questions about their health, giving them access to the best products and program in the market. We're still in beta testing, but we expect personalization sales to meaningfully accelerate over the 2024, 2025 time frame, so we're getting started now. Before passing the call over to Joe, I would like to reiterate our steadfast commitment to successfully navigating this unique period of market volatility and uncertainty.\n\nWe fully expect to continue our proactive investment in our five global growth strategies, facilitated by our strong balance sheet and team of experts on the ground and remain confident in our ability to provide long-term value to all of our stakeholders. With that, I'd like to turn the call over to Joe, who will walk you through our second quarter financials in more detail and provide more insight into our 2022 expectations. Joe?\n\nJoe Baty -- Chief Financial Officer\n\nThank you, Terrence, and good afternoon, everyone. Net sales in the second quarter were $104.2 million, compared to $109 million in the year ago quarter. This modest 4% decrease was largely driven by declines in Europe and North America. If we exclude Europe, which we knew was going to be challenging, as reported sales were down less than 1%.\n\nAs Terrence mentioned, excluding impact from foreign exchange rates, consolidated net sales increased 50 basis points in the second quarter. On an absolute basis, net sales in Asia increased 9% to $47.4 million, compared to $43.5 million in the prior year quarter. This represented a 19% increase on a local currency basis. The strong performance was primarily based on growth in Taiwan and Japan as a result of an increase in on-site events, new product launches, and further growth in the team's field fundamentals.\n\nNet sales in Europe on an absolute basis were $17.1 million, compared to $21.5 million in the year ago quarter. On a local currency basis, net sales declined 16%. Throughout the quarter, the region continued to experience inflationary pressures combined with the negative impact from the war between Russia and Ukraine. As Terrence touched on earlier, Poland remained a primary driver for the region despite the inflationary environment and the natural pressures arising from mass immigration into the country.\n\nWe are watching the Russia, Ukraine situation closely and believe it will remain fluid to the situation's overall uncertainty. North America's net sales were $34.1 million, compared to $37.4 million in the prior year period. This decrease is largely attributed to the aforementioned supply chain and inflationary pressures in the region, which we believe was the primary driver for a reduction in per customer average order size during the quarter. Net sales in Latin America and other were $5.6 million, compared to $6.6 million in the prior year period.\n\nThis represented a 15% decrease on a local currency basis, which is primarily due to fluctuations in foreign currency, supply chain challenges and a slight decrease in average order size, which again is primarily attributed to inflationary headwinds. Gross margin in the second quarter was 71.7% compared to 73.9% in the year ago quarter. The decline was driven by increases in inventory reserves related to changes in forecasted demand, primarily in North America and Europe, changes in market mix, and increases in production and transportation costs, as well as material and distribution costs. Inventory charges impacted gross margin by approximately 70 basis points for the second quarter of 2022.\n\nVolume incentives as a percentage of net sales were 30.8% compared to 32.5% in the year-ago quarter. This decrease can be attributed primarily to changes in market mix, growth in our year-to-date China market and also reflects cost efficiencies in North America and Latin America. Selling, general and administrative expenses were $36.9 million, compared to $35.6 million in the year-ago quarter. The modest increase was primarily attributable to higher costs associated with the implementation of business transformation and sales growth initiatives in certain markets and an increase in planned events and the resumption of travel-related costs.\n\nAs a percentage of net sales, SG&A expenses were 35.4% for the second quarter of 2022 compared to 32.7% in the year-ago quarter. Reflective of the margin pressures and higher SG&A spend, operating income was $5.8 million or 5.5% of net sales, compared to $9.5 million or 8.7% of net sales in the year-ago quarter. GAAP net income attributable to common shareholders for the second quarter was $0.5 million or $0.03 per diluted share, as compared to $6.5 million or $0.32 per diluted share in the year-ago quarter. In addition to lowered operating income, the decline also reflects the impact of a much higher effective income tax rate.\n\nThe increase in rate includes a noncash adjustment to net deferred tax assets resulting from the higher probability a portion of such will expire before utilization. Adjusted EBITDA, as defined in our press release as net income from continuing operations before income taxes, depreciation, amortization and other income or loss adjusted to exclude share-based compensation and certain noted adjustments, was $9 million, compared to $13.4 million in the second quarter of 2021. Moving on to our liquidity and capital allocation plan. Our balance sheet remains clean with cash equivalents of $56.3 million and only $1.8 million of debt.\n\nDuring the quarter, inventory, net of the increase in valuation reserves increased approximately $6.7 million versus the first quarter end due to proactive purchasing of raw materials in consideration of supply chain headwinds and to meet customer demand. The increase also reflects the impact of actual sales for 2022, falling short of our expectations coming into the current year. We believe aggregate inventories will decline in the second half of 2022. As part of our capital allocation plan, we continue to utilize our share repurchase authorization buying 290,000 shares in the second quarter for $4 million or an average of $13.77 per share.\n\nAt June 30, 2022, $25.6 million remains on our $30 million share repurchase program. Looking beyond share repurchases, our healthy capital allocation structure positions us well to continue our digital transformation, marketing and investment efforts. Now turning to our outlook, which includes the assumption that ongoing market headwinds will persist. We continue to expect top line sales for 2022 to reflect a low to mid-single-digit decline versus 2021.\n\nHowever, we believe the mix by operating business unit may change from previous expectations. We currently expect overall Europe sales for 2022 to decline approximately 15% to 25% as compared to 2021. The change in expectations for Europe may be offset by further declines in North America given the significant inflationary environment. Given ongoing costing and pricing pressures, foreign currency movements and a meaningful increase in transportation, distribution and production-related expenses, we expect our cost of goods sold rate, excluding further inventory-related charges related to changes in forecasted demand and other inflation-related pressures will continue to reflect an increase versus 2021.\n\nWe also continue to expect SG&A as a percentage of net sales to increase year over year. However, due to our strong belief in the long-term potential and successful Nature's Sunshine, our investment in growth initiatives will continue. We currently expect adjusted EBITDA margin, including the add-back of certain war-related working capital charges may decline 3 to 5 full percentage points from the 11% we reported in 2021, which reflects the assumptions and factors I just mentioned. Please note these may change.\n\nDespite market headwinds, most of which remain out of our control, we are very excited about and remain committed to the long-term top and bottom line growth opportunities for the business. As noted, we had an active share repurchase plan in place throughout the second quarter, and we are committed to pursuing opportunities to maximize value for our shareholders. Now I will turn the time back to the operator for Q&A. Operator?\n\nOperator\n\n[Operator instructions] And our first question will come from Linda Bolton-Weiser with D.A. Davidson. Please go ahead.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nYes. Hello. How are you?\n\nTerrence Moorehead -- Chief Executive Officer\n\nGood. How are you doing, Linda? Good to hear from you.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nYeah. So I just will start out with Europe, we had tempered our expectations and it was a fair amount better than we had projected. I know there was some inventory in Russia, Ukraine that might have been sold through. Are you posting any sales in Russia or Ukraine in the quarter? Or is that zero at this point?\n\nTerrence Moorehead -- Chief Executive Officer\n\nThey're still selling through the inventory and we do have activity on the ground.\n\nJoe Baty -- Chief Financial Officer\n\nYes. And to some degree, Linda, we have just given that the performance in Eastern Europe has been better than we were thinking a few months ago. To some degree, we have replenished some of the inventory sitting there.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. So I mean do you expect to have situation to change? Or is it a winding down? Or do you think some little bit of business will continue there?\n\nTerrence Moorehead -- Chief Executive Officer\n\nThere's still a fair amount of uncertainty, obviously, in the market. But to the extent that we can continue to sell through inventory and to the extent that we can actually repatriate the dollars we'll continue to move forward as we have. Joe, do you have additional comments on that?\n\nJoe Baty -- Chief Financial Officer\n\nI would just add, Linda, as I just noted, the overall business in Europe, primarily Eastern Europe clearly have been better than we were anticipating last time in the guidance. So it wasn't guidance still on the last call. I stated that Europe could be down 30% to 40%. I just updated that guidance, say now maybe it's going to be down 15% to 25%.\n\nAnd that in large part is because we continue to move a lot of product to those folks that are strong believers in Nature's Sunshine, and addressing their health needs.\n\nTerrence Moorehead -- Chief Executive Officer\n\nThese products, if you think about that area of the world, our products really do represent a significant portion of their healthcare. And so they're important to the people on the ground there. So even in the Ukraine, we're seeing some of our distributors have temporarily opened up their stores to move inventory as the finding has moved East. So there is some activity still on the ground.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. And then just switching a little to the North American business. I guess I'm a little surprised to hear a little bit of a shift or change in the business in terms of you're talking about competition. I'm just wondering a little, do you think there's some sort of channel conflict developing because your DTC has grown so rapidly? Do you think that could be negatively impacting the rest of the business?\n\nTerrence Moorehead -- Chief Executive Officer\n\nNo, we don't see that as a particular factor. And I was using the points on competition, simply to highlight what other competitors are doing in the market. It's not just us that are being affected by inflationary pressures. That was the only reason that I was highlighting that.\n\nAgain, people are still ordering, the consumers are still there. They're still buying supplements. They're just a group of customers that are buying less. I mean, that's the dynamic we're seeing and it appears as if that's impacted by inflation.\n\nTo a certain extent, it was impacted by product availability. But again, that's just the behavior that you're seeing in the market right now, and it seems to be consistent with us. Does that answer your question?\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nYeah, yeah. Also, a question just on the SG&A expense. I know you think about it in terms of a ratio, but it was actually the dollar amount was a little bit lower than we had thought. Is that a good amount to consider going forward on a quarterly basis, like on a dollar amount basis?\n\nTerrence Moorehead -- Chief Executive Officer\n\nJoe, do you want to take that?\n\nJoe Baty -- Chief Financial Officer\n\nYeah. Linda, I think you can appreciate there's always going to be a little bit of variation in the dollar amount from one quarter to the next just based on actual sales because a portion of that is the percent historically related to sales. Some of it is relatively fixed and so forth. But directionally, I would say, for the near term, it's a pretty good number to go off, but it won't be exact, all right?\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. That's helpful. Thank you. And then I know your general commentary here around what to expect a little bit.\n\nDid I catch it right that you said your 11% EBITDA margin could possibly get impacted by 3 to 4 percentage points in 2022? Is that what you said?\n\nJoe Baty -- Chief Financial Officer\n\nYeah. I think I said full 3 to 5 percentage points. So I guess, you do the math, obviously, that as we sit here today and obviously, our views may change, but the EBITDA margin could be somewhere in that 6% to 8% range.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. So just to confirm, I saw on the last call, you were maybe talking more about high single digits. So does this represent a little bit of a more conservative view toward it?\n\nJoe Baty -- Chief Financial Officer\n\nWell, it certainly represents an update from what I stated before. And what I stated before, I think I excluded incremental inventory-related charges was, as I noted, our COGS rate in this quarter was impacted 70 bps from additional inventory-related charges and so forth. But maybe a little bit of a softened comment versus last time, but not, in my view, a major change from what I stated before.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. That sounds good.\n\nJoe Baty -- Chief Financial Officer\n\nOK?\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nYes. Thank you very much. That'll be all for me. Thank you.\n\nTerrence Moorehead -- Chief Executive Officer\n\nThanks, Linda.\n\nOperator\n\n[Operator instructions] And we'll take our next question from Steven Martin with Slater. Please go ahead.\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nSo guys, this is not a very uplifting phone call. I'm sorry, it just wasn't. Is there anything positive we can look forward to for the back half?\n\nTerrence Moorehead -- Chief Executive Officer\n\nWell, I think we continue to push on forward on all fronts. Top line, as I mentioned, should continue on the trend that Joe talked toward and I think, Steve, what we're really working toward is playing the long term here and making sure that we continue to drive for the top line and bottom line that we've been talking toward. I think that's what our strategies are designed toward, that's what our actions are focused on getting the gross margins get back on track from a costing standpoint, getting SG&A in alignment where we can and then continuing to press on top line and fight through the external headwinds. That's just what we have to do.\n\nAnd Joe, do you have any additional comments on that?\n\nJoe Baty -- Chief Financial Officer\n\nYeah. I mean we certainly recognize the challenge of this year's overall profitability versus the prior year's profitability, Steve. We recognize that and talk about it and are focused on what we can do to improve that going forward. Clearly, as Terrence just mentioned, the focus is not to make a decision that in the near term helps things, but in the long term is a bad decision.\n\nSo we continue to invest on these initiatives and so forth. We have the capital and the wherewithal to do that. And then obviously, from a cost of goods sold rate, from a gross profit margin standpoint, you recognize that losing a couple of full points there for external related reasons, it's difficult to overcome just from a profitability standpoint. But as Terrence also mentioned, we have our new Head of Operations here.\n\nHe's actively working on a number of initiatives that we can implement over the upcoming months, quarters, years and so forth that we believe will help address those pressures. But trying to assess and evaluate what the long-term expectations are for inflation and some of those factors, I think you can appreciate that's very difficult to do.\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nI totally understand that, but your sales shortfall was not that great. Your profitability shortfall is reasonably significant. And it doesn't sound like, when I understand there are some cost pressures, but it you haven't named anything that is an offset on SG&A or anywhere else. Everything was just negative.\n\nI mean for instance, are there going to be officer bonuses this year? Where is the offset? Where is the cost savings? Where is some level of reduction that reflects the headwinds that you're facing? And not verbiage. Joe, not verbiage. Dollars and cents.\n\nJoe Baty -- Chief Financial Officer\n\nDollars and cents. You want me to respond in dollars?\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nI want something other than words.\n\nJoe Baty -- Chief Financial Officer\n\nOK. Well, let me start with your first call-out, the officers' bonus question. It's very clear, and we fully understand at this point that the overall officers or management bonus pool in 2022 will be substantially less than it was in the prior year. If any bonuses are paid at all in 2022, we recognize that we've consciously made a decision in connection with the board and so forth that look, given this year's profitability versus last year, that's clearly one of the things that to use your language, we're probably going to need to give up, and then get things squared away to obviously try to get to a better situation in 2023, so some of that can return.\n\nI can also say, clearly, from an overhead standpoint, we referenced SG&A, we have not made a decision to make any dramatic changes in personnel at this point. And that's one of the things as we sit here today, we don't know that that's the right decision to make major changes on headcount or stuff like that. So you can say that is that something that we would look at, maybe, but it's not as of today because we believe still that the upside growth wise and so forth, once we get past some of these external factors is pretty significant for the company. And as we called out, Asia, obviously, is performing very well.\n\nObviously, Eastern Europe we understand squarely hindered by the war. We got Western Europe is impacted by inflationary pressures. Obviously, we want to make significant changes today, then all of a sudden, that situation changes dramatically six months from now. We're not sure that that's the right move, and I can say the same thing to some degree here in North America as well.\n\nBut I can assure you, we continue to evaluate it. We understand and fully recognize the year-over-year reduction in what you want to talk in terms of adjusted EBITDA or operating income. And we're looking everything suit-the-nuts as to what we can do to improve efficiencies, remove costs from the overall business. But again, we don't want to make a short-term decision that may make financial sense, but it's the wrong decision in the long term.\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nAll right. Let's talk about Asia in the third and fourth quarter. Do you expect Japan to continue its strength?\n\nJoe Baty -- Chief Financial Officer\n\nWe expect Asia overall, and I'm not going to break it down by market. I think Terrence touched on the markets. I would say that overall, we expect Asia to continue to grow in the second half.\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nWell, Terrence, you referenced the Korean restrictions have been lifted and the Chinese lockdowns have ended. Do we expect that China and Korea are going to start growing in Q3 on a year-over-year basis?\n\nTerrence Moorehead -- Chief Executive Officer\n\nYeah. I think what we'll start to see, Steve, is the momentum to start picking up in those markets. The impact of basically being on hold for two years in South Korea has been significant. So they're out in the market.\n\nThey're having meetings. They're getting face to face. People are actually coming back into the brand and using those facilities. So we do expect to see momentum building certainly on a sequential basis.\n\nI can't say versus year over year. But I do expect to see that gap closing, Steve. In China, that situation maybe it's a little bit more tenuous. But again, my expectation there and our expectation is that they'll start building momentum as well and fighting to gain that back.\n\nBut as I mentioned, there's still some hesitancy with consumers to not only spend their money but also to interact with others.\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nSo you can't tell me when China or Korea will be positive on a year-over-year basis?\n\nTerrence Moorehead -- Chief Executive Officer\n\nI think our outlook is as we get closer to 2023, we should start to see some more positive momentum. Is that fair, Joe?\n\nJoe Baty -- Chief Financial Officer\n\nYes, that's fair.\n\nTerrence Moorehead -- Chief Executive Officer\n\nYeah.\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nAll right. Joe, can you talk about the tax rate and what it might look like in the back half of the year? Will it be more normal?\n\nJoe Baty -- Chief Financial Officer\n\nIt should be a little more normal, Steve. I mean just to expand again a little bit on what I said. I mean the company typically has deferred tax assets because there are differences between tax and financial reporting, whether they're related to foreign taxes or net operating losses and so forth and so on. The Russia business is that a lot of that Eastern Europe business actually flows through our US tax return.\n\nBecause of some of the challenges over there, coupled with some of the heightened inflationary impact on the North America business, our US taxable income is currently forecast is not as robust as it was, say, six months ago or a year ago. And as a result, some of those tax assets that we thought we could utilize in reducing US taxable income may expire before they can be utilized such we have to take a valuation charge against us. So that led to a fairly high rate here in the second quarter. Playing that forward, obviously, we do believe that the overall North America situation is solely but surely going to improve.\n\nBut again, it's hard to sit here and predict how those external factors are going to play out, but that's certainly the hope. I would think and believe that the volatility of that tax rate should be less in, say, the back half than it was in the first half. More importantly, though, I would say, just putting aside the tax rate, which includes both noncash and cash components to it. The thing that I focus in on is what is the overall effective cash tax rate, and that, in my mind, has not changed dramatically from where we were before.\n\nAnd in round numbers, that's where we think it's somewhere in the very high 20s to low to mid-30s.\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nOK. Yup. I guess that's it. I'll get in touch with you guys either later this week or next week with a more detailed question.\n\nTerrence Moorehead -- Chief Executive Officer\n\nThanks, Steve.\n\nJoe Baty -- Chief Financial Officer\n\nOK. Thanks, Steve.\n\nOperator\n\nI'll take a follow-up from Linda Bolton-Weiser from D.A. Davidson. Please go ahead.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nYes. Hi. I just forgot to ask you -- I wanted to ask about pricing because I think you had made a price increase of about 5% around April. Can you remind me what reason that has been? And what kind of results you see? Do you think that has affected the business at all?\n\nTerrence Moorehead -- Chief Executive Officer\n\nThe price increases were actually in North America and Western Europe. And so the impact of those consumers are extremely price sensitive. That's all I can say. I don't know what else to say about it.\n\nYeah, that's it. Joe, do you have any --\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nSo you think you have suffered a little bit of demand degradation because of the price increases?\n\nJoe Baty -- Chief Financial Officer\n\nYeah. We believe that as it's played out, it's always difficult to prove that, but we believe that may have impacted the overall revenue or let us to say, promote a little heavier. Then maybe we would have just given the heightened price sensitivity, again, given the inflationary pressures that headwinds that folks are feeling.\n\nTerrence Moorehead -- Chief Executive Officer\n\nYeah. Especially in Europe.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. Thank you very much. Appreciate. Thank you.\n\nTerrence Moorehead -- Chief Executive Officer\n\nThanks.\n\nJoe Baty -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nAt this time, this concludes our question-and-answer session. I would now like to turn the call back over to Mr. Moorehead for closing remarks.\n\nTerrence Moorehead -- Chief Executive Officer\n\nOK. Thank you, all. I want to thank everybody for listening to today's call. We look forward to speaking with you again when we report our third quarter 2022 results in November.\n\nAnd thank you again for joining us. Take care.\n\nJoe Baty -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNathan Brower -- Executive Vice President and General Counsel\n\nTerrence Moorehead -- Chief Executive Officer\n\nJoe Baty -- Chief Financial Officer\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nSteven Martin -- Slater Capital Management -- Analyst\n\nMore NATR analysis\n\nAll earnings call transcripts"
}