{
  "companyName": "Lennar",
  "companyTicker": "LEN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/23/lennar-len-q3-2022-earnings-call-transcript/",
  "content": "Lennar (LEN -0.19%)\nQ3 2022 Earnings Call\nSep 22, 2022, 11:00 a.m. ET\n\nOperator\n\nWelcome to Lennar's third quarter earnings conference call. [Operator instructions] Today's conference is being recorded. If you have any objections, you may disconnect at this time. I will now turn the call over to Alexandra Lumpkin for the briefing of the forward-looking statement.\n\nAlex Lumpkin -- Deputy General Counsel\n\nThank you, and good morning. Today's conference call may include forward-looking statements, including statements regarding Lennar's business, financial condition, results of operations, cash flows, strategies and prospects. Forward-looking statements represent only Lennar's estimates on the date of this conference call and are not intended to give any assurance as to actual future results. Because forward-looking statements relate to matters that have not yet occurred, these statements are inherently subject to risks and uncertainties.\n\nMany factors could affect future results and may cause Lennar's actual activities or results to differ materially from the activities and results anticipated in forward-looking statements. These factors include those described in yesterday's press release and our SEC filings, including those under the caption Risk Factors contained in Lennar's annual report on Form 10-K most recently filed with the SEC. Please note that Lennar assumes no obligation to update any forward-looking statements.\n\nOperator\n\nI would like to introduce your host, Mr. Stuart Miller, executive chairman. Sir, you may begin.\n\nStuart Miller -- Executive Chairman\n\nVery good. Good morning, everyone. Thanks for joining us. This morning, I'm here in Miami, joined by Diane Bessette, our chief financial officer; David Collins, our controller and vice president; and of course, Alex, who you just heard from.\n\nJon Jaffe and Rick Beckwitt, our co-CEOs and co-presidents, are on the line also, but they will be participating remotely for the Q&A. As usual, I'm going to give a macro overview and strategic Lennar plan. After my introductory remarks, Rick is going to talk about our markets around the country. Jon will update on supply chain, construction costs, land strategy.\n\nAnd as usual, Diane will give a detailed financial highlight. And we'll give some rough boundaries for the fourth quarter to assist in go-forward thinking and modeling. And then we'll answer as many questions as we can. And as usual, please limit to one question and one followup.\n\nSo let me begin and start by saying that once again, the Lennar team has turned in an excellent third quarter results, which continues to enhance our positioning for the evolving market conditions. Throughout our third quarter, we continue to manage the still constrained supply chain and workforce and delivered over 17,200 homes with a gross margin of 29.2% and a net margin of 23.5%. These deliveries continue to drive very strong cash flow and bottom-line earnings as we continue to refine our already efficient operations with SG&A of 5.8% or a 120 basis point improvement over last year. With strong bottom-line earnings of $1.47 billion or $5.03 per diluted share driving strong cash flow, we've continued to fortify our balance sheet.\n\nAfter paying down $575 million of maturing senior debt without replacement, we ended the quarter with $1.3 billion of cash, nothing drawn on our revolver and a 15% debt to total capitalization ratio as compared to 21.2% last year. As a matter of careful capital allocation this quarter, given current market conditions, we chose not to repurchase stock in favor of early retirement of debt. As we've continued to drive strong closings and performance, we are well prepared to handle the current market conditions. In addition to the well-documented supply chain constraints and limited workforce slowing production, housing has now been considerably impacted by the more than doubling of mortgage rates over the past months and therefore, the doubling of monthly payment costs and reduction of housing affordability.\n\nThe housing market has continued to weaken as expected in response to the Fed's too late but now very rapid and aggressive reaction to inflation. Homebuilding finds itself once again at the forefront of all that is happening in the economy, and the Fed's use of its interest rate tool to curtail inflation is certainly having the desired effect on the for-sale housing market. The market is now adjusting. The interest rate movements were very sudden and adjusted very quickly, and that suddenness has always led to a pullback in housing demand.\n\nPart of the pullback is driven by simple affordability, and part of the pullback is driven by the psychology of the sudden and aggressive interest rate hike causing either monthly payments figure shock or a sense of having missed the boat. The Fed Chair's additional increase of 75 basis points of the Fed funds rate yesterday, together with an articulated determination to do more, suggests that even more challenges lie ahead. While demand has cooled at once high price -- at once high pricing level, demand for shelter still exists where price intersects with current interest rates to produce an affordable monthly payment. There is still a housing shortage across the country, especially workforce housing, and household formation has continued to rise.\n\nThere's still very limited inventory, and there's very little exposure to traditional inventory overhangs like foreclosures and speculators. Additionally, buyers are still seeking shelter from inflationary pressures on rentals as scarce rentals and increased demand from those who would otherwise purchase drive and keep rents higher. As we bring prices down and incentives up, demand is still there. And these fundamentals give us assurance that while there is short- and medium-term reconciliation, the long-term prospects for housing continue to be strong.\n\nDemand remains reasonably strong at adjusted prices as buyers still have jobs as well as down payments and have attractive credit scores and can qualify. With higher rates, prices must be adjusted downward in incentives used to find the market or sales just drop off. Accordingly, we have carefully managed sales price and/or pace through the third quarter exactly as we said we would last quarter. Although our sales are down 12% from last year's levels, we have focused our management's attention on finding pricing levels that attract demand.\n\nEach market is different. In as much as it is an art and not a science, our efforts have slightly lagged our goal of matching our sales pace with our start pace, but we feel certain that we will find pricing and accelerate that pace in the near future. In a few minutes, Rick is going to give a more detailed overall market review that will give a more comprehensive snapshot of what we've seen in our markets across the country. Along with bringing home sales price down, we are also laser-focused on bringing down production costs as well.\n\nWe are working with our vast network of trade partners to recognize that the world has changed, and we all have to work together to keep the machine working. In fact, last night, I returned from a two-day extraordinary supply chain conference that was hosted by our purchasing leadership group, led by Kemp Gillis. Trade partners and Lennar division leaders convened to work together to attack costs, find efficiencies and adjust to current market conditions. Rick and Jon will drive continued and focused attention on this critical initiative.\n\nAnd as the market recalibrates, land costs will have to adjust as well. Accordingly, we are reviewing and reunderwriting every land deal in our pipeline to the current market conditions. In time, new land deals will have different pricing that will be properly sized to the home sales prices. Overall, these are the trends as we see them.\n\nAnd while we can choose to fight against the trends, the reality is that the market has been changing, and we are getting ahead of it by making all necessary adjustments. Last quarter, we laid out our simple strategy playbook going forward. Let me review and add a few items. We're going to keep it simple and focused and adhere to this core strategy.\n\nFirst, as I said last quarter, we're going to continue to sell homes, adjust pricing to market conditions and maintain reasonable volume. We have discussed over the past years that we have a strong -- that we have a housing shortage across the country. We will continue to build even as prices adjust in order to fill that shortfall and provide much needed workforce housing. As we have noted many times in the past, whether the market is improving or declining, we employ our dynamic pricing model week by week to price product to current market conditions in order to maximize pricing and margin while we maintain a very carefully and limited inventory level.\n\nAs the market moves, that is how we will continue to be responsive. Second, we are going to work with our trade partners, as I've said, to rightsize our cost structure to current market conditions as well. Third, we will and have sharpened our attention on land acquisitions. We are being extremely selective on new land acquisitions and new communities.\n\nWe have rereviewed and reunderwritten every land deal in our pipeline, and we are reunderwriting to current market conditions. Capital allocation is being micromanaged as every dollar invested in land must compete against repurchasing our own stock as we seek to maximize total shareholder value and return. In sync with selling homes, we will continue to improve our cost of doing business by focusing on and reducing SG&A. We have seen quarter-over-quarter improvement in our SG&A over the past years.\n\nAnd we expect to drive efficiencies through technology and process improvement to offset market adjustments where possible while we leverage our extraordinary management team across the country. Next, we will maintain tight inventory control. We are aware that our inventory levels are up 20% year over year. This increase is mostly a function of growth, supply chain dysfunction and expanded cycle time.\n\nAs our growth rate is reduced to 0 and our cycle times revert to normal, our inventory should shrink and should generate sizable cash flow in the future. Our commitment to sales pace will ensure that we will not create standing inventory in its place. Next, we'll continue to focus on cash flow and bottom line to protect and enhance our already extraordinary balance sheet. And finally, we will conclude our long-planned and awaited spin-off by year-end.\n\nRecent back-and-forth questions with the SEC could push the final date by a month or so, but Quarterra will be listed very soon. Of course, prior to the spin, we will have a comprehensive company overview and conference call to introduce the new management team and to further detail the financial elements of the company. Stay tuned. As we have continued to refine and finalize the three verticals of our spin company, we will spin a mature asset management company into the public market along with billions of dollars of assets under management that we previously held on Lennar's books.\n\nLennar will be a pure-play homebuilding company with a simple mandate to build and sell homes that delight our customers while we drive and maximize shareholder value. The final spin of our new company, Quarterra, will trade under the stock symbol Q, and we'll have, as noted before, it will be an asset-light asset management business that will have a limited balance sheet. We are very excited about the prospects for Quarterra as this is our second spin in our history, and we have great confidence for its prospects for the future. So let me conclude by saying that while the market is shifting and adjusting to a new higher interest rate environment, we at Lennar are prepared.\n\nWe have been here before, and we have navigated adversity. We have a seasoned team that knows exactly what to do and how to do it. Every member of the Lennar management team is fully aligned and working in a coordinated way. We are extremely well positioned financially, organizationally and technologically to thrive and to succeed in these conditions.\n\nWe recognize that interest rates are rising, inflation continues to be a legitimate threat and important parts of the economy are slowing. We know that the Fed is determined to curtail inflation, and this will take some time. But we also know how to adjust to the market -- to these market changes, and we are making those adjustments. As we look to the remainder of 2022, we recognize there are challenges in the market that we must carefully regard, expect that we will meet the challenges and that we will continue to adjust to maximize opportunity and drive Lennar into an ever better future.\n\nWith that, let me turn over to Rick.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nThanks, Stuart. As you can tell from Stuart's opening comments, the overall housing market has been reacting to significant increases in mortgage rates, continued inflation and a volatile stock market, all of which has impacted affordability and homebuyer confidence. While we continue to have some strong markets, in our more challenging areas, we've had to adjust prices and increase incentives to regain sales momentum. Our sales strategy has been to find the market clearing price for each of our homes on a community-by-community basis as quickly as possible and price our homes accordingly.\n\nThis has required a detailed understanding of traffic trends, inventory levels, community and product-specific pricing, financing programs and buyer sentiment. During the third quarter, our new sales orders declined by 12% from the prior year on a 1% lower year-over-year community count. While our cancellation rate and sales incentives picked up during the quarter, our sales orders and sales pace per community increased sequentially each month as we successfully executed our pricing strategy in more and more markets. To put some color on this, our sales pace per community in June, July and August was 3.7, 3.9 and 4.5, respectively for the quarter.\n\nTo achieve this, we lowered our base new order sales price and increased sales incentives in many communities. On a companywide basis, new sales order incentives increased during the quarter from 2.3% in June to 6% in August and varied significantly by market and community. Based on these combined adjustments, our new net order sales price declined 9% sequentially from the second quarter but was up 1% from the prior year. This pricing strategy produced enough new gross sales to offset cancellations companywide as our third quarter cancellation rate was 21%, which is slightly above our historical average.\n\nOur pricing strategy has continued to work successfully in September. It gives us confidence in our new sales orders guidance for the fourth quarter. We fundamentally believe that this price to market strategy reflects our balance sheet first of focus, where we can maintain starts in sales, generate cash flow and keep our homebuilding machine going. I'd now like to give you an update on our markets across the country.\n\nIt really fall into three categories: one, markets that have continued to perform well; two, markets where we have adjusted pricing and incentives, found the market price and have successfully regained sales momentum; and three, markets that may require some additional pricing adjustments to regain our targeted absorption base. During the third quarter and so far in September, we have had nine markets that continue to perform well. These are Southwest Florida, Southeast Florida, Palm Atlantic, New Jersey, Maryland, Virginia, Charlotte, Indianapolis and San Diego. These markets are benefiting from extremely low inventory.\n\nAnd many are benefiting from a strong local economy, employment growth and in-migration. While these markets have continued to be strong, we have had to offer mortgage buydown programs and normalize incentives to maintain sales momentum. Some communities in these markets have required targeted price adjustments on a limited basis. Our category two markets, which reflect markets where we have made more significant adjustments to regain sales momentum, include 22 markets.\n\nThese are Tampa, Orlando and Jacksonville, Coastal Carolinas, Atlanta, Chicago and Nashville, Raleigh, Dallas, Houston, San Antonio, Phoenix, Tucson, Las Vegas, Colorado, Coastal California, Coastal Carolinas, Inland Empire, Bay Area, the Central Valley, Sacramento, Seattle and Portland. Each of these markets traffic has slowed, and we saw a pickup in cancellations. While inventory is limited in each of these markets, we've had to offer more aggressive financing programs, base price reductions and/or increased incentives to regain sales momentum. Size of the adjustments has varied on a community-by-community basis and has often been limited to specific homes each week -- in each community each week.\n\nIn some cases, to avoid cancellations, we have adjusted pricing on our homes in backlog. We believe we are being very proactive with our pricing and not reactive. This has allowed us to sell homes and avoid building finished inventory. We are outselling the competition and are increasing our market share.\n\nCategory 3 markets, which reflect more significant market softening and correction, include seven markets. These are the Philly Metro area, Minnesota, Pensacola, Austin, Reno, Boise and Utah. While the drivers and individual dynamics of these markets are varied somewhat, traffic has slowed significantly. Buyers are taking more time to make a purchase decision, and many need to be convinced that now is the time to buy.\n\nThere is fear that sales prices have not hit bottom, which has led to an elevated level of cancellations. In these markets, we are focused on establishing pricing that generates new gross sales to offset cancellations. This has required us to work in many cases with backlog to prevent cancellations. It has also required a mix of significant base price adjustments, sales incentives and aggressive mortgage buydowns.\n\nWhile we've made progress in these markets, we still need to make some adjustments on a community-by-community basis. There's not a one-size-fits-all solution. Everything needs to be fine-tuned to the specifics of the market and community. I'm confident that we'll make progress in each of these markets in the fourth quarter.\n\nWe're fortunate to have solid gross margins and limited completed unsold inventory, so we should be able to get these markets on track shortly. I hope this gives you a better picture of our markets across the country and what we're doing to keep our sales activity going. Markets remain very fluid, and we are making proactive strategic decisions and adjustments every day. We are committed as a management team to address any future market changes quickly.\n\nAs we've said in the past, we're going to keep our homebuilding machine going, maintain our starts pace and price our homes to market. This is our balance sheet focus. Before I turn it over to Jon, I'd like to thank all of our trade partners and associates for their hard work and endless dedication during these rapidly changing times to successfully execute our operating strategies. Now I'd like to turn it over to Jon.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nThanks, Rick. This morning, I will discuss our sales and inventory management focus, our land strategy and give an update on the status of the supply chain. I'd like to start by laying out a few additional thoughts on the detail that Rick just walked you through. As discussed, this quarter was all about the daily process of adjusting home prices to find market clearing values in each individual community.\n\nAs noted, our starts and sales pace for the quarter were 4.4 homes and 4.0 homes, respectively. This gap between starts pace and sales pace comes from the time it takes to make the pricing adjustments necessary to be perceived as value by the consumer finding that value proposition is a process that takes several weeks and is ongoing. In other words, once market pricing is found through discovery, the market often experiences further adjustments, and a new value proposition must be discovered. As we went through the process of finding clearing prices in communities, this informed our decision-making, which enabled broader pricing adjustments, leading to our improved sales pace across our entire platform for the month of August.\n\nAs Stuart noted, our operators use our dynamic pricing model to help them understand the timing of inventory as it moves through the construction process. This tool gives us visibility into sales pace and associated pricing by community and even by plan, allowing us to maintain our starts pace without building up excess inventory. Our inventory position at the end of the quarter was just over 500 completed unsold homes or 0.4 homes per community. Next, I want to discuss our land focus in the third quarter.\n\nAs expected, we focused a lot of attention on reassessing every land deal in our pipeline along with updating our underwriting. Based on our intense review, we move forward only on those deals with starts in 2023 and where we were also confident in the updated financial underwriting. Most of the land deals we closed on in the quarter came from our strong land relationships with existing structured quarterly takedowns. These takedowns are deals where we would be starting the homes quickly and still projected healthy margins.\n\nAll other deals based on the updated underwriting either had its timing delayed, was restructured or we did not proceed. Our intensified focus on our land-light strategy was evidenced by our controlled home site percentage increasing to 63% at the end of the third quarter, up from 53% last year. We also further reduced the years of owned home sites to 2.9 years at the end of the third quarter, down from 3.3 years last year. And we reduced the number of home sites purchased in the third quarter to about 13,100, down 21% and 25% year over year and sequentially, respectively.\n\nOur extreme focus on a deal-by-deal review and adherence to our disciplined land lighter model drove the significant improvement in the strength of Lennar's balance sheet, as Stuart discussed. Now, I'd like to turn to the current state of the supply chain. Our third quarter continued presenting some favorable cycle time results while still dealing with ongoing disruptions from certain material shortages. Although it was minor, it's still significant that we achieved a three-day reduction in cycle time in Q3 from Q2.\n\nAdditionally, over 50% of our markets experienced cycle time reductions in the third quarter compared to 25% in the second quarter. The primary material disruption in the third quarter was related to the delivery of electrical equipment such as switchgear, multimeter boxes and pad-mounted transformers. Construction labor remains very tight as industrywide high levels of volume for second half deliveries moves through the various stages of construction. We expect to start seeing some easing in labor as the overall industry reduces the level of construction starts.\n\nThis easing should start to first occur in the fourth quarter with front-end trades and in the first quarter with finished trades. As expected, cost increased in our third quarter as increases from lumber that spiked in Q1 flowed through our third quarter closings. We also saw increases in other material costs and labor in Q3 closings, resulting in a total direct construction cost increase of 6% and 21% sequentially and year over year, respectively. As a reminder, the drop in lumber prices we saw earlier in the year materially benefited the cost of our starts in the third quarter and will flow through deliveries in the first half of 2023.\n\nThank you, and I'll now turn it over to Diane.\n\nDiane Bessette -- Chief Financial Officer\n\nThank you, Jon, and good morning, everyone. So Stuart, Rick and Jon have provided a great deal of color regarding our homebuilding performance. So therefore, I'm going to spend a few minutes on the results of our other business segments in our balance sheet and then turn to Q4 guidance. So starting with financial services.\n\nFor the third quarter, our financial services team produced operating earnings of $99 million, excluding the recording of a onetime litigation pool. And then looking at the details, our mortgage operating earnings was $64 million compared to $80 million in the prior year. As we've indicated for several quarters, the mortgage market continues to be extraordinarily competitive for purchase business. As a result, secondary margins have been decreasing.\n\nThis decrease in earnings was partially offset by an increase in interest rate lock commitments. Total operating earnings were $33 million compared to $26 million in the prior year. Final earnings increased primarily as a result of higher volumes and an increase in revenue per transaction. Our financial services team continues to rise to the occasion each and every quarter to assist our homebuilder divisions and properly service our customers.\n\nAnd then turning to the Lennar other segment. For the third quarter, our Lennar other segment had an operating loss of $118 million. This loss was primarily the result of a noncash mark-to-market loss on our publicly traded technology investments, which totaled $86 million. As we've mentioned before, we are required to mark to market many of our technology investments that are publicly traded, and that valuation will fluctuate from quarter to quarter.\n\nHowever, we believe these technology partnerships provide significant operational efficiencies for both our Homebuilding and financial services platform and greatly improve our customers' experience. And then looking at our balance sheet quickly. As you've heard all of us mention this quarter, we were laser-focused on managing our balance sheet. We focused on generating cash by pricing to market, and we focused on preserving cash by monitoring our stock space and carefully reviewing potential land purchases.\n\nThe end result, as you've heard us say, is that we ended the quarter with $1.3 billion of cash and no borrowings on our $2.6 billion revolving credit facility. This provided a total of $3.9 billion of homebuilding liquidity. During the quarter, we continued our progress of becoming land lighter. At quarter end, we owned 184,000 home sites and controlled 307,000 home sites for a total of 491,000 home sites.\n\nThis translates into 2.9 years of home sites owned, an improvement from 3.3 years in the prior year and 63% home sites controlled, an improvement from 53% in the prior year. Most important, though, we believe this portfolio of home sites provides us with a strong competitive position to continue to grow our market share. Additionally, we continue to delever our balance sheet as we repaid $575 million of senior notes that were due in November of this year, and we have no additional maturities in fiscal 2023. In the last several years, we have repaid $5.4 billion of senior notes with an associated annual interest savings of almost $300 million.\n\nA continued paydown of senior notes and continued strong generation of earnings brought our homebuilding debt to total capital ratio down to 15% at quarter end, our lowest ever, which is an improvement from 21.2% in the prior year. Our stockholders' equity increased to $23 billion. Our book value per share increased to almost $79. Our return on inventory was 32.7%, and our return on equity was 21%.\n\nFinally, we received an upgrade from Moody's during the quarter. Our credit rating was increased from Baa3 to Baa2. We greatly appreciate Moody's confidence in our company and continue to be very pleased to have an investment-grade rating from all three agencies. In summary, the strength of our balance sheet, strong liquidity and low leverage provide us with significant confidence and financial flexibility to navigate this uncertain market.\n\nWith that brief overview, I'd like to turn to guidance. As Stuart mentioned, it continues to be difficult to provide the targeted guidance that we have historically provided, given the uncertainty in market conditions. So as we did last quarter, we are providing very broad ranges to give some boundaries for each of the components. So let's start with new orders.\n\nWe expect Q4 new orders to be in the range of 14,000 to 15,500, and we expect our Q4 ending community count to increase about 5% from Q3. We anticipate our Q4 deliveries will be in the range of 20,000 to 21,000 homes. Our average sales price should be in the range of $475,000 to $480,000. Our gross margin is in the range of 26% to 27%, and our SG&A between 5.7% and 5.9% as we continue to price to market, turn our inventory and generate cash.\n\nFor the combined homebuilding joint venture, land sale and other categories, including noncontrolling interest, we expect a loss of approximately $15 million. We anticipate our financial services earnings for Q4 will be in the range of $50 million to $60 million as market competition for purchased business continues to increase. We expect earnings of $15 million to $20 million for our multifamily business. And for the Lennar other category, we expect a loss of about $20 million.\n\nThis guidance does not include any potential mark-to-market adjustments to our technology investments since that adjustment will be determined by their stock prices at the end of our quarter. We expect our Q4 corporate G&A to be about 1.2% of total revenue, and our charitable foundation contribution will be based on $1,000 per home delivery. We expect our tax rate to be about 24.5%, and the weighted average share count for the quarter should be approximately 288 million shares. And so when you follow this together, this guidance should produce an EPS range of approximately $4.65 to $5.30 per share for the fourth quarter.\n\nAnd with that, let me turn it over to the operator.\n\nOperator\n\nThank you. [Operator instructions] Truman Patterson with Wolfe Research. You may go ahead, sir.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nHey. Good morning, everyone. Thanks for taking my questions. So you all have been pretty open about the fact that you intended to throttle the incentive level to really drive volumes.\n\nAnd the orders down 12% is, I think, a good result in the current environment. So your order ASP fell 9% sequentially. All four regions looked like they ticked lower. I'm just hoping you can help us understand how much of that 12% decline was a function of base price cuts, incentives, etc.? Was it the overwhelming majority or was there some product mix shift in there?\n\nStuart Miller -- Executive Chairman\n\nWhy don't I let Rick take that? Go ahead. I'm going to play a little traffic cop here because we are in remote locations. So go ahead, Rick.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nSo as I mentioned in my commentary, there was about a four and a half incentive that was priced in the quarter. Some of that was a base price change with a slight mix adjustment as we closed a more significant amount of entry-level homes during the quarter.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nOK, perfect. So that four and a half percent increase captures both the incentive level and the base price cuts. All right. Thanks for that.\n\nAnd you all now have increased your option land to 63% of your portfolio. It's been a pretty rapid shift over the past couple of years. And you mentioned that you reassessed every deal in your pipeline, and you're working with partners to improve underwriting standards. Could you help us understand if you've actually been walking away from deals at an accelerated pace? I noticed your option lot declined in the quarter.\n\nCould you discuss just the willingness of your partners to work with you all? And any chance you might be able to help us quantify what portion of controlled deals might be on the watch list or at risk?\n\nStuart Miller -- Executive Chairman\n\nSo let me give a broad thought process on that. There is -- there are a couple of buckets you got to think about. Some of the shorter-term deals that we have been working through that we own home sites in, those home sites continue to be valuable assets that we're working -- that we're putting into production and generating an attractive margin on even in current market conditions. We will continue to build through those communities.\n\nThat's one of the benefits of shorter-term deals is they generally will work through and still generate an attractive margin. In every land deal that we have in our pipeline, we are going back and doing the reunderwriting on, not just onetime, but on a pretty regular basis, given the movements in market conditions. And so the answer to your question is we will walk away from programs that we have or land that we have under contract that no longer meet the underwriting criteria and where we have the ability to walk away at an attractive cost. We're just not going to go forward on deals that no longer meet the underwriting criteria.\n\nAnd that is the benefit that comes to bear, given the way that we've migrated our land program over the past couple of years. So over this past quarter, there are deals that meet the stringent underwriting criteria and deals that don't. And those that don't fall out of the filter, and we've walked away and we'll come back another day. So we've probably walked away from something in the nature of 10,000 home sites just over this past quarter.\n\nIs that it, Diane?\n\nDiane Bessette -- Chief Financial Officer\n\nThat's right. Yes, that's right.\n\nStuart Miller -- Executive Chairman\n\nYes. And Rick, Jon, do you want to weigh in on that?\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nYeah, I would just add that we have extremely strong relationships with a lot of land partners. And relative to your question, we are able to work with them to either adjust timing, to restructure, to change pace. And that combined with, as Stuart described, just a constant refreshing analysis just keeps us very current so that the land we are acquiring is turning into starts very quickly with very acceptable margins. And if it doesn't fit that criteria, we're finding the appropriate alternative solution for the asset.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nAll right. Thank you, all and good luck in the upcoming quarter.\n\nStuart Miller -- Executive Chairman\n\nOK, very good. Thanks. Next question, please.\n\nOperator\n\nThank you. Susan Maklari from Goldman Sachs. You may go ahead.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nThank you. Good morning, everyone.\n\nStuart Miller -- Executive Chairman\n\nGood morning.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nMy first question is Stuart, you talked a lot about cash generation. And as we do think about the overall market moderating, can you talk to some of the changes in the business today relative to the past cycle, what that will mean for your ability to generate cash as we think about things changing on the ground, and the areas that you're really focused on investing in, in order to position the business for that eventual recovery and where you see Lennar going over time?\n\nStuart Miller -- Executive Chairman\n\nGreat question. Historically, if you look at the composition of Lennar and many of the builders, we've migrated away from those longer-term land positions that have really stuck us in the mud as the market has gotten slow. And because we have basically converted our land asset to short-term assets, those assets will turn over as we continue to produce through the current market conditions. And so -- and we'll replace those assets with land assets that are repriced, given the current market condition.\n\nSo that's a structural change in Lennar specifically and in the industry more broadly that I think is going to be very cash generative. There are a number of things that work against homebuilders in downtime. One of them is long-term land, and that's been mitigated. The second thing I'd say is when you're growing a homebuilding company, one of the big cash users is the growth component.\n\nWe're constantly buying land and putting more sticks and bricks in the ground to accommodate growth. As you migrate to a slower growth level or a zero growth level, that in itself is cash generative. So now short-term land position plus migration to a no growth environment, both very cash flow positive. And then the one anomalous component is the cycle time that is derived from the supply chain impairment that we've been dealing with.\n\nThat has added about 25% more cash use inventory buildup relative to normalized times. As we've noted before, we've added about two months to our generally six-month cycle time. And I think that's an industry kind of average. And that two months ultimately is going to find its way to resolution.\n\nWe will see a reversion back to a normalized kind of cycle time in production. And that also should be tailwinds, winds at our back in terms of generating cash as we have a normalization, might take place this year, might take place over the next couple of years, but it should generate cash as we go forward.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nOK, that's very helpful color. And then following up, affordability is obviously a key focus as rates rise and the macro changes. Can you talk to some of the benefits of your underlying operations and how you're able to sort of drive that narrow band between the tensions that exist on the cost side relative to what the consumer needs and the ability to get those first time kind of home buyers into a house?\n\nStuart Miller -- Executive Chairman\n\nWell, listen, I'm going to have Rick and Jon both speak to this. Let me just say as a general overview along those lines, the three of us just left a two-day session with our trade partners. And the partnership that exists among our operating groups in the field and our trade partners really came to light as we had straight conversation about what the market is doing and partnership and recognizing that we've all got to find a way to reconcile costs to enable affordability in the sales price of the home. That goes to our land partners as well as to our trade partners.\n\nI think that across the industry, everybody recognizes that there's going to have to be a cost reconciliation as interest rates go up. It's clear that there's going to be more increase in interest rates that we're going to be dealing with. So we've got to band together to make the machine work, and that means a cost structure that enables affordability. Rick? Jon?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nYeah, it's exactly what you said, Stuart. It's a combination of us reducing sales prices and having the margin impact, and you saw that we executed on that during the quarter. We've discussed with our trade partners that there needs to be a sharing. Everyone made a lot of money during the up cycle, and it's time to work as partners to restructure the cost side on both the labor and material side.\n\nAnd in addition, as Stuart walked through the land side of the business, there's going to be some adjustments in the land pricing. So it's the collective of all three of those that we will do in order to execute the strategy to keep the sales momentum going.\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nThe only thing I would add is that we're also -- during this time, as Rick highlighted, we have to find the right price to match the affordability perspective and reality that our customer has. It's -- we look very carefully at our product offering to see where we can do some significant value engineering as well as introduce smaller, more efficient product into certain markets. So we continue to move down the price curve and meet the place where affordability for the consumer intersects with mortgage payment and home prices.\n\nStuart Miller -- Executive Chairman\n\nYeah. I guess the bottom line, this is a dynamic situation. And the execution part of that is alignment. You hear alignment with me, Rick and Jon, and we've conveyed that through the Lennar organization to the trade partners and to our land partners as well that work has got to be done, and everybody is at work.\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nOK, thank you, and good luck with everything.\n\nStuart Miller -- Executive Chairman\n\nThank you. Next question, please.\n\nOperator\n\nThank you. Stephen Kim with Evercore ISI. You may go ahead, sir.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nYeah. Thanks very much guys. Just first question just from a housekeeping perspective. From calculating your starts, we're probably about 15,700.\n\nCorrect me if I'm wrong. And then you talked about inventory, maybe freeing up some cash. I think you said that cycle times, moderating cycle times eventually was 25% I guess of the growth. I suppose that was a comment about your sticks and bricks inventory.\n\nSo bet on the line is on the inventory, I'm thinking that the cycle time negative impact. Am I right in thinking that you're saying that, that's about $1.8 billion of cash that's burdening your current inventory? So that number and then also the 15,700 starts, is that in the ballpark?\n\nStuart Miller -- Executive Chairman\n\nSo I'm happy you asked the question that way, Steve. I will tell you that Diane has tried to figure out what the number is. And that specificity is we haven't been able to put our finger on it, but it is in that kind of neighborhood. It's a significant amount of dollars that are tied up because of the cycle time increase.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nYeah.\n\nDiane Bessette -- Chief Financial Officer\n\nThis instance, Steve, you're pretty close, we had about 16,000 starts this quarter, so good math.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nGot you. And then in addition to that $1.8 billion neighborhood kind of number, you had also mentioned that you could see your inventory shrink further due to slower growth, more on the land side and that sort of stuff. But I assume that growth comment is temporary. So I'm thinking that near term or the longer term, the opportunity is probably really on the whip.\n\nSo correct me if I'm wrong on that. But I wanted to ask about your standing inventory comment as well. You said, I think, Jon, you mentioned about 500 finished, completed or finished specs right now. The way I calculate that, that's about two to three times where you typically have two to three times more than that before the pandemic hit and all that on a per community basis.\n\nAnd so I'm wondering, is this 500 like the new normal for you? Is this a new desired level for you? And if so, why is that if what we've been hearing is true that you're seeing that folks are actually fairly -- actually preferring customers or preferring homes that they can move into more quickly. Just wanted to understand if there's any change in your thinking about managing specs as they get near completion, and why you might be looking to reduce that number in light of customer preferences.\n\nStuart Miller -- Executive Chairman\n\nSo it's another good observation. You're absolutely right. We basically run our inventory around about one home per community. And you're right, we're a little bit less than half of what normal has been pre-pandemic.\n\nAnd we do envision that we will grow our inventory to a more normalized level. We might even go beyond that. And the point in raising the low level of inventory is we don't -- we want people to understand, we want everyone to understand that we're not just putting production in the ground and allowing inventory to build up. We have a disciplined approach to sales and making sure that we're clearing inventory.\n\nThat's what our dynamic pricing model is all about, and we're on it every day. But at the same time, your point that having some standing inventory is a benefit to customers looking for an instant movement, we will -- we haven't been able to have inventory on the ground during the pandemic time. It is best practice to have a little bit more than we have right now. And we'll grow to that level, but it will be done in a very disciplined way.\n\nJon, Rick, do you want to add to that?\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nI think you really covered exactly what our operating strategy is, Stuart. And Stephen, your assessment of the numbers is right and of the consumer desirability especially in a changing interest rate environment. For a quick move-in, they can lock in their rate if they buy today and create that certainty for themselves. So that is definitely an advantage.\n\nBut we're very focused, as Stuart highlighted, using dynamic pricing to make sure our homes are sold in time. So as they come off our construction assembly line, we're able to deliver them to the customer. And they'll fall in that range in a more normalized time of about one community per week. It will fluctuate from time to time, but that's our focus.\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nThe only thing I'd add to that, Steve, is as Stuart said in his comments and I mentioned as well, we're very focused on cash generation. Easiest cash to generate is the sale of a completed home. But to the extent that we have standing inventory, we're going to sell that home because we've got homes moving through the production cycle that are going to replace that. Whether it's a half or one, we've continued to refine our pricing strategy to maximize the cash and quickly sell the inventory as it progresses from stage to stage.\n\nStuart Miller -- Executive Chairman\n\nAnd then just to add -- to go back to your earlier comment, yes, Steve, a zero growth rate would be a temporary condition, not a permanent one. But there's an overhang or an overshadowing concept that matters. We don't want to fight the tape. So we're not going to try to grow when the tape is telling us not to, and that's clearly the case.\n\nBut as the market comes back and as I noted in my comments, the long-term prospects for housing are strong and good. As the market turns around, we'll be very well positioned with a very strong cash position to be able to lean into market conditions improving as that happens.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nExcellent. Thanks very much, guys.\n\nStuart Miller -- Executive Chairman\n\nNext question.\n\nOperator\n\nThank you. Our next caller is Alan Ratner from Zelman and Associates. Please go ahead, sir.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nHey, guys. Good morning. Thanks for the time. Appreciate it.\n\nStuart Miller -- Executive Chairman\n\nGood morning.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nI guess, first, Stuart, maybe directed at you. We've talked in the past about build for rent and that space being a potential kind of countercyclical vehicle in the event of a slowdown in primary demand, which is clearly what we're seeing today. I'm just curious if you could talk to your current BFR business, whether perhaps you're leaning a bit more heavily on that in the current climate. And obviously, with your relationship with the fund and the investors there, what the current appetite is among those investors?\n\nStuart Miller -- Executive Chairman\n\nGreat. I'm going to ask Rick to jump in after. I'm going to give a first comment and say that I do believe that single-family for rent is going to continue to grow and be a meaningful part of the housing market. I've learned over the years that SFR has always been a part of the market more dominated by the mom-and-pop participants.\n\nNow it's been professionalized, and more institutional buyers are a significant part of the market. But that part of the market has pulled back as interest rates have gone up, as prices have come down and it has moderated. So it is still a very small part of our production and our sales program overall. And I have no question that as prices moderate, the SFR business will push in and become more of a significant part of the recovery.\n\nSo Rick, do you want to fill in some of the thoughts and numbers there?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nYes. Stuart, as you mentioned, as rates have risen, several of the SFR players use leverage that's floating in order to underwrite and finance their deals. Accordingly, some of the investment in that space has slowed down, but rents are continuing to maintain. And as a result, they'll get -- they'll ultimately get their embedded yields that they're looking for.\n\nFor us as a company, we had about 1,000 homes that we sold to the single-family rental space in the last quarter. It's probably underestimated because there were some additional sales in our communities that other folks are investing in and renting that aren't captured in that number. But it was about 1,000, and our SFR program itself was a little bit more than 700 during the quarter.\n\nStuart Miller -- Executive Chairman\n\nLet me just add to that and say that embedded in your question, I think, is the question of what percentage and are we ramping up the Quarterra part of our SFR program. And the fact, the reality is that our program has taken a very disciplined approach to stepping back and waiting for the market to kind of reconcile itself. So contrary to what you might have thought, we're probably selling less to our own program and more to other SFR programs outside of Lennar.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nOK. No, that's really helpful and thank you for that disclosure there. It's very helpful. I guess second question just on the kind of the monthly cadence you described.\n\nI think given the 4% increase in incentives/base price reductions, combined with the fact that in August, we obviously saw mortgage rates pull back temporarily, it's not too surprising to see that kind of be the strongest month of the quarter. I think you mentioned that September was kind of following a similar trajectory, which, I guess, I'm a little surprised given the continued increase in mortgage rates or the reemergence in mortgage rates since the end of August. So have you further increased incentives or gotten even more aggressive on price reductions to kind of combat that move we've seen in rates or are you still seeing that momentum continue in spite of the higher rates?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nLet me clarify something. So for Q3, our incentives were about four and a half percent. There was probably about 3% that was base price reduction on top of the incentive with the balance being somewhat mix oriented to a lower price point. As we move into -- we actually have been fairly consistent with where we were in the third quarter and in August.\n\nFrom a pricing standpoint, we're just slight -- ticked up slightly from an incentive standpoint. Our actual net sales price is up higher than it was in August. That might be mix. And from a cancellation rate, we're right on top of where we were for the quarter.\n\nSo we are -- and from a sales pace standpoint, we're very consistent with where we were in August. So we haven't seen any dramatic changes. I think what this is really demonstrating is we really fine-tuned our sales execution strategy.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nGot it. That's great to hear.\n\nStuart Miller -- Executive Chairman\n\nWe are finding the market, and we are finding the market primarily with primary buyers. And as we find the market, there's demand out there, but the demand needs affordability. So that's basically what's happening.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nTo that point, Stuart, if I could squeak in one more. It sounds like many of your competitors have been a bit more reluctant to be as aggressive as you have on the pricing side. So I'm curious if you're seeing more builders of late kind of respond in force to try to match what you guys are doing and presumably one or two of the other larger builders are doing? Or is there really a clear divergence right now in terms of strategies out there, some builders trying to hold on to margin as long as possible and others trying to find the market as you guys are doing?\n\nStuart Miller -- Executive Chairman\n\nLook, it's a mixed bag. There are some builders that are going along with the program that we have in place. There are a lot of others that have different strategies. The smaller builders are reacting a little differently than some of the larger builders.\n\nAnd that's just -- that adds to the choppiness of the market condition. All I can tell you is that market by market, we know exactly what the competitors are doing. We see the inventory buildups where they're happening. We see the migration to sell to price, hold and wait and ultimately, falling off the cliff and saying reconciliation.\n\nEach of these plays out in each market. And that's why we emphasize our dynamic pricing model to each of our divisions because that's what keeps us tuned into the competitive field exactly what's happening and making the judgments that are necessary. I think Rick said it really well. This is an art, not a science.\n\nAnd we are playing the game in each market that exists by knowing what the competitive field is and reacting to it.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nAll right. I really appreciate the thoughts guys. Thanks a lot.\n\nStuart Miller -- Executive Chairman\n\nNext question.\n\nOperator\n\nThank you. John Lovallo with UBS. You may go ahead, sir.\n\nJohn Lovallo -- UBS -- Analyst\n\nGreat. Thank you for taking my questions guys. The first one is, can you just help us on the sequential walk-in gross margin from 3Q to 4Q? It's about 270 basis points at the midpoint. How much is base price reductions? How much is other incentives, rising costs? And how much of an offset is sort of the typical seasonal operating leverage?\n\nStuart Miller -- Executive Chairman\n\nRick, why don't you take that?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nYeah. So putting cost aside, I would say that half of it was probably sales incentives. 40%, 30% of it was base price reductions, and the balance was probably some cost and mix. And Jon?\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nI think that's right. As we've talked about on prior calls, the second half and in the fourth quarter will be our peak construction cost as the highest lumber work through that. And that will start coming down at the very end of the fourth quarter and into the first quarter. So that makes sense what you said, Rick.\n\nAnd clearly, the biggest driver is what we're doing to adjust to market to keep our sales price.\n\nStuart Miller -- Executive Chairman\n\nYes. Let me just add to that and say that in addition to pricing and base price as well as incentives management, we're also managing our backlog, recognizing that as prices adjust, we also sometimes have to go back to our backlog. We don't want to turn yesterday's sales and customers into a cancellation. And so there's some administration of that as well.\n\nAnd so a lot of moving parts in the walk from third quarter to fourth quarter margins. It's not as linear as just what the new sales are.\n\nJohn Lovallo -- UBS -- Analyst\n\nOK. That's helpful, guys. And then maybe switching gears to Quarterra. Third-party equity commitments for the asset management business, I think, were $4 billion last quarter.\n\nWhat has that grown to? And how much third-party capital has been committed to the land strategies?\n\nStuart Miller -- Executive Chairman\n\nWe haven't put those numbers out, so I really can't put those numbers on the table. We're a bit restricted as to what we can disclose at this point. And we're going to do something more comprehensive and putting together a conference call to really let all of those pieces and numbers be known as we're getting ready to actually go public. So I say it again, stay tuned.\n\nJohn Lovallo -- UBS -- Analyst\n\nOK. Fair enough. Thank you.\n\nStuart Miller -- Executive Chairman\n\nOK, thank you. And we'll take our last question now. \n\nOperator\n\nThank you. Mike Rehaut from J.P. Morgan. Sir, you may go ahead.\n\nMichael Rehaut -- J.P. Morgan -- Analyst\n\nThanks. Thanks for squeezing me in. I guess, it's good afternoon now everyone. Just wanted to get a sense directionally for gross margins at least as we think past the fourth quarter.\n\nAnd obviously, I totally appreciate you're not giving guidance for a good reason at this point for fiscal '23. But as we think about maybe the first quarter or 2, and you look at the 4.5% average incentive for the quarter, and you ended August around 6%. So you turn about out another 150 bps, if we just kind of held things there and also held costs, and I know you're working hard on costs as well, but is that a good starting point to think about the difference between first quarter '23 gross margins and what you're doing currently, that additional 150 bps again holding other understandably key variables constant?\n\nStuart Miller -- Executive Chairman\n\nSo Mike, I think the best way for me to answer this is to say that we have decidedly not given guidance for the fourth quarter because there are so many moving parts. We recognize the best we can do is give some boundaries to help the modeling. I think that there -- it gets even more complicated as we go out to the first quarter. So we're not going to wade into those waters simply because there's a lot moving around.\n\nAs we sat yesterday and listened to Chair Powell lay out kind of his thinking for the way forward, it just helps us recognize that we're living in a dynamic environment that's going to change a lot of things month by month, quarter by quarter. And we're focused on week by week. Our management team gets together every other day to coordinate, to find alignment and to look at the patterns that are revealing themselves real-time in the marketplace, and each market is different. So I guess that's a big and long-winded excuse, but we're not really going to weigh in on our first quarter numbers right now.\n\nMichael Rehaut -- J.P. Morgan -- Analyst\n\nOK. Appreciate that. I guess similarly at the risk of asking another question that might be hard to answer, but directionally, how should we think about community count in '23? Obviously, this year, you're looking to end with some sequential growth 3Q to 4Q. Given the moderation in sales pace, obviously, delays and such can impact the rate of openings.\n\nBut is growth, how we should think about next year? And if so, any sense of degree of magnitude?\n\nStuart Miller -- Executive Chairman\n\nGreat question. We've given that a considerable amount of thought. I'm going to turn to Rick in a second on this because this is his favorite topic. But we are thinking about community count growth into next year.\n\nI can't prove it right now, but we think that there's going to be some comparable reconciliation in land pricing, which will enable us to find opportunities that will rightsize for current market conditions. But we're going to have to wait and see on that. Rick, could you add to that?\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nWell, community count is so tricky because it has -- it's impacted by your sales pace and your existing communities, development timing, whether it's internal development or third-party developers and whether they get the communities done at the appropriate time. Sitting here today, we believe our community count will increase in 2023, probably a single-digit, low single-digit increase. And that could be skewed by what happens in the land market because as other builders may walk away from deals that have finished home sites that will look good for us from an underwriting standpoint because of our low-cost structure, we may find some opportunities to add to community. But as Stuart said, it's a tough read right now, but it looks slightly up.\n\nMichael Rehaut -- J.P. Morgan -- Analyst\n\nGreat. Thanks so much.\n\nStuart Miller -- Executive Chairman\n\nThank you, Mike. All right. We'll wrap it up there. I want to thank everyone for joining us.\n\nThese are tricky times, but this is a seasoned management team that's been there, been here before. We have a game plan strategy. You can expect that we're going to be adhering to that strategy with certainty and look forward to reporting back as we get to the end of the fourth quarter. Thank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlex Lumpkin -- Deputy General Counsel\n\nStuart Miller -- Executive Chairman\n\nRick Beckwitt -- Co-Chief Executive Officer and Co-President\n\nJon Jaffe -- Co-Chief Executive Officer and Co-President\n\nDiane Bessette -- Chief Financial Officer\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nSusan Maklari -- Goldman Sachs -- Analyst\n\nStephen Kim -- Evercore ISI -- Analyst\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nJohn Lovallo -- UBS -- Analyst\n\nMichael Rehaut -- J.P. Morgan -- Analyst\n\nMore LEN analysis\n\nAll earnings call transcripts"
}