{
  "companyName": "Limoneira",
  "companyTicker": "LMNR",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/22/limoneira-lmnr-q4-2022-earnings-call-transcript/",
  "content": "Limoneira (LMNR -2.05%)\nQ4 2022 Earnings Call\nDec 22, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to Limoneira's fourth quarter fiscal year 2022 financial results conference call. [Operator instructions] It is now my pleasure to introduce your host, John Mills, with ICR. Thank you. You may begin.\n\nJohn Mills -- Head of Investor Relations\n\nGood afternoon, everyone, and thank you for joining us for Limoneira's fourth quarter fiscal year 2022 conference call. On the call today are Harold Edwards, president and chief executive officer; and Mark Palamountain, chief financial officer. By now, everyone should have access to the fourth quarter fiscal year 2022 earnings release, which went out today at approximately 4 p.m. Eastern Time.\n\nIf you've not had a chance to review the release, it is available on the investor relations portion of the company's website at limoneira.com. This call is being webcast, and a replay will be available on Limoneira's website as well. Before we begin, we would like to remind everyone that prepared remarks contain forward-looking statements, and management may make additional forward-looking statements in response to your questions. Such statements involve a number of known and unknown risks and uncertainties, many of which are outside the company's control and could cause future results, performance, or achievements to differ significantly from the results, performance, or achievements expressed or implied by such forward-looking statements.\n\nImportant factors that could cause or contribute to such differences include risks detailed in the company's 10-Qs and 10-Ks filed with the SEC and those mentioned in the earnings release. Except as required by law, we undertake no obligation to update any forward-looking or other statements herein, whether as the result of new information, future events, or otherwise. Please note that during today's call, we will be discussing non-GAAP financial measures, including results on an adjusted basis. We believe these adjusted financial measures can facilitate a more complete analysis and greater understanding of Limoneira's ongoing results of operations, particularly when comparing underlying results from period to period.\n\nWe provided as much detail as possible on any items that are discussed on an adjusted basis. Also, within the company's earnings release and in today's prepared remarks, we include adjusted EBITDA, adjusted net loss for diluted EPS, and diluted net loss per common share, which are non-GAAP financial measures. A reconciliation of adjusted EBITDA, adjusted net loss, diluted EPS, and diluted net loss per common share to the most directly comparable GAAP financial measures are included in the company's press release, which has been posted to our website. And with that, it is my pleasure to turn the call over to the company's president and CEO.\n\nMr. Harold Edwards.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThanks, John, and good afternoon, everyone. I am pleased to report that our diversified portfolio of revenue drivers enabled us to achieve record revenue in fiscal year 2022, growing our top line by 11% to $184.6 million and generating $11.9 million of adjusted EBITDA. Our seasonally soft fourth quarter also saw growth over the prior year, with revenue increasing 18% to $39.7 million. We realized strong full fiscal year 2022 growth in both our avocado and orange revenues, driven by increased demand and pricing, almost double the prior year.\n\nIt was an extraordinary year in avocados, with volume and pricing increasing 44% and 73%, respectively, over the prior year. Fresh lemon volume also grew. However, the pricing environment remained difficult for most of the year as domestic and global lemon markets continued to work through a surplus of inventory. This overall pricing pressure has continued into fiscal year 2023 due to the oversupply in the global marketplace.\n\nHowever, we expect seasonal price increases beginning in our stronger second and third quarters. We are working to help insulate ourselves from the volatility of commodity pricing by expanding our third-party fruit supply, whether it be packed, marketed, and distributed by Limoneira, or just marketed and distributed by Limoneira. We are a leading global producer, packager, and marketer of citrus. And our expertise, along with the investments we have made in technology to provide growers insight and transparency into their operations and the investments to our supply chain, have made us an attractive partner to outside growers.\n\nToday, roughly 60% of our source volume comes from third-party fruit. And our goal is to increase that to 75% as we pivot toward an asset-lighter model. This will help reduce the impact of pricing volatility and rising farming costs. Another prong of our strategy is monetization of certain assets.\n\nOne monetization project that we have -- has been underway for some time is our Harvest at Limoneira development project. We closed phase 1 at the end of fiscal year 2021 and are currently on hold for phase 2. The good news is we have a minimal amount of debt on this project, and we are in talks with the city of Santa Paula to expand from 1,500 total residential units to 2,000 units. We received $8 million in cash proceeds from Harvest in the fourth quarter of this fiscal year when we closed the sale of a 17-acre property.\n\nThe land will potentially be used to develop an additional 200 or more residential units within Harvest. We have increased our cash proceeds projection by over 20% to $115 million and updated our timeline to include both the Harvest development and the Harvest Medical Pavilion across the street, which I will discuss in more detail at the end of the call. In addition to Harvest, we have identified over $150 million of assets for monetization as well. We own over 15,400 acres of rich agricultural real estate properties and water rights in California, Arizona, Chile, and Argentina that have been acquired over the past 130 years since our company was founded.\n\nAnd there is a meaningful difference in the current fair market value of these assets compared to the book value because many of these assets were acquired many years ago at low-cost basis. In October, we announced the sale of our Oxnard packing facility for $20 million. And shortly after, in early December, we announced another asset sale, our Sevilla property, for $2.6 million. The proceeds from these sales have been used to reduce our debt and rightsize our balance sheet.\n\nWe will continue our transition to an asset-lighter business model, which includes streamlining our operations, improving consistency of earnings, and increasing EBITDA and dividends per share once the transition is complete in the next 12 to 18 months. Lastly, I'd like to provide an update on our ESG initiatives. This past year, we increased our focus on governance, with a refresh of our board, appointment of new chairs of our committees, and we worked methodically through governance and compensation approaches. This, combined with many other initiatives, enabled us to improve our ESG score by 40% from an average of 7.6 to now 4.6 as of December 2022.\n\nOne area I'd like to highlight that has changed in the past year is our shareholder-mandated clawback policy, which has been updated to better align management with our shareholders. This includes minimum holdings for executives, compensating executives directly for modernization initiatives, aligning executional performance with shareholders to maximize gains on asset sales. And with that, I'd now turn the call over to Mark.\n\nMark Palamountain -- Chief Financial Officer\n\nThank you, Harold, and good afternoon, everyone. As a reminder, due to the seasonal nature to our business, it is best to view our business on an annual, not quarterly, basis. Historically, our first and fourth quarters are the seasonally softer quarters, while our second and third quarters are stronger. For the fourth quarter of fiscal year 2022, total net revenue was $39.7 million compared to total net revenue of $33.5 million in the fourth quarter of the previous fiscal year.\n\nAgribusiness revenue was $38.2 million compared to $32.3 million in the fourth quarter of last year. Other operations revenue was $1.4 million compared to $1.2 million in the fourth quarter of fiscal year 2021. Agribusiness revenue for the fourth quarter of fiscal year 2022 includes $13.1 million in fresh lemon sales compared to $7.8 million during the same period of fiscal year 2021. Approximately 680,000 cartons of fresh lemons were sold during the fourth quarter of fiscal year 2022 at a $19.33 average price per carton compared to approximately 390,000 cartons sold at a $20 average price per carton during the fourth quarter of fiscal year 2021.\n\nThe company recognized $16.4 million of brokered fruit sales in the fourth quarter of fiscal year 2022 compared to $17.4 million in the same period last year. Approximately 583 cartons of brokered fruit were sold during the fourth quarter of fiscal year 2022 at a $28.13 average price per carton compared to approximately 941,000 cartons sold at an $18.44 average price per carton during the fourth quarter of fiscal year 2021. The higher average price per carton in fiscal 2022 is from the addition of higher margin fruits, including mandarins, grapefruits, and limes. The company recognized nominal avocado revenue in the fourth quarter of fiscal years 2022 and 2021.\n\nThe company recognized $2.7 million of orange revenue in the fourth quarter of fiscal year 2022 compared to nominal orange revenue in the same period of fiscal year 2021. Approximately 86,000 cartons of oranges were sold during the fourth quarter of fiscal year 2022 at a $31.22 average price per carton. Specialty citrus and other crop revenues increased to $5.5 million in the fourth quarter of fiscal year 2022 compared to $3.2 million in the fourth quarter of fiscal year 2021. The increase was primarily due to increased brokered fruit and wine grape sales in the fourth quarter of fiscal year 2022.\n\nTotal cost and expenses for the fourth quarter of fiscal year 2022 were $41.5 million compared to $40 million in the fourth quarter of last year. Operating loss for the fourth quarter of fiscal year 2022 improved to $1.9 million compared to a loss of $6.5 million in the fourth quarter of the previous fiscal year. Net loss applicable to common stock after preferred dividends for the fourth quarter of fiscal year 2022 was $2.8 million compared to a net loss of $5 million in the fourth quarter of fiscal year 2021. Net loss per diluted share for the fourth quarter of fiscal year 2022 was $0.16 compared to a net loss per diluted share of $0.28 for the same period of fiscal year 2021.\n\nAdjusted net loss for diluted EPS for the fourth quarter of fiscal year 2022 was $5.7 million compared to a loss of $4.5 million in the same period of fiscal year 2021. Adjusted net loss per diluted share was $0.32 compared to adjusted net loss per diluted share of $0.26 for the fourth quarter of fiscal year 2021. A reconciliation of net loss attributable to Limoneira Company to adjusted net loss per diluted EPS is provided at the end of our earnings release. Adjusted EBITDA was a loss of $3.8 million in the fourth quarter of fiscal year 2022 compared to a loss of $3 million in the same period of fiscal year 2021.\n\nA reconciliation of net loss attributable to Limoneira Company to adjusted EBITDA is also provided at the end of our earnings release. Adjusted EBITDA in previous periods did not exclude stock-based compensation expense, which has now been excluded as we believe it is a better representation of cash generated by operations and is consistent with peer company reporting. Adjusted EBITDA for prior periods has been restated to conform to the current presentation. For the fiscal year ended October 31, 2022, revenue was a record $184.6 million compared to $166 million in the same period last year.\n\nOperating income for fiscal year 2022 was $2.2 million compared to a loss of $6.3 million in the same period last year. Net loss applicable to common stock after preferred dividends was $737,000 for fiscal year 2022 compared to a net loss of $3.9 million for 2021. Net loss per diluted share for fiscal year 2022 was $0.04 versus a net loss per diluted share of $0.23 in fiscal year 2021. For fiscal year 2022, adjusted net loss per diluted EPS was $1.3 million compared to a net loss of $2 million for fiscal year 2021.\n\nAdjusted net loss per diluted share was $0.08 compared to adjusted net loss per diluted share of $0.11 for fiscal year 2021 based on approximately 17.5 million and 17.6 million, respectively, weighted average diluted common shares outstanding. We recorded for fiscal years 2022 and 2021 an income tax provision of $800,000 and a benefit of $300,000 -- pre-tax income of $300,000 and a loss of $4.2 million, respectively. The tax provision recorded for fiscal year 2022 differs from the U.S. federal statutory tax rate of 21% due primarily to foreign jurisdictions which are taxed at different rates, state taxes, tax impact of stock-based compensation, nondeductible tax items, and valuation allowances on certain deferred tax assets of foreign subsidiaries.\n\nFor fiscal year 2022, adjusted EBITDA was $11.9 million compared to $9.9 million for fiscal year 2021. Turning now to our balance sheet and liquidity, long-term debt was now down over 20% as of October 31, 2022, to $104.1 million compared to $130.4 million at the end of fiscal year 2021. This is the lowest level it has been in the past four years, and we expect further reduction of our debt in fiscal 2023 as we continue to strategically monetize certain assets in fiscal 2023. Now, I'd like to turn the call back to Harold to discuss our fiscal year 2023 outlook and longer-term growth pipeline.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThanks, Mark. Initial crop reports for lemon suggest industrywide production is expected to be down 10% to 15% in fiscal year 2023 from Mother Nature. However, due to the planned expansion of our third-party fruit, we are expected to increase volume and increase our market share in fiscal year 2023. We expect total lemons sales volumes to be in the range of 5 million cartons to 5.4 million cartons for fiscal year 2023.\n\nThis is up from 4.9 million cartons in fiscal year 2022 and 4.4 million cartons in fiscal year 2021. For the first quarter of fiscal year 2023, we expect to experience continued pricing pressure but believe the industrywide lower production will lead to higher prices beginning in the middle of fiscal year 2023. Also, during the first quarter of fiscal year 2023, Chilean lemons underperformed due to high transportation costs and low pricing, which will be reflected in our first quarter results. We expect avocado volumes for fiscal year 2023 to be in the range of 4 million pounds to 5 million pounds.\n\nIt's important to note that while fiscal year 2022 was a record year for avocado revenue, the California crop typically experiences alternating years of high and low production due to plant physiology. This, along with adverse weather conditions, is contributing to the year-over-year decline. We experienced unusual high temperatures in early September and a wind event in November that knocked fruit off our trees and will have a negative impact on our 2023 avocado crop. In addition, we now expect to receive $115 million compared to the previous estimate of $95 million from Harvest at Limoneira.\n\nAnd the addition of the Harvest Medical Pavilion spread out over seven fiscal years, with proceeds of $8 million received in the fourth quarter of fiscal year 2022. You will notice a portion of the cash flow projections have been pushed out approximately 18 months due to the higher interest rate environment, which reduced the current number of new home starts as phase 2 of the Harvest at Limoneira is on hold. We believe the new breakdown will be as follows. Fiscal year 2022 generated $8 million of cash to Limoneira, fiscal year 2023 is expected to generate $5 million, fiscal year 2024 is expected to generate $8 million, fiscal year 2025 is expected to generate $17 million, fiscal year 2026 is expected to generate $25 million, fiscal year 2027 is expected to generate $30 million, and fiscal year 2028 is expected to generate $22 million.\n\nAnd lastly, as previously stated, we have identified $150 million of certain assets for sale. We have made great progress thus far executing against our plan with the sale of $30 million in the past three months and expect to have similar announcements in fiscal year 2023. And with that, I'd like to open up the call to your questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Ben Bienvenu with Stephens. Please proceed with your question.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nHey. Good evening, everybody.\n\nHarold Edwards -- President and Chief Executive Officer\n\nHey, Ben.\n\nMark Palamountain -- Chief Financial Officer\n\nHey, Ben.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nSo, I want to ask first about the cadence of the debt paydown. It's been substantial thus far already and kind of congruent with realization of proceeds from asset sales. I assume the same should be true as we move through this next year. But could you talk a little bit about how we should be thinking about kind of the quarterly cadence of debt paydown and then kind of where you hope to be as you exit 2023?\n\nHarold Edwards -- President and Chief Executive Officer\n\nYes, I think the cadence is exactly as you just referenced. I think we're ahead of our plan thus far with the modernization exercise and actually have been very pleased with the levels of appreciation on the assets we've identified for monetization. So, you know, I think to be conservative, we believe the cadence will continue through 2023. But we actually think in the first two quarters of the fiscal year will be the majority of the 2023 events.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK, great. My second question is related to avocados and, in particular, the volumes, recognizing that there's, you know, alternating bearing plant physiology. We've seen numbers bounce around quite a bit. What do you think about kind of on a -- should we see kind of, you know, the average between 2022 and 2023 as a normal amount to model? Or how should we be thinking about what the trajectory of those volumes do kind of over a multiyear basis just from your own production standpoint?\n\nHarold Edwards -- President and Chief Executive Officer\n\nSo, I think the internal goal is 10,000 pounds per acre, taking into sort of consideration the maturation of younger trees and sort of the production of some of our older trees. And so, as we are at about 900 acres of planted volume, I think 8 million to 9 million pounds should probably be a safe average as we move forward. And then, as we've stated before, we have plans to actually convert some of the older lemon production land into avocado production land of about 250 acres in the next three years. So, you'll actually see our avocado production begin to increase.\n\nBut as you know, it takes time for some of those trees to actually become full bearing. So, we'll continue to update as we go. But I think an 8 million to 9 million pound average between years is probably a safe assumption.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. And then, last one, quickly for me is you have pretty good line of sight, it seems, to asset sales. I know the step-one priority is deleveraging the balance sheet. But what is your line of sight to asset purchases or asset investments?\n\nHarold Edwards -- President and Chief Executive Officer\n\nAt this point, we are set up to have our next round of strategic planning and roadmap update with our board at the end of February, the first part of March. The one thing we do know is that we'll need to increase storage capacity in Santa Paula due to our sale of our Oxnard lemon facility. As you may recall, we actually leased back for three years lemon washing and storage capability that keeps us operational. But within the next three years, we'll need to deploy capital to expand our wash capabilities, which will drive greater efficiency in our operation here in Santa Paula.\n\nWe've mentioned that we're also exploring increasing packing capacity in Chile as a next step. And we continue to explore integrating forward into the avocado space, but with no clear path other than that just directionally, as a placeholder, we're exploring that right now. And I think that's really what we'll be looking at. But I think once we delever significantly the balance sheet, the game plan will just continue to, you know, keep our foot on the gas with expansion of our -- the increase of our grower partner business and our agency business, providing marketing and sales services for other suppliers.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK, great. Thanks so much.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThanks, Ben.\n\nOperator\n\nOur next question comes from the line of Eric Larson with Seaport Research Partners. Please proceed with your question.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nHi, everyone. How you doing?\n\nMark Palamountain -- Chief Financial Officer\n\nHi, Eric.\n\nHarold Edwards -- President and Chief Executive Officer\n\nHey, Eric. You staying warm up there?\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nNo, it is really, really cold here.\n\nHarold Edwards -- President and Chief Executive Officer\n\nYeah.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nIt's like minus 30, 40 windchill here today. Oh, my goodness. It's pretty bad. So, I'm staying --\n\nHarold Edwards -- President and Chief Executive Officer\n\nWe won't tell you what the temperature is here. Yeah. Good for you.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nThe lemon trees would freeze here. So --\n\nHarold Edwards -- President and Chief Executive Officer\n\nYeah.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nJust a couple real quick questions. Number one, Harold, could you give us a little bit more color on kind of the, you know, the fruit oversupply? Is it because of, you know, some of your Asian food service markets still haven't opened up as much like Japan and maybe Asia, China? Or is it just purely your demand has kind of gotten back to normal and there's just pure oversupply for production? Can you give us a little more flavor of how that is working out?\n\nHarold Edwards -- President and Chief Executive Officer\n\nAbsolutely. So, I think, unfortunately, it's the latter, Eric. I think demand is back to pre-pandemic normals or, you know, levels. You know, we have seen a little bit of pullback in food service demand, driven by inflationary pressures and cost of living increases, higher interest rates, higher gas prices, things like that.\n\nBut the real issue we're wrestling with is just overplanting and oversupply of lemons, not only here in California, Arizona, but also in the Southern Hemisphere in Argentina and Chile. Now, we're beginning to see acreage beginning to be rationalized. You're seeing acres get pulled out. Just here, locally, in Ventura County, we're seeing acreage being pulled out.\n\nAnd that, in combination with a smaller tree crop, Mother Nature-driven, I think you're going to see improvement in pricing probably beginning in the second and to the third quarters because of just less lemons in the marketplace. The sort of the -- the silver lining of higher logistics costs is -- reduced the levels of imports from the Southern Hemisphere shipment -- shippers into the U.S. market. So, I think that has actually bolstered pricing as well.\n\nBut as the returns have been less than growers had become accustomed to in prior years, it's accelerating people converting their acreage from lemons into other crops currently. And that'll lead to pricing improvement as we move forward as well.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK. So, kind of the next question, and it's a little bit of a follow-up on this, does this delay in any way kind of, you know, how you're going to plant your 1,000 acres of -- you know, your 1,000 acres of lemons? And I know that there's, you know, a three-year lead time before you plant? And they are really truly, you know, fruit-bearing trees. Does it change the dynamics of how you put some of your production -- or some of your land into production?\n\nHarold Edwards -- President and Chief Executive Officer\n\nSo. So, the thousand acres that we currently have are nonbearing, which will come mature over the next three to four years. So, those are already all in the ground. Some are specialty lemons, but that's in the north of about 1 million cartons.\n\nThe 250 acres that we've mentioned in the past, 200 to 250, most likely, we are looking at avocados right now. We've secured trees for about another hundred acres next year. And then, we'll continue to evaluate using land that was either old tired lemons or, you know, something that was suitable to be avocados all the time. And so, that's where we are with that today.\n\nAnd, you know, I think as you see, you know, our footprint is not really going to get a whole lot smaller. The increase in our capacity and our outside growers is where that growth is going to come for us.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK. And then, kind of the sort of the final question, so, you've already sold, you know, probably 30 million or so of sort of, you know, kind of nonstrategic land and assets. And you've got another 150 million to go. You know, even if you just -- I'm assuming that most of that property is not an interest-bearing -- or is not an income-generating or interest-bearing properties today.\n\nSo, just if you put that cash into, let's say, the money market, we actually can almost get 3% money markets these days, it's going to certainly improve your ROIC. Do you have any ROIC targets or goals that we could maybe start looking at? Or is it too early to kind of give us those types of metrics?\n\nMark Palamountain -- Chief Financial Officer\n\nThat's a great question, Eric. So, internally, you know, as we've struggled in the past with ROIC and how the metrics look, we've always -- you know, you can't consider embedded value increases as we've gone along the way. And some of our properties, being either new or redevelopment, have had struggles to meet that overall metric. As you go forward, and perfectly said, that our ROIC will be going up relative to that.\n\nAnd, you know, I think, you know, internally, you know, we're in that, I think, 1% to 2% range now and sort of getting 5% to 7%. And then, back above 7% or 8% is the goal. I think that takes probably two to three years. And depending on how the monetizations work, you know, our weighted average cost of capital traditionally had been about 6.5%, 7%.\n\nSo, you know, anything, you know, north of that is obviously our goal. And we're working hard to get there.\n\nHarold Edwards -- President and Chief Executive Officer\n\nAnd I think one other comment, Eric, that the thing that will accelerate the return on invested capital will be the actual realization of some of these monetization events that will unlock a lot of the capital appreciation that was embedded in the appreciation of the land and the water assets that we've invested into. So, that's going to really accelerate the return on invested capital sort of analysis. And then, when you layer on the asset-light growth of serving grower partners and serving other suppliers that doesn't require capital to grow, I think you'll see -- as the business continues to transition, you'll see a lot more growth in our return on invested capital.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nPerfect. Thank you.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Ben Klieve with Lake Street Capital Markets. Please proceed with your question.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nAll right. Thanks for taking my questions. First, I have a question on the -- on your growth plans in the context of the asset monetization strategy. For several quarters in a row, it has been a very common theme on these calls, and your answers to your plans have been, you know, very consistent.\n\nAnd I'm curious about how your thought process here has evolved over the last year in the context of the interest rate environment and the kind of volatility within the avocado space and, you know, all the other just macro challenges of the day. Your plans have been very consistent, and I'm wondering how you're factoring in these macro considerations as you think about the long-term growth options.\n\nHarold Edwards -- President and Chief Executive Officer\n\nYeah, that's a great question, Ben. And they have evolved and continue to evolve. But certainly, the shift toward an asset-lighter model, the monetization of specific assets, targeted assets, the retirement -- reduction and retirement of long-term debt, and the strengthening of balance sheet, it -- not only is consistent, but the timing is perfect, given the rising interest rate environment. So, that hasn't changed at all.\n\nWe're laser-beam focused on execution and executing these plans and delevering and paying off the company's debt. So, that remains the same. Now, as we look forward into other opportunities, we remain steadfast in our belief that the long-term future of avocado consumptions continues to grow. And so, we're continuing on our belief that expansion of our avocado production in this part of California, where we have more certainty of our supplies of -- long-term supplies of water availability, makes our transition into increasing our avocado production the right move.\n\nThe exploration of adding value to avocados beyond production into packaging, marketing, and selling, that continues to be an ongoing analysis. I would say that there are some excellent avocado handlers out there already. The dynamic of how California avocados put together with Mexican, Colombian, Peruvian, and Chilean supplies, that's changing is a very dynamic situation and is giving us more sort of pause to be very cautious as we consider moving forward into the avocado supply chains. And we continue to analyze that and look at that.\n\nThat's the area, I think, that's changed the most over the last, call it 24 months of analysis. But we'll continue to study it and move forward. But we will move forward with greater avocado production.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nOK. Very helpful. Very helpful. Thank you, Harold.\n\nAnother one for me. You mentioned water. I didn't hear much on the call today in your prepared remarks about your water assets. I believe your fallowing program in Arizona is now entering its second year out of two.\n\nWondering if you can, one, update us on the thought process around, you know, further fallowing initiatives. And two, on a bigger picture, you know, any updates on, you know, potential around water rights modernization on a bigger scale?\n\nMark Palamountain -- Chief Financial Officer\n\nYeah, absolutely. So, yeah, as we noted, we fallowed 400 acres in the summer and turned around that acreage from being $1 million loser to $1 million winner. So, $2 million swing in that. We noted in this late summer that the federal government-mandated specific amount of acre feet to come off the river between all states that are taking water, with Arizona having the primary piece of risk in that.\n\nAs you recall, we're Class 3 Colorado River water rights. And, you know, Arizona -- central Arizona project and Las Vegas are all below us toward Class 5. So, we'll continue to be opportunistic there. Our district did present a new fallowing program to the federal government to try to represent the whole and give concepts.\n\nAnd at this point, it's still being evaluated as to what the best roadmap is for that. So, I imagine, in 2023, and depending on, you know, how the winter goes, and we've already had a reasonable start in California, but the Colorado River is structurally broken due to the demand itself. So, we don't have any specific on the table, but we continue to believe that that asset is worth north of $100 million in the right situation, which we're 50% of.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nOK, very helpful. And, Mark, [Inaudible] at this time last year, the outlook was pretty good as well. So, let's hope the snow keeps coming.\n\nMark Palamountain -- Chief Financial Officer\n\nYup, you bet.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nOne more for me, and then I'll get back in line on -- you commented on challenges of shipping out of Chile. You know, no surprise there. Curious, though, if you can just kind of update us on if you've seen any, you know, observable improvement in the area of international shipping and to what degree you see, you know, the light at the end of the tunnel in terms of getting the export business back to some kind of normalized level.\n\nHarold Edwards -- President and Chief Executive Officer\n\nSo, just anecdotally, Ben, we're seeing far less congestion in the ports. We're seeing turnaround times in the ports of berthing back to sort of pre-pandemic levels. And as a lot of that congestion has worked itself through the system or out of the system around the world, we're beginning now to see decreases in containerized shipping costs. Not back to where they were pre-pandemic but certainly directionally moving in the right direction.\n\nSo, we think the combination of quicker turnaround times at the ports and decreasing containerized shipping costs bodes well for future imports into the U.S. and especially as it relates to our operations in both Argentina and in Chile.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nVery good. Thanks you both for taking my questions. Appreciate it. I'll get back in line.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThank you.\n\nMark Palamountain -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] There are no further questions in the queue. I'd like to hand the call back to Harold Edwards for closing remarks.\n\nHarold Edwards -- President and Chief Executive Officer\n\nThank you, all, for your questions and your interest in Limoneira. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Mills -- Head of Investor Relations\n\nHarold Edwards -- President and Chief Executive Officer\n\nMark Palamountain -- Chief Financial Officer\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nMore LMNR analysis\n\nAll earnings call transcripts"
}