{
  "companyName": "Eastman Kodak",
  "companyTicker": "KODK",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/eastman-kodak-kodk-q2-2022-earnings-call-transcrip/",
  "content": "Eastman Kodak (KODK)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Eastman Kodak Q2 2022 earnings conference call. [Operator instructions] Please be advised that today's conference call is being recorded. I would now like turn the conference over to your host, Mr. Paul Dils.\n\nPaul Dils -- Chief Tax Officer and Director of Investor Relations\n\nThank you, and good afternoon, everyone. I am Paul Dils, Eastman Kodak Company's chief tax officer and director of investor relations. Welcome to Kodak's second quarter 2022 earnings call. At 4:15 p.m.\n\nthis afternoon, Kodak filed its Form 10-Q and issued its release on financial results for the second quarter of 2022. You may access the presentation and webcast for today's call on our investor center at investor.kodak.com. During today's call, we will be making certain forward-looking statements as defined by the Private Securities Litigation Reform Act of 1995. All forward-looking statements are based upon Kodak's expectations and various assumptions.\n\nFuture events or results may differ from those anticipated or expressed in the forward-looking statements. Important factors that could cause actual events or results to differ materially from these forward-looking statements include, among others, the risks, uncertainties and other factors described in more detail in Kodak's filings with the U.S. Securities and Exchange Commission from time to time. There may be other factors that may cause Kodak's actual results to differ materially from the forward-looking statements.\n\nAll forward-looking statements attributable to Kodak or persons acting on its behalf apply only as of the date of this presentation, and are expressly qualified in their entirety by the cautionary statements included or referenced in this presentation. Kodak undertakes no obligation to update or revise forward-looking statements to reflect events or circumstances that arise after the date made or to reflect the occurrence of unanticipated events. In addition, the release just issued and the presentation provided contains certain measures that are deemed non-GAAP measures. Reconciliations to the most directly comparable GAAP measures have been provided with the release and within the presentation on our website in our investor center at investor.kodak.com.\n\nSpeakers on today's call are Jim Continenza, Kodak's chief executive officer and chairman; and David Bullwinkle, chief financial officer of Kodak. We will not be holding a formal Q&A during today's call. As always, the Investor Relations team is available for follow-up. I will now turn the call over to Jim.\n\nJim Continenza -- Chief Executive Officer and Chairman\n\nWelcome, everyone, and thank you for joining the second quarter investor call for Kodak. Turning to Slide 5. Revenue in the second quarter increased $30 million or 10% compared to the prior-year quarter, which demonstrates our commitment to One Kodak, customer first, customer support and satisfaction, and our firm control of our products. Pricing and supply chain continued to be challenging in this economic environment.\n\nWhen excluding the impact of foreign exchange, revenue increased $49 million or 17% compared to the prior-year quarter. Despite the current economic challenges, our gross profit percentage increased from 11% in the first quarter of this year to 16% in the second quarter, which reflects the execution of our strategy and the controls we initiated to mitigate the challenging economic environment. On June 15th, we exercised our right to draw down an additional $50 million term loan pursuant to the term loan credit agreement established last year with Kennedy Lewis Investment Partners. Dave will provide more specific details shortly.\n\nHowever, the net proceeds received will be used to fund ongoing investments. We continue to navigate through the ongoing global impact associated with COVID-19 pandemic, the war in Ukraine, and other global events. Like many other companies, Kodak is experiencing supply chain disruptions, shortages of materials and labor, and increased cost of labor, materials, and distribution. We have implemented numerous measures to mitigate these challenges, including increasing safety stock and implementing pricing actions.\n\nOur long-term strategy continues to focus on our core competencies in print, advanced materials, and chemicals, provide environmentally sustainable solutions, turning the business to focus on innovation, growth, and profitability. Turning to Slide 6. We continue to invest in innovation and bring new products to market in the second quarter by leveraging our expertise in the print industry. Kodak took another step forward in our plan to establish Kodak has a digital powerhouse in the print industry with the introduction of the world's fastest inkjet press.\n\nThe Kodak Prosper 7000 Turbo Press brought to market in less than 12 months from conception to commercialization. We launched the Kodak Ascend Digital Press, which is aimed at the growing retail point of purchase and small packaging market. The Kodak Ascend Digital Press is the first electrophotographic press, offering greater production speed, and sheet length and offers an environmentally friendly and cost-effective print solution. We're excited to announce that Kodak and Uteco jointly placed the first Uteco Sapphire EVO Wide Press, powered by Kodak's Ultrastream inkjet technology.\n\nThis system is designed specifically to meet the customers' needs of the Flexible Packaging segment, allowing for a faster turnaround and variable print capabilities. We have also officially launched the Kodak Prosper Ultra 520 Digital Press, which is powered by groundbreaking Kodak's Ultrastream inkjet technology. This digital web press provides image quality that rivals offset at speeds faster than competitive solutions, using sustainable water-based Kodak inks. By utilizing Ultrastream technology to Prosper 520 Digital Press offers our customers the ability to mitigate supply chain risk of aluminum plates.\n\nAs discussed in our prior calls, we are working on new initiatives within our AMC group to leverage our deep expertise in chemistry and strength in layering and coating on multiple substrates that comes from over a century of expertise in film manufacturing. In July, Kodak announced that it has taken a minority stake in Wildcat Discovery Technologies, Inc. Wildcat is a private technology company that used its proprietary methods to research, and develop new battery materials and is developing a breakthrough EV super cell designed to provide a greater than 90% improvement in energy density over today's best batteries. Kodak will provide coating and engineering services in collaboration with Wildcat to develop and scale, build coating technologies, which are critical for the safety and reliability of the next generation of EV and energy storage battery technology.\n\nThe strategy we put in place three years ago continues to drive positive results and support of our plan to turn around one of the world's most iconic companies. I will now turn it over to Dave to discuss second quarter 2022 financial results.\n\nDavid Bullwinkle -- Chief Financial Officer\n\nThanks, Jim, and good afternoon. Today, the company filed its Form 10-Q for the quarter ended June 30th, 2022, with the Securities and Exchange Commission. As always, I recommend you read this filing in its entirety. Before I get into the details for the quarter, I would like to comment on a financing transaction that occurred in the second quarter of 2022.\n\nAs previously reported, last year, we completed a series of financial transactions that provide access to new capital, address maturing obligations, and strengthen the company's ability to invest in strategic growth opportunities in our core businesses. A portion of this financing transaction included a commitment with Kennedy Lewis Investment Management to provide delayed draw term loans of an additional $50 million, which may be drawn on or before February 26th, 2023. The delayed draw term loans were drawn down in full on June 15th, 2022. Net proceeds received were $49 million, which represents $50 million of aggregate principal less $1 million in debt transaction costs.\n\nThe term loans bear interest at a rate of 8.5% per annum payable quarterly in cash and 4% paid-in-kind interest. The maturity date of the term loan is February 26th, 2026. In July, Kodak invested a portion of these proceeds received from the delayed draw term loans to acquire a minority stake in Wildcat Discovery Technologies, as mentioned earlier by Jim. I will now share further details on the full company results, operational EBITDA, and cash flow for the second quarter and first half of 2022.\n\nOn Slide 7. For the second quarter of 2022, we reported revenues of $321 million, compared to $291 million in the prior-year quarter for an improvement of $30 million, an increase of 10%. Adjusting for the unfavorable impact of foreign exchange of $19 million in the current year quarter, revenue increased by $49 million or 17% compared to the prior-year quarter. On a U.S.\n\nGAAP basis, we reported net income of $20 million for the second quarter, compared to net income of $16 million in the prior-year quarter. The 2022 and 2021 second quarter results include income of $4 million and $1 million, respectively, related to changes in the fair value of embedded derivative liabilities and income of $4 million and $3 million, respectively, related to noncash changes in workers' compensation reserves. The second quarter of 2021 results also include income of $6 million related to legal settlements. Excluding these current and prior quarter items, income for 2022 was $12 million, compared to income of $6 million in the prior-year quarter, reflecting an improvement of $6 million.\n\nOperational EBITDA for the quarter was a positive $11 million, compared to a positive $10 million in the prior-year quarter. Excluding the impact of noncash changes in workers' compensation reserves in the current and prior-year quarters, and foreign exchange in the current year quarter, operational EBITDA improved by $3 million when compared to the prior-year quarter. Operational EBITDA for the second quarter was favorably impacted by the growth in revenue due to improved pricing and overall volume growth, partially offset by higher continued ongoing global cost increases. During the second quarter, volumes for Sonora Process Free Plates improved by 8% and the annuity revenue for Prosper declined by 3%, which was attributable to the impact of foreign exchange.\n\nOn a constant currency basis, annuity revenue for Prosper improved by 5%. Jim shared multiple product innovations and introductions with you earlier, demonstrating our commitment to investing in future growth areas of Ultrastream and advanced materials and chemicals. Turning to Slide 8. For the first half of 2022, we reported revenues of $611 million, compared to $556 million in the prior-year period for an improvement of $55 million.\n\nAdjusting for the unfavorable impact of foreign exchange of $29 million in the current year, revenue increased by $84 million compared to the prior year. We reported net income of $17 million for the first half, compared to net income of $22 million in the prior year. The 2022 first half results include income of $1 million related to changes in the fair value of embedded derivative liabilities and income of $8 million related to the noncash changes in workers' compensation reserves. The 2021 first half results include income of $7 million related to legal settlements and income of $3 million related to noncash changes in workers' compensation reserves.\n\nExcluding these current and prior-year items, income for 2022 was $8 million, compared to income of $12 million in the prior-year period, reflecting a decline of $4 million from the prior-year period. Operational EBITDA for the period was a positive $4 million, compared to a positive $13 million in the prior-year period. Excluding the unfavorable impact of foreign exchange in the current year, and noncash changes in workers' compensation reserves in the current and prior years, operational EBITDA decreased by $10 million. Operational EBITDA for 2022 was favorably impacted by growth in revenue due to improved pricing and overall volume growth, offset by higher continued ongoing global cost increases in a difficult economic environment.\n\nOn a year-to-date basis, volumes for Sonora Process Free Plates improved by 15% and annuity revenue for Prosper declined by 1%, which was attributable to the impact of foreign exchange. On a constant currency basis, annuity revenue for Prosper improved by 5%. We continued to invest in future growth areas of Ultrastream and advanced materials. Turning to Slide 9.\n\nWe are providing information to illustrate the improvements we have made in response to the challenges in the current economic environment. This slide compares the first quarter of 2022 to the second quarter of 2022. When comparing those quarters, revenue increased by $31 million or 11%. We reported net income of $20 million for the current quarter, compared to net loss of $3 million in the preceding quarter.\n\nThe second and first quarter of 2022 results include income of $4 million and expense of $3 million, respectively, related to changes in the fair value of embedded derivative liabilities and income of $4 million in both quarter-to-date periods related to noncash changes in workers' compensation reserves. Excluding these current and prior quarter items, income for the second quarter was $12 million, compared to a loss of $4 million in the prior quarter, reflecting an improvement of $16 million quarter sequentially. Operational EBITDA for the quarter was a positive $11 million, compared to a negative $7 million in the preceding quarter. Excluding the impact of noncash changes in workers' compensation reserves in the current and prior quarters, operational EBITDA improved by $18 million.\n\nOperational EBITDA was favorably impacted by growth in revenue due to improved pricing and increase in gross profit. Gross profit improved from $33 million or 11% of sales for the first quarter of 2022 to $51 million or 16% of sales for the second quarter of 2022. The improvements shown are significant given the challenges in the current economic environment. The company will remain focused on profitable growth.\n\nMoving on to the company cash performance presented on Slide 10. The company ended the second quarter with $289 million in cash and cash equivalents, a decrease of $73 million from December 31st, 2021. For the six months ending June 30th, 2022, cash used in operating activities was $103 million, driven primarily a cash use from net earnings of $26 million and a cash used from balance sheet changes of $77 million, including a change in working capital of $63 million and a decrease in other liabilities of $17 million. Accounts payable increased by $17 million, inventory increased by $54 million, and accounts receivable increased by $26 million.\n\nWe used cash and working capital in order to strengthen our ability to supply our customers on an ongoing basis. We have increased safety stock on certain materials, increased lead times, provided suppliers with longer forecasts of future demand, and certified additional sources or substitute materials. Cash used in investing activities was $9 million in the first half, an increase of $4 million when compared to the prior-year period. Cash provided by financing activities was $47 million in the first half of 2022 compared to cash provided by financing activities of $241 million in the prior-year period.\n\nCash provided by financing activities in the current year includes $49 million of incremental cash in the first half after fees and expenses driven by proceeds received related to the delayed draw term loans I discussed earlier. Cash provided by financing activities in the prior year included $247 million of incremental cash in the first half after fees and expenses driven by the financial transactions announced on March 1st, 2021. Restricted cash at the end of the quarter was $54 million, an increase of $3 million from December 31st, 2021. Restricted cash primarily represents cash collateral required under the new letter of credit facility in addition to escrows to secure various ongoing obligations.\n\nWe will continue to focus on alternatives to reduce restrictions on cash, and we view this as an upside opportunity for incremental liquidity for the company. As presented on the bottom portion of the slide, excluding the current and prior-year impact of net proceeds from refinancing transactions and the effect of exchange rates on cash in addition to the prior-year funding of the letter of credit facility, the year-over-year decrease in cash and cash equivalents was $85 million, primarily driven by a use of cash from working capital in order to strengthen the company's ability to serve our customers. Finally, we remain in compliance with all applicable financial covenants. I will now turn the discussion back to Jim.\n\nJim Continenza -- Chief Executive Officer and Chairman\n\nThank you, Dave. In summary, Kodak delivered revenue and gross profit growth year over year for the second quarter of 2022. We also saw a significant improvement in gross profit margin from Q1 to Q2 of 2022, despite ongoing inflationary and supply chain challenges. Kodak has invested heavily over the last three years in print, advanced materials, and chemicals, and we're showing you the outcome of those investments.\n\nWe've launched four groundbreaking products. The Kodak Prosper 7000 Turbo Press, the Ascend Digital Press, and two products powered by our next-generation Ultrastream inkjet technology, the Kodak Prosper Ultra 520 Press and the first flexible packaging printing system, the Uteco Sapphire EVO Wide Press. Our planned investment in digital are designed to help our customers grow. We only win if our customers win.\n\nThese products you see today are here to help keep them in business, mitigate risk, lower cost, and grow their business. We continue to make significant investments in recently announced growth initiatives in AMC, expanding our pilot coating facility and taking a minority stake in Wildcat. We look forward to continue to focus on driving profitable revenue by concentrating on our core business and helping our customers build theirs. Thank you all for attending the call and for your continued interest in Eastman Kodak.\n\nHave a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaul Dils -- Chief Tax Officer and Director of Investor Relations\n\nJim Continenza -- Chief Executive Officer and Chairman\n\nDavid Bullwinkle -- Chief Financial Officer\n\nMore KODK analysis\n\nAll earnings call transcripts"
}