{
  "companyName": "Sasol",
  "companyTicker": "SSL",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/29/sasol-ssl-q4-2022-earnings-call-transcript/",
  "content": "Sasol (SSL -0.44%)\nQ4 2022 Earnings Call\nAug 23, 2022, 3:00 a.m. ET\n\nTiffany Sydow\n\nGood morning, and welcome to the presentation of Sasol Limited's annual results for financial year 2022. Thank you for joining us today. Our speakers today are Fleetwood Grobler, president and CEO of Sasol, and Hanre Rossouw, Sasol's chief financial officer. In today's presentation, Fleetwood will cover the business performance for the final year, which also includes an update of our ESG progress and milestones.\n\nThe financial performance will be covered in more detail by Hanre, with Fleetwood concluding with a brief update on our future Sasol aspiration. You will then have an opportunity to ask your questions in our Q&A session, which commences immediately afterwards. Before we begin, I'd like to refer you to our disclaimer, which is summarized on the slide. This contains important information regarding forward-looking statements that are made in this presentation.\n\nPlease have a look at it in your own time.\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nGood day, everyone, and welcome to our 2022 financial results update. In the last two years, we have faced multiple challenges both in South Africa and abroad. The outbreak of COVID significantly impacted the global economy, and the world is still adjusting to major supply chain disruptions. The war in Ukraine, now entering its six months, has caused enormous upheaval in global energy markets along with a devastating toll on human life.\n\nInflation is soaring across the globe, and recessionary concerns are rising. In South Africa, the civil unrest of July 21 and more recently, the torrential rainstorms in April this year largely concentrated in KwaZulu-Natal affected our ability to export products and disrupted our operations. Notwithstanding this backdrop, we remain focused on meeting our short-term targets while recording progress on future Sasol aspirations. In this period, we were successful to significantly strengthen our balance sheet through well-executed response measures without the need for a rights issue.\n\nWe completed our strategy-led accelerated asset divestment program. And today, I am pleased to announce the reinstatement of our dividends to our shareholders. As in the past years, Team Sasol stepped up and delivered in a challenging operating environment, and I express my sincere appreciation for our people's continued diligence, commitment, and support. I also want to thank the Board of Sasol for its continued guidance and support as we take significant strides to a more competitive and sustainable future Sasol.\n\nIn recent years, we framed our strategy to the triple bottom line focus of people, planet and profit. Sound ESG performance is fundamental to our business and integral to the delivery of future Sasol goals. Within this framework, I will start my presentation by providing a high-level review of financial year '22. Maintaining safe operations is our primary focus, particularly considering the tragic loss of five colleagues in the first half of this year.\n\nWe will never rest in our pursuit of zero harm. We strive to eliminate work-related safety incidents to ensure our employees return home safely each day. Furthermore, our intent to be a force for social good is unequivocal and demonstrated in the many ways we positively impact the economies and support our communities in the regions where we operate. As our industry is transitioning toward greener solutions, the just transition toward that aspiration is foremost in our thinking.\n\nOn planet, our ambition to grow shared value while accelerating our transition was affirmed through our future Sasol strategy. We defined concrete plan to accelerate the decarbonization of our business against two milestone dates, 2030 and 2050. As a reminder, we stepped up our 2030 greenhouse gas emission reduction target to 30% from a 2017 baseline and announced our ambition to be at net zero emissions by 2050. We are making significant headway on our 2030 GHG reduction pathway as Sasol executes the first tranche of more than 600 megawatts of renewable energy in the next two to three years.\n\nThis equates to a significant portion of our energy needs in Secunda and is on an unmatched scale in South Africa. On the last element, profit, we achieved a step change improvement in our profitability this year. While some of this improvement was supported by higher prices, it is also underpinned by a robust cost and capital expenditure performance. These benefits were, however, partly offset by operational challenges in our integrated South African value chains that led to lower production.\n\nI'm pleased to report that we have already improved our Synfuels plant output and coal stockpile situation. I will now unpack our financial year '22 performance further. The well-being of our people and maintaining safe operations is our No. 1 priority in pursuit of our zero-harm ambition.\n\nLet me again express our heartfelt condolences to the families and friends of the colleagues we lost, Themba Masilela, Moses Hlongoane, Takalani Masha, Gansen Naidoo and Lebogang Lebepe. Any loss of life is unacceptable. Our grave concern for the deterioration in our safety performance was a source of a significant introspection that further intensified our focus on safety intervention. These efforts saw an improvement in our performance in the second half of the year while we continue to strengthen our safe operation capabilities and practices.\n\nAs a result, lost workday cases continue its downward trajectory while our recordable case rate stood at 0.27, marginally above last year's rate. We are also addressing a number of actions with a particular focus on operational discipline, training, leadership and culture to deepen understanding of risks. I and my executive team are personally committed to leave no stone unturned as we pursue our zero-harm objective. Another important safety metric we measure among many other things is the occurrence of fire, explosion and release incidents.\n\nThis year, we had 13 incidents with a decreasing trend with great ongoing effort to entrench process safety fundamentals. On balance, we are making good progress, but we can never be complacent, and we all recognize the need for relentless commitments on focus and safety. Our intent to be a force for social good is integral to our business strategy while our purpose, innovating for a better world, inspires our journey to realize measurable socioeconomic benefits for communities in our operating regions. Among a few key examples, we contributed over ZAR 58 billion in taxes and royalties, up 19% from the previous year.\n\nWith South Africa being our largest tax jurisdiction, we remain one of the top corporate taxpayers in the country. Our total measured procurement spend was ZAR 55.8 billion, of which ZAR 33.6 billion was spent on majority black-owned businesses in South Africa. This is up 40% from last year, demonstrating our ongoing commitment to sustainable transformation and black-based economic empowerment. Our ZAR 1.2 billion investment in skills and development makes us one of the largest investors in South Africa.\n\nWe continue to fund approximately 600 undergraduate and post-graduate bursaries in financial year '22 alone. In the U.S., we support several universities and elementary science, technology, engineering and mathematics, or STEM education, as workforce development pipelines are critical to our sustainability and diversity goals. Sasol remains a significant investor in our communities, and I'm very proud of the leading role we continue to play in driving positive socioeconomic change. Looking at the state of our wage negotiations.\n\nWe have successfully concluded 2-year wage settlement agreements with our trade union partners both in the petroleum and industrial chemicals sectors. Providing certainty to wage increases is very important to our people and assist with the creation of a more harmonious working environment. Wage negotiations in both mining and Mozambique are ongoing. We remain committed to continue working with our trade union partners in pursuit of amicable agreements.\n\nThe plans for meeting our 30% greenhouse gas reduction target by 2030 are progressing well, which will be the real foundation to meeting our 2050 net zero ambition. Significant progress has been made in procuring renewable energy for both our Energy and Chemicals businesses. In South Africa, we have agreed the key terms with independent power producers to secure over 600 megawatt of solar and wind power to start coming online before 2025. We are aiming to eventually procure 1,200 megawatt of renewable energy capacity by 2030.\n\nThis represents one of the largest renewable energy procurement programs from the private sector in South Africa and will be a strong contributor toward South Africa's ambition to implement significant quantities of renewable energy. In Europe, we entered into several power purchase agreements for our German and Italian operations. This, together with the supply of CO2-neutral biomass-based steam to Brunsbüttel is expected to reduce CO2 equivalent emissions by up to 70 kilotons per annum. On gas supply, we have made significant progress based on our recent infill well drilling activity where initial results indicate that we can optimize our supply profile from existing Mozambican assets to extend our plateau production until 2028.\n\nThe production sharing agreement, or PSA project, is progressing well and remains within budget. We are also partnering to pursue adjacent exploration acreage to access more gas. This is a huge step forward and ensures that we have flexibility in our gas supply profile as we progress our 30% reduction pathway. We are advancing our negotiation on a term sheet for 40 to 60 petajoules of LNG from 2026 onwards.\n\nThis strategy provides flexibility of our gas supply profile. Looking at other low carbon enablers, we remain committed to play a leading role in the green hydrogen economy in South Africa. In Sasolburg, the final investment decision for a green hydrogen project was taken swiftly with the aim of producing the first green hydrogen volumes toward end 2023. I'm also pleased to report that we are assessing creative options for repurposing the Natref refinery.\n\nHere, we have completed a pre-feasibility study on a green hybrid refinery concept. This includes the introduction of bio-based feedstock as a sustainable pathway to transition the refinery to meet the country's steam fuels compliance standards and reduce greenhouse gas emissions. Together with our partner, TotalEnergies, we have developed and are implementing now a low-cost innovative solution that will produce clean fuels to compliant diesel toward the end of 2023. This is very positive step for us and also toward energy security for South Africa.\n\nFor our South African value chain, one of the key enablers to achieve our 2030 target is the eventual turndown of coal-fired boilers, which requires a fine coal solution for Sasol. We have recently confirmed the feasibility of a fine coal solution, which enables our integrated greenhouse gas and air quality improvements in our Secunda operations. The phased shutdown of our boilers cannot be done without the solution for the fine coal feedstock, which we use today to produce steam and electricity required in our operations. Sasol Chemicals in a bit to procure more circular and sustainable products and to produce that had its first sales of sustainability-certified products from lower carbon intensity renewable feedstocks from our mall site in Germany.\n\nIn addition, we have achieved ISCC+ certification at three largest of our European sites, namely Marl, Brunsbüttel and Augusta, to commence the use of bio-based and circular feedstocks. We continue to make progress on our just transition approach, which includes leveraging existing initiatives and a collaborative approach with partners. Overall, I'm pleased with the progress made, and we continue to accelerate activity toward our 2030 target in a value-enhancing way. Looking at our environmental performance in financial year '22.\n\nOur greenhouse gas emissions reduced by approximately 7% compared to the 2017 baseline. This significant reduction is to a large extent due to lower production rates from our Secunda and Sasolburg operations. Taking into account the lower production in this year, GHG emissions would be nearly 4% lower from our '17 baseline, showing some progress being made on our mitigation initiatives. Note that our 2017 baseline has been restated to account for the divestments and is in line with the World Business Council and Sustainable Development GHG protocol.\n\nThe impact of divestments is not included as part of our 30% reduction commitment. Although GHG emissions will increase with higher production volumes in financial year '23, we expect continued improvement from existing reduction levels. However, the larger greenhouse gas reduction will only be realized after 2025 with the implementation of renewable energy, transition gas, and phased boiler shutdowns. Notwithstanding, implementing our reduction levers are not without risk.\n\nWe understand these risks well. Our teams are working diligently to mitigate the potential impacts, which include from key transmission infrastructure, potential short-term supply chain constraints for renewable energy and gas affordability. Turning now to our operating environment. In the past year, we were faced with multiple challenges in the external operating environment.\n\nBut true to the Sasol way, we manage these impacts with greater levels of flexibility and collaboration across Sasol, testing the effectiveness of our new operating model introduced last year. In response, we continued delivery of our Sasol 2.0 transformation program to combat the effects of higher inflation and cost pressures. Following the heavy rainstorms in KwaZulu-Natal province this year, we shifted chemical products from rail to road transport, where possible and looked at alternative loading areas. In Europe, we are evaluating the use of alternative energy sources to mitigate some of the supply impacts caused by the war in Ukraine.\n\nWe are also working continuously to maintain supply chain channels and alternatives to Rhine River traffic, which is severely disrupted by the lower river levels this summer season. We continue to engage with all stakeholders in response to regulatory policy changes, most importantly, the recent proposed amendments to the carbon tax regime in South Africa, which could significantly impact our business. Through these challenging times, we extended comprehensive support to our employees and communities to help employees manage various challenges owing to pandemics, natural disasters, wars and other humanitarian crisis. I will now touch on a few salient points regarding improvements we continue to record in business profitability.\n\nThe Energy business benefited from a recovery in fuels demand post the COVID-19 demand impact. This was offset by lower production volumes in Secunda and Sasolburg operations following the feedstock and operational challenges, which impacted our South African value chain. Our mining operations experienced setbacks in the first half of the financial year, and our productivity and output are lower compared to last year. However, we saw improvement in the productivity in the second half and the coal stockpile restored to above the levels indicated at half year-end.\n\nIn Mozambique, we delivered a strong performance, exceeding our productivity plan and market guidance on gas volumes. Despite the challenges associated with the pandemic, the infill well drilling campaign is progressing safely within cost and schedule. The Chemicals business delivered a 21% increase in revenue this year benefiting from a stronger average sales basket price. Overall volumes were 12% lower than the prior year, largely due to the divestment of the 50% of the U.S.-based chemicals assets concluded in December 2020 and lower South African production.\n\nSales volumes for our Specialty Chemical business divisions were higher as the U.S. operational ramp-up continues. Still in the U.S., we also completed a successful shutdown of the east cracker in the first half. I'm also proud to announce that we have completed the remaining divestments we targeted namely the Canada shale gas asset, ROMPCO shareholding dilution to 20%, CTRG, and our European Wax business.\n\nIn mining, in line with our zero-harm ambition, we are making good progress in implementing our safety remediation program to address the findings from our previous high severity incidents. We are working to restore productivity and maintain healthy stockpile levels. This includes reaching targeted productivity levels across all mines through focused performance initiatives. Furthermore, we are executing coal quality improvement opportunities to support optimal Secunda production, including blending, improved mine section deployment, and reduced variability through integrated decision models.\n\nCoal quality generally deteriorates over the life span of a mine as operations move away from the higher quality reserves, and this is no different in our case. Mine planning must adapt to cater for deterioration in quality to optimize the reserves. We are addressing our coal quality improvement through a combination of short- and longer-term strategies. These strategies may include the procurement of higher-quality coal as a viable lever to balance the total quality considering the integrated margin of our Secunda product slate.\n\nAcross our South African fuel and chemical operations, we are focused on improving the effectiveness of our shutdowns and pursuing technical options to improve reliability of our key equipment. Looking at our international operations. The ramp-up of our Lake Charles specialty units is continuing as planned. The team is working closely with our JV partner in the Louisiana Integrated PolyEthylene JV to ensure stable operations.\n\nWe have also appointed a task team to respond to potential gas supply constraints in Europe, which could impact all producers in the region. This includes evaluating alternative feedstocks where technically feasible. Despite a challenging operational year, we saw a significant improvement in financial performance. I will touch on just a few financial metrics before I will hand over to Hanre, who will share more details.\n\nOur EBITDA increased by 48% to around ZAR 72 billion. The balance sheet was strengthened, ending with a net debt of USD 3.8 billion at year-end, well below the target of USD 5 billion. Core headline earnings per share increased by more than 100% to approximately ZAR 69 per share supporting the resumption of dividends to our shareholders. This is a huge step forward for Sasol, and we thank our shareholders for their patience and support over the past few years.\n\nWhile some of the improvement is supported by higher prices, it also demonstrates our resilience and agility to continuously adapt to a dynamic business landscape. Our efforts under Sasol's crisis response and Sasol 2.0 programs have benefited us hugely in this time. On that note, I will now hand over to Hanre to take us through the detailed financial results for the reporting period.\n\nHanre Rossouw -- Chief Financial Officer\n\nThank you, Fleetwood, and good morning, ladies and gentlemen. It's a privilege for me today to present Sasol's financial performance for the 2022 financial year. Having joined Sasol only in April, I'm briefly tempted to take credit for all the highlights of the results. I'd rather though give thanks to the Sasol team for welcoming me onboard and also give credit to all the dedication and individual sacrifice made across Sasol over the last years to navigate the company through some very difficult waters.\n\nLet me start the results overview by providing some detail around the macro environment, which was critical to the financial outcomes for the period. Perhaps the overriding takeaway is the level of volatility in the external environment affecting our business with highly significant moves in many of the key benchmark prices. We continue to enjoy the benefit of significant increases in the oil and other energy and chemicals prices. We saw Brent crude increasing by 70% to average $92 per barrel and polyethylene, up 38%.\n\nThe rand remained relatively flat for financial year '22, but the closing rate was 14% higher, which negatively impacted the translation of our U.S. dollar-denominated debt. Feedstock prices were impacted with ethane prices up by 86% following the increase in natural gas prices. We expect to see ongoing concerns in the near term around the future security of natural gas supply.\n\nLooking forward, we expect tight global energy and chemicals markets with increased volatility and uncertainty from ongoing geopolitical events and the potential macroeconomic fallout from rising inflation and supply chain disruptions. Locally, the South African economy is faced with multiple challenges including high structural unemployment and fiscal constraints, which need to be factored into business planning. These challenges require continued agility and responsiveness in our business. We remain committed to deliver a competitive Sasol through our continued cost and capital allocation discipline and the Sasol 2.0 program.\n\nTurning to the financial results. We have seen a significant improvement in the profitability of our group compared to the previous financial year. We benefited from the strong recovery in prices, which I covered in the previous slide, as well as robust cost performance. These benefits were partly offset by a combination of operational challenges in our integrated South African value chain and supply chain disruptions, which Fleetwood spoke to earlier.\n\nEarnings before interest and tax for the prior year was impacted by noncash adjustments, both notably in the Chemicals Americas segment, which included the ethylene derivative impairment reversal and gain on disposal of our U.S.-based Chemicals business as well as in the fuel segment, which included the impairment relating to the Synfuels refinery CGU. Noncash adjustments for this financial year includes unrealized translation and hedging losses of ZAR 5.2 billion and a net gain of ZAR 9.9 billion on remeasurement items, mainly from our asset divestments. On an adjusted EBITDA basis, our profits of approximately ZAR 72 billion was an increase of 48% compared to the prior year with the benefits of our diversified energy and chemicals portfolio evident in the profitability mix. Core headline earnings of ZAR 68.54 per share increased by more than 100% compared to the prior period, supporting the reintroduction of dividends to our shareholders with a final dividend of ZAR 14.70 per share.\n\nThis represents a cash return of over ZAR 9 billion to our shareholders. Return on invested capital normalized for aspects such as profit on sale and hedging losses increased to just short of 22%. We remain committed to deliver superior returns well above WACC, ensuring a profitable and sustainable business in the future. The management of risk remains key, and our stronger balance sheet will allow us to significantly reduce the need for hedging going forward.\n\nLet me now turn to the segmental highlights, starting with the Energy business. Our mining segment benefited from higher export prices, resulting in a 3% increase in adjusted EBITDA compared to the prior year. This was partly negated by a combination of lower volumes following the operational and safety challenges, as already mentioned, as well as higher external coal purchases. Our gas segment made good progress with the Mozambique drilling campaign.\n\nAdjusted EBITDA was up by 2% compared to the prior year supported by higher gas prices as well as higher production volumes. Our fuel segment delivered a strong performance, with adjusted EBITDA increasing by more than 100% compared to the prior year. We benefited from higher crude oil prices, refining margins and higher sales volumes on the back of improved demand. Turning to our Chemicals business.\n\nOur Africa segment was impacted by a combination of production challenges at our SA sites in the first half of the financial year as well as supply chain disruptions, which affected the export of products in the second half. However, the average sales basket price for the financial year was 29% higher due to a combination of improved demand, higher oil prices and tighter global supply conditions. This resulted in a 44% increase in adjusted EBITDA. We have seen a strong ramp-up of our specialty chemicals in our Chemicals Americas segment as more products are being certified for use by our customers.\n\nAdjusted EBITDA increased by 72%, benefiting from the 58% increase in the average sales basket price. This was offset by lower sales volumes, following the base chemicals divestments and the unplanned west cracker downtime in the last quarter of the financial year. As I've mentioned, ongoing geopolitical tensions, inflationary pressures and increased recessionary risks will continue to impact our business and the priority is to effectively manage the elements that are under our control. In terms of guidance for the 2023 financial year, we expect generally stronger performance in our Energy and Chemicals businesses.\n\nWe anticipate productivity at our mining business to improve compared to financial year '22 as we focus on operational discipline and continue to prioritize the safety of our workforce. In our gas segment, we expect higher production volumes as we start seeing the benefits of the exploration and infill well drilling campaign. Our South African liquid fuel sales volumes will increase to a range between 53 million and 56 million barrels on the back of improved operational performance and higher fuels demand. With the anticipated improvement in mining productivity and operational stability, Secunda operations will produce higher volumes of between 70, apologies, seven million to 7.2 million tonnes.\n\nThis includes the impact of the full shutdown planned for September of this calendar year. Turning to our Chemicals business. Sales volumes for Chemicals Africa is expected to be between 6% to 12% higher compared to the prior year, following improved operational performance and recovery from supply constraints, which we experienced in the previous year. In Chemicals America, we expect sales volumes to be between 5% to 10% higher than the prior year as Lake Charles continues to ramp up.\n\nChemicals Eurasia, the sales volumes are expected to be up to 5% higher, mainly due to improved market demand. There is, of course, some risk to our Eurasia business forecast, as Fleetwood has highlighted. I'm pleased to share the ongoing progress we are making with our Sasol 2.0 transformation program, which aims to ensure that we remain competitive and profitable even in a low price oil environment. Looking at our performance for this year, we realized ZAR 4.2 billion in net sustainable cash fixed cost savings, well above our target of ZAR 3 billion.\n\nThis was partially offset by higher cost as we introduced employee short-term incentives and other shutdown-related expenditure, which was not in our financial year '20 base. The benefit of these savings is evident in the income statement as we managed to contain cash fixed costs to a mere 2% increase compared to the prior year. We saw a ZAR 2.6 billion gross margin improvement, above our target of ZAR 1.5 billion, through initiatives such as feedstock optimization and debottlenecking of our plants. Capital expenditure remained within our guided range of ZAR 20 billion to ZAR 25 billion in 2020 real terms.\n\nThis was delivered through our risk-based capital allocation approach, which includes initiatives such as preventative maintenance and developing alternative low capital and noncapital solutions. I will provide more detail on capital spend on the next slide. Our working capital ratio was slightly above our target, mainly as a result of higher valuation of inventory and receivables following increased prices. If we extrapolate for turnover for the last quarter of the financial year, though, the working capital to revenue ratio was 12.3%.\n\nGiven the volatility, which has played out over the recent years, we are revisiting the measure of 14% working capital to turnover ratio at period end and considering embedding a more sustainable average throughout the year. As we enter the new financial year, we will continue to focus our efforts on strict cash fixed cost management and further increasing our gross margin through operational improvements and realizing best practice through market-driven strategies. Based on the current pipeline of ideas and initiatives, we are confident that we will maintain momentum in achieving the 2.0 targets for the upcoming financial year and beyond. We continue to prioritize capital spend to enhance returns, protect our license to operate and ensure that we have a safe and reliable operations of our business.\n\nOur capital expenditure of ZAR 23 billion for the financial year was in line with guidance, but higher than the previous year as we deferred capital expenditure due to cash preservation measures. Looking at our capital forecast for the new financial year. Our maintained and transformed capital will be slightly higher compared to this year, but still in line with our capital guidance. This is largely due to the PSA drilling campaign gaining momentum and the planned full year shutdown of our Secunda operations.\n\nAs we progress our 30% greenhouse gas reduction program, we will start incurring more transformed capital. To date, spend was limited to minor study costs. Here, we expect to spend between ZAR 500 million to ZAR 1 billion in financial year '23 with peak spend forecast for financial years '25 to '27. Going forward, our key capital targets remain unchanged with the transformed and maintained capital of ZAR 20 billion to ZAR 25 billion per year in real terms.\n\nThe aggregate capital for our transformation road map of between ZAR 50 billion to ZAR 25 billion up to 2030 is included in this annual spend guidance. Our capital allocation framework shared in 2021 is aimed at balancing the delivery of our long-term strategy, our climate change ambitions and growing our shareholder returns. Our first and second order allocation principles ensure that we prioritize our maintained and transformed capital to continue operations well into the future, while the robust balance sheet will support a sustainable dividend based on a 2.5 to 2.8 times cover of core HEPS. Growth opportunities, both organic and inorganic will then compete with additional shareholder returns in a disciplined fashion to optimize risk-weighted returns of the portfolio.\n\nOur accelerated asset divestment program is now complete and delivered over ZAR 50 billion of proceeds. This has significantly contributed to our deleveraging success and reduced net debt to a more comfortable level for the business. Our hedge cover ratio has reduced significantly from financial year '22 to '23, and we now expect further reduction of the cover ratio as we have reduced the need for downside protection. To support our 2050 ambition and the new value streams being pursued throughout the business, we are in the process of establishing a small venture capital fund aimed at investing in start-up and early stage technology in the green economy.\n\nThis will also support our internal research and technology capabilities through which we believe Sasol can make a significant global contribution to innovating for a better world. In conclusion, I would like to emphasize the great progress made toward our financial objectives in a very challenging environment. Our group profitability and financial position has improved dramatically over the last year. Favorable macroeconomics have helped us, together with focused and well-executed plans and a strategy, which will preserve and grow long-term value.\n\nThere is, of course, much more to do, but there is also little doubt that we have created a stronger platform. Our shareholders have been patient in foregoing dividends over the last few cycles. And today, we are proud to announce the resumption of dividends on the back of a much stronger balance sheet. We are committed to maintaining a dividend, which is sustainable going forward.\n\nWe have a clear transition target to 2030, which includes a self-funded transition, and we have full confidence in delivering the first 30% greenhouse gas emissions reduction by 2030 through well-defined levers. Beyond this, we will balance capital allocation of growth projects, which make economic sense with acceptable risk and shareholder return options. We will prioritize more impactful investments over time, which provide healthy and consistent returns which are commensurate with the risk. Thank you for listening.\n\nAnd I will now hand back to Fleetwood for the conclusion.\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nThank you, Hanre. As we look to conclude the presentation of our year-end results, I will now shift the focus to future Sasol. As we accelerate plans to meet our 2030 GHG reduction target, we built the foundation for achieving our 2050 net zero ambition. In this regard, we continue to progress the techno-economic studies on the pathways considered for 2050 with more detail being developed.\n\nOur GHG emission reductions will be achieved through transformational pathways that could also include conscious decisions to cut back production in parts of the business. We could, for instance, see our Secunda production slate shifting fundamentally beyond 2030, depending on demand profiles for energy products in the longer term. We are also playing a leading role in coastal green hydrogen export through the Boegoebaai opportunity. Through a minimum random of agreement with the Northern Cape Development Agency, we are leading the prefeasibility study to explore the potential of Boegoebaai as an export hub.\n\nSasol ecoFT, which aims to provide sustainable aviation fuels, or SAF, and related feedstocks for chemicals using our own proven Fischer Tropsch technology has seen significant interest in the recent period. SAF remains one of the most promising pathways for the hard-to-abate aviation sector to decarbonize in future. The SAF drop-in offering is [Technical Difficulty]. Our sincere apologies for this power failure we experienced.\n\nI think we need more renewable energy earlier. Let me continue. The SAF drop-in offering is an attractive aviation fuel solution, and the market is expected to grow massively in the years to come. We are refining our go-to-market strategy and entered into multiple collaboration agreements with venture partners, feedstock suppliers, aircraft manufacturers and other service providers to firmly position Sasol within the developing SAF market.\n\nThe Lake Charles ramp-up continues to be a focus area in the short term. But beyond that, we believe the site provides multiple attractive opportunities through colocation and expansion as a sustainability hub with partners. We are also bolstering our research and technology capabilities to support the development of emergent and new green technologies needed toward 2050. Green technologies will not only contribute toward Sasol's net zero plans, but also play a critical role in the broader societal move to net zero through application of our technologies.\n\nAn example of this is the recent Sasol and LOTTE Chemicals collaboration to develop materials for electric vehicle batteries, where lithium-ion batteries are likely to be the key power source for electric vehicles in future. As mentioned by Hanre, the venture capital fund we are establishing will facilitate funding advancement of new technologies through start-up opportunities. Now looking ahead, there are several key areas where we must maintain our relentless focus to continue delivering on our ambition to grow shared value while accelerating our transition. First and foremost, we must achieve zero harm for our people.\n\nAlso important will be to progress our climate change and broader ESG goals, which is fundamental to our long-term sustainability. We will build on the excellent progress made this year to drive further execution of our 2030 road map. In addition to this, maintaining operational stability and focused volume improvement will ensure that we maximize value from our well-invested assets. Moreover, delivering on our Sasol 2.0 targets will position us to be sustainably profitable and competitive in a lower oil price world.\n\nDelivery of these goals will enable the business outcomes to ultimately provide sustainable shareholder returns. This concludes our results presentation for today. Hanre and I thank you for watching. We will now take a five-minute break before we commence with a questions-and-answer session, which Tiffany Sydow from investor relations will facilitate.\n\nThank you.\n\nTiffany Sydow\n\nGood morning, and welcome to the question-and-answer session related to Sasol's financial results announcement this morning. My name is Tiffany, and I'll be facilitating the question-and-answer session today. With us in the room, we have Fleetwood Grobler and Hanre Rossouw. And on my right, we have the rest of the Sasol executive management team.\n\nWelcome to the session. [Operator instructions] Turning to our first question for the day. Excited by Sasol's initiative to start a venture fund. Is there a capital target for the venture? And by when will the venture start operating? From Tabo Matabata at NPV Investments.\n\nHanre, over to you.\n\nHanre Rossouw -- Chief Financial Officer\n\nThanks, Tiffany. I share the excitement. I think the venture capital fund that we are targeting gives us the ability to innovate also outside of Sasol, and I think it links nicely to the research and technology work that we do. I'm going to keep you in suspense.\n\nWe are hoping to launch that later this year. We're finalizing the funding and governance aspects of that, but hopefully share some more news on that before the end of the year.\n\nTiffany Sydow\n\nThank you, Hanre. I think sticking with the theme of financial results. Could you please shed some light on your oil price hedging strategy given the risk that oil prices could come down in the event of a global recession? From Richard Middleton at Excelsia Capital. And I think if we can go on to the next question as well, what would be the criteria for Sasol to consider a blend of share buybacks and dividends going forward? From [Inaudible] at Bateleur Capital.\n\nHanre Rossouw -- Chief Financial Officer\n\nThanks, Tiffany. I think the overarching aspect for both questions are the capital allocation framework and risk management structure that we have. And I've got to first just declare my personal allergies to hedging. I think it's important to not look at hedging in isolation, but as part of a broader risk management aspect of the business.\n\nTo that extent, we had excessive hedging, you could say. And the need for hedging, given our previous significant debt on the balance sheet, if we go back to 2020, we had over $10 billion of debt. And at that stage, we had around 70% cover of our oil production. Given the significant reduction in gearing, operational gearing has also improved.\n\nWe now see a lower need for gearing -- or for hedging, rather. And we've reduced the hedge cover of oil to around 25% for the 2024 financial year. And that also now has a slight change in approach, where previously we used the zero cost collars, we are now using more put options really just to buy the downside protection in the event of severe drop in oil prices, which could come from a global recession. In terms of buybacks and dividends, again, we referenced the capital allocation framework.\n\nAnd really, thereafter, the allocation of capital to our maintained and transformed and paying the base dividend, the excess cash then will either go into growth capital, as I mentioned, both inorganic or organic, or be returned to shareholders. And to that extent, we're happy to consider both buybacks and special dividends. We've not given any guidance yet on the balance of buyback and dividends through which we will consider, but we will consider that given the specific circumstances at that time.\n\nTiffany Sydow\n\nThanks, Hanre. I think moving over to operational and business outlook questions, I'm going to direct these next two questions to Fleetwood. The mining productivity guidance of 1,000 to 1,100 tons per CM per shift is well below my understanding of targeted levels of 1,200, 1,300 tons per CM per shift. What is constraining the ramp-up in mining activity? And that comes from Wade Napier at Avior.\n\nAnd the second question around LCCP. What was the capacity utilization at LCCP during FY '22? What will normal capacity utilization be? And when do you expect to reach this? This comes from Victor Seanie at Benguela Global.\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nYes. Thank you, Tiffany. Thank you, Wade, for the question. So let me just position first that our mining productivity guidance that we've given at the half year-end, that was attained through the second half of the year.\n\nAnd our outlook now is building on that guidance. So I think what is underpinning our targeted mining productivity improvement is, first of all, our safety remediation program. So that is the bedrock of our mining operation. And so I would be low to indicate any higher numbers before we haven't solidified our safety foundation and that remediation program.\n\nAnd it's also about -- you can't send mixed signals to your mine workforce to say, what is now the priority? Is it now, first, safety recovery? Or is it production productivity? And so I think the message is clear. We're going to remediate the safety. We're going to set realistic targets where we can build from over the last six months delivery built from that going forward, but in a very measured way, making sure that safety is the primary focus during that ramp-up of productivity. As far as the second question with respect to the capacity utilization of LCCP in the past year, I think from the outset, we have made it very clear that the different sections of the plant will see different ramp-up targets.\n\nSo we are clear that our base chemicals portion of the 50% that we are owning now as a result of the divestment, that one is more a commodity business. And the ramp-up, of course, will be through the three years period, which is now being attained through that. And so there is a capacity utilization of 90% plus in the various units. I won't go into to the details.\n\nAnd we have had toward the end of the last quarter, also some setback in the cracker where we had some equipment failure that has to be rectified. Also, this is not anything unusual as you start up a new plant, you go through the bus stop of reliability issues, and you sort that out and then get stable reliability operations. So as far as the base chemicals part, I think we're tracking well. When we look at the other parts of the specialty, we also indicated very clearly to the market that we will have a five-year for our differentiated commodities and products that we do.\n\nSo for example, most of the oxalation ETO products, the MEG, ethylene oxide as well as the Ziegler fall more into that category, which is a five-year ramp-up and there, we're tracking very good. So we are meeting our targets. So this is now in year two that we've completed. So we're going into the year three.\n\nAnd I think we're tracking our thing. The specialty chemicals, where we look at the Guerbet alcohol and the very specialty surfactants that goes, for example, in oilfield chemicals applications, those are on a 7-year trajectory of ramp-up. And we are also following that at the moment. So I'm going to say, overall, you can't put one number down.\n\nYou need to look at the various products and the applications. But I'm happy that we track on that basis, and we can engage into discussions to give you more granularity as we unpack the results in the next week.\n\nTiffany Sydow\n\nThank you, Fleetwood. There are a few questions that are queued via Chorus Call. If I could move over to the operator, please, and perhaps we can start with the first two, Gerhard Engelbrecht from Absa and then moving on to Adrian Hammond from SBG.\n\nOperator\n\nOf course. Gerhard Engelbrecht.\n\nGerhard Engelbrecht -- Absa Capital Markets -- Analyst\n\nIs the line open? I hope you can hear me.\n\nTiffany Sydow\n\nYes, we can. Gerhard, go ahead.\n\nGerhard Engelbrecht -- Absa Capital Markets -- Analyst\n\nIt's nice to, as you say, verbalized questions again. Thank you for that. I've got three questions, if I may. The Synfuels production, I mean, let me start saying this.\n\nIn F '19, you had a two-phase shutdown, and you were producing at 7.6 million tons. So the Synfuels production guidance is way below that, the seven million to 7.2 million tonnes. Why so low? Is it just because of coal quality? And when do you expect Synfuels to be producing at optimal levels again? I guess that's the first question. Can you give us more detail on your procurement of LNG? The world of LNG has changed significantly since Russia invaded Ukraine.\n\nHow are you progressing? And can you give us a sequence and timing of events that needs to happen in terms of FIDs on the Synfuels additional eth reformers, the building of the regas or construction of the regas facilities, etc.? And then just the last question. You've increased your assumptions for rand oil. Your long-term assumptions that looks in the AFS by about 40%, yet your fuel producing businesses remain impaired. Does it mean you've included additional negative items to offset the increase in the long-term assumptions? Or why have you not reversed those impairments?\n\nTiffany Sydow\n\nThank you, Gerhard. Fleetwood, if you could start with the first few questions.\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nYes. Thank you, Gerhard. So the three questions, I will commence with the first two, and I'll also ask Simon and Priscillah to weigh in on that. And I think Hanre can deal with the last question then.\n\nSo first of all, the guidance that we've given for the Synfuels volume output is informed by a number of areas. First, we are recovering from our previous year. And as I mentioned, with the mining productivity, we are on a trajectory to improve. And so the guidance must be see in that light that it's a realistic building up on a volume base going forward.\n\nAnd so that's the one aspect. The second aspect, which is the full shutdown as well as the phase shutdown that we have this year in Secunda, that's the event that's almost every five years, but that adds an additional limitation on volume output in Secunda. So I will ask that Simon also weigh into that. And then as far as the LNG goes, in terms of the progression and where we stand, let me ask Priscillah to weigh in.\n\nFirst, over to Simon, and then take the gas question, Priscillah, please.\n\nSimon Baloyi -- Vice President, Engineering, Centralized Maintenance and Operations Support\n\nThank you, Fleetwood. It seems like every time we speak, myself and you, we speak about the total shutdown. So I remember a day where we -- or in Secunda, and we had to put four bottlers of water, and we're demonstrating how to do a phase and a total shutdown. So you're indeed, correct.\n\nThis year, our guidance is related to that. We will be taking a phase total shutdown, which starts coincidentally this Friday, and that will go on until around 24th of September. The total portion of the shutdown shall come back around, I mean, 12 to 14 days. And then I think that guides how we then seeing around 100 to 200 kilotons less.\n\nAnd then as you know, when we started the merry campaign for FY '22 and a portion of '23, we did give guidance that we don't have as much gas as we would like to have. So that also does have an impact of around 100 to 150 kilotons. So taking all of that into consideration, I suppose, post FY '24, which we'll be retaining during the phase times to around 7.6 and when you have total shutdown, we'll still remain between 7.5.\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nThank you. Priscillah?\n\nPriscillah Mabelane -- Executive Vice President, Energy Business\n\nThank you. Gerhard, thanks for the question. So perhaps before getting to LNG, it's appropriate to just give an overview of where we are overall in our gas sourcing strategy because it's actually a portfolio of both our exploration and development projects as well as LNG. And it's quite important as we move forward that we actually balance the two.\n\nSo we are actually making good progress in terms of our overall portfolio. You've seen today, earlier on, we've announced the extension of the plateau to 2028. At the back of that, it gives us flexibility in terms of how we bring LNG onboard, yet at the same time maximizing the exploration and development of quite a few of our projects that we're already working on. In terms of LNG, we are targeting to finalize the term sheet by end of this year.\n\nAgain, it's quite important that we reach the right commercial terms before we commit ourselves. We are in intense discussions and negotiations with our partners. That will enable us to probably take about six months or eight months to complete and finalize the FID so that we can start with the construction. We are also discussing timing with them, particularly given the fact that we've got now two more years flexibility.\n\nSo the original timeline was BO of 2026, and we would like to create some flexibility as we engage going forward. What is more critical for us is to ensure that the infrastructure in Maputo is actually built more than the actual contracting of the molecules. Hopefully, that gives you a good clarity of where we are.\n\nHanre Rossouw -- Chief Financial Officer\n\nThanks. And if I can jump in then just on the impairment or your question around whether the stronger oil prices in the assumptions could not have led to a reversal of impairment. There's detailed disclosure on the impairment assumptions in Note 9 of the annual financial statements. And you're absolutely spot on that.\n\nWe did, of course, increase oil assumptions on the back of what could be short-term tightening of the oil market. So in terms of our assessment of the carrying value of our assets, we did have to take into account that this could not -- this potentially wasn't a structural change that could be long lived. And it's also offset then by other assumptions that have had a negative impact on the valuation. And I think to that extent, we've highlighted carbon tax and the proposal also now as a measure that could detract value on that carrying value.\n\nSo on the basis of sensitivities, we've assessed and got to the conclusion that there's no need at this point to reverse impairments. But of course, we'll continue to do the assessment on an annual basis.\n\nTiffany Sydow\n\nThank you, Hanre. Sticking with Chorus Call, I think we had Adrian Hammond next in line. Adrian, please go ahead.\n\nOperator\n\nUnfortunately, Adrian's line has dropped. Next question we have...\n\nTiffany Sydow\n\nGreat. Can we move to Chris Nicholson, please?\n\nChris Nicholson -- Morgan Stanley -- Analyst\n\nI hope you can hear me. My question is around the European Chemical business. I'm sure as many are pretty worried about what's happening in the European gas markets. Could you tell me what happens if Germany moves to Stage 3? What would the impact be on your European Chemical businesses in Germany and Italy or in Germany in specific? And then also maybe just some guidance on where you see margins heading in that business.\n\nI mean, it would look from the scale of feedstock cost increases that they could be hitting negative. What are your options in that instance?\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nThank you, Chris. I'm going to ask Brad to weigh in on that. Suffice to say that we have got a number of different situations from North to South Germany and to Augusta and southern part of Italy and Sicily, because the sources of gas is different. One is supported from Africa.\n\nThe others are dependent on the Russian gas. But notwithstanding, I think we've got a very clear understanding of the levers that we need to watch out for. And I'm going to ask Brad to weigh in on that.\n\nBrad Griffith -- Executive Vice President, Chemicals\n\nYes, happy to do that. Thank you for the question, Chris. As Fleetwood said, we've got a task team working on our response to the reduced gas supply as do all of our industry partners in the region. For Italy, let's start there first.\n\nI think we're well placed to be able to continue our operations. We have the portfolio of gas supplies as well as liquid fuel options to be able to continue those operations. In Marl, our large site in Central Germany, is actually fed by our host company, Evonik. They've announced publicly that they're intending to restart their coal-fired power station and steam generation as well as switch some of their natural gas consumption over to LPG in line with the government's guidance on the gas network.\n\nFor Brunsbüttel, we do have options as well. We've been working on liquid fuel choices. One of the unique things about the Brunsbüttel site is that we also provide a heating steam, low pressure steam, to the community of Brunsbüttel. So we're expecting to be able to continue to receive natural gas to some degree there.\n\nI think if you look at some of the latest public information from the German government, they do sit at a higher level of storage than what they normally would be. That's obviously a concern whether they continue to build that up for the winter, and we all continue to monitor that. In terms of your questions on margins, certainly, margins are under pressure. If you look at daily gas prices, it does put pressure on some of our operations that are large gas consumers.\n\nAnd so we work with our customers to see what can be done to be able to pass it on. And we're making choices, as Fleetwood mentioned earlier, on alternative energy supplies, but also looking at alternative sources of feedstocks. And where necessary, we will moderate rates, and that's why we gave guidance for fiscal '23 that was a bit wider than usual, showing a 0% to 5%. Because if we continue to see the pressure on gas, then we potentially would be making some choices on how much volume we produce.\n\nTiffany Sydow\n\nThank you, Brad. I'm going to switch back over to the online platform. There are a few number of questions coming through on the operational theme. There are a few questions around Mozambique gas.\n\nI'll cluster those together. The first one comes from Adrian Hammond at SBG. If the plateau is extended to 2028, why is LNG still needed by 2026? Synfuels volumes were historically 7.6% to 7.8%. The Sasol return to this level.\n\nI think some of that has already been covered by Simon. What is the current bottleneck? And then also on gas, there's another question from Siam Butter at Vetri. How is SOL addressing the sharply declining gas reserves in Mozambique? And what solutions have you looked at? And how much capex is expected to be spent? Are these enough to fulfill SOL needs while the company transitions to green hydrogen. Fleetwood, if you could address those?\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nThank you, Tiffany. And I think we have basically addressed the gas play in Mozambique. Priscillah has touched on that. So I can only add to say that we would continue our efforts to look at what are the opportunities in our near fields that we operate and within our fields, so we had very good success with this infill well drilling campaign.\n\nSo we're excited about that, and that informed also the extension of the plateau. And so we will do more work and more drilling in that regard. Moreover, we are busy with the PSA implementation project. And that will also assist us to think about, is there any excess gas that can be committed beyond the need for the Mozambican in-country power station that would be the first taker of the volume of gas over the period that was committed.\n\nBut we also know that if we have more gas, we've got the opportunity to bring that gas to South Africa. And we are busy finalizing all of those agreements with the Mozambican government, but they are willing to help us out on that basis. But I think the options of gas is a key focus for the energy team. And Priscillah has indicated that they want to create optionality to not only think about our own fields, but also the LNG and other adjacencies that we may be harvesting in our own area.\n\nSo I think that is a good summary, I think, of where we are.\n\nTiffany Sydow\n\nThank you, Fleetwood. I think the next question comes around the current NERSA maximum gas pricing from Herbert Kharivhe Investec. Re the gas prices, any challenges in enforcing the current NERSA maximum gas price that suggests prices could be more than 90% higher?\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nYes. I think the situation with NERSA, and thank you, Herbert, we have been engaging with NERSA since the first quarter of this year to finalize within the framework of the maximum gas pricing mechanism to come through on a price that would be realistic in today's environment, given that the maximum gas price would have been ZAR 270 per giga-joule, but we did not think that is realistic. We have proposed a different price level. We've engaged with NERSA.\n\nAnd at this point in time, we haven't finalized that with NERSA. We have indicated that we will not implement this price announcement that we mentioned in August, and we would like to resolve that with NERSA because in the end, that is what they have to assess is the rationality test for a realistic price and that we will then -- once we've come to that agreement, we will take that forward with our customers. And I can only say our customers in Sasol are both in all earnestly waiting for that engagement so that we've got certainty of what the rest of the year would hold in within the grid pricing framework that was agreed already last year with NERSA.\n\nTiffany Sydow\n\nThank you, Fleetwood. Another question from Herbert Kharivhe on the impact on mining productivity. Higher-than-average rainfall is expected this summer. Could we see more of the same or lower productivity in mining and consequently, Synfuels? Is this unavoidable without contingencies in place?\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nYes. Thank you for that question. I think, first of all, we have indicated that one of our mitigation levers to have a ratable coal supply is our stockpile level. Now in the last year this time, our stockpile level was not in a very healthy level.\n\nAnd when the rainy season started, that exacerbated our ability to maintain stockpile level. I think this year, we've got a very different approach. We will maintain our stockpile level well above the 1.5 million tons. As a matter of fact, as we go now into the Synfuels shutdown that Simon referred to, that will last us to the end of or on the last week of September.\n\nWe will make by increasing the coal mining to the stockpile so that we bolster that 1.5 million maybe to a range of two million to 2.5 million tons or beyond. So that when we entered into the rainy season that we've got more security through stockpile measures, and that we can mitigate that event.\n\nTiffany Sydow\n\nThank you, Fleetwood. A couple of financial questions coming in for Hanre. The first one from Adrian. Can Sasol reach investment grade credit ratings and detach from the sovereign rating? And then I think another question on the capex outlook also from Adrian.\n\nWhat is the group capex outlook in nominal terms for '24, '25, please? And what is the future hedging ratio we can expect?\n\nHanre Rossouw -- Chief Financial Officer\n\nThanks, Tiffany. In terms of investment grade ratings, unfortunately, at the moment, the rating agencies does tie Sasol's rating to the sovereign. And unless there's a significant increase in offshore profits in the region of 50% plus, unfortunately, the sovereign grade credit rating will always be the ceiling for the company. We've been engaging with the various rating agencies on that, but unfortunately, that's just how things work at the moment.\n\nIn terms of group capex outlook, in nominal terms, I think you can safely apply a kind of 4%, 5% inflation impact to the 20% to 25% guidance. We are very comfortable that the -- kind of the next year, as I've mentioned, we will be in line with that guidance. And so certainly, '24, '25 as well, it will cover not only the sustaining of our business, but also the transformation needed, the ZAR 15 billion to ZAR 25 billion that we've got to spend to 2030 to meet our greenhouse gas targets. And the hedging.\n\nI think in terms of hedging, as I've mentioned, the hedging does come down to around 25% for financial year '24 in terms of oil. And we'll continuously reassess that level. I think as I've mentioned earlier, it's a function of the operational gearing that we expect in the business, the financial gearing particularly around our absolute and net debt level. And we will -- we do detailed Monte Carlo analysis of sensitivity to the various outcomes.\n\nSo it relates not only to oil, but also more particularly on the rand-dollar exchange rate as well, as well as ethane and on coal. But in general, given the stronger balance sheet, as I've mentioned, we do expect the hedging levels to be more around the lower levels that we're seeing now in '24.\n\nTiffany Sydow\n\nThank you, Hanre. While you are on the mic, another two questions around debt. One comes from Adrian Hammond again at SBG. Can Sasol -- sorry, what is the group -- sorry, I've already covered that one.\n\nThe debt profile comes from Stella Cridge at Barclays. The debt profile shows a spike of ZAR 2.8 billion in FY '24. Could you give me your current thoughts and on future funding and refinancing strategy? Do you plan new bank loans or visit to the bond market as part of the strategy?\n\nHanre Rossouw -- Chief Financial Officer\n\nThanks, Tiffany. So I think in terms of -- and this is where I'd love to take credit for the fixing of the balance sheet, but I said I'll not take credit for anything today. But the balance sheet is in very rude health. I think as we've mentioned, we've got a net debt level at the period end of USD 3.8 billion.\n\nOn a gross debt level, we had just over USD 6 billion. Effectively, all of our debt is U.S. dollars. So in terms of refinancing strategy, the key focus is to shift more of that U.S.\n\ndollar debt into rand-denominated debt that will better match our cash generation. In terms of refinancings, yes, we've got ZAR 2.8 billion in financial year '24. That relates to a term loan and a U.S. denominated bond.\n\nAnd then we also have, in November this year, another $1 billion of bond that needs to be refinanced. We're very comfortable that there's a range of options to refinance that. We've got the RCF facility that we can very comfortably use as a bridge, we can use existing cash flows. And then we will look at other instruments as well as alternatives.\n\nSo not losing sleep likely at this time on the balance sheet. Thanks for that question.\n\nTiffany Sydow\n\nThanks, Hanre. I'm going to move back to Chorus Call and take two questions from Alex Comer and Sashank Lanka. Operator, can you direct their questions, please?\n\nOperator\n\nAlex, your line is live.\n\nAlex Comer -- JPMorgan Chase and Company -- Analyst\n\nYes. I've got a couple of questions. First of all, just on this gas LNG situation. The LNG price is very high at the moment.\n\nIs there a point at which you decide not to go down that route and just cut to under production to make your 30% target? Or are you determined to go ahead regardless of the economics? That's the first question. Secondly, just on Natref, I see on your presentation, you talked about joining to a green refinery. So is this decision been made to keep that Natref open? And what level of capex will be required in order to make the new fuel regs? And then my final question is in terms of the dividend, the 2.5 to 2.8x cover, how should we think about the levers to pull that down to the lower cover ratio?\n\nTiffany Sydow\n\nThank you. Hanre, if you could address those please?\n\nHanre Rossouw -- Chief Financial Officer\n\nLet me start with the dividend. As we've highlighted, the capital allocation framework incorporates our dividend policy, which relates to 2.5 to 2.8 times cover of core HEPS. I think important perhaps just to note that core HEPS excludes any fundings that excludes any hedging losses or gains. So we make sure that the investors get the full benefit of the cash generation of the core business.\n\nTo that extent, we said that we'll go to 2.5 times cover if the net debt levels dropped to below $4 billion in absolute terms. We briefly -- we've obviously hit that now briefly at the period end, but we will want to see that sustain throughout a period to lower that cover from the 2.8 to 2.5. Beyond that, as I've mentioned, we will also return excess cash to shareholders through aspects such as special dividends or buybacks.\n\nTiffany Sydow\n\nThank you, Hanre. Fleetwood?\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nThank you, Alex. So I'm going to address the Natref question, and I'm going to ask Priscillah to weigh in on the LNG options that we look at. So Alex, I believe we have announced probably a couple of years ago, what is the capital requirement for getting Natref clean fuel compliant, which was, if I recall -- I'm not sure, it was four billion plus at that time the range. We've given the range to the market.\n\nNow we have achieved two things in the pre-feasibility study and our operational review with our partner TotalEnergies. First of all, we have come up with a very creative way to get Natref output clean fuel compliant on diesel for a very low investment. And I think this is -- I'm not going to mention the amount, but it is within the operational expense realms that you can achieve that. And that we will then be ready for by toward end '23, that means end next year.\n\nAnd on the petrol side and jet on the clean fuels there, that is a solution that we are looking at, and I'm not going to give you the price or the cost range today because it's a pre-feasibility type of quality that we're busy with. But all I can say that it is substantially lower than the previous clean fuels cost or capex that we've signaled to the market. And we will come back, hopefully, within the next six months to get further clarity on that specific amount. Priscillah?\n\nPriscillah Mabelane -- Executive Vice President, Energy Business\n\nThanks, Fleetwood. Alex, good question. The simple answer is no. We won't do it at low cost.\n\nBut having said that, let me elaborate a bit. We are looking at a portfolio, as I've mentioned. We are targeting a blended price of gas going forward, which needs to break even with turndown solutions. We do recognize that there will be some dilution but were quite critical for us that we continue to deliver the right returns for our shareholders.\n\nSo that balance is going to be quite critical. So that's what we are working toward. We're also mindful for the South African as well because there are industries that are going to require gas going forward. So we're hoping that there will be a predictable regulatory framework that ensures that there is appropriate gas at the affordable price going forward.\n\nIn terms of our term sheet negotiations and just to note that we are mindful of the current volatility in the market, but we are targeting a long-term contract that will actually go beyond the current cycle, hopefully. So with that, we don't expect that the volatility will be impacted significantly. Having said that, key for us is for the infrastructure to be built, then we can find alternative LNG sources that are competitive into the future.\n\nTiffany Sydow\n\nThank you, Priscillah. Sashank, if you could go ahead with your questions, please?\n\nSashank Lanka -- Bank of America Merrill Lynch -- Analyst\n\nSo I think on my first question, this was partially asked by Alex. So just following up on the response. Fleetwood, you did mention that petrol and jet fuel, you're looking at much lower costs or becoming clean fuel compliance. So I'm just wondering what changed versus the earlier capex guidance or the number that was out there in the market and why you think it's going to be much lower now.\n\nAnd the second question is just on hedging for ethane. I know that in FY '21, we did hedge almost 30 million barrels. Obviously, ethane prices now are close to $0.66 a gallon, which I'm sure is impacting your margins in the U.S. business.\n\nSo just wondering, when I look at the hedging policy for FY '23, it doesn't seem like you hedged thane at least in the coming quarters. So just wondering what's driving that strategy.\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nThank you, Sashank. I will deal with the clean fuel capex. I think we've mentioned it earlier. So the one item was the creative way of taking the capital out really for the diesel clean fuels compliance.\n\nSo that made the big difference. And then, of course, when you bring in your bio feedstock component, although on a hybrid basis, so there would be a mix. It does also help to get capital down for the full clean fuel solution on a petrol base and crude base only. I think those were the drivers that we are seeing that help us toward a lower capex number.\n\nBut as I said, we've done the pre-feasibility study. We haven't got more details now to divulge, but let's do that work, and then we'll signal much more detail.\n\nHanre Rossouw -- Chief Financial Officer\n\nThanks. On the ethane hedging, we did do last year four million. In terms of this year, the focus is really to get operational stability. I think we've got flexibility in our U.S.\n\nbusiness that we can get merchant ethylene as well. Remember, we, of course, take ethane produced ethylene. So when we look at the current pricing levels, given that there was a significant spike in the ethane price, we didn't see it grow to actually lock in the higher price. So we didn't go into the market for '23.\n\n'24, we will again assess the pricing in the forward curve. If it does lock in reasonable returns for us on that business, we will again venture into the market. But I've got to stress that the -- certainly, on the ethane and the coal side, the hedging is not that material in the bigger context of the oil and the ZAR hedges that we do.\n\nTiffany Sydow\n\nThank you, Hanre, and thanks for those questions, Sashank and Alex. If we can move back over to the online platform. There's two questions around our strategy. The first one comes from Peter Cambridge at Merchant Market.\n\nCan you spell out how clean projects, clean energy projects will be funded? And the second question comes from Tabo Matabata at NPV Investments. On the integrated environmental road map at Secunda operations, is April 2025 the targeted compliance date? And if so, is there a risk of implementation of the initiatives if some of them extends beyond April 2025? Fleetwood, if I could direct those to you, please.\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nYes. Thank you, Peter, and thank you, Tabo, for those questions. So first of all, the capital allocation framework that Hanre explained this morning is clearly going to guide us also on those low or clean energy projects or low carbon projects as we transform. And I think we will see no exception.\n\nWe also have indicated clearly that we will have certain parameters that we have as learning from the mega project we implemented in 2014 to 2019 in the U.S. And we have indicated there, we will not invest in any large project more than 10% of our market cap and some other moderating considerations. And we will still apply that. But that's within the discipline of the capital allocation framework.\n\nAnd I think as we move into these nascent markets of clean energy in the likes of green hydrogen, one of the underpinning anchors in such a venture would be to secure an offtake. We will not invest in a project like green hydrogen production, if we don't have certainty around offtake and what it means and how it raw the capital that you would be implementing it with. So I think that's the way we think about it at this point in time. And when we cross, when we get there, we will focus our disciplined capital allocation framework within the opportunity and need at that stage.\n\nWhen we look at the integrated environmental road map at Secunda operations, we have signaled all along that the SO2 solution is more complex in terms of the implementation. So I think that risk remains. Nothing has changed there. We have submitted a combined application within the regulatory framework to look at the SO2 load-based compliance versus the concentration-based compliance.\n\nAnd that is now in the hands of the regulator. We hope to get clarity on that in the next year or so. But that would also be one of the parts that inform such a risk or not. But I do think we are very cognizant and we've been very open and honest in terms of that SO2 is at risk for that date.\n\nAnd we're working with the regulator to get clarity on what is the technical solution we will apply, but that's the situation at the moment.\n\nTiffany Sydow\n\nThank you, Fleetwood. There's a question from Wade Napier around the specific segments within the Eurasia segment underpinning the expectation of 0% to 5% demand growth. Fleetwood, would you like to address that one?\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nYes. I'm going to ask Brad to weigh in. I guess it's an essential chemicals segment, but let me hear what Brad says.\n\nBrad Griffith -- Executive Vice President, Chemicals\n\nYes. Wade, thank you for the question. I think we were guiding for the growth of sales volumes versus prior year. So we do expect to see 5% higher sales volumes in '23 versus '22.\n\nWe do see a number of our market sectors continuing to recover. Some of those were actually quite depressed during fiscal '22. So automotive is one. We continue to see a growth in demand for emission control catalyst and also in refining and process catalysts.\n\nSo we do see that stepping up. And as Fleetwood mentioned, essential care chemicals, we really see that growth happening at GDP levels pretty much regardless of recessions and pandemics, and I think we saw that back in 2020 and 2021. So we do expect to be able to recover those volumes. I think, as I mentioned earlier, the big question is what happens with the economics? And we continue to be -- to work to pass on the cost to our customers, but also taking into account what can the consumer afford.\n\nAnd so that's going to be a key factor for our outlook for this year as to whether we'll be able to continue to run operating rates at some of those units to be able to generate positive margins. And so we'll monitor that very closely because we don't want to build up inventories and find the demand fall away.\n\nTiffany Sydow\n\nThank you, Brad. Before we close, there's a last Chorus Call question from Adrian. Operator, could you please connect Adrian.\n\nAdrian Hammond -- SBG Securities -- Analyst\n\nJust to come back to Hanre's discussion on the dollar debt and shifting it to South African debt. Is it a situation where the debt can't be funded in dollars earnings? And how easy it is to shift that to South African debt in terms of penalties, or you just simply convert once the existing dollar did matures? So I'm just trying to think about what the implication is on converting. And then to come back on the situation with gas and coal, the outlook for South Africa. It is stated that you intend reducing coal production by some nine million tonnes.\n\nCould you break down by 2030 where that comes from? And so reconcile that with coal purchases. I note that you do purchase coal from Isibonelo mine, and that has life expectancy up until 2026. So what are your plans around that?\n\nHanre Rossouw -- Chief Financial Officer\n\nThanks, Adrian. In terms of dollar debt to rand debt conversion, as I've noted, we've got $6 billion of gross U.S. debt. And it relates back also to the maturity profile in the earlier question that we've got the ability as these maturities are quite easy to manage either to just settle the debt and issue rand debt in the future.\n\nWe've got a DMTN as well, or we could buy back the debt. I think the great thing about a balance sheet that's strong is that you've got flexibility in various options. So cash flow generation then can be used to just settle those debt or we can also use, we've got $2.8 billion in RCF facility that we can use as an interim measure to also balance the effective refinancing of dollar debt with rand debt. But ultimately, we are targeting, as I've mentioned, lower debt in absolute terms as well.\n\nI think in terms of gas, coal usage outlook, Fleetwood, would you want to weigh in?\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nYes. Thank you, Adrian. So we have indicated that reduction from 2030 onwards. As I've indicated earlier this morning, we are also looking at a phased turndown of our boilers.\n\nNow that is not only helping us to attain also our CO2 reduction or emission target reductions because about 50% of the CO2 is developed or generated in utility block, and about 50% is generated in our process block from gasification to Fischer Tropsch in the refinery and chemical side of the process. So what we are looking at, and this is why we're so excited, is that the fine coal solution will enable us to use valuable feedstock that is going through fine coal. And remember, for every ton of coal we mine, there's about 30% fine coal and about 60%, 70% coal that goes into gasification. So if we can use that fine coal, it is a source of feedstock, and we need to mine less coal to achieve that.\n\nSo that is the part that we are looking now, and that's some of the work we've done in the past 12 months. And that gives us also optionality. But I think the total combination of pathways of fine coal usage, the utilization of gas, the introduction of hydrogen into the gas loop to work away more CO2 that's inherent into the gas circuit, turn that into products, those are all the opportunities that we look at, but I think we well covered then to achieve that reduction from 2030 onwards. As far as Isibonelo go, I'm going to ask Rhian to weigh in, in terms of our focus with Isibonelo.\n\nI think you're quite right. We know that, that contract comes to end, but we're looking at further options. Rhian?\n\nUnknown speaker\n\nYes. Thank you very much for the question. Isibonelo or Thungela has been a very loyal supplier to Sasol over many years. And the contract is coming to an end.\n\nWe are talking to Thungela. The Thungela colleagues, on some options, they do have further reserves in the area and also know that we also own reserves, the so-called Alexander block that we're also having a look at. That block can be mined, not necessarily by ourselves, but also either -- by means of open cast of strip mining or underground. We are looking at that, and we'll have answers soon.\n\nAnd then also, we need to bear in mind that there are some other owners of reserves around that area for Sasol. So we believe that we will be covered. Thank you.\n\nTiffany Sydow\n\nThank you, Rhian. With that, we're going to wrap up the session today. Thank you, Hanre and Fleetwood for your time and the rest of the Sasol management executive team. If you have any further questions, please direct it to the Investor Relations office, we will happily respond.\n\nThank you again for your participation today. We wish you a pleasant and safe day further.\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nThank you.\n\nHanre Rossouw -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nTiffany Sydow\n\nFleetwood Grobler -- President, Chief Executive OFficer, and Executive Director\n\nHanre Rossouw -- Chief Financial Officer\n\nGerhard Engelbrecht -- Absa Capital Markets -- Analyst\n\nSimon Baloyi -- Vice President, Engineering, Centralized Maintenance and Operations Support\n\nPriscillah Mabelane -- Executive Vice President, Energy Business\n\nChris Nicholson -- Morgan Stanley -- Analyst\n\nBrad Griffith -- Executive Vice President, Chemicals\n\nAlex Comer -- JPMorgan Chase and Company -- Analyst\n\nSashank Lanka -- Bank of America Merrill Lynch -- Analyst\n\nAdrian Hammond -- SBG Securities -- Analyst\n\nUnknown speaker\n\nMore SSL analysis\n\nAll earnings call transcripts"
}