{
  "companyName": "PayPal Holdings",
  "companyTicker": "PYPL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/paypal-holdings-pypl-q3-2022-earnings-call-transcr/",
  "content": "PayPal Holdings (PYPL 0.94%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:30 p.m. ET\n\nOperator\n\nGood evening. My name is Briana, and I will be your conference operator today. At this time, I would like to welcome everyone to PayPal Holdings' earnings conference call for the third quarter 2022. All lines have been put on listen-only mode to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions]. I would now like to turn the call over and introduce your host, Ms. Gabrielle Rabinovitch, senior vice president and acting CFO.\n\nPlease go ahead.\n\nGabs Rabinovitch -- Senior Vice President and Acting Chief Financial Officer\n\nThank you, Briana. Good afternoon and thank you for joining us. Welcome to PayPal's earnings conference call for the third quarter of 2022. Joining me today on the call is Dan Schulman, our president and CEO.\n\nWe're providing a slide presentation to accompany our commentary. This conference call is also being webcast and both the presentation and call are available on our investor relations website. In discussing our company's performance, we will refer to some non-GAAP measures. You can find the reconciliation of these non-GAAP measures to the most directly comparable GAAP measures in the presentation accompanying this conference call.\n\nWe will make forward-looking statements that are based on our current expectations, forecasts, and assumptions and involve risks and uncertainties. These statements include our guidance for the fourth quarter and full year 2022, our preliminary framework for 2023, and our comments related to anticipated cost savings, operating margin, and share repurchase activity. Our actual results may differ materially from these statements. You can find more information about risks, uncertainties and other factors that could affect our results in our most recent annual report on Form 10-K and quarterly report on Form 10-Q filed with the SEC and available on our investor relations website.\n\nYou should not place undue reliance on any forward-looking statements. All information in this presentation is as of today's date, November 3, 2022. We expressly disclaim any obligation to update this information. With that, let me turn the call over to Dan.\n\nDan Schulman -- President and Chief Executive Officer\n\nThanks, Gabrielle, and thanks, everyone, for joining us. I'm pleased to share that our results in the third quarter exceeded the guidance that we announced in August, marking the third consecutive quarter of delivering on our non-GAAP guidance. Before reviewing our results and operational progress, I want to share two exciting developments that we believe will enhance our long-term strategic position. First, I am very pleased to announce that we are working with Apple to enhance our offerings for PayPal and Venmo merchants and consumers.\n\nLeveraging Apple's tap-to-pay on iPhone functionality, merchant customers in the U.S. will soon be able to accept contactless debit or credit cards and mobile wallets, including Apple Pay, using an iPhone and the PayPal or Venmo iOS app.  This will allow PayPal's merchant base to easily use their iPhone as a mobile point of sale without the need for a dongle or other payment terminals. We believe that this, along with our other in-store initiatives, will continue to accelerate our opportunity to seamlessly process payments in the physical world for our merchants. We are also adding Apple Pay as a payment option in our unbranded checkout flows on our merchant platforms, including our PayPal commerce platform.\n\nWe are already in beta with several e-commerce platforms and merchants and anticipate a broader rollout in the coming months. And next year, U.S. customers will be able to add their PayPal and Venmo network-branded credit and debit cards to their Apple wallet and use them online and in-store wherever Apple Pay is accepted. We anticipate this to be available in the first half of 2023, expanding the opportunity for our consumers to transact in-store.\n\nThis is a significant step forward in our relationship with Apple and we are excited to work closely with them to bring these new capabilities to our mutual customers. Second, I'm excited to share that we continue to ramp Pay with Venmo on Amazon and we plan to be fully ramped in time for peak holiday shopping. This partnership is a reflection of Venmo's scale and ubiquity particularly in younger demographics. And we look forward to working closely with Amazon on this new offering to drive results.\n\nThese relationships are aligned with our practice of working collaboratively with the major players across technology and financial services to provide more choices and superior experiences to our mutual customers. We are regarded by many as a partner of choice due to our scale and ubiquity, enabling us to create unique value for our customers. And while we continue to enhance our strategic position, we remain focused on the operational initiatives that we shared last quarter. Our efforts to reduce our cost structure and drive productivity gains are yielding strong results.\n\nWe remain on track to drive over $900 million in cost savings across our operating and transaction expenses this year and at least $1.3 billion in cost savings next year. This focus on efficiency, while continuing to invest in key growth areas is a high priority for us. And we now expect to grow our year-over-year non-GAAP operating margin in Q4 to approximately 22.5%. We further anticipate that in 2023, we will deliver at least 100 basis points of operating margin expansion.\n\nLet me now turn to our results. Our revenues in the third quarter were $6.85 billion, up 12% FXN and 11% spot, exceeding our guidance. I'm pleased to say that eBay's migration to managed payments is behind us and will be inconsequential to our results in the fourth quarter. Normalizing for eBay's migration to managed payments, our Q3 revenues grew approximately 13% on an FX-neutral basis.  Non-GAAP EPS was $1.08, which exceeded the midpoint of our guidance by $0.13.\n\nThe cost containment actions we discussed on last quarter's call have slowed the growth of our year-over-year non-transaction-related expenses to 4%. We now expect that non-transaction-related operating expenses for Q4 will be flat to slightly negative year-over-year and we are planning similar levels in 2023. We are pleased with this execution, particularly as we are driving reinvestment in key growth areas and continue to enhance our strategic position. In the quarter, our free cash flow was $1.8 billion, up 37% year-over-year and an all-time record for us on an organic basis.\n\nWe added 2.9 million NNAs in Q3 and we expect to add another 3 million to 4 million NNAs in Q4. I'm also very pleased to report that our transactions per active account in the quarter grew by a record 13% to 50.1 times per year. I'd like to spend a few moments discussing our progress on Checkout. With 35 million active merchant accounts and nearly 400 million active consumer accounts, our scale is like few others in the world and represents a substantial competitive advantage in a business that is driven by network effects.\n\nIn addition, we have built a high level of trust with our customers that drives significant preference to use our branded marks for online transactions. We have continued to grow faster than overall e-commerce in Q3 with our total TPV up 14% FXN, demonstrating the competitive differentiation and diversification of our global platform. Within our PayPal-branded checkout business, we believe we held or gained share in the United States with PayPal-branded checkout volumes up 4% year-over-year. While there is not a standard proxy for e-commerce growth, I would point to Bank of America's credit and debit card volume data, which highlights 2% U.S.\n\ne-commerce growth in Q3, a full 200 basis points below our 4% branded checkout growth rate. We do expect we will continue to grow at or above the rate of e-commerce growth. However, we know there are still substantial opportunities for us to pursue. We have three major areas of focus for checkout: first, elevating and optimizing the consumer experience; second, providing merchants with a seamless integration experience and a one-stop shop for payments; and third, innovating new checkout solutions.\n\nAs consumers move toward mobile shopping, we are focused on creating the simplest mobile checkout experience possible. These enhancements include allowing customers to checkout without leaving the original merchant point of interaction. For example, our recently updated mobile SDK allows merchants to provide a seamless in-app checkout experience. We are also deploying the latest secure user authentication standard for our consumers, enabling passkeys on all iOS devices to drive speed, simplicity and conversion.\n\nOur latest innovation is accelerated checkout, which will provide merchants with a robust solution and enables one-click checkout. This simplified consumer experience is achieved by leveraging vaulted credentials within our network to authenticate and improve customer purchases without the need for a password. This enables seamless guest or account checkout experiences by removing obstacles which, currently, cause abandoned sessions. We are currently piloting this with several key partner platforms and we look forward to expanding this initiative as we move through 2023 and beyond.\n\nFor each segment of our merchant base, we are implementing detailed processes, go-to-market plans and KPIs to measure our migration from legacy integrations. Moving more of our merchant base to our latest and most advanced integrations will take time. This will clearly be a multiyear initiative but it represents a significant opportunity for us. And we are putting resources, process, and discipline in place to assure our execution.  We continue to see good momentum with our unbranded payment platforms.\n\nWe believe we are well positioned to help merchants orchestrate payments, leveraging our insights on machine learning, to wrap traffic between multiple PSPs, resulting in increased approval and retention rates. Braintree is a key growth area for us and we will continue to invest to further enhance the platform. Braintree TPV grew 38% in the quarter. Our Braintree momentum is driven largely by recent merchant wins and share of wallet expansions.\n\nAnd we recently signed an expanded agreement with live nation, which establishes Braintree as their primary card processor across the globe and includes an extended marketing partnership with PayPal and Venmo at some of live nation's largest festivals. Buy now, pay later continues to be a major asset to our checkout experience. And PayPal was just ranked as the best overall buy now, pay later value proposition in the United States by the Wall Street Journal. In the third quarter, we processed nearly $5 billion in volume, up 157% year-over-year with over 25 million consumers using our buy now, pay later services approximately 150 million times since launch.\n\nAs a result of this robust growth, we believe we have become one of the largest buy now, pay later providers in the world with a unique competitive advantage derived from our two-sided network. Our upstream presentment continues to grow with over 280,000 merchants displaying our buy now, pay later on their product pages. The size of our active account base and the years of transaction data we have on our customers provides us with an additional competitive advantage from an underwriting perspective. As of the end of Q3, our loss rates remain among the lowest in the industry with no observable deterioration to date.\n\nVenmo continues to be a significant asset in our portfolio with much-untapped potential. We have almost 90 million Venmo active accounts, including 57 million monthly active accounts. Total payment volume on Venmo grew 6% while Venmo commerce volumes grew 150% in Q3. We began to onboard charities to Venmo this quarter, which we expect will encourage more giving as we enter the holiday season.\n\nAs I shared earlier, we are obviously enthusiastic about our partnership with Amazon and look forward to working with their team. In October, we announced the launch of PayPal rewards, which unifies our Honey and PayPal rewards programs. And customers now can earn, track, save and redeem cashback rewards and merchant offers in their PayPal app. In addition, our customers can also combine the benefits of their existing card rewards and offers, allowing them to save even more.\n\nPayPal rewards is ramping in time for peak holiday shopping, and we have a robust roadmap to extend and enhance the program throughout 2023. In closing, I'd like to underscore that we are confident we have turned a corner in our transformation. We will continue to drive cost savings and streamline our processes to improve productivity while investing to differentiate our value proposition, drive market share, and deliver on our commitments.  Given a challenging macro environment, slowing e-commerce trends, and an unpredictable holiday shopping season, we are being appropriately prudent in our Q4 revenue guide. At the same time, we are raising both our full-year and Q4 EPS outlook and expect EPS growth in Q4 to be positive 6% to 8%.\n\nAnd given our commitment and focus on driving continued operational efficiency and earnings leverage, we plan to deliver no less than 15% non-GAAP EPS growth next year. While there are a number of unknowns regarding the macro environment, we can largely control our spend and its implication on earnings growth. Of course, we're also focused on investing for growth, and we are balancing efficient spend with continued investment to drive future top-line growth.  We are excited by the operational initiatives, product enhancements, and new strategic partnerships that position PayPal in a substantially stronger position from when we started the year. I want to thank the PayPal team for the work they do every day to support our merchants and consumers live our values and drive our results.\n\nAnd I'm also pleased that John Kim has recently joined us as chief product officer. He has deep technical and operational expertise with extensive experience overseeing product and engineering teams and has driven customer-focused innovation at scale. We are fortunate to have the chance to work with him to drive this next chapter in PayPal's story. And with that, I'll turn the call over to Gabrielle.\n\nGabs Rabinovitch -- Senior Vice President and Acting Chief Financial Officer\n\nThanks, Dan. I'd like to start off by thanking our customers, partners, and global team for helping us to deliver a great quarter. The strong results we're reporting today demonstrate the continued execution of our strategy to deliver long-term sustainable growth. Our teams are proving our ability to navigate a dynamic operating environment while also staying focused on our key priorities.\n\nWe once again demonstrated our results, combining execution and focus with growth in our core business. Our results reflect our operating discipline, diversification, and resilience. The power of PayPal is the scale of our global franchise. Our investments in innovation are making us stronger and we're excited by what we see as we execute against our growth opportunities.\n\nI share Dan's enthusiasm for our growing relationship with Apple and the rollout of Pay with Venmo on Amazon. We believe we will continue to extend and reinforce our leadership in payments, and we are confident that our competitive positioning with unparalleled scale across our two-sided network will allow us to emerge from this period of economic uncertainty stronger.  We're proud of the quarter we delivered. We surpassed the third quarter financial targets we shared with you in early August and delivered on our commitment of sequential acceleration in our revenue and earnings growth. We're also on track to build upon our operating margin performance in Q3 to deliver non-GAAP operating margin expansion in the fourth quarter on both a year-over-year and sequential basis.\n\nOur teams are energized by the progress we have made and by the increased operational rigor we're bringing to running our business and investing in our priorities. At the same time, the macroeconomic backdrop continues to be complex, and we're focused on taking an appropriately prudent approach to managing our business for profitable growth at scale. This year, we will process nearly $1.4 trillion of payment volume, an increase from $1.25 trillion last year and a 25% compound annual growth rate from $288 billion in 2015. At this massive scale, we are not immune to macro headwinds.\n\nAs we close out 2022 and prepare for the year ahead, we're intensely focused on doing everything within our control to anticipate and mitigate ongoing macro risks and drive robust earnings growth. Given the breadth of our two-sided platform and our strong balance sheet and free cash flow generation, we believe we are well positioned and have the levers available to successfully navigate an economic cycle. We remain committed to meaningful non-GAAP operating margin expansion in 2023 and a significantly stronger non-GAAP earnings growth profile. Before discussing our outlook for the remainder of the year, I'd like to highlight our third quarter performance.\n\nAs Dan mentioned, revenue increased 12.4% on a currency-neutral basis and 10.7% at spot to $6.85 billion with each of these metrics exceeding our guidance. The dramatically strengthening dollar has been an increasing headwind as we move through the year, and we expect this condition to persist in the fourth quarter. Transaction revenue grew 11.2% to $6.23 billion driven primarily by Braintree and Venmo. Other value-added services revenue grew 6.4% to $612 million.\n\nThis performance, relative to last year, resulted from higher interest income on customer store balances, offset by lower credit revenue as we lapped higher-than-normal loan servicing fees. In the third quarter, U.S. revenue grew 14.4% while international revenue increased 6% at spot. On a currency-neutral basis, international revenue increased 9.4%, and excluding eBay, 11.7%.\n\nAdditionally, eBay marketplaces revenue declined 38% to $145 million and represented 2% of our total revenue. Our take rate performance was very strong with both transaction and total take rate improving approximately 4 basis points. Transaction take rate was 1.85% and total take rate was 2.03%. Both transaction and total take rate benefited from gains from foreign currency hedges recorded as international transaction revenue as well as Venmo monetization.\n\nInterest income also benefited our total take rate. Transaction expense came in at 89 basis points as a rate of TPV relative to 83 basis points as a rate last year. This result was largely driven by the increase in the contribution of Braintree volumes, which are predominantly card-funded to our overall mix of payment volume. To a lesser extent, funding mix also contributed to higher transaction expenses from more normalized debit card usage relative to 2021.\n\nTransaction loss at the rate of TPV was 8 basis points versus 9 basis points in Q3 last year. In addition, credit losses were $113 million or 3 basis points as a rate of TPV. As a reminder, in the third quarter of 2021, we released $63 million of credit reserves, which benefited transaction margin and operating margin performance in the prior period by 100 basis points. We ended Q3 with $6.5 billion in gross receivables, reflecting sequential growth of 4%.\n\nThe growth in global pay-later receivables was the largest driver of loan origination. The mix of shorter duration originations from our pay later products and strong performance of our loan receivables portfolio resulted in a reserve coverage ratio of 7.4% compared to 7.3% last quarter and 11.6% in third quarter last year. Transaction margin dollars grew 4%, a reversal from year-over-year declines in the first and second quarters of 2022. Excluding the benefit from the reserve release last year, transaction margin dollars increased 6%.\n\nThis quarter, we began seeing benefits to our transaction expense from leveraging our scale across the network ecosystem. We expect this trend to continue in Q4 and into 2023. In addition, we're making progress in rationalizing non-transaction-related expense growth. In the third quarter, on a non-GAAP basis, these expenses grew 4% year-over-year relative to 17% growth last year, driving 180 basis points of operating leverage.\n\nNon-GAAP operating income also grew 4% year-over-year to $1.53 billion. Importantly, this is the first quarter since Q2 '21 in which we delivered operating income growth. Our operating margin was 22.4%, which was approximately two points better than our outlook provided at Q2 earnings. We're particularly pleased by this operating margin outperformance and look forward to building on this track record of cost prudence as we enter 2023 and beyond.\n\nFor the third quarter, non-GAAP EPS was $1.08, nearly 15% stronger than our outlook. Pretax benefits in Q3 '21 of approximately $0.10 per share created a headwind to EPS growth. Our outperformance relative to our expectations was predominantly driven by the actions we took to increase efficiencies within non-transaction-related operating expenses and improved transaction loss performance. We ended the quarter with cash, cash equivalents, and investments of $16.1 billion.\n\nDuring the quarter, we generated $1.8 billion in free cash flow, bringing year-to-date free cash flow to $4.1 billion. Relative to last year, Q3 free cash flow grew 37%. We consider our balance sheet and cash flow to be competitive differentiators, which provide us with significant optionality for value creation. In the third quarter, we completed an additional $939 million in share repurchases.\n\nYear-to-date, we have now returned $3.2 billion to shareholders, representing 78% of the free cash flow we have generated. Given our conviction in our business relative to its valuation today and its long-term competitive advantages and ability to deliver sustainable value creation, we have taken a more aggressive approach to our capital return program this year. We believe that share repurchase remains an optimal use of capital for our shareholders while allowing us to retain the flexibility to continue investing opportunistically in our business. We now expect to complete an additional $1 billion in share repurchases in the fourth quarter.\n\nAs I discussed during our earnings call last quarter, we've been assessing opportunities for additional credit externalization. We have made progress on this initiative and are committed to securing off-balance sheet funding for a portion of our global pay later portfolio next year. Before I cover our guidance, I'd like to discuss the incremental disclosure that we are sharing this quarter to disaggregate our TPV. In our investor update, we're providing additional information related to our volume mix and how it has evolved over time.\n\nWe believe sharing this detail is helpful for investors to better understand our business trends. I would now like to discuss our outlook for the remainder of the year and our preliminary thoughts for 2023. First, some context on the trends we're seeing and how these are shaping our outlook. As Dan mentioned, overall, we saw U.S.\n\ne-commerce growing in the low single digits in Q3 with deceleration into the close of the quarter. This trend persisted in October. On our platform as well as in third-party data, we have not seen the early start to the U.S. online holiday season that we saw in 2021.\n\nOur guidance contemplates holiday e-commerce ramping through November. Overall, our expectations for holiday e-commerce are consistent with the recent spending forecasts from Adobe, Mastercard, and Salesforce with growth in the low single digits. We are also closely monitoring channel mix between in-store and online as well as the mix of services and goods spending. From a market perspective, the U.S.\n\ncontinues to outperform international, and we are seeing weaker performance in the U.K., our second-largest market. These factors, combined with the broader macro trends, have been incorporated into our revised outlook. We are lowering our full-year currency-neutral revenue expectations by one point and at the midpoint, raising our non-GAAP EPS expectations by $0.16. Given the current uncertainty in the global macro environment, we believe this is an appropriately sensible and prudent approach to our revenue outlook.\n\nThat said, our earnings guidance reflects the resilience and power of our franchise. In raising our EPS outlook again, we're demonstrating our control over operating expenses, the diversification of our business, and the benefits from scale to our operating model. We believe that our ability to raise our earnings guidance in this environment is especially distinguishing relative to other public company guidance we've seen for Q4. For the full year, we now expect revenue to grow approximately 10% on a currency-neutral basis and approximately 8.5% at spot.\n\nFor the fourth quarter, we expect revenue growth of approximately 9% on a currency-neutral basis and approximately 7% at spot. We believe our Q4 and full-year revenue growth guidance is strong given our scale and the macro backdrop. We also expect to deliver non-GAAP operating margin of at least 21% this year. For the first three quarters of 2022, our operating margin has declined year-over-year.\n\nImportantly, in the fourth quarter, we expect this trend to inflect and to deliver non-GAAP operating margin expansion. Our guidance contemplates Q4 operating margin of approximately 22.5%. In addition, we're raising non-GAAP EPS to $4.07 to $4.09 for the year. As we noted entering the year, discrete tax benefits and reserve releases last year in the aggregate benefited 2021 non-GAAP EPS by approximately $0.54 and are a headwind to our EPS growth profile this year.\n\nBased on our expectations for revenue and operating margin in the fourth quarter, we expect non-GAAP EPS of approximately $1.18 to $1.20. We expect to finish 2022 in a stronger position than we started it with greater operating discipline and focus. Dan and I are pleased with our improving execution and we're confident there will be room for continued improvement. However, with our most important weeks in the holiday season ahead of us as well as ongoing macroeconomic uncertainty, we believe it is too early to provide a detailed outlook for 2023 on this call.  That said, as we're planning for the year ahead, our framework currently includes the following assumptions: first, that our overall volumes will continue to grow faster than e-commerce across our core markets, and that we will continue to take market share.\n\nAt the same time, we expect inflationary pressures alongside slowing global growth to weigh on discretionary e-commerce spending, which could continue to be pressured in 2023.  Second, that we will deliver at least 100 basis points of non-GAAP operating margin expansion next year, an improvement from our 50-basis point commitment when we reported results last quarter. And third, our commitment to drive solid growth in earnings per share. Taken together, we believe that our cost savings initiatives and benefits from higher interest rates will enable us to deliver non-GAAP earnings growth of at least 15% next year. We believe this outlook for next year contemplates a sufficiently wide range of revenue outcome.\n\nWe are firmly committed to executing on the operational initiatives we discussed last quarter and are highly confident that we will deliver on our 2023 framework. Finally, from a capital allocation standpoint, we plan to take a similarly aggressive approach to share repurchases in 2023 as we have this year. In closing, despite the many challenges of today's environment, we believe that we are well-positioned to navigate the road ahead. We cannot have more confidence in our people and in the priorities we're executing against.\n\nWe are just beginning to scale several of our newer consumer and merchant experiences and work with several important strategic partners in the ecosystem. For our shareholders, we continue to achieve significant growth while returning capital in the form of share repurchases. And we're confident that our earnings power and strong free cash flow generation will allow us to continue to invest in our business and extend our leadership position. We are completely focused on delivering for all of our stakeholders and look forward to updating you on our progress.\n\nWith that, I'd like to turn the call back to the operator for questions. Briana, please go ahead.\n\nOperator\n\n[Operator instructions]. Your first question comes from the line of James Faucette with Morgan Stanley. Your line is open.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Exciting announcements for sure with Apple, etc. Just wondering on the margins though, can you talk a little bit about how you're approaching next year? Obviously, there's -- as you indicated, Gabrielle, there's a big range of potential scenarios, especially around revenue.\n\nBut you seem fairly confident in your ability to deliver that 100 basis points of margin expansion, which was a little more than we had modeled. So can you talk about, like, what's going into that? Like, what your -- the levers you can pull to make sure you can deliver that and how that translates into that 15% EPS growth. Thanks.\n\nDan Schulman -- President and Chief Executive Officer\n\nJames, it's Dan. I'll start off and then maybe Gabs can fill in around the edges here.  First of all, we do feel quite confident in our ability to raise our EPS for the year and then off of that higher total, generate at least 15% EPS growth, which gets you to about as a first step for us, $4.70 next year. And this is really being driven by being -- taking a very prudent approach to what could happen next year from a macroeconomic perspective.  There are a wide range of scenarios on that. And everybody has an opinion, but we think it is prudent to plan for a difficult economic cycle and have our cost structure be in line with that so that we can deliver robust EPS growth.\n\nOur cost and productivity initiatives are still well underway. I'm really pleased with the execution that we've had over the last several quarters. We've been anticipating a difficult economic environment. The team has taken a lot of action across non-transaction-related opex.\n\nAs we said in our remarks, we expect, in the fourth quarter, that's going to be flat and probably slightly negative as we look ahead. And then as you look into 2023, we see no reason why it will come off of those levels of being flat to slightly negative. If you think about it, our non-transaction opex has traditionally been in the mid-single digits for a long time. During the pandemic, that jumped up to 17% in 2020 and about 20% in 2021.\n\nSo we have plenty of headcount. Our headcount are going to be down at the end of this year from where we started at the beginning. We have a lot of efficiencies as our processes get better and better. We are clearly leveraging our scale with our suppliers as well, whether it be our network partners or others on transaction-related expenses.\n\nAnd we feel very good about delivering at least 100 basis points of operating margin improvement next year. By the way, at the same time, investing in our high-growth, high-conviction areas, checkout, digital wallets, and Braintree, we think this is a time where market share leaders get stronger. We want to take advantage of this environment that we're in. We are already seeing some of the investments we're making in those areas pay real dividends in our ability to satisfy our customers.\n\nAnd we think this is an opportunity for us to take share going forward. We're in a rising interest rate environment. That's a tailwind for us. For many of our competitors, it's a headwind.\n\nAnd we just think there's opportunities for us to operate more efficiently and effectively and invest and continue to take market share. So really pleased with the focus and the commitment from the team, making real progress on the cost side and the productivity front. And we'll continue to do so as we go into next year. Next question, operator.\n\nOperator\n\nYour next question comes from Jason Kupferberg with Bank of America. Your line is now open.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nI wanted to talk about the top-line outlook for Q4, currency neutral. We're looking at 9% revenue growth. I know last quarter, we were thinking more like 14%, obviously, linked to the softer TPV outlook. Can you just walk us through perhaps pieces of that bridge, what you thought last quarter versus what you're thinking now for Q4 given the context of the softer macro? Thank you.\n\nGabs Rabinovitch -- Senior Vice President and Acting Chief Financial Officer\n\nYes. You bet, Jason. So you're right. We took down our full-year revenue guidance by about one point and at the same time, of course, raised our EPS at the midpoint by $0.16.\n\nWe had a strong Q3. And obviously, we delivered on all of our commitments. But at the end of the quarter, we started to see some slowing and that came right at the very end.  In October, in addition, we didn't see the early start to the holiday season that we've seen in 2021. And so we brought down our internal forecast for U.S.\n\ne-commerce growth commensurately with that. And so in the middle of the year, we were thinking about U.S. e-commerce growth for the fourth quarter in the mid-single digits. That's now come down to low singles.\n\nThat's pretty consistent with what we see from other third parties and that really is the predominant driver of the change in our guidance. Now in conjunction with that, similar to earlier this year, when we took down some of our expectations around initiatives in conjunction with a lower growth environment, we've done the same. And so that's also contributing to the 9% FX-neutral expectation on Q4. But of course, we're raising EPS overall.\n\nAnd in the quarter, we expect to deliver about 75 basis points of op margin expansion. So we continue to deliver on our efficiencies despite the slower growth environment.\n\nDan Schulman -- President and Chief Executive Officer\n\nAnd I think you'll also be seeing any report that comes out on the macroeconomic environment reaching an all-time high. The inflation report in the Eurozone was not great. And you're seeing in countries like the Netherlands, which is so conservative, a 17% inflation rate; U.K., which is our second largest market, is really suffering. And our view is that we're still going into winter.\n\nEnergy costs are going to go up. And the low-end income levels and middle-income levels are beginning to cut back on their discretionary spend. They're spending so much more on food, on energy, on gas, on rent. And we're beginning to see that impact those segments of the market.\n\nThe high end of the market, by the way, is still spending quite freely and we're seeing that also in our results. The other thing is we did expect quite a number of live-to-site implementations on Braintree in the fourth quarter, almost a full point of growth that are being pushed into next year. So we'll capture that revenue. We just won't capture it this quarter.\n\nSo I think as Gabs said, there are certain things we can control, as our expenses, where we're investing, how we're doing in those investments. And there, I think the team is doing an excellent job. And there are certain things like the macro environment that we can't control but we need to be ready in a wide range of scenarios. And that's what we're laying out for you, a firm commitment around at least 15% EPS growth and operating margin expansion and continued investment in our high-growth, high-conviction areas.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nThat makes sense. Thanks, guys.\n\nDan Schulman -- President and Chief Executive Officer\n\nYes.\n\nOperator\n\nYour next question comes from Colin Sebastian with Baird. Your line is open.\n\nColin Sebastian -- Baird -- Analyst\n\nThanks very much. Obviously, it's a fluid environment. But maybe following up the last question, I think it would be helpful to know for context how you're thinking about the overall e-commerce environment into next year, how that impacts the 2023 framework, and including the underlying volume or revenue growth assumptions that you have to get to those targets. Thank you.\n\nDan Schulman -- President and Chief Executive Officer\n\nSo let me start off then Gabs can come in. So first of all, Colin -- look, I think it's a little bit too soon to have strong visibility into what 2023 will look like. Typically, in a quarter, when you're a third of the way through it, you have pretty good visibility into what's going to happen in the quarter. But in the fourth quarter, that's not the case.\n\nIt's really all about the holiday season and what happens in a five- or six-week period that's still ahead of us. But based on what we're seeing right now, based on external reports, based on our conversations with other e-commerce players, you saw another very large e-commerce player take down their revenues in the fourth quarter, that we think that e-commerce is going to be pretty muted in the fourth quarter. And right now, we are not planning that, that comes back for any reason as we look into 2023. I think baseline e-commerce growth will be subdued, but I fully expect that we will outpace it.\n\nWe've got quite a number of Braintree live to site with very large merchants coming up. Our checkout and digital wallet improvements are quite strong right now. And I'm really pleased with the indications from those initiatives. Obviously, Amazon, we'll see what happens with that but we have a lot of hope for that.\n\nAnd our deal with Apple will certainly be meaningful over at least in the medium term on that. So still too early to call. We're going to be very conservative on our top-line assumptions but we're going to build a ton of resilience into our model. We'll adjust to potential lower growth environments.\n\nWe can keep our opex very well controlled, we've demonstrated that now. And we'll continue to enable operating margin expansion next year. So -- and if the macro picture gets better, these numbers could improve dramatically. But we're anticipating a difficult economic cycle and preparing for that so that we can invest and deliver robust EPS growth at the same time.\n\nColin Sebastian -- Baird -- Analyst\n\nThank you very much.\n\nOperator\n\nYour next question comes from Darrin Peller with Wolfe Research. Your line is now open.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, thanks, guys. Look, it's really helpful to have the volume breakdown by PayPal Braintree more. I know you said -- I think you said 4% core PayPal growth and you're saying you're expecting that it'll be in line with the market. If you could just touch on the assumptions and drivers of PayPal core engagement growth and what you can do there.  It obviously looks like you're making progress around initiatives like passkey or the Venmo Amazon partnership or obviously Apple.\n\nAll that should help, I assume, on the checkout experience, but maybe we can have some more color on how much room there is to improve that experience and what that can mean.\n\nDan Schulman -- President and Chief Executive Officer\n\nYes. Sure. So I'll dive really quickly into both checkout and a little bit on what we're seeing on digital wallet. So as you know, Darrin, we're already the leader in branded checkout.\n\nI mean we have eight times the footprint of the next closest digital wallet. Consumers are twice as likely to spend online when they see the PayPal button. 80% of the 1,500 largest online retailers across U.S. and Europe accept us and our auth-rate right now is 600 basis points above the market average.\n\nLike, for every 100 transactions, PayPal is going to improve six more than traditional card networks.  But obviously, as we've talked about many times, we can do a lot more here. And one, we've improved customer perceived latency by 40% in the last 12 months. Our uptime and availability has gone up by another nine. We're approaching five nines of availability.\n\nAnd when we're doing in-app, our early indications from in-app with the mobile SDK is that conversion rates increase between 3% and 10%. Again, it's early days on that but imagine how significant that improvement is.  On the authentication side, passkeys is a very big deal. Passkeys are going to be accepted, not just with Apple. We're integrating through iOS on passkeys initially.\n\nBut Google and Microsoft are also enabling passkeys. And that basically enables authentication through biometrics fully embedded into the OS. It eliminates the need for weak or reused credentials. It removes the frustration of having to remember a password.  And like one of our recent surveys, like 44% of consumers have abandoned an online purchase due to a password issue.\n\nSo that passkey could be a very meaningful piece of conversion uplift for us. And then, of course, we're moving into vaulting an accelerated checkout. And I've mentioned this already on our digital wallet stats but it's up 50% of our base now, plus it's using our digital wallets. That's up over 13% year-over-year.\n\nWe're seeing much-reduced churn on that 25% to 33%, 50% greater ARPU, 60% more checkout transactions. We're seeing a lot of our new products in the wallet gain a lot of traction. I mean, savings is early. It's got a 3% APY, but we're seeing a 20% lift in ARPA for those who come into our savings program, 30% lift in checkout.\n\nAnd even things like just like our new three, two card because cards are an important part of our strategy. That's off to an incredibly strong start. We've acquired more accounts in the first six months of that launch than we did in the previous 22 months with our 2% cashback offer. So a lot of things to be excited about in terms of what we can do with our initiatives.\n\nAnd that's why we're investing heavily in them as well as returning operating margin performance and EPS performance to our investors.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nUnderstood. Thanks, Dan.\n\nDan Schulman -- President and Chief Executive Officer\n\nYes. You bet.\n\nOperator\n\nYour next question comes from Lisa Ellis with MoffettNathanson. Your line is now open.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nHey, good afternoon, guys. Good to hear your voice. Dan, I just wanted to follow up on the Apple-related announcements that you made or highlighted on the call. Certainly, some good progress there.\n\nCan you talk a bit more about what you think this unlocks for PayPal in terms of better serving both your merchants and your consumers? Are there any aspects of this relationship that you could think could be more impactful perhaps over time? Like, where could it go? And then also could you talk a little bit about how that relationship dynamic is, how collaborative this relationship is with Apple? Thank you.\n\nDan Schulman -- President and Chief Executive Officer\n\nYes. Well, first of all, I think the agreement is quite important strategically. Our two companies have been working on that together for quite some time. I think there are three areas that this really helps unlock.\n\nI mean, first of all, enabling our merchants to use their iPhone without any incremental dongle or a point-of-sale terminal around that. All they need to do, if they have a business profile on Venmo or PayPal, is give us three pieces of information: their mobile phone number, their birthday, and either their social security number or their tax ID. That's it. And then they're set up to receive payments in the offline world.\n\nAnd our payment rate there is 2.29% plus $0.09. That is a really competitive rate versus others in the market. And we think this can be really especially significant for the millions of customers that have Venmo business profiles and allow us to compete aggressively in an omnichannel world in there. So I think there's a big unlock on that.  Second, adding Apple to our unbranded flows.\n\nAs you know, Apple is already on Braintree and on our unbranded flows. But that's just going to make us well more competitive as we go out and sell PayPal commerce platform further down into middle market and smaller businesses. It enables us to sell PayPal commerce platform more completely. It enables us to offer more choice to our merchants, which is something we've been focused on for years and years now.\n\nAnd it also enables the very best integration of our PayPal-branded and Venmo-branded checkout buttons. And then finally, the ability for our consumers to add their PayPal and Venmo credit and/or debit card into Apple Pay in the U.S. or to use at anywhere Apple Pay is accepted is probably a bigger deal than most people realize. We've been doing this with Google Pay for quite some time.\n\nAnd we've seen, for instance, that Google Pay users in Germany, when they add their PayPal credentials there, there's a 20% increase in their branded checkout transactions. And so we also have the ability to create temporary digital cards that can even allow us to bring our buy now, pay later from branded checkout online to everywhere consumer shops. And so I think there are a lot of really nice unlocks. Apple and PayPal have been working closely on this.\n\nWe're both excited to put these into the market and dedicate resource to assuring that they're successful and just create a better value proposition for our mutual customers.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nPerfect. Thank you.\n\nOperator\n\nYour next question comes from Tien-Tsin Huang with J.P. Morgan. Your line is now open.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nThanks, Dan and Gabs. Just any more clarity on the, at least, part of the $1.3 billion in cost efficiency next year? Is -- I'm just curious if that's more likely to come from cost-cutting or maybe less investing. How quickly also can you pull the levers to deliver on the 15%? Thanks.\n\nGabs Rabinovitch -- Senior Vice President and Acting Chief Financial Officer\n\nYes, you bet. So when we talked last quarter about driving at least $1.3 billion in cost savings next year, nearly half of that was coming on the transaction expense side with the other half coming from non-transaction-related opex. I'd say in addition to thinking we can do more, I think the balance weighs more in favor of non-transaction-related opex than it does TE at this point. And some of that is based on the fact that with a slightly lower growth environment, some of the benefits that we derive on the TE side are really from -- are really volume-based in nature.\n\nAnd so if those volume expectations come in a bit, we would be driving more on the non-transactional-related opex side. That said, I think we see a lot of room to go in terms of our initiatives there.  And so just sort of taking a step back, last year, our non-transaction-related opex grew by 20%. That was on top of about 17% growth in 2020 over 2019. And so this year, we're spending about $2.5 billion more in our non-transaction-related opex buckets than we did in 2019.\n\nAnd we see an opportunity to be a lot more productive and drive more savings there. And so you'll see this year the marketing dollars coming down. They came down again in Q3 about 1% after coming down considerably more than that in Q2. We'll end up the year with low single-digit non-transaction-related opex growth.\n\nAnd I expect next year, we'll do better than that. I'd expect it to be closer to flat, if not a decline year-on-year. So we're looking for the opportunities we can to continue to drive operating margin expansion even in a lower growth environment. And we think that the savings we're finding are really sustainable.\n\nAnd it's a lot more about productivity and using our scale to benefit us. And so we think we emerge from this environment much stronger as a result of the work that we're doing.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nUnderstood. No, that's all useful. And I got to say thank you for Slide 6, including the CAGR stuff. That's great to have.\n\nIs that a one-timer, and I'll jump off, in terms of disclosure?\n\nGabs Rabinovitch -- Senior Vice President and Acting Chief Financial Officer\n\nWe will continue to provide updates. I don't know that we're committed to doing it on a quarterly basis, but we'll continue to update on the mix of our TPV as it's quite important to understanding the performance of the business. We'll take the next question.\n\nOperator\n\nWe have time for one last question from David Togut with Evercore ISI. Your line is now open.\n\nDavid Togut -- Evercore ISI -- Analyst\n\nThanks so much for squeezing me in. You've announced a number of new omnichannel initiatives, whether it be the announcements with Apple today, the rollout recently of PayPal Zettle terminal in the U.S. and, of course, continued expansion of your BNPL products. Can you help us think about what all the omnichannel initiatives might mean over time for revenue? And then sort of broadly, what are the costs associated with expanding omnichannel? You've talked about freeing up investment dollars from your cost-reduction initiatives.\n\nThanks so much.\n\nDan Schulman -- President and Chief Executive Officer\n\nYes. I'll start on that, David. So BNPL is an integral part of our checkout strategy. We know if we go into upfront presentment with buy now, pay later, if somebody puts us on their product pages as opposed to checkout, that our share of checkout goes up quite dramatically.\n\nAnd as you saw and as you heard from me, it's growing by leaps and bounds. We're approaching 300,000 upstream presentments. We're one of the top players in any market two years after launch, 150 million different loans at over, by the way, 2.2 million unique merchants. And what I didn't say in my script is it drives a halo spend of greater than 20%, and 90% plus of that is incremental to us.\n\nAnd so not only do we have a great value proposition, but we have a real competitive advantage in knowing our customers. 90% of the people that use buy now, pay later, we have history on. And so our loss rates remain low and stable. And today, we're live in eight markets.\n\nAs I mentioned when Lisa asked your question, we think that the ability to take buy now, pay later anywhere you want to shop, whether that be online or in-store, is a really exciting part of the evolution of buy now, pay later as part of being able to put a branded debit or credit card, PayPal or Venmo branded debit card into Apple Pay, we can also provision a digital buy now, pay later for somebody going in stores so they can pay in-store using one of our buy now, pay later solutions. And we are also now linking our card strategy, which is a very important part of our in-store. We are moving away from going heavy into QR and doing much more with cards. But imagine paying for something in-store and then coming back into your PayPal app and deciding, OK, I paid for that.\n\nBut now I want to pay for that in four installments or split that payment with rewards or fiat currency. And so we're really trying to imagine buy now, pay later as being fully omni as a capability. And we think that will unlock quite a bit for us as we look forward. Thank you, David, for that.\n\nAnd I want to thank everybody for the time, for your great questions. We look forward to speaking with all of you soon. And again, thanks for your time. Take care, and bye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGabs Rabinovitch -- Senior Vice President and Acting Chief Financial Officer\n\nDan Schulman -- President and Chief Executive Officer\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nColin Sebastian -- Baird -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nDavid Togut -- Evercore ISI -- Analyst\n\nMore PYPL analysis\n\nAll earnings call transcripts"
}