{
  "companyName": "Alibaba Group Holding Ltd.",
  "companyTicker": "BABA",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/alibaba-group-holding-ltd-baba-q2-2023-earnings-ca/",
  "content": "Alibaba Group Holding Ltd. (BABA -1.17%)\nQ2 2023 Earnings Call\nNov 17, 2022, 7:30 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. Thank you for standing by. Welcome to Alibaba Group's September quarter 2022 results conference call. [Operator instructions] I would now like to turn the call over to Rob Lin, head of investor relations of Alibaba Group.\n\nPlease go ahead.\n\nRob Lin -- Head of Investor Relations\n\nThank you, and good day, everyone. Welcome to Alibaba Group's September quarter 2022 results conference call. With us are Daniel Zhang, chairman and CEO; Joe Tsai, executive vice chairman; Toby Xu, chief financial officer. This call is also being webcast from the IR section of our corporate website.\n\nA replay of the call will be available on our website later today. Now let me quickly cover the safe harbor. Today's discussion may contain forward-looking statements. Forward-looking statements involve inherent risks and uncertainties that may cause actual results to differ materially from our current expectations.\n\nFor a detailed discussion of these risks and uncertainties, please refer to our latest annual report on Form 20-F and other documents filed with the U.S. SEC or announced on the website of Hong Kong Stock Exchange. Any forward-looking statement that we make on this call are based on assumptions as of today. And we do not take any obligation to update these statements, except as required under applicable law.\n\nPlease know that certain financial measure that we use on this call, such as adjusted EBITDA, adjusted EBITDA margin, adjusted EBITA, adjusted EBITA margin, non-GAAP net income, non-GAAP diluted earnings per share or ADS, and free cash flow, are expressed on a non-GAAP basis. Our GAAP results and reconciliation of GAAP to non-GAAP measures can be found in our earnings press release. Unless otherwise noted, growth rates of all stated metrics mentioned during this call refer to year-over-year growth versus the same quarter last year. In addition, during today's call, management will give their prepared remarks in English.\n\nA third-party translator will provide simultaneous Chinese translation at another conference line. Please refer to our press release for details. During the Q&A session. We will take questions in both English and Chinese, and a third-party translator will provide consecutive translation.\n\nAll translation are for convenience purposes only. In the case of any discrepancy, management statement in the original language will prevail. With that, I will turn to call to Daniel.\n\nDaniel Zhang -- Chairman and Chief Executive Officer\n\nThanks, Rob. Hello, everyone. Thank you for joining our earnings call today. We delivered a solid quarter in a macro environment full of uncertainty.\n\nThe ongoing resurgence of COVID-19, geopolitical tension, inflation, and currency depreciation, the convergence of all these forces had created considerable difficulties for business operations. Despite these challenges, Alibaba's non-GAAP EBITA increased 29% year over year, as we continue to enhance our operational efficiencies. This is the result of our pursuit of high-quality development and, more importantly, demonstrates the resilience of the Alibaba business across systems. In the China domestic consumer market, Taobao and Tmall GMV saw a low single-digit year-on-year decline this quarter.\n\nBut the user traffic remained remains stable. However, consumption appetite was weak, and we saw a drop in purchasing frequency. The resurgence of COVID has affected one area after another, resulting in abnormal or suspended logistic service in different places. This hurt merchant operations and consumer logistic experience.\n\nIn terms of demand, the decline in categories, such as apparel and consumer electronics, slowed quarter over quarter. Interest-based categories, such as outdoor recreation and pet care, and health and wellness-related categories, recognized positive growth. In this challenging environment, we have achieved relatively positive results, show a committed execution of the following strategies. Number one, we work to ensure our user traffic population remains stable DAU or MAU by continuing to strengthen our user engagement.\n\nAfter many years of operation, Taobao and Tmall is now deeply entrenched in our users' mind as the shopping destination. We are focused on user engagement on our platform by enhancing the customer journey across search, algorithm-driven discovery recommendations, livestreaming, and other engagement features. We stimulated consumption interest and drove conversion by highlighting the factors that influence purchase decisions through short-form video, photos, texts, and other means of communication. Number two, we further consolidate the scale and the stickiness of our most valuable consumer group.\n\nFor the 12 months ended December 30, 2022, the number of consumers who each spent over RMB 10,000 on top on Taobao and Tmall remain around 124 million, with a retention rate of 98%. 88VIP membership population held steady at 25 million this quarter, with solid membership retention and growth in GMV contribution. Number three, we improved consumer satisfaction by continually investing in customer service during and after services, and the logistics service experiences, such as doorstep delivery of orders as required. Our latest consumer satisfaction survey showed improvements in NPS scores relating to logistics and post-sales.\n\nDuring our recent 11.11 Global Shopping Festival, Taobao and Tmall's total GMV was in line with the performance last year during the same period. Initial fruits of the operation strategies outlined just now were seen during November 11. More than 600 million users engaged with our November 11-related contents, a single-digit growth year on year. Although, the total number of buyers declined compared to the same period last year, the average GMV per person increased.\n\nAs for our consumer profile, more than 98 of our 88VIP members bought something during November 11 season. Moreover, the contribution by 88VIP members to the total GMV continue to grow. Regarding product categories, consistent with what we observed during the rest of the quarter, interest-based categories, such as outdoor recreation and pets, and health and wellness-related categories, saw positive growth. Consumer electronics also enjoy positive growth during November 11 season.\n\nHowever, there are a few factors that negatively impacted our 11.11 performance. Number one, average temperature across China was much warmer than usual for that period -- for that time of year. And the delay in seasonal change weakened the consumption appetite for apparel even more in an environment impacted by COVID. And thus, the apparel category suffered.\n\nNumber two, starting in October and through the 11.11 campaign period, nearly 15% of delivery areas across China experienced abnormal or suspended logistic services. This had a significant impact on the merchant ability to fulfill orders on time and delivery company's ability to make regular deliveries. But recently, we are seeing improvements. Number three, 11.11 has become an event celebrated and embraced by the entire society.\n\nGiven the uncertainties relating to the COVID-19, merchants were especially keen to take advantage of this opportunity to capture as much growth as possible across every available channel. Objectively speaking, they offer the consumer more choices, both online and offline. This quarter, the decline in consumer management revenue was larger -- was higher than the decline in overall GMV. I would like to share the reasons.\n\nThe first is the higher rate of order return because of, A, order return due to COVID-related impact on fulfillment and delivery; B, a higher order return rate that accommodates livestreaming-driven sales; C, the increasing convenience of making returns and improvements in user experience in returns handling on our platform. These three reasons collectively contributed to the rise in order return rate across the platform. Take rate calculation does not account order returns. If it was accounted for, our take rate actually remain consistent.\n\nSecond, page views from algorithm-driven discovery recommendations grow, but our monetization of traffic was less efficient, resulting in a lower take rate in the short term. Looking forward, we will adapt to the change in our user traffic composition and introduce better monetization products to ensure the long-term stability of our platform take rate. In our local consumer services segment, Ele.me, proactively adjusted its business operations strategy to focus on user growth and retention on its mobile app, and it continued to grow its market presence in key cities. At the same time, it continued to enhance operational efficiency, and unit economics continue to see improvement.\n\nThis is primarily due to the rise in average order value, leading to an increase in revenue and a reduction in logistic costs for order fulfillment. Amap launched a new version of its maps this quarter, together with a series of new features, including a 3D city map, car lane level growth navigation, forecasting of traffic light signals, and road navigation for staying in the shade out of the sun, so on and so forth. User population and stickiness continue to strengthen in Amap, and the new historical record of 220 million DAU was registered during the week of the National Day holidays. On top of its map navigation, the services offered by Amap related to getting to destination, which includes road failing, hotel booking, gas station, and EV recharging stations, are all experiencing rapid development, with both service users and order volume enjoying faster growth.\n\nCainiao's various business saw a robust growth in this quarter, and there were clear improvements in cost efficiency. Cainiao Post network grew by 20% year on year and now has more than 170,000 locations. It has comprehensive coverage in residential communities, school campuses and the rural villages across China. Cainiao Post has become an important touch point for serving consumers.\n\nFor overseas markets, Cainiao continued to actively build logistic hubs and nodes for further enhance its global logistic network service capability and efficiencies. In overseas market, the rise in logistics costs due to inflation and currency deterioration against the U.S. dollar has contributed to order volume declines of 12% year on year in our cross-border export business, AliExpress. In Southeast Asia, other order volume declined 6% year on year as COVID-related restrictions were lifted and offline shopping resumed.\n\nTrendyol's order volume grew over 65% year-on-year on the strength of its e-commerce business and a fast-growing local consumer service. For AliExpress and Lazada, we are taking steps to adjust our business model and investing in creating user value rather than just scaling. We are also continuing to strengthen our capabilities in logistics and supply chain. We believe that developing and investing in these capabilities will be meaningful to ensure the sustainable long-term development of our abilities to serve the overseas consumer market.\n\nIn our cloud segment, Alibaba Cloud revenue growth was 4% year on year this year. Through structural adjustments over the past few quarters, Alibaba Cloud's revenue structure is now healthier and more sustainable. Public cloud revenue grew double digit year on year this quarter, while hybrid cloud declined. In the interest of pursuing high-quality growth, we proactively control the development of our business that only resale hosting infrastructure that has been commoditized in the market.\n\nLooking at our revenue by industry. Non-internet industry revenue grew 28% year over year. Its contribution to total revenue increased from 53% to 58% quarter over quarter. The fastest growing sectors, including financial services, automotive, telecom, and public services.\n\nLooking ahead, Alibaba Cloud will leverage its proprietary cloud computing and big data processing capabilities to launch a range of industry solutions with relevant partners for advancing China's industrial digitization. At the Apsara Conference in early November, we unveiled many important technological achievements. It included our cloud infrastructure processing unit, i.e., CIPU, and an open-source platform under the Model-as-a-Service named ModelScope. These will serve important purposes in Alibaba's cloud future development.\n\nIn this environment, full of uncertainty, our wide-ranging efforts in cost reduction and efficiency improvement measures are beginning to bear fruit. Businesses such as Taobao Deal, Taocaicai, Ele.me, Amap, Lazada, and Youku have significantly reduced their losses. We will continue to focus on the steady improvement of business quality and on investing in building capabilities to provide customer core value rather than pursuing short term business growth or user scale. As China enters an area of high-quality development, we will also enter a stage of high-quality business operations.\n\nDuring the eight years from Alibaba's IPO in September 2014, the quality and the scale of our business has improved significantly. Alibaba's revenue today is 12 times what it was during the same period in 2014. Adjusted EBITA is 4.5 times, what it was during the same period in 2014. Free cash flow is four times that of what it was in 2014.\n\nOver the past eight years, China's GDP has almost doubled from RMB 59 trillion in 2013 to RMB 114 trillion in 2021. We are confident about the future, and we will continue to execute our share buyback program. As of November 16, we have utilized approximately $18 billion to date toward share repurchase under our existing $25 billion program, with $7 billion more to go. In addition, our board has authorized us to upsize our existing share repurchase program by another $15 billion as a tangible action toward enhancing shareholder return.\n\nWe remain confident about our sales and even more about the future, no matter the ups and downs. We believe in the prospects of China's economic and social development. We believe Alibaba's development goals are highly aligned with China's long-term goals. We believe Alibaba can play an important role in the digitalization process in China and around the world.\n\nWe have taken note of the latest adjustment in China's COVID-related policies and proactive commentary from relevant government regulators about promoting the digital economy and high-quality development of platform businesses. We believe that COVID will ultimately pass our society. Our economy and our lives will eventually return to normal. And that the massive potential of China, as the world's second largest economy, will be further unleashed.\n\nLast but not least, we believe that platform economy that Alibaba is part of can make unique and valuable contributions toward serving small and medium businesses, creating employment and pursuit of better lives. Thank you, everyone. Let me pass the microphone to Toby, who will share the financial results with you.\n\nToby Xu -- Chief Financial Officer\n\nThank you, Daniel. Let me start with financial highlights for the quarter. This quarter, our total revenue was RMB 207 billion, an increase of 3% year over year. Income from operations for the quarter was RMB 25.1 billion, an increase of 68%, or RMB 10.1 billion year over year, mainly driven by increase in adjusted EBITA of RMB 8.1 billion and decrease in share-based compensation expense RMB 2.3 billion.\n\nDuring September quarter, we have continued to improve operating performance of our loss-making businesses by enhancing operating efficiency and optimizing costs that resulted in 29% year-over-year increase in adjusted EBITA to RMB 36.2 billion. Overall adjusted EBITA margin improved by 3 percentage point to 17%. Now, let's look at the cost trend as a percentage of revenue, excluding SBC. Cost of revenue ratio remained stable at 63% in September quarter.\n\nOur direct sales businesses and logistics services continued to grow, driving up our cost of inventory and logistics. But we were able to keep our cost of revenue ratio stable, primarily through optimizing traffic, acquisition, and improving subsidy efficiency. Product development expense ratio remained stable during the quarter. Sales and marketing expenses ratio increased a 2 percentage point year over year to 11%, reflecting our continued efforts in optimizing user acquisition and user retention spending across our businesses.\n\nGeneral and administrative expenses ratio remained stable at 4% in September quarter. Non-GAAP net income was RMB 33.8 billion, an increase of RMB 5.3 billion year over year, mainly due to increase in adjusted EBITA, partially offset by decreasing equity pickup of our equity method investees results. Our GAAP net loss was RMB 22.5 billion, a decline of 25.8 billion year over year, primarily due to the increase in net loss arising from changes in fair value of our equity investments, partly offset by increase in our non-GAAP net income. As of September 30, 2022, we continue to maintain a strong net cash position of RMB 323 billion, or $45 billion.\n\nOur strong net cash position is supported by healthy cash flow generation. In September 2022 quarter, cash from operating activities was RMB 47 billion and free cash flow were RMB 36 billion, respectively, which were up by RMB 11 billion and RMB 13 billion versus a year ago. Majority of the difference between operating cash flow and free cash flow is operating capex and RMB 11 billion, down by RMB 1.7 billion versus a year ago. Net cash outflow for investments and acquisition activities, net of inflow from disposals, significantly reduced to RMB 2.4 billion compared to RMB 21.5 billion in the same period last year.\n\nImportantly, on the current market conditions and given the confidence we have in the long-term sustainability of our business, we have been repurchasing our shares aggressively. For fiscal first half ended September 30, 2022, we repurchased approximately 62.9 million of our ADS for approximately $5.6 billion, which is equivalent to about 70% of our free cash flow during the period. From October 1st to November 16th, we have repurchased another $2.6 billion in ADS on our share repurchase program. Our strong balance sheet and free cash flow give us the flexibility to execute this share repurchase program with confidence.\n\nNow, let's look at our second results. Revenue from China commerce segment in September quarter was RMB 135 billion, a decrease of 1% year over year. Customer management revenue decreased by 7% year over year to RMB 66.5 billion. Taobao and Tmall physical goods paid GMV declined by low single digits.\n\nCustomer management revenue is composed of advertising and commission revenue. Within the advertising, search advertising revenue continued to observe positive growth as it provides consistent return for merchants, while nonsearch advertising is negatively impacted by overall macro conditions and other factors. Commission revenue also declined more than that of Taobao and Tmall-paid GMV due to higher order cancellations. Direct sales and others revenue grew 6% to RMB 65 billion, primarily driven by strong growth of our Freshippo and Alibaba Health's direct sales businesses.\n\nChina commerce segment adjusted EBITA increased by RMB 2.6 billion to RMB 44 billion in the quarter. The improvement reflected significant loss reduction from Taobao Deals, Taocaicai, and Freshippo, which, on combined basis, reached RMB 4.9 billion in September quarter. Segment EBITA margin improved 2 percentage points year over year to 32% during this quarter. Secondly, EBITA margin can be further segregated into three types of businesses.\n\nFirst, our existing marketplace business, including Taobao and Tmall continued to exhibit stable EBITA margin year over year. Second, combined EBITA margin of our direct sales businesses continues to improve, which was primarily driven by Freshippo during the quarter. Vast majority of Freshippo's existing stores have achieved cash flow positive. Lastly, new businesses, including Taobao Deals and Taocaicai significantly reduced losses year over year, as previously mentioned.\n\nOur international commerce segment revenue in September quarter was RMB 15.7 billion, an increase of 4% year over year. Revenue from international commerce retail business increased by 3% to RMB 10.7 billion. The increase was primarily driven by Trendyol as a result of its strong order growth of over 65%, partly offset by a decrease in AliExpress order as a result of challenging -- challenges faced in cross-border e-commerce demand in Europe due to the depreciating euro and increasing logistics costs. Revenue from our Alibaba.com wholesale business grew 6% to RMB 5 billion.\n\nThe increase was primarily due to resilient 8% growth in value of transactions completed on Alibaba.com that led to an increase in revenue generated by cross-border-related value-added services. International commerce segment adjusted EBITA loss narrowed by RMB 1.5 billion to RMB 960 million in September quarter. The significant loss reduction year over year was primarily contributed by the reduced losses from Lazada and Trendyol. Lazada has continued to improve monetization rate, as well as enhancing operating efficiency.\n\nDuring the quarter, loss per order for Lazada narrowed by over 25% compared to the same period last year, while Trendyol's improvement is a combination of strong revenue growth despite forex headwinds as well as enhanced operating efficiency. Our local consumer service segment revenue in September quarter grew 21% to RMB 13 billion, primarily driven by strong revenue growth of Amap, as well as higher average order value and more efficient use of subsidies that were contra-revenue of Ele.me. Local consumer service adjusted EBITA loss reduced by RMB 3 billion year over year to RMB 3.5 billion. Most of the loss reduction was driven by Ele.me business, while rest of the other businesses also recorded reduced losses.\n\nEle.me continued to improve its unit economics per order by increasing average order value, reducing delivery cost per order, and optimizing user acquisition spending. Its UE continued to improve year over year and remained positive this quarter. Revenue from Cainiao after intersegment elimination grew 36% year over year to RMB 13.4 billion, primarily contributed by the increase in revenue from domestic consumer logistics services as a result of service model upgrade since later 2021 to enhance customer experience. And also, the international fulfillment solution services revenue increased.\n\nIn September quarter, 73% of Cainiao's total revenue was generated from external customers. Cainiao recorded adjusted EBITA profit of RMB 125 million in September quarter, an increase of RMB 440 million year over year. Revenue from our cloud segment after intersegment elimination was RMB 20.8 billion in September quarter, an increase of 4%, mainly driven by healthy public cloud growth, partially offset by declining hybrid cloud revenue, as we continue to drive high-quality recurring revenue growth. Revenue growth for noninternet industries continue to accelerate, growing 28% and contributed 58% of overall cloud revenue.\n\nStrong revenue growth of the internet industries was driven by financial services, telecommunication and public services industries. Revenue from customers in internet industry declined about 18% that was mainly driven by declining revenue from the top internet customers that has gradually stopped using our overseas cloud service for its international business, online education customers, as well as softening demand from other customers in China internet industry. Adjusted EBITA of cloud segment, which comprised of Alibaba Cloud and DingTalk, was a profit of RMB 434 million in September quarter, increased by RMB 38 million year over year. Revenue from our digital media entertainment segment in September quarter was RMB 8.4 billion, an increase of 4%, primarily due to the increase in revenue from Alibaba Pictures, Youku, which was partly offset by a decrease in online games business revenue.\n\nAdjusted EBITA was a loss of RMB 117 million, reduced by RMB 814 million year over year, primarily driven by narrowing of losses from Youku and improved profitability of Alibaba Pictures. Youku continues to improve operational efficiency through disciplined investment in content and production capability. This year-over-year losses have been narrowed for six consecutive quarters. Over the past several months, we have been preparing for a primary listing in Hong Kong.\n\nDuring this process, we are closely monitoring and taking into account various factors, including changing market and other external conditions. Before our conversion to primary listing in Hong Kong, we also need to formulate and submit a new employee stock ownership program to our shareholders for approval in order to comply with the newly amended rules in Hong Kong. The new ESOP program will continue to align the development of our company with the interests of our long-term shareholders. Accordingly, we will not complete the primary conversion before the end of 2022 as initially planned.\n\nWe will continue to evaluate the various factors during this process and update our investors in due course. To wrap up, since I've taken up the CFO role earlier this year, I've met many shareholders, and I really appreciate all of your feedback. As I have communicated to many of you, we will proactively execute our capital allocation strategy to create and unlock our company's intrinsic value. We consider three important factors.\n\nFirstly, we will be focused. We will not only continue to execute our three growth pillar strategy, but we'll also prioritize growing businesses that improve our medium- to long-term revenue growth and profitability profile. We remain confident of the growth prospects of our businesses, many of which are leading players in their respective markets. Second, in order to optimize our capital resources, we will continue to be more selective in M&A activities, monetize less strategic investments, and unlock the value of selected subsidiaries.\n\nLastly, we want to better align our business performance to the interest of our long-term shareholders. During each of fiscal year '22 and fiscal first half '23 period, we have deployed around 70% of free cash flow to share buyback. As of November 16, 2022, we had repurchased approximately $18 billion of our shares and our existing $25 billion share repurchase program. In addition, our board of directors has approved to increase our existing share repurchase program by another $15 billion and extended the program through the end of March 2025.\n\nCurrently, we have an unutilized amount of 22 billion and our upsized and extended share repurchase program. We hope our ongoing consistency repurchase program will deliver attractive, consistent return to our long-term shareholders, especially during this period of extreme market volatility. Thank you. Now let's turn to Q&A.\n\nRob Lin -- Head of Investor Relations\n\nHi, everyone. For today's call, you are welcome to ask questions in Chinese or English. A third-party translator will provide consecutive interpretation for the Q&A session, and our management will address your questions in the language you asked. Please note that the translation is for convenience purpose only.\n\nIn the case of any discrepancy, our management statement in original language will prevail. If you are unable to hear the Chinese translation, bilingual transcript of the call will be available on our website within one week after the meeting. [Foreign language] Operator, please connect speaker and SI conference lines now, and please start the Q&A session when ready. Thank you.\n\nOperator\n\nYour first question comes from Ronald Keung from Goldman Sachs. Please go ahead.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\n[Foreign language] Thank you, Daniel, Toby, and Joe and Rob. My question has to do with customer management revenues and GMV. We noted in your prepared remarks, you stated that GMV during 11.11 this year was consistent with that of last year. So, it seems there's an improvement there from the single-digit drop in the September quarter.\n\nBut looking forward to the next several quarters as we anticipate more stabilization in the macro environment, can you share with us your view of how GMV may grow and also the CMR revenue?\n\nToby Xu -- Chief Financial Officer\n\n[Foreign language] Thank you. Well, in fact, in my prepared earlier, I did offer some detailed analysis of the CMR issue. And I do understand this is an issue in which investors are interested. Certainly, when it comes to GMV in the context of the ongoing impact of the pandemic, as well as ongoing changes in the way that goods are marketed and sold to consumers, in particular, with the rapid increase in livestreaming and growing importance of livestreaming, there has been an overall impact on returns of purchases on the platform.\n\nSo, typically, when we talk about CMR, we do talk about that in conjunction with the issue of returns. But there are some differences between the two pieces. First of all, when it comes to take rate, we talk about CMR. And that's connected with post-return GMV.\n\nSo, the amount of returns will be highly correlated with that. But the second piece is advertising revenue. And in the current macro environment, certainly, there's reduced willingness on the part of merchants to invest, as well as the macro environment impact on merchants' own business. [Foreign language] But secondly, in terms of our own focus on growing CMR revenue, this should really be a result of all of the efforts that we make to help merchants better engage consumers on the platform and drive their sales.\n\nSo, be it in terms of paid search for, which everyone is very familiar, and, more recently, smart recommendations and livestreaming that has grown very rapidly lately. These are all different ways that we can enable merchants to better engage with their consumers and to drive their sales. And the result of achieving merchants achieve that success should be reflected in our CMR revenues.\n\nRob Lin -- Head of Investor Relations\n\nOperator, next question.\n\nOperator\n\nThank you. The next question comes from Thomas Chong from Jefferies. Please go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thank you, management. Daniel spoke earlier about several factors that affected performance this year during 11.11. Certainly, we noted on the logistics side, there are some serious disruptions in various regions in China. So, I'm wondering, looking at the December quarter, you know, how would you rank impact of these different factors, if you're going to order them? You know, looking at order cancellations as one factor related to livestreaming, also just consumer sentiment, and also the ongoing impact of the pandemic.\n\nIf you're going to order those factors in order of importance, what would that look like? And then, secondly, we saw on the China commerce side that very good results were achieved in terms of EBITA with a 6% increase there. So, in the short term, I'm wondering if you could talk a little more about if, you know, CMR is impacted on an ongoing basis by these macro factors, how big an impact that could be expected to have on EBITA?\n\nDaniel Zhang -- Chairman and Chief Executive Officer\n\n[Foreign language] Thank you. As regards to those three situations or three factors that you summarized in your question, they all have an impact, but I think the relative impact of those factors is process of flux dynamic change. But if I absolutely had to rank them, I would say -- and this would be true for any enterprise or certainly any platform, but it would be the macro environment that we find ourselves in, which, in turn, has an impact on consumer confidence, consumer demand, consumer willingness to spend. And I think the macro environment would be the primary a determinant not just for Alibaba, but for all the players in the consumption space, both online and offline.\n\nAnd then, on the second piece to this is with the introduction of the 20 measures from the state authorities that can be expected to have a positive impact. We certainly do note still some ongoing disruption to logistics in certain regions of the country. But overall, we do expect things to continue to improve in a positive direction. [Foreign language] Further, with livestreaming becoming a more important engagement format, as you mentioned, that has resulted in an impact on returns.\n\nHowever, I think Alibaba, compared to its peers, especially those who primarily rely on livestreaming or basically just rely on livestreaming, I think the impact on Alibaba is relatively smaller. During the 11.11 period, livestreaming played a more important goal on Alibaba and it does during the regular periods of the year, especially with regards to presales for 11.11. But in general, for Alibaba livestreaming is one format -- one engagement format and doesn't represent everything that we have to offer. Alibaba is working hard to balance these different formats to ensure that merchants are able to engage with their consumers in the ways that they want to be able to do that.\n\nAlibaba is open to embracing new technologies and new approaches. But at the end of the day, we do need that kind of balance to ensure a good consumer experience and also to ensure that our costs remain acceptable to merchants. So, it is about finding the right balance.\n\nToby Xu -- Chief Financial Officer\n\n[Foreign language] This is Toby. I'd like to add to that with regards to your second question, which had to do with the impact of the reduction in CMR revenue, potentially on China commerce profit going forward. Look, a reduction in any revenue stream would, of course, have an impact on profit at the end of the day. However, if you look at China commerce EBITA in this quarter, it was up.\n\nThere was a positive increase year on year compared to the same quarter last year. And we've achieved that by being very disciplined in our spending and investment and also in driving higher levels of efficiency. So, this increase in core commerce EBITA has been driven by an increase in profit in the profitable parts of the business, as well as by achieving narrowing of losses in the parts that we're making losses. So, that's why you see that increase of around 6%.\n\nRob Lin -- Head of Investor Relations\n\nNext question?\n\nOperator\n\nThank you. The next question is from Eddie Leung from Bank of America Merrill Lynch. Please go ahead.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] Thank you. Good evening, management. I'd like to ask you a hypothetical question. I'm wondering if, going forward, there is a relatively large adjustment in pandemic control measures in China, how would that kind of adjustment impact on different businesses or different product types? And would the impact be positive or negative? And then, related to that, I'm wondering if there are any preparations that Alibaba might be making or could be making as a company to better position itself for future prospect of a major change in pandemic control restrictions? Thank you.\n\nDaniel Zhang -- Chairman and Chief Executive Officer\n\n[Foreign language] Well, thanks very much for what really is a very good question. Certainly, I'm sure that we all hope to see an end to the pandemic and a complete return to normalcy for society, for the economy, for our own daily lives. There's nothing that people will want more than to get back to normal, and that would be good news for Alibaba, and it would be good news for everyone. Now, certainly, Alibaba's businesses are diverse and would be impacted in different ways.\n\n[Foreign language] Talking about the consumption part of our business first. I think, most importantly, were there to be an end to the pandemic and a complete return to normal life -- a normal work, in particular, that would result in a big boost to consumer confidence. And that would certainly be very positive for the Chinese economy as a whole and also for companies like Alibaba. Consumption is an important engine of economic growth.\n\nBut for consumers to spend, they need to have confidence and they need to have stable expectations, including stable expectations regarding their own future income. So, we're the pandemic to end, the controls to end that would, I believe, result in a big boost to that kind of confidence, resulting in higher consumer spending and also further stimulating the economy. So, good news all around. [Foreign language] Secondly, I would say that you could expect to see an impact on the consumption mix in the context of the pandemic and with all the uncertainty.\n\nThere's been an increased focus on nondiscretionary consumption on daily essentials, food, groceries, things of this nature. And you've, of course, seen a lot of demand for stocking up with people worried about potential supply disruptions, lack of access to necessities and essentials. So, a lot of demand for people to stock up. Now, of course, were the situation to change, were the pandemic to ease, then I think you could certainly expect to see a corresponding increase in discretionary type of spending.\n\nSo, that would be a change we could expect to see. [Foreign language] Secondly, if we look at our 2b businesses, for example, our cloud computing. I think certainly, all enterprises across the board understand that digitalization is the future. But at the same time, how much they will invest in any period does come down to their own current business performance and their expectations of the future.\n\nSo, companies have to decide how much they're willing to invest. And they have to be sure they're living within their means. So, I think, after the pandemic is over, things have returned to normal, we would expect to see companies gaining more confidence in their future growth prospects and being willing to devote more resources to digitalization. I think that would be good news for our cloud business.\n\n[Foreign language] So, for Alibaba, I do think it's important that we always be looking to the future, and, of course, hold out hope for the future. In terms of our consumer-oriented categories and offerings, we're already very complete. And we will continue to look forward to rolling out and developing new categories going forward at the end of the pandemic. And not just goods, but also services, including travel and tourism services.\n\nAt the same time, we need to continue to maintain a proactive approach to developing new digital offerings and solutions and rolling out cloud-based solutions that help and empower customers to generate data, to leverage their data and to extract value from their data. And I think this will all be very positive going forward.\n\nRob Lin -- Head of Investor Relations\n\nThank you. Next question?\n\nOperator\n\nThank you. The next question is from Alex Yao from JPMorgan. Please go ahead.\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language] Thank you. Daniel, in your prepared remarks, you spoke about how Alibaba's long-term development is highly aligned with China's overall long-term development strategy and direction, including around digitalization. I'm wondering, in the context of the current global regulatory environment, how you see digitalization playing out in the future, say, in the next five years in China in terms of its direction, in terms of its pace? What can Alibaba do as part of that process and what kind of financial returns can Alibaba reap? Thank you.\n\nDaniel Zhang -- Chairman and Chief Executive Officer\n\n[Foreign language] Well, when it comes to Alibaba's view of the future, the big picture of the future, we are, of course, strongly committed to our three key strategies of cloud computing, consumption, and globalization. And, of course, we do note the important emphasis given the latest -- the 20th Party Congress with the intention of helping China develop into a strong player in internet industries with a strong digital economy. And I think that Alibaba is very well positioned to contribute the realization of those goals. If you look back at Alibaba's history as a company around the internet, the first thing we did was in the field of retail commerce and enabling digital flows goods to consumers in the real economy, serving consumers with digitalization in that way.\n\nThe second thing we did was bring digitalization to logistics, making it possible with high efficiency and high effectiveness to ship goods all over the country. And in fact, China today is now probably the No. 1 country in the world when it comes to express delivery services, not only in terms of the number of parcels, but also the quality of services as well. And then, thirdly, over the last five to 10 years, we've been very focused on investing in cloud computing and helping companies go digital, not just companies, though public services as well, enterprise management, as well as the digitalization of industry.\n\nAll of this is served by our cloud computing offerings. So, going forward, we do indeed feel that as a company, we're highly aligned with that overall direction in China to continue to empower this process of digitalization and to harness the benefits of digitalization as part of this long-term development process. And Alibaba, as a company, has tremendous confidence in our ability to do precisely that, to provide the technologies that will empower the real economy to create further value through digitalization. So, we do feel very encouraged about that overall policy direction, and we also are positively encouraged by other comments that we've seen from state authorities, including talking about the high-quality development of platform economies and Alibaba looks forward to playing an important role in all of these developments going forward and have confidence that we go.\n\nJerry Liu -- UBS -- Analyst\n\nNext question.\n\nOperator\n\nThank you. The next question is from Jerry Liu from UBS. Please go ahead.\n\nJerry Liu -- UBS -- Analyst\n\n[Foreign language] Thank you, management, and good evening. I'd like to come back, if we could, to a topic we addressed earlier in the discussion, which was about the take rate and the company's ability to monetize traffic. I'm wondering if you could tell us, please, what your view is over the next few quarters or say over the next year and the company's ability to monetize this traffic? Thank you.\n\nDaniel Zhang -- Chairman and Chief Executive Officer\n\n[Foreign language] Thank you. Well, the topic of monetizing traffic is one of perennial interest, of course, to it -- to investors, and we've taken many questions on this topic over the years. But it's not a question that we look at alone in isolation. It's really -- it's all really about -- more about how we help merchants and how we create value for merchants, enabling merchants to achieve ROI, and then we can share part of that ROI.\n\nThat's our basic take and our basic objective on this. Secondly, when you look at our, for example, Taobao mobile app, today, there's more diversity in terms of the way consumers are interacting through that app with different routes to purchase. As I mentioned in my earlier remarks, you have, of course, search and now you have a recommendation feeds that are becoming smarter and smarter, as well as other kinds of discovery functions, including livestreaming and short-form videos and all of that. So, these represent new formats or new scenarios for consumption.\n\nAnd, of course, we are monitoring structural changes that are underway in terms of the frequency and concentration and traffic around those different kinds of interactions on the consumer commerce side. But at the end of the day, it's still about us helping to create value for merchants, helping them to connect with the consumers, be it by a search by a recommendation, via videos or in other formats. But we are tracking behavior around those discovery-related formats looking at consumer behavior of PVs and can and will, going forward, consider ways to change the monetization model in line with this kind of evolution. But at the end of the day, it's really about providing a reliable and effective service to merchants to help and serve the consumers.\n\nRob Lin -- Head of Investor Relations\n\nThanks. Next question.\n\nOperator\n\nThank you. The next question is from Alicia Yap from Citigroup. Please go ahead.\n\nAlicia Yap -- Citi -- Analyst\n\n[Foreign language] Thank you. Good morning, management. I'm wondering, first of all, if you could talk to us a little bit about advertising, marketing budget allocation and changes that you may have seen there in the past few months, in particular, compared against the period before the pandemic in terms of big brands, large brands and then the long-tail merchants. You know, for example, what proportion of the marketing budget or big brands versus smaller merchants allocating to different formats, for example, to paid search versus recommendations.\n\nAnd then, by the way of follow-up, I was wondering, if Daniel could tell us a bit about the take rate for livestreaming versus search and recommendations, if the take rate for livestreaming would happen to be lower than those other formats because you were talking about livestreaming as one marketing format that can bring more convenience to merchants and be one more format. But I'd like to know about the take rate? Thank you.\n\nDaniel Zhang -- Chairman and Chief Executive Officer\n\n[Foreign language] Thank you. Let me divide this into a few pieces. When it comes to marketing budgets, and I think this is true of all kinds of merchants, large, medium or small, in the context of the pandemic and considerable uncertainty, I think that all categories of merchants have become more prudent with regard to their spending on marketing. Because any company, regardless of its size, small, medium, large, is certainly going to be allocating a marketing budget as a percentage of its expected future revenues, be it in a quarter or be it in a year.\n\nSo, in the context of the pandemic, with heightened uncertainty around expected future revenue, of course, there's going to be an impact on marketing budgets for all kinds of companies alike. I think, secondly, a change that we -- that you have seen following the pandemic is higher demands around ROI, also a function of merchants being more prudent. They want to ensure that the advertising they're paying for is being effective and paying off in terms of ROI. So, certainly, a more cautious approach, especially to things like the display advertising.\n\nMerchants, advertisers are looking for more certainty amid all of the uncertainty brought about by the pandemic. Alibaba is, of course, very well positioned as both a consumer media and also a platform -- the major platform for merchant operations in China. It's a place that merchants can come and achieve sustainable ongoing business operations and success be empowered with a whole variety of different tools to do that. And that's why Taobao and Tmall continue to be the primary place for merchants to come and do business.\n\nNow, of course, merchants are always going to explore new formats, new models and new platforms for that matter, that crop up, because they're always looking to achieve incremental growth in their business. But at the end of the day, they will be looking at the ROI they're achieving and the sustainability of their investment in gaining that incremental new business. [Foreign language]\n\nRob Lin -- Head of Investor Relations\n\nOK. Thank you. We'll take the last question.\n\nUnknown speaker\n\nSorry, Rob. Just to complete the --\n\nRob Lin -- Head of Investor Relations\n\nGo ahead.\n\nToby Xu -- Chief Financial Officer\n\nYeah. So, the second part of your question, Alicia, had to do with the take rate on livestreaming. So, Alibaba has two different kinds of livestreaming, the first kind is merchant livestreaming. So, this is where you have a merchant store online with an employee, or a third-party person engaged by the merchant doing livestreaming at the store, and that's something unique to Alibaba.\n\nAnd then secondly, we have livestreaming by opinion leaders, in Chinese we call them [Foreign language], so they're running their own livestream on which they can give visibility to and promote other merchants. And we have agreements in place to ensure that we're sharing an incremental revenue growth via a take rate. So, that is our model.\n\nRob Lin -- Head of Investor Relations\n\nOK. Last question, please.\n\nOperator\n\nThank you. The final question comes from Jiong Shao from Barclays. Please go ahead.\n\nJiong Shao -- Barclays -- Analyst\n\n[Foreign language] Thank you very much. Good evening, management. My questions have to do with Cainiao, which we see has had very good performance with growth of over 30% in revenue, so a very robust performance this quarter. I'm wondering if you could expand on that a bit and talk to us about some of the reasons that are driving that growth.\n\nAnd also, given, you know, over 70% of Cainiao's total revenue is external, being generated by external customers, if you could talk to us about the prospects for a potential spin-off of Cainiao? Thank you.\n\nToby Xu -- Chief Financial Officer\n\n[Foreign language] Thank you. So, this is Toby. I'll take first question and hand over to Daniel on the second question. So, yes, indeed, in this quarter, China's revenue increased by some 36% year over year.\n\nIn my script, I did go into the reasons for that, and I talked about the strong growth in domestic side, the consumer logistics services, and, secondly, on the cross-border side as well. But I think the biggest contributor was the local consumer logistics side where we achieved very good growth and improvement, largely thanks to an enhanced service model, so going from more 3PL model to a 4PL model. We're now -- we're not just passing on services to customers, but rather we are booking and purchasing services from different providers and then providing those services on to consumers, meaning that we're taking on more responsibility for the service enabling us to provide overall better service. And that, in turn, is reflected in more revenue that can be recognized for Alibaba and an improvement in revenue for China.\n\n[Foreign language] With this upgrade in our model, we are better able to provide services to our customers and at the same time, also able to satisfy regulatory requirements that have been into this space.\n\nDaniel Zhang -- Chairman and Chief Executive Officer\n\n[Foreign language] Thank you. This is Daniel. Regarding the second question. Ever since Trendyol was established back in 2013, it has been independently operated within the Alibaba family, but providing external services and, more importantly, with external shareholders as well.\n\nSo, today, the Alibaba Group owns some 67% of Trendyol, and there are other investors as well. Over the years, Trendyol has invested in robustly building up its last-mile capabilities. Trendyol Post delivery stations on campuses, in villages all around the country, and also in developing very robust supply chain capabilities with domestic logistics and cross-border as well. So, as far as Alibaba is concerned, of course, we look forward to seeing Trendyol continue to achieve very robust development, building those capabilities and for those capabilities in turn to feed back into and better drive Alibaba's growth as well in terms of our domestic commerce business, our international commerce business, be it 2c, be it 2b as well.\n\nAnd this is a really important kind of synergy that we see across the businesses. Certainly, Trendyol will continue to be independently operating in the market and achieving success more broadly in the market.\n\nRob Lin -- Head of Investor Relations\n\nOK. Thank you, everyone, for participating in today's earnings call -- today's call. We'll have a transcript available later on our corporate website. Please feel free to reach out to me and the IR team for any follow-ups.\n\nWe'll see you next quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRob Lin -- Head of Investor Relations\n\nDaniel Zhang -- Chairman and Chief Executive Officer\n\nToby Xu -- Chief Financial Officer\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nJerry Liu -- UBS -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nUnknown speaker\n\nJiong Shao -- Barclays -- Analyst\n\nMore BABA analysis\n\nAll earnings call transcripts"
}