{
  "companyName": "GameStop",
  "companyTicker": "GME",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/gamestop-gme-q2-2022-earnings-call-transcript/",
  "content": "GameStop (GME 0.71%)\nQ2 2022 Earnings Call\nSep 07, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the GameStop second quarter 2022 earnings conference call. Please note that certain statements made during the call constitute forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Act of 1995 as amended. Such forward-looking statements are subject to both known and unknown risks and uncertainties that could cause actual results to differ materially from segments. These risks and uncertainties are described in the company's earnings press release and its filings with the SEC.\n\nThe forward-looking statements today are made as of the date of this call, and the company does not undertake any obligation to update the forward-looking statements. I will now turn the call over to GameStop's CEO, Matt Furlong.\n\nMatt Furlong -- Chief Executive Officer\n\nThank you, and good afternoon, everyone. I want to begin by reiterating the deep appreciation we have for our stockholders' unrivaled enthusiasm, passion and support. As we work to transform GameStop, these remain unique tailwinds for us, ones we always recognize and value. I also want to take this opportunity to thank everyone across the organization for bringing continued focus and intensity to our mission, particularly during an active Q2 that represented a transitional quarter for us.\n\nBefore covering the quarter's specific initiatives and results, I want to provide a high-level update on where we've been and where we're looking to go as our transformation progresses. When our board began turning over early last year, GameStop was saddled with significant debt, decaying systems, limited employee depth and a host of other issues. This is why we spent the second half of 2021 and the first half of 2022 making up for years of underinvestment in modernizing the business. The upshot is we now have a more diversified product catalog, strengthened fulfillment network, improved tech stack and e-commerce presence and fortified corporate infrastructure.\n\nThanks to these improvements, including our SAP implementation, we are able to start focusing on a new set of priorities that include achieving profitability, launching proprietary products, leveraging our brand in new ways and investing further in our stores. During Q2, we took steps to support each of these new priorities. With respect to pursuing profitability in the coming quarters, we rightsized corporate expenditures and headcount following a period in which the company had hired more than 600 new individuals. These actions, combined with the elimination of onetime expenses in Q1, contributed to a 14.3% reduction in SG&A.\n\nWe've done this while improving our e-commerce experience and reducing free shipping to customers to one to three days. We're going to retain a strong focus on cost containment and continue promoting an ownership mentality across the organization. On the product front, our enhanced tech capabilities allowed us to follow the launch of our digital wallet with the launch of our new marketplace that allows gamers, creators, collectors and others to buy, sell and trade NFTs. The launch of our NFT marketplace supports GameStop's pursuit of long-term growth in the cryptocurrency, NFT and Web3 gaming verticals, all of which we expect to be increasingly relevant for the collectors and gamers of the future.\n\nWhen it comes to accretive partnerships, we've been actively exploring opportunities to strengthen GameStop's offerings and increase brand visibility. We're building on the momentum established by our previously disclosed partnerships with organizations like Immutable X and Loopring, whether it be through new relationships that support our commerce business, blockchain group or both. The deal we just announced with FTX is a byproduct of our commerce and blockchain teams working together to establish something unique in the retail world. Lastly, when it comes to investing in our stores, we rolled out an improved compensation model for U.S.\n\nstore leaders. Each of these store leaders is being given a time-based equity grant of $21,000 that vests over three years, as well as the opportunity to earn additional compensation every quarter via a performance-based equity grant. In conjunction, we're raising hourly pay for certain store associates. These steps were taken to help us enhance retention and recruitment of passionate, quality talent.\n\nWhen we think about the GameStop of the future, we expect our stores to help us maintain direct connectivity to customers and sustain localized order fulfillment capabilities across more geographies. This is why, even as we continue evolving our e-commerce and digital asset offerings, storage will remain a critical piece of the company's value proposition. Taken together, we believe the aforementioned steps can help us attain profitability in the coming quarters and produce additional revenue growth over the long term. Let me now turn to our financial results for Q2.\n\nNet sales were $1.136 billion for the quarter, compared to $1.183 billion in the prior year's second quarter. Sales attributable to new and expanded brand relationships remained strong. It is also worth noting that sales attributable to collectibles, which is a segment we intend to grow over the long term, were $223.2 million for the quarter, compared to $177.2 million in the prior year's second quarter. SG&A was $387.5 million or 34.1% of sales, compared to $378.9 million or 32% of sales in last year's second quarter.\n\nAs noted, we had a strong reduction in SG&A on a sequential basis versus Q1 of this year, and we're taking further steps to reduce SG&A on a go-forward basis. We reported a net loss of $108.7 million or $0.36 per diluted share, compared to a net loss of $61.6 million or a loss per diluted share of $0.21 in the prior year's second quarter. There were no major onetime transformation transaction or related costs during the period. Turning to the balance sheet.\n\nWe ended the quarter with cash and cash equivalents of $908.9 million. We continue to maintain a sizable cash position even while investing in inventory to sustain strong in-stock levels and mitigate the full impact of lingering supply chain issues. At the close of the second quarter, we had no borrowings under our ABL facility and no debt other than a low-interest, unsecured term loan associated with the French government's response to COVID-19. Total liabilities compared to the second quarter of last year were down $237.8 million.\n\nCapital expenditures for the quarter were $20.5 million, up $7 million from last year's second quarter, reflecting investments in our technology and enterprise systems. We anticipate capex will remain at modest levels. In the second quarter, cash flow from operations was an outflow of $103.4 million, compared to an outflow of $11.5 million during the same period last year. Inventory was $734.8 million at the close of the quarter, compared to $596.4 million at the close of the prior year's second quarter.\n\nIn terms of an outlook, we're not providing formal guidance at this time. It is worth noting, however, that our ongoing engagement with key suppliers is positioning us to receive stronger supply of next-generation consoles in the months ahead. I want to finish by reinforcing that we're working to accomplish something unprecedented in our industry, transform a legacy brick-and-mortar retailer into a technology-led organization that meets customers' needs through stores, e-commerce properties in both digital marketplaces and new online communities. Our path to becoming a more diversified and tech-centric business is one that obviously carries risk and will take time.\n\nThis said, we believe GameStop is a much stronger business than it was 18 months ago. I will leave it there for this quarter. We look forward to driving more progress in Q3. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Furlong -- Chief Executive Officer\n\nMore GME analysis\n\nAll earnings call transcripts"
}