{
  "companyName": "Marvell Technology",
  "companyTicker": "MRVL",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/marvell-technology-mrvl-q3-2023-earnings-call-tran/",
  "content": "Marvell Technology (MRVL 0.76%)\nQ3 2023 Earnings Call\nDec 01, 2022, 4:45 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Marvell Technology's fiscal third quarter 2023 earnings conference call. All participants will be in listen-only mode. [Operator instructions] After today's presentation, there will be an opportunity to ask questions. Please note this event is being recorded.\n\nI would now like to turn the conference over to Mr. Ashish Saran, senior vice president of investor relations. Please go ahead.\n\nAshish Saran -- Vice President, Investor Relations\n\nThank you, and good afternoon, everyone. Welcome to Marvell's third-quarter fiscal year 2023 earnings call. Joining me today are Matt Murphy, Marvell's president and CEO; and Jean Hu, our CFO. Let me remind everyone that certain comments made today may include forward-looking statements, which are subject to significant risks and uncertainties that could cause our actual results to differ materially from management's current expectations.\n\nPlease review the cautionary statements and risk factors contained in our earnings press release, which we filed with the SEC today and posted on our website, as well as our most recent 10-K and 10-Q filings. We do not intend to update our forward-looking statements. During our call today, we will refer to certain non-GAAP financial measures. A reconciliation between our GAAP and non-GAAP financial measures is available in the Investor Relations section of our website.\n\nWith that, I'll turn the call over to Matt for his comments on our performance. Matt?\n\nMatt Murphy -- President and Chief Executive Officer\n\nThanks, Ashish, and good afternoon, everyone. In the third quarter of fiscal 2023, the Marvell team drove revenue to $1.54 billion, a record for the company, growing 27% year over year and 1% sequentially. This year-over-year growth was driven by our cloud, 5G, and auto business, as well as share and content gains in our enterprise networking end market. Our third-quarter revenue came in toward the lower end of our guidance range, and we are forecasting a sequential decline in our fourth quarter.\n\nEarly in the third quarter, we were still dealing with supply escalations. Late in the quarter, customers started requesting to push out shipments and reschedule orders to manage their inventory in a changing demand environment. In the third quarter, these inventory reductions started to manifest, and we are expecting an even greater impact in the fourth quarter. The largest impact is from our storage customers and has been widely communicated by that set of OEMs.\n\nIn addition, as our Chinese customers deal with a changing macroeconomic situation, their demand for our products has come down significantly. Just to give you a sense of the magnitude of that change, we estimate that our revenue in the fourth quarter from our OEM customers based in China will decrease by over one-third compared to the second quarter. We expect revenue from China OEMs will account for less than 10% of our total company revenue in the fourth quarter. I would note that to date, the restrictions of the U.S.\n\nDepartment of Commerce announced in October on shipments of U.S. chip technology to China has not meaningfully impacted our revenue. While the inventory correction at our customers is challenging in the near term, we believe it's prudent to work closely with them to manage the change in an orderly fashion and clear the path to a resumption of growth. Let me now move on to discussing our end markets, starting with data center.\n\nIn our data center end market, revenue for the third quarter was $627 million, exceeding guidance with better-than-expected results from our cloud business. On a year-on-year basis, our data center revenue grew 26% with our cloud business driving all the growth with multiple product lines contributing to strong results. On a sequential basis, our data center revenue declined by 3% due to softness in our on-premise business. Our storage products, including fiber channel, HDD, and SSD, all saw demand decline during the quarter.\n\nHowever, our cloud business continued to grow sequentially, driven by strength in our electro-optics and switch products. We are seeing the growth rate of the data center end market decelerate and customers have started adjusting their inventory to address the changing demand picture. As a result, for the fourth quarter of fiscal 2023, we are expecting our data center revenue to decline year over year approximately in the mid- to high teens on a percentage basis and sequentially decline in the mid-20% range. The biggest change in demand is in product lines where we are one step removed from the end customer.\n\nSo, when demand changes quickly, we are more exposed to the supply chain bullwhip effect. As a result, we expect the impact to be the most pronounced in our storage business, which we project will be responsible for the bulk of the overall sequential decline in our data center revenue. In particular, we are projecting a very large reduction in shipments of our HDD controllers and preamps, as HDD OEMs deal with a broad-based inventory correction. The rest of our data center business is also expected to deal with inventory adjustments by our customers but to a much lesser extent compared to our storage business.\n\nWhile we work through the near-term situation in the data center end market, we remain confident in our multiple long-term growth drivers. In the third quarter, we started ramping our cloud-optimized silicon design wins into production and are planning to launch multiple additional products in fiscal year 2024 and 2025. Our successful execution on the first group of projects, coupled with our ongoing investments in data infrastructure, silicon IP, and advanced process and packaging technologies is opening up an even larger set of opportunities with cloud customers. In the third quarter, we launched our next-generation cloud security solution, Marvell's LiquidSecurity 2 HSM adapter, the industry's most advanced solution for enabling encryption, key management, and authentication in the cloud.\n\nPowered by Marvell's cloud-optimized OCTEON DPU, LS 2 is a converged security platform for payment, privacy compliance, and general-purpose applications. We are also making progress on two of our longer-term growth initiatives in the cloud, CXL, and ADCs. In the third quarter, we announced availability of our CXL development platform for cloud data center operators and server OEMs, enabling two key use cases: memory expansion and memory pooling. The platform pairs Marvell's advanced CXL technology with the latest CXL capable CPUs, including the new fourth-gen AMD EPYC processors demonstrating multi-host memory pooling.\n\nWith this platform, cloud operators can begin to advance their infrastructure and enable their applications to take advantage of this cutting-edge technology. I'm very excited to announce that we have recently won a significant design at a Tier 1 hyperscaler projected to drive a substantial amount of revenue in aggregate over the program's lifetime. Product development activities are in full swing, and our team is driving a large and growing pipeline of CXL opportunities. In the AC market, multiple cable manufacturers have started sampling 100-gig per lane active electrical cables powered by Marvell PAM4 DSPs to cloud data center operators, which we expect to pave the way to broader adoption and expand our addressable market.\n\nTurning to our carrier infrastructure end market. Revenue was $271 million, growing 26% year over year and declining 5% sequentially. On a year-on-year basis, the vast majority of our growth was driven by our wireless business, which continued to benefit from the growth in 5G adoption. As you recall, the annualized revenue run rate for our wireless business crossed $600 million in the second quarter of this fiscal year.\n\nWe are excited to see growth continue from that milestone. Our wired business also grew year on year in the third quarter, driven by solid demand from metro and long-haul carrier for our market-leading coherent DSPs and accompanying TIAs and drivers. On a sequential basis, our wired business came down as expected from a very strong second quarter and more than offset growth from our wireless business. We are excited to see our 5G business continuing to flourish and are looking forward to broader deployment of 5G in multiple geographies, including the U.S., Europe, and India.\n\nIn addition, we anticipate significant share in content growth ahead and new opportunities in ORAN and DRAM architectures. As you will recall, in March 2020, Nokia and Marvell announced that our companies have started working together to develop a leading 5G silicon including multiple generations of custom silicon and infrastructure processors to further expand the range of Nokia's ReefShark chipsets. Earlier this week, we announced an extension of our collaboration with Nokia to further advance their 5G chipset portfolio. Nokia will be using our new OCTEON 10 DPU, the industry's leading 5G transport processor built on Marvell's cutting-edge five-nanometer platform and hardware acceleration technology.\n\nThese high-performance and highly efficient processors will allow operators to scale rapidly and manage the dramatic increase in data traffic and performance demanded by 5G's innovative service-based architecture while reducing cost and energy consumption. We continue to expand our collaboration with Nokia and look forward to enabling their next-generation 5G platforms. There are also two key announcements from the Open RAN ecosystem. Vodafone and Nokia announced that they have agreed to work on a fully compliant Open RAN solution with Marvell.\n\nDeveloping cooperation with us, Nokia's ReefShark SoC boosts Layer-1 processing capability to enable Open RAN systems to reach full functionality and performance parity with traditional mobile radio networks. In another development, Vodafone and Samsung recently announced that they are jointly cooperating with Marvell to accelerate the performance and adoption of 5G Open RAN across Europe. They plan on incorporating Marvell's advanced OCTEON Fusion processor specifically designed for Open RAN into the latest off-the-shelf servers. The specialized accelerator chip also enables massive MIMO technology developed to serve many subscribers in dense urban areas.\n\nMoving on to our outlook for next quarter. For the fourth quarter of fiscal 2023, we are expecting revenue from our carrier end market to grow slightly on a sequential basis and grow year over year approximately in the mid-teens on a percentage basis. Moving on to our enterprise networking end market. Revenue for the third quarter was $376 million, growing 52% year over year and 10% sequentially.\n\nAs the quarter progressed, our Chinese customers started to turn cautious due to an evolving macroeconomic environment. In response, we work with customers realigning shipments to reflect their reduced demand. As a result, despite the strong sequential and year-over-year growth, revenue was lower than our guidance. In the fourth quarter of fiscal 2023, we are expecting revenue from the enterprise networking end market to decline sequentially in the low single digits on a percentage basis.\n\nHowever, we expect growth to continue year over year at close to 40%, reflecting our higher content and growing share. Turning to our automotive and industrial end market. Revenue for the third quarter was $84 million, growing 26% year over year and 1% sequentially. Revenue was lower than our forecast in industrial, as well as automotive where we continue to experience supply challenges in certain legacy notes.\n\nWe expect these supply challenges to start to improve in our fourth quarter. On a sequential basis, our auto business continued to grow, partially offset by a decline in our industrial business. On a year-over-year basis in this end market, Marvell's growth was primarily from our auto business, driven by continuing adoption of our Ethernet technology. Our auto business achieved another milestone in the third quarter with annualized revenues exceeding $200 million.\n\nAs you recall, we have been accumulating platform design wins across a broad spectrum of auto OEMs. And we have generated a substantial pipeline of lifetime revenue that will benefit us over many years. Looking to the fourth quarter of fiscal 2023, we are projecting strong growth for our overall auto and industrial end market, expecting revenue to grow approximately 30% year over year and in the mid-20% range sequentially. Moving to our consumer end market.\n\nRevenue for the third quarter was $178 million, declining 2% year over year and growing 9% sequentially. Looking ahead to the fourth quarter of fiscal 2023, we are forecasting revenue to be flat sequentially and decline in the low to mid-single digits year over year on a percentage basis. In summary, Marvell delivered record results in the third quarter despite the macroeconomic uncertainty in the world and inventory corrections in some of our end markets. Taking stock of our progress this fiscal year, at the midpoint of our fourth quarter guidance, we are projecting full fiscal year revenue growth in the low 30% range.\n\nWhile we are not immune to the global slowdown impacting the semiconductor sector, we expect to finish this year growing revenue well above the industry and our long-term model, reflecting our continued focus on data infrastructure. Looking forward to the next fiscal year, we remain confident in our key growth drivers of cloud, 5G, and auto. We expect that our cloud-optimized silicon programs will build from the initial ramp that started in the second half of this fiscal year and continue to grow approximately $400 million in aggregate revenue in fiscal 2024 and $800 million in fiscal 2025. Our cloud customers are relying on these chips to build incredibly efficient and optimized custom hardware to enable their key growth drivers.\n\nIn addition to our cloud-optimized programs, we expect that our 5G products in our automotive business will drive strong year-over-year revenue growth in fiscal 2024. Offsetting this growth to an extent, we expect a few quarters of inventory adjustments in some of our businesses as customers realign their demand. We continue to be disciplined on operating expenses. We have tightened spending and slowed our pace of hiring, focusing on critical hires for future success.\n\nAt the same time, we continue to invest in our long-term growth initiatives including our three-nanometer silicon platform, which is now available for new product designs. In addition, we are committed to executing on a number of new products, which our customers have designed into their mission-critical applications. Over the last few years, we have significantly transformed the company, creating a diversified business with growing exposure to multiple infrastructure end markets with strong secular growth drivers. Our businesses at scale, we have a growing design win funnel, leadership products, and strong customer engagement.\n\nWe've built an extraordinary team at Marvell with a track record of execution excellence, and we believe we are well-positioned to navigate the current environment to continue to deliver strong top- and bottom-line results over the long term. With that, I'll turn the call over to Jean for more detail on our recent results and outlook.\n\nJean Hu -- Chief Financial Officer\n\nThanks, Matt, and good afternoon, everyone. I'll start with a review of our financial results for the third quarter and then provide our current outlook for the fourth quarter of fiscal 2023. Revenue in the third quarter was $1.537 billion, within our guidance range, growing 1% sequentially and 27% year over year, driven by growth from our data infrastructure end market. Data center accounted for 41% of revenue, enterprise networking was 24% of revenue, carrier infrastructure at 18%, consumer at 12%, and auto industrial at 5%.\n\nGAAP gross margin was 50.6%. Non-GAAP gross margin was 64% of revenue, below our guidance range primarily due to product mix. Our enterprise and auto industrial end market revenue was lower than expected, and the consumer revenue was higher than our forecast. GAAP operating expenses were $672 million.\n\nNon-GAAP operating expenses were $420 million, declining by 3% sequentially. Year over year, opex increased by 13%, growing at less than half the rate of the top-line revenue growth. Opex was lower than guidance due to lower bonus accrual and better-than-expected NRE. Our GAAP operating income was $106 million.\n\nNon-GAAP operating profit was $564 million or 36.7% of revenue, another all-time record, demonstrating the strong leverage in our operating model. Other income expense, including interest on our debt, was $41 million, higher than guidance primarily due to higher interest rate on our outstanding debt. For the third quarter, GAAP income per diluted share was $0.02. Non-GAAP income per diluted share was $0.57 within our guidance range.\n\nEarnings per share grew 33% year over year, faster than top-line revenue growth. Now, turning to our balance sheet and the cash flow. During the quarter, we generated $411 million in cash from operations, reflecting our strong earnings, offset by continued working capital investments to support our top-line revenue growth, including $94 million in payments for long-term back-end and substrate capacity agreements. These agreements are critical to ramping our complex products in data infrastructure market, including the call to optimize the silicon solutions Matt discussed earlier.\n\nIn the third quarter, we increased our inventory by $44 million or 5% sequentially. Looking at the change in demand we are forecasting in the fourth quarter, we expect our inventory level to continue to be elevated. We are focused on prioritizing new product ramps to support our customers. These -- most of our products have long product cycles of three to five years or even longer.\n\nWe are comfortable carrying higher inventory in a dynamic supply chain environment and we plan on reducing inventory starting next fiscal year. As of the end of the third fiscal quarter, our cash and cash equivalent was $723 million, increasing by $106 million from the prior quarter. Our total debt was $4.5 billion. Our gross debt-to-EBITDA ratio was 1.9 times, and net debt-to-EBITDA ratio was 1.6 times.\n\nDuring the third quarter, we returned $101 million to shareholders through $51 million in cash dividends and $50 million of share repurchases. In summary, in an uncertain macroeconomic environment, the Marvell team executed very well, delivering top-line revenue growth and earnings expansion much faster than revenue growth. Now, turning to our guidance for the fourth quarter of fiscal 2023. We are forecasting revenue to be in the range of $1.4 billion, plus or minus 5%.\n\nWe expect our GAAP gross margin in the range of 48.2% to 50.2%. We project our non-GAAP gross margin will be approximately 64%. We project our GAAP operating expenses to be approximately $646 million. We anticipate our non-GAAP operating expenses to be approximately $430 million.\n\nAs Matt mentioned earlier, we have proactively slowed down our pace of hiring and tightened the discretionary spending to manage our operating expenses. We have a proven track record of executing through economic and the market cycles to maintain strong profitability while we continue to invest in long-term growth initiatives. As a reminder, looking ahead to the first fiscal quarter of 2024, due to the typical seasonality in payroll taxes and employee merit increase, our opex tends to increase from the fourth fiscal quarter in the high single digits sequentially on a percentage basis. Following the step-up in the first fiscal quarter, we are currently planning on holding our opex approximately flat at that level for the next few quarters.\n\nOther income and expense, including interest on our debt, is expected to be approximately $44 million. We expect a non-GAAP tax rate of 6% for the fourth quarter and currently expect this to increase slightly to 7% next fiscal year. We expect our basic weighted share outstanding will be 855 million. And our diluted weighted average share outstanding will be 861 million.\n\nAs a result, we anticipate GAAP earnings per share in the range of breakeven to $0.05 per diluted share. We expect non-GAAP income per diluted share in the range of $0.46, plus or minus $0.05. Operator, please open the line and announce Q&A instructions. Thank you.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Our first question comes from Blayne Curtis with Barclays. Please go ahead.\n\nBlayne Curtis -- Barclays -- Analyst\n\nHey, thanks for taking my question. Matt, maybe just on the data center, I want to understand the moving pieces a little bit better. I think storage has been weak for a bit. I think nearline, I think you've been pretty open that that was weak.\n\nI guess it's implied a big move in storage. And I guess what I'm struggling with is trying to figure out how to put the comment on the Chinese weakness as well because that's a big number. And I guess maybe that overlaps. So, can you just parse those two pieces a little bit more for me? What -- when you say China is weak, what kind of products are we talking about? Is there a way you kind of give any better color on that within the data center for January?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Gotcha, Blayne. Yeah. So, on the first one on nearline, as you mentioned, there's been a lot of reports out there about the weakness there.\n\nWe really hadn't seen that when we guided the quarter. In Q3, we started to see some weakness, but the impact is very pronounced in the fourth quarter, and that nearline weakness obviously flows into the data center end market into that bucket. When you go to China and the weakness we've seen there, that's really in the enterprise area. So, while overall enterprise is hanging in there, it was slightly below in Q3.\n\nWe've had some offsets to that from strength elsewhere. But the main impact of the Chinese customers has really been an enterprise for the most part.\n\nBlayne Curtis -- Barclays -- Analyst\n\nThanks. And then if I could just follow up, you mentioned in terms of the cloud, you said it was actually strong in October, both optical, as well as switching. I'm kind of -- but you also made a comment that I think data center is decelerating. So, can you just put those two together? Are you still seeing strength in U.S.\n\ncloud and weakness elsewhere? Does the comment on data center weakening just on-prem? What did you mean by that?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYep. Great question. So, let me take it from the top. So, first point would be that if you look over the last few years, cloud capex has been on fire.\n\nIt's been growing 30% kind of plus for the last few years. This year, if you look at reports and kind of what we see is probably something in the 15% range for '22 and then it depends on who you talk to, but probably down in the low to mid-single digits or maybe mid-single digits for next year. So, that's the deceleration that we're talking about. And as the macro has started to catch up even with these large cloud companies, you see them very publicly tightening their capex, tightening their opex.\n\nAnd they've had this supply chain built in the data center, which was geared up for a lot of growth. And so, as they reset those expectations, it's not a real smooth process. Storage is the most pronounced, as I mentioned earlier. That's the majority reason code for the sequential decline.\n\nBut we are seeing inventory adjustment as well to a much lesser extent, and I'd say the broader set of product lines outside of storage that we sell into data center. And so, that is not a China-specific thing. That is a global comment, including U.S. cloud, seeing inventory adjustment a bit more broadly.\n\nAnd that's a change, certainly from where we were, say, a quarter ago when we were mired in supply escalations and expedites to an environment where it's now how do we work together to manage the inventory and manage the new reality. And so, that's what you see in the guide for Q4. Hopefully, that was helpful to give you the perspective you were looking for.\n\nBlayne Curtis -- Barclays -- Analyst\n\nThanks for the color.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYep.\n\nOperator\n\nOur next question comes from Vivek Arya with Bank of America. Please go ahead.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my question. Matt, I'm trying to see what is the range of kind of scenarios for fiscal '24 sales growth. I understand you're not giving a specific number. It would be helpful if you give us at least kind of a range.\n\nCan Marvell grow next year? Because when I look at the three areas, cloud and 5G, and autos, I believe it's about 35%, 40% of business. Can those three areas collectively grow fast enough to offset the inventory correction in other areas? Like, so should we be thinking about flat or mid-single digit? What's the kind of range of scenarios of growth that we should be thinking about for fiscal '24?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Great question, Vivek. And certainly, I'd frame all this by saying it's still a very dynamic environment. So, we'll give you the best view we can.\n\nI'd say the first point is we feel very good about the new products that are ramping up and the growth drivers that we've articulated, whether it's cloud-optimized silicon, switching, electro-optics, things like that in the data center, 5G, obviously, continued momentum there with additional regions like India ramping next year plus content gain rolling through and then automotive continuing to grow. So, those are all the positives. What we don't know completely, but I'll give you the best color I can is on the base business and how much of the inventory correction we're going to be dealing with and the magnitude of that. We anticipate, first of all, that that's like typical cycles.\n\nIt's probably a couple of quarters to work its way through. And the three areas I would call out that probably are some offsets next year are, one, would be in consumer. That's an area where we just haven't put a lot of investment. We've been typically running that business for cash.\n\nYou'll probably see some decline there. I think on-premise data center is another area. The on-prem stuff probably has work to do next year. And then maybe a little bit in our wired infrastructure business.\n\nIf you look, actually, it's kind of interesting, if you go back to our fiscal '22 and you look at those three areas, they all grew pretty dramatically in fiscal '23, the current year we're in. And so, at a high level, I think some of those are probably going to trend back to where they were before this big upcycle. And again, from a sort of a timing perspective, think of it as a lot of that headwind or weakness more in the first half, inventory works itself through, and then you have growth back off of that, plus you have the growth drivers kicking in. So, I think it's a very different story, most likely first half versus second half.\n\nBut those are some of the moving pieces in terms of how you think about the growth drivers versus some of the offsets. But we do see -- we still believe we can drive positive year-over-year growth. It just certainly isn't going to be as high as we had been hoping for if you went back even three months ago, just given the magnitude of some of the inventory adjustments.\n\nOperator\n\nOur next question comes from Timothy Arcuri with UBS. Please go ahead.\n\nTimothy Arcuri -- UBS -- Analyst\n\nThanks a lot. Matt, just along the same lines of that question. I'm just kind of wondering if you can help us figure out what a reasonable baseline is in the data center business headed into next year. If you look at storage, I mean, it must be down about 50% sequentially in January, and you were obviously over-shipping the past few quarters and you're really under-shipping now.\n\nBut it seems like if you net all that out, maybe it's kind of the $600 million per quarter baseline in data center, and then you can add the $400 million for the cloud-optimized silicon next year. Can you sort of help us handicap what a normalized run rate might be in that business? Thanks.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. First, I think you're in the ballpark on storage. And just for a little context, the magnitude of that decline, we can't find a data point that shows it declining that quickly. Even when we look back to the reset in 2019, this is down a lot more than that in the same time frame.\n\nSo, you're right, a lot has come out, and so that needs to normalize. I think you've probably got the math about right if you think about sort of where is the base business at. But just to be clear, we're still in a little bit of a dynamic environment figuring out where this is going to bottom out. But if you look at how fast it's coming down, and that's kind of what we're doing, by the way, we're effectively working with our customers to make sure we deal with this quickly and efficiently and minimize any risk of building excess inventory.\n\nAnd that's the path we're on. So, sometime in the Q4, Q1 timeframe, we think that works itself through, and then you start to kind of grow from there. But that's probably reasonable. Probably is an annualized type of run rate, maybe a little bit lower in the first half and certainly higher in the second half as the new designs really ramp up.\n\nTimothy Arcuri -- UBS -- Analyst\n\nYeah, got it. I guess just maybe trying to -- I was just trying to get -- to hold people's hands a little bit on the nonstorage stuff because people will say, well, the issue is not just storage. The issue is the other stuff, too, but it sounds like it's not.\n\nMatt Murphy -- President and Chief Executive Officer\n\nIt's -- there is some. I mean, just to be very, very clear, right? The major reason code for the sequential decline from Q3 to Q4 in the data center line is storage, but there is inventory adjustment going on in digestion given that slope of the capex curve has just come down. There is some realignment. But that is not as pronounced, and it's very manageable.\n\nBut I just -- I want to be very clear, it's not 100% storage issue. There's just a broader digestion.\n\nTimothy Arcuri -- UBS -- Analyst\n\nOf course. Yeah. Thank you.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah.\n\nOperator\n\nOur next question comes from Toshiya Hari with Goldman Sachs. Please go ahead.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nHi. Good afternoon. Thanks so much for taking the question. Matt, if we take your guidance for the carrier infrastructure business in Q4, I think you'll be doing about $1.1 billion in revenue in the full year, maybe a little bit below that.\n\nTo level set us, how much of that is wireless? How much of that is wired? And as you look forward into fiscal year '24, how are you thinking about the 5G business? I think the market, overall, you're seeing some spots of softness potentially, but obviously, you've got idiosyncratic design wins. So, how are you thinking about your business there? And then on the wired side, just given the cyclical dynamics, what sort of decline should we be expecting into fiscal '24? Thank you.\n\nJean Hu -- Chief Financial Officer\n\nToshiya, this is Jean. I'll start to answer this question, and then Matt can add. So, first, on the carrier infrastructure, wireless is already more than half. We talk about the wireless revenues already running, had more than $600 million annualized run rate.\n\nSo, wireless is definitely small than half. Going into next year, as Matt mentioned earlier, we continue to see strong 5G adoption and our customers continue to do very well in the marketplace. So, we do expect the wireless part of the business will continue to have a very strong growth into next year. Of course, the wireline side is what Matt discussed.\n\nWe are going to see some headwinds on wireline side. But overall, we do expect the carrier infrastructure to continue to grow. Matt, anything you want to add?\n\nMatt Murphy -- President and Chief Executive Officer\n\nNo, I think that was perfect. I mean, I just put a pin on it that the wireless opportunity continues to be very exciting, and I think it's going to be a very good year for wireless next year.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Karl Ackerman with BNP Paribas. Please go ahead.\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nYes. Thank you. Two questions if I may. Matt or Jean, I wanted to first discuss enterprise networking.\n\nYou spoke about how China impacts that a little bit. But ex-China, are you still seeing growth? And I know some of your networking OEMs have spoken about some moderating orders. But I think last quarter, you said that this segment was an area that was most constrained. And so, I want to get -- clarify if that's still true.\n\nAnd if you could kind of tie in the amount of inventory that some of those customers have to get a better sense of the demand dynamic of enterprise networking going into fiscal '24? Thanks.\n\nMatt Murphy -- President and Chief Executive Officer\n\nSure. I'll make a few comments. And then, Jean, why don't you add as well? Yes, a couple of things are going on. One is the supply environment has definitely improved.\n\nNow some of that is because of the weakness in the China market that's opened up supply, we can give to other customers. Because generally, outside of a few select cases, our enterprise business is mostly merchant products. These would be Ethernet switches, gigabit, multi-gigabit PHYs, embedded processors, Karl, things like that. So, when you would have a demand softness in one region, you know, that helps things.\n\nSo, the supply situation has improved, which is a good thing. We do have some of our own growth drivers as well. We've highlighted this over the last few quarters. We have some new custom silicon wins that are ramping up.\n\nThat's offsetting some of that weakness as well. But in general, the non-China piece has done OK. It probably -- we're being cautious about how we think about it for next year. So, I think the run rate that we've guided to in Q4 is probably a safe run rate to think about for next year.\n\nEven if there's a little bit of weakness or there is some inventory digestion that goes on. We do have content gains still rolling through. And so, those are some of the moving pieces. You basically have China going down, U.S.\n\ncustomers where we've got either new design wins or share gain or content gain. And so, it sort of all aligns to the numbers where we've guided for Q4. Jean, anything you want to add?\n\nJean Hu -- Chief Financial Officer\n\nNo.\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nGot it. No, that's helpful, Matt. Maybe just as a quick follow-up. I was wondering as you think about some of the inventory digestion that needs to occur across some end markets, as you contemplate that and plan with your foundry suppliers for next year, is there -- could you just maybe just talk about some of the discussions you're having in terms of the ability to perhaps limit some of the cost inflation from the foundry side and whether that -- if they can share that cost with you going forward such that perhaps less of an onerous task for you to pass it along to your end customers.\n\nThank you.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. I would say if you -- without getting into the specifics of each of the input costs that we deal with, I would say that in general, with supply loosening up, that's going to be a positive. I'd say that being said, we have -- there are areas that are still constrained. There's still inflationary aspects inside our supply chain that sort of are coming toward us.\n\nWe're doing what we can to mitigate those. And to the extent we can't mitigate those, we're going to continue to do what we've been doing for the last few years, which is basically pass it on in a generally margin-neutral type of manner. And we found a way to do that, and we'll continue to do that. But certainly, the Marvell team and the operations team has worked aggressively over the last few years, particularly on the packaging back end, etc., to enable more sources to set up more strategic agreements.\n\nAnd so, we're kind of working on both sides. One is to just do our job as a good supplier and manage the cost base. But to the extent we can't, there will be probably a little bit of inflation still in the system. That's sort of how we're looking at it.\n\nWe formed really strategic partnerships with these companies. We have a very transparent communication with them on the demand environment. And, you know, I'd say that we're counting on them to work with us as partners as we manage through what looks like an overall, you know, semiconductor down cycle.\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Gary Mobley with Wells Fargo. Please go ahead.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nHey, guys. Thanks for taking my question. I had a question that kind of picks up on the last topic, and that is your purchase obligations. I know you haven't filed your 10-Q yet, but as I looked at the last your purchase obligations are expected to be about 25% of your cost of goods sold next year.\n\nAnd so, given the current market softness, do you anticipate being able to utilize all that? Do you anticipate the possibility of any sort of inventory write-down? Thank you.\n\nJean Hu -- Chief Financial Officer\n\nGary, this is Jean. Thank you for the question. So, yeah, the purchasing obligation we have this quarter will not change much from the last 10-Q we filed. It's about $3.2 billion.\n\nBut just remember, those purchase agreement, it's really for long term. On average, it's between four to 10 years. And also, our products are very complex and a lot of them have a very long manufacturing cycle. So, we actually need a dedicated capacity for those complex products to support our customers, single cells, the customer, large volume, last long time.\n\nRegardless of the economic environment, we need those dedicated capacity. And frankly, our team has been very thoughtful. We only secure the capacity largely in back end and the substrate for portion of what we need. So, we feel quite comfortable.\n\nWe don't have the issues on the purchase agreement obligations or have to write off any capacity. That's not something we anticipate at all.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nMatt Murphy -- President and Chief Executive Officer\n\nAnd, Gary, I would just add. I'd say that if you look at the bundle of the different obligations we have, some of them are in the shorter term, which are in the form of things like prepays and others, where, as we take the capacity, we actually get it back. The LTA take-or-pay portion is actually not very large relative to the total. And as Jean said, the most strategic aspect of this is really in the most advanced technologies, especially in complex substrates and high-end packaging, which we absolutely need to secure because of the volume that we're going to be ramping in the next few years.\n\nI mean, just take the -- as one example, the $800 million of incremental cloud-optimized silicon wins. That all is five-nanometer technology using advanced ABS substrates, very customized packaging. Those agreements to get that capacity from really the best vendors, you need to put that in place literally years in advance. And so, we've done those types of things, and we feel good about that because they're tied directly to committed programs.\n\nSo, as Jean said, overall, while we have obligations, we think they're actually a benefit to us, and it certainly helps us underwrite our future success. And we're able to send a strong message to our customers about how we're able to provide the necessary capacity and supply chain for them -- for their future.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nThanks, Matt.\n\nOperator\n\nOur next question comes from Ross Seymore with Deutsche Bank. Please go ahead.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nThanks for letting me ask a question. I guess kind of a two-parter going back to the data center side, Matt. Could you just level set us, what percentage of the third quarter data center business was storage? And then looking forward on the more kind of constructive side of things, what's your confidence level on that $400 million in incremental cloud-optimized revenue growth next year? Given the fact that you talked about a deceleration in what's happening at the cloud customers themselves, are you at all worried about that $400 million being something less than that or being pushed out? Is that at all a level of conservatism that we should consider?\n\nMatt Murphy -- President and Chief Executive Officer\n\nSure. Yeah. Let me answer the second one first. The answer is we feel very good about that revenue stream.\n\nPart of it is, if you remember, Ross, we went from talking about the $400 million and $800 million to actually talking about, call it, $400-plus million $800-plus million because we had gotten additional design wins that created a little bit of a buffer as well because I think even if we hedge it for next year and the volumes don't quite achieve what we would have thought, we actually had one additional business that gives us some comfort around that. But I would say all the programs are on track. We are fortunate that despite the changing environment, I would say we are absolutely head down in trying to take out multiple new products right now that need to ramp up in very significant volume next year. And I'm personally involved in these with our customers to ensure we're meeting their schedule, and we're doing everything possible to get there.\n\nSo, that's the good news that the programs are still on track. And I think that's a good thing. The percentage -- I think your other question was, what was the percentage of data center revenue that's in storage?\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nWell, other way around, if storage falling is the headwind for data center, just to level set people, you had 30% roughly of your business in storage or in data center?\n\nJean Hu -- Chief Financial Officer\n\nYeah. Ross, maybe I can help you. Yeah, I can help you with that. In general, the way to think about this, our storage business, it's probably about one-third of the data center -- total data center business; average, right, not a particular quarter.\n\nBut of course, when we go through the inventory correction, as Matt mentioned earlier, that's going to be the largest drop piece for the inventory correction.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Harlan Sur with JPMorgan. Please go ahead.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nGood afternoon. Thanks for taking my question. Matt, you talked about the impact on a more muted cloud capex spend on your overall data center business. Most pronounced in storage, but you do have compute, you've got networking, you've got optical products as well.\n\nAnd looking specifically at your cloud optical connectivity segment, which obviously is PAM4 DSP, your color solution. If I look back at the last cloud spending slowdown, which was in 2019, both of these segments combined grew about 35%, 40%, right? Granted, this was still in the early innings of the 200, 400 gig upgrade cycle. But part of it is also very strategic in nature because your customers are still trying to enable better performance through higher networking speeds. So, I guess kind of two questions.\n\nNear term, is the team dealing with inventory issues in these particular optical products? And then looking into next year and the team see continued growth in cloud optical?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Great. Thanks, Harlan, for the question. And you're right, it is a little bit of a different situation than a few years ago where that was fairly nascent technology, really ramping up hard in an inflection curve.\n\nThat being said, we still see strong adoption of 800 gig. We've seen strong momentum in 400ZR in the new platform. And we expect that, you know, overall optics is going to grow, you know, next year. That being said, I would say, you know, in the fourth quarter, part of the adjustment would be in that area.\n\nBut I think that's a shorter-term thing. And again, because to your point, it's so strategic, we anticipate that optics is going to continue to grow. And by the way, we're heads down on new product development there as well because, for the next generation of high-end 51.2T switches, you're going to need the associated optics with that, which then moves from 800 gigabits per second to 1.6 terabits per second. And so, that's an ongoing new product development activity we have.\n\nSo, lots of activity in that area. Super exciting, but it's a little bit of a different environment than 2019 just because there has been more broad adoption, but we do feel good about it.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nThanks, Matt.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYep.\n\nOperator\n\nOur next question comes from C.J. Muse with Evercore. Please go ahead.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah. Good afternoon, and thank you for taking the question. I guess, Matt, I was hoping to spend a little bit of time on the enterprise networking side of the house, roughly $1.4 billion business for the fiscal year. And you talked about a China slowdown.\n\nIs there a way to kind of parse between China and non-China and how you're thinking about the trajectory into January and all of calendar '23?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. That's a good question. The -- as we indicated, China is down a lot, right, in Q4 from where it was just two quarters ago. That may end up being a little bit a little bit of an overcorrection.\n\nIt's hard to tell, quite frankly, on what's going on there and how long that's going to last and how that ripples through. The non-China has been holding up very well. Again, I'd say based on the content gains we have, as well as the -- just the new products that are ramping up with higher ASPs. And so, that's sort of offsetting it to some extent.\n\nWhat we are guiding for Q4, enterprise networking overall, it's still down just because of the China factor. But I'd say if I had to handicap it for next year, non-China will be a bigger percentage of the total in fiscal '24 than China. But I don't have the exact numbers at the tip of my fingers here. A lot of this goes through the channel and other -- it's -- yeah, I just don't have those numbers in front of me.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Christopher Rolland with Susquehanna. Please go ahead.\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nHey, guys. Thanks for the question. I wanted to follow up on carrier infrastructure as well. So, a couple of things.\n\nI guess, first of all, your agreement with Nokia and the extension there. I was wondering if there's any economics associated with that. And then secondly, looking out into next year, there's a lot more talk about India, 5G, Nokia winning, Samsung winning there as well. What does the opportunity look like there for growth? Is this going to be sizable overall? Thanks.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Thanks, Chris. On the Nokia front, again, it was great to see us being able to announce with them our Layer-2 transport processor. Recall the initial engagement with them, which was very successful, and it's great to see how well they did was on the Layer-1 baseband processor.\n\nAnd that -- I think that partnership has led to now a broader engagement. And so, as you probably know, you followed the space, the Layer-2 transport or CPU is a critical component, right, with fairly meaningful content as you sort of roll forward. So, I think that's all very positive. And on India, that -- they seem to be gearing up for a very aggressive rollout next year.\n\nAnd I think, to your point, a few of our key customers are well-positioned to take advantage of that ramp. And so, that's why we said earlier, we feel really good about wireless next year, I think both on sort of our content gains, as well as our -- but probably, even more, the regional deployments. And I think India probably will be sizable would be my guess.\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nThanks, Matt.\n\nOperator\n\nOur next question comes from Tore Svanberg with Stifel. Please go ahead.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nYes. Thank you. And if you don't mind, I'm going to ask a question that's not related to the next two quarters. And it does have two parts.\n\nSo, first of all, the UCI-Express standard is that something that could potentially accelerate the adoption of CXL. The reason I'm asking is because, last time on the call, you talked about maybe CXL not contributing to revenues probably for the few years, but there does seem to be a lot of activity here that could potentially pull that timeline in a little bit.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. I think the CXL timing, a lot of that is going to be gated tory by the server CPU cycle. And I think companies are gearing up for that. It may have gotten lost in the noise, but we did call out and I called out in my prepared remarks that we had received a pretty significant design win in this area, which we're now well underway in terms of product development.\n\nAnd then I'd say there's a very large pipeline of semi-custom products behind that, as well as a merchant product. So, I think that activity is still -- level of activity is very high with our customers. But I wouldn't -- I don't have visibility to any sort of change in terms of when those products would ramp necessarily. But it's a very strategic new area for us.\n\nAnd I'd say we continue to be focused on building a leadership position there. A lot of these products, especially as you get into the larger pooling devices, accelerators, these are, in some cases, have multicore CPU. They're in five-nanometer. They have security features.\n\nThere's quite a few things that we're adding. And so, these are looking more and more like very customized SoCs, which then enable these customers to really take advantage of completely new architectures relative to how they interface their CPU, GPU, XPU, whatever you want to call it, ASIC with memory. And so, I think that's going to continue to be a very strategic area of focus. And getting a large win committed and underway is a really good thing.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nGreat. And the second part of the question was related to your new product, and you did mention this earlier. So, AEC, when should we expect Marvell to get some revenue contribution from AEC? Is that also sort of a few years out? Or could you already start to see some revenues next year?\n\nMatt Murphy -- President and Chief Executive Officer\n\nI think we need to let that one play out a little bit, Tore. We're taking that one step at a time. I think the milestone really was lining over the last year, really getting our solution designed in across a broad array of high-volume proven cable suppliers to the largest hyperscale companies, and we've done a great job there. And we've now started sampling those, and we have a very high level of interest.\n\nBut at this juncture, we haven't really sized exactly our opportunity and the timing. But we'll do that in due course as we get better visibility to the take up of our customers that are competing in this market. But that trend is very real. The AEC trend is anyway.\n\nAnd we hope to be an important part of it.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nVery good. Thank you.\n\nOperator\n\nOur next question comes from Ambrish Srivastava with BMO. Please go ahead.\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nThank you. I just wanted to come back to the clarification for Jean. Looking at the data center business and the storage component in the last quarter that you reported that segment before changing the reporting, I see $300 million without Inphi and then you had given a number of $340 million with Inphi. And the number you just cited, a third of the recent quarter, it seems really low.\n\nThat would mean $190 million, $200 million number rounding up. Is there something I'm missing there or a large chunk of that is now in some other business?\n\nJean Hu -- Chief Financial Officer\n\nYeah. Yeah. Maybe. Let me just recap and clarify.\n\nI think before we change the reporting, our storage business annualized run rate is about $1.4 billion. So, that's what you are mentioning before we change the reporting by end market. That's what our overall storage business. Just as a reminder, it includes flash controller preamp and also fiber channel.\n\nSo, it's all the different storage product lines included there. And over time, the storage has come down. The number I mentioned, one-third, is not a particular last quarter. You know, generally, when you look at several quarters, on average, it's one-third.\n\nThe first half definitely is much higher and now it's much lower, right? When you think about $1.4 billion storage revenue I'm talking about, about 60% is in data center. That's what we told investors during our Investor Day. So, hope that's how you clarify different pieces.\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nYeah. No, it does. So, that means it's come down from $1.4 billion annual run rate to $800 million, right?\n\nJean Hu -- Chief Financial Officer\n\nI don't think the way you can think about that. It's $1.4 billion. The first half of this year, it probably was much higher than $1.4 billion annualized run rate. And now it's dropping much lower, right? The second half of the run rate probably is very low.\n\nYeah.\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nGot it. OK. OK. That is very helpful.\n\nThen I had a follow-up for you, Matt. Looking at storage, and I don't follow the disk drive guys, but Seagate consensus has been down three quarters in a row WD, two quarters for the mass storage business. And then you throw in the bullwhip effect. So, you're seeing a much bigger impact than consensus has those guys modeled.\n\nIs that the right way in terms of timing a couple of quarters before this business comes back? And then the other businesses within data center that -- thanks for the clarification earlier, and that it's not just storage. When do those businesses -- because that magnitude is less, right, in terms of no real bullwhip effect yet. So, if you combine all that, should we be modeling past December, a couple of quarters of sequential declines?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. So, let me break that into two pieces. I think you absolutely nailed it when you talked about the end customer kind of dynamics and their trajectory versus ours, that is exactly the bullwhip effect. I mean, you could actually just draw the bullwhip, and you can kind of slap where we would be on that.\n\nAnd that's why -- and we've seen this historically in any business where you're kind of one additional step removed, you tend to have more volatility, right? It's just the way it works. So, that, I think, you can expect. And again, we don't know exactly, but we anticipate just on past experience, it's probably a couple of quarters to work through that. And then on the other piece, which was the nonstorage piece, yes, it's inventory digestion.\n\nI mean, we've kind of taken a view, Ambrish, which is -- and I've been through different scenarios in my career here on how you manage when volume -- when demand drops, and you can kind of work with people and manage a soft landing or you can keep shipping and then you pay the price later in a very hard way. And so, our view has been, let's get through this and get it behind us. And also get to a point where, as you can -- as you get your visibility up and inventory goes down and lead times turn to normal, your forecast accuracy improves. I mean, I think, you know, that old adage is, well, you know, the worst forecast you're going to get is if somebody gives you 52 weeks of orders, you're actually better off having a more normalized environment.\n\nSo, that's really what we're striving to do there. And so, while there is some inventory adjustment, it's fairly normal given the shift in slope in the capex trajectory. And we have new products ramping. And so, that probably works its way through fairly quickly as well.\n\nBut we'll have to see the exact timeframe. Like I said, it's still a little bit of a dynamic environment.\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nYeah. Thank you for being super transparent about it.\n\nMatt Murphy -- President and Chief Executive Officer\n\nNo problem. Ashish, do we have time for one more? Should I just wrap it up with some closing comments?\n\nAshish Saran -- Vice President, Investor Relations\n\nYeah. Go ahead. Wrap it up, Matt. Thanks.\n\nMatt Murphy -- President and Chief Executive Officer\n\nPerfect. Yeah. Well, thanks, everybody, for all the questions. Just a little bit of a few comments as we close here.\n\nLook, first, I think Q3 was a great quarter for us. I mean, we're in the middle of a pretty severe macroeconomic environment. A lot of other companies have obviously seen some of this inventory digestion and impact earlier. But in Q3, we delivered record revenue, very strong operating margins.\n\nEven if you look at the fourth quarter guide and you kind of compare our second half of this year to a year ago, we're up about 15%. And when you look at sort of the rest of the market, take sort of large digital peers, that peer group is down about 5%. So, we still think even with a softer Q4 guide, we continue to perform very well from a top-line perspective. I'd say also we've been disciplined on managing expenses.\n\nThe pro forma FY '23 will grow about 28%. And if you look at our opex increase, it's about 14%. So, we've been basically growing operating expenses at about half the rate of revenue growth. And we've been able to put together a world-class team, as a result, to execute on these massive design wins we've gotten over the last few years.\n\nAnd so, while we're going to be disciplined in our spending, and Jean sort of gave you the model on opex. We feel very good about the size of the team, the resources we have, and the ability to execute, which our customers are counting on. And I believe if we do that, there's even more to come. So, in conclusion, we continue to have the right strategy with really strong partnerships with key customers.\n\nWe think we're in the right markets. And the growth drivers of cloud, 5G wireless communications, and automotive continue to be three of the largest growth opportunities in the semiconductor industry, and Marvell is extremely well positioned there. So, thanks for all the questions. I'm sure we can be more helpful in the callbacks as well.\n\nThere's a lot of moving pieces. But thank you so much for your time today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAshish Saran -- Vice President, Investor Relations\n\nMatt Murphy -- President and Chief Executive Officer\n\nJean Hu -- Chief Financial Officer\n\nBlayne Curtis -- Barclays -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nMore MRVL analysis\n\nAll earnings call transcripts"
}