{
  "companyName": "Verint Systems",
  "companyTicker": "VRNT",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/verint-systems-vrnt-q2-2023-earnings-call-transcri/",
  "content": "Verint Systems (VRNT 0.06%)\nQ2 2023 Earnings Call\nSep 07, 2022, 4:30 p.m. ET\n\nOperator\n\nHi, and welcome to the Verint fiscal year '23 second quarter conference call. [Operator instructions] As a reminder, today's conference call is being recorded. I will now turn the call over to your host, Mr. Matthew Frankel, investor relations and corporate development director.\n\nPlease go ahead.\n\nMatt Frankel -- Investor Relations and Corporate Development Director\n\nThank you, operator. Good afternoon, and thank you for joining our conference call today. I'm here with Dan Bodner, Verint's CEO; Doug Robinson, Verint's CFO; and Alan Roden, Verint's chief corporate development officer. Before getting started, I'd like to mention that accompanying our call today is a slide presentation.\n\nIf you'd like to view these slides in real-time during the call, please visit the IR section of our website at verint.com, click on the investor relations tab and then click on the webcast link and select today's conference call. I would also like to draw your attention to the fact that certain matters discussed on this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and other provisions of the federal securities laws. These forward-looking statements are based on management's current expectations and are not guarantees of future performance. Actual results could differ materially from those expressed in or implied by these forward-looking statements.\n\nThe forward-looking statements are made as of the date of this call, and as except as required by law, there assumes no obligation to update or revise them. Investors are cautioned not to put undue reliance on these forward-looking statements. For a more detailed discussion of how these and other risks and uncertainties could cause Verint's actual results to differ materially from those indicated in these forward-looking statements, please see our Form 10-K for the fiscal year ended January 31, 2022; our Form 10-Q for the quarter ended July 31, 2022, when filed, and other filings we make with the SEC. The financial measures discussed today include non-GAAP measures as we believe investors focus on those measures in comparing results between periods and among our peer companies.\n\nPlease see today's slide presentation, our earnings release in the investor relations section of our website at verint.com for a reconciliation of non-GAAP financial measures to GAAP measures. Non-GAAP financial information should not be considered in isolation from, as a substitute for or superior to GAAP financial information, but is included because management believes it provides meaningful supplemental information regarding our operating results when assessing our business and is useful to investors for informational and comparative purposes. The non-GAAP financial measures the company uses have limitations and may differ from those used by other companies. Now I'd like to turn the call over to Dan.\n\nDan?\n\nDan Bodner -- Chief Executive Officer\n\nThank you, Matt. I'm pleased to report another strong quarter with strong momentum across key cloud KPIs driven by brands looking to close the engagement capacity gap. Verint Cloud Platform is differentiated, especially for organizations that want to deliver a world-class customer experience while managing legislation, workforce retention and other workforce-related challenges. Changing workforce dynamics make it more urgent for brands to deploy AI-driven solutions to help increase their workforce capacity and be able to do more with limited resources and budget.\n\nWith our cloud platform, in Q2, we experienced continued momentum across bookings, cloud mix, revenue and EPS with many significant customer wins. Our topline growth metrics were impacted by the U.S. dollar appreciation. But at the same time, our bottom line results were not impacted.\n\nLater, we will discuss how Verint is in a unique position with a natural hedge that helps neutralize the impact of currency fluctuations on the bottom line. Let's take a closer look at our Q2 and H1 results. In Q2, revenue came in at $223 million on a GAAP basis and $224 million on a non-GAAP basis. Since our last earnings call, the dollar continued to appreciate and the FX impact on our Q2 and H1 revenue growth has been around 2 percentage points.\n\nOn a constant currency basis, non-GAAP revenue came in at $229 million, reflecting 6% year-over-year growth. And for H1, revenue increased 8% on a constant currency basis. Looking at the full year, we are pleased with our first half growth, which is on track with our expectations for around 7% revenue growth for the full year, also on a constant currency basis. As a reminder, about 20% of our revenue is generated in foreign currencies.\n\nAnd given the significant changes in FX rates, we plan to discuss our results and guidance on a constant currency basis through the end of the year. At the same time, I'm glad to report that the FX had a minimal impact on our bottom line because we are uniquely positioned with a natural hedge. This is due to the fact that about one-thirds of our expenses are in foreign currencies. Therefore, the appreciation of the U.S.\n\ndollar reduces our non-U.S. dollar expenses, largely offsetting the revenue reduction. This natural hedge results in minimal FX impact to our bottom line reported results and guidance. In Q2, non-GAAP diluted EPS came in at $0.56, ahead of our expectations.\n\nFor the second half of the year, we plan to continue hiring to support our growth targets. For the full year, we continue to expect diluted EPS of $2.50, unchanged from our prior guidance. Turning to booking growth. In Q2, we had many significant wins from existing and new customers.\n\nNew PLE bookings increased 10% on a reported basis and 12% on a constant currency basis, in line with our target of 10% to 12% growth for the year. Let's take a closer look at some Q2 cloud KPIs. We received 28 cloud orders in excess of $1 million TCV as large enterprise customers continue shifting to the cloud. These large cloud orders included some of the more notable brands in the world, such as auto industry leader, Ford; global insurance provider, AXA; global logistics leader, FedEx; and leading financial institution, Citigroup.\n\nIn addition, we continue to win many new customers. And in Q2, we added more than 100 new logos, including insurance provider, Oscar Health; and telecom provider, Selco. Another strong metric was our booking mix with 65% of our new PLE bookings coming from SaaS in Q2 compared to only 53% in Q2 of last year. For the full year, we expect our shift to SaaS to continue.\n\nTurning to cloud revenue. In Q2, constant currency cloud revenue increased 30% on a GAAP basis and 29% on a non-GAAP basis. In H1, constant currency cloud revenue increased 34%, in line with our annual plan. And we are maintaining our guidance of 32% to 34% on a constant currency basis.\n\nAs a reminder, our cloud revenue includes both SaaS and optional managed services. We continue to see strong SaaS adoption across industries and geographies and across new and existing customers. During the first half of the year, our SaaS revenue was very strong, increasing 41% year over year. Optional managed services did not grow in the period as they are low-margin people-driven services, which we provide optionally to our customers.\n\nAnd I'd like to mention that we do not target growth in managed services. Our cloud momentum continues across our existing customer base and with new customers. And this year, we expect non-GAAP cloud revenue to represent about 75% of our total recurring revenue as our perpetual support base continues to transition to the cloud. This metric is up significantly from 62% last year and 49% two years ago.\n\nOur strategy has been to help customers transition to the cloud when they are ready and to offer a hybrid cloud platform for maximum customer flexibility. We believe that many customers who have not yet moved to the cloud are in the process of planning a transition over the next few years. The cloud transition drives more value not only to Verint but also for our customers. as we offer accelerated innovation and a faster time to value in the cloud.\n\nOverall, I'm very pleased with the strong cloud momentum in the first half of the year. Now let's take a closer look at some of the competitive wins in Q2. I would like to highlight three Q2 cloud wins. The first order for $6 million was for a leading transportation company, replacing another vendor and expanding functionality with the Verint Cloud Platform.\n\nWe believe we won this large order due to our Verint Da Vinci AI differentiation, the strong ROI we offer and the Verint platform openness and breadth. The second order for $3 million was for a customer in the healthcare industry. This fast-growing, digital-based healthcare company selected the Verint Cloud Platform to help them manage knowledge and generate insights for the workforce. We believe Verint Da Vinci AI differentiation, the strong ROI we offer and the platform's enterprise scalability, were key reasons why we won this opportunity.\n\nAnd the third win for $2 million was for a customer in the insurance industry. This customer replaced its legacy vendor and selected the Verint Cloud Platform to improve the quality of its interactions and customer experience. We believe we were selected due to Verint Da Vinci AI differentiation and our reputation as a trusted long-term partner. Turning to innovation.\n\nI would like to provide an update on our One Workforce initiative, which we reviewed during our Investor Day in June. As discussed, many brands are under pressure to close the engagement capacity gap and do more with the same resources and budget. Digital transformation has created many organizational workforce silos, with each silo dedicated to a communication channel, which leads to poor customer experience and workforce inefficiencies. One Workforce is designed to help brands eliminate those silos and create a unified workforce of people and bots working together to drive world-class customer experiences.\n\nAs part of our One workforce initiative, we launched a new channel automation offering that orchestrates people and bots across digital and social channels. With the new channel automation offering, a unified workforce can become more efficient as agent capacity is dynamically allocated across channels based on real-time demand. More than that, consumers have the flexibility to seamlessly switch across channels. For example, if the customer decides to terminate an interaction they started via social channel and to later reengage via our chat channel, the history of their prior interactions will be preserved and they will not need to start all over.\n\nThe Verint One Workforce initiative is powered by Verint Da Vinci AI, which is at the core of our platform. Verint Da Vinci delivers customer engagement specific AI that we developed based on decades of machine learning modeling for real customer data. Verint Da Vinci makes the Verint One Workforce highly differentiated in terms of the ROI it could offer to our customers. We are pleased to have received strong industry recognition to our Verint Da Vinci-driven platform.\n\nIn the conversational AI category, IDC's worldwide conversational AI platform vendor assessments rank Verint as a leader in the top right quadrant of its highly respected market scape. More recently, in the self-service category, DMG in their AI-enabled self-service for the enterprise report noted that Verint received top scores in multiple customer satisfaction categories, including a perfect five out of five in the overall vendor satisfaction and product satisfaction categories. In summary, looking back on our first half results, I believe that driving our strong momentum is our focus on helping customers close the engagement capacity gap with market-leading AI innovation. Before turning the call over to Doug, I would like to discuss a succession plan for our CFO.\n\nAfter 16 years at Verint, Doug will be stepping down as CFO during Q4. And Grant Highlander will become Verint's new CFO at that time. Grant has more than 20 years of experience in financial operations. He joined Verint seven years ago and has played a leading role in our cloud transformation.\n\nWe are very grateful for Doug's expertise and stewardship as well as his efforts in developing Grant as a successor. Doug will continue to report to me in an advisory role after we complete the transition. And now let me turn it over to Doug, who will provide more details on our results and guidance. Doug?\n\nDoug Robinson -- Chief Financial Officer\n\nYes. Thanks, Dan. Good afternoon, everyone. I appreciate your kind words, Dan, and I very much enjoyed my time at Verint, working with you and the team as we've grown and transitioned the company over the years.\n\nWe've got a strong financial organization, and I feel fortunate to have someone with Grant's caliber to succeed me as well as have the strong surrounding team in place to continue to take Verint forward. I look forward to working with Grant and the team in advisory capacity following the transition date. Now let me begin with the Q2 call. Our discussion today will include non-GAAP financial measures.\n\nA reconciliation between our GAAP and non-GAAP financial measures is available, as Matt mentioned, in our earnings release and in the IR section of our website. Differences between our GAAP and non-GAAP financial measures include adjustments related to acquisitions, including fair value revenue adjustments, amortization of acquisition-related intangibles, certain other acquisition-related expenses, stock-based compensation expenses, separation-related expenses, accelerated lease costs as well as certain other items that can vary significantly in amount and frequency from period to period. Certain metrics, it also includes adjustments related to foreign exchange rates. As Dan mentioned, given the significant appreciation of the U.S.\n\ndollar this year, I will be discussing certain results on a constant currency basis today to better understand our business performance. In Q2, non-GAAP revenue increased 6% year over year on a constant currency basis and diluted EPS came in at $0.56, ahead of our EPS guidance. For H1, non-GAAP revenue increased 8% year over year on a constant currency basis and diluted EPS came in at $1.07. We're pleased with our Q2 and first half results, and I believe we are well positioned to meet our annual targets for both revenue growth on a constant currency basis and for EPS.\n\nLet me give you a bit more detail on our exposure to the foreign exchange movement. Most of our foreign exchange exposure is in British pounds, euros and the Australian dollar. In the first half, around 20% of our revenue was transacted in foreign currencies. On the expense side, about one-thirds of our cost of revenue and operating expenses are denominated in foreign currencies.\n\nWe expect a similar mix in the second half. Our U.S. dollar mix of revenue and these expenses helps to mitigate the FX impact on our earnings as it creates a natural hedge regardless of whether the dollar appreciates or depreciates against the other major currencies. Turning to our cloud metrics.\n\nIn the first half of the year, our cloud KPIs came in strong across the board. In H1, cloud revenue increased 34% year over year on a constant currency basis, in line with our outlook for the year. New PLE bookings increased 19% year over year on a constant currency basis. Our mix of business continues to meaningfully shift toward SaaS.\n\nIn H1, 62% of our new PLE bookings came from SaaS, compared to 52% in the first half of last year. And the percentage of our software revenue that was recurring came in at 84%. I'd now like to discuss guidance for the current year ending January 31, 2023. Today, we are adjusting our prior revenue guidance to reflect the strengthening dollar while maintaining the same guidance of a 7% revenue growth rate on a constant currency basis.\n\nLet's look at the impact of FX on three key metrics. On a reported basis, our new revenue guidance is $920 million, plus or minus 2%, which corresponds to $940 million, our most recent guidance on a constant currency basis adjusted for recent FX rates. In other words, we're maintaining our original guidance of 7% growth on a constant currency basis. We expect cloud revenue growth of 32% to 34% on a constant currency basis.\n\nThis translates to $515 million of cloud revenue on a reporting basis, at the midpoint of our guidance. And we expect diluted EPS of $2.50, reflecting 10% year-over-year growth at the midpoint of our revenue guidance. Now let me provide you with some additional information for modeling purposes for the year. Relative to margins, we expect to see some modest gross margin and operating margin expansion for the full year.\n\nWe expect cash from operations to come in a bit above $200 million for the year, excluding nonrecurring items. Now let's discuss them below the line assumptions. For the remainder of the year, we expect around $1.5 million per quarter of interest and other expense. We expect about $300,000 per quarter of net income from a noncontrolling interest we have in the small joint venture.\n\nWe expect an approximate 11% cash tax rate for each quarter and for the year. And we expect around 76 million of fully diluted shares, flat with last year, reflecting the effect of our stock buyback program. I would also like to discuss the second half of the year for modeling purposes. We see the quarterly trend this year similar to prior years with a sequential increase in Q2 and a modest sequential increase in Q3, followed by a strong Q4.\n\nMore specifically, in Q3, we expect a $2 million to $3 million sequential increase in revenue and $0.02 to $0.03 in sequential increase in diluted EPS. In summary, we're pleased with our Q2 and first half results and are well positioned for a strong year and longer-term growth. We expect our revenue growth to accelerate to 7% this year on a constant currency basis. Looking at next year, we expect our revenue growth to accelerate again to around 9% on a reporting basis and around 10% on a constant currency basis.\n\nThis results in revenue next year of a little over $1 billion. We expect our margins to continue to gradually expand and are targeting double-digit diluted EPS growth. More importantly, we believe the breadth, openness and flexibility of our cloud platform and the Verint Da Vinci AI differentiation positions us well for long-term growth. With that, operator, let's open up the line for questions.\n\nThank you again, ladies and gentlemen.\n\nOperator\n\n[Operator instructions] Our first question comes from Shaul Eyal of Cowen. Your line is open.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nFirst, I want to convey my congratulations to Grant on the promotion. Doug, on your end, it's been a pleasure working with you over so many years. Dan, my first question is about the difference between the products and solutions that are being acquired by new logos versus those that are being progressed by existing customers. Any outstanding modules in either client category that you can talk about?\n\nDan Bodner -- Chief Executive Officer\n\nYes. So I think that from a product perspective, I don't see much difference. It's -- we see demand across the platform. I think that clearly, with new logos, we see substantially all the new logos are SaaS deals.\n\nWhile as you know, we still have a large base of customers that are in the process of converting to SaaS. So that will be a mix of on-prem and sometimes hybrid deals. But that's clearly when we land the new customers, they already start with the cloud platform. But I would say that One Workforce is an area.\n\nIt's not one solution, it's many solutions. But it's an area that gets a lot of attention from new logos and from the base. Because of the current environment, lots of organizations realize that they have silos. And obviously, silos is a source of inefficiency.\n\nSo they're looking for more efficiency. They're looking to create more capacity in the workforce with the same people and resources because, obviously, with wage inflation, that's now even more of a problem. We talked about the industry spending $2 trillion on labor and trying to manage that cost. And One Workforce is a solution to help them to close the capacity gap and create more capacity and with a pretty fast ROI.\n\nI think customers today are not looking just for ROI but they're looking for fast time to value and short-term ROI. So I think that's clearly an area of great interest, which I think is what's behind our strong Q2. On a constant currency basis, we over achieved revenue. We over achieved on EPS.\n\nAnd we had a double-digit booking growth. And I think what's driving this momentum is a lot of it is that demand for automation and for software that can help them manage the bigger expense of the labor expense by introducing more automation.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nUnderstood. And maybe as my follow-up, any elongated sales cycles? Are you seeing any additional scrutiny specifically as it relates to large transactions?\n\nDan Bodner -- Chief Executive Officer\n\nNo, we actually did not see in Q2 any trend of elongating sales cycles. And we were watching this very closely because obviously, we heard from other companies that they did experience -- again, I think, first, the results, $229 million on a constant currency basis and 12% PLE growth -- new booking growth suggests that we actually achieved our plan. So overall, there was no trend. Look, anecdotally, there were some deals that were pushed out.\n\nBut there are also some deals that came in earlier than we expected. And some deals eventually got bigger than where we started the quarter and some shrunk. But this is anecdotal. I don't think there was any evidence of sales cycles being allocated.\n\nAnd I think -- I speculate that this demand we see in the current environment is because of the benefits that our customers are getting from being able to address the capacity gap and to deal better with their increasing labor costs, which is not just wage inflation. It's also difficult -- still difficult to hire people, retain people, train people, have people working from a hybrid environment and managing the workforce remotely. So looking for tools that help to reduce that pain. And I think that's where Verint comes in very nicely and can demonstrate ROI very quickly.\n\nThank you so much for that.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nCongrats again to Doug.\n\nDoug Robinson -- Chief Financial Officer\n\nYes. Thanks, Shaul. Take care.\n\nOperator\n\nOur next question comes from Ryan MacDonald, Needham & Company. Your line is open.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThanks for taking my questions. I'll echo my congrats for Doug, best of luck. But maybe to start, Dan, can you talk about new SaaS ACV growth? And obviously, we saw sort of a sharp deceleration in that growth rate down to 2.7%. And just parse out what's going on there? And how much of that, if any, is FX impact versus something sort of fundamental within the business? Thanks.\n\nDan Bodner -- Chief Executive Officer\n\nYes. No, I think that this metric is always going to be lumpy. And we are expecting, similar to last year, about 30% to 40% growth in new South ACV.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nOK. And then so 30% to 40% growth still. But nothing anomalous, I guess, that came out in the quarter off of that?\n\nDan Bodner -- Chief Executive Officer\n\nNo, I think we expect Q3 to be strong in this metric. But it's not unexpected that it will be lumpy.\n\nDoug Robinson -- Chief Financial Officer\n\nLet me remind folks that last year in Q2 was a tough compare. So if you look at just this quarter growth rate, that's a little bit of an anomaly. We're looking at the full year when we expect good growth.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThat's helpful color. I appreciate it. And then maybe shifting to -- so you've been working and sort of integrating in over the last 1.5 years a consumption-based pricing model in addition to subscription-based pricing. I'm curious in the current environment, are you seeing any shift in preference from customers in the pipeline versus consumption versus subscription? And whether or not they like to prefer the more of the visibility on the subscription side than consumption? Curious if that's changing at all.\n\nDan Bodner -- Chief Executive Officer\n\nYes. So there is a lot of interest in this model. But as you know, for decades, the only pricing model in our industry was based on the number of users. So now we provide customers pricing model options.\n\nThey can still choose obviously, the number of users. But they can also choose the consumption-based. And the advantage of the consumption is more it's really obvious when you think about customers buying automation solutions because they -- with automation, they want to consume more because the more they consume, the fewer people they need. So today, what we see in this environment that customers are still experimenting with the consumption-based pricing.\n\nAnd they want to assess the impact on total cost of ownership over time. So they will test it but not going all the way because we are still in a relatively early stage. And the consumption-based pricing is still a very small part of our revenue. But we believe that over time, this could be a win-win model that motivate customers to consume more automation and offset the cost of the consumption with much larger ROI.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nExcellent. I appreciate the color. I'll hop back in queue. Thanks.\n\nOperator\n\nOur next question comes from Samad Samana of Jefferies. Your line is open.\n\nMason Marion -- Jefferies -- Analyst\n\nThis is Mason Marion on for Samad. Doug, best wishes and good luck on the next stage of life. So I'm going to ask a macro question from a slightly different angle. In light of the commentary from some other software companies, can you help us understand the bookings trends kind of throughout the quarter and what you're seeing today? Are you seeing any changes to customer behavior?\n\nDan Bodner -- Chief Executive Officer\n\nSo Shaul asked about trends. And I conclude that we see a lot of indoor information. But I don't think we see clear trend in our vision in terms of what customers want to do differently, more interest in ROI. That's one clear trend.\n\nSo ROI is how we lead the sales process. We start with discovery on what's the current status for customers, what's the potential ROI they can have. And we then help customers to realize how not only they can benefit from ROI theoretically, but many customers want to see how it's going to work in their own environment. And we are well positioned to do that because we've been selling business applications on an ROI basis for many years.\n\nSo if I look at the linearity of the year, for example, we did 48% of our guidance revenue in H1. That's pretty good. That's better than we had last year and the year before. It was around 47%, 47-point-something percent.\n\nSo we think that the linearity from a revenue perspective for the year is good. And in terms of bookings, our new booking target is 10%. We're now reporting on constant currency, so Q2 was 12%. Q1 was more than 20%.\n\nBut we still see more than 100 new logos joining us in Q2. So I think that despite of what we all are monitoring very closely in the macro environment, so far, it looks like we have a pretty good outlook for H2. And we are -- our assumption for guidance, as always, is we look at the demand environment. We're assuming what we can see in the market today.\n\nFor expenses, we expect some inflation, but we believe we can manage it. And we assume we're going to hire about 100 people -- hire more but add other people in H2 to a workforce ahead of next year growth. And in terms of the FX impact on the bottom line, we are very fortunate that we don't have an impact on the bottom line. So we're maintaining our 10% EPS guidance.\n\nMason Marion -- Jefferies -- Analyst\n\nUnderstood. And last one for me on the unbundled SaaS metric that you fell a bit this quarter. Can you help us understand that metric? Was it perhaps some deal slipping or perhaps that's where the majority of the FX impact was felt?\n\nDan Bodner -- Chief Executive Officer\n\nI think that unbundled search because of the revenue recognition associated with unbundled SaaS it will fluctuate quarter to quarter. But if you look at the overall SaaS growth in H1, it was 41%. So actually, I was positively surprised with more than 40% growth in SaaS. This was offset a little bit by managed services, which, as you know, is a low-margin services, which we provide optionally.\n\nSo we don't have any growth targets for managed services. But the SaaS business was strong in the first half. And I think when you combine that with 65% of our new booking in SaaS, that's more than 10% up from last year. Now 75% of our recurring business is as more and more customers converting their maintenance to SaaS.\n\nSo I think that trend of SaaS growth is very strong and customers are moving to SaaS in our industry. As I mentioned before, even customers that have not moved yet are in discussions with Verint about when they're going to move next year or the year after. And most customers are having some sort of a long-term plan to transition to the cloud. So I feel pretty good about SaaS growth in our industry.\n\nMason Marion -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nDoug Robinson -- Chief Financial Officer\n\nAnd from quarter to quarter, it will be a mix issue. What happens to go bundled versus unbundled? But overall, [inaudible].\n\nOperator\n\n[Operator instructions] Our next question comes from Peter Levine of Evercore ISI. Your line is open.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nQuestion and Doug, best of luck in your next venture. Two for me. Maybe I think the perception is that your software gets deployed after a larger contact center transformation, right? So if contact centers deployments get the slow, sales cycles extend. How do you think -- or how would you view the impact to your business if the macro kind of environment worsens here?\n\nDan Bodner -- Chief Executive Officer\n\nYes. So I think that -- maybe two parts to my response. One is I want to address the CCaaS element of the question. And second is how Verint will sustain a recession.\n\nSo in terms of CCaaS, as I mentioned before, we -- currently, we don't see elevated sales cycle. And if it does happen with fixed CCaaS, that's not happening for Verint. So I can only speculate why maybe there is something in CCaaS and we don't see it. But I think more importantly is that our platform is designed to close the engagement capacity gap.\n\nAnd maybe that's why the demand for this, when there is rising labor cost, the demand to generate ROI from business applications and not from infrastructure is starting to look different than for the infrastructure side. But in any event, I believe that perception that One Workforce can only come behind CCaaS is wrong. We do have many customers that are deploying One Workforce and completely separate from their decision on CCaaS. So I don't see that connection there.\n\nNow in terms of the macro environment, and I can only talk about what happened in prior recessions. And I think that in prior recessions very indeed much better than the IT industry. Our software is very sticky, and our renewal rates are very high. And even in bad economy, customers really need a software because they have to run customer service and they need to take care of their customers.\n\nAnd they have to run it in a very efficient way given the labor cost. And also, I think another reason is that we are an enterprise company, and we have some of the largest companies across many verticals. We have 10 out of the top 10 banks and nine out of the top 10 insurance companies and eight of the top healthcare companies. So these are pretty strong companies that need customer service.\n\nThey are B2C companies. Customer service is essential for them in good time and in bad time. And I think that the combination of all these reasons is why we've done relatively well in prior recessions. And we certainly know how to manage the bottom line.\n\nAnd even in COVID, which was not a recession but it was a crisis, we came up with improving bottom line. So I think that on a relative basis, we know how to manage a downturn in the economy. But more importantly, we want to help our customers deal with the greater problem, which is labor cost because that's labor -- wages inflation is, I think, the No.1 issue that customers really are concerned about.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nAnd maybe just one quick one for Doug. Sorry if I missed it earlier on the call, but can you quantify either in dollar terms or percentage what the FX impact was?\n\nDoug Robinson -- Chief Financial Officer\n\nYes. Well, for the year, it's headwinds on the revenue side about when we look at this year guidance at last year's rates or [inaudible] it hasn't happened yet, right? Headwinds do this, as I talked about earlier, got about one-thirds of our expenses are in foreign currencies, pound, euro, etc. And so that gives us expense savings when you translate it to U.S. dollars.\n\nSo we're holding the $250 million EPS. So we don't have a headwind to the EPS, just a headwind to revenue and kind of a tailwind to expense offsetting us. So we're fortunate in that regard. It does put a little pressure on the top line.\n\nSo you really have to look at constant currency to look at the true business performance of our top line.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nThank you for the questions.\n\nDoug Robinson -- Chief Financial Officer\n\nThanks, Peter.\n\nOperator\n\nI'm showing no further questions at this time. Let's turn the call back over to Matthew Frankel for any closing remarks.\n\nMatt Frankel -- Investor Relations and Corporate Development Director\n\nThanks, Valerie, and thank you, everyone, for joining us today. As always, please feel free to reach out with any questions you have. We'll look forward to talking to you again soon. Have a good night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Frankel -- Investor Relations and Corporate Development Director\n\nDan Bodner -- Chief Executive Officer\n\nDoug Robinson -- Chief Financial Officer\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nMason Marion -- Jefferies -- Analyst\n\nPeter Levine -- Evercore ISI -- Analyst\n\nMore VRNT analysis\n\nAll earnings call transcripts"
}