{
  "companyName": "Energy Transfer LP",
  "companyTicker": "ET",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/energy-transfer-lp-et-q3-2022-earnings-call-transc/",
  "content": "Energy Transfer LP (ET 0.08%)\nQ3 2022 Earnings Call\nNov 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Energy Transfer third quarter 2022 earnings conference call. All participants will be in a listen-only mode. [Operator instructions] Please note this event is being recorded today. I would now like to turn the conference over to Tom Long, co-CEO.\n\nPlease go ahead, sir.\n\nTom Long -- Co-Chief Executive Officer\n\nThank you, operator. Good afternoon, everyone, and welcome to the Energy Transfer third quarter 2022 earnings call. I'm also joined today by Mackie McCrea and other members of the senior management team, who are here to help answer your questions after the prepared remarks. Hopefully, you saw the press release we issued earlier this afternoon, as well as the slides posted to our website.\n\nAs a reminder, we will be making forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934. These statements are based upon our current beliefs, as well as certain assumptions and information currently available to us, and are discussed in more detail in our quarterly report on Form 10-Q for the quarter ended September 30, 2022, which we expect to be filed this Thursday, November 3. I'll also refer to adjusted EBITDA and distributable cash flow, or DCF, both of which are non-GAAP financial measures. You'll find a reconciliation of our non-GAAP measures on our website.\n\nI'll start today by going over our third-quarter financial results. We were pleased to report another strong quarter during which we generated consolidated adjusted EBITDA of $3.1 billion, which was up approximately 20%, compared to $2.6 billion for the third quarter of 2021. In the third quarter, we experienced a nonrecurring $126 million charge in the crude oil segment related to the resolution of a prior-year legal matter. In addition, we had an approximately $130 million negative impact due to the timing of the recognition of gains on hedged inventory in the NGL and refined products segment.\n\nAbsent these two items, adjusted EBITDA for the third quarter would have been $3.34 billion. Results for the third quarter benefited from higher volumes across all of our segments, including record volumes in the Midstream, intrastate, crude oil, and through our fractionators. In addition, the acquisition of the Enable assets in December of 2021 contributed to our growth over the prior period. DCF attributable to the partners, as adjusted, was $1.6 billion for the third quarter of 2022, compared to $1.3 billion for the third quarter of 2021.\n\nThis resulted in excess cash flow after distributions of approximately $760 million. On an incurred basis, we had excess DCF of approximately $265 million after distributions of $819 million and growth capital of approximately $500 million. On October 25, we announced a quarterly cash distribution of $0.265 per common unit or $1.06 on an annualized basis. This distribution will be paid on November 21 to unitholders of record as of the close of business on November 4.\n\nThis distribution represents a more than 70% increase over the third quarter of 2021. As a reminder, future increases to the distribution level will be evaluated quarterly with the ultimate goal of returning distributions to the previous level of $0.305 per quarter or $1.22 on an annualized basis while balancing our leverage target, growth opportunities, and unit buybacks. As of September 30, 2022, the total available liquidity under our revolving credit facility was approximately $2.32 billion. Now turning to our results by segment.\n\nI'll start with the NGL and refined products. Adjusted EBITDA was $634 million compared to $706 million for the same period last year. This change was primarily due to the previously mentioned $130 million negative impact due to the timing of the recognition of gains on hedged NGL inventory during the current period. We expect to fully realize the offsetting gains on our financial derivatives and physical forward sales as the majority settle in the fourth quarter with a small amount settling in the first quarter of 2023.\n\nAdjusting for the noncash timing matter around hedging, adjusted EBITDA for the third quarter would have been $764 million. Results in this segment were otherwise driven by higher fractionation, transportation, terminal services, and storage margins related to increased volumes and higher rates. NGL transportation volumes on our wholly owned and joint venture pipelines increased to 1.9 million barrels per day compared to 1.8 million barrels per day for the same period last year. This increase was primarily due to higher volumes on our NGL pipelines that deliver into our Nederland Terminal, as well as a record volumes on the combined Mariner East pipelines.\n\nAnd our average fractionated volumes set a new partnership record, averaging 940,000 barrels per day compared to 884,000 barrels per day for the third quarter of 2021. NGL export volumes significantly exceeded the third quarter of last year, driven by record Ethane exports out of both Nederland and Marcus Hook. At Nederland, this was driven by the second tranche of satellites contract going into effect on July 1, which doubled the volume commitments from the initial term. Year to date, we have loaded approximately 29 million barrels of ethane out of Nederland.\n\nAnd for full year 2022, we expect to load more than 40 million barrels of ethane out of Nederland, with that increasing to approximately 60 million barrels for 2023. In total, we continue to export more NGLs than any other company or country with our percentage of worldwide NGL exports remaining at approximately 20% of the world market. For Midstream, adjusted EBITDA was $868 million compared to $556 million for the third quarter of 2021. This was primarily due to the increased throughput and in all of our operating regions, favorable natural gas and NGL prices, and the acquisition of the Enable assets in December of 2021.\n\nGathered gas volumes were a record 19.1 million MMBtus per day compared to 13 million MMBtus per day for the same period last year. Excluding Enable, gathered gas volumes on our legacy assets were also a partnership record for the third quarter. Permian Basin and inlet volumes remain at or near record highs. We continue to utilize the Permian Bridge daily to optimize our available processing capacity as we await the completion of two new plants that are currently under construction.\n\nFor the crude oil segment, adjusted EBITDA was $461 million compared to $496 million for the same period last year. Earnings were offset by a $126 million charge related to the resolution of our prior-year legal matter. Absent this charge, adjusted EBITDA would have been $587 million for the third quarter of 2022. These results were otherwise driven by improved performance on our Bakken pipeline, increased throughput at our Gulf Coast terminals, stronger refinery utilization, and higher export demand, as well as the addition of the Enable assets in December of 2021.\n\nCrude oil transportation volumes increased to a record 4.6 million barrels per day compared to 4.2 million barrels per day for the same period last year, driven by higher crude oil prices and strong refinery demand, as well as the addition of the Ted Collins link and Cushing South pipelines and increased throughput through our Houston terminal. Excluding Enable, crude oil transportation volumes were also a record for the third quarter. In our Interstate segment, adjusted EBITDA was $409 million compared to $334 million for the third quarter of 2021. During the quarter, we benefited from increased rates, higher production in the Haynesville Shale that drove greater utilization on Tiger improved demand on trunkline and line CP, as well as the addition of the other interstate Enable assets.\n\nWe continue to see heavy utilization on many of our interstate pipelines, including Tiger, FGT, Stash, and Rover. And for our intrastate segment, adjusted EBITDA was $301 million compared to $172 million for the third quarter of last year. This was primarily due to higher optimization opportunities, increased retained fuel revenues related to higher natural gas prices, as well as the addition of the Enable assets. Utilization of our HPL System remains strong due to the increased demand for gas takeaway and our Rig pipeline system continues to flow at or near capacity due to increased activity in the Haynesville.\n\nTurning to a brief update on our M&A activity. In August of this year, we completed the sale of our 51% interest in Energy Transfer Canada for cash proceeds of approximately $300 million. The sale reduced our consolidated debt by approximately $850 million. It also allowed us to divest of these noncore assets at an attractive valuation and utilize the cash proceeds to further deleverage our balance sheet and redeploy capital within our U.S.\n\nfootprint. And in September of this year, we completed our acquisition of the Woodford Express LLC, which owns a Mid-Continent gas gathering and processing system for approximately $485 million. This bolt-on opportunity provided roughly 400 million cubic foot per day of cryogenic gas processing and treating capacity in Grady County, Oklahoma, as well as more than 200 miles of low and mid-pressure gathering lines in the heart of the SCOOP play. The assets are already connected to our inter and intrastate systems, as well as our gas-gathering system.\n\nThe system is supported by dedicated acreage with long-term, predominantly fixed-fee contracts. Now looking at recent developments at our ongoing growth projects. Year to date, Lake Charles LNG has executed 6 LNG offtake agreements for an aggregate of nearly 8 million tonnes per annum, including a 20-year LNG agreement with Shell NA LNG LLC that was executed in August. As we have previously stated, we expect to finance a significant portion of the capital cost of this project by means of the sale of equity in the project to infrastructure funds and possibly to one and more industry participants in conjunction with LNG offtake agreements.\n\nWe have recently signed nonbinding letter agreements with two Japanese customers for LNG offtake and we are in active negotiations with several customers for long-term offtake contracts for significant volumes of LNG. We are making progress on all aspects of the project and we're now targeting FID by the end of the first quarter of 2023. Upon completion of the LNG project, we expect to realize significant incremental cash flows from transportation of natural gas on our Trunkline pipeline system and other energy transfer pipelines upstream from Lake Charles. We believe that our Lake Charles LNG project will provide an important contribution toward solving the growing global energy demand.\n\nAs a reminder, our Mariner East Pipeline System is fully commissioned and capable to transform more than 365,000 barrels per day, including ethane. As we have previously mentioned, we completed work at our Marcus Hook terminal to allow us to increase ethane exports out of Marcus Hook. As a result, we reached a new record for ethane exports out of our Marcus Hook terminal in the third quarter. NGL demand both in the U.S., as well as from overseas customers continues to increase, and we have sufficient commitments to move forward with an ethane export expansion.\n\nEven though we expect to expand our ethane export capabilities at both our Marcus Hook and Nederland Terminals, these commitments provide us with the optionality to initially expand at either terminal. Construction of Frac VIII continues to schedule, and we expect it to be in service in the third quarter of 2023, which will bring our total Mont Belvieu fractionation capacity to over 1.1 million barrels per day. Construction of our new 200 million cubic foot per day Grey Wolf processing plant in the Delaware Basin is underway. This plant is supported by new commitments and growth from existing customer contracts and remains on schedule to be in service by the end of 2022.\n\nConstruction is underway on the Bear plant, our second 200 million cubic foot per day processing plant also located in the Delaware Basin, which was accelerated to meet growing demand. We expect this plant to be in service in the second quarter of 2023. In addition, given the significant amount of demand we're seeing, we are evaluating the necessity and potential timing of adding another processing plant in the region. Mainline construction of the Gulf Run pipeline was only finished, and we expect to complete the modification of compression by the end of this year.\n\nGulf Run, which is a 42-inch interstate natural gas pipeline with 1.65 Bcf per day of capacity will provide natural gas transportation between our upstream pipeline network and from the Haynesville Shale for delivery to the Gulf Coast, connecting some of the most prolific natural gas-producing regions in the U.S. with the LNG export market. It is backed by a 20-year commitment for 1.1 Bcf per day for Golden Pass LNG, and we recently concluded a nonbinding open season on Gulf Run due to the growing product demand. We're pleased with the results of the open season and customer discussions are ongoing, which will likely necessitate additional facilities beyond the initial design of the 1.65 Bcf per day.\n\nModernization and debottlenecking work on our Oasis pipeline continues, which will add an incremental 60,000 Mcf per day of much-needed capacity out of the Permian Basin. We expect it to be partially in service by the end of this year with full service by the end of January of 2023. In addition to these ongoing projects, we continue to evaluate and have customer discussions regarding a number of other projects that, over the long term, could provide significant upside to our business. These include the Warrior Pipeline project, which is the most optimal solution for customers to transport gas out of the Permian, as well as opportunities to develop a petchem project along the Gulf Coast or acquired petchem facilities.\n\nWe remain optimistic that we can bring these projects to FID and look forward to sharing any significant updates on these projects at the appropriate time. On the alternative energy front, our focus remains on reducing emissions across our pipelines, including pursuing a number of projects related to carbon capture and sequestration, enhanced oil recovery for use in the food and beverage industries, as well as sequestering CO2 from our proposed Lake Charles LNG liquefaction facility. We'll be excited to update you once we have a project and specific agreement in place. Looking at our growth capital spend for the nine months ended September 30, 2022, Energy Transfer spent approximately $1.3 billion on organic growth projects, primarily in the midstream, interstate, and NGL refined products segment, excluding SUN and USA Compression capex.\n\nFor full year 2022, we expect growth capital expenditures to be near the high end of our range of $1.8 billion to $2.1 billion. Over 90% of our 2022 growth capital spend is comprised of projects that are already online or are expected to be online and contributing cash flow before the end of 2023, at very attractive returns. We will provide our 2023 growth capital outlook on our fourth-quarter earnings call. For 2022, adjusted EBITDA guidance given our strong performance for the first nine months of the year, as well as continued demand for our products and services, we now expect our adjusted EBITDA to be between $12.8 billion and $13 billion.\n\nThis is up compared to our previous guidance of $12.6 billion to $12.8 billion. Overall, our outlook is strong as we have a stable business that has demonstrated its ability to manage through various market cycles. And we expect future growth to be supported by production, improvements, improved market conditions, increased utilization of our existing assets, as well as strong domestic and international demand for our products. We remain bullish about the future of our industry and the growing worldwide demand for crude oil, natural gas, and natural gas liquids.\n\nWe expect to reach our leverage target range of four to four and a half times by the end of 2022, and we will continue to strategically allocate our cash flow in a manner that best positions us to further improve our financial flexibility and leverage, invest in high-returning growth projects and return value to our unitholders. As we look for additional ways to address existing and new demand for our products, we will continue to pursue strategic growth projects that enhance our existing asset base and generate attractive returns as part of our capital allocation strategy. This concludes our prepared remarks. Operator, please open the line up for our first question.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] We ask that you please limit yourself to only one question and one follow-up. At this time, we will take our first question, which will come from Jeremy Tonet with JPMorgan. Please go ahead.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nHi. Good afternoon.\n\nTom Long -- Co-Chief Executive Officer\n\nHello, Jeremy.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nJust want to kind of start off with the LNG project, with Lake Charles, if I could. Just walking through a number of kind of different details that have emerged over the past quarter or so. You've had smaller competitors kind of fall by the wayside, if you will. Yet, it's still kind of an inflationary environment where it's hard to kind of lock in contractors, I think.\n\nJust wondering how you see these different influences coming together and how that impacts, I guess, your outlook for Lake Charles at this point.\n\nTom Long -- Co-Chief Executive Officer\n\nHi, Jeremy. Great question. A lot of moving parts to your question, but answer is in the LNG world right now. Obviously, as you've touched on, the EPC costs have escalated since our first bid we got two years ago, and that had an impact on pricing of liquefaction.\n\nWe have made good progress in increasing our liquefaction charge as we progress with new contracts. And we're excited about where we are in terms of being a bigger company with a strong balance sheet and a great natural gas pipeline network. We are one of the strongest with a brownfield facility with storage tanks and docs, we're really good position to get to the goal line.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. That makes sense there. And then maybe just kind of pivoting to the Permian a bit. If you could update us, I guess, as far as how you see the takeaway outlook evolving here at latest thoughts on Warrior.\n\nI imagine negative Waha prices do not hurt your business, but just wondering if you could provide more details on that, and I guess open capacity you have in maybe how that could increase over the first half of the year?\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nYeah, Jeremy. This is Mackie. We continue to be very excited about that project as we've experienced the last two or three weeks when there's any kind of a blip on any pipeline that's moving gas out of the Permian Basin. We see these wide spreads.\n\nWe do like most industry believe that as we get deeper in this year and throughout most of the next two years, it's going to get back. The base is going to blow out. We do sit in a very fortunate situation that we do have capacity available today, that actually gets a little bit more over the next few years across the state. So, we will be able to benefit from those wider spreads.\n\nBut at the same time, we offer the team diligently working toward getting to the finish line on Warrior and after the announcement of this other 42-inch line, it's going to move a couple of Bcf across. It's kind of slowed things down. But we will be the next pipeline that's announced out of there. We are not far the best option for anybody coming out of the Permian Basin, whether it's Delaware or Midland.\n\nWe provide Katy ship channel, as well as other really good markets off of our intrastate systems. So, we're keeping our head down, but we're going to be very prudent when we make that decision, and we hope to that in the next couple of quarters.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. That makes sense. I'll leave it there. Thanks.\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nThank you.\n\nOperator\n\nOur next question will come from Chase Mulvehill with Bank of America. Please go ahead.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nHey, good afternoon, everybody. I guess a question on ethane. Obviously, ethane prices have softened a little bit here. I'd be kind of curious on your thoughts about ethane rejection and kind of how that plays out over the coming quarters.\n\nAnd kind of rolling into that about your thoughts on ethane exports and if you see that as kind of a near-term release valve. Or do you actually think that we're running kind of up against full capacity there?\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nChase, this is Mackie. Yeah, we're just so pleased with what we've done as far as building out Marcus Hook and building out Nederland as around ethane as we've said, we now have sufficient contracts to expand. However, that will take three or four years to expand once we get to -- once we make the decision, whether it's in the North or along the Gulf Coast. But the way we look at rejection or recovery just depends on the region.\n\nSo, from an Energy Transfer standpoint, we may be projecting ethane in some areas and recovering in others. But right now, where ethane prices are and where gas prices are, we are recovering ethane in most of the regions. As you know, a tremendous amount of ethane is rejected daily up in the Northeast. There's a lot of ethane up there for our projects.\n\nAnd then as we head toward a decision to expanding at either Marcus Hook or at Nederland, we'll look at maximizing what we have today. As we've said in our opening remarks, satellite kicked into their second tranche. So, we've got that. We also have additional capacity that we will be fully utilizing on a month-to-month basis as the market dictates.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. So, another follow-up is just really on Lone Star. If I'm right, I think you've got some latent capacity there. But kind of what I'd like to ask is if there's opportunities for you to kind of work with some of your peers to maybe offload some of their long-haul Permian NGL volumes.\n\nI mean, the reason that I asked when your competitors actually delayed one of their expansion projects, you know, on NGL or Chinook and, you know, maybe somebody else announces something here later this week. But just kind of curious because you do have some latent capacity and just kind of if there's an opportunity for you to work with some of your peers and outflows some of those volumes and help the industry kind of be a little bit more capital-efficient.\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nYeah. This is Mackie again. Yes, I'd love to know who you're talking about, that's interesting, but please give my telephone number. We certainly would offer transportation to anybody through most popular pipe through our -- I mean, natural gas liquids through our pipelines.\n\nAnd we feel real good about where we're at. We -- over the last several weeks, we've set records out of the Permian. I think we exceeded 800,000 barrels a day. And actually, around our NGL business, we almost hit 1 million barrels here this past week of fractionation at Mont Belvieu with these colder temperatures.\n\nSo, we have the ability to move more volume, significantly more volume out of the Permian as our two new cryogenic plants come on by the second quarter of next year. So, we certainly have built it to accommodate our own barrels. But you've had -- does anybody out there and they're trying to get their barrels from Mont Belvieu, we would love to hear from.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nAll righty. Perfect. I'll turn it over. Appreciate the color.\n\nOperator\n\nOur next question will come from Marc Solecitto with Barclays. Please go ahead.\n\nMarc Solecitto -- Barclays -- Analyst\n\nHey, good afternoon. So, maybe following up on one of the earlier questions around why a basis exposure. I think a few quarters ago, you referenced a couple of hundred Mcf that was open with another couple hundred becoming available over the next couple of years. So, just wondering if you are sharing an update if you could provide that.\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nSure. I'll quantify it a little bit with no matter what I say, we are in negotiations on Warrior and that very easily could impact what capacity is available over the next year or two because that kind of comes into those negotiations. But notwithstanding that, we've got about -- we've had about 250,000 a day available. As we said in our opening remarks, we've got about another 60,000 coming available the latter part of this year and the first part of next year.\n\nSo, that puts us right around 300,000 a day that we'll have available as we sit here today.\n\nMarc Solecitto -- Barclays -- Analyst\n\nGreat. That's very helpful. And then just with respect to the updated guidance. First, I just wanted to clarify whether the previous guidance range included the legal settlement in the Crude segment.\n\nAnd then as we think about the upward revision, was that mostly a function of just upside to your conservative commodity price assumptions or other operational drivers? And then any variables between the lower and upper end of the revised range. Curious if you have any color there.\n\nTom Long -- Co-Chief Executive Officer\n\nYeah, Marc, this is Tom Long. Short answer is that the legal settlement was not included in the previous guidance. So, this guidance you see right now that we came up with does include the $126 million. But I will tell you it also includes the $130 million for the timing around the mark-to-market on some of the NGLs.\n\nSo, the guidance we're giving you right now of $12.8 billion, $13 billion does now include both of those. But as we highlighted in the prepared remarks, we are expecting the one -- or most of the 130 to come back to us in the fourth quarter. So, keep that in mind that that guidance does include what occurred in the third quarter, but the reversal of most of it in the fourth quarter. And, Marc, as far as I think the rest of your question that you were going through, we've always stayed fairly conservative on the commodity prices, and we continue to do that.\n\nI think you see with where some of the prices, at least on the natural gas side of it, are going to right now. It was prudent for us to do that. But at the same time, we don't have many months left in the year for much of an impact. You had quite a few other parts of that question, you may need to repeat what part of it I'm not answered here.\n\nMarc Solecitto -- Barclays -- Analyst\n\nJust as far as within the revised range, the upper and lower end, what are some of the drivers between the upper and lower parts of the range?\n\nTom Long -- Co-Chief Executive Officer\n\nYou know, it continues to be a pricing that was running a little higher than what we had anticipated. Once again, a little bit of that got shaved off with what you're seeing occur right now in the fourth quarter. The other piece of that is we just continue to have a, you know, great commercial team and the optimization efforts that are occurring across our system are really huge compliments to the team and what they're able to do. And so, that's probably the primary two drivers.\n\nMarc Solecitto -- Barclays -- Analyst\n\nGot it. Appreciate the time. Thank you.\n\nOperator\n\nOur next question will come from Gabe Moreen with Mizuho. Please go ahead.\n\nGabe Moreen -- Mizuho Securities -- Analyst\n\nHey, good afternoon, guys. It may still be a little bit early days, but can you talk about the capex outlook for next year? Whether you think you're going higher or lower? I realize there's still a lot of things on the drawing board. But just as you sit here today, kind of directionally where you things may be headed for capex next year?\n\nTom Long -- Co-Chief Executive Officer\n\nYeah. It's always a good question, Gabe. We worked hard in trying to hold off until that fourth quarter. And in fairness, a lot of that is because we do have so many great projects, Mackie was going over several of them.\n\nSo, you've got everything from the Lake Charles LNG to the Warrior to several other items, petchem, etc. So, it's really difficult probably to give you that right now. That's the reason we wait till the end of the fourth quarter to be able to provide that. But we've talked about pretty much everything that's out there that we're seeing.\n\nSo, if you really kind of go back to what guidance we've given this year, the $1.8 billion to $2.1 billion, there's -- there's not a lot of additional guidance we can give you for next year until we have a little more visibility into those. But as you can see, it's not going to be a really large number.\n\nGabe Moreen -- Mizuho Securities -- Analyst\n\nGot it, Tom. Thank you. And then maybe if I can follow up sort of on a two-part Haynesville pipeline question. I'm just wondering where you guys think you are in terms of, I guess, utilization out of all the multiple straws you have in and out of the Haynesville also, I guess, repricing contracts to market now that that capacity is really in demand.\n\nAnd the second part would just be kind of an update on Gulf Run and the possibility of expanding that with or without Lake Charles?\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nOK. Gabe, this is Mackie again. Yes. What an exciting area, my goodness.\n\nWho could've ever seen this? Maybe [Inaudible] saw years ago, but when you see these wells coming on to 50,000, 60,000, 70,000 days and holding out for a while, what a great place to own three 42-inch pipe and a whole lot of other systems. So, we're very excited about that. You touched on some things like we said earlier in our remarks, the rigs is pretty full. So, we're looking at backhauling that into some of our Enable assets to get down the Carthage and also get to our Gulf Run and Tiger pipelines.\n\nSo we're doing everything we can to utilize capacity in both directions on all of our pipelines in North Louisiana. Jump in the Gulf Run, very excited to be bringing that on by the end of the year. We've got the 1.65. We have 1.1 Bcf that's sold to Golden Pass for a long-term contract.\n\nWe also have secured another 350 of that. We've got a couple of hundred left that we are trying to extract as much value as we can as we finalize that. And we're continuing to evaluate what is the next step. Is it adding compression and adding a Bcf? Or is it looping the entire 42-inch? As we get closer and arrive at FID, we hope in the first quarter of next year on the Lake Charles, that will be very much the emphasis behind us probably looping that line, that 42-inch.\n\nSo, that is probably will end up once we get to FID there. But we also may do that anyway. In addition to that, as you said, we're really excited about values on Tiger and on CP, which will be Gulf Run. They narrow down to $0.04, $0.05, $0.06, $0.07, almost given the past way, and we are seeing that move out.\n\nAnd we're excited to see that. We're seeing wider margins. We're seeing a much higher value for gas east of Louisiana as you go further and a real need as you get closer to Florida. So, we're very pleased to where we sit, and we will fully utilize those to the maximum that we can for our revenues and our unitholders.\n\nGabe Moreen -- Mizuho Securities -- Analyst\n\nThanks, Mackie. And I have both to locate the ethane export expansion based on who wins the World Series, but I don't want to sure if that's how. Thanks for the time, guys. Appreciate it.\n\nTom Long -- Co-Chief Executive Officer\n\nThank you, Gabe.\n\nOperator\n\nOur next question will come from Ann Salisbury with Bernstein. Please go ahead.\n\nAnn Salisbury -- Bernstein Research -- Analyst\n\nHey. Your NGL segment was boosted, I think, a bit in the quarter by the Medford frac being down. I think that there's some new third-party frac starting by the end of the year and then early next year. So, do you kind of view this as a like a one-quarter boost? Or do you -- in your view, is can you kind of maintain that incremental earnings over multiple quarters?\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nHello, Ann. This is Mackie again. Yes, I'll kind of step back. We've really seen a tightening of T&F for really that last 18 months or so and over the last five or six months, early summer, mid-summer, it really got tightened.\n\nAnd now similar to some of the spreads on some of other assets, we're seeing it move out. So, if you just look at the frac spreads, we are very optimistic that whatever frac capacity we have available before our VIII frac comes on that will have significant revenues from that capacity. We see a very tightening of it. Yes, there's a frac coming on.\n\nOne of that's coming on isn't that accessible to Mont Belvieu, the fracs that are more accepted to Mont Belvieu, like ours and a few others really aren't until the third and fourth quarter and into '24 of next year. So, there's going to be a tightening of capacity there already is at Mont Belvieu, and we hope to benefit from that as the value of fracking -- fractioning there widens.\n\nAnn Salisbury -- Bernstein Research -- Analyst\n\nThat's really helpful. Thank you for that color. And then can you remind us currently on your Permian crude pipeline, just roughly how much is still take-or-pay? And if there's any recontracting interest yet on the part that's not take-or-pay or if you see that happening in the next couple of years when other pipelines start to roll off?\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nYeah. I don't have the exact numbers top off my head of how much take-or-pay, but it's a little bit of a loaded question a sense of what exactly that means. But we feel that pipe up as much as we can on that basis. There is some portion of it is locked in at wider spreads than where we see today.\n\nBut similar to what we just talked about, we believe, even with the overbuild of crude oil pipelines, we believe we'll see widening. And the reason we do with some of our customers is what we say on every earnings call and at other times is that we're not just offering Midland to Nederland or Midland to Houston service we're offering blending, we're offering storage. We're offering access into Bayou Bridge or into the header, and we're offering to feed into the refineries, as well as at the header systems and other pipeline systems, in Houston. So, we did see that start to move out here several months ago, and we do expect that to move out more.\n\nBut we don't have all that old contract that really like margins. Most of that's kind of way. And we are filling that in daily, monthly, and also doing term deals at what we see as slowly widening spreads.\n\nAnn Salisbury -- Bernstein Research -- Analyst\n\nGreat. Thanks a lot.\n\nOperator\n\nOur next question will come from Michael Blum with Wells Fargo. Please go ahead.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nThanks. Good afternoon, everyone. Just had a couple of questions. One, can you talk about once you get to that $1.22 distribution, I guess, looking into next year, how are you thinking about buybacks for distribution growth and I guess, especially in light of rising interest rates?\n\nTom Long -- Co-Chief Executive Officer\n\nThat's a great question, Mike, and we're so thankful to be talking about it from that standpoint versus the other alternatives. So, we -- I will tell you, at this point, we are planning this quarter by quarter as far as the distribution side of it and looking at it. There's not been dialogue on anything around the distribution growth. We'll -- well after the $1.22 in meeting our targets.\n\nSo, we're going to continue to look at that. When it comes to unit buybacks, I don't want to say that we're going to continue to look at paying down that debt. We really want to get that leverage target in that four to four and half range. And we'd be quite happy to get it to the -- closer to the four range.\n\nAnd we're going to have some opportunities next year with all the free cash flow that we're seeing and some of the debt maturities, we're going to continue to look at that. So, we would put that up there higher than unit buyback to get to the lower leverage, but also the great capital projects that we're talking about. Those likewise set up a little bit higher than the unit buyback. So, let us get to that point.\n\nIt is a good healthy discussion we have quarter by quarter with our board of directors as we look at the distribution and how we're going to do that. But right now, our target is to get to the $1.22. And my gosh, we've made great progress on that. It's great to be here at this level, 70% higher than where we were.\n\nSo, we've executed on it, and it's really looking like we've got ourselves to a great place from that standpoint.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nGot it. That makes sense. Thanks. And then just wanted to ask on the potential cracker.\n\nSo, obviously, there's some weakness in petchem fundamentals right now, spreads, etc. Does that give you pause in terms of making that investment? Does that give you -- make you more likely to want to make that investment? And does it change the calculus between buying versus building?\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nHey, Mike, this is Mackie. It certainly gives pause to people that we're trying to take capacity with right now. That's for sure. But the way we're looking at that project is we're not spending a material amount of dollars at this point coincidentally as of today, we have filed a second permit.\n\nSo, in the last couple of days, we filed our TCEQ permit, and we filed our core Wetlands permit. So, that kind of gets us going. That's -- those are 18- to 24-month processes depending on whether it goes to full-on EIS and all that. So, we've kind of started that and done all that work.\n\nOur team is working diligently with a number of players throughout the country and really the world. And there's a great deal of interest. We do believe we'll get there. But to answer your question, we're not going to get there unless we have sufficient commitments to get us a rate of return that meets our threshold.\n\nSo, if the hesitancy to sign up right now because the crack spreads are so narrow compared to what we need to build it. And we won't get anything signed. But we know the industry, as you and quite a many out there know is very cyclical. And you can generate a lot of income in a short period of time in the good times and then there's tough times.\n\nSo, we're approaching this project like we do everything. We're not going this to speculate to kind in a home run or not from time to time, we're going to line this up with both our partners potentially. As we've said, we anticipate we'll own about 25% at the end of the day, and we expect to bring in partners that will also be part of the yield they'll take. But as we go around all these customers, we continue to hear and believe that this will be the most unique and the most flexible cracker in the world.\n\nIf you look at the upstream pipeline as we talked about before, our pipeline network to all the refineries to bring butane products and gasoline byproducts, as well as we've got four pipelines that are feeding and can feeding enormous amounts of ethylene, propane, butane in natural gasoline to Nederland. And then you look at the takeaway, we'll have the ability to tie the storage for our customers and/or to deliver into ethylene and propylene pipelines and into the export market. So, once again, way early but that's going to be one of those projects that if we get to FID, we'll have sufficient commitments, some great customers to have a great project and a rate of return, and we'll have some good partners.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nThanks for all that. Appreciate it.\n\nOperator\n\nOur next question will come from Keith Stanley with Wolfe Research. Please go ahead.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nThank you. Two clarifications. First, Tom, it seems like you were alluding to probably paying down some debt again next year to try to get to the low end of the leverage target. I know the company has a decent amount of maturities for next year.\n\nCan you just talk to how you're planning on addressing that? Is it pay some down with cash? And then would you look to issue new debt here? Or would you look to leverage your short-term borrowing facilities more?\n\nTom Long -- Co-Chief Executive Officer\n\nYes, Keith, we're clearly looking at paying down as much as we can. They're still a little bit to go as far as getting what our free cash flow is going to be. But in fairness, we do have a very good capacity left on our revolver from our credit facility. So, we've got options as to how to navigate that, and we're going to be careful.\n\nI don't really want to get out in front of it and try to preannounce. But you nailed it when you said looking at trying to pay down as much as we can of it if not moving some of it to the revolver only because when you look out over the remainder of the year and you see what the free cash flow continues throughout the year, we -- we have a lot of financial flexibility right now is the way I'd like to leave that, and we're going to play the best options we can of reaching all the targets that we want to -- we're going after.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nGreat. And on Lake Charles, so it sounds like the base case is still for up to a 75% sell-down. But when you talked about 2023 capex that's Lake Charles was one of the areas of uncertainty when you look to next year. Are there scenarios where you could possibly need to fund a meaningful amount of Lake Charles next year as part of your capital budget? Or is that pretty unlikely?\n\nTom Long -- Co-Chief Executive Officer\n\nThat's -- I think funding a meaningful about next year will probably be more of what I would call unlikely probably very unlikely that we would have to do that for next year. But we'll see where it all goes. But at this point, based upon the way we would move through it -- through 2023, we'll leave it in the unlikely category.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nThank you.\n\nOperator\n\nAnd our last question today will come from Brian Reynolds with UBS. Please go ahead.\n\nBrian Reynolds -- UBS -- Analyst\n\nHi. Good afternoon, everyone. Maybe just one quick follow-up on the capital allocation. I was curious if you could just opine on how the desire for credit rating upgrade influences the timing and financial flexibility for buyback or an additional distribution base.\n\nAnd then maybe perhaps on just the growth capex. Having a little bit of priority was just curious as it relates to '23 capex specifically, if there's just limited upside to that number at this point given that Lake Charles seems to be pushed out a quarter or two at this point? Thanks.\n\nTom Long -- Co-Chief Executive Officer\n\nYeah. I think best way to start with that one is the target, the four to four and a half. Pretty much all three agencies put out there that you get to that closer toward maybe the lower end of that range. You're now looking at upgrades.\n\nAnd that is important to us. We really do want to continue to get into that four to four and a half and get into that next higher notch on the rating agencies. All the dialogue we had with them has been very constructive, by the way. We think that they hear us.\n\nWe think we've got a lot of credibility with them. And we're going to continue to have this dialogue with them. And so, it remains a priority, I would say, to continue to pay down the debt to get within those targets. Leverage targets that we've got laid out there.\n\nThe capital portion of your question, we really do -- when you really look at our entire infrastructure, you look at the critical mass we have, etc., when we look at these capital projects, they're looking at a much broader benefit that comes to our comes to Energy Transfer. And when the question was asked earlier about what are the drivers on the guidance, continuing to get moved up, and a lot of that is around the optimization when you really look at all the various access we have to some of the very best pricing points and the flexibility we have around that. A lot of these capital projects are very, very important, and we continue to work on the demand side. We've talked about the Lake Charles LNG.\n\nYou've heard us talk today a lot about the petchem. We're not trying to own a large percentage of a lot of these, a lot of these assets. What we're trying to continue to do is look at the demand side as much as we look at the supply side. So, these capital projects are important.\n\nWe do give them a high priority, and we'll continue to be very disciplined in how we spend every dollar.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. And I guess, just as a quick follow-up, it just seems like there's limited upside to '23 capex given those comments at this point.\n\nTom Long -- Co-Chief Executive Officer\n\nYeah. I'm sorry, I'm not -- do you mind, Brian, [Inaudible] one more time?\n\nBrian Reynolds -- UBS -- Analyst\n\nNew projects coming into the backlog, it seems pretty set from the slide deck that you guys provided that it doesn't seem like any new large projects have come into '23 capex and it's really more a '24 and '25 event if those projects come to fruition.\n\nTom Long -- Co-Chief Executive Officer\n\nYeah. That's a fair assumption. I'll just leave it as a fairly immaterial amount as far as 2023.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. Thanks. And then just quickly on the last question. I know we talked a lot about Permian and Haynesville spreads.\n\nCurious, is Golden Pass had open capacity all year during 2023? Gulf Run have open capacity, given Golden Pass income online for another year or so, and can effectively benefit from the spreads all year. And then second, is there an open capacity number for the Permian that you guys have provided for '23? That's it for me. Thanks.\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nI might have on the second half of that, I ask again. I didn't understand this is Mackie again. On Gulf Run, yes, we sold 1.1 Bcf a day to Golden Pass and they're paying demand charge. So, they are getting geared up where they actually go to use some of that.\n\nBut -- the way we look at that pipeline is like we look at all of our assets, we will do everything we can to fully utilize in the capacity that's not being utilized regardless of whether it's demand charge being paid for or not. And I'm sorry, your second question, second half?\n\nBrian Reynolds -- UBS -- Analyst\n\nJust how much open capacity does Energy Transfer have on the nat gas takeaway side for '23?\n\nTom Long -- Co-Chief Executive Officer\n\nI already talked about earlier. So, yeah. As I mentioned earlier, we've got about 250 now. And by the sometime in the end of January, we should have close to, say, approximately $300,000 a day across the state.\n\nBrian Reynolds -- UBS -- Analyst\n\nOK. Thank you for the clarification. Have a good evening, everyone.\n\nTom Long -- Co-Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd that concludes our question-and-answer session. I would like to turn the conference back over to Tom Long for any closing remarks.\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nYeah. And this Mackie, I don't know why I'm compelled to do this, but I'm making a statement real quick. And the reason I -- we've got an election coming up here in about a week. And also, what's driving it is this attack, relentless attack on fossil fuels.\n\nAnd I have teenage boys that are asking the fossil fuels going away tomorrow. So, I'm going to make a quick statement that will end kind of ironically, and that's that fossil fuels changed humanity. If you look at over the last 20 years, of these aspirational policies in trillions of dollars with subsidies and with tax incentive and credits, it's barely put a dent and or hasn't been at all the growth in fossil fuels. In fact, I think 3% of electricity demand in the world -- I mean, not demand of electricity production in the world comes from renewables.\n\nAnd as everybody knows on this call, there's thousands of products that we use every day. In fossil fuels has increased our life spans. It's increased our health has increased our standard living tremendously. It's made us mobile, plane, trains, and automobiles.\n\nIt's just been -- it's so impactful to our lives. And I think it's fair to say that modern life with a reasonable standard of living and affordable energy is simply not possible without fossil fuels. And the illogical and irrational politically led rush to renewables will have devastating impacts from the cost, reliability, and security of energy around the world, as we're seeing in Europe and other places. And we find it interesting that the co-founder of a large environmental access organization has come out fairly recently and said that he's now left.\n\nAnd one of the reasons was -- is that their metro became within the organization that doesn't matter what the truth is. It matters what the public believes the truth is. So, that particular environmental movement has turned to a political movement that is really being perpetuated by the media and by the administration. So, statements that have been made recently some kind of play in the horizon here is the energy transition is not feasible in any meaningful time frame.\n\nIt is a dangerous dilution to base policies and idea that such a transition is even possible. And so, what we believe the new transfer is to reduce submissions around this world is build more natural gas-fired generation to replace coal fire generation, send more natural gas liquids around the world, especially to undeveloped world -- countries who are burning wood and biomass and animal waste and everything else. That's the solution to all of this. And so, I'll end on this irony is that we have an administration right now that came into this and has put in very hospital administrators at FERC and EPA and SEC to attack our industry, and that's gone on for a while within this administration, where they're not allowing new leases, not allowing drilling permits, not allowing or slowing down approvals of pipelines.\n\nAnd even going after pipelines that have been in service for years and trying to take them out of service and to low behold here, we've got an election coming up and we start gaining the strategic petroleum reserve. And we come out with approaching countries like Venezuela, and countries like Iran, who just promote terrorism or hate the U.S. to try to get into produce more oil. And then what do we do the last few days, we come out and attack our oil and gas producers and say they're going to be penalized for not producing more.\n\nI mean, my goodness, if this doesn't seem like a sitcom or Saturday Night lives get, it'd be funny if it wasn't so tragically sad. And sorry to get it from this podium, but I guess we're turning tired of being attacked in the fossil fuel business. I'm tired to my voice hear about it. So, anyway, Tom, do you want to close?\n\nTom Long -- Co-Chief Executive Officer\n\nListen, we -- as always, we thank all of you for joining us today, and we really do appreciate your support. Look forward to talking to you in the near future.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTom Long -- Co-Chief Executive Officer\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nMackie McCrea -- Group Chief Operating Officer and Chief Commercial Officer\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nMarc Solecitto -- Barclays -- Analyst\n\nGabe Moreen -- Mizuho Securities -- Analyst\n\nAnn Salisbury -- Bernstein Research -- Analyst\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nBrian Reynolds -- UBS -- Analyst\n\nMore ET analysis\n\nAll earnings call transcripts"
}