{
  "companyName": "Lands' End",
  "companyTicker": "LE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/lands-end-le-q3-2022-earnings-call-transcript/",
  "content": "Lands' End (LE 9.84%)\nQ3 2022 Earnings Call\nDec 01, 2022, 8:30 a.m. ET\n\nOperator\n\n[Operator instructions] Good day, and welcome to Lands' End third-quarter 2022 earnings conference call. As this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session, and instructions will be given at that time. As a reminder, this call may be recorded.\n\nI would now like to turn the call over to Bernie McCracken, chief accounting officer. You may begin.\n\nBernie McCracken -- Chief Accounting Officer\n\nGood morning. And thank you for joining the Lands' End earnings call for a discussion of our third-quarter fiscal 2022 results, which we released this morning and can be found on our website, landsend.com. On the call today, you will hear from Jerome Griffith, our chief executive officer; and Jim Gooch, our president and chief financial officer. After the company's prepared remarks, we will conduct a question-and-answer session.\n\nPlease also note that the information we're about to discuss includes forward-looking statements. Such statements involve risks and uncertainties. The company's actual results could differ materially from those discussed on this call. Factors that could contribute to such differences include, but are not limited to, those items noted and included in the company's SEC filings, including our annual report on Form 10-K and quarterly reports on Form 10-Q.\n\nThe forward-looking information that is provided by the company on this call represents the company's outlook as of today, and we do not undertake any obligation to update forward-looking statements made by us. Subsequent events and developments may cause the company's outlook to change. During this call, we'll be referring to non-GAAP measures. These non-GAAP measures are not prepared in accordance with generally accepted accounting principles.\n\nA reconciliation of non-GAAP financial measures to the most directly comparable GAAP measures can be found in our earnings release issued earlier today, a copy of which is posted in the Investor Relations section of our website at landsend.com. With that, I will turn the call over to Jerome Griffith.\n\nJerome Griffith -- Chief Executive Officer\n\nThank you, Bernie. Good morning, everyone, and thank you for joining us today for a discussion of our third-quarter results. Our consumer is showing resiliency in the face of the uncertain macro environment stemming from the multidecade high inflation, which is impacting buying decisions for discretionary purchases, such as apparel. Despite these challenges, our sales were only 1% below our outlook and our year-ago results.\n\nLike others in our industry, we saw consumer activity fluctuate during the quarter, and we experienced particular softness at the end of the quarter. We believe the sales' softness at the end of October, which continued into the early days of November, also reflects a return to historical shopping patterns as compared with last year when demand was pulled forward due to consumer concern about inventory shortages. Our profitability this quarter was lower than we expected as gross margins for the quarter were pressured by increased raw material costs, freight, and the incremental promotional activity required by consumers. As we experienced in the third quarter, we expect that the industry will be very promotional during the holiday season due to the macroeconomic challenges and inventory challenges faced by our competitors.\n\nWhile our inventory balance at the end of the quarter was 18% higher than a year ago and something we focus on daily given the inventory issues we see across our industry, we believe in the value of our inventory and view as a source of strength as we move forward. We're very pleased that our in-stock level is solid, and we can fulfill anticipated consumer demand during the fall holiday season. In order to be ready for the season, we built an extra lead time on this year's receipts, and the shipping delays have abated, inventory came in early. Those early receipts account for two-thirds of the year-over-year inventory increases we are showing.\n\nThe next largest driver of the inventory increase is carryover of basics and seasonal basics products, which accounted for approximately 90% of our total inventory at the end of the third quarter. As Jim will discuss, we see inventory returning to normalized levels by the end of the spring/summer 2023 season. We continue to be optimistic about the future, and our brand is strong. We continue to focus on controlling what we can, despite the volatile environment, by delivering a compelling assortment of products that meet our customers' evolving needs.\n\nDespite the near-term impact of higher costs, we have seen some stabilization in our supply chain with freight rates declining from peak levels, which should benefit cost of goods sold in 2023. I continue to be proud of our dedicated team that is working hard for our customers heading into the holiday season. While online traffic was challenged during the quarter, we were pleased that the U.S. e-commerce conversion improved high single digits year over year, which demonstrates that the customer continues to respond favorably to our product offerings.\n\nOur outfitters business continues to show strength, led by national accounts, driven by the broad-based recovery in the travel and hospitality industries. We had a solid back-to-school season, where purchase habits returned to normalized patterns. We're also pleased to see continued growth from our third-party business in addition to double-digit comparable sales at our retail stores. Next, I will highlight our progress across our strategic growth pillars, including product, digital, unichannel distribution and infrastructure.\n\nBeginning with product, our customers continue to favor hybrid styles that can be dressed up or down and worn in a variety of settings. Our one-closet focus and versatile assortment and fit is a critical component of our product offering. The demand for versatile styles that are equally appropriate at work, social events, or home was particularly evident in women's, with a strong response to our sweater blazer, polished dresses, and Recover denim, which uses recycled fibers. In men's, we saw strength in our Supima tees and our no-iron woven shirts.\n\nDenim, as well as our no-iron chino, also performed well with men. Additionally, we're seeing a favorable response to our wear-now lighter transitional outerwear, including fleece and rainwear, which performed well given the warm start to the fall season. We have a warm, warmer, warmest strategy with outerwear, and our marketing focus adapts as our customer faces the worsening elements throughout the fall and winter season. These positives were offset by the challenges in our kids business, sleepwear, and home furnishings offerings, with the latter two categories showing marked slowness from one year ago, where demand was fueled by the pandemic.\n\nWe believe the trends in casualization and demand for hybrid life are here to stay. Our assortment is perfectly aligned with the consumer demand for made-to-move fabrics and styles that can be dressed up or down. Turning to marketing, we're very pleased with the response we've seen to the Blake Shelton collaboration, which was introduced in September and offers men's, women's, kids, and home products. While still early, this branded marketing campaign is performing well and expanding our reach and appeal to Blake's broad audience.\n\nWe plan to build on this early success with spring, summer, and fall holiday 2023 collections. Blake has proven to be a great partner, and he wears Lands' End for the best reason: He really likes it. We also continue to deepen customer engagement through refining search, improving the effectiveness of our catalog and increasing our social media presence. I'm pleased that our customer engagement continues to generate healthy lifetime value over a long-term duration as our customer has been shopping with us for an average of 18 years.\n\nWith this tenure, we have very actionable data-driven insights, combined with our commitment to fit and quality, which supports our buy now, wear now focus. Midway into the holiday season, we are capitalizing on the early success of our brand and marketing efforts and shifting our focus from brand marketing toward a more targeted approach, leveraging our buyer file of nearly 7 million to drive customer conversion and retention. We anticipate a highly promotional environment in the fourth quarter, and we'll continue to leverage our data-driven strategies to optimize margin and remain competitive. Next, on our unichannel distribution strategy, while recognizing the challenging retail environment, we remain encouraged with the progress we've made.\n\nWe're pleased with our performance at Kohl's, both in 500-plus stores where we saw strength in our seasonal assortment; and online, where our full assortment is available to the Kohl's shopper. Our business on Amazon also continues to build momentum and continues to introduce new customers to the brand. And while a small part of the business, we are pleased with the exposure we are receiving on QVC and have recently launched on Target.com and Walmart.com. We plan to seek additional distribution partners going forward as we see it as a way to reach more customers in our large addressable market.\n\nFinally, our outfitters business benefited with a solid back-to-school season. You'll recall that we saw a pull forward in demand to the second quarter from the third quarter this year, and overall, school uniforms for the second and third quarters were up 12% compared to the same period last year. Our national accounts performed well, given the return to travel and strength in hospitality. While our small and midsized accounts continue to experience macroeconomic headwinds, we remain confident our investments in digital capabilities and personalization will drive improvement for this business over the long term.\n\nTurning to infrastructure, we continue to focus on productive investments to improve the customer experience and drive operational efficiency. During the quarter, we implemented our transportation management system, which was the first piece of our multiyear warehouse management system installation to come online. Our implementation, which is designed to support our business model through optimized transportation management and product visibility, labor productivity improvements, improved customer service levels, and system modernization, remains on track. With that, I will turn it over to Jim.\n\nJim Gooch -- President and Chief Financial Officer\n\nThank you, and good morning. We delivered adjusted EBITDA that fell below our expectations due to the challenging macro headwinds that impacted our top line and created incremental cost pressures. While we expect these challenges to continue in the near term, we'll continue to focus on our operating model and execute against our strategic initiatives. For the third quarter, as compared to last year, total revenue decreased 1% to 371 million.\n\nThe slowdown across the industry and consumer demand at the end of the quarter led to the slight revenue miss to guidance. Despite lower traffic, as Jerome mentioned, we're pleased with our strong conversion rates, demonstrating the consumers' positive response to our product. Our global e-commerce sales decreased 5% from 2021. Within that, our U.S.\n\ne-commerce business was fairly flat, decreasing 1% from 2021. And our international business, which was negatively impacted by inflation and geopolitical turmoil in Europe, decreased 20% in the quarter. Revenue for our third-party business continues to be very strong, increasing 60% as compared to the third quarter last year. This increase was largely driven by Kohl's, particularly within women's seasonal apparel, as well as growth in our other marketplaces.\n\nIn our outfitters business, sales decreased 6%, driven by the normalization of some of our travel-related national accounts after accelerated purchases last year. Within school uniforms, we're pleased with our overall performance for the season as parents return to regular purchasing patterns. We also remain encouraged with the rollout of our improved personalization and customization capabilities. We'll continue to build out that model throughout 2023.\n\nMoving to our retail business. During the quarter, we delivered revenue of $10 million, with U.S. same-store sales increasing approximately 13% from the third quarter of 2021. Gross margin in the third quarter decreased to 40%, approximately a 440-basis-point decline from 2021.\n\nThe margin pressure was driven by an incremental 7 million in shipping expenses, increased industrywide promotional activity and margin mix from our growth in our third-party business. And as a percentage of sales, SG&A was 36%, a decrease of approximately 80 basis points to 2021. The basis point decrease was driven by continued expense controls across our entire business. Our performance led to a net loss for the quarter of 4.7 million, or $0.14 per share, compared to a net income of 7.4 million or $0.22 per share in 2021.\n\nIn addition to these GAAP measures, adjusted EBITDA is an important profitability measure that we use to manage our business internally. For the quarter, adjusted EBITDA was 16.7 million, below our expectations of 20 million to 24 million and compared to 29.8 million in 2021. The adjusted EBITDA shortfall was primarily driven by gross margin pressure, slightly offset by SG&A reductions. Looking at the balance sheet.\n\nInventories at the end of the quarter were 565 million compared to 480 million a year ago. The 18% increase in inventory was primarily driven by early receipts for the upcoming fall and holiday selling seasons, as well as carryover of basics inventory from prior seasons. We've taken appropriate actions to reduce purchases for the upcoming seasons. And this, combined with reduced lead times, will allow us to normalize their inventory level by the end of spring/summer 2023.\n\nRegarding our debt. At the end of the third quarter, our term loan balance was 248 million, and our 275 million ABL had 160 million of borrowings outstanding. Turning to our guidance. Our fourth-quarter and full-year revised outlook reflects the headwinds presented by the macroeconomic environment and inflationary pressures on the consumer.\n\nWe expect to see a significantly heightened promotional environment across the industry in the fourth quarter. Margin will also be pressured by the higher freight and supply chain costs that are reflected in our fall holiday inventory. With this all in mind, for the fourth quarter we expect net revenue to be between 510 million and 530 million. We expect net income of 0 to 3 million and diluted earnings per share to be between 0 and $0.09.\n\nWe expect adjusted EBITDA to be in the range of 20 million to 25 million. For the full year, we now expect net revenue of 1.54 billion to 1.56 billion. We expect a net loss of 9 million to 6 million and diluted loss per share to be between $0.27 and $0.18. We expect adjusted EBITDA to be in the range of 66.5 million to 71.5 million.\n\nOur guidance for the full year incorporates approximately 33 million in incremental shipping expenses. With that, I'll turn the call back over to Jerome.\n\nJerome Griffith -- Chief Executive Officer\n\nWe are focused on making progress against our strategic initiatives. However, the current environment is very uncertain and volatile. We are very pleased with our conversion rates showing the strength of our product offering and appeal to our customers. In addition, as stated earlier, the consumer is responding more to promotions this season, and we will be disciplined through our dynamic promotion and marketing initiatives to remain competitive and drive traffic where we can capitalize on those strong conversion rates.\n\nOur brand metrics remain very solid as we continue to see strength in our active buyers, which reflects the long-term resilience of our brand. We have a highly loyal customer base with an average tenure of 18 years, and we are confident that our performance will improve when the macro environment recovers. As a result of the uncertainties in the marketplace, we have revised our full-year guidance, as Jim just reviewed. Before opening the call up to questions, I would like to introduce Andrew McLean, who joined us last month as chief executive officer-designate.\n\nAndrew is an accomplished retail executive with a proven track record of driving growth and will succeed me when I retire as CEO at the end of the fiscal year. I am confident that under his leadership, combined with our digitally driven business model and highly loyal customer base, Lands' End is positioned for long-term success. I will continue to work with Andrew over the next few months before he transitions into his new role, and we expect a very smooth transition. As we announced in September, I will remain on the board following my retirement.\n\nI also want to call out two additional appointments. With the supply chain challenges that we and others in our industry have faced, we are very excited to announce that Jamin Dick, most recently head of supply chain for the North America B2B business at Alibaba, joined us in September as our chief supply chain officer. Secondly, as we have been focused on driving growth in our third-party business, we've hired Molly Yearick, who has had a long successful career in wholesale at PVH, as well as other leading brands, to help us further our expansion. I believe we have the right people in place to leverage our strong brand, unique business model, and strategic initiatives to drive sustainable returns for our customers, team, and shareholders.\n\nBefore I close, I'd like to give more detail on our holiday sales trends. After initial softness, we began to experience a pick up in traffic as we progressed through November and headed into Cyber Week. Although traffic trends remain volatile, we've seen that customers are positively responding to our product, which resulted in strong conversion throughout November. We expect the environment will remain very promotional, and we plan to remain competitive with our pricing to drive traffic through the holiday season.\n\nWith that, we will now take your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Dana Telsey with Telsey Advisory Group. Your line is open.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHello. Good morning, everyone. Wanted to touch on -- Jerome, can you expand at all on the customer environment, what you're seeing both digitally and also in your third-party business? And you mentioned that sleepwear and home were the weaker categories. Is the level of promotions higher on those categories than it is others? And just with Black Friday, what did you see in terms of the promotional level versus 2019 and how you're planning the remainder? And then I have a follow-up.\n\nThank you.\n\nJerome Griffith -- Chief Executive Officer\n\nHey, Dana. How are you doing? Thanks for the questions. Let's start with customer environment between digital and then also third party. When we look at what's happening with our third party, generally we still continue to see a build.\n\nAs you know, we really didn't have a lot of third-party business until 2018 when we started with Amazon and then a couple of years ago, when we started up with Kohl's. And what we see is both of those businesses plus -- really, our Target business, which we just started recently, and Walmart, both continuing to grow. And it takes a few years to really maximize what your potential is there, and we see as longer term continuing to grow with our third party. On digital, the customers look -- are really looking for promotions.\n\nWhat we've seen is that she will buy key items and she'll buy the products that she's used to buying, but she's looking for a deal. I think customers are getting squeezed with food costs and with energy costs and also really looking at how they're spending their dollars for the holiday season. But the other thing that we're seeing is, if you remember last year, there was this hue and cry with the supply chain and you better order early and you better get your order in because things are moving slowly, and it's going to take a while to get your product. I don't see that this year.\n\nWe definitely saw a shift in how the customer was shopping the end of October and beginning of November with traffic numbers. Because last year, everybody shopped early before Veteran's Day. But not this year. In fact, we're actually thinking that you're going to get more traffic as you get closer to Christmas and really be back to what the 2019 trends look like because that's really kind of what we're seeing as the traffic pattern looks a bit like 2019, meaning getting back to what people are used to.\n\nConcerning sleep and home, home has been a trend -- home was a huge trend up over the pandemic, and we were recipients of that. But you know as well as I do, the home business is mostly sheets and towels, and most of that is basics business for us. So, I'm not concerned about any softness there because, overall, we've really picked up in what our home penetration is. Sleepwear, we just overplanned it.\n\nSleepwear has been a big trend. It's our second largest category in women's apparel. It's done very well, but people are responding to that when we get it out of price. And that's really what the -- I think the overall message is that you'll move through inventory, and you'll be fine, but it's going to be at a price.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGot it. And then, Jim, can you expand on inventory levels and supply chain costs and how you would just qualitatively frame next 2023, what tailwinds and headwinds may be on the margin profile? And then welcome, Andrew, to Lands' End. Can you just talk a little bit about -- it's certainly early days, what your vision is, and how you see enhancing the Lands' End business and where your focus will be? Thank you.\n\nJim Gooch -- President and Chief Financial Officer\n\nYeah. Thanks, Dana. As we said, even though our inventory is about 18% over last year, overall, we're pretty happy with the quality of the inventory. That increase, as Jerome I think mentioned, it's about two-thirds of that is just because we brought in our receipts earlier than last year.\n\nAnd that's a combination of this year's receipts as the supply chain normalizes with our lead times are coming in earlier, and then compared to last year where many of our receipts were late. The remainder of that 18% is mainly just our basics, mostly from spring and summer where we had a little bit of softness. And instead of marking those basics down, we just decided to carry those over. So, we'll be normalizing those through as we repurchase the basics.\n\nAnd most of that overage year over year will be normalized at the end of the year. But I expect by next spring summer will be fully normalized back to appropriate levels when you look at the year-over-year balances.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGot it.\n\nAndrew McLean -- Chief Executive Officer-Designate\n\nAnd I think -- Dana, it's nice to meet you. I'm really delighted to be here. You know, I think as we look forward, it's really about picking up where Jerome leaves off. And I think for the beginning of the year, that's really what Jim has just been saying, it's focusing on the inventory levels, making sure that we get those back to the levels where we want them to be, driving the product categories that really works and then, you know, generating gross margin from that, and being able to drive profitability in the business.\n\nBut I think as we get past that, it's really early days for me, but I look at all the channels we're in, and there is opportunity in all of them. And it's about picking the priorities as we move forward within those. They're all great, tremendous opportunity.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Alex Fuhrman with Craig-Hallum. Your line is open.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nHey, guys. Thanks for taking my questions. Jerome, congratulations on your retirement. We'll certainly be sorry to see you go.\n\nYou know, a couple of things I wanted to ask you, one on the promotional environment that you're expecting for the fourth quarter. I mean, is that something you'd say you're fully seeing already? Or is there more of an expectation that there's going to be pretty heavy, kind of, post-Christmas clearing in January as well? And curious if there's any particular categories where you're seeing that promotional pressure. And if you could comment on what you're seeing in jackets and outerwear.\n\nJerome Griffith -- Chief Executive Officer\n\nSure, no problem. Thanks, Alex. Let's first talk about the promotional environment. What we're seeing is very highly promotional over the Cyber Week period.\n\nI'll just throw out a couple of things. You had competition, Old Navy has $5 flannel pants. And then the next day, you saw Target up with $5 flannel pants. And that's all sleepwear related.\n\nSo, we're not the only ones that have sleepwear they got to get rid of. But I think what you'll probably find over the course of the next couple of weeks, is that people back off promos a little bit. I mean, not much, but a little bit because everybody is going to be in pretty decent stock shape. But where you end up with inventory gluts, post-Christmas, I think January is going to be a pretty clearance time.\n\nAnd most of the people that have, you know, are over inventoried. And listen, I've heard numbers out there. Some people are up 30%, 40%, and some up to almost 50% from a year ago. I think we're actually sitting in a pretty good position with plus 18% at the end of the third quarter.\n\nMost of this we brought this up in early, so we have the ability to fulfill as we went in through December and January. And we're up against low fulfillment rates from a year ago. So, I think there's, you know, still some opportunity in there. But I think people are going to be taking their categories that are gluts, which are things that overperformed during the pandemic period and now are underperforming.\n\nBecause what's -- what we're seeing is people are buying items like dresses to go out. Our sweater jackets, denim has been a big seller in both men's and women's. Our chino pants in men's and men's jackets have also been working. Additionally, transitional outerwear has been pretty positive.\n\nOur fleece, our rainwear, lighter weight down, down vests have all been performing relatively well for us. It hasn't been cold enough out yet for heavy outerwear to perform. But we've shifted that as we talked, I think, in the last quarter into the warm -- I'm sorry, during my comments today, the warm, warmer, warmest strategies. And then, you know, we want to have more buy now wear now, so we're expecting heavier outerwear to turn on in December than into January.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK, that's really helpful. Thanks. And then I think you had mentioned on the conference call, obviously, everyone has seen this as well that container costs from Asia are down, you know, very significantly, getting closer to pre-pandemic levels. When are you going to start to see that benefit in your reported gross margin next year?\n\nJerome Griffith -- Chief Executive Officer\n\nGo ahead, Jim.\n\nJim Gooch -- President and Chief Financial Officer\n\nSorry. Yeah, you're absolutely right, Alex. We are seeing those. At times, some of the spot market rates are getting close to pre-pandemic levels.\n\nThose values get capitalized into inventory. So, as those receipts come in and then as you sell the inventory, you'll start to realize that. So, we'll start to see some of it toward the end of spring and summer, but most of that is going to hit next fall and the holidays.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's really helpful. And then lastly, just, you know, Jerome, your commentary about sales being stronger the week of Thanksgiving and Cyber Week, I mean, is that just kind of within the normal kind of cadence of that being an increasingly important week over the years? Or was that actually a pleasant surprise, given the trends you've seen in earlier in November? Was that a real pickup in demand? And curious if you expect that to last for another maybe week or two into the holidays or to maybe resume at some point as we get closer to the end of the holiday season.\n\nJerome Griffith -- Chief Executive Officer\n\nYou know, while Cyber Week is important from a volume standpoint, the week we're in now is really the important week. And we still are doing a lot of volume going into next week and the week after as well. So, what we see, again, is going back to trends from 2019 as far as traffic goes. And what I think you're going to find is that -- and I think this will continue.\n\nPeople are not seeing these huge, big blockbuster kind of events like what we used to have around -- it was Thanksgiving back in the day, but we call it Cyber Week now. People lining up to get into stores to get great deals on TVs and things like that. You just -- you don't see it. It's a lot more of a friendly shopping environment out there.\n\nAnd I think that demand gets spread over the course of time, as time goes on. I mean, this is -- you know, we've talked about this before. This is my 44th Christmas. And you've seen shopping patterns really change over the course of the last several years.\n\nAnd what we're seeing right now, I think, it's going to be a lot more egalitarian, a lot more thoughtful. And you're going to see people buying up to the last shipping days in e-commerce and up to Christmas Eve in stores. So, I still think that people are going to be cautious, though, about how much money they're spending. That's why we're expecting to still see a pretty promotional environment out there through the holiday season and then into January.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's really helpful. Thank you, guys, very much.\n\nJerome Griffith -- Chief Executive Officer\n\nSure, Alex.\n\nOperator\n\nThank you. There are no further questions at this time. This is the question-and-answer session. Thank you for participating in today's conference.\n\nYou may now disconnect. Everyone, have a great day.\n\nJerome Griffith -- Chief Executive Officer\n\nThanks, guys.\n\nDuration: 0 minutes\n\nBernie McCracken -- Chief Accounting Officer\n\nJerome Griffith -- Chief Executive Officer\n\nJim Gooch -- President and Chief Financial Officer\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nAndrew McLean -- Chief Executive Officer-Designate\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nMore LE analysis\n\nAll earnings call transcripts"
}