{
  "companyName": "Magnite, Inc",
  "companyTicker": "MGNI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/magnite-inc-mgni-q2-2022-earnings-call-transcript/",
  "content": "Magnite, Inc (MGNI -2.40%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood morning, afternoon, evening, and welcome to the Magnite second quarter 2022 conference call. All participants will be in listen-only mode. [Operator instructions]. After today's presentation, there will be an opportunity to ask questions.\n\n[Operator instructions]. Please note this event is being recorded. I would now like to turn the conference over to Nick, head of investor relations. Please go ahead.\n\nNick Kormeluk -- Head of Investor Relations\n\nThank you, operator, and good afternoon, everyone. Welcome to Magnite's second quarter 2022 earnings conference call. As a reminder, the comparisons you will see in the 10-Q as reported include the financial results of SpotX and SpringServe for Q2 2022, but do not include April 2021 SpotX results or Q2 2021 SpringServe, because those businesses were acquired April 30, 2021 and July 1, 2021 respectively. During the course of this call, when we refer to results and associated year-over-year comparisons with the phrase as reported, we are referring to the basis as reported in our 10-Q.\n\nWhen we make comments referring to pro forma comparisons, we are including SpotX and SpringServe for the relevant pre-acquisition period in order to provide a like-to-like comparison. Please keep in mind as it relates to the SpotX and SpringServe acquisitions, prior quarterly results are estimated and unaudited. As a reminder, this conference call is being recorded. Joining me on the call today are Michael Barrett, CEO; and David Day, our CFO.\n\nI would like to point out that we have posted financial highlight slides on our investor relations website to accompany today's presentation. Before we get started, I will remind you that our prepared remarks and answers to questions will include information that might be considered to be forward-looking statements, including, but not limited to, statements concerning our anticipated financial performance and strategic objectives, including the potential impacts of macroeconomic factors on our business. These statements are not guarantees of future performance. They reflect our current views with respect to future events and are based on assumptions and estimates, and subject to known and unknown risks, uncertainties and other factors that may cause actual results, performance or achievements to be materially different from expectations or results projected or implied by forward-looking statements.\n\nA discussion of these and other risks, uncertainties and assumptions is set forth in the company's periodic reports filed with the SEC, including our second quarter 2022 quarterly report on Form 10-Q and our 10-K. We undertake no obligation to update forward-looking statements or relevant risks. Our commentary today will include non-GAAP financial measures, including revenue ex-TAC or less traffic acquisition costs, adjusted EBITDA and non-GAAP income per share. Reconciliations between GAAP and non-GAAP metrics for our reported results can be found in our earnings press release and in the financial highlights deck that is posted on our investor relations website.\n\nAt times, in response to your questions, we may offer incremental metrics to provide greater insights into the dynamics of our business. Please be advised that this additional detail may be one-time in nature, and we may or may not provide an update on the future of these metrics. I encourage you to visit our investor relations website to access our press release, financial highlights deck, periodic SEC reports and webcast replay of today's call to learn more about Magnite. I will now turn the call over to Michael.\n\nMichael, please go ahead.\n\nMichael Barrett -- Chief Executive Officer\n\nThank you, Nick. In a more challenging ad spending environment, I'm pleased with our team's ability to deliver revenue and EBITDA in line with what we communicated to you three months ago. CTV finished at the midpoint of our guide and we achieved strong adjusted EBITDA growth of 30% year-over-year with a margin of 34%, also at the midpoint of our implied guide. David will provide greater detail in Q2 results and Q3 outlook.\n\nLike others in the sector, we were not immune to the impacts of macroeconomic challenges and we did experience softening as the quarter progressed, especially in EMEA and APAC in the DV+ business. A strong U.S. dollar also pressured overall ad spend in these geographies. In DV+, the U.S.\n\nproved more resilient than did the rest of the world. These trends in DV+ have continued into Q3 and are reflected in our expectations. Given market conditions we are very pleased that our CTV business continues to be a growth driver in the quarter as revenue ex-TAC grew 52% year-over-year on an as reported basis or 19% pro forma. Q3 has started even stronger and we are optimistic that our CTV business will see improving growth rates in the back half of the year.\n\nWe are seeing great traction in CTV and specifically our ad server business SpringServe. The integration between our ad server and the SSP is incredibly powerful. It reduces complexity, improves inventory management between multiple parties, enhances functionality, and most importantly drives yield for customers that have both a direct sales force in a programmatic sales channel. We are continuously introducing new features into this integrated solution such as ad tiles, which are the native ad units presented on the home screen of connected TVs.\n\nSolutions such as these have put us in a great position to catch your share with one of the fastest growing groups in the CTV market, the TV OEMs. They have quickly scaled and will continue to further strengthen as key players in the market for years to come. The likes of Vizio, Samsung, and LG continue to invest aggressively in their advertising businesses as more viewers rely on their TV operating system to access digital content. This quarter we announced a multi-year deal with LG ads solutions.\n\nWe will have access to their automatic content recognition, or ACR data for planning, activation, measurement, and advanced analytics across our platforms. Through the agreement, ACR data from opted-in LG smart TVs in the U.S. will be made available across our U.S. inventory footprint, and will expand to other countries starting in 2023.\n\nSimply put this is technology built into connected TVs, which captures everything that is viewed both content and ads in regardless of source, whether linear or streamed. It is extremely valuable and unlocks unique capabilities such as targeting around content viewership, incremental reach, and frequency management across both linear and streaming environments within the household. Through this partnership, we have also renewed our relationship with LG, which spans ad serving, programmatic execution, and demand generation. This landmark deal also highlights the unique positioning Magnite has established in market around data enablement.\n\nWhile most major players in this category have reserved the use of their first-party data assets against only their own inventory, LG has opted to partner with Magnite and leverage the scaled and secure data enablement infrastructure we have spent years developing across our broader inventory footprint. This enhances LG's ability to scale their advertising business while protecting this incredibly valuable data asset. Other CTV growth drivers that keep us optimistic are Disney+'s ad supported tier, our strategic relationship with GroupM continuing to scale in the 2022 mid-term election season, which is just starting to emerge in August and is likely to accelerate through early November. We are extremely well positioned to capture political dollars as our managed service team as well as the partners such as the Scripps Political consortium, where we are the exclusive SSP.\n\nScripps is leading a group of premium publishers, including Cox Media Group, Capitol Broadcasting Company, Graham Media Group, and others broadcasters to provide billions of monthly CTV impressions to Magnite available to political advertisers. On the DV+ side, we have identified key initiatives for growth and are working in delivering against them in the coming months. In the first half of the year, we have nearly doubled ad request volumes compared to last year. This is a key first step to driving higher conversion of these ad requests to ad spend.\n\nWe have done this with tremendous efficiency and continuously lowing cost per ad request. Our omnichannel -- our omniscale -- I'm sorry, our omnichannel scale ability to serve all types of publisher inventories is unmatched among independent SSPs and is a key differentiator for Magnite. Our Demand Manager business continues to perform well. We have had very good traction recently with a number of large notable publisher wins such as Disney, Time, and Buzzfeed.\n\nThese are expected to onboard over the next several quarters. We are pleased to see larger and more complex publishers increasing their adoption of demand manager and lean heavily on Magnite for yield optimization and monetization. Looking ahead to the second half of the year, our overall growth rate could be tempered by a macro environment that is challenging. However, we believe that we have unique drivers that will support further growth and prudent investments.\n\nWe continue to hire key talent, invest in our CTV platform, build out more capabilities on the audience and identity front, introduce new ad server functionality, and optimize the DV+ business for better growth and market share gains. We believe we have all the key strategic pieces that we need across these areas. Additionally, our platform integration is progressing well with functionality expected to be completed this year and migration of customers beginning next year. I'm pleased that the strength in our business allows us even in challenging times to balance growth investments while continuing to deliver strong and improving financial results.\n\nBefore turning the call over, I wanted you to step back from the short-term and provide some comments at Magnite and our position in the market. In the last two to three years, we have transformed Magnite into $0.5 billion revenue company aiming at $1 billion as our next milestone with a strategic and durable market position and the business model with a very attractive earnings and cash flow profile. This has been done through the combination of strategic M&A as well as internal investment in organic growth. Most importantly, we have grown a CTV business that now represents 42% of our total revenue ex-TAC up from 0% in 2019 with customers like Disney, Warner Brothers Discovery, Paramount, Samsung, Vizio, LG, Roku, DirecTV, Sling, and many more.\n\nI'm incredibly proud of what we've accomplished and built for the long-term. With that I'll turn the call over to David. David?\n\nDavid Day -- Chief Financial Officer\n\nThanks, Michael. Overall, we have a solid quarter in the context of macroeconomic challenges. Revenue ex-TAC finished within our guidance range with the TV revenue at the midpoint. Expenses came in lower than our guide, which resulted in adjusted EBITDA at the midpoint of our implied guidance range.\n\nThis demonstrates the benefit of our revenue diversity positioning within CTV and the leverage of our business model. We continue to be cautiously optimistic as we look at the back half of 2022. Total revenue for Q2 was $138 million. Revenue ex-TAC was $123 million up 23% from Q2 2021 on an as reported basis and up 7% on a pro forma basis.\n\nCTV revenue ex-TAC was $52 million up from $34 million or 52% from last year on an as reported basis and up 19% on a pro forma basis. DV+ revenue ex-TAC was flat versus prior year on a pro forma basis. Mobile revenue ex-TAC grew 6% and desktop revenue ex-TAC declined 8% year-over-year, both on a pro forma basis. It is important to note that these results were achieved while cycling very strong growth in the second quarter of last year.\n\nOur revenue ex-TAC mix for Q2 2022 was 42% CTV, 36% mobile, and 22% desktop. On a sequential basis, Q2 2022, total revenue ex-TAC through 15% over Q1, 2022. CTV revenue ex-TAC was 23% and DV+ grew 10%. Total operating expenses, which in our case includes cost of revenue for the second quarter, decreased slightly to $161 million versus $162 million in the same period a year ago.\n\nOperating expenses include year-over-year increases in amortization of acquired intangibles and personnel related expenses from SpotX, which were more than offset by a decrease in merger acquisition and restructuring costs compared to last year. Adjusted EBITDA operating expense was $82 million, an increase of $4 million sequentially and up $13 million from Q2 2021, also driven primarily by the acquisition of SpotX and the year-over-year comparison. Costs for the second quarter were lower than expected, primarily due to slower hiring, lower office and facilities costs lower technology and cloud costs and delayed marketing events. Net loss was $25 million for the quarter, as compared to net income of $37 million in 2021.\n\nThe decrease in net income was primarily attributable to a one-time $88 million tax benefit recorded in Q2 of 2021 as a result of the SpotX acquisition. Adjusted EBITDA was $41 million an increase of 30% versus prior year resulting in a margin of 34%, compared to adjusted EBITDA of $32 million or a margin of 32% in the second quarter of 2021. This was driven by continued revenue growth and cost energy from the acquisition of SpotX. Note, that we calculate our adjusted EBITDA margin as a percentage of revenue, ex-TAC.\n\nGAAP loss for basic and diluted share was $0.19 for the second quarter of 2022, compared to GAAP earnings per diluted share of $0.26 in the same period in 2021. This decrease is a result of the tax benefit mentioned above. Non-GAAP earnings per share in the second quarter of 2022 was $0.14, which was up compared to non-GAAP earnings per share of $0.11 reported in the same period in 2021. There were 132 million weighted average basis and diluted shares outstanding for the second quarter of 2022.\n\nFully diluted weighted average shares utilized for non-GAAP earnings per share were $142 million for the second quarter of 2022. Capital expenditures, including both purchases of property and equipment and capitalized internal use software development costs were $12 million for the quarter in line with our expectations. Operating cash flow, which we define as adjusted EBITDA less capex was $29 million. Our interest expense for the quarter was $7 million of which roughly $6 million was cash.\n\nAt the end of Q2, we had $233 million in cash on the balance sheet. Regarding debt, we continued to reduce our net leverage ratio, which was approximately 3.8x at the end of Q2, as compared to 6.2x at the time we closed SpotX at the end of April last year. This represents further progress toward our ultimate goal of 2x or less. As an update on our $50 million share buyback program announced in December, we repurchase 312,000 shares for approximately $4 million in Q2, leaving $28 million in the program at the end of the quarter.\n\nIn addition, for our regular RSU vesting during the quarter, we utilized the withhold to cover method to cover employee taxes withholding 463,000 shares for approximately $5 million. We started the year with a balanced goal between share buyback and debt reduction. Going forward we plan to lean more to cash accumulation to maximize flexibility and with the goal of reducing our net leverage ratio. That being said, we continue to believe that repurchases at our current share price represents an attractive use of capital to buy our shares at a discount to intrinsic value.\n\nWe'll now share our future expectations. Our approach to guidance is conservative and does not anticipate broad economic improvement through the end of the year. For the third quarter, we expect revenue ex-TAC to be in the range of $122 million to $126 million. We expect revenue ex-TAC attributable to CTV to be in the range of $52 million to $54 million.\n\nWe expect adjusted EBITDA, operating expenses to be $85 million to $87 million implying an adjusted EBITDA margin of 31% at the midpoint. For Q4, we currently expect quarterly adjusted EBITDA operating expenses to increase roughly $5 million compared to Q3. This increase would primarily be driven by technology operating cost and increased head counts to support our growing business. For the full year, we expect revenue ex-TAC to be above $500 million.\n\nWe expect capex to be approximately $45 million of which approximately $80 million will be in Q3. And we maintain our expectation that we will generate over a $100 million in free cash flow. We define free cash flow as adjusted EBITDA, less capex, and net cash interest payment. We are hard at work to deliver across all opportunities we have in the second path while managing our expenses and continuing to prudently invest in strategic growth areas.\n\nOur model continues to show strong EBITDA and cash flow generations, even with lower revenue growth driven by macroeconomic pressure. With that, let's open the line for Q&A.\n\nOperator\n\n[Operator instructions]. Our first question comes from Shyam Patil with SIG, please go ahead.\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nHey, guys. Good afternoon. I had a couple of questions. Michael, can you talk a little bit more about your outlook and just some of the puts and takes? And maybe in addition to that, just how you continue to see your CTV opportunity and kind of growth over time? I know you've talked about kind of better than market growth rates, which I think, people have pegged around 30%.\n\nJust kind of curious if you could just kind of walk through those. And I have a follow-up.\n\nMichael Barrett -- Chief Executive Officer\n\nYes, sure. So, our crystal ball is good as anyone else's, but we spend a lot of time in market with buyers, and agencies and at marketer level. And I think there is a general – obviously depending on the advertising vertical, but there is a general feeling that the budgets that have been cut have really more been paused than taken off the table. And so there is a hope across the board that as we get into the late second half of the year, you are going to be able to see resumption of that.\n\nAnd so that gives us some confidence. The other piece about our CTV business precisely is that we often talk about the \"competition\", with Magnite really is direct sales by sales folks at these large broadcasters and/or CTV programmers. And in markets like these you will find publishers more willing to work with programmatic inventory and their programmatic partners. And so we certainly benefit from that as well.\n\nAs well as, our managed service team which is picking up steam we're seeing the rebound of regional travel, which is a big category for them. Still softness in Tier 2 automotive, but we've talked about political in the script and we think that that can be a very nice driver in political inventory goes at a high price in terms of CPM, so it has a kind of rising tide effect on the whole publisher's monetization. So that's kind of in a nutshell, what we're seeing for the second after the year.\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nGot it. Thank you. And then just a quick follow-up. We get a lot of questions around Hulu and Disney, and I know the contract is on an evergreen basis now, I'm just wondering if you could maybe talk a little bit more about that and just the relationship and the ability to expand the relationship and economics over time? Thank you.\n\nMichael Barrett -- Chief Executive Officer\n\nYes, classify the contract is evergreen, but I would say that I feel we're in a terrific position with our partner Disney. Over the course of this contract, our relationship has expanded into other areas. Of course, there is a launch of Disney Plus that wasn't really on an as-reported peer that wasn't really anticipated and/or factored in to the original contract. And so that's accretive.\n\nAnd we talked about Disney adopting demand manager. So now you are starting to see kind of this omnichannel story play out that we felt was something that was going to benefit in the market and it's starting to pay dividends there. So I would say a very strong relationship with Disney, very intertwined from a technology build standpoint and feel good about where we're heading in the continuation of our relationship.\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nGreat. Thank you, guys.\n\nOperator\n\nOur next question comes Laura Martin with Magnite. Please go ahead.\n\nLaura Martin -- Needham and Company -- Analyst\n\nHi there. So stepping up to 3,000 feet, Michael, I'm really interested in Netflix choice of Microsoft, and whether you think this adds Microsoft as a meaningful competitor to other SSPs? Does it sort of reinvigorate Xender, which to date has been sort of a weak competitor in the hands of AT&T that's my first question.\n\nMichael Barrett -- Chief Executive Officer\n\nYes. Hey, Laura I would say that it certainly doesn't hurt Microsoft's add credibility. But I would emphasize that the Netflix has been reported. So I don't have any blinding insight there.\n\nThat was quite a different process than what a normal publisher would go through. Right. The talk of pieces of the cloud deal, revenue guarantees all that, and that is not what a normal publisher goes through. A publisher goes through testing the technology capabilities, whether or not it can meet their needs.\n\nAlmost all of these publishers have large sales teams. So they aren't starting from zero. And so I would say that they haven't really proven their ability to compete on that level on a normal RFP driven level. So I think I feel really comfortable where we stand in the pieces that we put together.\n\nBut it'd be silly to discount Microsoft and the resources that they have as someone who doesn't have aspirations to ultimately be a player in this space.\n\nLaura Martin -- Needham and Company -- Analyst\n\nSuper helpful. And then my other one is also macro walled gardens versus open internet sort of strategic thinking. So the three wall gardens that reported earlier had really abysmal numbers, YouTube up 2%, search up 14%, Roku guiding to 3% revenue growth, and Facebook Meta down revenue 1%, whereas you just reported 23% growth, biggest open internet SSD, Trade Desk just reported 36% revenue growth, biggest open internet DSD. Are we getting a shift from walled gardens to the open internet? And if so, why now? Why now?\n\nMichael Barrett -- Chief Executive Officer\n\nWell, I think you bring up a really interesting point, Laura, and I think it's something that we've always leaned into and that is buyers want a choice. They want to be able to use their data. They want to have their choices as it relates to what data they want to bring into the mix. And lastly, they want to be able to track their results, learn from their spending and be able to apply that learning onto other buys.\n\nAnd as you know, in a walled garden situation all that data and all that information stays within the wall garden and it doesn't make a big marketer, any smarter on their next buy across the web. We've also been very clear that in CTV particular, it's very, very difficult to run the table and create a monopoly like Google has done in search, like Facebook has done in social. Premium video content is available in many places, and it's only increasing our Netflix and Disney now coming to the market with ad-supported vehicles. And so I think that what you are finding here is that for the first time marketers, agencies have a true choice, a real choice.\n\nYou're getting every bit as good targeting. You are getting every bit as good FX from your advertising. And you're not being held cap because someone has run the table on a certain type of inventory you need to buy from them. And so I think you might be seeing some of that play through.\n\nLaura Martin -- Needham and Company -- Analyst\n\nSuper helpful. Thank you for letting me borrow your IQ. I appreciate it a lot. Thanks.\n\nMichael Barrett -- Chief Executive Officer\n\nThanks, Laura.\n\nOperator\n\nOur next question comes from Jason Kreyer with Craig-Hallum.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nOK, it's Jason Kreyer from Craig-Hallum. Thanks guys. Michael, just wanted to see if you could maybe talk a little bit more about the trends you are seeing in DV+, and maybe the opportunity for Magnite and DV+? I think you alluded to a little bit of some strategic changes or things that you're going to be doing a little bit differently there. So wanted to hear a little bit more on what the strategy is there.\n\nMichael Barrett -- Chief Executive Officer\n\nYes, Jason good question. Listen, we're certainly not where we want to be in DV+, and I certainly don't feel good with the numbers that we've put up. What I do feel good about is the progress that we've made behind the scene. It's a very complicated business, global obviously, huge scale, you are talking hundreds of billions of ad requests a day.\n\nAnd so the modest secure there can we go a long distance just given the scale? And so I think you would've seen much more attractive green shoots in Q2 hadn't it been for the economic headwinds that we saw in EMEA and APAC. So those CPMs became quite depressed throughout the quarter and kind of continued to be so, although, it's built into the guide that David shared with you. But I feel good Jason going into the second half of the year, we've got some auction mechanics that we've implemented that have promising early results that we're now spreading out to a larger sample set. As we said, we onboarded a lot more inventory.\n\nWith SPO gains, like the group MDL, I think, that it's setting us up to return that business to walk first and then run second. And I don't think I could have felt -- I didn't feel this good about the business a couple quarters ago. It's been a longer slide than I anticipated in terms of getting to where we are now, but I think from here on out it's going to be much more positive story for DV+. Thanks for the hard work of the team.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nOK. And can't make it through a conference call without talking about cookies. So obviously Google, kind of kicked out that deadline once again, but, we've spent a lot of time talking about how deprecation of the third party cookie is going to yield more usage of first party data, and that's going to be a benefit to you guys. I mean, the more we get these delays, and I think a lot of people feel like 24 is not even going to be the answer, but do you think that creates a little bit of a vacuum or has the industry moved beyond that enough where first party data is going to start to maybe appeal as a targeting mechanism, more so than third-party data is?\n\nMichael Barrett -- Chief Executive Officer\n\nI think unfortunately as long as third-party cookies are around, it's kind of the easy button. And the forward- thinking publishers that have been dependent historically on third-party cookies started putting a lot of energy and efforts into creating their own audience segments and working with us to help them try to merchandise it. I just don't think you are going to see a rapid appetite on the buyer side, as long as there is third-party cookies, and it's what they have been used to. So I do think that some of our ambitions in the identity and audience management space have been pushed out largely because of the cookies not being deprecated.\n\nBut as I say that let's take a look at the world that has never had cookies, which is the CTV world and look at our LG deal. And I think that that is perfectly emblematic of what we envision and that is LG had their choice. They could have gone to a DSP and made a deal with them for the data, they could have gone to a data company, like a LiveRamp, or they could have gone to an SSP. And they chose Magnite given our tools and given their level of comfort that they could still run a thriving ad business themselves while we helped accelerate it through the use of our identity lock tools, etc.\n\nSo, I do believe in the thesis, I just think in the third-party cookie world, you are going to see a delay in that as long as they still exist in the Chrome environment.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nAlways appreciate the color, Michael. Thank you.\n\nMichael Barrett -- Chief Executive Officer\n\nThanks, Jason.\n\nOperator\n\nOur next question comes from Matt Swanson with RBC Capital Markets.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYes, thanks for taking my questions. If I could actually pick up at the end of where Laura's question was on CTV, and you kind of touched on this, the idea that between Netflix, Disney, HBO, Warner coming together, we're going to see a lot of ad-supported content coming into inventory and this next year here. So could you just talk about how that inventory is going to impact? How advertisers approach CTV market? And then also how existing publishers might need to adapt to that competition? So maybe a little more high level than looking at individual partnerships, but just thinking about how much supply is going to come on and how that's going to maybe impact the ecosystem.\n\nMichael Barrett -- Chief Executive Officer\n\nYes, hey Matt. Great question. And to be played out, but our sense in talking to the big buyers is when there were rumors of the Netflix perhaps coming online this year they purposefully left money out of the up fronts into the spot market to have optionality. And I think that that's probably how it's going to play out and where is that money going to come from, I think, it just really comes down to we've already crossed that tipping point in terms of the larger audience being on streaming products.\n\nThey are more desirable, they are younger, they are harder to reach and ergo, I think, that you are just going to find more and more dollars. I don't think it gets cannibalistic out of the gates. I don't think Disney Plus' gain is Warner, Discovery Plus', HBO Max's loss. I think it's really the dollars that are getting up for grab are more of the linear dollars being pulled into the streaming environment.\n\nSo I see it as an expansion of a SAM as opposed to cannibalizing each other in price erosion because the premium services are still holding a high premium in terms of CPM. And I don't think that's going to also occur also raise the kind of the bottom of CPMs in that its finite pool of dollars to fight over.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nThat's super helpful context. And then David, you mentioned at the beginning your prepared remarks the cautious optimism into the second half. And then we've also talked a lot about some of the conservatism that's built into guidance. So could you maybe just kind of like separate and double click, both those? And it would be helpful, like on a month-over-month basis, just kind of thinking how trends progress through Q2 and then maybe changes or anything you've noticed going to Q3? And if I can tag on one last piece, just any assumptions around political benefit to Q3? I know if it comes, it comes in September.\n\nSo just kind of how you are thinking about the seasonality of political spend.\n\nDavid Day -- Chief Financial Officer\n\nYes, sure. All right, let me unpack a few of those. I think let's start with the guidance. And that's absolutely correct, we're seeing a lot -- there is a lot of uncertainty and kind of mixed signals.\n\nAnd so we have taken a conservative approach to the guidance. I think there are two primary components of that conservatism. So first our guidance does have some room for further deterioration of the macro environment. So not that we absolutely expect that, but it does have room for that.\n\nAnd then second, as you highlighted on the political side, political spend should grow in September and obviously October will be the more significant month. We don't have significant visibility into that at this point, being a midterm election. And so we've taken a pretty conservative approach on political. We've built in some growing political in September, but haven't over indexed on that and until we actually see it.\n\nSo from an overall trend perspective, I think, we saw a little bit of continued weakening, I think, in the latter half of the second quarter, kind of continuing challenges, strengthening dollar impacted EMEA in particular and our DV+ business. And so we're sort of seeing that trend. And there is a lot of weariness that kind of Michael highlighted with buyers. Some of the big agencies, have talked about some spend increases, but everyone is just sort of wary and they are just seeing where things will go.\n\nAnd so we're just kind of feeling that with tightness, I guess in current spending levels.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nI appreciate the time.\n\nDavid Day -- Chief Financial Officer\n\nGreat.\n\nOperator\n\nOur next question comes from Dan Kurnos with The Benchmark Company.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nGreat, thanks. Good afternoon. Maybe just a follow-up on both of those and Michael you gave sort of TAM expansion around sort of the incremental supply, but I think the bigger other, or alternative question, we've heard from sort of Hulu, Disney around programmatically executable inventory in four years. And I know we all don't know exactly what Netflix is planning on doing with Microsoft.\n\nBut in you prepare remarks in talking about the direct relationships, just how are you thinking about what Netflix and/or Disney going AVOD means from the acceleration of programmatic adoption rather than direct sales?\n\nMichael Barrett -- Chief Executive Officer\n\nYes. Hey, Dan, good to talk to you. And great question. And I think who is really instructive in terms of being kind of the OG of streaming ad supported, right? And if you look at how they balance their go-to-market, they have a healthy amount of biddable inventory that they use to help drive pricing against direct sold inventory.\n\nAnd what they have found in others so not just Hulu, that biddable can help rise, increase overall monetization. And biddable for the premium services is very much an invite-only auction, right? So it's not open header bidding where they don't know who the advertiser is. This is very much an auction where they know who are the participants are, and the participants know what the price floors are, and utilizing that against the mixture of upfront direct sold yields the highest amount of CPM, and so what I think you're going to see is this expansion of biddable inventory in the top tier, most of it will be through the form of invite only auction but that's good news for a player like Magnite because it has to run through someone who can conduct an auction, and that's what kind of what we're good at. And so I see that as the first step to, a true programmatic utilization of the premium services and then after that, I think you get an appetite for well, boy if you can bring me a thousand advertisers, I've never called on and they can help even round out further this kind of portfolio approach and how I go to market.\n\nI'll let you bring them on all day long and we see that with others partners in the space. And so then you act as that SSP, that's not just running an auction that's an invite only auctions, you're running a true auction that is opening it up to class of advertisers that are traditionally not television advertisers and/or called upon by the big direct sales teams.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nGot it. That's super helpful. And then just also to touch on sort of the political commentary have sort of a unique view covering the broadcasters and every single one of them is now said political is going to be a record even greater than 2020. I know David, in your response, prior; you mentioned sort of some conservatism baked in to your numbers.\n\nAnd I guess my question's just more around the tech. I know the partnership with script is unique. We're starting to see a lot more of those types of deals. But a lot of the issue is being able to actually code the inventory and expand from a national sales desk.\n\nAnd if you ask Roku, Disney, or others challenges on their part in terms of maybe being under indexed from a sales perspective. So I guess the question is, obviously early innings but if 15% I think is kind of the estimate 15% to 20% of political goes to CTV, how much over – how much over time is that, do you think you end up capturing and how much do you have to either educate or continue to expand the type in order to grow? What's obviously a very amazing category?\n\nMichael Barrett -- Chief Executive Officer\n\nYes. Great question. I'll attempt to answer some of it and maybe David's been embellish some more of it, but this is where the investment that we've made in building out this middle market managed service team comes into play because these are regionally located individuals that have a deep relationship with all the agencies and marketers in the area. And so they're poised to be able to take advantage of this new category of spend and have done so historically very well for legacy SpotX.\n\nSo a lot of experience in doing it and as you know, as it gets bigger and it's a Senate racer, sometimes as dollars flow through to DC-based agencies that are specialized in political advertising and having a relationship with them year round, which we do with folks on the ground in that market helps us greatly. So I think that we're well positioned from a tech standpoint. I think some of the biggest challenges from tech is always been able to scale, particularly in CTV. And that's where an SSP really comes involved because we with all the relationships we have, if you take the DMA or IP targeted inventory it may not be enough from one service like a Pluto, but if you add Pluto with Hulu, with Lu, you all said now have a huge footprint to be able to activate.\n\nAnd that's kind of along the flavor of scripts. We get together all these competing broadcasters that now can be able to bundle together all this inventory to make it more meaningful. So I think we're in a really good position to benefit from it. We definitely don't have as much experience as the local folks in terms of history.\n\nPolitical's pretty nascent for streaming, streaming's pretty nascent itself, but we fared well, David could share the numbers, what we did in the general election last in 2020 and perhaps you can extrapolate from there, if you think that it's going to be same size or bigger.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nYes. And to add onto that, in that presidential cycle, at its peak political was mid-single digits of our total revenue. So if we can hit those levels and execute on everything that we've talked about certainly some upside there?\n\nMichael Barrett -- Chief Executive Officer\n\nGot it. Great color. Thanks very much.\n\nOperator\n\nOur next question comes from Nick Zangler with Stephens. Please go ahead.\n\nNick Zangler -- Stephens Inc. -- Analyst\n\nHey guys. How about an update on the managed service business? Are you seeing some improvement there or are we still limited by that? It was $3 million to $4 million a quarter in this segment at one point. I think that's still kind of the headwind, but any update there?\n\nMichael Barrett -- Chief Executive Officer\n\nYes. Hey, Nick, David can give a little bit more specific if we're going to actually break them out. I'm not sure if we are not, but it's definitely improved. There's no question that we still, again that business over indexed versus the general exchange, over indexed on two ad categories, automotive, which is typically the dealer type advertising Tier 2 and a regional travel and regional travels definitely take back in.\n\nAutomotive is still lagging, but there's been bright signs of other categories emerging in furthermore, we've also talked about the mix of business in their portfolios and it's tending toward more the higher margin business now. And so therefore we think of whereas managed service has been a bit of a slag because of the macro. We see it freshening and again, there'll be the biggest beneficiary of the political spend. That'll be the group that captures most of the spend and so therefore that'll give him a good guy as well.\n\nDavid Day -- Chief Financial Officer\n\nYes. And they would actually --\n\nNick Zangler -- Stephens Inc. -- Analyst\n\nAnd then -- Go ahead, David.\n\nDavid Day -- Chief Financial Officer\n\nThey're one of the strongest growing areas in the company sequentially Q1 to Q2.\n\nNick Zangler -- Stephens Inc. -- Analyst\n\nWow. Great. Great. And then just the other question, just on the desktop side within DV+, I think it was obviously down year-over-year in the quarter.\n\nOutside of macro, is there anything more specific to call out there? I'm kind of wondering if this segment is just falling out of favor with advertisers and growth, maybe just hard to come by as we continue to push forward and it's really going to be CTV and mobile that advertisers are really attracted to. But maybe just your thoughts on that segment?\n\nDavid Day -- Chief Financial Officer\n\nYes. I could start with --\n\nMichael Barrett -- Chief Executive Officer\n\nYou want to hear from David? Yes, go ahead.\n\nDavid Day -- Chief Financial Officer\n\nYes. So if you look at prognosticators, eMarketer MAGNA, if you're -- if we look at multi-year CAGR on desktop, it's low-single-digit. And so what I think you saw for us, we've got some improvements we need to make in our DV+ business. We've made some of those improvements as Michael highlighted, but it's masked a little bit by the macro environment.\n\nSo I think your overall comment is generally true. I think we'll have opportunity as we continue to make progress with the DV+ business. Desktop is 20% of our total business still. We can take some of that share from those low-single-digit growth over time, but it won't be the major driver for us in the future.\n\nNick Zangler -- Stephens Inc. -- Analyst\n\nGot it. Helpful guys. Thank you.\n\nOperator\n\nOur next question comes from Matt Thornton with Truist Securities.\n\nMatt Thornton -- Truist Securities -- Analyst\n\nHey, good afternoon guys. Thanks for sneaking me in. David, I guess maybe one housekeeping for you. You called out currency or currency was called out in a prepared remarks.\n\nThat's not usually something we think of you guys as having much exposure to, but if you'd be willing to quantify kind of what that headwind is versus maybe what it was three months ago, that'd be helpful? And then Michael over at Warner Brothers, obviously a lot going on there having part of ways with standard and more recently obviously starting to merge there to AVOD services. And my question there is, if you think there is incremental opportunity, incremental risk, just how you're viewing that that potential opportunity? Thanks, guys.\n\nDavid Day -- Chief Financial Officer\n\nSure. So on the current front, we don't -- some companies record their results internationally and foreign currencies, and then have a translation impact. It's very easy to quantify in our case, our system is U.S. based and so and foreign currency budgets get translated at the input stage into U.S.\n\ndollars. And so it's a little hard to quantify, but it manifests itself typically in CPMs. And so we've seen CPM drops in Europe in particular in the 10% or 15% range and so we think that correlates to the currency impact to some degree.\n\nMichael Barrett -- Chief Executive Officer\n\nYes. Matt on the Warner Discovery. So we have a long history of working with Discovery and with Warner's. Obviously it was a bit tempered when they were part of the AT&T family and they acquired Xandr or AppNexus that became Xandr.\n\nBut now that they're back in the fold of the Discovery team and the Discovery team is kind of running the operations there. We feel really good about that relationship, the expansion of that and obviously they, along with a lot of others have announced the launch of an ad tiered free service to compliment their merger of Discovery+ and HBO Max. So even more inventory opportunities, more vals and we feel we're in a good position to work closely with that partner.\n\nMatt Thornton -- Truist Securities -- Analyst\n\nThat's helpful. Maybe I can slide one more in. The – you guys have called about a couple different opportunities that kind of help drive the back half of the year, I mean, political, the LG, ACR relationship, the Disney+, AVOD launch here in the U.S. as well as just the GroupM relationship and general SPO I guess.\n\nAnyway the size kind of what the biggest driver is or give us any kind of sense of what's more material? And some of those actually may be more 2023 drivers than 2022 drivers, so that that kind of color would be helpful as well? And then I'll jump back in the queue. Thanks, guys.\n\nMichael Barrett -- Chief Executive Officer\n\nYes. Great question, Matt. I think and I'll let David chime in as well. Certainly the most discreet seasonal opportunity would be political.\n\nThe other drivers would help with Q4 -- help with Q3 but not be unique to just Q3 and Q4, view them as more evergreen. So political, I think would be the one that you could quantify or attempt to quantify the most. I don't know if, David, you have a varying opinion.\n\nDavid Day -- Chief Financial Officer\n\nNope, that's it.\n\nOperator\n\nOur next question comes from Shweta Khajuria with Evercore ISI.\n\nSpencer Tan -- Evercore ISI -- Analyst\n\nThanks. This is Spencer Tan on for Shweta. Just had a quick question on your industry verticals and kind of the expectations in Q3 outside of political spend. I think you pointed to travel and auto is being at different points of strength to spectrum.\n\nAnd so I guess just underlying your assumptions for Q3 growth, are there any conservative kind of growth figures that are going into your assumptions around vertical mix? Thank you so much.\n\nMichael Barrett -- Chief Executive Officer\n\nSure, are you going to handle that, David?\n\nDavid Day -- Chief Financial Officer\n\nYes, I'll start with that. Yes. So as you highlight, I think we're seeing some pullback particularly in retail, health and fitness, home and garden, strength and travel as you highlighted some strength in technology and computing and some green shoots in auto particularly in our mid-market team managed service team. And so from a guidance perspective, again there's no particular lean into those verticals other than assuming those trends continue and having some cushion in our guidance if general trends deteriorate further over the last half of the year in the third quarter.\n\nSpencer Tan -- Evercore ISI -- Analyst\n\nGreat. Thank you so much.\n\nMichael Barrett -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Tim Nollen with Macquarie.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nThanks very much. I've got one more on CTV. We've covered a lot of ground with CTV today, but my question is about SpringServe, which I thought was an interesting tag on to the SpotX acquisition that you made last year. And I'm wondering is it -- you sound very optimistic on CTV kind of gaining share from linear and the role that Magnite plays and all of that.\n\nAnd I'm wondering how the SpringServe play into that. Do you need to win accounts over to use the SpringServe server? Is that an extra boost to your business, I'm just curious what the status of SpringServe is now? Thanks.\n\nMichael Barrett -- Chief Executive Officer\n\nYes. Tim, it's a great question. I think we've been pretty clear that the initial goal or the near-term goal of utilizing SpringServe in combination with Magnite wasn't you're going to look for a press release that is a rip and replace of like free will. Take the Australian marketplace where Magnite has a very enviable position powering programmatic for all of the top broadcasters in the Australian market.\n\nAnd every one of those broadcaster uses GAM as their, Google's Ad Manager as their ad server. So that's a perfect case in point of how we can work with an existing ad server and just bring enhanced advanced programmatic functionality to that ad server that really wasn't built for CTV. And so that's the real pitch that even FreeWheel wasn't built for CTV, it was built for online video and had to be morphed into CTV. SpringServe is built for CTV and with it comes some inherent functionalities that the other others don't have that our clients wish to have.\n\nSo for the meantime, I think you see us working alongside their existing in the top tier, the plus services call it, working alongside their chosen ad server, providing that functionality and yield optimization that they desire. As you start to work with folks like the OEMs or the fast services, they are tailor made for SpringServe as their primary ad server. And it's even more powerful if we're the primary ad server coupled with Magnite. So I think that we are elated with the performance to SpringServe.\n\nAnd the team is just crushing it, and I think that as we start to evolve as Magnite to have this deeply embedded ad serving capabilities within the leading CTV SSP is going to really provide us with competitive advantages that are very difficult to replicate.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nYes. Great. Thanks, Michael.\n\nMichael Barrett -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThis concludes the question-and-answer session. I would like to turn the conference back over to Michael for closing remarks.\n\nMichael Barrett -- Chief Executive Officer\n\nThank you, Jordan. We continue to build on our market leading position and invest in clear areas for growth and CTV, DV+, in audience and identity. As we look at the back half of the year, we feel strongly that our selection by GroupM and CTV and DV+ in the U.S. Disney+ recently announcing an ad supported alternative.\n\nThe return of verticals such as travel and political spend are tangible examples of growth drivers for the quarters ahead. I'd like to give a huge thank you to all Magniters around the globe for your hard work and tireless efforts. Q2 was a challenging macro environment, and thanks to you not only are we weathering this storm, but we enter the second half of the year poised to grow and gain share. Thank you too for joining us for our Q2 results call.\n\nWe look forward to talking too many of you at virtual investor meetings, hosted by RBC tomorrow. Craig-Hallum meetings in New York on August 16th, Cannonball on August 18th, conferences by Evercore ISI on September 7th, and Benchmark on September 8th both in New York, the virtual -- the Truist virtual buzz tour on September 19th and European road show in the last week of September. Thanks again, have a great evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNick Kormeluk -- Head of Investor Relations\n\nMichael Barrett -- Chief Executive Officer\n\nDavid Day -- Chief Financial Officer\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nLaura Martin -- Needham and Company -- Analyst\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nNick Zangler -- Stephens Inc. -- Analyst\n\nMatt Thornton -- Truist Securities -- Analyst\n\nSpencer Tan -- Evercore ISI -- Analyst\n\nTim Nollen -- Macquarie Group -- Analyst\n\nMore MGNI analysis\n\nAll earnings call transcripts"
}