{
  "companyName": "Exelixis",
  "companyTicker": "EXEL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/exelixis-exel-q3-2022-earnings-call-transcript/",
  "content": "Exelixis (EXEL 2.43%)\nQ3 2022 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Exelixis third quarter 2022 financial results conference call. My name is Chuck, and I'll be your operator for today. As a reminder, this call is being recorded for replay purposes. I would now like to turn the call over to your host for today, Ms.\n\nSusan Hubbard, executive vice president of public affairs and investor relations. Please go ahead, ma'am.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThank you, Chuck, and thank you all for joining us for the Exelixis third quarter 2022 financial results conference call. Joining me on today's call are Mike Morrissey, our president and CEO; Chris Senner, our chief financial officer; P.J. Haley, our executive vice president of commercial; Vicki Goodman, our chief medical officer; and Peter Lamb, our chief scientific officer, who together will review our progress for the third quarter 2022 ended June 30, 2022, and subsequent events, including the two business development announcements made today. During the call today, we will refer to financial measures not calculated according to generally accepted accounting principles.\n\nPlease refer to today's press release, which is posted on our website for an explanation of our reasons for using such non-GAAP measures, as well as tables deriving these measures from our GAAP results. During the course of this presentation, we will be making forward-looking statements regarding future events and the future performance of the company. This includes statements about possible developments regarding discovery, product development, regulatory, commercial, financial and strategic matters. Actual events or results could, of course, differ materially.\n\nWe refer you to the documents we file from time to time with the SEC, which under the heading Risk Factors identify important factors that could cause actual results to differ materially from those expressed by the company verbally and in writing today, including, without limitations, risks and uncertainties related to product commercial success, market competition, regulatory review and approval processes; conducting clinical trials; compliance with applicable regulatory requirements; our dependence on collaboration partners; and the level of costs associated with the discovery, product development, business development and commercialization activities. And with that, I will turn the call over to Mike.\n\nMike Morrissey -- President and Chief Executive Officer\n\nAll right. Thank you, Susan, and thanks to everyone for joining us on the call today. Exelixis had a strong third quarter 2022 across all components of our business. We saw continued growth of the cabozantinib franchise in the U.S.\n\nwhile expanding our diverse portfolio of clinical and discovery programs with new collaborations to build the Exelixis product portfolio of the future. Key highlights from Q3 include, first, we saw a strong performance of the cabozantinib business with significant growth in demand and revenue in the U.S. CABOMETYX maintained its status as the leading TKI for RCC. Cabo franchise revenue grew 39% year over year compared to third quarter 2021, marking its eighth consecutive quarter of growth.\n\nImportantly, global cabozantinib franchise net product revenue generated by Exelixis and its partners were $497 million in the third quarter 2022. Second, we continued to advance the Exelixis development pipeline with new potential cabo indications and our growing pipeline of clinical compounds and additional candidates in nonclinical development. Important clinical updates for XL092 at EORTC and XB002 at ENA highlight recent progress to lay the foundation from moving these compounds into late-stage development. Third, business development activities continue to be a critical focus for Exelixis.\n\nWe're pleased to announce two new option deals with Cybrexa and Sairopa today, which highlight our strategic efforts to access clinical and/or near-clinical-stage assets that have the potential to provide differentiated benefits to patients with cancer. You'll hear more about these two deals from Peter shortly. The option deal framework is ideal for us to employ as we can generate clinical proof-of-concept data with a wide range of experimental agents in a financially disciplined manner and only pay for success if and when that data is available. With that, please see our press release issued an hour ago for our third quarter financial results and an extensive list of key corporate milestones achieved in the quarter.\n\nI'll now turn the call over to Chris.\n\nChris Senner -- Chief Financial Officer\n\nThanks, Mike. For the third quarter 2022, the company reported total revenues of approximately $412 million, which included cabozantinib franchise net product revenues of $366.5 million. CABOMETYX net product revenues were $361.4 million and included approximately $13 million in clinical trial sales. Gross to net for the cabozantinib franchise in the third quarter 2022 was 26.1%, which is lower than the gross to net we experienced in the second quarter of 2022.\n\nThis decrease in gross to net deductions in the third quarter 2022 is primarily related to lower PHS, Medicare Part D and co-pay assistance. Our CABOMETYX trade inventory increased slightly when compared to the second quarter of 2022 to approximately 2.3 weeks on hand. Total revenues also included approximately $45 million in collaboration revenues, which includes approximately $30 million of royalties earned from Ipsen and Takeda on their sales of cabozantinib. And finally, clinical trial sales have historically been choppy between quarters, and we expect this to continue in future quarters.\n\nOur total operating expenses for the third quarter 2022 were approximately $329 million, compared to $336 million in the second quarter of 2022. SG&A expense was the primary driver of the decrease in total operating expenses, which was primarily related to lower legal and employee-related expenses. Provision for income taxes for the third quarter of 2020 was approximately $19 million, compared to approximately $18 million for the second quarter of 2022. The company reported GAAP net income of approximately $73 million or $0.23 per share on a fully diluted basis for the third quarter of 2022.\n\nThe company also reported non-GAAP net income of approximately $102 million or $0.31 per share on a fully diluted basis. Non-GAAP net income excludes the impact of approximately $29 million of stock-based compensation expense net of the related income tax effect. Cash and investments for the quarter ended September 30, 2022, was approximately $2.1 billion. This level of cash and investments supported by our ongoing cash flow from operations provides Exelixis with the flexibility to invest in internal discovery activities and also allows us to pursue external business development opportunities to expand our pipeline.\n\nAnd finally, turning to our financial guidance for the full year 2022. Given where we are in the year, we are tightening our revenue guidance, and we are increasing our R&D and SG&A expense guidance. The increase in R&D expense guidance is primarily to reflect the two deals we announced today, and the increase in SG&A expense guidance is primarily related to the increase in stock-based compensation. Please see Slide 12 of our Q3 earnings presentation for further details.\n\nWith that, I'll turn the call over to P.J.\n\nP.J. Haley -- Executive Vice President of Commercial\n\nThank you, Chris. The third quarter of 2022 was a strong quarter for cabozantinib as we continued to build on the significant momentum of the franchise. The team continues to execute at a high level, which has resulted in CABOMETYX continuing to be the No. 1 prescribed TKI in RCC and second-line HCC.\n\nFurthermore, CABOMETYX total prescriptions, or TRx, have now grown for eight consecutive quarters. Demand growth is being driven primarily by the longer duration of therapy for patients on CABOMETYX in combination with nivolumab in first-line RCC. Prescription trends remained strong in Q3 2022. Year-over-year TRx growth in Q3 2022 was 23% relative to Q3 2021.\n\nGiven the clinical data from the CheckMate 9ER study, we anticipate these first-line patients to receive therapy for approximately a year and a half on average and driving significantly longer treatment duration for CABOMETYX. Turning to the TKI market basket of CABOMETYX, INLYTA, SUTENT, VOTRIENT and Lenvima. CABOMETYX TRx market share has increased every quarter since Q1 2021, and its share in Q3 2022 was 38%. As we have discussed previously, first-line RCC market is very competitive, and we're pleased with the performance of CABOMETYX in combination with nivolumab in this setting.\n\nFurthermore, we are still not seeing any significant competitive impact on our share. Uptake in the first-line RCC setting is broad across clinical risk groups and practice settings, and prescriber experience to date continues to be very positive. Additionally, in contrast to data from public sources, our internal data showed that CABOMETYX had the highest level of new patient starts ever in Q3. Furthermore, within the quarter, we saw particular strength in both demand and new patient starts in September.\n\nWe view this as encouraging, and it aligns with the feedback we received from customers about a significant level of vacation and travel this summer coming out of COVID. We believe all of this taken together positions CABOMETYX for continued growth moving forward. Looking beyond the six current U.S. indications for cabozantinib, we continue to plan for life cycle expansion opportunities as additional phase 3 studies read out in the near future.\n\nWe look forward to having the opportunity pending data and approval to bring CABOMETYX to many more patients in need of additional treatment options. Our team remains highly focused and motivated to compete every day to bring the benefit of CABOMETYX to all eligible patients as we continue to build the franchise and serve patients. And with that, I'll turn the call over to Vicki.\n\nVicki Goodman -- Chief Medical Officer\n\nThanks, P.J. Good afternoon. Today, I will provide a brief update on the progress of our clinical stage pipeline, as well as our East Coast expansion in the greater Philadelphia region. I'll begin with an update on our cabozantinib registrational trial.\n\nIn early July, we reported positive top line results, COSMIC-313, evaluating cabozantinib in combination with nivolumab and ipilimumab in intermediate and poor-risk renal cell carcinoma. These data were presented by Dr. Toni Choueiri in a presidential symposium at ESMO. In the primary analysis of progression-free survival, cabozantinib in combination with nivolumab and ipilimumab significantly reduced the risk of disease progression or death compared with the combination of nivolumab and ipilimumab with a hazard ratio of 0.73 and p-value of 0.01.\n\nAnd overall response rate was 43% in the triplet arm and 36% in the doublet arm. A prespecified interim analysis for the secondary end point of overall survival did not demonstrate a significant benefit for the cabozantinib arm compared to the control arm. And therefore, the trial will continue to the next analysis of OS. The safety profile observed in the trial was reflective of the known safety profiles for each single agent, as well as the combination regimens used in the study, and no new safety signals were identified.\n\nFollowing discussion with the FDA, we do not intend to submit a supplemental new drug application based on the currently available data and plan to discuss the potential regulatory submission with the FDA when the results of the next OS analysis are available. For CONTACT-01, the phase 3 pivotal study sponsored by Roche, which is evaluating cabozantinib in combination with atezolizumab versus docetaxel in patients with metastatic non-small cell lung cancer who have been previously treated with an immune checkpoint inhibitor and platinum-containing chemotherapy, the final analysis of the primary end point of overall survival is on track to occur before the end of this year. For CONTACT-02, our phase 3 study in combination with atezolizumab in metastatic castrate-resistant prostate cancer, we are projecting that enrollment will be completed in the first half of next year. I would also like to share a brief update on CONTACT-03, the global phase 3 pivotal trial evaluating cabozantinib in combination with atezolizumab versus cabozantinib alone in patients with previously treated advanced renal cell carcinoma.\n\nFor guidance from Roche, the study sponsor, top line data is now anticipated in the first half of 2023. Now turning to progress on our pipeline molecules. The first clinical data for XL092 from the STELLAR-001 dose escalation cohorts were presented at a poster at ESMO. These data showed early evidence of clinical activity, particularly in heavily pretreated patients with RCC, including many who had previously received cabozantinib and demonstrated a manageable safety profile with no unexpected toxicities, providing support for the recommended dose of 100 milligrams.\n\nIn June, we initiated the first phase 3 study of XL092 in non-MSI-high colorectal cancer, and we expect to initiate an additional phase 3 trial this year. XL092 is also being explored in combination with several checkpoint inhibitors and IO combinations. In October, we announced that we had expanded our partnership with BMS to study the combination of XL092 with the fixed-dose combination of the IO doublet nivolumab and relatlimab. We look forward to evaluating this novel combination across multiple solid tumors.\n\nWe also continue to evaluate additional potential combination opportunities with novel agents. XB002, our first antibody drug conjugate, which targets tissue factor without interfering with the coagulation pathway in preclinical models, continues in dose escalation. In October 2022, we announced promising initial dose escalation results from JEWEL-101, the ongoing phase 1 trial evaluating XB002 in patients with advanced solid tumors during the antibody-drug conjugates poster session at the 34th ENA Symposium. The data demonstrated that XB002 was well tolerated at multiple dose levels.\n\nPharmacokinetic analyses showed that XB002 total antibody and intact ADC PK were similar, suggesting XB002 was stable after infusion. Additionally, at the two-milligram per kilogram dose, XB002 demonstrated approximately twofold higher exposure with 0.10 the free payload relative to levels seen with the same dose of tisotumab vedotin. As of the data cutoff, no bleeding events or corneal toxicities were observed at doses of up to two milligrams per kilogram. We expect to complete dose escalation and move into the multi-cohort dose expansion phase later this year.\n\nDose escalation is ongoing for the combination of XB002 with nivolumab, and we expect to initiate dose escalation in combination with bevacizumab before the end of the year. A phase 1 study of XL102, our oral CDK7 inhibitor, is expected to move into both single agent and combination expansion cohorts after completion of ongoing dose escalation and determination of a phase 2 dose. Preliminary data from dose escalation have been accepted for publication as a poster at the upcoming San Antonio Breast Cancer Symposium in December. Finally, we are making progress with hiring to our site in King of Prussia outside of Philadelphia for roles both within and outside of development, as well as growing our existing presence at headquarters in Alameda.\n\nWithin the development organization, key hires include three executive-level leaders who are based at King of Prussia, and we've seen an uptick in East Coast-based candidate awareness and enthusiasm for the new site. We continue to seek, to attract and retain the best talent across both coasts to meet the needs of our growing pipeline. We also continue to progress plans for a long-term build-to-suit space of over 200,000 square feet mixed office and lab space close to our intermediate term offices in King of Prussia. I'm pleased by the progress we are making to create a bicoastal presence across two biotechnology hubs operating as one team focused on the singular mission of developing medicines to improve the lives of patients with cancer.\n\nWith that, I'll turn it over to Peter.\n\nPeter Lamb -- Chief Scientific Officer\n\nThanks, Vicki. As we've discussed on previous calls, we've been actively engaged in a process of assessing late preclinical and early clinical assets with the aim of identifying multiple opportunities to invest in. Since failure rates for oncology drugs remain high, our preferred strategy is to make multiple smaller option investments before clinical proof of concept rather than making more substantial investments based on inadequate or inconclusive clinical data. The deals that we announced earlier today with Cybrexa and Sairopa represent the initial outcome of this strategy.\n\nStarting with Cybrexa. Developing mechanisms for preferentially delivering cytotoxic compounds to tumors has been a long-standing goal with antibody-drug conjugates representing the most validated and successful mechanism for doing this. The ADC approach relies upon having an antibody to a cell surface protein that is exclusively or preferentially expressed on tumor cells and then covalently conjugating a cytotoxic payload to that antibody. When the antibody-drug conjugate binds to the tumor cell expressing the target protein, it is then internalized and the payload is released, resulting in tumor cell killing.\n\nSince normal tissues have low or no expression of the selected target, they do not take up the payload, minimizing side effects. The success of this approach depends upon appropriate target selection. And with any target, there is variable levels of expression, both within and between tumor types, leading to some heterogeneity of clinical response. In addition, the stability of the attached payload varies between ADCs with liberation of free payload contributing to our adverse events.\n\nNonetheless, development of ADCs has undergone a renaissance with multiple approvals over the last few years, and Exelixis has invested significantly in the area, both internally and via multiple collaborations, to develop our own pipeline of differentiated ADCs. The Cybrexa agreement announced today around CBX-12 represents a further extension of this general approach and relies upon a novel tumor-targeting mechanism. Cybrexa are developing a novel peptide exatecan conjugate, CBX-12, that selectively inserts into tumor cell membranes as opposed to normal cell membranes due to lower pH conditions prevalent in the tumor microenvironment. It is well established that many tumors have an altered metabolism that results in them excreting lactic acid into the tumor microenvironment, thereby reducing the local pH.\n\nThe peptide component of CBX-12 is designed to be sensitive to pH, adopting a disordered structure under normal physiological pH, but assuming an ordered alpha-helical structure at lower pH, which allows it to insert into the tumor cell membrane and bring any attached payload with it. In CBX-12, the payload is the potent topoisomerase inhibitor, exatecan, which gets released inside the tumor cell via cleavage of a disulfide bond that connects to the peptide. In preclinical models, Cybrexa have shown that following administration of CBX-12, both intact CBX-12 and free exatecan, accumulates in tumors, whereas exatecan levels in bone marrow cells remain very low. Notably, this is a tumor selective payload delivery mechanism that does not depend on exploration of tumor antigens unlike the standard ADC approach.\n\nSo it could be broadly applicable, if successful. CBX-12 is currently in phase 1 dose escalation trials that are exploring a number of dosing schedules. Data from this trial was recently presented in the plenary session at the ENA triple meeting in Barcelona. Cybrexa explored three IV dosing schedules: five consecutive days every three weeks, three consecutive days every three weeks and once weekly.\n\nData from 33 patients was presented. The most frequent treatment-related adverse events were GI-related, cytopenias and LFT elevations. This is consistent with the known profile of exatecan, best response in the 18 evaluable patients with a CR in ovarian, a PR in breast and 13 patients with stable disease, including a second near PR in breast. Initial tumor biopsy assessments show delivery of CBX-12 and exatecan into the tumor.\n\nDose escalation continues in the once weekly cohort, and cohort expansion is ongoing at 45 mg per meter squared in the three consecutive days every three weeks cohort. We have an option to license CBX-12 after reviewing the totality of the data from the completion of the ongoing once-weekly dose escalation trial, four phase 1b monotherapy expansion cohorts of about 40 patients in each major solid tumor type at the recommended phase 2 dose and completion of a dose escalation combination cohort with pembrolizumab. All development will occur under a joint steering committee.\n\nMike Morrissey -- President and Chief Executive Officer\n\nOK. Moving on to the Sairopa agreement. This represents an expansion of our approach to addressing the myeloid macrophage component of the tumor microenvironment. Tumor-associated macrophages, along with other myeloid cells, represent a significant and often major component of the solid tumor microenvironment and is prominent in tumors such as colorectal cancer, ovarian cancer, hepatocellular cancer, renal and breast carcinomas, for example.\n\nIt is well established that these cells contribute to an immunosuppressive environment in these tumors. We have a number of ongoing programs that are aimed at addressing this aspect of tumor biology, including XB014, our PD-L1 CD47 bispecific currently in early preclinical development and our collaboration with BioInvent aimed at identifying antibodies against novel myeloid targets expressed preferentially in the tumor microenvironment. Our agreement with Sairopa provides us with another potential way of addressing this potentially impactful mechanism of action. Sairopa is developing a monoclonal antibody, ADU-1805, targeting SIRPalpha, one of the ligands for CD47.\n\nThis has been a pathway of interest to us and others for a number of years, and there is now a degree of clinical validation for blocking the pathway, along with an understanding of some of the issues associated with various therapeutic approaches. The CD47 SIRPalpha axis modulates macrophage phagocytosis, an antibody-dependent cellular phagocytosis. Expression of CD47 on tumor cells inhibits phagocytosis of tumor cells and thereby limits tumor antigen presentation via macrophages, contributing to immune suppression. Blockade of CD47 itself, which has been the favorite approach historically, leads to anemia and thrombocytopenia due to CD47 expression on red blood cells and platelets.\n\nThis also results in a significant PK sink effect. In contrast, SIRPalpha expression is restricted primarily to myeloid cells, and antibodies targeting SIRPalpha do not suffer the same PK sink effect or cause cytopenias. This has been validated clinically in phase 1 with an anti-SIRPalpha monoclonal antibody being developed by Boehringer Ingelheim. This antibody has limited PK sink, does not cause thrombocytopenia or anemia and has shown preliminary evidence of clinical activity, including a PR in HCC as a single agent and three PRs in combinations with a checkpoint inhibitor.\n\nADU-1805 has similarly shown limited PK sink and no anemia, thrombocytopenia in preclinical safety studies. It is important to note that there are 10 SIRPalpha alleles in humans with their frequencies varying by population, and antibodies vary in their ability to bind the different alleles. ADU-1805 binds to all alleles, meaning that patients can be treated without being genotypes in contrast to the BI antibody, which binds tightly to only the V1 allele, meaning that patients must be genotyped to assess which alleles they can carry prior to treatment. In the case of the BI antibody, patients must be homozygous for the V1 allele to enroll in their currently recruiting clinical trials.\n\nADU-1805 has also been optimized to preferentially bind to SIRPalpha versus other SIRP family members, which may enhance its ability to stimulate immune cells. This is another point of differentiation from CD47-targeted therapies, which block all interactions with all SIRP family members. Finally, ADU-1805 is an IgG2 antibody, which has been shown to allow maximal phagocytosis in, in vitro assays. In summary, the antibody has been constructed in a way that maximizes the potential benefit for blocking SIRPalpha CD47 checkpoint while minimizing potential toxicities and allowing for treatment of the broadest population of appropriate patients.\n\nWe believe this represents a differentiated and potentially best-in-class approach to this pathway. Sairopa are on track to file an IND for this asset in Q1 2023. We have an option to license ADU-1805 after completion of a single-agent dose escalation cohort, a single-agent expansion cohort, completion of a dose escalation combination cohort with pembrolizumab and a 60-patient Simon two-stage pembrolizumab combination expansion cohort in major solid tumor types. All development will occur under a joint steering committee.\n\nWe're happy to have concluded these two agreements and are continuing to assess a broad variety of late preclinical and early clinical assets with the aim of making additional investments in the future to provide further option for expanding our clinical pipeline. So as you heard on the call today, the EXEL team continued to execute across all components of our business in the third quarter with significant progress across our business development, clinical development and commercial activities. As we enter Q4 of 2022, we're excited about the potential for the multiple growth drivers ahead of us, including our cabo development activities and expanding pipeline of diverse clinical opportunities that we hope will enable Exelixis to help even more cancer patients. I'll close by thanking the Exelixis team for their individual and collective efforts to support our range of discovery, development and commercial activities.\n\nI want to give our broad team focused on business development activities a huge shout-out for their great work and collaborative efforts over the past few years and certainly the last few months to get the Cybrexa and Sairopa deals over the goal line. Business development is a team sport here at Exelixis, and I am proud of the closely aligned team from BD, R&D, legal, finance, commercial, CMC and public affairs coming together to move these important initiatives forward. Individually and collectively, our team embodies the vision, urgency and expertise to move EXEL toward becoming a multiproduct enterprise and expand our reach to serve cancer patients across the globe. We look forward to updating you on our progress in the future.\n\nThank you for your continued support and interest in Exelixis. And we're now happy to open the call for questions.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nChuck, please go ahead.\n\nOperator\n\nThank you. We'll now begin the question-and-answer session. [Operator instructions] And the first question will come from Asthika Goonewardene with Truist Securities. Please go ahead.\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nHi, guys. Thanks for taking my questions, and congratulations on the nice quarter. Just a couple of questions, simple ones here. First, to P.J., I was just wondering if you could quantify the gross to net impact for the quarter and maybe how much the slight increase in inventory contributed to sales.\n\nFor Vicki, I was wondering if you could maybe give us given the run rate of events, when we could expect the next look at OS to take place for COSMIC-313? And then I just want offer my congrats to the biz dev team for the deals that we announced today. And in particular, the deal CBX-12 looks quite interesting during the recent data. Just wondering when you can expect the next update on the dose escalation. And when do you expect the dose escalation to complete? Thanks.\n\nMike Morrissey -- President and Chief Executive Officer\n\nOK. Thanks, Asthika. Lots of questions there. So let's start with Chris on the inventory and gross to net, and then we'll go to Vicki and then Peter.\n\nChris Senner -- Chief Financial Officer\n\nThanks, Mike. So Asthika, from a gross to net perspective, as I mentioned on the call, we came in around 26.1% for Q3. If you go back to Q2, we're around 28.2% overall for the cabozantinib franchise. It's come down as you -- as we've come through the year, it was higher in Q1 and come down in Q2 and come down in Q3.\n\nAnd so we -- as I mentioned on the prepared remarks, too, that was -- that decline was really driven by lower PHS, Medicare Part D and then also co-pay assistance. As we talked about the year, previously, I said, we think we'll come in the range -- or come in around 29%. I think we're probably now thinking we're going to come in the range of 28% to 29% for the year. From an inventory perspective, this quarter, we came in around 2.3 weeks on hand.\n\nLast quarter, we're around 2.1 weeks on hand. So it's about a day, and I'm not going to quantify it from a sales perspective. But that's -- it's not a significant increase by any means.\n\nMike Morrissey -- President and Chief Executive Officer\n\nOK. Good. Thanks. Vicki?\n\nVicki Goodman -- Chief Medical Officer\n\nYeah. So with respect to the overall survival from COSMIC-313 and just sort of a quick reminder on the study design here. So this is the triplet combination of nivolumab and ipilimumab with cabozantinib versus a control arm of nivolumab and ipilimumab, which has become a standard-of-care on the basis of demonstrating an overall survival benefit relative to sunitinib in intermediate and poor-risk patients. And as you may recall, from the pivotal trial of nivo and ipi CheckMate 214, the updated survival data demonstrated a survival -- median survival on the order of about four years.\n\nSo not unexpected that at this time with the primary PFS analysis, the overall survival would still be immature. The next analysis will be event-driven. And so we'll be providing updated guidance as we get a better sense of when those events might come in for OS. There was a question in there, I believe, on dose escalation.\n\nWas it XB002, I'm not sure for the asset directly.\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nYeah.\n\nMike Morrissey -- President and Chief Executive Officer\n\nYeah, Vicki, that was a question about Cybrexa. Pete, do you want to take one?\n\nVicki Goodman -- Chief Medical Officer\n\nOh, I'm sorry. OK. Thank you.\n\nPeter Lamb -- Chief Scientific Officer\n\nYeah. Thanks for your comments on CBX-12. We certainly view it as a pretty interesting and different mechanism. I mean, obviously, they just presented the initial data at the plenary session in the triple meeting, so it's probably bit soon to say when the next data release will be.\n\nAnd obviously, dose escalation is ongoing. So it's kind of -- it's hard to predict when that will top out and when we'll be in a place to have a recommended phase 2 dose. So stay tuned. We're certainly eager to see the next set of data as well.\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nGreat. Thanks, guys.\n\nMike Morrissey -- President and Chief Executive Officer\n\nYou bet, Asthika.\n\nOperator\n\nThe next question will come from Michael Schmidt with Guggenheim. Please go ahead.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nHey, guys. Thanks for taking my questions. I had a couple of pipeline questions, one also on the XB002 data from the triple meeting. So I mean, the ADC looked pretty safe.\n\nDo you have any plans to go higher than the two mg/kg dose cohort just in context of the safety profile? And how do you think about the potential of this antibody in other cancers outside cervical, for example, perhaps where TF may be expressed? And then I had a follow-up question.\n\nMike Morrissey -- President and Chief Executive Officer\n\nHey, Vicki, do you want to take that one?\n\nVicki Goodman -- Chief Medical Officer\n\nYeah, sure. So dose escalation with XB002 continues at this point. Obviously, we'll continue to monitor closely for dose-limiting toxicities before we establish a recommended phase 2 dose. So I would say stay tuned there as far as where we'll land on the dose.\n\nWe do have broad plans to look at this across a number of different solid tumors, including outside of cervical cancer, both as a monotherapy and potentially in combination with both nivolumab and with bevacizumab. And among the dose expansion cohort in the current study include tumors such as non-small cell lung cancer, head and neck and breast cancer, among others. So again, we're going to establish a dose to move quickly into expansion cohorts, see where we demonstrate activity and then plan to move quickly into registrational trials. We do believe that this asset, again, has some potential advantages over the competition, given that the intact ADC is stable.\n\nWe're seeing low levels of free payload thus far, that seems to be playing out in terms of a potentially differentiated safety profile and may impact what we see with efficacy, as well as what seems to be reduced bleeding risk with no bleeding events having been seen at the time of the data cut-off. So we're excited about this asset and eager to move it into expansion and ultimately, registrational trials.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nOK. Great. Thanks. And then a question on XL102, our CDK7 inhibitor.\n\nJust wondering if you could help set expectations for the scope of this update here at San Antonio. And did the dose escalation perhaps buyers toward recruiting breast cancer patients? How should we think about potentially achieving single activity with this target? If there's an area where you might consider implementing biomarker selection? Or is this something that could have a broader potential without selection in breast cancer? Thanks so much.\n\nVicki Goodman -- Chief Medical Officer\n\nYeah. So on XL102, again, it will be presented at the San Antonio Breast Cancer Symposium in about a month. As far as the details on the content, I'd say stay tuned both for the abstract and the presentation, but it will be data from dose escalation cohorts.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nThank you.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThank you, Michael.\n\nOperator\n\nThe next question will come from Mike King with EF Hutton. Please go ahead.\n\nMike King -- EF Hutton -- Analyst\n\nHey, guys. Thanks for taking the question, and let me add my congratulations on a nice quarter. I'm wondering if you could talk a little bit more about your optimism about CONTACT-01, because it just seems to me, you mention it in every call, but I wonder what your thoughts -- what thoughts you could share with us on the probability of success here, because even a small piece of the second line on small cell markets a pretty big commercial opportunity, and that could create a interesting inflection for cabo I would think. So I just wonder if you could expand on it without giving too many of the secrets away.\n\nVicki Goodman -- Chief Medical Officer\n\nSure. Happy to. Yeah. So CONTACT-01, again, this is in a post checkpoint inhibitor, post platinum chemotherapy setting in non-small cell lung cancer, patients without an actionable mutation.\n\nIt's an area of huge unmet need, right? There's no well defined standard of care. Docetaxel is a common treatment and as we know from even the pre-check inhibitor days response rate, there's on the order of 10% and survival -- median overall survival expectation is less than a year. So it is an important area of unmet need. And here we're evaluating whether cabozantinib, which can induce a more immune permissive environment might help overcome some of the resistance to checkpoint inhibition in this case with atezolizumab and whether that combination can improve overall survival, again in a setting where the survival expectation is quite low.\n\nSo we do look forward to these results, which as I said will be -- we'll have in hand before the end of the year.\n\nMike King -- EF Hutton -- Analyst\n\nAre you in charge of the data release or is that a Roche decision?\n\nVicki Goodman -- Chief Medical Officer\n\nIt is a Roche-sponsored study, so we're working very closely with Roche on how and when those data will be released.\n\nMike King -- EF Hutton -- Analyst\n\nThank you.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThanks, Mike.\n\nOperator\n\nThe next question will come from Do Kim with Piper Sandler. Please go ahead.\n\nDo Kim -- Piper Sandler -- Analyst\n\nGreat. Thanks for taking my questions, and congrats on the quarter. Just trying to understand the updated guidance, you raised the lower end of the range, but it still suggests a decline in net product revenues quarter over quarter. Just wondering if it's because of the choppiness of clinical trial cells that you see? Do you exclude that potential sales to clinical trials? Or is there something else you're seeing in demand or gross to net that keeps guidance at the lower level?\n\nChris Senner -- Chief Financial Officer\n\nYeah, Do. This is Chris. So the guidance -- the tightened guidance range is $1.375 billion to $1.4 billion. If you look at that range versus where we are year to date, the top end of that or the middle to the top end of that range gives you growth for the next quarter.\n\nAnd we continue to see strong growth coming out of Q3, as P.J. mentioned, in September, we ended September in a very strong fashion from a demand and new patients perspective. And there's also a lot of variables around gross to net that we have to take into account. But overall, we -- the top end and the middle to the top end of that range expects growth.\n\nDo Kim -- Piper Sandler -- Analyst\n\nOK. Great. And regarding your newly announced deals. It looks like the platform technology drove the Cybrexa deal and the target SIRPa drove the Sairopa deal.\n\nIs that how you think about it? And do you prioritize potential deals by a certain novel drug technology or looking at clinically validated targets?\n\nPeter Lamb -- Chief Scientific Officer\n\nYeah. Thanks for the question. I think I somewhat agree with your characterization. I think we would view the Cybrexa CBX-12 as really a first-in-class type of asset.\n\nAnd as commented in the script, it's really an extension or expansion of kind of overall ADC approach. But importantly, in a sort of tumor target agnostic way, you don't need to express a particular tumor target in this case, which means they could be broadly applicable as a platform. Sairopa is really more of a best-in-class opportunity. Obviously, there's been a fair amount of activity around the whole CD47/SIRPa macrophage checkpoint area, much more on the CD47 side.\n\nThis particular asset looks really attractive to us just because we thought it was very well thought out in terms of maximizing the potential for blocking this checkpoint from a tax point of view, from a potential efficacy point of view, and from an addressable patient population point of view. So in general, we look broadly at a lot of things, small molecules and biologics. I wouldn't say we buy us more toward target versus platform, and you probably see us do a mixture of things going forward.\n\nDo Kim -- Piper Sandler -- Analyst\n\nGreat. Thank you.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nYou bet, Do. Thank you.\n\nOperator\n\nThe next question will come from Silvan Tuerkcan with JMP. Please go ahead.\n\nSilvan Turkcan -- JMP Securities -- Analyst\n\nWell, thank you very much for my questions, and apologies for my voice and congrats on the quarter. I have one question. You mentioned that you have seen the highest levels of new patient starts versus what is available in public sources. Could you please comment on that? And would those be new patient starts in frontline RCC mainly? And what do we know about the time on treatment now in frontline renal cell versus what we've seen in the trial? Thank you very much.\n\nP.J. Haley -- Executive Vice President of Commercial\n\nYeah. Thanks for the question, Silvan. This is P.J. Yeah, we are really pleased with the quarter.\n\nAs you pointed out, I'd maybe just highlight three things in the quarter in terms of its strength. We have the highest ever net product revenue, the highest ever demand. And as you mentioned, the highest ever new patient starts. What we're seeing there primarily is those new patient starts are driven by renal and specifically primarily first-line combination use with nivolumab, and we've seen that in multiple market share data that we have.\n\nWith regards to that that does give us -- yes, it is encouraging, as I mentioned also with the fact that we had good momentum in September kind of coming out of the quarter. With regards to sort of the duration of treatment, as I mentioned in the prepared remarks, as our mix has shifted over the last year and a half, seven quarters with the launch of 9ER in first-line combination utilization. We're seeing that mix shift in our duration increase over time. What we saw in the 9ER trial is patients -- PFS of the ballpark of a year and a half.\n\nAnd it's really too early to get a good read on duration for those particular patients commercially because we just haven't been on the market long enough and duration is something you have to have a lot of data and look at retrospectively. But very pleased with what we're seeing. The team is executing at a very high level. We're happy that things are opened up with regards to offices and medical meetings, etc.\n\nSo we're very engaged and excited to continue to help patients with CABOMETYX.\n\nSilvan Turkcan -- JMP Securities -- Analyst\n\nOK. Thank you very much.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nOK. You bet, Silvan. Feel better.\n\nOperator\n\nNext question will come from Jason Gerberry with Bank of America. Please go ahead.\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my questions. Just one quick follow-up on the Cybrexa deal, just the language. Is there a phase 1 contingency regarding the upfront and moving forward with the transaction? Is Chris, if you could elaborate on that commentary? And I would assume that the next steps would be similar to what Cybrexa communicated, which was a phase 2 ovarian breast and non-small cell lung cancer as next steps, but just curious if you can elaborate there.\n\nAnd then just the other question, are you still expecting a ruling in the cabo patent trial for that first case in the near term? I think fall 2022 was the last communication, but just kind of curious, anything that we should know there? Thanks.\n\nPeter Lamb -- Chief Scientific Officer\n\nYeah, with respect to Cybrexa, the way it's structured, right, that's an upfront payment. And then there's a certain amount of clinical work that needs to be completed up to the point at which we can exercise. We have the ability to take the asset on. As commented, we're still really in dose escalation on one of the schedules, which is the once weekly schedule.\n\nSo that dose escalation will continue, because the doses being expanded on one other schedule, which is kind of the three consecutive days, every three-week schedule. And then again, provision for -- there's four expansion cohorts in major solid tumor types at a recommended phase 2 dose. So that's basically the package of clinical information that would be collected prior to option -- plus a dose escalation in combination with pembrolizumab.\n\nMike Morrissey -- President and Chief Executive Officer\n\nJason, it's Mike. On the ANDA front, yeah, we still expect ruling sometime this fall, timing to be determined by the judge. So stay tuned.\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Thanks.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nYeah. Thanks, Jason.\n\nOperator\n\nThe next question will come from Andy Hsieh with William Blair. Please go ahead.\n\nAndy Hsieh -- William Blair & Company -- Analyst\n\nGreat. Thanks for taking my questions. Congratulations on all fronts. Strong commercial cabo sales, clinical updates and then BD, of course.\n\nPeter, I hope you're feeling OK. I hope you feel better soon. I got a question about the CBX-12. So I remember from the triple meeting, the data was mostly generated from either the three consecutive day and five consecutive day schedule.\n\nAnd as you think about moving to the weekly schedule, just curious about the PK profile for that dosing schedule? For the pH tumor microenvironment is pretty interesting. I am curious if there is a way to either through a biomarker or potentially F-18 FDG to really select for patients who might best benefit from this kind of therapy.\n\nPeter Lamb -- Chief Scientific Officer\n\nYeah. Thanks, Andy, for your questions. Yeah, so there was data presented on the five consecutive days every three weeks, and then three consecutive days every three weeks. And I think the first dose, which is 20 mg/L squared on the once weekly dose.\n\nI think what was actually encouraging there is if you looked at the data, you would've seen that the partial response in breast was actually on the once weekly dose schedule. So we were certainly encouraged by that. The overall PK for this molecule is pretty interesting. What we understand from the preclinical data is, you give a dose, you start seeing accumulation of CBX-12 in the -- kind of in the tumor or tumor microenvironment, and then a release essentially of exatecan that builds up over time.\n\nHow that's going to play out clinically? Of course, is still being analyzed. They did present a little bit of data that was encouraging, certainly showing pretty reasonable free exatecan levels in some tumor biopsies. Was there another question? I think there was, right?\n\nAndy Hsieh -- William Blair & Company -- Analyst\n\nYeah.\n\nPeter Lamb -- Chief Scientific Officer\n\nThe biomarker one.\n\nAndy Hsieh -- William Blair & Company -- Analyst\n\nYeah, exactly, the biomarker.\n\nPeter Lamb -- Chief Scientific Officer\n\nYeah, so generally speaking, right, the approach does rely on the tumors being metabolically active, and typically in this case being glucose utilizing, although not completely necessarily, so in principle FDG PET could be used. However, I would suggest that this is such a broad phenomenon that it's probably not necessary to pre-select patients.\n\nAndy Hsieh -- William Blair & Company -- Analyst\n\nGot it. OK. Yeah, I also have a quick question about maybe how you're thinking in terms of XL092, the ability to salvage cabo pretreated patients in RCC. I guess you've probably -- we probably saw that in HCC where fluorinated sorafenib was able to salvage sorafenib patients.\n\nI don't know if you have any comments on that phenomenon as well?\n\nPeter Lamb -- Chief Scientific Officer\n\nYeah. It's certainly interesting. We certainly see activity with 092 post cabozantinib in that setting. And the exact reasons for that, I think mechanistically aren't entirely clear.\n\nSometimes -- and it's a phenomenon as you rightly point out that's been seen with a number of not just TKIs, but drugs. If you kind of have a kind of period time off, you can get reresponses if you redose. So not completely fully understood, but I think certainly encouraging from a clinical activity point of view.\n\nAndy Hsieh -- William Blair & Company -- Analyst\n\nGreat. And maybe perhaps last question for P.J. XB002 very encouraging signal, no neuropathy or bleeding events, very, very -- after a great start. Just maybe from a physician feedback standpoint do they prefer to kind of push a dose and with very hands on ocular toxicity management protocol or perhaps, little bit hands off by providing some just intrinsically safer profile? Just curious about how you think about it from a product development standpoint.\n\nP.J. Haley -- Executive Vice President of Commercial\n\nYeah, Andy, thanks for the question. I think at this point, obviously with our product so early in development, I'll just speak generally about kind of what we see across the board in different tumor types and market. I think really what it would come down to is the specific details of the toxicity profiles of the competitive environment, so to speak, or the standard of care in that particular setting. So I think it's really hard to generalize.\n\nBut obviously generally speaking in oncology where there are many options and where the unmet medical need is high physicians are willing to tolerate greater toxicity profiles. But really too early I think too much about that kind of have to get data and understand the settings that we're talking about in detail.\n\nAndy Hsieh -- William Blair & Company -- Analyst\n\nGreat. Thank you so much.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nOK. You bet, Andy. Thank you.\n\nOperator\n\nThe next question will come from Jay Olson with Oppenheimer. Please go ahead.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nHey, congrats on the quarter, and thank you for taking the questions. Can you talk about what we should be looking for in the STELLAR-002 data at SITC as you build on the expectations that were set with the initial STELLAR-001 data you presented at ESMO? And maybe any comments you have on the next pivotal study indications for XL092?\n\nVicki Goodman -- Chief Medical Officer\n\nYes, so STELLAR-002 still in early days. So we are in dose escalation for the combination with nivolumab and nivolumab and ipilimumab, and of course, we'll soon be adding the nivo-relatlimab combo to that as well, so no data to be presented quite yet. Looking forward to being able to give an update on data timing when that's available. Sorry, I just forgot your other question.\n\nI apologize.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nAny comments you could share on the next indications you intend to pursue in the pivotal study?\n\nVicki Goodman -- Chief Medical Officer\n\nYeah, so as mentioned earlier, we started the first phase 3 STELLAR-303, which is the CRC trial earlier this year. We are focusing now on a second phase 3 trial. I'd say stay tuned for the indication coming soon. But we do hope to initiate that one by the end of the year.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nOK. Great. Thank you. That's helpful.\n\nAnd then congrats on the business development progress. I was curious if you could comment on any appetite for late stage BD deals and also congrats on the U.S. geographic expansion. And I was wondering any comments you could share on ex-U.S.\n\ngeographic expansion?\n\nP.J. Haley -- Executive Vice President of Commercial\n\nJust to comment on the late stage deals. I mean, I comment at the beginning. We have been looking at a lot of late pre-clinical early clinical deals and we're going to continue to do that. That being said, absolutely we would look at later stage clinical assets.\n\nBut there just has to be that confluence of us having feeling as a solid scientific rationale, compelling clinical data have been generated to date, there's a good clinical and commercial future for the asset. So all those things have to happen for us to kind of pull the trigger on a later stage deal.\n\nChris Senner -- Chief Financial Officer\n\nAnd this is Chris. On U.S. and ex-U.S. expansion, so from a U.S.\n\nperspective, as Vicki talked about we're expanding in King of Prussia and we'll eventually have a larger building there with both office for the development organization and other G&A type organizations, but also labs for discovery. From an ex-U.S. perspective, as Mike said, in J.P. Morgan 2020, all of the compounds going forward coming out of our pipeline are in-license.\n\nWe're going to launch those globally. So when we get closer to launch, we'll expand internationally.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nGreat. It's super helpful. Thanks for taking the questions.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nYou bet. Always good to hear you, Jay.\n\nOperator\n\nThe next question will come from Etzer Darout with BMO. Please go ahead.\n\nEtzer Darout -- BMO Capital Markets -- Analyst\n\nGreat. Thanks for taking the questions, and congrats on the quarter. I guess, first question for me, if you could just kind of speak to maybe the balance of the R&D spend step up in the full year guidance sort of beyond the funds you indicated for the two deals announced today. And then second, the early data for CBX-12 was pretty interesting at ENA, interesting technology as well in terms of this pH dependency.\n\nI guess, I wondered if that delta between healthy and tumor cells for pH in terms of where this may make more sense in terms of the tumor types. And if that sort of correlates with the tumor type that Zyprexa is pursuing right, that delta in terms of pH from healthy to tumor cells?\n\nChris Senner -- Chief Financial Officer\n\nYeah, so from -- this is Chris. So from an R&D expense guidance perspective, I mean, as I mentioned, it's primarily to reflect the two deals we announced today and then also just our continued investment in the pipeline throughout the fourth quarter.\n\nMike Morrissey -- President and Chief Executive Officer\n\nYeah. Hey, it's Mike. On the Zyprexa side, I don't think it's well documented from a tumor to tumor level. The relative pH difference between individual tumors or tumor types and normal cells, I think that's probably cutting it a bit thin in terms of what's actually known.\n\nSo the general phenomena, I think has been pretty well validated as Peter mentioned from the point of view of the lactate that's involved. But I think on a case to case basis, our view is that the overall approach with CBX-12 gets us into a game, if you will, that allows us to target any tumor potentially without having to have an address as you would normally see with an ADC. Peter, would you agree with that?\n\nPeter Lamb -- Chief Scientific Officer\n\nYeah, exactly. I think that's -- yeah, that's the intriguing part of the platform. It's a target agnostic way of enhancing delivery of a cytotoxic to potentially a broad variety of tumor cells.\n\nEtzer Darout -- BMO Capital Markets -- Analyst\n\nGreat. Thanks for that, and congrats again on the quarter.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThank you, Etzer.\n\nOperator\n\nThe next question will come from Peter Lawson with Barclays. Please go ahead.\n\nPeter Lawson -- Barclays Capital -- Analyst\n\nHey, thanks for taking my questions. Just on STELLAR-303 in CRC, when can we see data around that? Is there interim analysis and the second phase 3, could that generate data sooner than the 303 trial?\n\nVicki Goodman -- Chief Medical Officer\n\nSo we're in the very early days of enrollment for STELLAR-303. I would say stay tuned for more information about when we expect to read out as we're able to better project events as it is an event driven analysis. We are evaluating other additional indications including potential for early registration path and so certainly looking across a range of different solid tumors, I would say where we have data with cabo and given the shorter half-life of XL092, even looking at settings where we were unable to take cabo, as well as of course the novel combinations. So really looking for maximizing that opportunity and looking for rapid path to registration across multiple tumor types.\n\nPeter Lawson -- Barclays Capital -- Analyst\n\nThank you. And then just follow-up for Chris around the revenues in the quarter, just what was the benefit from -- if there was a benefit from clinical trial sales in the quarter and is that ended their expectations for Q4 by any chance?\n\nChris Senner -- Chief Financial Officer\n\nYeah, Peter, thanks. Yeah. So as I mentioned in the prepared remarks, we talked about having clinical trial sales of about $13 million in Q3. I also mentioned that there has been choppiness over the last year or so going from $8 million to $17 million in any given quarter.\n\nSo we think that that sort of choppiness will continue going forward in future quarters.\n\nPeter Lawson -- Barclays Capital -- Analyst\n\nGot it. And you'd expand that to go through 2023 as well, it's not a kind of a when [inaudible].\n\nChris Senner -- Chief Financial Officer\n\nPeter's, it's not that that one's not up to us, right? I mean, we're getting orders from other companies that are doing trial with CABOMETYX. So that's up to the trial and their ordering patterns.\n\nPeter Lawson -- Barclays Capital -- Analyst\n\nPerfect. Thank you.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nOK, Peter.\n\nOperator\n\nThe next question will come from Yaron Werber with Cowen. Please go ahead.\n\nYaron Werber -- Cowen and Company -- Analyst\n\nGreat. Thanks for taking my question. I got a maybe just a couple; P.J. maybe for you, just the first one, in terms of growth for cabo.\n\nIs it share gains from what -- is it still moving away from the old TKIs or is it potentially continuing to make dent into the nivo ipi opportunity? And then secondly, in terms of growth to net, as you think about next year, I know you can't give guidance, but is it 28% to 29% range, sort of where you're anticipating based on what you know now. And then just finally in CONTACT-03 the core primary of PFS and OS, is it -- you need to hit both or can you do either or? Thank you.\n\nP.J. Haley -- Executive Vice President of Commercial\n\nYeah. So I'll start off. This is P.J. talking about the growth,.\n\nWhat we've said and what we're seeing with regards to growth for CABOMETYX is a couple things. As I mentioned we had our highest new patient starts ever, and what we're seeing there is primarily driven by first line combination patients. And the sources say that we're -- our market share has been growing certainly at the expense of other competitors. So we've seen that across the board, but growth also is being strongly driven by the increasing duration of therapy from CABOMETYX overall as more and more of our patients over time.\n\nOur first line combination patients, which have a profile of a longer duration of therapy as I mentioned, 9ER PFS in the ballpark of a year and a half, so those are kind of the two elements of growth as we see it.\n\nChris Senner -- Chief Financial Officer\n\nYaron, its Chris. So yeah, as I mentioned answering Asthika's question, we think this year is going to be closer in the range of 28% to 29%. As we talked about earlier, too, we've seen gross net come down quarter to quarter from Q1 to Q3. We've seen that in other years and it's right now we're not providing guidance or recommendations for 2023 yet, but we'll -- we could talk about that on the Q4 call in February.\n\nVicki Goodman -- Chief Medical Officer\n\nAnd for CONTACT-03, so PFS and OS are dual primary endpoints. We will be looking at mature PFS data and interim for OS, and essentially the trial needs to hit one of the endpoints to be declared a successful trial.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThanks, Yaron. Operator, do you have any more questions?\n\nOperator\n\nYes, ma'am. The next question will come from Chris Shibutani with Goldman Sachs. Please go ahead.\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nGreat. Thank you very much. On the business development, congratulations on some activity there. Can you just elaborate a little bit on what the decision would be for you to go ahead and acquire CBX-12? What would that be based on -- what kind of clinical data might you consider encouraging enough for you to advance that acquisition?\n\nMike Morrissey -- President and Chief Executive Officer\n\nYeah. Chris, it's Mike. Just based on probably good data and we'll know it when we see it, so wouldn't want to pre-empt that now but obviously we're in the game of generating data that we can use to differentiate and build upon the platform that we've got to help patients. So obviously the better the data, the more likely we are to trigger any milestone that drives us to move forward with any collaboration.\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nOK. Well, certainly that makes sense. Then as we think about, and Peter asked this question earlier in terms of your interest, you certainly have building cash, $2 billion; it's a question really about capital allocation priorities. It seems from the activity that's been heightened on the business development front, and as you outline in the opening sentence of the press release for the quarter, that you have a focus on things that are sort of clinical or near to clinical.\n\nAs I think about the possibility of the timeline for these to become commercial, it's a little bit more on the intermediate to longer term range. And as I juxtapose that against kind of the potential duration of combo as an asset, can you help give a sense into this confidence in to this Clinical Stage Assets more that might ripping toward the back end of the decade, but may not be at the level of the revenues that are certainly demonstrated by the success with cabo thus far? I'm just trying to think about the longer term profile of revenues as we go through the balance of the decade with the decisions that you're making now in the BD front?\n\nMike Morrissey -- President and Chief Executive Officer\n\nYeah. I would say we probably don't share your view on timelines to successful implementation and execution around getting the pivotal trials, having those run and readout. So our view is, we're doing BD on a pretty aggressive scale based upon the conviction we have in the asset pool that's available broadly within oncology, small midcap biopharma. Our view is we have to do deals with and four assets that we have conviction can actually work, and then we get to a point where in the case of both assets, we can move forward pretty aggressively once we have proof of concept data.\n\nSo I think our view on timing and your view on timing are different, then it'll be up to us to prove that as we did with cabo in the past. Obviously, we have a pretty strong lens here with the cabo experience, not only in navigating the development and regulatory success, but having a molecule now that has a global run rate based upon Q3 of almost $2 billion a year. So I think we have a lot of confidence and a lot of certainly record of success there. The team is growing.\n\nWe certainly have a broad net for additional assets going forward. My guess and my projection would be these won't be the last two asset deals or option deals you see for novel assets. And that will continue over time. And the goal is, and has been for the last couple years to build a diversified portfolio of assets that we can drive growth in the out years and that's still the plan.\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nGreat. And then there's a compliment to that naturally then the operating expense levels with your confidence in advancing through clinicals as I think about 2023 to 2028, just say the next five years. Do you believe that consensus is forecasting your opex in particular R&D levels correctly to mirror your confidence in the ability to advance the clinicals and to generate revenues at that scale? Certainly seems as if you're doing a great job of expanding your footprint, but just in terms of level of spend on opex, in particular in the R&D front any color there would be helpful?\n\nMike Morrissey -- President and Chief Executive Officer\n\nYeah. Chris, I don't know how we could possibly give you guidance on that or get opine upon that guidance that you're speaking to as those models based upon what's happening in our world today? Obviously we're running a business where we can generate; we have a lot of cash. We generate free cash on a regular basis. We've been profitable for many years going back in time.\n\nSo our job is to obviously balance, manage the P&L carefully and build for the future growth of the revenue base that we're trying to do. So we'll do that well, but certainly can't opine upon models that are going out to later years in the decade, right?\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nOK. Appreciate your perspective. Thank you.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nOK. Thanks, Chris.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Ms. Susan Hubbard for any closing remarks. Please go ahead.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nYeah. Thank you, Chuck, and thank you all for joining us today. We certainly welcome any follow up calls with questions that you may have.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nMike Morrissey -- President and Chief Executive Officer\n\nChris Senner -- Chief Financial Officer\n\nP.J. Haley -- Executive Vice President of Commercial\n\nVicki Goodman -- Chief Medical Officer\n\nPeter Lamb -- Chief Scientific Officer\n\nAsthika Goonewardene -- Truist Securities -- Analyst\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nMike King -- EF Hutton -- Analyst\n\nDo Kim -- Piper Sandler -- Analyst\n\nSilvan Turkcan -- JMP Securities -- Analyst\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nAndy Hsieh -- William Blair & Company -- Analyst\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nEtzer Darout -- BMO Capital Markets -- Analyst\n\nPeter Lawson -- Barclays Capital -- Analyst\n\nYaron Werber -- Cowen and Company -- Analyst\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nMore EXEL analysis\n\nAll earnings call transcripts"
}