{
  "companyName": "Cleveland-Cliffs",
  "companyTicker": "CLF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/cleveland-cliffs-clf-q3-2022-earnings-call-transcr/",
  "content": "Cleveland-Cliffs (CLF -2.30%)\nQ3 2022 Earnings Call\nOct 25, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. My name is Maria, and I am your conference facilitator today. I'd like to welcome everyone to Cleveland-Cliffs third quarter 2022 earnings conference call. [Operator instructions] The company reminds you that certain comments made on today's call will include predictive statements that are intended to be made as forward-looking within the safe harbor protections of the Private Securities Litigation Reform Act of 1995.\n\nAlthough the company believes that its forward-looking statements are based on reasonable assumptions, such statements are subject to risks and uncertainties that could cause actual results to differ materially. Important factors that could cause results to differ materially are set forth in reports on Forms 10-K and 10-Q and news releases filed with the SEC which are available on the company's website. Today's conference call is also available and being broadcast at clevelandcliffs.com. At the conclusion of the call, it will be archived on the website and available for replay.\n\nThe company will also discuss results excluding certain special items. Reconciliation for Regulation G purposes can be found in the earnings release, which was published this morning. At this time, I would like to introduce Celso Goncalves, executive vice president and chief financial officer.\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nThank you, Maria, and thanks to everyone for joining us this morning. Before going through our Q3 results, let me start by highlighting the $1.8 billion improvement to our balance sheet that was outlined in our earnings release this morning. During the quarter, we signed two new labor agreements covering approximately 14,000 USW represented employees, encompassing more than half of our workforce. These agreements also cover benefits for over 22,000 retirees.\n\nThe ratification of these labor agreements triggered a remeasurement for the associated pension and OPEB plans, essentially requiring a refresh to all assumptions that go into calculating the value of those liabilities, including primarily interest rates, asset returns and, most importantly, the premiums that we pay for retiree healthcare expenses. With interest rates higher this year and asset returns lower, those two first factors effectively offset each other. But the third factor, the updated healthcare premiums, resulted in a significant reduction to our overall liabilities. Using our size and scale to our advantage, we were able to proactively renegotiate significantly lower premiums with our health insurance providers at much lower costs.\n\nAll in all, these updates reduce our net pension and OPEB liabilities on our books by $1.8 billion relative to the end of 2021, a 63% reduction. Our pro forma net liability for pension and OPEB is now only $1.1 billion, compared to $2.9 billion at the end of 2021 and $4.2 billion at the end of 2020 after we acquired ArcelorMittal USA. In less than two years, we have reduced this liability by over $3 billion. As you may recall, the pension and OPEB liabilities we assumed were by far the largest piece of the enterprise value of the AM USA acquisition.\n\nAnd now most of those liabilities have moved over to equity on our balance sheet. Going forward, these changes will also reduce our OPEB cash funding obligations by more than $100 million per year, cutting this use of cash by more than half. Since the larger of the two labor agreements was not ratified until October 12th, meaning after the end of Q3, the full impact of this change was not reflected on the actual 9/30 balance sheet. That's why we provided the pro forma calculation in our press release this morning.\n\nFurthermore, the impact of these renegotiated healthcare premiums is also applicable to other plans that will not be remeasured until December 31st. As a result, when we report the Q4 and year-end 2022 financials, we expect these liabilities to be even lower on the 12/31 balance sheet. Also, to be clear, the benefit we have gotten just comes from reduced premiums from healthcare providers and does not reflect any reduced benefits for our retirees. This was truly a win-win for both the company and the union, and we thank the USW for their partnership to make it happen.\n\nNow moving on to our results. In Q3, we generated $5.7 billion of revenues, $452 million of adjusted EBITDA, and $288 million of free cash flow. On the revenue front, steel sales volumes of 3.6 million net tons held roughly steady with the prior two quarters as lower demand from service centers and distributors was offset by higher automotive volumes. Very importantly, Q3 of 2022 was our best quarter to the automotive market since the semiconductor shortage began, but is still well below what we would consider normalized compared with the period from 2014 to 2019.\n\nGoing forward, in Q4, we expect total volumes to increase as a result of further improved automotive, service center, and slab demand. On the pricing side, our sequentially lower average selling price was driven by the index-linked portion of our business with declines in the hot rolled, cold rolled, and slab indices. We also had declines in EBITDA for our third-party pellet and scrap businesses as a result of lower pricing. Looking into the fourth quarter, the improvements we achieved on the contractual fixed prices that reset in October will help to mitigate the lagged impact of continued falling index prices, but a product mix heavier in slabs and HRC will be a negative factor on our realized price.\n\nOur adjusted EBITDA performance was also impacted by higher reported operating costs, which on a unit basis trended upward in Q3 due to the lag effects of higher cost inventory that we foreshadowed on our previous call. Compared to 2021, our 2022 costs have been up meaningfully due to inflationary pressures on input and energy costs as well as lower production volume and higher repair and maintenance spending. From a cash cost standpoint though, these costs peaked in Q2, but the impact on our results was not fully flushed through EBITDA until Q3, a dynamic that can be seen when comparing the Q3 and Q2 cash flow statements. With all big repairs behind us, our repair and maintenance expenses have begun to decline rapidly here in Q4.\n\nGoing forward, increased production volumes will also further dilute our fixed costs. From a free cash flow standpoint, we generated almost $300 million of free cash flow in Q3, largely driven by a significant amount of working capital released during the quarter. Price declines, combined with lower cost of inventory, should lead to continued release of working capital in Q4 and into next year, supporting strong free cash flow generation and partially offsetting the cash flow impact of declining EBITDA. Also, our capital expenditures should decline in Q4 and even further into next year, where we expect total capex to be between $700 million and $800 million in 2023.\n\nWe also expect cash taxes to be negligible for the rest of this year, with a substantial refund coming in early 2023. And of course, pension and OPEB cash needs will decline substantially, as discussed earlier. Consistent with our previously stated capital allocation priorities, we continue to use the majority of our free cash flow to pay down debt. During Q3, we reduced net debt by $200 million, and on a year-to-date basis through today, we have reduced our net debt by $1 billion, bringing our current net debt level below where it was before we completed the acquisition of ArcelorMittal USA.\n\nOur capital allocation priority remains to continue reducing our overall debt. And beyond that, we still have around $800 million remaining under our current share repurchase authorization. With almost $2.5 billion of liquidity, a much cleaner balance sheet with meaningfully reduced pension and OPEB obligations, lower operating costs going forward, less capex next year, minimal cash taxes for the remainder of this year, cash coming in from working capital and no major bond maturities until 2026, we are in great shape to navigate any potential recessionary environment. Very importantly, our automotive shipment levels in Q3 have indicated the largest end market has been countercyclical due to the massive backlog from lower production over the past two years.\n\nThe strength of our automotive franchise with our unique product offering and ability to lock in fixed price contracts will reduce volatility, especially now that our major maintenance, repair, and capital expenditures are behind us and costs begin to trend meaningfully lower. I will now turn the call over to our CEO, Lourenco Goncalves.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nThank you, Celso, and good morning, everyone. Throughout my several years with Cliffs, our company has transformed and adapt to several different challenges, but two elements have remained constant throughout: our commitment and full support to manufacturing in the United States is one, and the importance we place on our people is the other. This is not just a speech. We have backed this up with actions.\n\nOur latest labor agreement with our USW represented workforce is the most recent demonstration of that. The deal provides increased wages, offers better insurance, gives improved pension benefits, and enhances vacation and holiday provisions. We also agreed to continue to invest in our facilities at $4 billion over four years, combining capex and opex, which is consistent with typical spending on these types of investments for our footprint. We also kept the retiree benefit strong, and we're able to negotiate lower rates across the board, as Celso has already explained.\n\nTogether with our union partners, we have integrated four stand-alone companies in a span of just two years, we overcame a difficult pandemic, completed the construction of a state-of-the-art direct reduction plant, invested to keep our mills at an automotive level standard, paid out a significant amount of debt and drastically reduced our pension and OPEB liabilities, which we assumed two years ago in order to make the entire transformation possible. Our third quarter results were unique in that they reflect abnormally elevated costs, the largest portion of which was incurred in the second quarter but did not flow all the way through until Q3. We have been open since day one that the set of assets we acquired, particularly those from AM USA, were a bit underinvested and at some point would need some catch-up repair and maintenance. We got great value on this asset -- on these two acquisitions.\n\nAnd in fact, over the past two years, we have already paid ourselves back with profit from the business, even with the persistent underperformance of the automotive industry during that time frame. That said, embedded in the low acquisition price was an implied catch-up repair and maintenance cost. That is now behind us. As a major supplier to the automotive sector.\n\nThe quality standards for our equipment must be pristine. We ramped up repairs beginning in the fourth quarter of last year, reinvesting a portion of our record profits earned throughout the year. It was around that time that we're signing new fixed contracts with our automotive customers at higher prices. So it was even more important that our equipment capability was taken care of.\n\nAs our spending picked up, both capex and opex, in many cases, we found more work to do than we initially anticipated. The best example of this was the outage of our Cleveland Works facility which lasted from March through August. The original scope of the blast furnace reline expanded to effectively include the rebuild of the waste water treatment plant and the powerhouse located on site as well as several other smaller jobs. Fast forward to the present moment, we are now at the point where the major maintenance cycle has been concluded.\n\nDue to the work we have done, our equipment is in great shape and prime time to meet the unique needs of our customers, particularly in automotive. The most common feedback we consistently hear from these automotive customers is about our perfect steel quality and our ability to give them steel during a time that the entire automotive sector has been deeply affected by underperformance from several suppliers throughout their supply chain. Not the case with what they buy from Cleveland-Cliffs. And these clients know that.\n\nThroughout this year, and particularly during the big repairs, we have seen the negative impact of lower production volume, reducing our ability to dilute our fixed costs. In the first nine months of 2021, we sold 12.5 million tons of finished steel, compared to 10.9 million tons of finished steel so far this year. That being said, automotive steel demand has started to improve in Q3, and we expect our volumes to increase further in Q4. That will result in improved costs going forward.\n\nThe remaining drivers of higher cost, including increasing natural gas, electricity and alloys, are not unique to us, and we have also seen some relief in these areas. All in, based on our inventory status and current outlook for inputs, we expect our reported unit cost in Q4 to fall at least $80 per ton compared to Q3, with further reductions into the first half of 2023, even after factoring the increased wages in the USW labor agreements that were recently ratified. As for demand, we were encouraged by the 100,000 tons volume improvement from our automotive customers from Q2 to Q3. And while they're still not back to normalized levels, the worst impact of the chip shortage seems to be behind us.\n\nIn our view, automotive is now in position to carry the market. Despite the Fed's best efforts to damage the jobs market, unemployment at 3.5% is at a 50-year low, and that means people both need cars to go to work and can qualify to buy cars because they have jobs and paychecks. Inventory levels at car dealers remain so remarkably low that even if there is a consumer slowdown at the end user level, there will still be a lag as there is a buffer until a slowdown in the production of cars, SUVs, and trucks eventually falls. The current average age of light vehicles on the road of over 12 years is the highest on record.\n\nAlso, for those of you that have rented a car in the past year, there is clear evidence that fleet inventories need to be replenished as well, a meaningful with 20% of the light vehicle market with a healthy backlog. Our October fixed contract renewals were another success, and the weighted average of the price increase we achieved would represent the second-best October renewal cycle in our legacy company's history, only behind last year. As we come to the table for our renewal cycle in January, our customers are being reminded that what we offer them cannot be compared to a CRU spot price. The difference between what makes up a CRU price and how we do business in automotive is night and day.\n\nWe manage our production schedules based on the auto OEMs' needs. We have to reserve our available capacity to align with their production forecast, and we hold their inventory if they have production issues which, by the way, happens a lot. We have a fully dedicated customer service group that manages this complicated just-in-time inventory system to the point that our customers don't even have to think about steel. It's there when they need automatic.\n\nAs a result before, we even consider the constant technical support, research and development, and, of course, quality of materials that we provide them. In sum, in the United States, automotive steel means Cliffs. Now that they have microchips, we want each one of our automotive clients to be successful in 2023. They have a unique opportunity in 2023 as automotive may be the only sector with pent-up demand to take care of.\n\nThe last thing they need now is not having access to all the specs of steel they need to produce cars. That can be a lot more devastating than not having microchips. On the distributor and service center portion of the business, customers have been following the typical herd mentality and buying hand to mouth in recent months. The strengthening of the dollar has not helped the price either.\n\nBut the economics of overseas imports no longer make sense, supporting demand from domestic suppliers as we close out the year. Our August price increase announcement brought some buyers off the sidelines and we secured additional Q4 orders as a result. As long as underlying demand stays this way in the coming quarters, a restock will need to happen. Our green-oriented and non-oriented electrical steels continue to see very strong demand, and we anticipate record price increase in the fixed price for those products.\n\nWe have an infrastructure bill that should finally start to drive steel demand in the next year. We expect automotive taking up more steel share and we have manufacturing being reassured. When this thing turns around, it will turn around sharply. With an ongoing war, multi-decade highs in inflation, rapidly rising interest rates and our focus on mitigating climate change, we are living in a difficult time in a world in transition.\n\nBut we have already proven that Cleveland-Cliffs is capable of overcoming difficulties. The key to that is having the right people. People is the foundation of ESG. You cannot pretend to care about the environment if you neglect your people.\n\nAnd Cleveland-Cliffs will never do that. Several companies, the vast majority actually, fight their ESG challenge with MOUs, letters of intent, and press release, while Cleveland-Cliffs and very few others take concrete action. We built a direct reduction plant before it was trending. We adopt HBI using blast furnaces.\n\nAnd we will remain on the cutting edge. Next for us will be the use of hydrogen. First, in our direct reduction plant and then in our blast furnaces. Blast furnaces have always been on the forefront of technological innovation in iron making and steelmaking and our current utilization of HBI as part of the burner in our blast furnace is further the confirmation of that.\n\nThe future use of hydrogen and carbon capture will be the next examples of American blast furnaces in the vanguard of CO2 emission reduction. Other companies in the United States and abroad are building new plants. In new plants and CO2 emissions regardless of the process utilized. Cleveland-Cliffs is not adding capacity, and we will not add capacity.\n\nWe are reducing emissions within our existing installed capacity, and that's the ultimate goal. After we completed two years ago a transformational, once in a generation consolidation of the American steel industry, some outsiders were fixated on the resulting pension OPEB liabilities. Fast forward, in less than two years, those liabilities have been made irrelevant. With our major repair and maintenance impacts behind us, no ongoing or planned new construction projects and improving automotive sector, and, most importantly, labor peace throughout our organization, we are ready to continue to execute like we have been doing for eight years.\n\nWith that, I will turn it over to Maria for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Lucas Pipes with B. Riley Securities. Please go ahead.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nHey. Good morning, everyone. Congratulations on the OPEB obligation reduction. Lourenco, I remember during COVID, you used common sense incentives to drive vaccination participation.\n\nAnd I imagine maybe you used similar common sense approaches to drive this, this really significant reduction in healthcare premiums. Now I would appreciate it if you could comment on some of the factors that drove that. Thank you very much.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nThanks, Lucas. Look, this is a negotiation that is extremely complex. It's not just the scale you go and you pose because that actually fixed cooperation with the unions in order to get accomplished. The vast majority, it was done, which we consider partners and we consider that we are better because we have them with us.\n\nBut the machines, all the unions now a company, and that gives us the ability to include the non-union personnel as well. So we present a very unified front when we negotiate with these healthcare monsters. So I think it's first in a lifetime that a company of our size was able to accomplish what we got. It's a cost per person that was cut in half.\n\nAnd I'm not talking about the steel company, I'm talking about companies in general. This is a unique thing, this is called management. And of course, I know that everybody is looking to the quarter results, and I'm looking, too, and I don't like it, but costs are necessary and prices are what we fight with the ones we have and we accomplish the best we can get. And eventually, we're going to have a quarter like Q3 that was not fantastic in terms of profitability.\n\nBut if you take one step back and see what we have accomplished, not just having the contract done with the union, but using the fact that we have a real ratification to accomplish a much bigger picture type of thing that will kind of change the landscape in terms of how healthcare is taking care at this point at Cliffs, maybe later and a broader steel industry and maybe later broader into the United States, I think that's how investor, really investors, should look into this thing.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nThat's very, very good to hear. Lourenco, switching topic and you touched on pricing. Three months ago, you were able to comment on the October contract resets with the auto customers. For January, do you have an indication at this point what direction pricing might take on the fixed portion? Thank you very much for your perspective.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nThanks, Lucas, for the question. But as you know, October, the result of our October negotiation are not reflected into the numbers just yet because we are reporting Q3. Of course, we know that. But what we are going to have going forward is a much better number coming from our October tranche that we negotiated and the accomplishment is good.\n\nOf course, I'm not going to give any numbers, but we are in good shape. Remember, we're the only ones only one supplying exposed parts, for example. We know that, they know that. We compete very little with the ones that can produce the more plain vanilla type of grades.\n\nBut we also keep reminding the car manufacturer that the car is a complicated puzzle, and we are the only ones that have all the pieces of the puzzle. So that gives us leverage in the negotiation, can't stress that enough. In the past, we had Bethlehem, LTV, AK, Armco, England, [Inaudible], they are all Cleveland-Cliffs now. So car manufactures know that.\n\nAnd that's a very important part of our negotiation. I think I have given enough color to you to see the picture.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nLourenco, I appreciate the color very much. I'll turn it over for now but continue. Best of luck. Thank you.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nThanks.\n\nOperator\n\nOur next question comes from Emily Chieng with Goldman Sachs. Please proceed with your question.\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nGood morning, Lorenzo and Celso. Thank you for taking my questions. My first one is just around -- hi. My first question is just around costs.\n\nAnd understandably, you're looking at $80 a ton lower costs into the fourth quarter. But perhaps could you share maybe what you're seeing the moving pieces to be that would drive 2023 costs below that mark as well?\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nYeah. I'll let Celso answer this one. Celso, please go ahead.\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nYeah. Sure, Emily. As we stated on our prepared remarks, there was a lot of repair and maintenance that we had to do here in 2022. And as we look to next year, a lot of those repairs and maintenance costs are going to come down significantly.\n\nYou can expect them to be down in the area of $400 million for next year. We'll have a lot lower idle costs next year relative to this year. We don't have any major outages like we did this year. So there's a lot of tailwinds that are going to start dropping our costs here rapidly.\n\nAnd as we increase our volumes, this year, we've been kind of at that 3.6 million ton level every quarter, and we're really pushing to get up to 3.8 million, 4 million tons again, and that's going to further dilute our fixed costs going forward as well. And then you have other things like energy cost, natural gas has come down a lot and things like that, that are also going to be a tailwind next year.\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nGreat. Thanks, Celso. And just a follow-up. Can you remind us on your gas and coal costs.\n\nOn the gas side, you're still hedging 50% of that and the remaining 50% is spot. And with the coal piece of it, how should we think about the upcoming contract renegotiations there? Thank you.\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nYeah. On natural gas, you're correct, we're hedged 50% through the end of next year at this point. And if you look at the futures curve for gas, it's around $5 per mbtu, compared to almost $7 that we're realizing here this year. So those costs are coming down.\n\nAnd then on the met coal side, you can probably model coal cost to be up, call it, 5% to 7% next year. So it's still not meaningful.\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question is from Tristan Gresser with BNP Paribas. Please proceed with your question.\n\nTristan Gresser -- Exane BNP Paribas -- Analyst\n\nYeah. Hi. Thank you for taking my question. The first one is on the plate market.\n\nCan you discuss a bit the market dynamics there? The premium elevated compared to HRC, but also the sustainability of that. And moving forward with Nucor, a competitor wrapping up capacity, how do you prepare for the arrival of increased competition in the market? And how strategic plate shipments are in Cliff? Thank you.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nTristan, the sustainability in pricing of the plate market is just about fewer participants and all of them responsible. In the light flat rolled, we have at least one in the United States that is totally responsible and two in Canada that are completely irresponsible. So irresponsible players destroy the market. The market destruction affects everybody.\n\nAnd in situations like that, management matters. So don't believe that we are here in the receiving end of this bad behavior from -- compared that we know well. And we are not going to do the same thing and retaliate and create issues for them. And the plate market don't have that because everybody is in the market to make money, everybody is in the market to do their best for their companies and for their shareholders.\n\nThat's why we have a much better market in plate than in light plate roll. As far as new capacity, the new capacity that's come is overdue. Plate has been a playground for imports for a long, long time, and I'm happy that Nucor put the capital to deploy capacity where capacity is needed and pushing ports out, that's a good mentality. One sector that will be good for us, Cleveland-Cliffs, as far as plate going forward, is military.\n\nThis is not just U.S. military. Of course, U.S. military goes without saying.\n\nBut we are receiving orders from lots of countries that are friends of the United States. They are all stepping up their expenditures on plate-related business. And we are the Coatesville, mainly out of Coatesville, but also Weirton that can produce quality military level plate. That has -- we'll be one of the superstars of 2023.\n\nI hope I gave you the picture you're asking for.\n\nTristan Gresser -- Exane BNP Paribas -- Analyst\n\nYes. That's very interesting. Thank you. My second question is a bit more on something you touched on in your remarks and about decarbonization in general.\n\nWe're starting to see steelmakers in Europe getting large sums of money to decarbonize and build DRI capacity and electric arc furnace capacity as well. How do you view that in a global perspective as those steelmakers can be competitors sometimes? Is that a signal for you to go to U.S. government and also do the same? Or do you believe that there may be room for more aggressive maybe trade actions regarding Europe?\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nYeah. Decarbonizatoin in the United States is not at least so far, has not been done through subsidies. It has been done through action and a couple of responsible companies that are doing very serious things. As you may know, we built an HBI plant and we use our in our blast furnaces.\n\nAnd because we use our HBI in our blast furnace, our coke rate is 50% of the coke rate Europe. So 50% coke rate less coke usage means 50% less CO2 from Coke. It's one to one in the psychometric relation. So we are really decarbonizing in the United States.\n\nIn Europe, there's a lot of talk about decarbonization. But I think that the problem in Europe right now is currency, heating homes, find a way around the lack of gas from Russia. I think Europe right now has a lot more important fish to fry. Decarbonization will be left for the oil that can do it.\n\nAt United States, we are doing and we'll continue to do our own way.\n\nTristan Gresser -- Exane BNP Paribas -- Analyst\n\nAll right. Thank you.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nNo question about pension OPEB? Your institute -- financial institution out of Europe is the most concerned about pension OPEB not enough and you don't even ask me a question?\n\nTristan Gresser -- Exane BNP Paribas -- Analyst\n\nWell, it's pretty clear. So we take note and of course we just -- thank you.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nGood. All right.\n\nOperator\n\nOur next question is from Curt Woodworth with Credit Suisse. Please proceed with your question.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nThank you. Good morning. So I just wanted to follow up with respect to the cost guidance for next year, around the $400 million. Because I think this year, you outlined $200 million of reline cost.\n\nI think there was other kind of inventory absorption issues and high-cost inventory. In fact, in the P&L, I believe of another $100 million to $150 million. So is the apples-to-apples kind of comparison for next year, would that be more like $100 million down? I just want to make sure I'm understanding kind of the cadence of costs relative to this year.\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nYes. So let me add some more color there, Curt. Thanks for the question. So as we tried to explain in the prepared remarks, costs that we're seeing here in Q3 were largely a function of elevated spend from Q2.\n\nI think everyone kind of understands that, right? You could see in our cash flow statement that inventory was a $250 million inflow at this time, and it was a $250 million outflow last time. But almost everything that drove costs up this year is coming down. Like I said, not only the kind of inflationary pressures that we're seeing on input costs, but also repairs and maintenance, as I stated, are expected to be lower by $400 million next year. So everything that has driven costs up this year is starting to materially come off a cliff.\n\nSo we're going to see the benefit of that in the quarters to come. I don't know if I specifically answered your question, but happy to add more color if needed.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nOK. So MRO, apples to apples, will be down 400. And then should we assume then because of -- I don't think you have a major reline next year that, that would give you another $200 million to $300 million. So kind of the total cost down potential of $700 million for next year.\n\nIs that correct?\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nThat's correct. Yep.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nOK. And then just a follow-up on trade policy in the United States. There's still Russian pig iron coming into the country. And just kind of curious just in general, what communications you've been having with maybe the Department of Commerce? And just kind of any updates on how you see trade policy in the U.S.\n\nThank you.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nYeah. Look, Curt, Lourenco here. We communicate with them. But this pig iron that comes into the country directly or indirectly through rerouting and transshipment, it doesn't happen in a -- it happened because there was that import pig iron imported pig iron and they know what they are doing.\n\nSo we are not cops. We can inform and we inform, but that's pretty much it. And if a company imports pig iron from Russia, don't play the nice guy. You are supporting a dictator.\n\nYou are supporting a butcher that 50 years from now will be put at the same level as Hitler. So that companies Germany that still as of today pay the price for supporting the Nazi regime. And the ones that import pig iron are setting themselves up for future scrutiny. It might look good for the quarter, it might not look good in five to 10 or 20 years.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nOur next question is from Alex Hacking with Citi. Please proceed with your question.\n\nAlex Hacking -- Citi -- Analyst\n\nYeah. Thanks. Good morning, Lourenco and Celso. So on the automotive side.\n\nIf I look at the U.S. auto, it seems like it's been running maybe 20% below where it should, 13 million versus 16 million to 17 million. Is that how we should think about the impacts on your volume? Because if I sort of run it through your auto volumes, it would seem like you've been shipping 300,000 to 350,000 tons below what you would normally expect to, and so that would be the amount of volume that we could potentially see recover every quarter as the automotive market recovers. Is my math there kind of correct?\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nYeah. You are directly correct, yes. We are still in the 13 to 14 -- less than 14. We did the 13s in automotive.\n\nAnd it was kind of expected by now that this level would be a lot closer to what was the normalized level between 14 and 19 and would like that. So we are still running behind. They are still running behind. This being said, it's encouraging to see a quarter that was concrete.\n\nWe have a concrete number to say, look, we're 100,000 tons. It's not anything to throw a party of but is encouraging. It's a step in the right direction. Car prices are increasing to the end user.\n\nSo the car manufacturers are making money. So the biggest supplier is still to the care manufacturers is making money as well on that -- on those sales and plans to continue to make money on those sales. We might have too many car manufacturers in the United States. That's another thing that we need to think about.\n\nWe are taking that into consideration in our strategy now.\n\nAlex Hacking -- Citi -- Analyst\n\nOK. Thank you. And then Celso, I think you mentioned in your remarks that you would not be paying cash taxes for the rest of the year. Would you expect to pay full cash taxes in 2023? Thank you.\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean that's right. In Q4, cash taxes are going to be minimal. And then for 2023, obviously, it's going to depend on profitability.\n\nBut depending on how things play out, we could even have a big tax refund coming. So that could be a source of cash early in '23 as well.\n\nAlex Hacking -- Citi -- Analyst\n\nAnd what would be the driver of the tax refund? I apologize for asking more.\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean we've made some overpayments here this year. So some of that would be reversed back and we'd get some cash inflow from that.\n\nAlex Hacking -- Citi -- Analyst\n\nGot it. Thank you very much.\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nNo problem.\n\nOperator\n\nOur next question comes from Carlos De Alba with Morgan Stanley. Please proceed with your question.\n\nCarlos de Alba -- Morgan Stanley -- Analyst\n\nYeah. Thank you very much. Good morning. So regarding prices, I know that you don't want to give us a number, and it's understandable.\n\nBut maybe just talking about the outlook for January reset of your contracts, if I'm not mistaken that is a bigger chunk of renegotiation for you guys. So how is that progressing given the trend that we have seen in the spot market down but the recovery in auto sector volumes that should potentially offset that, maybe more than offset that. So any color for the January resettle of contract, that will be great.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nYeah. Look, the trend will be the same. We are just starting actually. So there's not a lot of details available on the automotive contract renegotiation on specifics like we have for October.\n\nBut you're right, Carlos, it's the vast majority. But the threat has been put in place. Our conversations with the January crowd should be even more facilitated by, one, the fact that these clients that we deal with in January tend to be a little more reasonable. And second, because they are seeing what we are doing with others because -- it's funny, all these prices are extremely confidential.\n\nBut they know a lot more than we release because we respect our [Inaudible]. So at this point, they know that we are not bluffing. They know that we're real. At the beginning, it was kind of, who's this new Cleveland-Cliffs thinking, this Lourenco guy? Now they know.\n\nSo it's -- I believe it to be easy.\n\nCarlos de Alba -- Morgan Stanley -- Analyst\n\nAll right. And in terms of volumes, just to clarify, so it's clear that production in the fourth quarter is going to improve. Shipments in the -- to the auto market -- like sales volumes to the automotive sector will also increase. But just to double check, the overall volumes, shipment sales volumes in the fourth quarter, do you also expect them to move higher?\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nYeah, we are. Look, we no longer have repair, big repairs in place. So we are expecting to recover our usual 4 million tons of shipments a quarter, 3.9 to 4 million tons a quarter. It all depends on how much slabs we are going to add to the mix.\n\nAnd so that's why 3.9 to 4 million tons. But actually, more slabs, even though they help dilute the fixed costs, they are not exactly our best money maker, if you will, because it's lower value added than decarbonized for exposed part or ultra-loom or anything like that. There's a play between the mix and the volume. The higher volume helps cost, but eventually, the higher volume comes from products that have a lower margin impact.\n\nCarlos de Alba -- Morgan Stanley -- Analyst\n\nRight. No, that's clear. OK. And then if I may, just one final question.\n\nWith the cost coming down, capex in the $700 million to $800 million range next year, even contemplating lower steel prices, it seems that your free cash flow generation is going to be quite interesting, quite good. Any changes on the capital allocation front? Or you continue to prioritize debt reduction and maybe some share buybacks and not dividends yet?\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nLook, the priority continues to be paying down debt. We continue to do that quarter after quarter after quarter. And even though the underlying EBITDA was lower, cash flow was not. Because remember the priority.\n\nThe priority is not to impress the street. The priority is not to add a number of subscribers like this [Inaudible]. Our product is to pay down debt. So we're going to generate cash.\n\nSo we did not renegotiate with our healthcare contracts because we would like to be nice, because we'd like to reduce costs, to generate cash to pay down debt. So we are doing exactly what we told you guys that we will be doing. And the investors that understand that will stay with us. Actually, they will take the opportunity of the shares on sales to buy more.\n\nIf we are going to be able to buy more, we have the authorization. But what's my priority, Carlos? My priority is to pay down debt. Not to pay a dividend. To pay down debt.\n\nWhen we get to a point of say yes, that's good, that's the level that I feel like is sustainable going forward, there is no inflation, the Fed is no longer crazy, they are not trying to destroy the economy, they are not trying to generate unemployment, because that's what they're doing, and we are in a much more stable world, then we can do whatever we need to do to continue to grow toward returning capital to the shareholders. But don't neglect the fact that we bought a lot of stock so far. We did, and that's returning money to the shareholders.\n\nCarlos de Alba -- Morgan Stanley -- Analyst\n\nAll right. Thank you very much, Lourenco.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nThanks, Carlos.\n\nOperator\n\nOur next question is from Timna Tanners with Wolfe Research. Please proceed with your question.\n\nTimna Tanners -- Wolfe Research -- Analyst\n\nYeah. Hey. Good morning. I really like Lourenco's point about all new mills add carbon emissions.\n\nThat's fun. I wanted to just ask a follow-up on the volume side, if I could. Looking ahead, we've seen a mix of philosophies out there. Some mills are adding capacity and running it.\n\nSome are cutting capacity and shedding. Cliffs obviously benefits, as you point out, from running more volumes. And you have Cleveland back running, you have automotive improving, but yet your steel production is still below year-ago levels. And I'm just wondering, how do we think into next year on the mix of your potential volume and how that can help continue to cut your average cost? Thanks.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nThanks for the question. Look, we will continue to export, maximize the utilization of the assets that we have. And we are not going to take equipment down just to implement discipline in the market if others are completely undisciplined. If the others feel like the business model is predicated on destroying the marketplace, just because they feel that they can put the scrap price whatever they want.\n\nThey might be right, but we just don't agree with that type of approach. But we run our assets to minimize our costs. As long as we can make money, we will run. And I think that it's a good balance because we can generate cash that way.\n\nSo don't count on me to take my capacity out to make the life of others better. That happened in Q2 and the portion of Q3 because we had to make a big repair at Cleveland Works. When Cleveland Works was done, we came back. But also, remember, Cleveland Works, I don't know if you know that, but it's the biggest producer of advanced high-strength use for automotive, no exposed users.\n\nSo the one reason that we fixed that thing is because we have a lot of confidence that automotive will pick up and the orders that come to Cleveland Works will start to pile up. And actually, we are seeing that as we speak. Others cannot do that. That's why our capacity can come back, can come back because it's serving markets that I believe in 2023 might be the only ones that will be exciting, automotive being the biggest one.\n\nTimna Tanners -- Wolfe Research -- Analyst\n\nGot it. So is it reasonable to assume that continued progress in automotive recovery can result in Cliffs producing over 4 million tons again per quarter? And can that mix still be kind of sway to automotive? Or is it going to be also shipping into some of those other businesses? Because I think we've seen a bit of mix deterioration into the fourth quarter. Just how do you see that going forward?\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nYeah. Let me -- I think I already explained this mix deterioration. Automotive is the reason why we are back to $4 million a quarter. And it will be that going forward.\n\nSo that's automotive. Automotive is supporting this growth. Celso --\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nNo. I'll just correct it, you said $4 million. It's 4 million tons.\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nSorry. Yeah. The old man. Old man --\n\nTimna Tanners -- Wolfe Research -- Analyst\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCelso Goncalves -- Executive Vice President and Chief Financial Officer\n\nLourenco Goncalves -- Chairman, President, and Chief Executive Officer\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nEmily Chieng -- Goldman Sachs -- Analyst\n\nTristan Gresser -- Exane BNP Paribas -- Analyst\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nAlex Hacking -- Citi -- Analyst\n\nCarlos de Alba -- Morgan Stanley -- Analyst\n\nTimna Tanners -- Wolfe Research -- Analyst\n\nMore CLF analysis\n\nAll earnings call transcripts"
}