{
  "companyName": "Aurora Mobile Ltd",
  "companyTicker": "JG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/15/aurora-mobile-ltd-jg-q2-2022-earnings-call-transcr/",
  "content": "Aurora Mobile Ltd (JG -14.60%)\nQ2 2022 Earnings Call\nSep 15, 2022, 7:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to Aurora Mobile's second quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your host today, Rene Vanguestaine. Thank you.\n\nPlease go ahead, sir.\n\nRene Vanguestaine -- Investor Relations\n\nThank you, Amber. Hello, everyone, and thank you for joining us today. Aurora's earnings release was distributed earlier today and is available on the IR website at ir.jiguang.cn. On the call today are Mr.\n\nWeidong Luo, chairman and chief executive officer; Mr. Shan-Nen Bong, chief financial officer and Mr. Guan Yang Chen, general manager. Following their prepared remarks, they will be available to answer your questions during the Q&A session that follows.\n\nBefore we begin, I'd like to remind you that this conference call contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended and as defined in the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements are based upon management's current expectations and current market and operating conditions, which are difficult to predict and may cause the company's actual results, performance, or achievements to differ materially from those in the forward-looking statements. Further information regarding these and other risks, uncertainties, and/or factors are included in the company's filings with the U.S.\n\nSecurities and Exchange Commission. The company does not undertake any obligation to update any forward-looking statement as a result of new information, future events or otherwise, except as required under applicable law. With that, I'd now like to turn the conference over to Mr. Luo.\n\nPlease go ahead.\n\nWeidong Luo -- Chairman and Chief Executive Officer\n\nThanks, Rene. Good morning and good evening to everyone on the call. Welcome to Aurora Mobile's 2022 second quarter earnings call. Before I comment on our Q2 results, I would like to remind everyone that the quarterly earnings deck is available on our IR website.\n\nYou may refer to the deck as we proceed with the call today. Our Q2 results were largely conditioned by the turbulence from the impact of the widespread resurgence of COVID-19. Several of our businesses were adversely affected as numerous cities were shut down between April and June. Despite the overall economic slowdown and the resurgence of COVID-19, we have seen some recovery in our business starting in July.\n\nAs we mentioned on our Q1 earnings call, we have taken necessary steps and initiatives to proactively address obstacles and strengthened our management and operational capabilities to navigate through these tough times. Continuing the effort started in the first quarter, we have shaved off more operating expenses this quarter in two main areas. Firstly, we further reduced salary cost as we streamlined our workforce. This is important as salary cost is one of our biggest cost components.\n\nAnd we need to make sure we are operating at an optimal level with the greatest efficiency. Secondly, we closely and thoroughly looked at every single expense from external technical support to technical fee. We have made conscious efforts to search for better deals or replaced new vendors in order to reduce the expense level where possible. At this juncture, I would like to take a moment to thank everyone in our company for their contribution in these important cost-cutting initiatives.\n\nAll these efforts have been positively reflected in the Q2 financial performance. Here are the highlights of our important achievements. Lowest operating expenses for the past 14 quarters since Q1 of 2019, at RMB 87.7 million, down 17% year over year. Lowest net loss since Q3 of 2019, at RMB 24.4 million, narrowed down 17% year over year.\n\nAdjusted EBITDA at negative RMB 8 million, significantly improved by 40% year over year, highest level of net cash inflow from operating activities since Q4 of 2020. Total customer number up 79% year over year to 4,709. AR days remained at a healthy level of around 46 days despite the tough business environment. Total deferred revenue was about RMB 100 million for the 9 consecutive quarters.\n\nLet me continue with the different revenue streams within the group. Development services revenue was down 10% year over year to RMB 55.2 million, which was mainly due to the decrease from value-added services, while our subscription service recorded a stable 2% year-over-year growth. Subscription Service revenue of RMB 38.3 million, up 2% year over year. Our Subscription Services, which include JPUSH, Analytics, UMS, and others, are products and services that help APP developers and enterprises to improve their operational efficiency.\n\nDemand for our Subscription Services is relatively strong and less impacted by the general sentiment of the macroeconomy. Despite a very tough operating environment during the quarter, we managed to grow our customer base and signed up several well-known and sizable customers, including China and Mobile Bank, Haier Qingdao, Tiger broker, and China Merchant Security just to name a few. One key milestone in Subscription Services that I would like to share with you is our overseas business expansion. In Q2, our overseas email deliveries surpassed those in Mainland China.\n\nThis is a great testament to the quality of our products and services, along with our ability to expand our businesses beyond our shores. We do see overseas expansion as one of our next key growth drivers, with obviously our core products from PUSH notification to emails. I believe we are ready and will seize oversee growth opportunities in the near future. Value-added Services revenue decreased by 28% to RMB 16.9 million, which is in line with what we expected last quarter as the overall ad market has been relatively weak this quarter.\n\nDirect customers contributed more than 60% of JG Alliance revenue stream, while the rest came from the third-party advertising agency. Major customers of JG Alliance consisted of repeated customers and market leaders across many industry verticals. Key customers included BAT, JD, and vip.com. With all the changes and uncertainty surrounding us, we are not deteriorated on our ways sitting on our lower.\n\nWe are more committed than ever to further emphasize and entering our product and technology as we believe a strong and solid foundation can benefit the company in the long term. Next, I would like to update you on our products and particular innovations. Since the launch of our AD Mediation Platform in the beginning of June, over 2 million DAUs and more than 20 APPs have joined our platform, with more than 150 APPs in the pipeline. We see great potential in our APP AD Mediation Platform and as we shared with you on the last call oversee priorities such as [Inaudible] with the similar and proven business models have in this paired by acting deliveries to grow and monetize.\n\nOur AD Mediation Platform enables one-stop SDK-based access to mainstream ad platforms such as [Inaudible], Tencent Youlianghui, and Kuaishou, and at the same time it can also quickly access more than 70 other high-return demand-side platforms. As a service provider with extensive experience in the market in the net industry, we can finish and we believe we are in great position to have more growth app developers complete the close look of demand, development, operation, and monetization and achieve sustainable business status. To enable our customers going global to access more overseas messaging channels, in August we signed a cooperation agreement with WhatsApp, the world's leading private messaging giant. This global cooperating represents a -- in advancing our overseas business and emerging our business acquisition.\n\nUnder this collaboration, WhatsApp is now embedded as one of the channels within our Overseas Messaging Cloud Solution which was created to empower Chinese enterprises to expand in overseas markets with omnichannel intelligent messaging services. I am also very excited to share some updates from our core product, JPUSH. We have recently released our new customer management feature for VIP PUSH customers, users of our service now can easily select target users and send promotional and customized push messages to their end users without having to go through the software coding process. According to various research reports, click rate will largely improve when sending the dynamic and customized campaign push messages to end users rather than just sending this to-end generic broadcasting message to everyone.\n\nThis new feature is another meaningful add-on to our comprehensive strategy along with our smart PUSH function, which helps the developer for the PUSH analytics. As you see, we were very productive this quarter and made the necessary product improvements and innovations despite the tough business conditions. We believe that only when we have superior products that markets demand can we continue to strive and come back even stronger after the current slowdown. I am confident that we are fully equipped and ready for the tides to turn.\n\nWith that, I will now pass the call over to Shan-Nen, who will share more update vertical applications and other parts of the Q2 highlights.\n\nShan-Nen Bong -- Chief Financial Officer\n\nThanks, Chris. And now let's move on to vertical application that consists mainly of financial risk management and market intelligence. Vertical Application revenue decreased by 25% year over year, mainly due to the impact of COVID-19, which resulted in a dip in the demand and logistic obstacle in contract signing. In the financial risk management segment, revenue decreased by 22% year over year to RMB 12 million, mainly due to: one, the slowdown in economy, which resulted in lower demand for our services; two, delays in contract signing and several major cities were locked down.\n\nRecently not able to nail or deliver contracts to customers for their execution. Nevertheless, some existing key account customer in the financial verticals such as [Inaudible] and WeBank continued their consumption of our services during the quarter. As an update in early Q3 of this year, we have signed up many other new customers, including, but not limited to [Inaudible]. Our Market Intelligence Services revenue decreased by 9% to RMB 7.3 million and we saw a similar trend in Market Intelligence services as well.\n\nDespite the slowdown in Q2, our teams still managed to sign many well-known customers, including Fuhu, Mihayu and we do course. So far in Q3, we have brought on board many key customers such as Morningstar, [Inaudible]. I will now go to some of the key expenses and balance sheet items. On to operating expenses; as Chris mentioned earlier on, we have yielded some of the best results since Q1 of 2021 when we completed our transition to pure search model as a result of our effective cost control initiatives.\n\nOperating expenses decreased by an impressive 17% year over year to RMB 87.7 million and that is the lowest opex since Q1 of 2019. All three components within the opex category have recorded year-over-year reductions. In particular, R&D expenses decreased 25% to RMB 40.8 million, mainly due to lower headcount and reduced salary costs, and associated share-based compensation. Selling and marketing expenses decreased 14% to RMB 23.3 million, mainly due to the decrease in marketing expenses this quarter.\n\nG&A expenses decreased 1% to RMB 23.6 million, mainly due to lower salary costs. Our adjusted EBITDA improved 40% year over year and 2% quarter over quarter, respectively, to negative RMB 8 million. Although this was another very challenging quarter, our decision and companywide effort to tightly control and reduce expenses has clearly paid off. This positive impact has been reflected in the financial statement and I would like to share with you the following.\n\nWe have recorded the lowest opex in the past 14 quarters since Q1 of 2019; lowest net loss since Q3 of 2019 at negative RMB 23.4 million. Adjusted EBITDA at negative RMB 8 million improved by 14% year over year. We have the highest level of net cash flow, cash inflow from operating activities since Q4 of 2020. And we have the lowest adjusting operating expenses, which represent the cash component of opex since Q1 of 2021.\n\nNow on to balance sheet; I'll share two very important KPIs that we closely monitor. Firstly, the AR turnover days has maintained stable at 46 days this quarter, compared to 46 days last quarter. Our disciplined accounting policy and cash collection effort ensure a timely collection of our ARs. Secondly, the total deferred revenue balance, which represents cash collected in advance from customers exceeded RMB 100 million at quarter end for the 9th consecutive quarter.\n\nAs of June 30, 2022, the total deferred revenue was at historical high of RMB 137.7 million. Next, total assets were at RMB 481.7 million as of June 30, 2022. This includes cash and cash equivalent of RMB 112 million, accounts receivable of RMB 35.1 million, prepayments and other current assets of RMB 34.2 million, fixed assets of RMB 49 million, long-term investment of RMB 140 million, goodwill of RMB 37.8 million, intangible assets of RMB 26 million. Total current liabilities were RMB 227 million.\n\nAccounts payable at RMB 19.2 million, deferred revenue at RMB 129.7 million, accrued liabilities of RMB 78.2 million, and we repaid the short-term loan of RMB 150 million in April. Next on to business outlook. Although we are still facing uncertainty from the pandemic, going into Q3, we are seeing some exciting growth from our business lines and our cost management initiative continue to produce positive results that I want to share with you. Based on the current information, we anticipate the developer service subscription service revenue of Q3 2022 to achieve close to double-digit growth both quarter over quarter and year over year.\n\nFor vertical application revenue, we are also expecting solid quarter-over-quarter growth. For value-added services, which we have mentioned earlier, the overall market will take time to stabilize before revenue can return to historical level. And with the anticipated growth in revenue and conscious cost spending, borrowing any unforeseen events, we are looking to achieve a breakeven adjusted EBITDA balance for Q4 of 2022. And please note that the growth outlook is based on the current market condition and reflects the company's current and preliminary estimate of the market and operating conditions and customer demand, which are all subject to change.\n\nAnd lastly, before I conclude, I'll give a quick update on the share repurchase plan. In the quarter ended June 30th, 2022, we did not repurchase any shares. And as of June 30th, 2022, cumulatively, we have repurchased a total of 921,000 ADS since the start of our program. And this concludes the management's prepared remarks and we're happy to take the question now.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Brian Kinstlinger from Alliance Global Partners. Please ask a question, Brian.\n\nBrian Kinstlinger -- Alliance Global Partners -- Analyst\n\nGreat. Thanks for taking my question. First, can you talk about on the subscription side with the lockdowns, have you been able to deliver and get renewals for agreement signed? I see you've increased sequentially subscription revenue, but still below the fourth quarter. So I'm curious an update on that? And maybe talk about churn and how that's changed given the market conditions.\n\nShan-Nen Bong -- Chief Financial Officer\n\nYeah, Brian. This is Shan-Nen. If you compare to Q4, yes, we did have a few of the private cloud projects that we completed. So in comparison, the Q2 numbers was a bit low.\n\nBut having said that, the lockdown has lesser impact on subscription business because majority of them are renewal and renewal contracts might not have the impact resulted from the logistical obstacles that we talked about earlier on that we are not able to deliver the contracts. So for a subscription business, we think we are on the right track. And based on the numbers, it did show it that way. So we are fairly comfortable with the subscription business at this stage.\n\nBrian Kinstlinger -- Alliance Global Partners -- Analyst\n\nSo you're still unable to deliver them. Is that what you're saying? I know you said that last quarter or you are able to deliver those agreements?\n\nShan-Nen Bong -- Chief Financial Officer\n\nYeah. Yes, we are for subscription business. That's why the revenue has shown up year-over-year and quarter-over-quarter growth.\n\nBrian Kinstlinger -- Alliance Global Partners -- Analyst\n\nOK. And then I guess what I'm a little bit confused on is that the market conditions are still challenged from an economic standpoint. And we hear from a COVID standpoint, a little bit too in China, obviously. So talk about what the drivers to growth are? You mentioned a couple of double-digit growth sequentially.\n\nHow have you been able to do that and talk about from a demand perspective, given those conditions, how it's changed?\n\nWeidong Luo -- Chairman and Chief Executive Officer\n\nYeah. I think you can -- there are two ways to look at this. If you look at the value-added services or the financial risk managements, those are more closely tied with the overall economy. So if you look at the ad spending, I'm sure you have read like Tencent, you have everybody else in China facing the problem that advertisers are not spending as they used to be.\n\nSo this is very much tied to the economy. On the other hand, if you look at the subs business, they were less impacted by business because of the fact that the economy is slowing down, you are unlikely to spend less on PUSH. So those are less resilient to the impact of the economy. So that's what we are trying to say that we still see good growth coming from the sub business because it's less impacted by the economy.\n\nBrian Kinstlinger -- Alliance Global Partners -- Analyst\n\nGot it. OK. And then, maybe touching on SendCloud, what was its contribution in the quarter, which of your business segments is that reported? And how has that been performing in the current conditions?\n\nShan-Nen Bong -- Chief Financial Officer\n\nIt's reported revenues under subs business, so it's under subscription and is contributing about RMB 5 million to RMB 6 million of quarter and the number is growing. It's growing, I guess, for the fact that we are able to cross-sell some of our customers to buy the business, that's to buy the services. And secondly, as we have mentioned, our overseas email delivery has surpassed China. So there's a huge demand for their services for SendCloud services.\n\nSo they are doing pretty well.\n\nBrian Kinstlinger -- Alliance Global Partners -- Analyst\n\nYes. And lastly, good job with the operating expenses. Is this about the level of expenses we should see going forward? Will we see further declines and maybe some of them were done mid quarter? How should we think about opex going forward?\n\nShan-Nen Bong -- Chief Financial Officer\n\nI think we are pretty much at that level. I do not foresee any spike going forward. If anything, it will be maintained at a level or lower?\n\nBrian Kinstlinger -- Alliance Global Partners -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nRight. Thank you. Our next question comes from the line of Kevin Wang from Speaker Capital. Please ask your question.\n\nKevin.\n\nUnknown speaker\n\nGood evening. Thank you for taking my question. I have one question. I noticed that since last earnings call, the company has taken a number of actions on going global, such as, say, releasing the overseas messaging cloud and established cooperation with WhatsApp.\n\nSo can the management share more on the company's overseas strategy and maybe give us some highlights in the company's overseas business development overall?\n\nShan-Nen Bong -- Chief Financial Officer\n\nSure. Sure. Thanks for your question. And you're right.\n\nWe have been taking steps to expand our overseas business during Q2. And you'll see, if you look at it since the beginning of June, we have released our -- there are couple of things that we are doing right now. In the beginning of June, we have released our overseas messaging cloud solution to serve Chinese enterprise international expansion. And this is one of the growth drivers for majority of the Chinese company these days.\n\nAnd also by integrating our multiple messaging products such as JPUSH, SMS, email, UMS and other messaging products, our overseas messaging cloud solution focuses on the integration ammunition of multiple channels. So therefore, the users, they will be able to use our product more efficiently. And also, our overseas channel solution has already integrated the platform such as WhatsApp that Chris talked about earlier on. And with that, we are looking to even to incorporate the others such as Facebook, Messenger or TikTok going forward.\n\nAnd also with this, we are helping the Chinese Enterprise, who seeks international expansion to build closer and more efficient connection with their users overseas. And this company, this company is taking overseas expansion faced very different market conditions and evolving data compliance, network environment, and several acquisitions. Therefore, I think we are in the right space to help them to expand overseas. And to that, we are able to seize the opportunity to have our overseas growth revenue too.\n\nSo this is my response to your question.\n\nUnknown speaker\n\nOK. Very clear. Thanks.\n\nOperator\n\n[Operator instructions] There are no further questions. I'll now turn the conference back to Rene for closing remarks.\n\nRene Vanguestaine -- Investor Relations\n\nThank you, Amber. Thank you, everyone, for joining our call tonight. If you have any further questions or comments, please don't hesitate to reach out to the IR team. This concludes the call.\n\nHave a good night. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRene Vanguestaine -- Investor Relations\n\nWeidong Luo -- Chairman and Chief Executive Officer\n\nShan-Nen Bong -- Chief Financial Officer\n\nBrian Kinstlinger -- Alliance Global Partners -- Analyst\n\nUnknown speaker\n\nMore JG analysis\n\nAll earnings call transcripts"
}