{
  "companyName": "Veeva Systems",
  "companyTicker": "VEEV",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/31/veeva-systems-veev-q2-2023-earnings-call-transcrip/",
  "content": "Veeva Systems (VEEV -1.10%)\nQ2 2023 Earnings Call\nAug 31, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Veeva Systems fiscal 2023 second quarter results call. All lines have been placed on mute to prevent any background noise. After the speakers' remarks, there will be a question-and-answer session. [Operator instructions] Thank you.\n\nAto Garrett, senior director of investor relations, you may begin your conference.\n\nAto Garrett -- Senior Director of Investor Relations\n\nGood afternoon, and welcome to Veeva's Fiscal 2023 second quarter earnings conference call for the quarter ended July 31, 2022. As a reminder, we've posted prepared remarks on Veeva's investor relations website just after 1:00 p.m. Pacific today. We hope you've had a chance to read them before the call.\n\nToday's call will be used primarily for Q&A. With me today for Q&A are Peter Gassner, our chief executive officer; Paul Shawah, EVP, commercial strategy; and Brent Bowman, our chief financial officer. During the call, we may make forward-looking statements regarding trends, our strategies and the anticipated performance of the business, including guidance regarding future financial results. These forward-looking statements will be based on our current views and expectations and are subject to various risks and uncertainties.\n\nOur actual results may differ materially. Please refer to the risks listed in our earnings release and the risk factors included in our most recent filing on Form 10-Q. Forward-looking statements made during this call are being made as of today, August 31, 2022, based on the facts available to us today. If this call is replayed or viewed after today, the information presented during the call may not contain current or accurate information.\n\nVeeva disclaims any obligation to update or revise any forward-looking statements. We may discuss our guidance on today's call, but we will not provide any further guidance or updates on our performance during the quarter unless we do so in a public forum. On the call, we may also discuss certain non-GAAP metrics that we believe aid in the understanding of our financial results. A reconciliation to comparable GAAP metrics can be found in today's earnings release and in the supplemental investor presentation, both of which are available on our website.\n\nWith that, thank you for joining us, and I will turn the call over to Peter.\n\nPeter Gassner -- Chief Executive Officer\n\nThank you, Ato, and welcome, everyone, to the call. We had a solid Q2 with revenue ahead of our guidance and operating income at our guidance. Total revenue was $534 million, up 17% year over year, and subscription revenue was up 17% to $429 million. Non-GAAP operating income was $202 million or 38%.\n\nWe've revised our full year revenue guidance down by about 1.5% at the top end from $2.175 billion to $2.145 billion due to foreign currency and macroeconomic factors. We executed well in the quarter. Hiring was good. Our innovation engine is working well.\n\nAnd our customer relationships continue to get stronger as we have more solutions to offer and each of our solutions gets better. Our competitive landscape and product strategy also have never been stronger. We continue to track ahead of our goal to cross $3 billion in revenue in 2025 and have planted seeds for a long runway of growth well into the future. We'll now open up the call to your questions.\n\nOperator\n\n[Operator instructions] Your first question comes from Kenneth Wong with Oppenheimer. Your line is open.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nFantastic. Thanks for taking my questions. I've got one for Peter and then a follow-up for Brent. Peter, you mentioned drug pricing legislation in your prepared remarks.\n\nAnd I realize it's a while away but would just love to get your take on maybe where that could impact the industry. Is it more on the commercial side where maybe pricing causes more headcount reductions? Or is it on the clinical side or perhaps the opportunity looks less attractive, and we see less investments in that area? Would love to get your take on that.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. On the drug pricing, first, to put it in perspective, this is specific to the U.S., and that's the big part of life sciences but certainly not the whole part of it. And then it has to do with Medicaid, which is roughly about half of the U.S., and it doesn't have to do with private insurance. And it's about the top X drugs, and it gets implemented in 2026.\n\nSo, it's too early to say how it plays out over the long term. In the short and medium term, it's steady as she goes. There's no changes. And we just have to see how this works out over the long term.\n\nAnd you had a follow-up question for Paul as well?\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nNo, a follow-up for Brent. Brent, when I look at the guidance, I guess I just wanted to get a sense for kind of what -- you mentioned headwinds in the pipeline in June. How did that look exiting July? Did that stabilize? And then when thinking about the guidance, are you assuming that it worsens or kind of stays at the current levels?\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. So, thanks, Ken. So yes, in June, we started to see some of the macro factors at play, and that continued in July at a similar pace. If you take a step back from a revenue guide perspective, we're growing revenue 18% after normalizing for FX.\n\nSo, we're pretty happy about that. If you unpack the reduction, about half of the reduction is related to FX as the dollar continued to strengthen over the last 90 days. The other half relates to the overall macro dynamics. Specifically, it's impacting commercial a bit more.\n\nWe've seen some impact to Crossix as advertising budgets have tightened a bit. And we also saw a little bit of lower add-on users from SMB customers, in the CRM and Vault Commercial. But I want to point out that R&D has not really been impacted by the macro. Most of the R&D products, they're not priced on a per unit basis per user.\n\nThey are priced more on the enterprise agreement. So, really no long-term change in the overall business or the competitive environment. What we've seen in the change in our guidance reflects specific FX impact and macro environment.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nGot it. Perfect. Thank you for the color.\n\nBrent Bowman -- Chief Financial Officer\n\nYep.\n\nOperator\n\nYour next question comes from the line of Brad Sills with Bank of America. Your line is open.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks so much for taking my questions. I wanted to ask about, one, on just some of the activity you saw this quarter and then another one on the macro, please. Maybe just to start, in quality, in particular, it stands out, 52 wins this quarter.\n\nAnd it sounds like R&D is holding strong despite the macro. What would you say the footprint looks like for those initial wins? Are they starting small and this could potentially lead to some bigger upsell deals down the road? Is it kind of quality first wins, if you will, that could potentially lead to bigger add-on deals?\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. I'll take that one. It's really a variety in the quality area across those customers. So big picture.\n\nWhat's happening is we picked a good product strategy a number of years ago to have a suite of quality products all on a common platform. So QualityDocs, QMS, Training, and now we've introduced LIM, Laboratory Information Management, we've announced that. So, we're really the only company that has that integrated suite of products. And then we have a good account coverage as well, and we're just executing.\n\nSo, yeah, it can be a small biotech that the only thing they need from us at the very beginning might be quality or it can be a new customer that's an established customer that just happens to be starting in one of our product areas in quality, and then they're going to add multiple product areas in quality. Or it could be a customer where quality is the first area, and that's going to lead into clinical and regulatory and others. So, I would say it's an even mix across all three, and it goes across segments, enterprise, SMB, pre-commercial, goes over into med tech as well.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nThat's great. Thanks, Peter. And then, Brent, one for you, if I may, please. Just on the guide for billings, 9% growth, it looks like, for Q3, a pretty meaningful deceleration.\n\nCould you just help us unpack currency versus macro in there? And then just within the macro, it sounds like you're not assuming -- or you did, and you haven't seen R&D impacted here as more commercial side. Is that what you're assuming kind of in your guidance going forward? Thank you.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. I don't recognize the 9%. I can talk to the numbers that we have. I believe on a constant currency basis.\n\nYou know, we're guiding closer to 17% for billings in Q3. But what we're seeing is the billings, the reduction in the second half, has really been a factor of two things. One is FX, similar to revenue, as well as the macro. On the billings side, about a third is related to FX, again, to the strengthening dollar.\n\nAnd then the balance is related to predominantly commercial again. So, we talked about the Crossix piece a second ago and lighter in uptick in the number of user add-ons. R&D remains strong. So, we're happy overall with the strength of the business and guiding 18% billings adjusted for FX and billing term changes.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you.\n\nOperator\n\nYour next question comes from Rishi Jaluria with RBC Capital Markets. Your line is open.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for taking my question. First, I wanted to start out by just better understanding kind of some of the puts and takes of the guidance in the back half of the year because if we take guidance at face value right now, be it billings or subscription revenue, the idea of reacceleration in the back half of the year seems to be off the table for now. Is that the right way to think about it longer term? Or is there still kind of a scenario where we can see overall subscription growth reaccelerate above 20%? I'm not asking for guidance for next year.\n\nI know you'll provide that next quarter. But maybe just how we should be thinking about the potential for reacceleration? And then I've got a follow-up.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. So, FX, Rishi, it definitely had an impact. We called out slight acceleration expectation on revenue in the prior guide, and that has been challenged by the FX and the macro. The underlying business remains as strong as we thought 90 days ago.\n\nSo that is unchanged at the competitive environment. It's in our favor, as strong as ever. So, I would think about it that way and also think about the opportunity ahead. We're still early, early days in the broad opportunity across R&D as we are the operating system for dev cloud.\n\nAnd then in commercial, we have a lot of opportunities as well if you think about Data Cloud and Link and the like. So, a lot of growth opportunities in front of us.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nOK. Got it. That's helpful. And then maybe I just wanted to think about, in the prepared remarks, you called out maybe some headwinds on the SMB side.\n\nI guess I'm a little surprised to kind of see that just given how big your customers and how big their spending with you is. Can you maybe help us understand directionally how much of your business is what you would call SMB and how you're defining that just so we can kind of better understand the model going forward, especially in this macro? Thank you.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah, sure, happy to. Maybe good to kind of take a step back. So first off, pharma represents about 90% of Veeva's overall revenue, with the balance being med tech and CP&C. And we think enterprise customers represent roughly 60% of our total pharma revenue.\n\nAnd we define enterprise as the top 50 or so largest pharma companies. So, the balance of that is SMB, which is roughly 40% of the total pharma, and this is made up of a wide range of different customer types. We have small 100-person start-up companies all the way to $1 billion of revenue. So, that's how we're defining it, and pre-commercial is a small percentage of that.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nGot it. That's really helpful. Thank you.\n\nBrent Bowman -- Chief Financial Officer\n\nYou bet.\n\nOperator\n\nYour next question comes from Saket Kalia with Barclays. Your line is open.\n\nSaket Kalia -- Barclays -- Analyst\n\nOK. Great. Hey, guys. Thanks for taking my questions here.\n\nBrent, maybe just to start out with you. Can we just talk a little bit about how the all-in Veeva deals are playing into this guide? In earlier quarters, I know that those were obviously very big and very complicated deals that take a while. Are we assuming longer sales cycles for those or lower sizes? Just curious if you can tie those two things, the all-in Veeva deals and the billings adjustment for the year.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. No, happy to. So, what we've seen is some increased deal scrutiny. And on a deal-by-deal basis, that could impact various sizes of deals.\n\nSo that's playing into our guide for the year. And I think you're referring to a large deal we booked back in Q1. So yeah, I wouldn't say there's anything, a significant change, in large deals other than some general additional deal scrutiny.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. That's helpful. Peter, maybe for my follow-up for you, I was wondering if you could just dig into the Crossix business a little bit more. I mean remind us kind of what are the bigger offerings there and sort of what's changed in sort of this downtick in the macro, if you will.\n\nPeter Gassner -- Chief Executive Officer\n\nSo, Crossix has a few different parts to it. It's all related to advertising. Some of it is measurement, how are your advertising going; and some of it is more programmatic, which is you can buy audience from us, patient audiences, so there's a lot of details to the Crossix offering. But at the macro level, due to the macro environment, people spend a little bit less in advertising, and so that flows through to Crossix.\n\nI would say we're real bullish on Crossix going forward. When we bought it about three years ago, the idea was to use it to develop Data Cloud but also to integrate CRM and Crossix so we can help the industry bring together sales and marketing. And that's really playing out. So, we're increasing our revenue in Crossix overall, and we're making it a broader offering and even establishing a new type of pattern with some customers where certain percentage of Crossix is done as an enterprise agreement, a baseline measurement agreement, therefore, it will be a little less variable as we go forward.\n\nBut these changes take a while to play out over time.\n\nSaket Kalia -- Barclays -- Analyst\n\nMakes sense. Thanks, guys.\n\nPeter Gassner -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nYour next question comes from Keith Weiss with Morgan Stanley. Your line is open.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. Thank you, guys, for taking the question. I have one guidance question and one a more product question. On the guidance side of the equation, I mean, overall excess [Inaudible] billings coming down by $35 million on a $2.3 billion base isn't huge, it's not a very big impact.\n\nAnd the question I've been getting more from investors is, why are they taking numbers down? Are they taking numbers down far enough, is the forecast conservative enough. So, maybe for Brent, I was hoping you could help us garner confidence that this is the right cut, that no more is going to be necessary on a go-forward basis and give us some confidence that the numbers have been derisked on a go-forward basis. And then on the product side, I was wondering if we could dig into Data Cloud a little bit. And are there frictions there that could potentially get taken away on a go-forward basis to sort of have that progress faster or they just take time to sort of get through, like the network effects that the existing incumbents in that space have? Can you talk to us about like what can speed up or slow down progress with Data Cloud?\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. So let me take that first one, Keith. Yes, so consistent with our guidance philosophy, we take all the best information to give you the best view we have of the business today. And we have a broad portfolio of customers and products, so we have pretty good visibility into our pipe at various stages.\n\nAnd we have active conversations with our customers, so we have a sense of the pacing of what they're looking for. So, we've factored all that in. And we considered FX, the current rates they're at. We've factored in that there is some increased deal scrutiny and also some lower spend in SMBs.\n\nSo that was all informed our guidance there.\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nKeith, I'll take the second part of your question around Data Cloud. So first, just defining Data Cloud at the highest level. Data Cloud is OpenData, Link and Compass. I think you may be referring to Compass but let me hit each of them really quickly.\n\nOpenData is our customer reference data, steady grower. That's been around for a while now. Link, we announced that a number of years ago as one product, Link for Key People, that has really great momentum, momentum in the enterprise, in the SMB. We also announced four additional Link products which are all in the very early stages with early adopters, but they're getting a lot of excitement because of the momentum we've created with that first Link product.\n\nSo, Link family of applications, that's doing really well. And then the third area, which I think you may be referring to as driving additional speed, is Compass. And Compass, remember, that's our patient data. That's what we launched first then prescriber.\n\nAnd over time, we'll have sales data in that area. We're really focused on the patient data side. Think about that Compass is really a marathon for us, right? We're in the very early stages with patient data. It's progressing well.\n\nWe had four customer wins there. And the way to think about a customer win is they'll start with a brand, and that brand will have a couple of use cases and they'll buy our data for those use cases. It could be something like defining the patient journey, understanding how to treat patients. It may be finding more doctors based on the patients that they treat.\n\nThat's what they would use it for. We have to deliver customer success in those areas. And then once we deliver on that, we'll expand within that brand team, maybe additional products, and then also across brands, selling new products to other brands in that company. So, you can see it's kind of step-wise.\n\nIt will take time for us. We're accelerating in that space. We're highly focused on it. And we think all the time about things about how we can kind of further accelerate in there, and we're executing on most of those.\n\nSo, I'm happy with the execution. It's going well, but that gives you a sense of what's in Data Cloud. And all we feed on each other, right? All the products are connected together. So, we think we have the right product strategy, and we're going to continue to execute there.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nOutstanding. Super helpful, guys. Thank you.\n\nOperator\n\nYour next question comes from Gabriela Borges with Goldman Sachs. Your line is open.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nHi, good afternoon. Either for Peter or for Brent. I'd love to revisit the trajectory of the core CRM business, the piece that's based on seat-based pricing. I know you've been pretty consistent in saying that new customer seats will more than offset rep productions.\n\nCould you remind us, do you think we're through the largest headwind of the rep production dynamic? Does returning to in-person selling post-COVID help with this? How do we think about the trajectory of that specific piece of commercial going forward?\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. So, regarding the commercial space, so we still believe that 10% is the right number over time. We haven't seen anything that has changed that view. But we do expect to continue to take share.\n\nAnd as we take share, the impact of Veeva will, in fact, be less overall. We feel good about our ability to continue to expand the footprint of CRM, as well as our add-on business associated with it.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nThank you. The follow-up is on CDMS. A couple of comments in the prepared remarks. I know there was a customer win announced in the quarter as well.\n\nWould love to get a little more detail, how should we think about the trajectory of CDMS? And is there a scenario where that becomes more significant, a more material driver of growth, either in the next 12 months or perhaps in the next 24 months?\n\nPeter Gassner -- Chief Executive Officer\n\nI'll take that one. CDMS, I would say really happy with the progress in the quarter. And why do I say that? It's just the momentum, especially in the enterprise segment. The customer success with a couple of large enterprise customers we have and the progression of the sales cycle with some other enterprise customers gives me a lot of confidence.\n\nOur goal there is to be the leader in that area over time, and I think we'll get there. Then that also leads into our digital trials, right? We have success in the core CDMS area. There are other products adjacent to CDMS, which is the ePRO, patient-reported outcomes, that type of thing; the recently purchased randomization and trial supply management as well. So, there's a lot of adjacent things.\n\nSo, I couldn't be happier with our progress. And that one also, like Compass, that one is a marathon, but we're ahead of the game. I think most people would say, \"Pete is going to win that race.\" It's too early to call that race for Compass because we're just getting started. So very different Compass and CDMS.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nThanks for the comments.\n\nOperator\n\nYour next question comes from Dylan Becker with William Blair. Your line is open.\n\nDylan Becker -- William Blair -- Analyst\n\nGuys, thanks for taking the questions. Maybe first for Peter. I think there was something in the prepared remarks relative to the growing number of customers with that vision for a unified platform. It's not something that's necessarily going to happen tonight.\n\nBut obviously, you guys are heavily embedded in that strategic discussion. So maybe can you talk about the progression of that road map, what the future adoption can look like, and how you can assign maybe some of the value with some of those earlier tools to support that broader platform standardization over time.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah, it's a good question. So big picture, we're getting more products, and each of the products are getting better, and we're fitting them together very nicely. And we saw that with dev cloud first where we, I guess, six years ago, four years ago, we started really painting this big picture. And now we're just executing on it, right, just executing.\n\nCommercial, we're doing that now as well. We made a lot of progress this year. So, we have good, stable, happy customers in CRM and in commercial content, and we're leveraging that for success in these big new areas; Crossix, Data Cloud, and actually our business consulting. Our business consulting is going well.\n\nWe started it three years ago, and it's quite profitable and has 150 people. So, what we're seeing is our product strategy is right on the commercial side and on the R&D side, and we're executing well. I think it was really encouraged by this quarter because we just executed well, and the macro environment actually helps us for the long term because during this time, there's a flight to quality with customers and with employees, so more rehires, more hires, getting more people, planting more seeds for future growth. Those things, they all ladder up to a more strategic relationship.\n\nWhen you have more excellent products, they fit together better, you just get more excellent relationships. And the macro, that happens. I've seen it a lot. I'm one of those guys, right, I saw the dot-com boom and the dot-com bust.\n\nI even saw Y2K, that thing, the financial crisis. And now we see COVID, right? COVID happened and then the overspending by governments, the inflation, the correction, the war in Ukraine, etc. You get through these things, and it's really just about execution. Do you have the right blueprint of what you're doing? Can you stay focused? Can you execute with excellence in the product and the field than you do OK? So that's why you hear optimism for me because I feel like we got a plan, and it's working.\n\nDylan Becker -- William Blair -- Analyst\n\nYeah. And maybe if we could follow up on that to a certain extent as well, too. You highlighted a lot of kind of the ongoing innovation, a number of new product announcements, and the strategic value of that Business Consulting segment maybe to the point now where it drives decisioning today but relative to the potential value capture. And maybe it's in an area of growing incremental reliance on Veeva to say, \"Hey, we want you to develop more of these kinds of capabilities and solutions,\" obviously, to go out and capture more of the overall opportunity but to continue to expand and develop that market, speaking to your point on the long term maybe favorability from what you guys are seeing today as well.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah, I agree with you. Business consulting completes a picture for Veeva, strategic discussions with our customers, and how can they change their go-to-market motion. And that leads into both being able to introduce our products but also to influence our products. Because we have a very tight relationship between our consulting group, our product group, and our sales group, the feedback loop is very tight.\n\nAnd I don't know about every company in the world, that's for sure. But I don't know about any company that has this mix inside one company, and it's really feeling good.\n\nOperator\n\nYour next question comes from Kirk Materne with Evercore ISI. Your line is open.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYeah. Thanks very much. One for Peter and one for Brent. I guess, Peter, just to start, you mentioned just a second ago that the macro actually might help you a little bit.\n\nI was just kind of curious on the R&D side, I know you haven't seen anything yet. But is there any chance of reprioritization around certain products may be moving up the priority list for your customers in a tougher environment versus where they might have been in a more normalized environment? I know it's sort of a hard thing to guess. I was just kind of curious if you're seeing that perhaps at the top end of the funnel at all. And then, Brent, just on your comments about small businesses.\n\nAre you referring specifically to some of your smaller biotech customers? The reason I ask is I assume most of those are more R&D customers, not necessarily commercial customers. So, I was just curious if you could clarify that a little bit. Thanks.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. The first question there, I guess, for sure, in this environment, it's not great to be selling nice-to-have products, right? Those are the first that get the downturn. And we don't have a lot of nice-to-have products. We have real foundational ones.\n\nSo, I would say things are looking good for us. The advertising, which is the Crossix-related business, that's required over the long term, but you can modulate it up and down. So, our product footprint is more about building capabilities for the long term, not nice-to-haves. It's susceptible a little bit here when you have these hiccups in the macro that cause people to reassess a little bit, \"OK, what's going on?\" But where you really don't want to be is in the nice-to-have products.\n\nThat doesn't work well in this environment.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nActually, can I just follow up on that? I was actually referring to your product portfolio, meaning, I realize none of your products are going anywhere. They're all foundational. But I was wondering, even within your R&D product portfolio, are there things that might become more of an imperative in the short term versus others? That might not be the case, but I was just curious.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. It's an excellent question. No, not really because they're all pretty foundational, and they're in their areas. If you're in safety, that's the most important thing to you.\n\nIf you're in the clinical data management area, that's the most important thing to you. So, there's no particular boost or slowdown in any particular area.\n\nBrent Bowman -- Chief Financial Officer\n\nAnd then, Kirk, to your second question, we did see it, some of that we talked about, lower spending in SMBs. And that's more in the lower half of that SMB definition that I was describing before because that SMB space is a very wide space. But our pre-commercial exposure is really relatively small.\n\nPeter Gassner -- Chief Executive Officer\n\nThank you. I was just reflecting on your question, Kirk, and give you a bonus answer here. In terms of the products, it has more to do with just the natural cycles in the industry which run longer than the temporary macro. So, for example, some of the best progress we've had in the last year is actually in our regulatory, in the upper end of the enterprise, in the regulatory area.\n\nAnd that's just a function of us having good products and customer success in the industry. It's a natural. We're approaching that second replacement cycle. So, it's more the natural rhythms rather than the macro.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThank you all.\n\nOperator\n\nYour next question comes from Tyler Radke with Citi. Your line is open.\n\nTyler Radke -- Citi -- Analyst\n\nYes. Thanks for taking the question. I wanted to ask you just in terms of the linearity in the quarter, kind of how that tracked and when you started to notice the slowdown in your pipeline. And then just a follow-up on Kirk's question.\n\nI guess if we look at your R&D guidance for the full year, it did come down slightly. I presume some of that was FX, but you also didn't take up the revenue guidance. So, I guess, are there certain portions of the R&D portfolio that are seeing deal delays, perhaps CDMS where the deal sizes tend to be larger? Just help us understand the moving pieces there and any comments on linearity. Thank you.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. So, there's a few questions there. So, on linearity, we started to see some of the impact in the later part of June. So that was where we started to see a little bit of the headwinds from a lower spend in SMBs, a little bit of additional deal scrutiny.\n\nSo, the quarter started out a little bit more typical and then we started to see that later in the month of June. And then related to R&D, if you exclude the impact of FX on a full year basis, it's closer to 32% growth full year. So, we're very pleased with what we're seeing from the momentum in the R&D space. Now they're not completely immune either to additional deal scrutiny.\n\nSo, if it's a large deal, there could be additional levels of approval and inspection on that. But we have not seen anything significant in the R&D space.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question comes from Ryan MacDonald with Needham and Company. Your line is open.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThanks for taking my questions. Maybe first, on the commercial side of the business, we've recently, in some of the checks, as we're thinking about budgets for calendar year '23, picked up that some budgets are starting to remain sort of static on a year-over-year basis for sales and marketing. Just curious if this is something, a phenomenon, you're seeing as well. And perhaps how does that impact how you're thinking about beyond the back half of the year and into next year, particularly in that commercial side of the business? Thanks.\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nYeah. Hey, Ryan, this is Paul. Can you just repeat the specific phenomenon? It kind of broke up when you said that. What are you seeing?\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nYeah. In some of our checks, we're starting to pick up that as we look at budget planning for sales and marketing heading into next year, the budgets are sort of remaining static rather than growing on a year-over-year basis. And so, to put that in the context of sort of the updated guidance today, one, are you seeing that? And two, what does that potentially say about the prolonging of any headwinds on the commercial side of the business? Thanks.\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nGot it. OK. Thanks, Ryan. Thanks for repeating that.\n\nYeah, most of the industry is entering their budget planning cycle right now, so a lot of those conversations are kind of hitting full swing in most life sciences companies. And no, I have not heard we're seeing that yet. Again, like Peter talked about, a lot of what pharma does is this longer cycle, longer planning kinds of things, and we haven't seen any indication that budgets will be impacted next year. So, we haven't heard that yet, but time will tell.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThanks. And maybe just a quick clarifying question on the SMB commentary. Are you seeing any churn at the SMB level? Or is this more of a lack of expansion in spend at the SMB level? Thanks.\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nYeah. It's mostly a lack of expansion. So, the add-on of additional CRM users, add-on of PromoMats users. There is always some level of churn that happens.\n\nYou don't see it, but companies get acquired, as one example, or companies go out of business, or they go up or they go down. That is very natural. It's very common. It happens every single quarter.\n\nThat was not unusual in this quarter. It was more what Brent had referenced earlier.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThanks for the color.\n\nOperator\n\nYour next question comes from Jack Wallace with Guggenheim. Your line is open.\n\nJack Wallace -- Guggenheim Partners -- Analyst\n\nHey, thanks for taking the questions. I got two of them for you. I realize we collectively hit the guidance question pretty hard here. I just want to tease it from a different angle.\n\nAre there any geographic areas, maybe in particular the Eurozone, where decision-making is slowing more than others? And then I've got a follow-up.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah, we're not seeing anything particular in a specific geo that was worthy of calling out from an additional exposure perspective.\n\nJack Wallace -- Guggenheim Partners -- Analyst\n\nGot it. Thank you. And then hiring in the quarter, as you called out, a couple of occasions that Veeva is a good place to work and potentially some of the smaller, previously faster-growing, public or private companies may not be as attractive to some of that talent, thinking about talent leaving and there being multiple compression, particularly in the private markets. Looking at your balance sheet, you've got nearly $3 billion in cash.\n\nAs the M&A pipeline picked up much, are we getting closer, potentially doing a couple more deals, just thinking about capital deployment? Thanks.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah, I'll take that one. Certainly, the hiring environment is better now than it was a year ago. In terms of M&A potential, yes, when the valuations come down, and the speculation comes off a little bit, it is a more attractive M&A environment. And so, we're looking, but we're always patient.\n\nWe have so far 100% track record of success on our acquisitions. That's hard to do. And so, we're a bit careful and surgical, but we're looking. And when you're looking, you might find something, but you don't know exactly when you'll find it.\n\nJack Wallace -- Guggenheim Partners -- Analyst\n\nOK. Thanks again.\n\nOperator\n\nYour next question comes from Joe Vruwink with Baird. Your line is open.\n\nJoe Vruwink -- Baird -- Analyst\n\nGreat. Hi, everyone. Just to peel back the onion a little bit more on commercial performance. The $17 million lower subscription revenue guidance, most of that seems to be coming in the second half.\n\nIf I specifically apply that to what I imagine the Crossix revenue basis, it implies a rather large change in Crossix performance. Is that directionally correct? And does it just speak to the extent of kind of ad budget changes that, that business is seeing?\n\nBrent Bowman -- Chief Financial Officer\n\nIf you take a look at the reduction, half of it is FX related. And then you can kind of split the other balance between Crossix, which you called out, there was a little bit more pronounced impact to the Crossix business, and then the balance would be more broadly. So, I think your observation is a good one.\n\nJoe Vruwink -- Baird -- Analyst\n\nOK. Great. And then I know we've kind of asked this question a couple of different times. But based on your operating history and being through ebbs and flows in this industry, does it stand out to you that there is specific areas of your business that seems like it's falling exclusively in commercial, that are getting caught up in the macro where R&D is forging ahead 32% organic and the enterprise commercial solutions like Align, Events, Data, those don't seem to be changing? Is that kind of in line with what you would expect to be resiliency? Or is there the potential that maybe those things just see effects but with a lag?\n\nBrent Bowman -- Chief Financial Officer\n\nSo, you know, I think where we're seeing the impact today is, as you mentioned, more on the commercial side where it's more user-based consumption. So that modulates a bit more in the macro. So again, it was more pronounced in Crossix than we saw with some of our add-on business within the year. We haven't seen it on the R&D side.\n\nOn the longer-term ELA-type business, those are longer, really strategic type deals. And they're less likely to be impacted, I would say, over time.\n\nPeter Gassner -- Chief Executive Officer\n\nI would add that it has to do with the maturity of the product as well. Crossix being a special case that can go up and down with the advertising. If we look at our very mature and high market tier products like PromoMats, the commercial content, CRM, that's where you're going to see it a little bit more. You have to remember in these other growth areas where we're just getting started, so Data Cloud, including Link and Compass in there, Business Consulting; and then the R&D area, Safety, CDMS, these new quality products, that's where it's mostly just about capturing new market share, right? We're not as susceptible there, right? That's just the natural cycle of getting your early adopters live and happy, getting the value out there and then capturing the market.\n\nThat area has more to do with the competitive environment than it has to do with the macro.\n\nJoe Vruwink -- Baird -- Analyst\n\nThank you very much.\n\nOperator\n\n[Operator instructions] Your next question comes from Jessica Wang with Raymond James. Your line is open.\n\nBrian Peterson -- Raymond James -- Analyst\n\nHey, it's Brian Peterson. So, Brent, I just wanted to follow up on some earlier questions. I appreciate all the disclosure on the SMB business. But if we had to think about where you're seeing the most pronounced weakness there, is it actually with the larger end of that SMB that are more commercial where there's a more pronounced impact? I'm just getting questions from investors because I think a lot of people thought maybe the SMB exposure was more R&D focused just given the pre-commercial nature.\n\nSo, I don't know if there's a way to split that out, I just want to make sure we're all clear and on the same page there.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. Hey, Brian, so the exposure we're seeing is more on the commercial side, as we said before, and it's more on the lower end of the SMB space. Now we still are seeing, like I said before, increased scrutiny on larger deals that cut across both commercial and R&D. But as far as the lower spending in SMB, that is more pronounced on the lower end and on the commercial side.\n\nBrian Peterson -- Raymond James -- Analyst\n\nOK. Got it. And maybe just one last clarification. Any help on how Crossix is priced? Have you guys disclosed that just in terms of like the methodology?\n\nPeter Gassner -- Chief Executive Officer\n\nYou know, we don't really disclose that at a detailed level. We have multiple products in Crossix that are priced differently. But in general, they will follow the amount of advertising spend the customer does in general. So that's the way you should think about that.\n\nBrian Peterson -- Raymond James -- Analyst\n\nThank you.\n\nOperator\n\nThere are no further questions in queue. I'd like to turn the call back to CEO, Peter Gassner for closing remarks.\n\nPeter Gassner -- Chief Executive Officer\n\nAll right. Thank you, everyone, for joining the call today, and thank you to our customers for your continued partnership and to the Veeva team for your outstanding work in the quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAto Garrett -- Senior Director of Investor Relations\n\nPeter Gassner -- Chief Executive Officer\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nBrent Bowman -- Chief Financial Officer\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nSaket Kalia -- Barclays -- Analyst\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nDylan Becker -- William Blair -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nJack Wallace -- Guggenheim Partners -- Analyst\n\nJoe Vruwink -- Baird -- Analyst\n\nBrian Peterson -- Raymond James -- Analyst\n\nMore VEEV analysis\n\nAll earnings call transcripts"
}