{
  "companyName": "Copart",
  "companyTicker": "CPRT",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/copart-cprt-q4-2022-earnings-call-transcript/",
  "content": "Copart (CPRT -0.56%)\nQ4 2022 Earnings Call\nSep 08, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Copart, Inc. fourth quarter fiscal 2022 earnings call. Just a reminder, today's conference is being recorded. For opening remarks, I would like to turn the call over to Gavin Renfrew, vice president of global accounting of Copart, Inc.\n\nPlease go ahead, sir.\n\nGavin Renfrew -- Vice President, Global Accounting\n\nThank you, and good morning. We'll start with the safe harbor. During today's call, we'll discuss certain non-GAAP measures, which include adjustments to income tax benefits related to stock-based compensation, legal matters, discrete income tax items, and the effect of the extinguishment of debt. We provided a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP measures on our Investor Relations website and in our press release issued yesterday.\n\nWe believe these non-GAAP measures, together with the corresponding GAAP measures, are relevant in analyzing our results and assessing our business trends and performance. In addition, our comments today include forward-looking statements within the meaning of federal securities laws, including management's current views with respect to trends, opportunities, and uncertainties in our markets. These forward-looking statements involve substantial risks and uncertainties. For more detail on the risks associated with our business, we refer you to the section titled Risk Factors in our annual report on Form 10-K for the year ended July 31st, 2021, and each of our subsequent quarterly reports on Form 10-Q.\n\nAny forward-looking statements are made as of today, and we have no obligation to update or revise any forward-looking statements. With that, I'll turn the call over to our co-CEO, Jeff Liaw.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nThank you, Gavin, and good morning, everyone. I'll start with some comments about themes in our business. I'll turn it over to Gavin to walk you through some financial highlights, and then we'll take Q&A thereafter. We're pleased to report our results for the fourth quarter of fiscal 2022 and have concluded another strong fiscal year here at Copart.\n\nWe are celebrating the 40th anniversary of our company's founding by Willis Johnson starting way back when with just a single yard in Vallejo, California. Since our inception, We believe it is our people and our values that have enabled us to build a profitable, sustainable enterprise. We're confident our formula will work for the next 40 years as well. We're well into our third year now of exceptional social and macroeconomic conditions of virus and its attendant mutations, a war and the disruptions on industrial production and supply chains, fuel prices, and the like.\n\nAll businesses, including ours, are affected by these forces. We're happy to take questions on short or medium-term volatility for the various input and output metrics for our business, but we'll focus our prepared remarks on a more durable operating beliefs and principles that guide our decision-making, namely that we will, one, invest in our physical infrastructure, technology platform and customer service offerings to improve auction, liquidity, and returns for our sellers. We will collaboratively engage with our sellers, both day to day and through catastrophic events to protect them and their policyholder relationships. We will actively expand our addressable market by growing our volume of lesser damaged and whole cars from both insurance and noninsurance sellers.\n\nAnd finally, that will continue our expansion into international markets around the world. In a moment, we'll discuss the quantitative indicators that we customarily provide on these calls, but I wanted to start first by addressing the subject of sustainability. We are increasingly asked by our customers, our employees, our shareholders, and other stakeholders about how Copart's business addresses the world's growing focus on sustainability. I want to offer our perspective on what sustainability means to us, how our business contributes to environmental sustainability, how we support and empower local communities, how we enable global economic mobility and development, and how we build an enduring enterprise to serve our customers for decades to come.\n\nFirst, on the question of environmental sustainability, conventionally, what folks mean most of the time when they say so. We have the great privilege of operating a business that is at its core breed. We aren't trying to shoehorn an environmental theme into a fundamentally problematic business. Instead, Copart is a keystone enabler of the circular economy in the automotive sector.\n\nOur retrievable and storage of vehicles, title processing, and online marketplace are essential to the reuse, harvesting, and recycling of literally millions of cars per year. We estimate that approximately two out of every five vehicles we sell are driven again somewhere in the world, the remainder are harvested and recycled for parts or metals reducing the need for de novo mineral extraction and manufacturing emissions. The benefit of the reuse and recycling of cars and their components and the attendant avoidance of carbon emissions dwarfs our actual Scope 1 and Scope 2 emissions. We estimate this benefit to be more than 100 times the quantity of our direct emissions.\n\nSecondly, we operate our business to enhance the sustainability and well-being of the communities in which we operate. Our business is essential in helping communities recover from acute weather events, which are themselves increasing in frequency as well. We currently operate purpose-built dedicated courtyards comprising hundreds of acres of vacant storage capacity, reserves for responding to catastrophic events in storm-prone areas. When major weather events occur, our people and our advanced preparation enable us to clear roads, repair shops in impound yards so that communities can quickly recover.\n\nThird, we enable global economic mobility and development. Through our unparalleled global member network, we facilitate access to vehicular transportation across the globe. We estimate that approximately two-thirds of the vehicles sold by our U.S. auctions to international members are to developing economies as defined by the UN Department of Economic and Social Affairs.\n\nPhysical mobility, which most of us on this call have taken for granted is essential for people around the world to access healthcare, education, leisure, and economic advancement. Finally, we operate our business in a manner that ensures enterprise sustainability. We believe that a truly sustainable business makes decisions so that it can serve its customers, not just in the weeks, months, and years ahead, but for decades to come. To that end, we have always taken the strategic approach of owning the vast majority of our real estate and storage capacity.\n\nWe've heard sometimes persuasive arguments in favor of more \"capital-light\" approaches, but we're steadfast in our belief that owning our facilities enables us to control our own destiny, ensuring the sustainability of our business for our customers. We are not just participants in our industry, we are stewards of it. Today, we operate on nearly 16,000 acres of land worldwide and own approximately 90% of it, controlling it in perpetuity. Over the last five years alone, we've invested nearly $2 billion in land acquisition and development.\n\nSimilarly, we have maintained a conservative balance sheet since our founding. We recognize the arguments in favor of more financial leverage, but we know that our approach assures our customers that whatever comes our way the 2009 financial crisis, massive storms in Sandy, Harvey, Ida, COVID-19, and all that lies ahead, Copart will stand uncompromised and ready to serve our customers. As noted on our last earnings call, we intend to publish our inaugural ESG report in the next few weeks in which we will, of course, more fully articulate these themes. I'll turn now to the operating statistics that we provide each quarter.\n\nOur global unit sales for the fourth quarter increased 5.1% year over year, with the U.S. increasing 4% and our international unit volume increasing 12%. Our insurance business was likewise above the fourth quarter of 2021. We grew on both a one- and two-year basis due to a combination of share gains and a continued recovery in driving activity and accident frequency and severity.\n\nNotably, of course, record high used vehicle prices have, for the past several quarters negatively impacted total loss frequency and have tempered overall insurance volume growth relative to what it otherwise would have been. Driving activity itself, as measured in vehicle miles driven, continues its rebound to pre-pandemic norms in the aggregate. Seasonally adjusted miles traveled for the month of May, for example, in the U.S. is up about one percentage point versus last year.\n\nGasoline consumption statistics mirror the same themes as well. Contrary to consistent long-term trends, we have observed declining total loss frequency on a sequential and year-over-year basis. Our selling prices have kept pace or more than kept pace with a strong used car price environment on a percentage basis, but the persistent lack of replacement vehicle availability and record high retail transaction values continue to reduce assignment volume for us relative to what it otherwise would be. Total loss frequency for the second calendar quarter in 2022 was approximately 16.9% in comparison to 19.7% for the same quarter a year ago.\n\nIf vehicles had been totaled at the same rate as last year, we would have observed insurance industry volumes 15% higher than what we actually experienced. In simple Layman's terms, in a world in which replacement vehicles are harder to come by, total loss settlements are a less attractive resolution to an auto accident claim than they otherwise would be. While total loss frequency has declined over the past year and a half or so, the 40-year trend is unambiguous. We believe firmly that the market will revert to the historical norm of steadily rising total loss frequency in the months and years ahead.\n\nAnd in fact, a number of other variables, accident severity, repair duration, repair, labor costs, rental car cost, part costs should contribute to that reversion and long-term trend as well. The history of total loss frequency from 4% in 1980 or so to 20% as of a couple of years ago, has been the product of two key factors: vehicle complexity and composition, making cars more expensive to repair while our auction liquidity and global buyer base has made them more efficient to total instead. While we will all no doubt struggle to predict precisely when supply chain bottlenecks will clear, and new vehicle production will return to historical levels, we do anticipate an eventual unwinding of these conditions, which will lead to a moderation of used vehicle values. We may well see a moderation of ASPs in that environment as well, but will almost certainly benefit from volume recovery or volume increases as well.\n\nWe continue to invest in growing our business beyond insurance total losses, excluding lower-value cars from sources such as wholesalers and charities, our U.S. noninsurance unit volume grew approximately 6% in the quarter, driven by a combination of rental cars, corporate fleets, financial institutions, and our power sports business. Our growth across the full spectrum of vehicles enhances our auction liquidity and returns for our sellers. The more cars we sell for -- the more cars we sell on behalf of dealers, rental car companies, fleet managers, and the like, the more our insurance company sellers will benefit as well.\n\nWith that, I'll turn it over to our VP of global accounting, Gavin Renfrew to walk through the fourth quarter financial results before we open it up for Q&A.\n\nGavin Renfrew -- Vice President, Global Accounting\n\nThank you, Jeff, and good morning. I will make a few comments on our operational results, and then we will take questions. For the fourth quarter, global revenue increased $134.8 million or 18%, including a $16.4 million headwind due to currency. Global revenue for the fiscal year increased $808.4 million or 30%, including a $22.2 million headwind due to currency.\n\nGlobal service revenue increased $87.8 million or 14.2% for the fourth quarter and $561.2 million or 24.5% for the year, primarily due to higher average selling prices and increased volume. U.S. service revenue grew 14.7% for the quarter and 25.6% for the year and international experienced an increase of 9.4% for the quarter and 16.6% for the year. We saw continued strength in ASPs, which grew 8.3% year over year for the quarter, with U.S.\n\nASPs up 9.2%. The Manheim Index is lower than January's record levels of 236.3 but remains historically elevated, ending July at 219.6, an increase of 12.5% year over year. August mid-month is 211.6, down sequentially, 3.6% versus July, but still up 8.8% versus last year. Purchased vehicles continued to comprise an increasing percentage of our overall revenue mix, driven by both strong used car values and growth in volume, particularly in our Cash For Cars business in the U.K.\n\nand from expansion in Germany. Purchased vehicle sales for the quarter increased $47 million or 36.5% and increased $247.2 million or 61.7% for the fiscal year. U.S. purchased vehicle revenue for the quarter was up 39.3% over the prior year and 61.8% for FY '22.\n\nInternational grew by 31.5% for the quarter and 61.5% for the year. Purchased vehicle cost of sales grew $47.6 million or 41.9% in the fourth quarter and $239.1 million or 69.1% for the year exceeding the growth in revenue. As a result, purchased vehicle gross profit decreased slightly by $0.6 million or 4.2% during the quarter. For the fiscal year, purchased vehicle gross profit increased $8.2 million or 15%.\n\nGlobal gross profit in the fourth quarter increased by $24.1 million or 6.7% and our gross margin percentage decreased by approximately 455 basis points to 43.2%. U.S. margins decreased from 51% to 46.3% and international margins decreased from 29.6% to 26.1%. For FY '22, global gross profit increased by $263.1 million or 19.6% and our gross margin percentage decreased by approximately 400 basis points to 45.9%.\n\nU.S. margins decreased from 52.6% to 48.9% and international margins decreased from 35.1% to 29.9%. As was true last quarter, this margin decline was primarily attributable to two factors: 200 to 225 basis points of the fiscal year decline was due to purchased vehicles from both a mix shift to purchased vehicles and from the contraction in gross margin rate on our purchased vehicles as the absolute values of those vehicles increase. The balance of our margin contraction is attributable to cost inflation in both towing and labor, offset partially by higher revenue per unit and volume growth.\n\nHowever, we believe we can continue to increase margin and returns on capital over time, as we benefit from scale and find further operational efficiencies through technology and innovation. I will now move to a discussion of G&A expenditures, excluding stock compensation and depreciation expenses. G&A spend in the quarter increased $3.6 million or 9.2%. For the year, G&A spend increased to $27.6 million or 18.4%.\n\nApproximately $6.6 million of the increase is attributable to certain discrete legal items, and we presented this adjustment net of tax in our non-GAAP reconciliation. Adjusting for this discrete item, our G&A increased $21 million or 14% from $149.8 million to $170.7 million. While G&A can be volatile from period to period, over the longer term, we anticipate G&A to decline as a percentage of revenue as we grow our business and create additional leverage. Our GAAP operating income increased by 7.7% from $301.5 million to $324.8 million for the fourth quarter, including a $2.3 million headwind due to currency.\n\nFor the fiscal year, GAAP operating income increased by $238.6 million or 21%. And adjusting for the G&A item I mentioned a moment ago, it increased 21.2% to $1.38 billion. Fourth quarter income tax expense was $39.7 million at a 31 -- sorry, at a 13.1% effective tax rate. Adjusting for the tax benefits associated with the exercise of employee stock options as well as the effect of extinguishment of debt, net of tax on a non-GAAP basis, our effective tax rate would have been 15.2%.\n\nFor the year, income tax expense was $250.8 million, for an 18.7% effective tax rate with an associated non-GAAP full year expense of $287.9 million for an effective tax rate of 21.1%. Fourth quarter GAAP net income increased 3% from $256 million last year to $263.7 million this year. Adjusted to remove the items detailed in our pro forma reconciliation included in our press release, non-GAAP net income increased 9.6% from $247.7 million last year to $271.6 million in the fourth quarter of FY '22. GAAP net income for FY '22 increased 16.4% to $1.1 billion, and non-GAAP net income increased 21%.\n\nOur global inventory at the end of July decreased 5.7% from last year and 2.7% excluding low-value units like wholesalers and charities. That is comprised of a year-over-year decrease of 9.6% for U.S. inventory and an increase of 24.9% for international inventory. As Jeff mentioned a moment ago, for the first time in recent history, the number of total losses as a percentage of overall accident has been declining.\n\nAs a result, our inventory levels are modestly lower than they were a year ago. Now to briefly update our liquidity and cash flow highlights. As of July 31st, 2022, we had $2.6 billion of liquidity, comprising of $1.4 billion in cash and cash equivalents and an undrawn revolving credit facility with capacity of $1.2 billion. As we discussed on our last earnings call, in the fourth quarter, we retired $400 million of private placement notes outstanding.\n\nWe incurred a prepayment penalty of $16.8 million in the quarter associated with the retirement, which is nearly equivalent to one year of interest payments if the notes had not been retired. We believe this to be the superior choice given cash on hand, projected interest savings, and the relative inflexibility of these private placement notes. Operating cash flow for the quarter increased by $84.1 million year over year to $312.8 million, driven by stronger earnings and the cost associated with the extinguishment of debt. We invested $102.6 million in capital expenditures in the quarter, and over $300 million for the fiscal year, with over 80% of this amount attributable to capital -- sorry, to capacity expansion as we are continuing to prioritize investments in physical infrastructure.\n\nDespite unusual near-term forces that have suppressed unit sales relative to where they would have been, we continue to invest in capacity with the conviction that we and our customers will need it. That concludes our prepared remarks, and we are happy to take some questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Bob Labick with CJS Securities. Please proceed with your question.\n\nBob Labick -- CJS Securities -- Analyst\n\nGood morning. Congratulations on another fantastic year.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nThanks, Bob.\n\nBob Labick -- CJS Securities -- Analyst\n\nSo I just wanted to start with the short-term when you obviously discussed costs rising related to towing and labor, and I assume fuel is embedded in that towing discussion. And we did some quick math, if it's right, like there was even a sequential growth in cost per unit from last quarter. So I guess the question is what actions are you taking now? Or can you take to reduce cost per unit? And how long might that take to kind of flow through to get lower cost per unit, better unit economics in that regard?\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nGot it. Bob, I think in short, the optimizing the efficiency of our business is a forever initiative regardless. So it's not per se in response to rising fuel prices or labor costs, etc. It's that phenomenon inflation, broadly speaking, has always been true.\n\nAnd where we precisely see it in the business at any moment in time can vary sometimes it's fuel, sometimes it's healthcare, sometimes it's commodities otherwise. But the efficiency initiatives we pursue are self-evident in some regards, but we endeavor to automate much of what we do, including the dispatching of our drivers to retrieve vehicles to optimize the routes to minimize waste in the retrieval of vehicles. For example, we endeavor to automate our interactions with our members and our sellers in ways that make it easier for them and for us to run the business day to day. So the real answer to your question is it's not specifically in response to those catalysts, but those productivity initiatives have been true forever and we are attacking them with the same deal as we always have.\n\nBob Labick -- CJS Securities -- Analyst\n\nOK. Great. I understand. And then a little more big picture.\n\nI guess, what, if anything, has changed in the insurance and salvage process since the pre-pandemic? In other words, have you added new service for the insurance companies or new products or differentiated offerings that may also come with a cost to you, but it's obviously part of what you provide your insurance customers. How has anything changed since pre-pandemic? And I'm trying to think about like adding to the unit cost over time, but for a good reason kind of thing.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nYeah. That's a fair question, Bob, and I think an astute observation that in general, the early days of the pandemic were such that many companies, insurance companies included, wanted to avoid in-person engagement for themselves and their customers for obvious reasons to avoid the transmission of COVID-19 itself. And then since then, of course, they have faced some of the same hiring and retention challenges that the economy more broadly has as well. And as a result, they are asking us to do more, and we are offering to do more.\n\nIn some -- to give you specific examples, we have many fewer insurance company employees who are day to day visiting our yards to do their work and we've instead virtualized much of that workflow for them, doing it on their behalf and conveying that information digitally so that they can process those vehicles without coming to see us first hand. There are also other further downstream processes involving title and otherwise that we now do on their behalf that perhaps they previously had retained a larger department to do on their own. So I think that's a long-term trend anyway really before the pandemic but certainly accelerated by the pandemic and likely will persist. So we are happy to perform those services on behalf of our insurance companies.\n\nWe think we can ultimately do so more efficiently and do it well for them on terms that make economic sense for them and for us.\n\nBob Labick -- CJS Securities -- Analyst\n\nOK. Super. Thank you. I'll jump back in queue.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nSure.\n\nOperator\n\nThank you. Our next question is from Craig Kennison with Baird. Please proceed with your question.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nHey. Good morning. Thanks for taking my question. We get a lot of questions on the dynamic with respect to volume and then also just price.\n\nYou mentioned the Manheim Index being at a record level. If we revert to a scenario in which volume sort of dominates driven by a higher total loss rate, but price comes down. How would you say that will impact your revenue algorithm kind of in the near term and the long term? On the long-term side, I'm sure if volume grows, that's great for you. But in the short term, if you see prices drop while volume recovers, but maybe at a slower rate.\n\nCould there be an air pocket there? That's the question we get.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nFair question, Craig. And one we've wrestled with forever, even outside the parameters of what is currently a once-in-a-lifetime [Inaudible] inversion, where we've never seen this before. But even five years ago, when we were facing the same questions, do we, in general, favor high used car prices or low used car prices, we've always been ambivalent about it. The lower used car prices will no doubt lead to more assignments to us and will probably be to lower realized ASPs, all else equal as well.\n\nSo the unit economics will be modestly worse, but we'll certainly see greater unit volume as well. So we -- I think to be transparent, Craig, don't know precisely, right? The matter of degrees. And so if the volume increases significantly and the price moderates modestly, there's no doubt that's beneficial to us. Could there be other such scenarios, I think, yes, the 40-year trend says that the economics will work themselves out quite well in the end.\n\nBut as for what happens in a given month or quarter or perhaps even fiscal year, harder to be precise about that.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nThanks. And then with respect to Europe, have you run any game plan scenarios with the energy crisis and potential recession there? I'm curious are you selling partners changing their behavior in any ways based on less volume, if there's less driving, for example? And then on the demand side, with the strong dollar, and potential uncertainty in that market? Are you seeing any behavior changes there?\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nI'll separate those two questions for a minute, Craig. First, on the notion of insurance company practices in Europe. I wouldn't -- besides the same themes, I mentioned a moment ago about insurance companies as a general matter asking us to do more and our offering to do more in the claims process relative to what we used to do. Besides that, I wouldn't note any radical changes in the way they have managed their businesses over the course of the past couple of years or since the beginning of the war I think is the specific catalyst you're asking about.\n\nAnd then -- and to your second question then about currency fluctuations, I think you know this already. We are short the dollar in our business. We favor a weaker dollar, which leads to better auction returns on the margin for us given our robust global buyer network. At any given moment in time, I think we see currency fluctuations across countries such that some are more in the money or some are more out of the money relative to where they were a year ago.\n\nSo in the aggregate, I think we -- our auctions are performing just fine. As for how we approach in our game planning for Europe, we aren't going to be affected by what happens in the next month or two, right? That's not the horizon with which we're making our business decisions anyway there, here or anywhere. So what we specifically see on natural gas shortages or what have you, we certainly observe them, we take stock, we understand how to communicate with our customers given that backdrop, but it doesn't change our strategic approach.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nGreat. Thank you.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nThanks, Craig.\n\nOperator\n\nThank you. Our next question comes from Daniel Imbro with Stephens, Inc. Please proceed with your question.\n\nJoe Enderlin -- Stephens, Inc. -- Analyst\n\nThis is Joe Enderlin on for Daniel Imbro. Thanks for taking our question.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nHi, Joe.\n\nJoe Enderlin -- Stephens, Inc. -- Analyst\n\nSo our question, when looking at service vehicle gross margin pressure specifically, could you talk about what the biggest drivers of pressure you've seen? And then could you touch on any new developments you've seen on towing costs?\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nI think the pressure is Gavin talked about them to some -- in his prepared remarks. But we're observing the same inflationary forces that the folks are across industries. So whether it is fuel costs, labor costs, both in-house and third party. Those are the same forces, I think, that every business literally worldwide is observing today.\n\nSo nothing particularly unique in that regard. As for the economics of the business, gross margin, as you know, is a function of both of the cost as well as the revenue. n the revenue side, we continue to benefit, of course, from a robust used car environment, robust selling prices, our auction liquidity is stronger than it ever has been. And so the realized returns we achieved at auction are certainly the offsetting consideration there as well.\n\nJoe Enderlin -- Stephens, Inc. -- Analyst\n\nGot it. That's super helpful. As a follow-up, I was wondering how you're looking at the returns on capital between share repurchase and land expansion at this point. You likely have capacity to pursue both, but how are you feeling about priority between these two\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nThe priority certainly is always to invest in, and this is what any good steward of capital would, I think, is the framework they would approach the question with, which is how do we maximize those returns over 30-, 40-, 50-year horizons. And if that is your framework, we would always elect to invest productively in the business long-term. here is power in the network. There's power in physical capacity.\n\nThere's power, as you heard me say, in owning it and controlling it in perpetuity. We generate cash, of course, net of those investments as well. As you know, from our history, we buy shares back. We do so aggressively in real volume.\n\nWe also do so episodically as opposed to via a predictable routine buyback program. So at some point, we don't announce in advance. But at some point, we, of course, will buy shares back that ultimately is the use of residual capital.\n\nJoe Enderlin -- Stephens, Inc. -- Analyst\n\nGot it. That's all for us. Thank you.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nThank you.\n\nOperator\n\nThank you. Our next question is from Chris Bottiglieri with BNP Paribas. Please proceed with your question.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nHey, guys. Jeff, I think you said two out of every five cars are put back on the road today. I guess where do the metrics stand before the great financial crisis? And can you give us a sense of how price and volumes change on the financial crisis of these types of vehicles? Just trying to understand if this is becoming more cyclical as you successfully disrupted international markets and traditional wholesale auction model or if like supply is the bigger factor other than demand is my first question.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nI missed the critical first phrase. Can you say it again, Chris?\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nYeah. So I'm just trying to understand like you have two out of every five cars are putting back on the road, like where did that metric stand before the great financial crisis, like where are drivable cars before then? Just trying to understand that this is becoming more cyclical as you've just gone more to international markets, you've gone to the Copart Direct, as you've gone through the dealer consignment business.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nGot it. I think directionally, Chris, meaningfully lower, but that's not per se a function of macroeconomic conditions. So global financial crisis, if we're talking 2008 -- 2007 Horizon, pre GFC, that is a full 15 years ago, total loss frequency meaningfully lower than it is now. And so the reason we have so many more drivable cars today is that it is economically attractive to total those cars in a way that it wasn't 15 years ago.\n\nOur buyer base, our international auctions, our online technology is such that we can generate returns that justify totaling those cars instead of repairing them. So it's not a function per se of economic growth or recessions or interest rates or what have you, it's that the fastest-growing economies worldwide as a general rule have the lowest vehicle penetration and the greatest incremental vehicle demand. So as we tap into that trend, certainly has increased the number of drivable vehicles we sell has over the past 15 years and almost certainly will over the next 15 years as well.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nGotcha. OK. And maybe a bigger picture question longer term, just your ESG report coming out. I wonder like how much work you've done on the impact of electrification, particularly like battery electric vehicles? Like what are you seeing today in terms of -- another obviously a very small population of cars.\n\nThey're very young on average. There's just not a lot of data yet. We have to hit your sweet spot. But in the early findings of these earliest EVs, what are you seeing in terms of total loss rates? Are these cars more or less likely to be totaled at a given age? And then two, what are you seeing in terms of like the proceeds value as a percentage of, call it, like ACV or something? What are you seeing on the EV side?\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nFantastic questions and complicated ones. First, and difficult to isolate specifically because there are, as you know, sparing the few cars for which we have a controlled experiment of an electrical -- electric version and an internal combustion engine version like-for-like. And so comparing the two when it comes to total loss frequency, repair costs and auction returns is difficult. What I would tell you, so far, however, is that electric vehicles, perhaps by virtue of being newer, having more safety technologies, more perimeter sensors, almost always in the form of cameras in the front to enable autonomous braking and the like or even autonomous driving like features.\n\nThose cars total more easily, the repair costs are high. In many cases, the automotive repair networks around the world are not yet equipped to handle those cars either to calibrate the sensors, to repair the cars, to source the replacement parts, especially in this environment. If anything, those cars total more easily than conventional vehicles would. As for auction returns, though, as you noted, it's early and therefore, the addressable population remains small on balance, the returns on electric vehicles are meaningfully higher than for internal combustion engine equivalents, though, again, with the caveat that the expression equivalent is a very rough one because the perfect apples-to-apples comparison is not always readily available.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nVery helpful. Thank you, Jeff.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nThank you.\n\nOperator\n\nOur next question is from Ryan Brinkman with J.P. Morgan. Please proceed with your question.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my question. How should we think about the outlook for agency model average revenue per unit tracking going forward with, on the one hand, declining used vehicle and scrap metal prices? But on the other hand, the tailwind from more higher-priced non-salvaged vehicles and maybe any potential fee actions you could take as selling prices decline? And then what do you think the margin implications are going forward on the one hand, the direction of selling prices, which I'm presuming is down? And on the other hand, the operating leverage provided as volumes normalize higher?\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nRyan, good to hear from you. And fair questions, probably along the same lines as a few callers ago. On the question of incremental volume versus incremental ASP and how they interact, my answer then is that we are somewhat ambivalent between the two. High used car price environment like the one we're in now means that our unit economics are excellent, but it also means that our volume is compromised relative to where it otherwise would be.\n\nAs for then how we would feel about movements of x percent versus y percent in each is a question about elasticity and forecasting that in advance is hard to say. We actually don't know precisely which is \"better\" for the bottom line. Long-term, I think the volume growth will no doubt be positive and meaningful as it has been for the past 40 years. So total loss frequency will be the tailwind behind the business.\n\nBut as for the near-term, P&L effects of a slight drop in ASPs and a bump in volume precisely how that unfolds, we don't know.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. Thanks. And then how should we think about -- just lastly here, the trend in land purchases tracking going forward after a step-up in recent years, maybe as you were anticipating some of these market share gains and expecting volume recovery, etc.\n\nBut how should we think about land purchases tracking? And then the implications of that for the conversion of EBITDA into free cash flow and capital allocation optionality.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nSure. As for investing in land, I think you've heard me say this on prior calls, too, that becomes a very specific macroeconomic exercise in which we evaluate metro by metro and even metro areas of the northwest portion of metro x, we analyze our capacity and our expected capacity given growth in total loss frequency given, of course, as you noted, market share aspirations, given growth in our noninsurance business, what storage needs, we anticipate in a given market. So it's not an aggregate corporate decision. We don't wake up in a quarter and say, let's go spend $150 million this quarter.\n\nInstead, it's a macroeconomic question that we face market by market. In the aggregate, given that total loss frequency expectation, given our volume growth aspirations, we do expect to continue to invest in that capacity for years to come. So it has been, as you know, turbocharged say, since 2016 or so relative to historical periods before that, but we continue to believe that controlling our own destiny, investing in physical infrastructure is a key enabler in our business, and we'll continue to do that.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nOK. Maybe just one last one on market share. Do you know what your market share is? I think it was already possibly over 50% before some recent contract wins. And wasn't there a case where maybe, I forget when in the '90s, is that Manheim have had to sell some yards via some, I forget, arrangement with the Federal Trade Commission to ADESA when their market share was over a certain amount.\n\nI forget what it was maybe 65%, 70% or something like that. Are there any read-throughs to the salvage industry? Do you intend to just keep driving share higher? Is there any kind of practical limit or what do you think?\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nDifficult for us to comment on market share. In the same way that talking about market share in the aggregate is a little bit like answering how much do we want to invest in land in the next quarter. But every customer to us, whether we have all of their business, some of it or none of it is really important to us, and we spend a hell of a lot of our energy serving them and persuading them to do business with us, to do more business with us, to shift the business to us, etc. So that is, again, a microeconomic question, not a macroeconomic one.\n\nI'd also note that, as you probably remember, a quarter of our cars today come from noninsurance sources, and we continue to believe that we can grow in that arena as well. So we don't do market share calculations along the lines of what you described. And if we did, we would look at the automotive industry more broadly and look at it worldwide, in which case our market share, of course, is quite a bit less than the range as you were citing and our addressable market quite a bit bigger.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\n[Operator instructions] Our next question is from Bret Jordan with Jefferies. Please proceed with your question.\n\nBret Jordan -- Jefferies -- Analyst\n\nHey. Good morning, guys.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nBret.\n\nBret Jordan -- Jefferies -- Analyst\n\nCould you talk a little bit about specifically the German market, what you're seeing as far as traction there with insurance companies?\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nYes. And for folks who are new to us, we elaborated a few -- I think it was end of fiscal '19 or '20 on our earnings call in much greater detail, about our approach to the German market. Most of those themes remain true, which is to say that the business model to date that has been deployed by insurance companies in Germany is very different from how we operate in the U.S., U.K., Canada, Brazil, the Middle East, Finland, for that matter, other major markets in which we participate today. The model that we offer is a liquid auction as opposed to a listing service model that exists there today.\n\nAnd we're working with the insurance carriers to effectively convert the market to a different way of doing business. So it's not per se head-to-head competition against the Copart like market participants, but instead a changing of the market altogether. Today, we are selling cars on an agency basis on behalf of seven of the top 10 insurance carriers in Germany. We do not yet have a national account across the entirety of Germany, but we're working closely with insurance carriers.\n\nI think our returns to date have demonstrated the superiority of our approach. We're investing in the land and people, technology, and infrastructure to enable us to provide that service in mass to Germany and continue our progress there. Germany, I think you mentioned, Western Europe, and I think appropriately so, is the biggest and arguably most promising market in Western Europe, but we expect to or aspire to extend our footprint beyond Germany as well.\n\nBret Jordan -- Jefferies -- Analyst\n\nAnd then a quick question on noninsurance. You sort of called out rental and fleet and finance cars. But could you talk about what you're seeing in the dealer market now? Obviously, that was something that has shown some potential a year or two ago. And in addition to the dealer, just sort of a follow-up on that same question, what's been the trend of ASPs in the noninsurance units, obviously, dropping charity and picking up some more of these sort of whole car-type vehicles might be favorable.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nYes. So I'll start with the first question on the dealer business. They are an important constituent for Copart today and have been for years. So we -- our Copart dealer Services business in the U.S.\n\nand elsewhere continues to pursue that business. It won't surprise you that the dealers are short on cars as well these days new and used, but we have nonetheless -- nonetheless, continue to grow our business among the dealer sellers at Copart broadly speaking. Your second question about the ASP effect. I think there is some \"favorable\" mix shift, of course, in combination with what is a robust ASP market overall.\n\nSo I couldn't isolate for you the two effect spread but both are favorable.\n\nBret Jordan -- Jefferies -- Analyst\n\nOK. Great. Thank you.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nThanks, Bret.\n\nOperator\n\nThank you. Our next question is from Ali Faghri with Guggenheim. Please proceed with your question.\n\nAli Faghri -- Guggenheim Partners -- Analyst\n\nHi Jeff and Gavin. Thanks for taking my questions. My first question is on the near-term outlook for total loss frequency since it clearly represents a big headwind to your volume growth right now. Are you seeing any signs of total loss rates troughing and starting to higher again? It seems like we're finally seeing used car pricing normalize and at the same time, vehicle repair costs are also increasing at a more rapid rate.\n\nSo it would seem like the elements are in place to drive total loss rates higher. And I guess, as part of this, how long do you think it would take to get back up to that 20-plus percent rate of total losses we were at coming into the pandemic?\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nI think the transparency, all these, we don't know precisely. Total loss frequency itself, as you probably appreciate, is a lagging indicator because the accidents happen. It takes x weeks for the cars claim to be resolved via a written estimate being provided to the insurance carrier in some cases, discussions or negotiations with the policyholder and owner of the car; in some cases, subrogation from one insurance carrier to another. So by the time the car is totaled, you are weeks after the accident itself occurred and the economic decisions are themselves made on a huge basket of inputs, including what the cars worth intact for the ACV to use a U.S.\n\nexpression or PAV, pre-accident value to use a worldwide expression instead. The repair estimates, as you note, are increasing in price, rental car costs remain elevated as well. And so that basket of inputs is plugged into a formulaic position plus policyholder considerations and whether the insurance carrier perceives that is a desirable outcome from the policyholders' perspective or not. So that's all to say that is complex enough that you couldn't look at any single variable if you had theoretical access to every data point inside of Copart.\n\nIt's not clear what individual metric you look for to see a \"turn\" in total loss frequency. We're confident that will happen as for the horizon and when exactly it reaches then 19%, again, 20% again or 24% someday. It's harder for us to forecast.\n\nAli Faghri -- Guggenheim Partners -- Analyst\n\nGot it. That makes sense. And then as a follow-up, a similar question on the towing cost side. Are you seeing any normalization there yet? I know diesel prices have come lower recently, and I know that's at least one input.\n\nCurious what you're seeing on towing costs more recently.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nI think that's a reasonable observation that the fuel is a part of it, diesel is a part of it. Gasoline prices have softened very meaningfully from the peaks near the beginning of the war. Diesel has moderated less than conventional gasoline but also has moderated as well. So that will ultimately be realized in the form of our towing costs.\n\nAli Faghri -- Guggenheim Partners -- Analyst\n\nGreat. Thanks, Jeff.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nThanks, Ali.\n\nOperator\n\nThank you. There are no further questions at this time. I would like to turn the floor back over to Jeff Liaw for any closing comments.\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nGreat. Thank you, everyone, for joining our fourth quarter call, and we'll talk to you after the first quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGavin Renfrew -- Vice President, Global Accounting\n\nJeff Liaw -- President and Chief Executive Officer, North America\n\nBob Labick -- CJS Securities -- Analyst\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nJoe Enderlin -- Stephens, Inc. -- Analyst\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nBret Jordan -- Jefferies -- Analyst\n\nAli Faghri -- Guggenheim Partners -- Analyst\n\nMore CPRT analysis\n\nAll earnings call transcripts"
}