{
  "companyName": "Clearway Energy, Inc.",
  "companyTicker": "CWEN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/clearway-energy-inc-cwen-q3-2022-earnings-call-tra/",
  "content": "Clearway Energy, Inc. (CWEN -0.22%)\nQ3 2022 Earnings Call\nNov 02, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Clearway Energy third quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Chris Sotos, president and CEO of Clearway Energy, Inc.\n\nPlease go ahead.\n\nChris Sotos -- President and Chief Executive Officer\n\nGood morning. We first thank you for taking the time to join Clearway Energy Inc.'s third-quarter call. Joining me this morning is Akil Marsh, director of investor relations; and Craig Cornelius, president and CEO of Clearway Energy Group, our sponsor. Craig will be available for the Q&A portion of our presentation.\n\nBefore we begin, I'd like to quickly note that today's discussion will contain forward-looking statements, which are based on assumptions that we believe to be reasonable as of this date. Actual results may differ materially. Please review the safe harbor in today's presentation as well as the risk factors in our SEC filings. In addition, we will refer to both GAAP and non-GAAP financial measures.\n\nFor information regarding our non-GAAP financial measures and reconciliations to the most directly comparable GAAP measures, please for the presentation. Turning to Page 3. The company generated CAFD of $154 million in the third quarter and $328 million through the first 9 months of the year. Clearway increased its dividend by 2% to $0.03672 per share or $1.469 on an annualized basis, keeping us on target to achieve the upper end of our dividend growth objectives for the year.\n\nUnfortunately, due to the previously announced operational issues at El Segundo and other items, we'll be revising our 2022 CAFD guidance down from $365 million to $350 million. Clearway continues to advance its growth and strategic initiatives by now having also those capacity fully contracted through 2026, along with Marsh Landing and Walnut Creek. We have closed the Capital Wind acquisition, as well as funded the drop-down of Waiawa Solar with the rest of the previously announced top-down projects on track for commercial operations in the fourth quarter of '22 or early 2023. We are also updating our pro forma CAFD outlook to $390 million from $400 million, which I'll review in a couple of slides.\n\nClearway's long-term steady growth outlook is more transparent than ever with the latest offers from Clearway Energy Group for 1.4 gigawatts of assets, utilizing anticipated $410 million of capital at an approximate 9.5% CAFD yield. As a result of our sponsor's continued development efforts, we also have visibility into additional drop-down offers anticipating in the first half of 2023, leading to the deployment of an approximate additional $220 million of Clearway Energy, Inc.'s corporate capital. Our sponsor's development pipeline also continues to grow, outstanding at 26.8 gigawatts, including 6.8 gigawatts of late-stage projects expected to feature commercial operations in the next 3 years. As a result of these offers, if you see the $750 million of thermal proceeds being deployed by the end of 2024, supporting our greater than $2.15 CAFD per share long-term CAFD outlook.\n\nAt this level of CAFD generation, where we have confident in its ability to grow at the upper range of the 5% to 8% EPS growth target through 2026. In summary, Clearway continues to execute on the deployment of thermal proceeds and additional drop-down assets. That, when combined with the contracted capacity of our California gas assets, we have a very stable platform for continued growth in CAFD and dividend per share. Turning to Slide 4 to provide a bit more color on financial results.\n\nFor the third quarter, Clearway is reporting adjusted EBITDA of $322 million and cash available for distribution or CAFD of $154 million. Year-to-date results came in at $948 million of adjusted EBITDA and $328 million of CAFD. Our third quarter results were negatively impacted by forced outages in the conventional segment. As we previously announced, the El Segundo Energy Center began a forced outage in late August at unit 7 and 8, and after initial repairs returned to service on September 14.\n\nAdditionally, unit 2 at the Walnut Creek facility experienced a less material forced outage in late September. The rest of the facility is currently running at normal conditions while components for unit 2 are being repaired. Majority of the 2022 cash impact related to the El Segundo and Walnut Creek force outages occurred in the third quarter related to lost revenues, but O&M costs will also impact fourth-quarter results. In the renewables segment, therefore, results were lower than the peak of the expectations due to weaker-than-normal renewable conditions across the portfolio.\n\nThis was somewhat offset by the timing of project-level debt service that move in to the fourth quarter. Given the expected full-year impact from the forced outages in the conventional segment, the company is revising its 2022 CAFD guidance of $265 million to $350 million. Regarding the balance sheet, the company continues to have unprecedented flexibility to execute on its growth but are having to form new corporate capital. The excess proceeds with the thermal sale remain available to be allocated to visible future growth from dropdowns, and we continue to expect our pro forma credit metrics to be in line with our target ratings.\n\nFurthermore, our revolver is completely undrawn, and they continue to be insulated from interest rate volatility with nearly 99% of our debt being fixed. Turning to Slide 5 to provide an overview of the company's pro forma CAFD outlook, 2023 expectations, and underlying assumptions in our forecast. In order to explain the various moves in our CAFD expectations, we provide a bridge commencing with our prior previously announced pro forma CAFD outlook of $400 million. The company is updating the pro forma CAFD outlook to account for updated forecast as it results to a variety of pressures across the portfolio, including inflation, plus updates in the Renewables segment, including bases differentials and other portfolio and cost items.\n\nIn aggregate, these various blustery adjustments equate to approximately $10 million, and result in updated pro forma CAFD outlook of $390 million. Moving to the bridge for 2023 expectations for our updated pro forma CAFD outlook. Because our pro forma CAFD outlook is based on five-year average CAFD profiles for new investments, 2023 expectations reflect $10 million less in CAFD than our pro forma CAFD outlook due to the timing of when projects reach operations and the shape of project cash flows, consistent with what we have disclosed previously. This $10 million will come back in 2024 and beyond.\n\nThe next source of variance is the recently announced Capistrano Wind acquisition. As we announced previously, we intend to refinance the existing non-recourse project debt of the asset. However, due to our significant cash balances currently, Clearway believes there is no need to suffer negative arbitrage given limited currently forecasted cash needs for their way between now and the end of 2023, and therefore, looks to refinance Capistrano at the year end of 2023, leading to a $10 million CAFD outlook. As a final bridge to 2023 guidance franchise reflects energy gross margins in the conventional segment based on recent market pricing above the long-term projections in our pro forma CAFD outlook.\n\nWhile our natural gas assets Marsh Landing, El Segundo, and Walnut Creek are fully contracted through 2026 in terms of revenue from resource adequacy contracts, starting in mid-2023, after their initial tolling agreements expire, the three facilities have the ability to generate additional revenue from dispatching into the merchant power market. Based on forward power markets and internal analysis, Clearway currently expects the three facilities to generate energy margin for merchant power markets to be cleaning approximately $20 million of upside in 2023, relative to the long-term merchant energy assumption that underpins our pro forma CAFD outlook. The table to the right outlines the merchant energy assumptions in our pro forma CAFD outlook and $1 per kilowatt month basis. With these adjustments described in the bridge, Clearway is initiating 2023 CAFD guidance of $410 million.\n\nTo close out the guidance and pro forma outlook discussion, it's important to note that the merchant energy margin estimate the conventional segment on a pro forma basis represents only approximately 5% of Clearway's asset-level CAFD. Our pro forma CAFD outlook continues to be primarily underpinned by long-term contracted cash flows with creditworthy counterparties, with future upside to this outlook from the drop-down of additional contracted renewable assets, which I'll discuss on the next slide. Page 6 provides an overview of the latest drop-down offers from our sponsor. As you can see on the left side of the page, these assets are predominantly solar with deployments in Texas and California, and also include utility-scale wind projects in Idaho.\n\nWe also see an expansion of our Rosemont investment with the battery storage asset, which benefits from an expected 15-year capacity offtake, and is well-positioned to capitalize on energy arbitrage opportunities in California related to the late-day ramp in net load. In total, these assets represent a significant investment of $410 million in C1 corporate capital at a strong estimated CAFD yield of 9.5% on the portfolio, which solves the majority of its output under agreements that have an average duration of 17 years. In addition, this investment will further the customer diversification of our fleet with the majority of the offtake with corporations on each of these long-serving entities in California and in Idaho utility. In summary, a drop-down offers from a sponsor provide transparency into the redeployment of the thermal proceeds into a quality, well-diversified and strong CAFD-yielding selection of assets.\n\nPage 7 provides an update to our targeted CAFD per share in excess of the $2.15 that reinforces our long-term view or ongoing the C1 dividend at the upper range of our 5% to 8% long-term targeted growth rate. Starting on our $390 million pro forma outlook that we discussed previously, we add in the latest offers from our sponsor, which assuming binding agreements are achieved, we'll deploy $410 million of capital at a 9.5% CAFD yield as well as our current view around additional and pending offer from our sponsor in the first half of 2023 for $220 million of capital deployment, also at anticipated 9.5% CAFD yield. With these drop-downs and the previously announced acquisition of Capistrano Wind, too have deployed all of its thermal sale proceeds by the end of 2024 with an undrawn revolver available to fund additional capital needs required in the short term. As we described a year ago, when we first announced the Thermal sale, and since we received the proceeds in May, Clearway is now able to demonstrate the utilization of the entirety of these proceeds to drive CAFD per share growth with an investment in high-quality assets at attractive CAFD yields.\n\nTurning to Page 8. Our goals for the year have not changed. We have closed the sale of thermal, we unfortunately must be 2022 CAFD guidance due to the forced holes in our conventional fleet that occurred in the third quarter. Despite this setback, Clearway is still able to increase our dividend per share at the upper range of growth during the year.\n\nIn terms of growth in the future, we have closed on the acquisition of the Capistrano Wind portfolio. More materially, we now have line of sight with our sponsor to the deployment of all the remaining thermal proceeds to drop-down assets over the course of the back half of 2023 and the end of 2024, at strong CAFD yields and contract tenors. This deployment should provide our investors with increased confidence in Clearway's ability to drive CAFD per share growth to $2.15 a share or higher. This does not imply that [Inaudible] stand still in terms of investing for growth and simply wait for this drop-down to close.\n\nWe continue to see opportunities in the market, but we'll continue to be disciplined, and adhere to our earning standards. And finally, we are proud to complete the initial stage of our journey on the natural gas portfolio. We now have 100% of the capacity of our gas leak contracted through the end of '26, and look to engage an additional option in the future to further extend that runway. In summary, Clearway Energy Inc.\n\ncontinues its focus on prudent growth, as confident ability to meet its long-term growth objectives due in part to strong sponsor support to ensure Clearway success. Operator, please open the lines for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Julien Dumoulin-Smith with Bank of America.\n\nJulien Dumoulin-Smith -- Chief Financial Officer\n\nCan you guys hear me?\n\nChris Sotos -- President and Chief Executive Officer\n\nYes.\n\nJulien Dumoulin-Smith -- Chief Financial Officer\n\nSo if I can just come back to a couple of things super quick. First off, with respect to the new growth that you're outlining here. Can we just talk specifically about the existing announcements and what that backs into in terms of specific targets here through that '24 time period? Again, great job on a timely basis, deploying the proceeds. Now you obviously disclosed the 9.5% CAFD yield.\n\nCan you talk a little bit about how this positions you with this as well as incremental targets in this higher rate environment to achieve some of the dividend growth targets in the medium term, not necessarily just in the near term here. Can you talk a little bit about what else needs to be done to achieve it? Because obviously, you've outlined a lot here toward getting there. But I want to make sure against the backdrop of the higher rate environment that where you stand.\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. Not to minimize the question, Julien, but looking at Page 7, really, we don't need to do anything else other than execute the dropdowns and have them performed as anticipated to produce that $2.15 per share. So that's kind of -- looking to Page 7. Obviously, we're using the cash from the Thermal proceeds.\n\nSo maybe to your point, any moves up in interest rates or stock price movements wouldn't affect this baseline number. It would only be incremental deployments beyond these numbers that would be required to hit the $2.15. So I think that was your question.\n\nJulien Dumoulin-Smith -- Chief Financial Officer\n\nRight. Maybe let me hit it more directly with respect to the rising impact of rates. Obviously, both the portfolios financed on a longer duration basis. Can you talk a little bit about liability management? Maybe that's the other side of this that I wanted to ensure here.\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. Yes, we don't anticipate raising any corporate debt to fund these acquisitions, if kind of that's your question. And all of our debt -- 2028 is our earliest maturity, and the other ones are in 2031 and 2032. So we have quite a bit of time before we have any corporate debt that would need to be raised to deal with acquisitions.\n\nJulien Dumoulin-Smith -- Chief Financial Officer\n\nExcellent. And then if I can come back to a couple of the nuances here, just at the highest level. You've got additional energy margin. Can you talk about sort of how that's manifested itself of late here? Obviously, you've been recontracting the assets.\n\nAs you think about how that proceeds, not just in '23 here where you provided the clear walk, how does that evolve through time through '26? And then how does that get to your thinking here about the relative math on '26 extensions and potential further retracting at higher levels beyond that?\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. A couple of different questions there, Julien, hopefully, I'll cover them. So part one, the energy margin we have in 2023 is obviously a bit nonlinear because the different assets come off of their current tools at different times. You also going to know later in the year in July, you've got Walnut Creek earlier in the year in March.\n\nSo what we have is kind of given the current commodity environment and what we see, that additional $20 million that we have in 2023 in terms of our guidance for what we're seeing. If we look on a more normalized basis, what the energy margin we are assuming to derive the $2.15 per share in the long term is between $1 and $1.50 energy margin. So I think for us, we do that $1 to $1.15 in the long term being very achievable. We expect to out-earn that in 2023, even though it's a partial year.\n\nBut once again, as everyone's well familiar, this is kind of our first year operating on a merchant basis. We want to see how the machines operate, how the revenues come in, and then we'll kind of adjust that over time. But from our perspective, in order to hit the $2.15 in long term, we need between $1 and $1.50 energy margin, which we feel pretty good about, especially given where we sit today, empirically in '23.\n\nOperator\n\nOur next question comes from the line of Noah Kaye with Oppenheimer.\n\nNoah Kaye -- Oppenheimer and Company -- Analyst\n\nSo there's a lot here in terms of being able to allocate your remaining capital, and you've got clear visibility now. But I want to ask, post-Iraq, given the additional incentives, whether it's stand-alone storage or green hydrogen production, how are you thinking about investment opportunities in the existing fleet, whether it's repowering, adding storage going downstream. What do you see as the opportunity?\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. I think for us, we kind of use those opportunities before in terms of repowering assets like Elbow Creek and Wildorado. I do think, to be fair to the question, one difficult part about our book is we have a lot of relatively young assets. So kind of repowering might not be the most advantageous.\n\nIt's not as though we've got 2 gigawatts in degree powered in the next two years. So your question is, it's a little bit kind of going through time and you might see years in which we do zero, and then you might see us do 400 for one year and then go back to zero for a couple of years. It's kind of much more episodic then something that's being done consistently where every year we have a repowering. That's just for good or ill, the nature of our fleet because it's relatively young.\n\nAnd to your storage question, I think for us, it's really looking to see what does the existing customer want, right? Obviously, the vast majority of our power is already sold on their contracts, for us to add stores to an existing facility, we obviously need to fill it kind of with power from that system. So it's really dependent on what -- if the customer wants that and those negotiations. So once again, in terms of making those modifications on the existing fleet, we'll kind of see what customer demand is and how that works, but I wouldn't expect some paradigm change here in the next 24 months.\n\nNoah Kaye -- Oppenheimer and Company -- Analyst\n\nOK. That's helpful. And then maybe another sort of post – I have a question. The Clearway Energy Group as part of this announced buyers consortium, to purchase over 6 gigawatts of solar modules expand the domestic supply chain.\n\nWe understand there's a lot of good reasons to do that. How do you think about currently your supply chain needs, your ability to procure that from domestic sources qualifying for bonus content? And how that factors into the development outlook in the pipeline?\n\nChris Sotos -- President and Chief Executive Officer\n\nCraig, why don't you take that?\n\nCraig Cornelius -- Chief Executive Officer, Clearway Energy Group\n\nYes. Thanks for the question, Noah. Yes, we're pretty excited about what the implications are going to be for the broader U.S. market as we get into the mid-decade, and also for the objective that policymakers have in wanting to domesticate more of the supply chain, that fulfills construction of solar, wind and storage assets.\n\nThat excitement informed by detailed engagements we've been having with our framework supply chain partners really going back over the last year and a half. And what I expect is that the treasury guidance formulation process will be influential here in getting manufacturers ultimately to greenlight investments that start to be publicly announced. But the work that will underpin those announcements is very much happening right now. And we're pleased that as we work across the solar supply chain, the battery supply chain and the wind supply chain that the suppliers we engage with are preparing thoughtful concepts that will minimize risk and maximize value as we look at the fulfillment in the mid-decade, and we have solutions that we're planning for deployment in that time frame around each one of those component technology types.\n\nOperator\n\nOur next question comes from the line of Mark Jarvi with CIBC.\n\nMark Jarvi -- CIBC World Markets -- Analyst\n\nI just wanted to touch on the CAFD yield on the drop-downs. Previously, last quarter, you guys were going to 8.5%. Now it's 9.5%. Obviously, interest rates are moving.\n\nJust update us in terms of how you're thinking about what's guiding the parameters on CAFD yields and hurdle rates right now in terms of you making decisions on the dropdowns.\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. I think for us, and in negotiation with our sponsor, I think, obviously, they're well aware of where the capital markets have moved. So between the two of us, and a lot of people ask about sponsor support sometimes. To be the most linear and empirical way to see that is a strong CAFD.\n\nI think for us, our sponsor recognizes the change in capital markets that have occurred since our last earnings call for that matter, and in negotiations with them about where we think the CAFD should be, they indicate a higher numbers where they think is fair. Obviously, we'll do diligence and the like through the assets and hope to come up with a binding agreement, but it's obviously very constructive from the sponsor support level to have that different CAFD. As I've talked about before as well, though, it's important to highlight that part of CAFD yield is also dependent -- not all CAFD are the same. Is the asset more solar weighted or wind weighted? Is it a shorter duration PPA tenor or longer.\n\nAnd so from our perspective, given that a lot of the book of business is in solar, and also that the contract duration -- the majority of it is on a fairly long duration, of about 17 years. We feel very good about the 9.5% CAFD yield that's been offered. But once again, all subject to diligence and are working through our independent process.\n\nMark Jarvi -- CIBC World Markets -- Analyst\n\nAnd then just when you think about that, like is it just a spread versus bond yield is like a CPM approach? Like just kind of maybe digging in a little bit in terms of how you guys are deciding what sort of a fair number as reference rates move around here.\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. From our perspective, we actually look at it much more versus equity because that's the -- in order for me, I think, to have a conversation with you about why not to buy back equity versus invest in new sub of assets. We really compare it versus our equity yields most generally. Obviously, bonds are important as well.\n\nI'm not going to pretend that. But to answer your question, it really is spread versus equity. Because to me, whenever we make an investment at Clearway, I would like to be -- for you to be able to see that that's a good investment based upon where it trades versus our equity.\n\nMark Jarvi -- CIBC World Markets -- Analyst\n\nThat makes sense. And then just turning toward some of the assets you're adding here in Texas. Obviously, with the PTCs being for -- or solar being [Inaudible] for PTC, a bit more concerned about negative pricing and basis risk. Just thoughts around those assets, the risk around basis risk and then updated outlook.\n\nI guess you guys talked a bit about potentially more basis risk. So your view just around that and the impact of PTCs for solar assets.\n\nChris Sotos -- President and Chief Executive Officer\n\nSure, I'll start and then, obviously, Craig can fill in anything from his perspective. I think from my view, we see a little bit of basis, that's one reason for a component of the tenant in the near term. the new contracts should really eliminate a lot of that risk in terms of how they are. They're not financial hedges, for example, they're kind of more traditional tools at settling out a node.\n\nSo from our perspective, we think in the new portfolio, we shouldn't really see -- zero is always a good number, but we really didn't see a lot of basis risk. Yes, we have seen some of that in the portfolio. We think part of that is due to the stressed economic commodity environment. That's why we included it in our $390 million number.\n\nBut Craig, I don't know anything to add there.\n\nCraig Cornelius -- Chief Executive Officer, Clearway Energy Group\n\nYes, sure. First, for the drop-down offers that have been made, every revenue contract has no settlement on the portfolio of assets here. So there's no hub-settled contracts in that portfolio of assets. It's not to say that there might be some circumstances in the future where we construct projects with Hub-settled PPAs.\n\nBut clearly, given the kind of transformation the U.S. electric grids going through, as we do that, we want to be doing that in conjunction with also putting in place effective contractual mitigants for potential changes in basis over time. So firstly, for this portfolio of assets, the settlement structure on them eliminates any basis risk by their very nature. And then second, to Chris' point, for a portion of the capacity of the solar assets in ERCOT, they've been designed, both in their location and the fraction of them that's merchant to offset basis risk on the existing wind assets that exhibit, the pattern Chris mentioned in the high-commodity environment right now.\n\nSo once completed, we think that solar project and another that's in the set of drop-down offers we intend to make in the first half next year are going to help balance the book where that basis exists, which is candidly quite minimal in relation to the overall fleet size. And I think going forward, we feel pretty good about the way that we're able to select from the 27-gigawatt pipeline that we're advancing. Based on the markets where we're creating projects, the contracts that we shape and the analysis of the portfolio as a whole that we've built that we can maintain a portfolio of operating assets that exhibit a low-risk profile in relation to things like basis and merchant price formation.\n\nOperator\n\nOur next question comes from the line of Justin Clare with Roth Capital Partners.\n\nJustin Clare -- ROTH Capital Partners -- Analyst\n\nSo just first off here, given the location of your committed assets, it looks like the PTC could potentially be more valuable than the ITC. Just wondering if there's been any changes from the ITC to the PTC for any committed projects, or any changes in the capital structure that might result from this? And then there's also the availability of the higher level of the ITC now. So just wondering if that has impacted anything as well.\n\nChris Sotos -- President and Chief Executive Officer\n\nYes. I think I'll let Craig kind of address that. But the one part I think is important is all of those changes are kind of encapsulated in the CAFD yield that is part of the offer. So I think the changes that Craig's development team has kind of had to work through as a result of the IRA and different moves.\n\nThat's kind of encapsulated in the offer that's being made. So those changes wouldn't necessarily affect the 9.5% that we're targeting. But Craig, I don't know anything to add?\n\nCraig Cornelius -- Chief Executive Officer, Clearway Energy Group\n\nYes, sure. So for the projects that were committed already before this most recent set of drawdowns, we've not elected to change from an ITC to PTC. Part of that is informed by what helps position us to create the most value for the asset as we drop it down, and also offset cost inflation that's existed elsewhere. So for one asset, for example, it was located in an energy community, and so that provided some ITC uplift, and that helped us offset cost inflation that's been experienced over the course of the last few years.\n\nFor the most recent set of drop-down offers that were made to those solar projects will elect the PTC, and that's part of what allows us to convey these assets at a higher CAFD yield, and also with more investable cash flow for the YieldCo. And in conjunction with electing the PTC, we've also sought to design revenue contracts so that the same type of contractual features that we've made use of historically in the wind industry on projects that elect the PTC will be there also. And I think being thoughtful about how to do that is something that we're glad we're doing, and we think every soundly operated sponsor will and should do the same. So we're excited about what the PTC election can mean in high solar resource environments when it's put to work in the right way, both in terms of what it can mean for our customers and the value we create for them and also what it can mean for the growth of cash flows in our Yieldco.\n\nJustin Clare -- ROTH Capital Partners -- Analyst\n\nOK. Great. That's really helpful. And then one more.\n\nWith the Total transaction closed here, just wondering if you could talk about when you might be offered potential drop-down opportunities from Total. And then -- could that happen as soon as next year? And is there a potential for upside to your CAFD for next year if you see attractive opportunities?\n\nChris Sotos -- President and Chief Executive Officer\n\nI think it will take some time to work through that the Total book. We closed fairly recently, and kind of working through their book of development assets. I think it'll take some time to get clarity. To Craig's -- kind of to your earlier question, Craig's team has done a lot of structuring through the IRA to come up with results that are helpful from a YieldCo perspective.\n\nIt's Total and their structuring is kind of working through different parameters. So we kind of have to come together and see what we have. But I think -- too early to say is the simple answer to your question, but I think we'll definitely look to see if there's anything that can work within this sell platform going forward, but too early to say is the simple answer.\n\nOperator\n\nOur next question comes from the line of Keith Stanley with Wolfe Research.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nFirst, I just wanted to clarify on the 2023 CAFD guidance, what you're assuming for debt service on El Segundo. I know it had that bullet maturity issue. Just how you're dealing with that for guidance in terms of interest and payments for that asset?\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. We're looking to pay that down at year-end -- this year end, beg your pardon. Because to the point that was liability we're going to take on balance sheet anyway due to its bullet. And so for us, that's part of our CAFD guidance is the repayment of that at year end of this year.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nSo you're in -- OK. So you're adding -- you are including the paydown of that maturity within the '23 guidance, or that's part of 2022?\n\nChris Sotos -- President and Chief Executive Officer\n\nBecause it's a prepayment, it doesn't come as part of CAFD or making a voluntary decision to do it. So it's not a down arrow, so to speak, in '22. And in 2023, obviously, whatever debt service would have been part of '23. Like the whole [Inaudible] wouldn't have been in there even as part of normal guidance, it wasn't in 20 -- it's not in '23 either because of the prepayment in '22.\n\nI'm sorry.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nOK. separate question for Craig. Just any comments on what you're seeing with UFLPA and flow of modules into the country?\n\nCraig Cornelius -- Chief Executive Officer, Clearway Energy Group\n\nYes. We're doing fine with it. In order to kind of elaborate though a little bit about the broader landscape. Compliance with USLP is something we feel pretty well positioned around, in particular, just because of the focus we've had on procuring from supply chains in anticipation of the succession of trade actions that have unfolded in the course of the last couple of years.\n\nWe're pretty deeply engaged in policymaking in the U.S., and we look for that to kind of inform our view of where we need to go with our business broadly, and certainly in terms of procurement. And so far, that served us well. the estimated CAFDs presented in today's earnings material for future drop-downs all reflect our anticipation that we'll be able to successfully comply with UFLPA because of the supply chains we procured from. So there's the possibility that there would be temporary confirmatory holes of the border for industry participants broadly which are in place today, but we think it's a pretty manageable risk for us just because of the fact that we have modules coming in freely today because of who we bought from and where their supply comes from.\n\nAnd to the extent that any confirmatory hold were to occur, we feel quite comfortable with our ability to tender documentation that as that the product can come into our country in compliance with the statute. And just to reinforce that, we have no modules being currently changed. So with that said, the establishment of a more practicable enforcement regime for UFLPA is very much an issue that needs to be front and center for the U.S. government.\n\nThe leadership across the applicable government bodies just needs to put a port in a position where they can be successful because the quantities of equipment that are going to be coming into the country to meet the needs of the power grid and climate goals are dramatic. And the documentation requirements to enable imports just needs to get more clear and more standardized. But there's, I think, quite a lot of conversation going on around just that, and I am optimistic that the industry and the government together will figure out a way for this to function effectively going forward. But for our vantage point as Clearway, we're in good shape.\n\nAnd I think as we have been with other supply chain choices we've made, I think the choices we've made in anticipation of the UFLPAs enactment are serving as well.\n\nOperator\n\nOur next question comes from the line of Michael Lapides with Goldman Sachs.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nJust probing a little bit on 2023 guidance. And I'm going to ask for a little bit more detail whether you're going to now or give it in the early part of next year. You give us CAFD, super helpful. Can you do the walk from EBITDA to CAFD for us, please? What's the EBITDA -- or kind of range of EBITDA relative to what you're delivering in 2022? And then what are some of the bigger lumpier items? I'm trying to think about principal debt repayment at the project level, maintenance capex, maybe interest? And if there's anything else I'm leaving off to let me ask.\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. [Inaudible] Yes, Page 22. Michael, in terms of the deck we have, which has the adjusted EBITDA of the [Inaudible] for your question around EBITDA. Yes.\n\nSo I think, and that has principal amortization and maintenance capex, I think that has the components you're looking for.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nYes. Got it. OK. Just can you bridge us though 2022 EBITDA to 2023 EBITDA?\n\nChris Sotos -- President and Chief Executive Officer\n\nYes. I mean, not off the top because the PPA roll off -- obviously because you have the high-priced tolls in '22. And then you have a combination of different tools rolling off at different times in '23, plus the energy gross margin from the renewable -- from the open position coming in. So that's a little tough to bridge '22 to '23.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. Totally makes sense. And then on the principal debt amortization, can you remind me with that $300-some million. What are the bigger assets where that paydown is occurring? Is it mostly the California gas plans, although your comment back probably eliminates El Segundo, or is it widely spread across the entire fleet?\n\nChris Sotos -- President and Chief Executive Officer\n\nYes. You can look on Page 16 for that. So to your point, the California Natural gas, other [Inaudible] are a big part of that. And then you've got [Inaudible] and some others.\n\nSo that's all on Page 16.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. OK. Finally, can you come back to cost of capital a little bit. And you made the comment about how you think about drop down or CAFD yields versus share buyback.\n\nHow do you -- can you guide in a little further how you calculate what your own cost of equity is?\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. For us, and I'll draw a distinction between our weighted average cost of capital and a CAFD yield, which is obviously a lot more transparent. You're obviously dealing with betas and the like for way to have cost of capital. But for CAFD yield, it's kind of, frankly, a little bit.\n\nI think that the market trades us probably somewhere between or $2.15 CAFD estimate and where we are currently $1.98, $1.93. So in general, that yields -- I didn't look at the stock price, it's not open yet, but as of yesterday, that's probably yielding somewhere in the 6s. So that's kind of how I view where we're trading so that when we talk with our investors and say, I believe that drop down is a good investment, you can look at the spread of that 9.5% in the example we're using now, versus that somewhere in the 6s depending where you think we trade and that's a good basis for analysis.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nNo. And I don't disagree with that, and that's super helpful. I would just be curious if you were to issue new HoldCo debt today. would you be issuing hundreds and hundreds of basis points below six.\n\nOtherwise, that would imply very little compression or very little spread between your cost of equity and your holding company cost of debt, which is I don't know, given the higher rate environment feels a little unusual for any company.\n\nChris Sotos -- President and Chief Executive Officer\n\nYes. I think our bonds are probably trading a little bit in line with those numbers, depending on which day you asked the quarter which we given the positive environment. We're probably in a high 6s probably the last print I saw on the 32s. So I think the debt and equity markets are pretty close in terms of interest and will we trade on a forward CAFD yield basis from that perspective.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nBut what that basically implies is you almost think your cost of debt and your cost of equity are the same.\n\nChris Sotos -- President and Chief Executive Officer\n\nYes. Although to be fair, the $2.15 is a forward number versus the other. So you know as well as I that plays in everyone's thinking, but I don't think they're that differently apart if that's a different way to answer your question.\n\nOperator\n\nOur next question comes from the line of Angie Storozynski with Seaport.\n\nAngie Storozynski -- Seaport Global Securities -- Analyst\n\nDo you have any contribution from the Capistrano in included in your original CAFD guidance?\n\nChris Sotos -- President and Chief Executive Officer\n\nFor '22, no, we did have an approximate like -- because we know exactly when it would close, and it's only part of the year. For 2023 and going forward, I believe we had assuming that we relevered it, there's a delta of 9 or 10. That's why we have the uplift in '23 because we're waiting until year end to refinance it.\n\nAngie Storozynski -- Seaport Global Securities -- Analyst\n\nOK. And then separately for the energy margin, do you guys have any energy hedges or any financial hedges for El Segunda for '23?\n\nChris Sotos -- President and Chief Executive Officer\n\nNo. Other than the toll that exists in the RA capacity contract. But no, there's no energy margin hedge currently. It's an open position.\n\nAngie Storozynski -- Seaport Global Securities -- Analyst\n\nAnd then lastly, there was a lot of discussion about the cost of debt. And you mentioned that you're not issuing any HoldCo debt to finance at least the future goals for the next couple of quarters. But what is the cost of project-level debt right now? Or at least how much it has risen so that we can calculate the delta between your cost of capital and this new CAFD yield?\n\nChris Sotos -- President and Chief Executive Officer\n\nI do think, to be fair to your question, obviously, the CAFD yields we quote are after all those costs, right? So they take into account the cost of project debt, not before. So not to minimize the question, but when we talk about a CAFD yield, that's after that amortization regrows what those costs are. I think for us, there's probably not been a big delta in the credit spread, it's probably more on the underlying what the swap to fix is under LIBOR or SOFR. But Craig, I don't know if you have any color in terms of what you're seeing there.\n\nCraig Cornelius -- Chief Executive Officer, Clearway Energy Group\n\nYes. I mean I think we've seen, first, for all the drop-downs we planned through '24, we put in place interest rate protections some time ago. And so those are sort of help -- those are enabling the type of drop-down economics that you're observing here, both in the set of offers we've just made, the preservation of the returns on the assets that were committed previously and also the offers we expect to make in the first half of next year. And then as we look forward, we've seen some compression in spreads.\n\nThe sort of benchmark 10-year is a very observable number for you, Angie. And in general, what we've been looking to do as we finalize revenue contracts on assets is to put in place interest rate protection so that any debt financing we plan to put on either for the construction period or the term already anticipates the cost of debt on a long-term fixed basis and supports a CAFD yield that's accretive for the YieldCo. So for us, at the sponsor level, the job now to do is as we market power to customers, we need to anticipate what the forward cost of debt is going to be when we do lock it in contemporaneous with the revenue contract signing. And what we're observing is that we can still provide compelling value to customers even with the cost of debt having risen.\n\nAngie Storozynski -- Seaport Global Securities -- Analyst\n\nOK. Perfect. I just wanted to go back to this Capistrano Wind portfolio because I would have expected that at least some contribution from that asset -- that set of assets would have -- well, contributed to your 2022 CAFD. So is there some other offsets, it's just the unplanned outage of the gas plant.\n\nI mean, I know that you mentioned the weakness in the wind resource. But again, I mean, doesn't seem like there's any addition from that set of wind farms?\n\nChris Sotos -- President and Chief Executive Officer\n\nWe're only going to own it for a quarter, Angie. So it's single-digit millions. So it's a small rounding number within the whole thing, right? It's -- is it contributing? Yes. Is it a very small number we're not reconciling? Yes, because it closed here in the third, fourth quarter.\n\nOperator\n\n[Operator instructions] Our next question comes from Antoine Aurimond with Bank of America.\n\nAntoine Aurimond -- Bank of America Merrill Lynch -- Analyst\n\nJust quickly on the credit side. Just curious if you can give us a bit more detail on what's your leverage position right now at a corporate level, and how does that compare to your targets as well as I wanted to reiterate whether there would be no corporate capital needs through 2026, if I understand correctly.\n\nChris Sotos -- President and Chief Executive Officer\n\nSure. So two parts. I think right now, I'm just not deploying the full amount of cash. Our debt -- corporate debt to corporate EBITDA is about 4.85 plus/minus on a pro forma basis, assuming we deploy some of that, it's about 4.4.\n\nSo within our 4 to 4.5 we've talked about, obviously, you got a high cash balance currently. To your second question, 2026 is probably a little bit too far, right? For us, the dropdowns we talked about are through the end of '24. However, keeping in mind, if we issued any debt, obviously, we'd only intend to do so to drive the $2.15 higher, etc. So I think that we don't need any capital through '26.\n\nThat's a little far. What we said is that the capital to effectuate the drop-downs that we've just talked about through 2024, don't require any additional capital.\n\nAntoine Aurimond -- Bank of America Merrill Lynch -- Analyst\n\nGot it. OK. That makes sense. And then lastly, sort of looking at Slide 16, there's quite a big step-up in nonrecourse have more for Solar assets starting in 2024.\n\nJust curious how you're going to manage that and any potential impact on CAFD generation?\n\nChris Sotos -- President and Chief Executive Officer\n\nYes. To be fair, that's a step-up in the $14 million to $148 million, that's probably in the middle of the page. We'll intend to refinance some of that 148, obviously. There's a bullet there.\n\nWhile we try to have everything amortized obviously, in some cases, we buy books that have kind of a mini perm with your seven years after COD. That's one of those examples. So some portion of that $148 million will look to refinance.\n\nOperator\n\nAnd I'm currently showing no further time left [Inaudible] Chris Sotos for his closing remarks.\n\nChris Sotos -- President and Chief Executive Officer\n\nThank you. And once again, thank you for everyone's time, and I appreciate your support. So take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Sotos -- President and Chief Executive Officer\n\nJulien Dumoulin-Smith -- Chief Financial Officer\n\nNoah Kaye -- Oppenheimer and Company -- Analyst\n\nCraig Cornelius -- Chief Executive Officer, Clearway Energy Group\n\nMark Jarvi -- CIBC World Markets -- Analyst\n\nJustin Clare -- ROTH Capital Partners -- Analyst\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nAngie Storozynski -- Seaport Global Securities -- Analyst\n\nAntoine Aurimond -- Bank of America Merrill Lynch -- Analyst\n\nMore CWEN analysis\n\nAll earnings call transcripts"
}