{
  "companyName": "Lumen Technologies",
  "companyTicker": "LUMN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/lumen-technologies-lumn-q3-2022-earnings-call-tran/",
  "content": "Lumen Technologies (LUMN -1.51%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to Lumen Technologies third quarter 2022 earnings conference call. During the presentation, all participants will be in a listen-only mode. Afterwards, we will conduct the question-and-answer session. [Operator instructions] As a reminder, this conference is being recorded Wednesday, November 2, 2022.\n\nIt is now my pleasure to turn the conference over to Mike McCormack, senior vice president, investor relations. Please go ahead.\n\nMike McCormack -- Senior Vice President, Investor Relations\n\nThank you, Franz, and good afternoon, everybody, and thank you for joining us to Lumen Technologies third quarter 2020 earnings call. Joining me on the call today are Jeff Storey, president and chief executive officer; and Chris Stansbury, executive vice president and chief financial officer. Before we begin, I need to call your attention to our safe harbor statement on Slide 2 of our third quarter 2022 presentation, which notes that this conference call may include forward-looking statements subject to certain risks and uncertainties. All forward-looking statements should be considered in conjunction with the cautionary statements on Slide 2 and the risk factors in our SEC filings.\n\nWe will be referring to certain non-GAAP financial measures reconciled to the most comparable GAAP measures that can be found in our earnings press release. In addition, certain metrics discussed today exclude cost for special items as detailed in our earnings materials, all of which can be found on the Investor Relations section of the Lumen website. With that, I'll turn the call over to Jeff.\n\nJeff Storey -- President and Chief Executive Officer\n\nThanks, Mike. Good afternoon, everyone, and thank you for joining us. As you know, this is my last call as Lumen's CEO. I want to begin today's call by welcoming Kate Johnson as our new CEO.\n\nKate starts Monday. I think she is an exceptional leader with strong skills, commitment to customers in the direct pragmatic nature. Within Lumen, we are all excited to have her join the company and have high expectations of the great things she will accomplish. These are obviously very dynamic times in the broader market, in our industry, and for our company.\n\nAnd while we have not accomplished all that I would have liked, we have accomplished quite a lot, and I pass the baton to Kate in confidence that the foundation we have built, the dedicated team we have in place, and the refreshed energy of new leadership puts Lumen in a great position to deliver on its objectives of driving growth and creating long-term shareholder value. At the outset of this call, I want to say a word about the Lumen team, all of whom have been on a challenging, yet exciting journey during the five years since Lumen was formed following the acquisition of level 3. In my final days as CEO, I want to tell you and our employees how extraordinarily proud I am with our team. I've seen them rise to every challenge with confidence, pride, and commitment to each other and our customers.\n\nThe first example is certainly their response to COVID. They attacked the challenges with tenacity and determination. Throughout the pandemic, we had 10,000 or so employees that continued to work from home, safely doing their jobs, and 10,000 more that were remote with just a few days' notice. Together and within the first few weeks, they turned out the many emergency augments our customers needed for their own remote workforces.\n\nWe all know we stayed in that environment much longer than we had hoped, but the Lumen employees performed throughout. As I think of all that they've accomplished over the last five years, it really is remarkable. I appreciate the excellent work they did integrating two large businesses and digitally transforming our company. Between the two efforts, we enhanced our customer experience and realized close to $1.7 billion in synergies and transformation savings.\n\nThis summer, they completed the $2.7 billion LATAM transaction. In October, they completed the $7.5 billion ILEC transaction, focusing our Mass Markets business on high growth and more densely clustered markets. And we announced today that we have entered into an exclusive arrangement for the proposed sale of our EMEA business to Colt for $1.8 billion. As the most recent example of our team's focus on our customers and their talent for delivering, I want to acknowledge their work in the aftermath of Hurricane Ian.\n\n98% of our high-speed Internet customers were back online and connected within three weeks. Our thoughts and efforts remain with our employees and customers who were affected by this event. That's all of great work. I'd like to talk more specifically about our digital transformation and the foundation we laid for our business going forward.\n\nDigital transformation is not a destination, but it's a journey. I'm very pleased with the significant strides we've made in driving simplicity and automation into our business. We are now easier to do business with, have greater efficiency, and are evolving the way our customers interact with and experience our capabilities. Our customer experience is better than ever and continues to improve as demonstrated by our very high NPS and customer e-scores for both Quantum Fiber and the upper end of our enterprise customer base.\n\nAlthough not yet where we want to be, our results with our mid-market customers clearly show we're making progress there as well. As I say to our team all the time, we have much more to do, and I'm incredibly proud of their accomplishments so far. Top-line growth is our principal focus, but we cannot overstate the importance of these transformation efforts in delivering the experience our customers want and driving the efficiencies we need to grow the profitability of our business. First, we'll discuss the details of the third quarter.\n\nBut before he does that, I want to spend some time offering my perspective on the two big announcements we made today. Modifications to our capital allocation policies and today's announcements regarding our EMEA business. We will reserve time after Chris' remarks for your questions. First, the capital allocation discussion.\n\nEarlier today, we announced that we are eliminating our dividend and instituting an up to $1.5 billion two-year share buyback program. I want to be clear that Kate, the board, and I are aligned on this action. This is obviously a big decision that we have carefully considered. The one we believe is the right long-term decision for our business.\n\nThe benefits of reallocating capital from the dividend are significant for our growth plans, our balance sheet, and our ability to use our free cash to unlock longer-term value through share repurchases. First and foremost, our new policy should remove any questions you may have about the capacity to invest in the growth of our business. Growth has always been and will continue to be our key imperative, and this decision makes our ability to fund that growth clearer than ever. You frequently asked questions about the dividend.\n\nAnd we've generally said the same thing in response to your questions. Returning value to shareholders is a key priority for Lumen, and we believe the dividend is an appropriate value delivery mechanism. But we've also said that our board regularly reviews whether that approach remains aligned to the current circumstances. When we announced the $7.5 billion ILEC transaction last year, we specifically said that the board would assess our capital allocation policy in the wake of that transaction.\n\nThat transaction completed on October 3, and today's announcement reflects the output of that assessment. We believe that the current market value of our shares dictates that the long-term value creation is better realized through share repurchases rather than the payment of a dividend. As I said, we have authorized an up to $1.5 billion two-year program, and believe it is more attractive to retire shares at today's prices than to pay dividends at today's yields. We have long supported the dividend as a good vehicle for value delivery, but at today's stock price, that is no longer the case.\n\nWe expect to opportunistically repurchase shares over the life of the program. Although our debt maturities over the next several years are very manageable, the elimination of our dividend also provides the company greater flexibility in what promises to be an increasingly unpredictable credit market. Over the last five years, we have significantly improved our balance sheet, eliminating more than $16 billion in debt, and reducing annual cash interest expense by more than $1 billion, and extended most maturities to 2026 and beyond. That said, we do not favor using long-term leverage as a principal source for growth capital.\n\nAgain, this is a big decision on which we've spent a great deal of time, and that in current circumstances, we believe shores up the foundations of our growth, provides increased financial flexibility, and is solidly in the best long-term interest of our company and its shareholders. Let me cover some of the details on the EMEA announcement. We announced today that we have entered into an exclusive arrangement for the proposed sale of our EMEA business to Colt for $1.8 billion. This represents a very attractive multiple of approximately 11 times for Lumen's EMEA business and would create additional value for our shareholders.\n\nIncluded in the sale are substantially all of Lumen's EMEA-based network assets and associated commercial contracts. Lumen and Colt are also entering into a long-term strategic partnership that will allow us to access each other's networks to serve enterprise customers requiring local connectivity in our respective markets. As we did with Cirion and Brightspeed, creating an exceptional partner is very important to us. I'm excited about this transaction and believe Colt will be the excellent partner we need to serve our customers moving forward.\n\nAs was the case in the LATAM and the ILEC transactions, the EMEA announcement allows Lumen to receive attractive valuations for the assets and operations, focus our investments in our key growth markets and establish excellent partners in the areas where we've divested these businesses. We expect these proposed sales close as early as late 2023 pending customary regulatory approvals. A quick word on Brightspeed transaction, which closed earlier this quarter. I would like to take a minute to acknowledge the tremendous work, both teams did supporting the Brightspeed conversion.\n\nIt would be difficult to overstate the heavy lift our folks and the Brightspeed team took on in transitioning these 20 states to Brightspeed's operating environment. It's a great example of our ability to do difficult and complex things. I want to wish Brightspeed the best as they begin their journey to deliver high-speed fiber services in these markets, which will benefit greatly from their investment and strong management team. Before I turn it over to Chris for some details on the quarter, I want to take a minute to share my view of how Lumen is positioned as we transition to Kate's leadership.\n\nThe coming together of CenturyLink and level 3 marked a similar moment in our company's history, creating one of the world's largest, most advanced, and critical networks. At Lumen, we have built a platform that allows us to meet the networking and communications needs of the most sophisticated enterprise customers. We have enhanced the power of our point network service offerings with a range of cloud, security, and collaboration solutions. And more recently, have invested, upgrade, and transformed our central offices into many data centers, further enabling what everyone now knows as the Lumen Edge Cloud.\n\nWe have a powerful and robust fiber network complemented with an increasingly deep set of adjacent capabilities like orchestration, interacting with our customers' businesses via machine-to-machine applications rather than phone calls or emails. The market for these capabilities is still in the early stages of growth that I believe the foundation to Lumen to be a market leader has been laid and the opportunity for growth is significant. On the Mass Markets side, we have ramped our investment in the Quantum Fiber footprint and our all-digital service delivery platform. We've doubled the number of new enablements per quarter over last year.\n\nSo, let me be clear, we are not yet at the pace of build we expect or want. We will continue to ramp our enablements and overcome the supply chain, labor, and inflationary constraints we've seen. We have strong conviction with focusing on growing markets where we can create dense urban clusters and supporting all of the communities within those clusters is the best approach to maximize our investments and significantly expand the reach of our Quantum Fiber offering. As Chris will share, we are very focused on driving customer penetration over that extended footprint.\n\nWith divestitures of the ILEC business in 20 states, serving mostly rural customers, the divestiture of the LATAM business, today's EMEA announcement, and the divestiture of our legacy colo business, we've been consistently optimizing our assets to focus on the opportunities in which we have the ability to invest, grow and be a market leader. We expect to continue to optimize, focus and align our asset base with our growth opportunities. These value-accretive transactions, together with the capital allocation changes we are making today, provides the company significant flexibility to invest in new growth opportunities, maintain a strong balance sheet and execute on our share repurchase program. We are at a turning point in Lumen's history, where data and AI will transform society and business.\n\nI believe Lumen is well-positioned for success in a world of such rapidly evolving technology. With some of the world's strongest assets, operations, and human capital, all delivered as a platform for the needs of the modern business and for how today's consumers live and work with connectivity. I'm proud of having led the Lumen team during the integration and transformation of our company. I'm obviously not, but I feel like one of the founders of the company.\n\nThat's how the team has approached the past five years. We've been building a new company, not merely making incremental improvements to be old. I'm very excited to welcome Kate and believe she is the right person to take Lumen to the next level and continue our path toward top-line and bottom-line growth. Now as a shareholder like all of with you, I look forward to Lumen's continued success.\n\nWith that, I'll turn the call over to Chris to discuss our third-quarter results in more detail. Chris?\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nThank you, Jeff, and good afternoon, everyone. I want to start by recognizing Jeff for the significant contributions he has made to Lumen and its predecessor companies. As Jeff mentioned, since the level 3 merger in 2017, we have reduced debt by approximately $16 billion, sold our LATAM business for about nine times EBITDA, sold our ILEC business for approximately five and a half times EBITDA and announced today that we have entered into an exclusive arrangement for the proposed sale of our EMEA business to Colt for $1.8 billion. This represents a very attractive multiple of approximately 11 times EBITDA, and most importantly, Jeff has positioned our company well as we drive to profitable revenue growth.\n\nJeff, I know I speak for the entire Lumen family when I say thank you. This year marks one of great progress in transforming our business. During 2022, we completed both the LATAM and our much larger ILEC divestiture. As our teams honored the foundation created and experiences learned over the years under Jeff's leadership, we are excited to have Kate join the team in just a few days.\n\nShe brings tremendous leadership skills and deep technology experiences to help drive Lumen on the next step of our journey. As you think about portfolio optimization, it is an ongoing process that the board evaluates regularly. Our goal is to maximize shareholder value, highlighted by the EMEA announcement today, and we will continue to evaluate future portfolio-related opportunities. As you know, Kate joins us on Monday, and she will develop her thoughts related to any needs within our portfolio of products and assets, as well as any products or assets that she may deem nonstrategic.\n\nMoving on to reporting, we're sharing a few new items this quarter, including a view of direct margin by our new business product reporting, as well as pro forma historical financials, excluding the impacts from our divested LATAM business and CAF II to help you align your models. The size and scope of the recently closed ILEC divestiture dictates that we will provide a more wholesome view of our pro forma financials when we report our fourth quarter results. Let me move on to discuss some macro thoughts, as well as some 2022 closed deal-related model impacts. We continue to face macro headwinds, and we are actively working to address these challenges through cost reduction and other initiatives.\n\nSupply chains are strained with labor as the key headwind, and we are all facing the impacts of inflation. That said, we expect to end the year toward the low end of our adjusted EBITDA guidance range. Recall that we slowed some of our transformation efforts as we stood up Cirion and Brightspeed. But with those transactions now closed, we will reenergize our efforts in digital transformation.\n\nWe estimate that our full year 2022 EBITDA will be impacted by approximately $100 million related to inflationary pressures. Before discussing third-quarter results, I would like to provide a more calibrated jump-off point as we near the close of 2022. If you combine the divested LATAM business, the ILEC 20-state business, and the CAF II benefits we received in 2022, which won't recur in 2023, the total EBITDA impact would be approximately $1.4 billion. We will update you in future quarters if there are any additional CAF II-related reserve releases, and we will provide more detailed 2023 guidance when we report our fourth-quarter results.\n\nWith that, I will move to the financial summary of our third quarter. We are very pleased to have closed both the LATAM divestiture in the third quarter and the ILEC divestiture on October 3. These divestitures improved our revenue mix, our strategic focus, and we received approximately $7 billion of net discretionary cash proceeds. As you know, we've been active in the market tendering for debt and expect a reduction in our overall debt as we close the year.\n\nAlso, recall that we conveyed approximately $1.5 billion of debt to Brightspeed upon closing the ILEC transaction, and that is in addition to the net cash proceeds I just mentioned. Also, be aware that these transactions caused a taxable event and we expect to pay approximately $900 million to $1 billion of tax during the first half of 2023 related to these transactions. This tax impact will be included in the overall cash tax guidance for 2023, which we expect to share with you when we report our fourth-quarter results. As we review our third quarter results, I want to highlight that in our trending schedule, as I mentioned, we have provided our pro forma results, excluding the financial impact of the LATAM divestiture, as well as the historic benefits of CAF II support.\n\nUsing that as a basis and in constant currency and adjusting for the sale of our correctional facilities business in the fourth quarter of 2021, overall business revenue declined approximately 4.3% year over year and 2% sequentially. Mass Markets when adjusting for CAF II declined 6.6% year over year and 1.9% sequentially. We reported adjusted EBITDA of $1.688 billion in the third quarter and generated a 38.5% margin. Recall that year-over-year comparisons will continue to be impacted through first quarter of 2023 by the CAF II program that ended in 2021 and the subsequent $59 million CAF II reserve release in the first quarter of this year.\n\nOn a reported basis, revenue was down 10.2% year over year. When adjusting for the items I mentioned earlier, revenue declined 5%. Our free cash flow was $620 million for the third quarter. Our dividend paid during the quarter totaled $255 million.\n\nAs Jeff discussed, our board has decided to eliminate our dividend, so there will not be a dividend paid during the fourth quarter. Additionally, we have reduced pro forma net debt by approximately $11 billion year to date and gross debt by about $16 billion over the past five years, reducing our annual cash interest expense by approximately $1 billion. Moving on to a more detailed look at revenue, I will discuss our results on a pro forma basis. Our third quarter total reported revenue declined 5.5% on a year-over-year basis to $4.328 billion.\n\nAs I mentioned earlier, in constant currency and adjusting for the sale of our correctional facilities business, year-over-year revenue declined 5%. Within our two key segments, Business revenue declined 5.1% year over year to $3.155 billion. On an adjusted basis, Business revenue declined 4.3% year over year. Mass Markets revenue declined 6.6% year over year to $1.173 billion.\n\nWholesale revenue grew 1% year over year. This is a channel that will likely decline over time and one we manage for cash. Within our Enterprise Channels, which is our Business segment excluding Wholesale, revenue declined 7.4% year over year. On an adjusted basis, Enterprise Channels revenue declined 6.3% year over year.\n\nOur exposure to legacy voice and other revenue continues to improve, and we expect the closing of the 20-state ILEC divestiture last month to further improve our Enterprise revenue mix going forward. IGAM revenue declined 6.2% year over year. FX was a $17 million headwind year over year. In constant currency, revenue was down 4.2%.\n\nIGAM revenue was negatively impacted year over year by one-time revenue in the prior year related to a major broadcast event. Large enterprise revenue declined 10.4% year over year. On an adjusted basis, large enterprise declined 9.4%. Remember that large enterprise includes our public sector business, and results in this channel were impacted by a contract ending at the beginning of the third quarter.\n\nExcluding public sector, large enterprise revenue trends improved both year over year and sequentially, and was the strongest performer within our Enterprise Channels, with the year-over-year rate of decline improving 100 basis points since first quarter of 2022. Within public sector, we've had significant wins over the last few quarters, including yesterday's announced contract with the U.S. Department of Defense. As a reminder, once these contracts are won, the revenue is long-lasting, but ramp slowly as we convert existing services to the Lumen network.\n\nAs you model our fourth quarter for large enterprise, be aware that it will be the final quarter impacted by year-over-year comparability related to our divested correctional facilities business. And for reference, the revenue benefit we received in the fourth quarter of 2021 was $3 million. Mid-market enterprise declined 4.6% year over year, a significant 360 basis points improvement since first quarter of 2022. As we discussed, we believe our product set serves this segment well and we expect growth over the long term.\n\nWe are seeing benefits in this channel, especially on customer retention, and our recently launched Lumen Marketplace provides an opportunity for further improvement. As I move to our new business product life cycle reporting, I will reference percentage changes on a pro forma adjusted basis to normalize for the impacts of LATAM, foreign exchange, and the sale of our correctional facilities business to provide a better view of our underlying performance. Grow Products revenue grew 1.6% year over year in the third quarter. We saw strength in IP and cloud services.\n\nGrow now represents approximately 34% of our business segment, and we carried an approximately 84% direct margin this quarter. Nurture Products revenue declined 8.4% year over year in the third quarter. The decline was driven by VPN and Ethernet. Nurture now represents about 31% of our business segment and carry an approximate 70% direct margin this quarter.\n\nHarvest Products revenue declined 6.4% year over year in the third quarter. Price increases had a positive impact on our decline rate. Our recently formed Harvest team is working hard to manage to a lower rate of decline within this product set, which is helping to not only extend the life of these products but also to manage customers back to Grow and Nurture products. Recall that Harvest is an important part of our business and generates cash to fuel our growth initiatives.\n\nHarvest now represents approximately 29% of our business segment and carried an approximate 81% direct margin this quarter. Other Products revenue declined 4.7% year over year in the third quarter. Our Other Products revenue tends to experience fluctuations due to the nonrecurring nature of these products. As you look at this product life cycle reporting, keep in mind that trends will fluctuate as we continue to manage products through their life cycles, and our Harvest team digs in with opportunities to drive strong cash flow invest in our growth products.\n\nMoving on to Mass Markets. As I mentioned earlier, total Mass Markets revenue declined 6.6% year over year and 1.9% sequentially. Our Mass Markets' Fiber Broadband revenue within our 16-state RemainCo footprint grew by approximately 18% year over year, and in the third quarter, represented approximately 18% of Mass Markets revenue. Also note, with the close of our ILEC sale, our exposure to legacy voice and other services revenue has improved by nearly 400 basis points year over year.\n\nDuring the quarter, total enablements were approximately 210,000, with approximately 195,000 of those enabled locations in our 16 routine states, bringing the total enabled locations in the retained states to 3 million as of September 30 with approximately 290,000 total locations enabled in the SellCo footprint. Enabling locations is hard work and the permitting process, as well as third-party labor supply, have been a significant headwind for us this year. While we are not satisfied with our enablement pacing year to date, it is important to note that we stood up a new factory internally as we pivoted from micro-targeting to a market-based approach. This includes an end-to-end process from planning to engineering, to construction, and finally enablement.\n\nWe have learned a lot through this process and those lessons will serve us well as we continue to work on Quantum built. During the quarter, we added 31,000 Quantum Fiber customers on a reported basis, an improvement from last quarter as we continue our pivot to a market-based approach and adjust our go-to-market strategy. This brings our total Quantum Fiber subscribers to 889,000, with 813,000 of the subscribers within the 16 retained states. ARPU in the retained states was approximately $60, and we see ARPU expansion opportunities with the adoption of in-home WiFi solutions, upspeeding, enterprise-grade security solutions, and our recently launched multi-gig offerings, delivering up to eight-gig symmetric services with the plant capable of further cost-effective speed enhancements going forward.\n\nAs of September 30, our penetration of legacy copper broadband subscribers in our retained 16 states was 12%, highlighting the significant share-taking opportunity as we accelerate the Quantum Fiber build. Within the same footprint, our Quantum Fiber penetration stood at approximately 27%. But as we expand our footprint, we expect penetration to fall as we expand our addressable market at a higher rate than new customers are added. This is just the math of an expanding business.\n\nOur Quantum Fiber 2020 vintage penetration was approximately 27% at the 18-month mark, and we will provide an update next quarter with our 24-month penetration rate. We believe this penetration ramps strongly supports our expectations for longer-term penetration gains. Our Quantum Fiber NPS score within RemainCo was greater than positive 50 again this quarter, an indication of the quality, value, and superior service that Quantum Fiber delivers. Quantum Fiber is an all-digital, multi-gig capable, prepaid product that features simple pricing with no contracts, helping reduce call center volumes and supporting our very strong NPS scores.\n\nWe continue to monitor how the economic environment is impacting our customers, and we have not observed any discernible changes in customer payment patterns. Turning to adjusted EBITDA. For the third quarter of 2022, pro forma adjusted EBITDA was $1.659 billion, compared to $1.872 billion in the year-ago quarter. As I mentioned earlier, we are seeing cost pressures from inflation in addition to our opex investments to drive growth.\n\nWe see more opportunity for transformation cost savings now that we have closed both the LATAM and ILEC divestitures, and we return resources to our transformation initiatives. Special items this quarter totaled a benefit of $527 million and were related primarily to a $593 million gain on the sale of the Latin America business. On a pro forma basis, our third quarter 2022 margin of 38.3% when compared to 40.9% in the year-ago period. Capital expenditures for the third quarter of 2022 were $845 million.\n\nIn the third quarter of 2022, the company generated free cash flow of $620 million. Moving on to our 2022 financial outlook. We are updating our guidance for several metrics. We now expect capital expenditures in the range of $3 billion to $3.2 billion for the full year 2022.\n\nAs a result, we are raising our free cash flow outlook to $2.2 billion to $2.4 billion for the full year 2022. We are also adjusting our expectation for stock-based compensation expenses and now expect approximately $100 million for the full year 2022. As mentioned previously, the board has decided to eliminate our dividend and has simultaneously authorized an up to $1.5 billion, two-year share repurchase plan. In closing, our team is managing through macro headwinds well.\n\nWe will miss Jeff's leadership but look forward to Kate joining us on Monday as we continue our transformative journey. Our team remains focused on executing on our growth initiatives to drive long-term profitable revenue growth. With that, we are ready for your questions.\n\nOperator\n\nThank you. [Operator instructions] And our first question will be from the line of Philip Cusick with JPMorgan. Please go ahead.\n\nPhilip Cusick -- JPMorgan Chase and Company -- Analyst\n\nHi, guys. Thanks very much. And Jeff, listen, it's been a long time across a couple of companies, and I want to thank you for all your help for the years. It's been great.\n\nI thought if we could just talk a little bit about capex and the fiber build and what's holding this back a little bit. And there's been other companies that have talked about building out of region and targeted yield a little bit in Arizona. What's your potential to accelerate from here? And do you feel any need to? And then second, just sort of a follow-up. Chris, does it make sense to give, for those of us who aren't very good at math, a pretty specific range on what your EBITDA guidance implies for the fourth quarter, just to make sure everybody is on the same page? Thanks very much.\n\nJeff Storey -- President and Chief Executive Officer\n\nPhil, I'll take the first one, and then Chris can add to it, but you can take the second question. If you look at our fiber enablements, we're not doing it as fast as we want to do. So, let me lead with that. We're not doing it as fast as we want to be deploying new enablements.\n\nThere are a lot of things that go into that supply chain constraints, labor shortages, inflationary pressures, and those types of things. And we'll continue to work through those. So, I'm not terribly worried about it, but we'll work through them. As far as people coming in, in some small part of the market and selecting just that market to go build, that's going to happen.\n\nThat's going to happen, and we've done it in other people's market ourselves. And so, we see that as just another competitor in those markets. What we need to do is make sure that we build a great product, a great experience, have the multi-gig capabilities that we've talked about, have the all-digital interaction that we want. And then we go at a pace that's aggressive and appropriate for the market.\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nYeah, Phil, and on the fourth quarter, for the year, we've held our guidance on EBITDA. We are near the lower end at this point, just given some of the inflationary pressures that we're working through. So, that pretty much gives you the fourth quarter given the year-to-date results.\n\nPhilip Cusick -- JPMorgan Chase and Company -- Analyst\n\nThanks, guys. Thanks again.\n\nJeff Storey -- President and Chief Executive Officer\n\nThank you. Thanks for your comments, Phil.\n\nOperator\n\nOur next question is from Simon Flannery with Morgan Stanley. Please go ahead.\n\nUnknown speaker\n\nHi, guys. It's Diego filling in for Simon. Thanks for taking the question. First, can you kind of talk about how you're thinking about the pacing on the buyback program and anything that would change that cadence? And then on enterprise buying trends, we've heard some softening of demand, people kind of rationalizing on things like AWS.\n\nCan you talk about what you're seeing on customer buying trends on the enterprise front? Thank you.\n\nJeff Storey -- President and Chief Executive Officer\n\nLet me take the buyback question first, and then I'll come back to the other one. Look, we won't get into the specifics of timing, but we'll be opportunistic and make sure that we take good advantage of it. I'll tell you that the board is engaged in this process, and we have a structured and thought-through approach to how to go about it. And we'll follow that structured approach.\n\nBut we'll be opportunistic and not get too specific about our timing on things. And then with respect to buying patterns, we said in the second quarter call that we were seeing slowing decision-making. I don't think the environment has changed very much since then. We don't see an increase in our win-loss ratio or a decrease, I should say, in our win-loss.\n\nSo, it's not that we're losing deals to somebody else. We just don't see people making those decisions as quickly as possible. And we don't see a particular increase in our cancels. So, it's not like the deals are going away.\n\nAnd so, we're -- it's kind of the same environment that we saw in the second quarter. But it is a choppy environment for our enterprise customers, and we do see them slowing the approval process that they have to go through to get new business to us.\n\nUnknown speaker\n\nGreat. Thank you, sir.\n\nOperator\n\nOur next question is from Batya Levi with UBS. Please go ahead.\n\nBatya Levi -- UBS -- Analyst\n\nGreat. Thank you. Jeff, I also wish you all the best in your next chapter. I do want to go back to the new capital allocation strategy.\n\nI think there was a debate out there if you would completely eliminate the dividend or just lower it. Can you just go with the decision-making process maybe and sort of provide your view on the complete elimination? Is that a function of your view of more challenging trends ahead? Or is it something different? And maybe just a follow-up on the Fiber capex side. Can you just go over what your expectation would be on the remaining 22 million homes? What percent could get a Fiber overbuild over time? Thank you.\n\nJeff Storey -- President and Chief Executive Officer\n\nYeah. I'll take the first question. Chris can add to it. Chris, you can take the second question about what percentage of our 22 million homes passed and that's the right number, and that will have a fiber overbuild.\n\nBatya, thank you, first of all. And we -- look, we -- our board goes through a very thoughtful process. I've told you before that we regularly review our capital allocation strategy in the context of the current environment, in the context of current circumstances, and we obviously considered should we eliminate the dividend or keep some sort of small dividend in place. And the answer was to eliminate it, that we believe right now at these stock prices, it's better to return value to shareholders through a share repurchase program than it is through some small token dividend that's out there.\n\nSo, that was the process that we went through. We also said, and I mentioned this in the prepared remarks, but we also said when we announced the Apollo transaction for our 20-state ILEC business that when we close that business, we would reevaluate and look at our dividend policy and look at our capital allocation policy and make decisions based on the environment and the conditions at that time. And so, it's not a sign that there's any greater weakness or inability to fund our business. It's just we don't think that's the best way to return value to shareholders.\n\nAnd as part of our assessment coming out of the Apollo transaction, we just believe that it's better to buy back shares.\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nBatya, on your second question, no, I don't think this changes the goal. This is obviously a multiyear project, doing everything and, as Jeff mentioned earlier, to go as fast as we can. Obviously, there's some near-term headwinds. But at this point, I don't think that changes our goal in terms of where we want to go or what we think we can do.\n\nit's really about all hands on deck right now to see what we can do given permitting and labor issues to get as many enablements in the ground as we can, as fast as we can.\n\nBatya Levi -- UBS -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question is from David Barden with Bank of America. Please go ahead.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks. I appreciate it. And, Jeff, it's been a long time.\n\nSo, thank you for being a partner in this whole process. And I'm looking forward to meeting Kate and her joining, and I'm sure she's listening. A couple of questions. First would be on the $1.8 billion Europe sale.\n\nStructured as a put option, a little strange, why that structure? It felt like maybe it was because we wanted to have all this stuff announced at the same time and we just needed to get something on paper. And also, could you share what the taxes on that transaction you'll look like? And then second, just to follow up on that question regarding the stock buyback, with the big tax book coming in the first part of next year, are we to imagine that there's going to be a constant conversation about, well, what does the debt market look like? And where is our stock price? And do we want to lever up, while we're paying taxes to buy back stock? Like how is that going to look that conversation? And I guess we could, my last one is -- and I apologize for asking this question, but look, the Fiber revenues in Mass Markets are 3.7% of total revenue. And yet there's this massive interest in spending billions of dollars over many years and fighting the supply chain to get that whole thing rolled out. Why was that decision taken rather than let's just run that business for cash? Let's take that cash, invest it in the other 96% of our company, make that better and recognize that.\n\nMaybe we shouldn't be in the copper fiber upgrade business at the margin. Like how did that conversation go? Sorry. Thanks.\n\nJeff Storey -- President and Chief Executive Officer\n\nOK. First of all, let me take your -- the put options seems strange, and was it some sort of just to get these things announced at the same time. It may seem strange for purchases in the U.S. or sales of businesses in the U.S., it's not strange for sales of businesses in other countries.\n\nAnd it's part of the -- we have a process that we have to go through to get regulatory approval. The put option -- put structure is part of that, makes it easier for the company to make sure that we're complying with the rules and regulations in the jurisdictions in which we operate. So, there's nothing strange about it. For the details, I'd refer you to the 8-K.\n\nBut this is -- if you look at other businesses that have done similar transactions, it's a fairly common structure in certain markets in Europe. Chris, why don't you take the middle two, and then I'll come back to Fiber?\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nYeah. So, the tax question, and I think I heard you correctly, the combined tax impact we said is between $900 million and $1 billion that would be due next April. And that includes the taxes for both of the divested businesses so far. As it relates to how we'll manage the buybacks versus leverage, I mean, look, I really view those things as dynamic that we have to look at in relation to each other given the point in time, right? So, we have to look at what our cash performance looks like in any given quarter.\n\nWe've got to look at where the debt markets and our leverage are. We've got to look at the buying opportunity in the equity markets. Obviously, in the near term, that buying opportunity, I think, will be strong, but it's not a linear process that we stick to. It's a dynamic process, and we will manage it accordingly to make sure that we're doing the best job possible for our stakeholders.\n\nSo, that's really how we'll look at it going forward.\n\nJeff Storey -- President and Chief Executive Officer\n\nAnd I'll try to give a little bit of color, David, on your last question about Fiber revenues and how we should be investing that money. If you look it, I don't remember the timing, three or four years ago, we took a hard look at should we be in the consumer fiber business. Should we be in the consumer copper business? And candidly, coming out of that analysis, we decided the thing that we should do is manage it for cash in the markets where that makes sense and invest in fiber in the markets where that makes sense. And we decided that the markets where it makes sense to invest in fiber are growth markets.\n\nAnd I don't want to leave anybody off the list, but look at Denver and Minneapolis and Seattle and all the communities that make up those markets, we've got some great growth markets within the 16 remaining states that we operate in. And so, we've decided that those are good markets for us to invest in fiber end. And then we've decided that there's some that we should just sell that somebody else can do better with those assets than we were doing. And that's where Brightspeed -- how Brightspeed was created.\n\nWe think they'll do a great job. They will invest in those markets. It will be good for those markets. It will be good for their investors and their owners.\n\nAnd so, we'll -- there's a little bit of the answer is all of the above, all the suggestions that you would take. And that's also to leave open the door that will change our mind on how best to do these things going forward. And we're always open to whatever structure makes most sense for our shareholder return. And we look at these decisions not as static decisions made once and never revisited, but the decisions that we are very committed to, that we are focused on executing against, but open to other things if they make more sense for us.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nGentlemen, thanks for that. It's been a long -- it has been a long time.\n\nJeff Storey -- President and Chief Executive Officer\n\nThanks, David. Franz, question, please.\n\nOperator\n\nOur next question is from Frank Louthan with Raymond James. Please go ahead.\n\nFrank Louthan -- Raymond James -- Analyst\n\nGreat. Thank you. And thanks for all the help over the years, Jeff. So, with what's left, when you sell all this, where does this leave you with regard to top-line growth? And when do you think you can deliver sustained top-line growth in the future? Thanks.\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nHey, Frank, it's Chris. I'll take that one. I think when you look at our growth buckets, I mean, my main focus obviously is doing what we can to get the growth bucket growing faster sooner. We've obviously got a process around Harvest and Nurture that I think certainly in the Harvest bucket is starting to show results.\n\nBut realistically, I still think we're two to three years away from total growth just given the size of those buckets. But the Growth bucket is the focus, and I think starting with what we have, with what Jeff leaves us with, and certainly, Kate's experience, that's where the focus will be as we go forward, and I feel good about it.\n\nFrank Louthan -- Raymond James -- Analyst\n\nAnd so --\n\nJeff Storey -- President and Chief Executive Officer\n\nAnd just to add -- go ahead.\n\nFrank Louthan -- Raymond James -- Analyst\n\nNo, go ahead.\n\nJeff Storey -- President and Chief Executive Officer\n\nNo, just to add, I feel very excited to have Kate come in. I think that the Lumen team has done a great job transitioning us from a telco to a technology company, interfacing with our customers differently, building the platform that is tightly coupled to the infrastructure, to the fiber that we have, and building a platform for Kate and the Lumen team going forward to sell and accelerate the growth in ancillary services and things around our edge cloud, things around security, collaboration, orchestration, all of those. And so, I'm still very excited about our ability to add growth to that platform.\n\nFrank Louthan -- Raymond James -- Analyst\n\nThat's great. I look forward to meeting as well. I guess, just a quick follow-up. Will the split between the Grow, Nurture and Harvest materially change with the sale of the EMEA business on any one of those buckets have -- you have more or less exposure to?\n\nJeff Storey -- President and Chief Executive Officer\n\nYeah. The operations of our company doesn't change with the sale of EMEA. I don't think either any of those buckets have any strong particular exposure. Do you, Chris?\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nNo. I don't think it's going to skew things dramatically one way or the other.\n\nJeff Storey -- President and Chief Executive Officer\n\nYes. And it won't change the way we operate the rest of the company either even.\n\nFrank Louthan -- Raymond James -- Analyst\n\nOK, great. Thank you very much.\n\nMike McCormack -- Senior Vice President, Investor Relations\n\nFranz, we've got time to take one more question.\n\nOperator\n\nVery good. Our next question is from Nick Del Deo with MoffettNathanson. Please go ahead.\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nHey. Thanks for taking my questions. Jeff, I want to echo everyone else's comments and congratulate on all your accomplishments and a well-deserved retirement.\n\nJeff Storey -- President and Chief Executive Officer\n\nThank you, Nick. And you have the last question on my last earnings call in my career. So, I'm looking forward to it.\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nAll right. A lot of pressure to deliver on that. Yeah, I guess first on the cost-cutting or cost transformations. As you noted, over the past year, you've been a bit hamstrung given the resources you've dedicated to getting the Apollo and LATAM deals over the finish line.\n\nYou talked about getting that engine up and running. What sort of cadence should we expect in terms of getting that back up to 100%? And will the resources devoted to getting the EMEA deal over the finish line way on your ability to do that?\n\nJeff Storey -- President and Chief Executive Officer\n\nSo, let me take the second one first, and then Chris, you can take the first one. No, the EMEA deal will not weigh on our ability. If you look at Brightspeed and if you look at Cirion, those are much more stand-ups of new businesses being spun out, and this one is more of an acquisition by an existing business of our business. And so, I don't -- and that's one of the key value drivers for us, frankly.\n\nI don't think it will be as complicated. I don't think it will be as expensive on the Lumen side of things.\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nYeah. I totally agree with that. And as it relates to our ability to get back to some of the cost-saving initiatives, I think it will take us a year or two to get back to full run rate, but we're starting with that now. And as we go forward, we're going to be looking for ways to drive more automation and simplicity in our processes internally.\n\nAnd that's where we're going to be focusing.\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nOK. Well --\n\nJeff Storey -- President and Chief Executive Officer\n\nGo ahead, Nick.\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nNo, the last thing I wanted to ask about was sales compensation, which is something that you've been talking about a bit over the last several months, emphasizing growth categories, deemphasizing the Harvest categories in terms of how people get compensated. How do you implement those changes and ensure that the base of Harvest revenue doesn't fall at an undue pace while those changes are put into place? I guess, stated differently, what sort of incentives you put in place to ensure that people maintain that?\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nYeah. I won't get into specifics, obviously, because, again, things aren't fully finalized yet. But I think the key point is that our Harvest bucket is really not a product that gets sold very much at all anymore. So, when you look at where the bulk of the sales exist today, it is in the Grow categories and the Nurture category.\n\nSo, it's really how you incent behavior within those. Now, separately, we do have a customer success organization that works very hard on things like rerates, making sure that we're moving customers up the stack from older tech to newer tech, and that's a separate compensation system. So, that's how we manage the flow of products from old to new, and we also just manage the overall decline of those assets. So, there is a structured process around that in terms of how people are comped.\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nOK, great. Thank you, Chris.\n\nJeff Storey -- President and Chief Executive Officer\n\nAll right. I'd like to say thank you all. I've worked with all of you for a long time and I appreciated the relationship. And so, I want to close by saying how extremely proud I am of the Lumen team and what they've built.\n\nWell, I'll miss engaging with all of you on these quarterly calls and the various conferences that I attend. I think I leave behind the company that has a very strong foundation and is poised for a return to profitable growth. So, I'm excited for that. I'm excited for Lumen.\n\nI'm excited for its employees and stakeholders as Kate's leadership will further strengthen what we've built over the past several years. So, with that, I'd like to say thank you for the time that we've had together with -- and your interest in Lumen, and thank you for joining the call today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike McCormack -- Senior Vice President, Investor Relations\n\nJeff Storey -- President and Chief Executive Officer\n\nChris Stansbury -- Executive Vice President and Chief Financial Officer\n\nPhilip Cusick -- JPMorgan Chase and Company -- Analyst\n\nUnknown speaker\n\nBatya Levi -- UBS -- Analyst\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nFrank Louthan -- Raymond James -- Analyst\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nMore LUMN analysis\n\nAll earnings call transcripts"
}