{
  "companyName": "Upwork",
  "companyTicker": "UPWK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/upwork-upwk-q3-2022-earnings-call-transcript/",
  "content": "Upwork (UPWK -0.29%)\nQ3 2022 Earnings Call\nOct 26, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to Upwork Q3 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] I would now like to hand the conference over to your speaker for today. Evan Barbosa, you may begin.\n\nEvan Barbosa -- Vice President, Investor Relations\n\nThank you. Welcome to Upwork's discussion of its third quarter of 2022 financial results. Leading the discussion today are Hayden Brown, Upwork's president and chief executive officer; and Jeff McCombs, Upwork's chief financial officer. Following the management's prepared remarks, we will be happy to take your questions.\n\nBut first, I'll review the safe harbor statement. During this call, we may make statements related to our business that are forward-looking statements under federal securities law. These statements are not guarantees of future performance but rather are subject to a variety of risks, uncertainties, and assumptions. Our actual results could differ materially from expectations reflected in any forward-looking statements.\n\nIn addition, any statements regarding the current and future impacts of Russia's invasion of Ukraine and our decision to suspend business operations in Russia and Belarus and the COVID-19 pandemic on our business, and current and future impacts of actions we have taken in response to Russia's invasion of Ukraine and the COVID-19 pandemic are forward-looking statements are related to matters that are beyond our control and changing rapidly. For a discussion of the material risk and other important factors that could affect our actual results, please refer to our SEC filings available on the SEC website and on our investor relations website, as well as the risks and other important factors discussed in today's shareholder letter. Additional information will also be set forth in our quarterly report on Form 10-K for the quarter ended September 30, 2022, when filed. In addition, reference will be made to non-GAAP financial measures.\n\nInformation regarding a reconciliation of non-GAAP to GAAP measures can be found in the shareholder letter that was issued this afternoon on our investor relations website at investors.upwork.com. As always, unless otherwise noted, reported figures are rounded, and comparisons of the third quarter of 2022 are to the third quarter of 2021. All measures are GAAP unless cited as non-GAAP. Now, I'll turn the call over to Hayden.\n\nHayden Brown -- President and Chief Executive Officer\n\nThanks, Evan, and thank you all for joining us today for our third quarter 2022 earnings call. As we close the third quarter of 2022, Upwork has clear indicators that both our business and our value proposition continue to be critical to our customers in times of economic uncertainty. Revenue grew 24% year over year to $158.6 million, and GSV grew 14% year over year to exceed $1 billion in the quarter once again. And adjusted EBITA was a loss of $2.9 million.\n\nWe are focused on making prudent and sustainable investments in our business to drive steady, durable growth even against the backdrop of challenging macroeconomic conditions. Importantly, our customers continue to count on us to enable their critical work and their businesses during these uncertain times. We have both pioneered and benefited from the major paradigm shift around remote work and hybrid workforces, fundamental changes that have shaped the new reality of work as we know it today. These sea changes illustrated by the fact that one-fourth of American workers are now working remote, first, or mostly remote, while 71% of companies expect remote work to be part of their standard operations moving forward.\n\nThis new work reality opens up a vast opportunity for Upwork to introduce ourselves to the 90% or more of companies and hiring managers who have not been aware of or considered Upwork and to bring them into the fold as customers. Nowhere has that opportunity been more apparent and central to our priorities than the late-September launch of our new brand campaign: This is How We Work Now. Appearing across TV, online video, streaming audio, digital and social media, the campaign reinforces our belief that work should unleash human potential instead of limit it and emphasizes that now is the time to embrace the new ways of working that have emerged over the past few years. It targets mainstream prospects, clients and talent alike, who largely aren't yet aware of Upwork, but like us, recognize that the world of work has changed forever.\n\nOur strong business position and resonant value proposition allow us to remain on offense, evidenced through both our new brand campaign, as well as our amplification of benefits most valuable to our clients: Flexibility in hiring, expert talent at their fingertips, operational agility, and bottom-line [Technical difficulty]\n\nOperator\n\nLadies and gentlemen, please stand by. Your conference will resume momentarily. Please stand by. Thank you for your patience.\n\nPlease stand by. [Technical difficulty] Ladies and gentlemen, this is the operator. I do apologize. There will be a slight delay in your conference.\n\nPlease remain on hold. Your conference will resume momentarily.\n\nHayden Brown -- President and Chief Executive Officer\n\nOK. Can you hear me on this one?\n\nOperator\n\nI can hear you just clearly. [Inaudible] speak again.\n\nHayden Brown -- President and Chief Executive Officer\n\nCan you hear me -- well, can you hear me on this phone line?\n\nOperator\n\nYes.\n\nHayden Brown -- President and Chief Executive Officer\n\nOK. Thank you.\n\nOperator\n\nThank you for your patience, ladies and gentlemen. Hayden, you may begin.\n\nHayden Brown -- President and Chief Executive Officer\n\nI think you just disconnected my line. Can you hear me?\n\nOperator\n\nYes, we can hear you.\n\nHayden Brown -- President and Chief Executive Officer\n\nOh, excellent. Our strong business position and resonant value proposition allow us to remain on offense, evidenced through both our new brand campaigns, as well as our amplifications of benefits, most valuable to our clients: Flexibility in hiring, expert talent at their fingertips, operational agility, and bottom-line saving. Our solution satisfies the tight budgets that many organizations are implementing amid economic uncertainty, as clients find that they can realize cost savings upwards of 50% by using Upwork compared with traditional staffing alternatives. By delivering highly skilled, diverse talent from more than 180 countries affordably and quickly, clients can have greater flexibility with our cost structure and reduce operating costs through talent innovation.\n\nAs a result, we are helping companies improve their EBITDA and generate value-added growth while maintaining the optionality that has been shown by McKinsey Research to be vitally important in weathering or even accelerating during economic downturns. Notable brands that we welcomed as enterprise clients in the quarter include Anheuser-Busch InBev, Constellation Brands, Cushman and Wakefield, iCIMS, and Marriott International. These companies are leveraging our platform to deliver on their business plans; tap new sources of scalable, flexible remote talent; and retain a competitive advantage. Market makers like these new customers contributed to enterprise revenue growing a healthy 41% year over year to $12.5 million in the third quarter.\n\nCoupled with strong growth of clients spending 1 million or more, this underscores how our value proposition resonates with enterprise clients. We continue to invest in innovating the work marketplace, with the goal of helping clients and talent start work more easily on the Upwork platform and return to Upwork time after time for a consistent and productive experience. We deliver critical and differentiated value, not just in matching clients and talent, but also in serving as the hub for seamless back-office tasks for talent around invoicing and getting paid, and equally for clients around contract management and payment activities. We enhanced these core experiences in the third quarter, debuting improvements to our Contract Workroom that reduce friction and allow clients and talent to manage contracts; navigate all their contract actions; and more easily review weekly billings, earnings, contracts terms, and feedback.\n\nAdditionally, we made enhancements to our enterprise suite, by enabling Multi Approver, team-based approvals that support large-scale and complex workflows and adding more refined search functionality for faster access to our global pool of expert vetted talent, who are ready and pre-approved to work with these companies. Project Catalog Consultations, made available across all 90-plus categories of work during the third quarter, continue to drive effective connections and collaboration between clients and talent. Enhancements this quarter improve the experience, allowing them to confirm scope, skills required, feasibility, and timeline for a potential project, driving speed, and starting working together which can be 50% faster than on the talent marketplace. These enhancements also enable customers to establish longer-term relationships that go beyond an initial project engagement.\n\nUltimately, this drives elevated clients spend on Project Catalog. In fact, 30-day spend by customers who use Consultations is nearly three times what customers who only purchase on Project Catalog spent. Lastly, thousands of talented professionals on our marketplace are adding profile badges that display and validate their expertise through our budding partnership with Credly, the market leader in digital workforce credentialing, enabling talent that clients to match faster and with more confidence. Equipped with access to a vast supply of talent and job posts and the technological capabilities to engage more effectively and efficiently, clients and talent are together defining the new reality of work, blazing the trail regardless of the economic uncertainty that may persist.\n\nTo be sure, as we expected since our second quarter earnings, our customers are not fully immune to that uncertainty, evidenced by the softness we continue to see in some metrics. Nonetheless, revenue impact in the third quarter from these conditions was in line with our previously shared expectations. We have seen the softer client acquisition and retention trends that we observed in the second quarter stabilized in the third quarter, with the softness continuing to be more pronounced in Europe and with small and medium-sized businesses. Our enterprise Land team also saw elongated sales cycles due to the macroeconomic outlook for a handful of accounts.\n\nThis, plus some operational growing pains, resulted in fewer enterprise client find in the third quarter than targeted. We are remedying the operational growing pains and believe the enterprise opportunity remains as attractive as ever for Upwork. Additionally, we continue to manage our own business with discipline. Being prudent with resources has always been a guiding principle at Upwork.\n\nAnd as the economic outlook evolves, we have several measures underway, including evaluating our budgets, adjusting hiring timing, and prioritizing roles more aggressively, reviewing and reducing vendor spend, and ensuring we have a tight operating cadence around cost management with a high degree of visibility and internal partnership toward our goals. Due to the largely recurring and programmatic nature of the majority of customer activity on our platform, we are able to monitor for changes in behavior as they occur and be nimble in making adjustments to our plans as needed. This gives us further confidence in our ability to manage the business responsibly through a dynamic environment. We still view this period of macroeconomic uncertainty as a critical time for us to be focused on expanding our position as a market leader and cementing new integral ways of working across the work ecosystem.\n\nWe see businesses continuing to turn to Upwork as we always on source for highly skilled remote workers, regardless of their industry, whether their business need is project-based or ongoing, where they stand in their workforce transformation, or their current economic climate. We also know that Upwork fosters a deep, diverse, and highly skilled talent community across the globe. The world's work marketplace remains the center of gravity for these work and career innovators to build trusted lasting relationships and get more done together. And we will continue to innovate, evangelize, and scale it in the fourth quarter and beyond.\n\nThank you for joining us on this journey. Before we take your questions, I just want to thank Jeff, as this will be his last earnings call for Upwork. I am incredibly grateful for all his contributions to the company and our investor community over the last few years. His experience and marketplace expertise have positioned Upwork for continued growth and put us in a position of strength for the next chapter.\n\nBest of luck to you, Jeff, on all your future endeavors. We will now open the call to your questions and thank you for your patience with some of the technical challenges today as well.\n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from the line of Bernie McTernan with Needham and Company. Your line is open.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat, thank you for taking the questions. Maybe just to start on enterprise revenue. Sequentially, it was virtually flat. So, I understand the top-of-funnel and gross add problems that were addressed in the shareholder letter.\n\nBut was there any churn issues or customers downshifting or maybe spending less than the quarter? And I know you reemphasized or reiterated doubling the sales force. But do you still have confidence in the $300 million long-term target for revenue?\n\nHayden Brown -- President and Chief Executive Officer\n\nThanks for the question, Bernie. I'd say we did not see any downshifting in terms of -- retain customer spend. In fact, we saw really good success with the team, growing existing account, you know, customers leaning into the solution. We referenced, you know, one of our customers who was not in the top five vendors previously has kind of zoomed in to the top of the list and now is close to a $40 million run rate with us.\n\nSo, we really feel good about the trajectory with our existing customers who are continuing to spend with us, expanding spend in a lot of cases. We're not coming on long-term targets in this call. You know, I think that's something we know more normally do in the Q4 call, but are continuing to expand that land team on plan and feel really great about the overall opportunity. No changes in terms of how we're thinking about that.\n\nAnd the team spend, to your -- earlier part of your question, has been really good with our enterprise cohort.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat, and then the investor letter struck a nice balance of investing for the long term while also focusing on cost discipline near term. Was there any early indications on how to think about so far, the success in the new brand marketing campaigns, and what that could mean for '23? And then just how much leeway there is in some of the other sites to hit the profitability goals in '23 assuming the investments and brand marketing continue?\n\nHayden Brown -- President and Chief Executive Officer\n\nSure. We are definitely monitoring our brand investment, you know, [Technical difficulty] measurability focus. Looking at that, we knew at the outset as we went into the brand area that this would be a multiquarter journey. And we're not out the other side of that yet.\n\nBut we feel good about the ability to achieve our brand goals in the context of EBITDA profitability next year. And so that will be a continued commitment for us. And again, we're excited about the new campaign we launched. A lot of good things happening there.\n\nBut next year, we will see that EBITDA profitability even in the context of achieving our brand goals around awareness.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thanks for taking the questions.\n\nHayden Brown -- President and Chief Executive Officer\n\nAbsolutely.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Matt Farrell with Piper Sandler. Your line is open.\n\nMatt Farrell -- Piper Sandler -- Analyst\n\nThanks for taking my question. And it was great to work with you, Jeff. I wanted to zero in a little bit on the macro. It sounded like it was in line with expectations for Q3.\n\nAnd I believe you provided the $10 million to $15 million number for the second half. Is that still the right way to think about Q4 or did it get any worse? And I guess, how should we be thinking about the macro headwind maybe as we start to look at early 2023, as well?\n\nHayden Brown -- President and Chief Executive Officer\n\nSure. I'll start, Matt, and then definitely, Jeff, add anything that you want to chime in with. But I think we definitely did see everything so far, from what we can see now, in line with the $10 million to $15 million that we previously communicated. And there has been, you know, some softer than normal client acquisition and retention that decelerated a bit in Q2 and then stabilized in Q3.\n\nAnd I think we're not seeing right now any indications of further deceleration or anything that's giving us particular concerns as we look ahead, but we have kind of baked in that full $10 million to $15 million for Q3 and Q4. And so, I think that's really where we've given those guardrails, and we feel good that that is at the level of visibility around any exposure we have, the macro, from where we stood last quarter and consistent with where we see things right now.\n\nJeff McCombs -- Chief Financial Officer\n\nYeah. And just to add on to that, Matt, you noticed that our guidance for Q4, the midpoint, is roughly in line with the Q3 actuals on the revenue fronts. And normally, we would see a bit of seasonal expansion from Q3 to Q4. So, our macro adjustments to that kind of offsets that normal seasonal adjustment.\n\nAnd with respect to 2023, we're not commenting on that at this time. But more on that on the Q4 call.\n\nMatt Farrell -- Piper Sandler -- Analyst\n\nThanks. And Hayden, this one's for you. You've been talking about the next chapter of growth for Upwork recently. Could you just provide some more detail on how you think that looks, and maybe with some of the specific drivers and trends and dynamics, particularly with the macro?\n\nHayden Brown -- President and Chief Executive Officer\n\nSure. The next chapter for us is really about continuing to unlock the opportunity we have around our total work marketplace, which is more than just a talent marketplace, which we've had, and has been such a source of strength for us historically. But we've been launching new products over the last one and a half, two years. We have more innovation in the pipeline.\n\nAnd we've been making some of these strategic bets around the sales force and the enterprise expansion, our brand marketing investment. And really, that's been laying the groundwork over the last few years for this next chapter of more customer adoption to the way of work that Upwork offers them and all the benefits that we offer them. So, the next chapter ahead for us is us continuing to innovate for customers, building the awareness in the market that gets us way beyond that sub-10 % cohort of customers that knew about us today, and bringing this model we've been building to a much wider stage.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Brad Erickson with RBC. Your line is open.\n\nUnknown speaker\n\nHi. It's Logan on for Brad. Just wanted to double click on enterprise, which like you had some internal and external headwinds. Just wanted to ask where would you say was the most strong headwind in the quarter.\n\nAnd then just on H1, any sort of timeline on getting back to where you guys want to be internally? And then, externally, can you guys just kind of unpack the economic uncertainty and macroeconomic environment, how that's impacting the clients or potential clients' decision making? Thanks.\n\nHayden Brown -- President and Chief Executive Officer\n\nThanks. Thanks, Logan, I see on enterprise, we feel really good about where we are overall, again, with enterprise revenue up 41% for the quarter. Again, lots of great activity happening particularly with the expansion side. We did hit a hiccup with our land team in the quarter and that was actually driven more by internal execution than by the macro, although we did see fuel cycles elongate for some accounts, and that definitely was part of the issue as well.\n\nBut from an internal execution standpoint, there were some things like email system migration that was happening previously, and that impacted our ability to have as many leads in the top of the funnel as we wanted because we had turned off a bunch of marketing campaigns and some things like that. So, we feel good that we have our arms around what those execution challenges have -- were and have been and how we're remedying those. And our hiring for that team continues to be on track, which is another key piece of the puzzle for us on the land side. So, in terms of timeline, I think it could take a quarter to -- like a little bit of time for us to get back to where we want to be.\n\nAnd again, the macro does present a little bit of uncertainty around exactly what that timeframe is. But we feel good that we have one site to show you the drivers that we can control and where that's headed. In terms of how the macro factors are impacting potential client decisions, I think it's really, on the one hand, we've seen accounts where they're very excited to be expanding our model now, either existing customers or even -- some land customers where, because they have certain other spend constraints, our model is very appealing. But then on the other side, as we talked about the deal cycles being elongated, that is another factor.\n\nSo, we feel a little bit of a mix of that. But overall, again, for existing customers, in particular, who already are familiar with our model, and are using us, we haven't seen the macro be a headwind at all on that side.\n\nUnknown speaker\n\nGreat. Thanks for taking the question.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Marvin Fong with BTIG. Your line is open.\n\nMarvin Fong -- BTIG -- Analyst\n\nGreat. Thank you for taking my question. I appreciated the detail that you provided about Project Catalog and the consultation and the success there. Just wondering, you've cited the significant increase in the spend after 30 days.\n\nSo, our Project Catalog, projects with consultation, are they approaching the average project size of the talent marketplace? Or are they still quite a bit smaller? And then I have a follow-up.\n\nHayden Brown -- President and Chief Executive Officer\n\nSure, Marvin. I think they're still -- we still view them as a stepping stone in between what maybe catalog and the talent marketplace look like. So, they're still in between. But they're also -- it's like a pretty dynamic space for us.\n\nIt's a very new product. We just rolled it out across all 90-plus categories on the site. So, I would emphasize this is very early days where it was both a very new product. And having just launched this across all of our categories and customers, it's definitely kind of a moving situation, which we're very excited about because of all the applications we're seeing where customers are leaning into this product.\n\nAnd we're kind of deploying it in a lot of new contacts with them.\n\nMarvin Fong -- BTIG -- Analyst\n\nOK, great. And the follow-up is also on enterprise. Just wanted to ask the question, press a different way. But are you still confident that these decisions that are being elongated, are those – are you still confident that those will close at the same rate? And can you just give us an idea of exactly how long -- how much longer clients are taking to, like, make this decision? Thank you.\n\nHayden Brown -- President and Chief Executive Officer\n\nYeah, thanks. We haven't seen the conversion rates change at the different points in our funnels. So, the signs are pretty positive there that that's not really hitting us. It's more just the cycle times.\n\nAnd, for example, some of the issues we're seeing is just more approvers being introduced into the process, or some companies seem to be going to outside counsel more to get involved in approving their deals because they're getting more comfort out of that at this time. So, it's those types of issues. And the increase in cycle time on these things is, you know, it's something that we're seeing, but it's not, you know, blowing up the process completely. So, you know, again, we feel like this is an issue where it's not derailing our land team in a significant way.\n\nThis is the minority of the issue in the quarter. And some feel that is definitely -- you know, it was more operational on our side, you know, in terms of our MIS and that is in some ways comforting. I mean, it's unfortunate, we're not pleased about that result, but it is comforting in that a lot of the issues that we thought hampering the land team were more around internal, you know, growing pains that we're just working through, and we feel good that we can address those issues.\n\nMarvin Fong -- BTIG -- Analyst\n\nThat's great to hear. Thanks, Hayden. And good luck, Jeff, on your next endeavors.\n\nJeff McCombs -- Chief Financial Officer\n\nThanks, Marvin.\n\nHayden Brown -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Maria Ripps with Canaccord. Your line is open.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGreat. Thanks for taking my questions. First, is there anything to call out in terms of retention curves or spend patterns by category or by vertical? I mean, obviously, TAC has been impacted by expense and workforce reductions. Is that impacting you at all? Or would you say that sort of what you're seeing is more kind of broad-based?\n\nHayden Brown -- President and Chief Executive Officer\n\nWhat we're seeing is broad-based with the caveat that, as mentioned, some of the softening of certain metrics has been more with the SMBs and more in Europe. So, I wouldn't say it's exclusive to that. We have seen a little bit in the U.S. and in some cases with larger customers, but it's definitely more pronounced with the smaller customers and in Europe.\n\nSo, that's where we see the differentiation. We're not seeing a real differentiation by sector or business type or any of those other dimensions.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGot it. That's very helpful.\n\nHayden Brown -- President and Chief Executive Officer\n\nIn terms of cohorts, I wouldn't call anything out there either. Maria, I think you were asking about, you know, customer cohorts. I don't think there's anything really to note on that dimension.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGot it. And then secondly, your take rate expanded really nicely, both sequentially and year over year, and you talked about several drivers behind it. How should we think about sort of sequential progression from here over the next couple of quarters?Jeff McCombsYeah. Hey, Maria.\n\nThanks for the question. So, the take care over the last couple of quarters was primarily driven by the pricing change that we implemented Q2, mid-quarter. So, you saw that benefits both in Q2 and Q3. That's fully incorporated now, so you won't have that benefit.\n\nWe still have the dynamic that as our clients continue to find more and more value with us, spend more with the freelancers that they're working with, they graduate into the lower pricing tiers of our tiered service fee structure. And so that dynamic will continue to play out. And all the additional upward pressure on take rate that we've had will also continue to play out. Meaning enterprise, which has a higher take rate, is growing faster than nonenterprise and Product Catalog and talent scout also have higher take rates.\n\nSo, those will be the offsetting dynamics. We're not providing guidance in terms of where we think take rates will be in 2023, but those trends will continue to play out for the foreseeable future.\n\nGreat. Thank you very much. And Jeff, best of luck going forward.\n\nJeff McCombs -- Chief Financial Officer\n\nThank you so much.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of John Byun with Jefferies. Your line is open.\n\nJohn Byun -- Jefferies -- Analyst\n\nHi, thank you. This is John Byun for Brent Thill. Just have a couple of questions. First, the enterprise logos that are in the shareholder letter were pretty impressive this quarter.\n\nMore recognizable brand names, I guess. Just wondering if there's anything to read through from there. Is it just that a lot of these things are maturing? And any color you can add to that? And then I'll follow up.\n\nHayden Brown -- President and Chief Executive Officer\n\nThanks, John. Yeah, we're excited about those customers, too. I think our business continues to get more recognition. Our sales team is doing a phenomenal job, despite some of the hiccups.\n\nThey're really making inroads with a lot of great customers. We've talked about Marriott, AB InBev, Dun and Bradstreet. I mean, this, I think, just speaks to the fact that our solution resonates, you know, not just with, you know, tech companies. I think a lot of people in the outside world think, \"Oh, Upwork is a solution for, you know, tech businesses or a certain type of very cutting-edge company.\" But in fact, we are really, I think, landing with so many businesses and so many industries, who understand increasingly the value of our model, how this gives them the best experience and the best agility, cost savings, access to talent that they absolutely need, right now, whether they are an 80- or 100-year-old business, or whether they are a small company just getting started.\n\nSo, that I think is really illustrated with some of those logos and the resiliency of our business even through some of these uncertain times we're in. I think it also illustrates the ability we have to unlock that trillion-dollar TAM that we are going after through incredible companies like those that we landed this quarter.\n\nJohn Byun -- Jefferies -- Analyst\n\nOK. Thanks so much, it's helpful. And then, I do have another question related to macro. So, GSV was down sequentially.\n\nI think there's some mention of some familial churn or in the letter but wanted to see if maybe you could parse it out a little bit between maybe seasonality and macro or the I guess, you pointed to the client marketplace planned price change. Any color there will be helpful. Thank you.\n\nJeff McCombs -- Chief Financial Officer\n\nYeah. As you pointed out, there's a number of drivers that played out there. First off, the macro dynamics that kind of increased in softness throughout Q2, and it kind of stabilized throughout Q3. So, that played a bigger role -- would have played a role in causing that quarter-over-quarter decrease.\n\nSecondly, Ukraine also -- the war in Ukraine also played a role where the implementation of our changes on May 1 or so had a couple of months of impact there, whereas had a full quarter of impact in Q3. It's a little bit offset by the substitution rate that was increasing -- substitution improvements that was increasing. Third, the pricing change, which was right in line with our expectations, it's delivered the features that are gaining more traction to customers, removing those from behind the paywall, increased revenue, increased take rate. And as expected, we also thought there might be some GSV impact.\n\nAnd so, we saw a bit from that as well. And then the – well, I guess, I already mentioned the macro. So, those are really the key drivers. We're not providing context in terms of the absolute breakdown of those.\n\nBut those are the key reasons why we saw that decline. In addition to the Q2 to Q3 seasonal dynamic normally is also a slower quarter-over-quarter jump. And so, when you layer all those on top of it, we ended up with that decline.\n\nJohn Byun -- Jefferies -- Analyst\n\nThanks very much. And wish you the best, Jeff.\n\nJeff McCombs -- Chief Financial Officer\n\nThank you much.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Rohit Kulkarni with MKM Partners. Your line is open.\n\nRohit Kulkarni -- MKM Partners -- Analyst\n\nHey, thank you. A couple of questions. One is just on kind of the shape of kind of visibility or uncertainty that you're seeing through the conversations with your clients over the past 60 days or over the past 30 days. Has that changed overall? As in we are hearing a lot of other companies talk about growing uncertainty, growing lack of visibility.\n\nSo, how December could look like is not with the whole degree of confidence that they can say right now. So, just would love to hear what you're hearing. Love that you're reiterating your guidance, but just want to see if there is some change in how certainty of conviction has evolved. And then I have a couple of quick follow-ups.\n\nHayden Brown -- President and Chief Executive Officer\n\nYes, it's two-question, Rohit. I don't think that there's been a big change in the last 30 days around their level of certainty. But there is a big conversation at every company right now around self-tightening in general. And so, I think where we've taken that in terms of how we've thought about our guidance is we are expecting that every company, as they go through Q4, is going to continue to be very guarded with their spend, very measured with their spend.\n\nAnd so that is something that on the margin, we expect to, again, modestly impact and impact our Q4 numbers because, a lot of times in Q4, that's not the case, a lot of times people are more in this, like, use it or lose it mentality with their budgets, and it's just kind of a different mentality. So, I think that's a temperature that's out there in the environment right now. And that's something that we have taken into consideration as we think about how the rest of the year is going to play out. I think the other dynamic that we hear from our customers is our customers, especially if you think about our enterprise customers and the change agents, who are typically the ones advocating for the Upwork solution inside those companies.\n\nSo people like [Inaudible] at UST, they're the ones who are the change agents, and they actually see this moment quite often as the moment when suddenly, they can actually force their agenda a bit more because this is a scarcity moment, which forces everyone in the business to stop and evaluate what are they doing and how are they doing it and is it the best use of resources. So, this is actually the moment when these change agents can kind of step to the table and step to the forefront and say, \"Hey, I have an alternative here with Upwork that actually lets us achieve these objectives differently.\" And it gives them a platform that maybe during normal times or kind of fattier times, they don't have that opportunity in the same way. So, again, it's very hard for us to know how the whole headwinds, tailwinds pieces of the macro play out for us. But our change agents have -- I've been hearing from some of them like this is an opportunity where scarcity drives a different type of conversation and advantage for them in promoting the agenda and the advantage of knowledge they have around our solution and what it can do for their businesses, which is really interesting.\n\nRohit Kulkarni -- MKM Partners -- Analyst\n\nOK, fantastic. And one question on how the kind of the spend per client has been steadily growing sequentially, as well as any additional color on top of what you've already disclosed as to the why behind how that has been trending. Is there -- are there specific kind of new verticals that are driving that? Or are there specific kind of types of clients that seem to continue to drive the spend per client, which is clearly above and beyond what some of your peers do? So, wanted to see the why behind that, as well as how sustainable is that slow and gradual uptick as such.\n\nJeff McCombs -- Chief Financial Officer\n\nThanks, Rohit. I appreciate the question. It's really been a continuation of the drivers that we've seen in the past. One, it is very broad-based.\n\nIt's really is across all categories. Clearly, there are some categories that are growing faster and slower than others. But in general, it's fairly broad-based. And it's primarily driven by the relationships between clients and talents continuing to elongate.\n\nSo, the hours per project continues to get longer. If you break down the size -- spend per client into projects per client, hours per project, and rate -- the hourly rate is -- the rate of increase in hourly spend is basically in line, maybe slightly down. The projects per client continues to be slight -- a slight driver. But really what we've seen over the last couple of years probably is that relationship dynamic, which is what Upwork is all about, continues to drive forward as clients and talent by more and more value working together.\n\nRohit Kulkarni -- MKM Partners -- Analyst\n\nOK, OK, awesome. Thanks, Jeff. And again, good luck with whatever you do next. It was great working with you.\n\nJeff McCombs -- Chief Financial Officer\n\nThank you so much, Rohit.\n\nOperator\n\nThank you. Please stand by for our next question. Our last question comes from the line of Andrew Boone with JMP Securities. Your line is open.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nHi. Thanks so much for taking my questions. You guys offered some really good detail on enterprise. But is there any way you can help us better understand the health of SMB in terms of cohorts or top-of-funnel traffic?\n\nHayden Brown -- President and Chief Executive Officer\n\nThanks, Andrew.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nHi.\n\nHayden Brown -- President and Chief Executive Officer\n\nSorry, I was going to say, I think the SMB business is, it's really healthy. There hasn't really been any changes of notes from where we were last quarter. We've mentioned that the -- even the softness we've seen has stabilized in some of the metrics that were impacted by the macro. And as we've looked at things like our spenders, who are at over $100,000 in spend, that number was up 32% year over year in terms of people leaning into our solution in a significant way, even despite what's going on in the broader environment.\n\nSo, we feel really good about that. Top of funnel, again, that was somewhat impacted by the macro. And we have seen a slight increase in CPCs that – or NCPAs that I think is driven by a couple of things. So, we continue to monitor that and optimize our program around acquisition so that it is healthy from an ROI perspective.\n\nBut the business is doing really well. And we feel great about where we've been with our growth. Our acquisition around the work marketplace and bringing customers in through the different new products that we have been innovating, from Catalogs to Consultations, to talent marketplace, continues to be a crown jewel for us. And we're continuing to innovate new products in the pipeline while doing things like growing our sales team to tackle the enterprise opportunity, which includes graduating enterprise customers that come in through that marketplace, have a great experience, and then are ready for more and to build even more programmatic usage.\n\nSo, I think all of that is in a really good place. We feel good about -- we're just still in the early innings of unlocking this massive trillion-dollar market opportunity with an amazing foundation that we're building on.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nAnd then for my second question, I wanted to go back to marketing. I thought the way that you guys frame it historically is that the $80 million of brand spend would basically be judged on the results that you guys are seeing. So now that we're at the end of kind of October of this year, how do you guys think about that spend and the effectiveness that you guys have seen there? Thanks so much. Jeff, best luck.\n\nHayden Brown -- President and Chief Executive Officer\n\nYeah. Thank you for that --\n\nJeff McCombs -- Chief Financial Officer\n\nThanks, Andrew. Appreciate it.\n\nHayden Brown -- President and Chief Executive Officer\n\nThanks for that question. I think it's been a great couple of quarters of seeing the first campaign gain some legs and definitely start to move some of the needle on awareness. And we're measuring that really carefully. As we talked about in the last call, we brought on board some additional partners with Ipsos and UM to both increase the efficiency and the measurement capability we have around that program.\n\nAnd with the launch of this most recent campaign, we're really trying to make our dollars work harder because this campaign is all about having an even more breakthrough message and creative that really catches people's attention and drive that awareness without even increasing materially the spend level quarter over quarter, but having a bigger impact through the powerful creative and the messaging around the old rules of work are dead. So, we feel that this is, you know, a couple quarters in. We have learned a lot. We have used that to drive even better creative marketing and messaging through the different channels we're using and improving our measurement along the way so that we're getting even better insights that we're putting to work as we continue to adjust that program.\n\nSo, all of that makes us feel great about where we are, as we are committed to achieving our brand goals while achieving EBITDA profitability in 2023. And I think that's where we know we will continue to measure this program and make dynamic changes as we need to, seeing the results and seeing that we were going to achieve those profitability targets.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nHayden Brown -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. There are no further questions in the queue. I would now like to turn the call back over to Evan for closing remarks.\n\nEvan Barbosa -- Vice President, Investor Relations\n\nThanks. On behalf of the entire Upwork team, thank you for joining us today. And thank you for your interest in Upwork. If you need any clarifications or have any follow-up questions, please do not hesitate to reach out to me at investor@upwork.com.\n\nThis concludes our call. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEvan Barbosa -- Vice President, Investor Relations\n\nHayden Brown -- President and Chief Executive Officer\n\nBernie McTernan -- Needham and Company -- Analyst\n\nMatt Farrell -- Piper Sandler -- Analyst\n\nJeff McCombs -- Chief Financial Officer\n\nUnknown speaker\n\nMarvin Fong -- BTIG -- Analyst\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nJohn Byun -- Jefferies -- Analyst\n\nRohit Kulkarni -- MKM Partners -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nMore UPWK analysis\n\nAll earnings call transcripts"
}