{
  "companyName": "EHang Holdings Limited",
  "companyTicker": "EH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/ehang-holdings-limited-eh-q2-2022-earnings-call-tr/",
  "content": "EHang Holdings Limited (EH 1.90%)\nQ2 2022 Earnings Call\nAug 18, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and thank you for standing by. And welcome to the EHang second quarter 2022 earnings conference call. [Operator instructions] Now, I will turn the call over to Julia Qian, managing director of The Blueshirt Group of Asia, EHang's IR firm. Ms.\n\nQian, please proceed.\n\nJulia Qian -- Investor Relations\n\nHello, everyone. Thank you, all, for joining us on today's conference call to discuss the company's financial results for the second quarter of 2022. The earnings release is available on the IR website, as well as from newswire services. Please note, the conference call is being recorded, and the audio replay will be posted on the company's IR website.\n\nToday, EHang management team, which includes Mr. Huazhi Hu, chief executive officer; Mr. Xin Fang, chief operating officer; and Mr. Richard Liu, chief financial officer, will successfully give the prepared remarks.\n\nRemarks delivered in Chinese will be followed by English translations. All translation is for convenience purposes only. In the case of any discrepancy, management's statements in the original language will prevail. A Q&A session will follow afterwards.\n\nBefore we continue, please note that today's discussion will contain forward-looking statements made in pursuit to the safe harbor provision of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's actual results may be materially different from the expectation expressed today.\n\nFurther information regarding these and other risks and uncertainties is included in the company's public filing with the SEC. The company does not assume any obligation to update any forward-looking statements except as required under applicable law. Also, please note that all the numbers presented are in RMB and are for the second quarter of 2022 unless stated otherwise. With that, let me now turn the call over to CEO, Mr.\n\nHuazhi Hu. Please go ahead, Mr. Hu.\n\nHuazhi Hu -- Chief Executive Officer\n\n[Foreign language] Here's some translation on the Mr. Hu's remarks. Thank you, operator and Julia. Hello, everyone.\n\nThanks for joining our earnings call today. In Q2, we have actively adapted into the macro environment at home and abroad. The world was gradually recovering from the continued impact of the COVID pandemic. We were able to achieve excellent results.\n\nIn such an environment, we not only spend more time and efforts to strengthen ourselves but also continue to expand our orders, preorders, deliveries, and our customers, especially in China and Southeast Asia. This drove up our total revenue in Q2 by a significant increase of over 150% from Q1. We continue to expand our strategic partnerships with business and finance partners, such as the CP Group, one of the largest commercial companies in Thailand, and the Agricultural Bank of China. These partnerships will be our strong support to EHang's long-term business development in the future.\n\nOur COO and CFO will elaborate on them later. The most important thing for us at present is the EHang 216-S airworthiness certification. And the process has progressed into new phases since this year. It is based on our full understanding of the comprehensive setup airworthiness concept that had been summarized by the Western countries with their experience in recent century.\n\nThis setup concept has been embedded in the entire process of making our aircraft from design to mass production, which has an essential and a profound influence on the safe production and operation of aviation products. Here, I would like to express my sincere admiration and appreciation to the pioneering predecessors who contributed to the invaluable experience with tremendous efforts. However, before this CAAC issue the special conditions, there hadn't been any available airworthiness certification standards applicable to this new type of aircraft like EHang 216. In the early days, our AAVs conformed to our own safety standards.\n\nBased on which, we explored to start productization and production. As there was no precedent, we had to closely work with the CAAC to further develop this new type of airworthiness standards together according to the relevant airworthiness concepts and the principles in the past several months. We had established the aircraft design and production management systems, which not only meet the requirements of the aviation industry but also are compatible with our own management system. With that, every member of our team can work in line with airworthiness concept and conforming to the scientific management and the design methods so as to enable every process in a controlled and a regulated manner from design to production of EHang 216.\n\nIn this regard, we finally reached a consensus with the CAAC expert team in Q2 on our project specific certification plan, and certification basis, as well as the certification plan, respectively. In respect of the airworthiness process for this unique unmanned aircraft system, we have not only referred the CCAR-23 airworthiness regulation and internationally recognized the standards, such as the ASTM, SAE, RTCA, [Inaudible] etc., and learned from the configuration management and airworthiness experience of a conventional aircraft to OEMs, but also made innovation exploration on new topics in unmanned aircraft systems, including the unmanned system, data link, and a ground control system. We worked out 13 means of compliance applicable to EHang 216. Based on our previous experience, we are continuing carrying out internal tasks according to the airworthiness standards and planning activities for the demonstration of the compliance.\n\nBased on the CAAC and the Guangdong provincial government strategic cooperation framework agreement for civil aviation development in Guangdong, they recently emphasized our speeding up developing the aviation manufacturing industry and new business forms of general aviation. Both the CAAC and the Guangdong government have clearly put pushing forward relevant UAM pilot project and are strongly pushing forward the EHang 216-S AAV type certification process as their key tasks in 2022. It encouraged us and further enhanced our confidence to obtain a test certificate. Moreover, in June, this CAAC newly established aircraft airworthiness branch center in Guangzhou, where our headquarters is located, to be in charge of the airworthiness certification work for small aircraft nationally.\n\nCurrently, the VT-30, one of the products in our VTOL aircraft series, is at the stage of the product design, airworthiness preparation, and a component verification. We believe that these favorable conditions and a policy support in Guangdong can lay a solid foundation for VT-30 design, test flight, and airworthiness certification. Next, I will turn the call over to our chief operating officer, Mr. Fang Xin, for business highlights in Q2.\n\nThank you.\n\nXin Fang -- Chief Operating Officer\n\n[Foreign language] Here's the translation of Mr. Fang's remarks. Thank you, Mr. Hu.\n\nHello, everyone. As the COVID situation in China have gradually stabilized since Q2 of this year, the tourism market has been recovering steadily. The post-pandemic era expediated the transformation of tourism, such as scenic spots, by bringing innovative business models to scale out the emerging consumption. In June this year, the CAAC issued the 14th five-year special plan for general aviation development to promote the development of low-altitude flight tourism by supporting related authorities to expand aerial sightseeing in more scenic spots and to establish a low-altitude flight tourism network, connecting scenic spots, resorts, theme parks, and other tourist destinations.\n\nAnd in the national policy of supporting integrated the development of aviation and tourism, we formed a strategic partnership with Tianxingjian Cultural Tourism Investment company, an affiliated enterprise of the Jishou city government in China's Hunan Province, with the plan to develop a scenic flight project at Aizhai Wonder Tourist Area, a national 5A level scenic spot in Jishou. In Q2, we delivered five units of EHang 216 AAVs for the customer's initial purchase order and initiated trial flight operations in Aizhai. The customer plans to produce additional 25 units of EHang 216 in the future. This project create a replicable public and private business cooperation model for low-altitude flight tourism, which is helpful for expanding our ongoing business projects in other regions.\n\nAccording to statistics, China has more than 300 5A-level scenic spots and over 4,000 4A-level scenic spots, indicating tremendous market potential for expanding low-altitude flight tourism. Against this backdrop, we are making excellent progress in our 100 air mobility route initiative. So, far, more than 5,700 operational trial flights of EHang 216 has been conducted in practical aerial sightseeing the scenario at 11 operation spots in China. After obtaining the airworthiness certificate, EHang 216 is expected to provide our tourism customers and end users with a unique, safe, technologically advanced, cost-effective, and a pleasant low-altitude flight tourism solution and experience.\n\nIn Southeast Asia, where the U.N. market is also in high demand, it has rich use cases. We are actively expanding our presence through the empowerment of local partners. In Q2, we received a preorder for 100 units of EHang 216 AAVs from an Indonesian aviation company, Prestige Aviation, which is the largest to preorder we have received in Asia so far.\n\nWe've also reached a strategic cooperation with CP Group, one of the largest conglomerates in Thailand, with an intent to establish a joint venture, we're introducing EHang AAVs to Thailand. The two parties also intend to carry out comprehensive cross-sectoral cooperation in aerial tourism, aerial logistics and transportation, urban mobility and smart city management in the future. We expect the signs of a business recovery in the second half of this year as we are actively adapting to the macro environment, continuing moving forward on EHang 216 certifications, securing more product orders and expanding our original aerial media business in the Europe market. We remain confident in our growth potentials and long-term outlook, in our core values, and unique advantages.\n\nI will now turn the call over to our CFO, Richard Liu, for financial results. Richard, please go ahead. Thank you.\n\nRichard Liu -- Chief Financial Officer\n\nThank you, Xin, and hello, everyone. Before I go into details, please note that all numbers presented are in RMB and for the second quarter of 2022, unless stated otherwise. Our percentage changes are on a quarter-over-quarter basis, unless otherwise specified. Detailed analysis are contained in this press release, which is available on our IR website.\n\nI want to highlight some of the key points here. In the second quarter of 2022, our strategic shift toward an urban air mobility platform continued as we aim for a solution and operational service-integrated model. The ongoing efforts are yielding positive results, with increasing deliveries in China and orders or preorders in Asia, reflecting our solid business strengths. As we continue to focus on the EHang 216 type certification process, we also made further development in our 100 Air Mobility Routes Initiative with continuously increased operational trial flights, as well as expansion of operation spots in China.\n\nAdditionally, we struck a strategic partnership with the Agricultural Bank of China, Guangzhou branch, for 1 billion RMB indicative credit facilities to support our strategy execution and the business growth in the following years. In Q2 of 2022, total revenues were 14.6 million, representing an increase of 152.5% from 5.8 million in Q1. This was along with a 166.7% increase in EHang 216 AAV deliveries in Q2 to eight units from three units in Q1. Demand for our AAV products have been increasing both in China and internationally.\n\nOne typical example in China is that in Q2 we delivered five units of EHang 216 AAVs to a local government-backed tourism operator in Hunan Province for aerial sightseeing operational services. The customer plan to buy additional 25 units as the project progresses. Another example is that we have obtained preorders of up to 210 units from customers in Japan, Malaysia, and Indonesia since the beginning of this year. And we see the trend of further expansion in Southeast Asian markets.\n\nAdditionally, we were able to further drive a 4.6 percentage points expansion in gross margin to 67.1% in Q2 from 62.5% in Q1. Even though our overall gross margin has already been at a high level compared to other new energy mobility product companies, such as electric car companies, this continues to show our competitive edge as the first mover in the global UAM and AAV industries. In Q2, our adjusted operating expenses, which are operating expenses excluding share-based compensation expenses, were 63.4 million compared with 46.1 million in Q1. The increase was mainly attributed to continuous R&D of new AAV models in the ongoing EHang 216 certification process, both of which are progressing steadily.\n\nAnd professional service fees related to any reprofiling and other legal matters and additional provisions for accounts receivable in light of impacts from the ongoing COVID-19 epidemic and the control measures in China. With that, in Q2, our adjusted operating loss was 51.2 million compared with 41.7 million in Q1. Our adjusted net loss was 50.8 million in Q2 compared with 40.9 million in Q1. Our balance sheet remains solid with 240.7 million of cash, cash equivalents, restricted cash, and short-term investments as of the end of Q2 even we saw a slight increase of 3.8 million quarter the quarter.\n\nWith that, we believe our business is on a good track. That concludes our prepared remarks. Let's now open the call for questions. Operator, please go [Technical Difficulty]\n\nOperator\n\n[Operator instructions] We have the first question -- please stand by. The first question, from Tim Hsiao. Please go ahead. Your line is open.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nHi, management team. Thanks for taking my questions. I actually have you have two quick question. The first one is, we saw EHang having been making some good progress in terms of their customer acquisitions, especially in Asia, over the past few quarters.\n\nJust wondering how many preorders we've got so far and when do we plan to start the delivery. And in addition, could I also get some updates regarding our collaborations with the government? And what kind of size of the contribution should we expect, and when do we think it's going to kick in? And my second question is about the funding, the investments. Because we noticed that with half of the partnership with the Agriculture Bank of China, and that that entitles to around billions, the indicative credit facilities. Just wondering how we are going to use that and how we're going to accelerate the investment in the upcoming months.\n\nAnd what kind of a cash rate do you have -- does it look like now? So, could you share a little bit more information about our investment plan in the upcoming quarters? Thank you.\n\nJulia Qian -- Investor Relations\n\nThanks for your questions. Please give us a second to translate the questions to the management team. We will provide your answers with the translation later. Thank you.\n\nXin Fang -- Chief Operating Officer\n\n[Foreign language] Hi, Tim. This is Fang Xin. Let me take your first question about orders. Since the beginning of this year, we have received a total of 210 units of preorders for passenger-grade AAVs in the Asian market.\n\n[Foreign language] The more than 200 units of preorders in Asia are expected to be delivered in about three years, subject to customer needs and our obtaining the type certificate in China or other relevant certification in a local market. [Foreign language] In addition to the preorders, we also have received some customer orders both in hand or in discussions which are able to be quickly delivered in a short time based on the customer's demands. For example, in Q2, we received the orders from the customer in Jishou and also completed the deliveries for the first batch of five units which have already been put into our operations. [Foreign language] At present, we are in talks with some local governments regarding potential cooperation and plans to set up operational centers in different regions in order to actively prepare for the commercial operations.\n\nOnce we obtain the type certificate. We have already signed a strategic cooperation agreement with certain governments. Upon this agreement, there will be some purchase orders which stands to be completed successively within this year and expected to make a notable contribution to our full year results.\n\nRichard Liu -- Chief Financial Officer\n\nHi, Tim. This is Richard. I will take your second question. Basically, this partnership is the first time that Agriculture Bank of China, as one of the largest commercial bank, to partner with and grant such indicated credit facilities to us as a innovative AAV technology company.\n\nThis represents the traditional financial institutions have started to tap into this type of new industry. So, it is a good sign not only for EHang but also, I believe, for the industry. Basically, the 1 billion RMB indicated credit facilities cover comprehensive banking products and services of Agriculture Bank of China to support our operations and business development over the following years, including regular credit loans, financial leasing, supply chain financing, etc. So, as a starter, they have extended to us a 30 million RMB credit loan.\n\nFurther, we have been discussing the financing -- our financial leasing option to facilitate our business growth after the TC is obtained. Thus, in the in the near term, money will be used more toward supporting operations and the sales growth. In respect of investment, in terms of capex investment, and so as we have an existing production facility, we will see how the sales would grow to plan for any future capex needs. Regarding the cash burn, as you know, EHang has been running a lean operation in China.\n\nAnd this is somewhat EHang's unique style if compared to others. You probably can get a feeling from our cash flow statements. If you ask for current level to give you a rough idea, the current average monthly cash burn rate of our operations is around 17 million RMB or roughly $2.5 million. If annualizing it, you would get around 200 million RMB or roughly $30 million.\n\nAs it is expected that sales would increase after the TC is obtained, the operational cash flow or the cash burn situation is expected to be further improved following that. Hope this answer your question.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nYes. Thank you very much, Mr. Fang and Richard, for the detail-sharing. Thank you.\n\nOperator\n\nThank you for your question. The next question -- please stand by. We're taking the next question from De Lu. Please go ahead.\n\nYour line is open.\n\nDe Lu -- Tianfeng Securities -- Analyst\n\nThank you. Thank you for taking my questions. And I have two questions as well. The first one is, could the management team elaborate a little bit more on the business model for the AAV for the tourist attraction corporation.\n\nLike, for example, will the tourist attraction be leasing or buying the AAV from EHang? Or who will be operating the AAV and such? And for second question, now that we've seen that there are many competitors now in the making of AAV, what would the management team feel if the most important innovation to stay as AAV industry leader, for example, like battery or noise cancellation technology or propeller technology, or like having a command-and-control center, like, which of -- like, what will be the most crucial? How is EHang doing in that particular area? Thank you so much.\n\nJulia Qian -- Investor Relations\n\nThanks for the questions. Please give us a second for translation.\n\nDe Lu -- Tianfeng Securities -- Analyst\n\nOf course.\n\nXin Fang -- Chief Operating Officer\n\n[Foreign language] Hi, Lu De. This is Fang Xin. I will take your questions. The demand and the business model for aerial sightseeing has been expand, have existed for a long time.\n\nThe traditional ways, including the cable cars and helicopters, which can not only provide the tourists with a fresh aerial sightseeing experience but also serve as a point-to-point transportation vehicles in scenic spots, which are favored by both the tourists' and the scenic spot operators. [Foreign language] By the nontraditional ways has certain limitations, such as the high cost and the expenses for infrastructures, the aircraft acquisition and the maintenance and professional pilots. Therefore, the scenic spot operators cannot have a good return on investment. [Foreign language] The key innovation of our AAVs is that they are designed for the multiple use cases with features of a high safety, efficiency, and the low-cost operations reflected in our aircraft structure and a full redundancy safety design and a fleet management.\n\nIn terms of the aero tourism, the EHang 216 can realize stable flights in low altitude based on our modulatory structure. And it can be centrally monitored and managed. And what's more, it's the high cost of hiring professional pilots. [Foreign language] The scenic spots, as our customers, can purchase or lease our AAVs.\n\nWe're only providing infrastructures for qualified operators who can take charge of flight monitoring in our operational spots. [Foreign language] EHang provides both the AAV sales and the UAM operational services to our customers. Taking our partnership with Jishou customer as an example, in Q2, our customer not only placed the purchase order for the EHang 216 but also plans to work with us to develop a scenic flight project at Aizhai Wonder. It's a national 5A-level scenic spot in Hunan through both parties, complementary resources, and joint operations.\n\n[Foreign language] Regarding your second question, as an industry leader, our autonomous technology is our leading competence in the AAV industry. While other competitors are still at this stage of managing and controlling it. In terms of our autonomous technologies. We have invested all our efforts from day one, including flight control algorithms, the flight list systems, the battery system, and also the command-and-control systems, altogether integrated unmanned aircraft system.\n\nWith continuous iteration and evolution of these technologies, we are able to stay ahead in industry. That's the answer to your questions. Thank you.\n\nDe Lu -- Tianfeng Securities -- Analyst\n\nThank you so much.\n\nOperator\n\nThank you for your question. We're going now to take our next question, please stand by. And the next question, from [Inaudible]. Please go ahead.\n\nUnknown speaker\n\n[Foreign language] Let me translate quickly here. I have two questions. First, on the technology, any differences in the entry barrier across the logistic firefighting and also the passenger AAV? And can these different products share the same production lines? And what's the roughly units level to break even? My second question is on safety. Could we take over the flight if any emergency happens? And if hackers paralyze the system, what can we do to let the AAV safely land? Thank you.\n\nRichard Liu -- Chief Financial Officer\n\nHi, [Inaudible]. This is Richard. Thanks for your question. Let me try to answer the questions.\n\nSo, basically, our 216-L, the largest model, 216-F the firefighting model, are essentially within the, we call it, the 216 series of products. Basically, our approach has been to first focus on developing a fundamental model for passenger-carrying use, which is the corresponding model is 216-S. It requires large pay route and the highest safety level and then further develop 216-L and 216-F on top of the fundamental model based on different specific needs. The core modules, such as flight control, propulsion, etc., are the same, actually, the relevant functional parts are tailor made to suit for different needs.\n\nWith that, I guess you probably can tell now, the entry aerial was due beyond the core technology parts which are shared and require a large amount of time and manpower to be developed. As to the production line. It can also be shared. In respect of breakeven, we can look at them as a whole.\n\nTo give you a rough idea, it is estimated that a new sales of roughly -- to give you a rough range, at around 250 to 300 units of 216 series of products to carry the company to breakeven on an adjusted basis, given the current level of expenses and the crisis. And regarding your second question. So, basically, our AAVs fly by itself along the predetermined flight routes in normal situation. In case of emergency, the AAV usually can deal with the situation by itself.\n\nHaving said that, if necessary, the ground operational staff who are monitoring the flight can take over the control through the ground command-and-control system. In respect of your hacking question, the connection between the AAV and the command-and-control system is through wireless private network and separated from the public network. And there are high-level substitute of protection measures. So, in case on the ground command-and-control system will be hacked, the AAV can still fly by itself to complete the predetermined flight or find the nearest safe area to land.\n\nI hope I answer your question. Thank you.\n\nUnknown speaker\n\nThank you, Richard. It's very clear. Thank you.\n\nOperator\n\nThank you for your question. There are no further questions. I will now have the conference over for closing remarks. Please go ahead.\n\nJulia Qian -- Investor Relations\n\nThank you, operator. And thank you, all, for participating on today's call and for your support. We appreciate your interest and look forward to reporting to you again next quarter on our progress.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJulia Qian -- Investor Relations\n\nHuazhi Hu -- Chief Executive Officer\n\nXin Fang -- Chief Operating Officer\n\nRichard Liu -- Chief Financial Officer\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nDe Lu -- Tianfeng Securities -- Analyst\n\nUnknown speaker\n\nMore EH analysis\n\nAll earnings call transcripts"
}