{
  "companyName": "Rite Aid",
  "companyTicker": "RAD",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/29/rite-aid-rad-q2-2023-earnings-call-transcript/",
  "content": "Rite Aid (RAD 0.91%)\nQ2 2023 Earnings Call\nSep 29, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the Rite Aid Corporation fiscal year 2023 second quarter earnings conference call. Please note, today's conference is being recorded. [Operator instructions] At this time, I will turn the conference over to Byron Purcell, vice president of investor relations and treasurer. Mr.\n\nPurcell, you may begin your conference.\n\nByron Purcell -- Vice President, Investor Relations and Treasurer\n\nThank you, Erica, and good morning, everyone. We welcome you to our fiscal 2023 second quarter earnings conference call. Heyward Donigan, president and chief executive officer; and Matt Schroeder, executive vice president and chief financial officer, will begin the call with prepared remarks. Andre Persaud, executive vice president and chief retail officer; and Chris DuPaul, chief operating officer of Elixir, will also join the call during the question-and-answer session.\n\nAs we mentioned in our release, we are providing slides with the material we will be discussing today. These slides are provided on our website, investors.riteaid.com. While management will not be speaking directly to the slides, these slides are meant to facilitate your review of the company's results and to be used as a reference document following the call. Before we start, I'd like to remind you that today's conference call will include certain forward-looking statements.\n\nThese forward-looking statements are presented in the context of certain risks and uncertainties that can cause actual results to differ. These risks and uncertainties are described in our press release and Item 1A of our most recent annual report on Form 10-K and other documents that we file or furnish to the SEC. Also, we will be using certain non-GAAP measures in our release and in the accompanying slides. The definition of the non-GAAP measures, along with the reconciliation to the related GAAP measure, are described in our press release and slides.\n\nWith that, let me turn the call over to Heyward.\n\nHeyward Donigan -- Chief Executive Officer\n\nThanks, Byron, and good morning, everyone. Thanks for joining the call today, and welcome to our second quarter earnings call. Q2 saw us continue to build on our momentum to become a leading full-service and modern pharmacy. We are 53,000 associates strong, including a team of 6,400 pharmacists, that together are caring for our communities and customers to drive better health outcomes.\n\nRevenue for the quarter was $5.9 billion, compared to $6.1 billion in the same quarter last year. Q2 adjusted EBITDA was $78.5 million, compared to last year's second quarter adjusted EBITDA of $106.2 million. Retail Pharmacy sales and gross profit dollars were negatively impacted by the expected decline in demand for COVID vaccines and PCR tests. We've made good progress on key initiatives during the quarter, including driving prescription growth, improving operating margins at Elixir and achieving significant reductions in SG&A expenses across our business.\n\nOur front-end performance, however, trailed expectations due to cautious consumer spending in this environment and continued supply chain challenges. Diving into our segment results, starting with our Retail Pharmacy business. Revenues decreased 1.1% over the prior year quarter driven by the expected reduction in COVID vaccine and testing revenue, as well as planned store closures. Overall, comparable sales increased 5.6%.\n\nTotal same-store prescriptions increased 2.1%, excluding COVID immunization with same-store maintenance prescriptions increasing 1.2% and same-store acute prescriptions increasing 5.3%. We also improved our overall prescription market share by 14 basis points for same stores, bringing us to over 11% share. This demonstrates the strength of our local pharmacy teams and their customer relationships, as well as our ability to navigate volatile labor markets and increase our participation in limited pharmacy networks with PBM. While we're early in the flu season, we are already seeing more demand for flu vaccines.\n\nWe've received 2.7 million flu vaccines with more on the way to ensure our teams can protect customers during the height of the flu season in third and fourth quarter. We've also seen strong demand for COVID bivalent vaccines just over the last few weeks. Using our Health Dialog clinical analytics, we have identified customers who are more likely to agree to the co-administration of two or more vaccines at the same time. As a result, almost 40% of those who got their COVID bivalent vaccines also received another vaccine.\n\nOne of the key areas of improvement for Rite Aid is to drive increased medication adherence for our customers. Every 1% increase in adherence provides $20 million in gross profit to the company. One way we encourage medication adherence is our courtesy refill program. 600,000 new customers have enrolled in our program since July.\n\nWe expect this initiative to add $10 million in pharmacy gross products in FY '23 with most of the benefit accruing in the second half of this year. This is just the beginning. We expect more customers to continue to enroll in courtesy refill, and we plan to engage in strategic partnerships to help drive further adherence. What's important about improving our customers' adherence to their medications is not only that it drives script growth for the company, but it also drives better health outcomes and lower healthcare costs for our customers.\n\nWe saw an increased demand for OTC antigen tests in the second quarter with over 3 million test kits dispensed. And while the availability of antigen test has reduced the demand for PCR tests, our new partnership with Quest Diagnostics, which commercializes PCR tests, has allowed us to expand our offering of PCR tests to every store in our footprint. We're excited to work with Quest going forward to provide testing for flu this season, and we expect there to be a lot of flu this year. And we look forward to exploring other convenient testing options for customers as a result of this partnership.\n\nFront-end same-store sales were soft in the second quarter, declining 30 basis points. Excluding cigarettes and tobacco products, however, we increased by 20 basis points. We saw good results in seasonal, health and consumable categories, offset by underperformance in prior year's very strong alcohol results, overall general merchandise, beauty and personal care. Beyond this, we experienced unexpected headwinds this quarter from front-end shrink, particularly in our New York urban stores.\n\nGiven the current economic environment, we expect to see a cautious consumer in the back half of the year. In addition, the current supply chain environment has challenged our ability to remain in stock, particularly in our over-the-counter and private label products. We do expect these challenges to continue to pressure front-end sales during the remainder of the year, which is the reason for the adjustment to the full year Retail Pharmacy EBITDA guidance that Matt will discuss in more detail. Despite these sales challenges, we are seeing some positive indicators in our markets.\n\nOur front-end margins have improved due to the change in our loyalty program, which reduced the amount of markdowns. We have seen strong improvements also in the brand positioning of the Bartell's drug banner as measured by the Ipsos brand equity survey. In fact, Bartell's is the No. 1 drug store brand in the Seattle market now.\n\nWe have also seen improvements in the brand position ranking for Rite Aid. Brand equity improvements, as you know, are an early indicator of increased traffic to our stores. On the Elixir side of the business, we have continued to build on momentum from last quarter driven by improved rebates and network performance management, as well as meaningful cost control. Elixir continues to build on its operational capabilities to drive improved efficiencies, enhanced automation and better service and reporting to our customers.\n\nAnd as we've noted before, Elixir is so much more than a PBM. Our assets include mail-order pharmacy, specialty pharmacy and Laker, our adjudication platform, as well as a cash card adjudication and analytics business. We have substantially integrated the back-office functions of Elixir and Rite Aid and are now integrating all of the platforms and processes across both segments. While our PBM business remains competitive, and we are still winning new business, our sales growth has slowed as more potential clients are sticking with their incumbent vendors.\n\nWe expect sales to accelerate again, given that we expect more companies will be willing to change PBMs in the coming year. We're closing in on our retention for our renewals for our 1/1/23 business, and the current outlook for retention is 78% overall. And if you exclude the one client loss we previously reported, we are at 96% retention, which is high. For our second quarter, Elixir reported revenues of $1.7 billion, compared to $1.9 billion for the last year's second quarter.\n\nThis was primarily due to a planned decrease in Elixir Insurance membership and a previously announced client loss due to industry consolidation, partially offset by a combination of higher drug spend and utilization. Elixir's second quarter adjusted EBITDA was $47.1 million versus last year's second quarter adjusted EBITDA of $36.8 million due to strong rebate and network performance management, as well as a reduction in SG&A expense. We expect our first half EBITDA run rate at Elixir to continue through the rest of the fiscal year, and therefore, we are raising guidance for Elixir. Back to the business overall.\n\nWe've been focused on driving SG&A reductions and productivity improvements, achieving a reduction in SG&A of $85 million in the first half of the year. And based on this momentum and additional planned reductions in payroll, store operations and corporate administrative expense in the back half of the year, we expect to achieve SG&A savings of $190 million in fiscal 2023. And this is just the beginning. We are in the process of a large-scale reinvention of our front-end operations called the Rite Way.\n\nWe expect this initiative to contribute $20 million to $40 million in productivity and labor improvements in FY '24. We are also investing in automation of our supply chain starting with our distribution center in Seattle, which came with the Bartell's acquisition. This will provide our stores with better, more reliable service and improve our productivity. We expect a 40% ROI for this supply chain initiative.\n\nThis will also drive benefit in distribution and handling costs in FY '24. We also demonstrated strong digital and omnichannel engagement with our customers over the last quarter, creating a more personalized customer experience and ultimately exceeding our expectations with respect to overall digital customer engagement. This increased engagement drove a 70% year-over-year increase in digitally driven revenues and gross profit with the growth focused in our first-party, third-party and delivery marketplaces. We're in the process of launching new capabilities for our customers with customer convenience top of mind.\n\nIn addition, we're building further digital pharmacy capabilities to make it simpler to transfer prescriptions from other pharmacies to Rite Aid and receive helpful pickup reminders, offering the option of having their prescriptions delivered to their home or offices or picked up in store. We're on track to open four new small-format stores in underserved markets in Virginia and New York before the end of the year. These are the start of a pilot to achieve meaningful growth by locating apothecary pharmacies in underserved markets. Turning to our financial position.\n\nAs you'll hear momentarily from Matt, we continue to make progress on our capital structure. As you know, during the quarter, we executed a successful bond tender offer that resulted in a $40 million reduction of our outstanding debt. We remain confident in our ability to generate free cash flow for FY '23, and we remain committed to achieving our target of a 4.5 times leverage ratio by the end of FY '25. To close, despite the challenges in our front-end business, we are really encouraged by our strong script growth and solid Elixir results.\n\nI'm excited to keep driving the business forward, encouraging our teams to take advantage of growth opportunities, capture additional market share and positively impact our operating results this year and into next year. We're committed to committing long-term value for our shareholders even in this difficult economic environment as we grow our modern pharmacy business. With that, I'll turn things over to Matt to go over our financial performance. Matt?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nThanks, Heyward, and good morning, everyone. Revenues for the quarter were down $211.9 million or 3.5% from the prior year second quarter driven by a decline in COVID testing and vaccine revenue, the impact of closed stores and lower membership at Elixir. Second quarter net loss was $331.3 million or $6.07 per share, compared to last year's second quarter net loss of $100.3 million or $1.86 per share. The increase in net loss in the current quarter is due primarily to a charge of $252.2 million or $4.62 per share for the impairment of goodwill related to Elixir.\n\nNet loss was also impacted by higher facility exit and impairment charges driven by the company's previously announced store closures. These items were partially offset by a gain on sale leasebacks of two of our distribution centers and certain stores and a gain on debt retirement resulting from the bond tender offer that we completed this quarter. A few words on the impairment charge at Elixir. We've begun the process of developing the operating budget for fiscal 2024.\n\nWhile we are at the beginning of this process and have several months of work ahead of us, there are certain factors that we've noted that caused a triggering event for the assessment of goodwill impairment under generally accepted accounting principles. These factors include an update to our estimate of lives for 2023 based on the latest selling season, the Elixir Insurance bid results and other business factors. The impairment was recorded based upon an update of our valuation related to fiscal 2024 and future years. As I said, we have much work to do to build out our detailed plan for fiscal 2024 and are not prepared to give any additional color on the fiscal 2024 outlook at this time.\n\nNow let's discuss the key drivers of operating results in our business segments. Retail Pharmacy segment revenue for the quarter was $4.23 billion, which was $45.4 million lower than last year's second quarter driven by the expected decrease in COVID-related revenue and store closures, partially offset by an increase in both maintenance and acute non-COVID immunization prescriptions. Retail Pharmacy segment same-store sales increased 5.6% with an increase in same-store pharmacy sales of 8%. We administered 875,000 COVID vaccines in the second quarter of fiscal 2023, compared to 2.5 million in last year's second quarter.\n\nWe also cycled a reduction in PCR testing demand, offset somewhat by the impact of increased antigen testing sales. Outside of the COVID vaccine impact, maintenance scripts were up 1.2%, and acute scripts were up 5.3%. Front-end same-store sales, excluding cigarettes and tobacco products, increased 20 basis points versus last year. Front-end same-store sales were driven by increases in health and consumable products, offset by decreases in alcohol and general merchandise.\n\nFront-end sales were less than our expectations due to a cautious consumer and supply chain challenges. Front-end gross profit was impacted by a $5 million increase in shrink as we recorded the annual impact of physical inventories on a disproportionate number of our urban stores. Front-end margin benefited from a reduction in markdowns resulting from the change to our loyalty program. Second quarter Retail Pharmacy segment adjusted EBITDA was $31.5 million or 0.7% of revenues, compared to last year's second quarter adjusted EBITDA of $69.4 million or 1.6% of revenues.\n\nThe decrease in adjusted EBITDA and EBITDA margin is attributed to lower COVID vaccinations and testing, front-end sales pressures and higher shrink results, offset by increased COVID prescription volumes and reduced SG&A. As Heyward noted, through courtesy refill, we have begun to increase our rate of dispensing generic prescriptions as a percent of our total during the quarter. We expect this to provide a $10 million benefit to adjusted EBITDA in the back half of the year. Retail Pharmacy segment adjusted EBITDA SG&A expenses were $45 million or 80 basis points better as a percent of revenue than the prior year second quarter due to lower payroll, occupancy and store operating expenses driven by store closures and our cost reduction initiatives.\n\nBased on this momentum and additional planned reductions in payroll, store operating and corporate administrative expenses in the back half of the year, we now expect to achieve SG&A savings of $190 million in fiscal 2023, compared to the $170 million that we discussed in our year-end earnings call. Before moving to Elixir, I want to spend a couple of minutes talking about the quarterly cadence in adjusted EBITDA in our retail business. Our front-end sales and gross profit will fluctuate quarter by quarter due to demand for over-the-counter and seasonal products, which are our highest margin products. Because of this, our fourth quarter is typically our strongest quarter for front-end gross profit.\n\nPharmacy gross profit is sensitive to fluctuations in demand in cough, cold and flu prescriptions, which are typically highest in our first and fourth quarters and for demand for flu immunizations, which are highly profitable and administered almost exclusively in the back half of the fiscal year. These factors contribute to our second quarter typically being our weakest quarter in our retail business. Additionally, as I just noted, we are reducing SG&A expense by additional $20 million in the back half of the fiscal year with efforts focused on retail and corporate admin expenses. I'll now shift to our Pharmacy Services segment, Elixir.\n\nFor our second quarter, Elixir saw revenues decreased $171 million or 9% to $1.73 billion due primarily to a planned decrease in Elixir Insurance membership and a previously announced client loss, partially offset by increased utilization of higher-cost drugs. Elixir's second quarter adjusted EBITDA was $47.1 million or 2.7% of revenues versus last year's second quarter adjusted EBITDA of $36.8 million or 1.9% of revenues. The current quarter benefited from increased gross profit resulting from strong rebate and network performance management, as well as a reduction in SG&A expense, partially offset by the decline in revenue associated with lost clients. I'll now turn to our cash flows and balance sheet.\n\nOur cash flow statement for the quarter shows the use of cash from operating activities of $199 million driven by the build of the CMS receivable which we expect to securitize later this year, increases in inventory due to seasonal build and inflation and the timing of payments for interest and bonus expense. All of these are timing items that we expect to reverse later in the year. Cash provided by investing activities was $4 million for the quarter. Included in net investing activities were script file sales attributed to our store closings and sale leaseback proceeds of $46 million.\n\nOur net debt balance was approximately $3.2 billion at the end of the quarter as we continue to build out our CMS receivable and seasonal inventory in our retail business. We expect our leverage ratio to be in the lower five times range by the end of the fiscal year and to generate positive free cash flow for the year. Now I'll turn to guidance. Based upon second quarter front-end results and anticipating pressures on front-end sales and supply chain and continued throughout the remainder of last fiscal year, we are lowering our retail segment adjusted EBITDA guidance for the year.\n\nWe are raising our guidance for Elixir based on our expectation that the results we saw in the second quarter will continue for the remainder of the year. The net impact is a $10 million reduction in our previously announced EBITDA guidance for fiscal 2023 from a previously announced range of $460 million to $500 million to our new range of $450 million to $490 million. Adjusted EBITDA in the Retail Pharmacy segment is expected to be between $305 million and $335 million. As discussed earlier, there are several factors that drive a second half retail EBITDA performance that is higher than the first half, including the benefit from flu immunizations, the recent rollout of bivalent vaccines, the impact of cough, cold and flu in Q4 on both our front-end and pharmacy businesses and continued management of markdowns to drive improved front-end margins.\n\nOffsetting these gross profit benefits is an expectation that front-end sales trajectory in the back half of the year will be similar to the front half and that continued supply chain challenges will decrease the benefit that we expected from the rollout of our owned brand products at the beginning of the year. We achieved significant retail SG&A reductions in the first half of the year due to store closures, retail labor efficiencies and reductions in store operating expense. We expect to reduce SG&A further in the back half of the year driven by additional reductions in store labor, store operating and corporate admin costs. This is in contrast to the second half of last year, which saw an increase in retail SG&A expense in the second half of the year due to vaccine demand.\n\nAdjusted EBITDA at Elixir is expected to be between $145 million and $155 million. We expect to rebate in network performance management and SG&A trends that we saw in Q2 to continue through the remainder of the fiscal year despite the reduction of lives that will occur on January 1. Total revenues are expected to be between $23.6 billion and $24 billion. Adjusted net loss per share is expected to be between $0.97 and $1.52 per share.\n\nCapital expenditures are expected to be approximately $225 million. We continue to make investments to grow our business, including pursuing prescription file purchases and investments in digital. We also continue to seek to enhance our efficiency by automating our supply chain and transforming our processes and technologies at Elixir. Interest expense is projected to be approximately $216 million and reflects the impact of the latest round of rate increases announced last week.\n\nAnd we expect to generate positive free cash flow to continue to pay down debt. This completes our prepared remarks. Erica, could you please open the phone lines for questions?\n\nOperator\n\n[Operator instructions] Your first question comes from Elizabeth Anderson with Evercore ISI.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nHi, guys. Thanks so much for the questions. My first question is, you noted some supply chain challenges. Have you seen any sign that they're easing yet?\n\nHeyward Donigan -- Chief Executive Officer\n\nElizabeth, it is good to hear from you again. And actually, the supply chain has eased in quite a number of areas. The problem now is that it's isolated in some areas that are important to us. And I'll let Andre comment on the specifics.\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nThanks, Heyward. When we look at our supply chain, the in-stock rate has improved, but it's flattened out. And one of the biggest challenges we're seeing right now, commitments from suppliers on get well updates in categories that are important to us are being pushed out further and further based upon their capacity, labor constraints and the ability to manufacture. So that's really the headwind we're challenged with for the rest of this year at this point in time.\n\nHeyward Donigan -- Chief Executive Officer\n\nYeah. We've seen a relief at the ports. We've seen relief in trucking as the issue, I think, seems to be labor now. And I'll comment on our own labor just for a little bit of color.\n\nThe -- because this gives you an indication of cough, cold, flu and COVID. People are getting sick, and people getting sick, they go out and then across the board, both our own supply chain and our own stores and our own associates are impacted by that is kind of a key part of the issue right now. A lot of people talking about wages and the tight labor market, but some of it is actually due to illness.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. OK. When I'm thinking about your retail EBITDA in the quarter, the $31.5 million, it seems like at least you did like 875,000 vaccines in the quarter. It's -- and obviously, the test that you also required.\n\nIt seems like your EBITDA might have been negative on a core basis ex-COVID. Is that the right way to think about that?\n\nHeyward Donigan -- Chief Executive Officer\n\nMatt, I'll let you answer that.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah. Elizabeth, it's Matt. Thanks for the question. No, I think that's a pretty aggressive read of the benefits of vaccines and testing.\n\nWe did do 875,000 vaccines in the quarter, so that certainly had an impact on EBITDA. But at kind of our $20 a script estimate, that certainly doesn't get you to a negative number. Testing, we had a slight headwind in, but we actually made up some ground on antigens. The other thing though that impacted the quarter that are issues that we're currently working through that we talked about but I don't expect to occur on an ongoing basis are one, the disproportionate amount of shrink that we recorded this quarter related to inventory of many of our urban stores and seeing the results there.\n\nAnd the second part is when you have flat front-end comps, that is something that certainly on the long term, we would not expect to continue and had a depressing impact on the quarter as well. But if you pull out just the vaccines, you're still at positive EBITDA for the quarter, thanks to -- even with the shrink and the challenging front-end headwinds, thanks to the work we did on SG&A.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. And what was the shrink -- did you quantify -- I'm sorry if I missed it, quantify the impact of shrink in terms of dollars in the quarter?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nIt was $5 million worse than it was in last year's second quarter.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nOK. Got it. Thank you.\n\nOperator\n\nYour next question comes from the line of Lisa Gill with J.P. Morgan.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks very much. Good morning. Matt, just kind of following up on that line of questioning when we think about your back half guidance.\n\nYou talked about flu vaccine, COVID vaccine, cough, cold, flu. Is there a way to kind of put some numbers around that, how we should think about, one, the number of vaccines that you currently have in your expectations? And then secondly, how do we think about the profitability, for example, of flu vaccine? And I know that once the public health emergency is done, perhaps we see managed care pay for COVID vaccines more like flu vaccine. So just any color you could help us how to think about those things in the back half of the year would be great.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah, Lisa, thank you. Happy to address that. So first of all, I'll start with flu vaccines. We plan to do close to 3 million flu vaccines this year, and almost all of them are planned to be in the second half of the year.\n\nSo that is a pretty big tailwind in the second half of the year for us. Flu vaccines are about $25 gross profit per script. So they're a very profitable vaccination. Incidentally, touching on your question about COVID, I don't think it happens this year, but at some point, when COVID stops being sponsored by the government and goes to a more commercial program, my expectation is that's probably somewhere in that line -- in that ZIP code is where we end up on COVID.\n\nBut for the moment, we're still seeing the same kind of margins we saw last year. COVID, we did about 2.5 million vaccines in the first quarter. Our guidance for the back half of the year assumes we do something pretty -- right around that number in the back half of the year with the bivalent vaccines, which I think is a pretty reasonable assumption. Cough, cold and flu, we have had -- as we tried to lay out what we thought cough, cold and flu was going to have is an impact on us for the back half of the year.\n\nYou really got to go back pre-COVID to kind of go back to what I would call a normal cough, cold and flu season. But I think we're going to see one this year, given kind of indications we're seeing out of Southern Hemisphere and given that absent another implementation of lockdown measures, which I don't see happening, I would expect a pretty normal cough, cold and flu season. And that's going to give us a pretty nice benefit in gross profit dollars in the fourth quarter. The other thing to think about from a guidance standpoint is that we are -- with the store closures that we've done, some of which we were still executing on actually closing during the first and second quarters.\n\nAnd then the additional SG&A cuts, I expect our run rate on SG&A to improve, comparing first half to second, your SG&A actually get lower by about $20 million to $30 million as well with the initiatives we're taking. And you contrast that to last year where SG&A actually got higher just because we were almost overwhelmed with the vaccine demand. We got a much, I think, better bead on what we need to accomplish to fulfilling these vaccines efficiently. So I'll pause there, but there's really some kind of indicators in the second half that give us confidence in the guidance that we have.\n\nHeyward Donigan -- Chief Executive Officer\n\nAnd I would just add -- sorry, Matt, I would just add that we are seeing much higher volumes of Tamiflu just in the last few weeks, prescriptions for flu. So we do think that, number one, it will be a pretty heavy flu season, all indicators. And number two, COVID is still raging. So --\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nNo, it feels that way, right? It feels that everybody's sick. But I also want to just follow up on one quick thing. And that was your comment as we think about Elixir. We understand that the lives are going to roll off.\n\nBut I'm just curious, are there any changes to plan design for January 1? I know it will have a limited impact, just given the timing of your fiscal year-end. But as we think about your PBM going forward, you've talked about the benefit of rebate. You've talked about the benefit of network. But is there anything going to be incremental for January 1 start date that could impact the fiscal '24 numbers?\n\nHeyward Donigan -- Chief Executive Officer\n\nMatt, I'll hand it to you, and maybe Chris could add color.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah. I think from a pure number standpoint, Lisa, the best I can probably comment on for fiscal '24, and then we got a lot more work to do to build out. The plan is I'd expect a step down in lives in fiscal '24, given the results of the selling season combined with the loss of the client that we talked about. We're still finalizing our ultimate live estimates, though.\n\nSo it'd be premature for me to give you an exact number. I do expect the benefits we're getting from network management to continue at a minimum into fiscal 2024. I think we have some opportunities outside our book to grow in the specialty business. But clearly, from a pure lives standpoint, we would expect to be down, and that's what drove the goodwill impairment that we took.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. Thanks for the comments.\n\nOperator\n\nYour next question comes from the line of George Hill with Deutsche Bank.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nYeah. Good morning, guys, and thanks for taking the questions. I guess, Matt and Heyward, I wanted to ask a little bit about the new promotional and discount program, which, Matt, I know I questioned you about a little bit during the quarter. I guess can you talk about maybe, Heyward, the impacts you're seeing on customer loyalty? And Matt, just kind of from a financial and accounting perspective, can you talk about how the changes in kind of the accounting around the loyalty program impact front-end comps and kind of like if there's a call out there that we can quantify?\n\nHeyward Donigan -- Chief Executive Officer\n\nSure. Hey, George. First, let me just say that the change in the loyalty program has driven significant improvements in our margins, I would say. Matt can quantify them, but they are large, and they are better than we expected.\n\nAnd you can see them rolling through the numbers. By many -- I would say by many indicators, we would say that this change in the loyalty program has been a very good move for us, including the fact that we have added a significant number of new customers to Rite Aid, which the goal for the change to the loyalty program was to eliminate these very significant discounts and markdowns and introduce a digitally oriented new loyalty program that was more modern and more in line with our competitors that would attract our target growth market without losing our current customers in the process. Andre, you want to just comment on how we're doing there?\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nYeah. Thanks, Heyward. George, it's six months into the program now, and we did have a big bang launch over the summer. When we look at our numbers, when we made the conversion from the old to the new, we've retained 99% of what we called our premium customers in the old program.\n\nWhat's also exciting is that this is a digital-first program and early adopters of this program, what we're seeing is that they are making incremental trips to stores. And we're also -- have the ability right now which we have started to be much more personalized in our offers to drive incremental trips to the stores for our folks in the loyalty program.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nGeorge, I'll jump in. You asked a question about benefit. And the benefit we're seeing in the loyalty program right now is actually on the margin line because with the elimination, the old program had a 10% and 20% discount element to it that you got to if you were -- got to a certain level in the program through either script purchase -- script fulfillment or front-end purchases. And then once you've got that, you were getting that 20% and 10% to 20% discount on everything you bought regardless if it was on promotion or not.\n\nWith this being switched to a much more item-based very specific promo-based program, we're able to eliminate markdowns. And that markdown eliminations had about a 200 basis point benefit to our front-end margins when you quantify that impact for the first half of the year, which is kind of masked by in our public numbers by -- in total margin by the impact of cycling all the noise in the pharmacy side and also the fact that our front-end comps have been soft. But the margin benefit has been good.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nOK. That's helpful. And then maybe just a quick follow-up, and we kind of get this one from investors. We had the kind of the goodwill write-down as it relates to Elixir this morning, and we've had some kind of other new charges kind of pop up in the prior quarter.\n\nI guess, Matt, I was just -- your comments around underlying earnings quality, I guess, like just how do you feel like the earnings quality of the businesses and kind of on a go-forward basis, how should investors be thinking about whether or not we see another step down in Elixir or kind of more store closures? And you talked about some of the initiatives that are being taken to kind of -- it seems like there's a lot of moving parts as it relates to kind of forecasting underlying earnings. I guess I just kind of ask you to comment on earnings quality.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah. I think for all the reasons I laid out in the comment on the back half of the year, I think our earnings quality is certainly as you look to EBITDA, which is, I think, the right measure from an earnings quality standpoint, is solid. And we expect that EBITDA to increase in the back half of the year. The goodwill impairment for Elixir is really driven by a triggering event from a change in our estimate of lives for next year.\n\nAnd we've been open about the fact that we expect lives to go down. And so that is what drove the impairment on the goodwill for Elixir. On the store closures, I would argue that closing these unprofitable stores is improving earnings quality a great deal because we wind our way through about 150 stores in the fleet that just were a drag on EBITDA and were going to be -- continue to be a drag on EBITDA. And so while the charges to terminate those leases are certainly substantial from a -- and they are noncash charges, I'll remind you, they're substantial, the underlying EBITDA benefit of $60 million in this year that we're getting from those closures actually improves our earnings quality.\n\nHeyward Donigan -- Chief Executive Officer\n\nYeah. George, let me just jump in. Everything Matt said is true. Listen, I'm committed to organic growth and paying down debt.\n\nAt the bottom line, that's what matters. We have a very strong growth culture. We have just demonstrated in this quarter script growth, taking market share, improvements in Elixir sales, specialty pharmacy growth, significant SG&A reductions and productivity improvements, both at Elixir and Rite Aid. So we are going to do everything we can to achieve EBITDA growth that we can within our control.\n\nNow there are factors out of control, particularly now, the macro economy issues and the changing COVID landscape. But at the end of the day, this company can grow and will grow organically to the best degree we can do. And I think there are indications of that even. But I know it's kind of a noisy quarter.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nYeah. And then maybe, Heyward, if I could jump in with one last quick one just as it relates to Elixir. Could you just remind us again, Matt, how many PDP lives Elixir serves? And I assume that the expectation as we think about calendar '23 is that that number is probably a step down again, given that PDP appears to be a shrinking segment nationally.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah, the number we serve right now is around 600,000, and then that number will step down next year.\n\nHeyward Donigan -- Chief Executive Officer\n\nAnd while that number is, as you said, shrinking nationally, the benefits of that business to us have been the expertise that we have in supporting Medicare health plans, government health plans, along with commercial health plans who are interested in getting into that space from a Medicare Advantage or MAPD perspective. And that is where we are showing growth. And as you know, we retain our largest Medicare health plan as well for 1/1.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nOK. Thank you. I appreciate it, Heyward.\n\nHeyward Donigan -- Chief Executive Officer\n\nThanks, George.\n\nOperator\n\nYour next question comes from the line of William Reuter with the Bank of America.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nGood morning. My first question on Elixir. It sounds like you were somewhat disappointed by the ability to gain lives for the next calendar year based upon more companies staying with their incumbents, but you also expect that this is an opportunity, and that you're going to do better in the future. What do you think occurred this year that left companies less likely to change? And why do you think that will improve in future years?\n\nHeyward Donigan -- Chief Executive Officer\n\nYeah. Good question in light of the environment. Well, what's happened by all indicators from what we've heard from the consultants is that because of coming out of the pandemic, companies have been very distracted and frankly, I think, under a lot of economic pressure. And it requires resources to change a PBM.\n\nIt's not a flip to switch. And historically, you would see levels of retention around 70% to 75%, meaning that the rest of the companies are actually switching vendors. In this environment, we've seen retention rates up at around 85%, which means fewer companies are switching PBM vendors. And so that has benefited us in the sense that if you take out that one client we lost, our retention rate is 96%, which is very high in this environment, which I think is just an indication of what's going on.\n\nSo we do -- all the consultants do believe that that will go back to normal levels. We have had our strongest sales season in three years. So we have sold more lives this year than we sold in the last three years, and we still are closing business. But it was a slower cycle, given how much pipeline we had than we expected.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nGot it. That makes sense. And then after the round of sale leasebacks that were completed in the quarter, is there any way you can ballpark a range for what the value of remaining real estate, both distribution centers, which there may not be any more of those, but maybe an estimate of the value of the stores that you continue to own?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nHey, Bill, it's Matt. Thanks for the question. So we do not have any further opportunities on the distribution center side for sale leasebacks. On the store side, we've probably got about 75 to 100 owned stores left in the portfolio.\n\nNow not all of them are going to be candidates for sale leaseback for a variety of reasons. But that's kind of the number of owned stores that we're still working with that there's at least a possibility to do a transaction on.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then just lastly for me. It sounded like one of your first questions that you asked was about the supply chain. And you mentioned that it was the important products that you're not able to get.\n\nSo it sounds like more or less your private label's where you're experiencing challenges. Is there any way to think about what the drag maybe this year on that supply chain disruption in private label? And then therefore, what would be the tailwind next year or opportunity next year to get some of those gross profit dollars back?\n\nHeyward Donigan -- Chief Executive Officer\n\nAndre, you want to comment then maybe Matt? OK. Matt, go ahead.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah, I'll jump in first on kind of what we have built in our guidance, and then Andre can give more color. I think as we kind of started to first set our guidance for the beginning of the year, we had a pretty -- an ambitious supply, private label rollout program that we're pretty excited about and that we are expecting to give us about a $15 million EBITDA -- gross profit/EBITDA benefit in the year. I think a large part of that number is at risk now for the year, which is one of the kind of puts and takes that factored into us changing our outlook for the back half of the year. But improving private label own brand presentation -- penetration, excuse me, is a benefit when you can get that out.\n\nSo I do think there still is an ability to capture that benefit in future years.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nPerfect.\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nGo ahead. Sorry.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nSorry, I was just going to say thanks, but you can continue.\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nNo, that's fine. Thank you.\n\nOperator\n\nYour next question comes from the line of Karru Martinson with Jefferies.\n\nKarru Martinson -- Jefferies -- Analyst\n\nGood morning. For the stores that you're closing, what do we get for those script files sold? And are we still looking at script file valuations in that $10 to $20 per script?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nHey, Karru, it's Matt. The short answer is yes. I mean, it will vary, obviously, depending on facts and circumstances, just like it does in the buy side, on the script side. But in general, that's the right range from the standpoint of the value of the script file.\n\nKarru Martinson -- Jefferies -- Analyst\n\nOK. And how much did we get for those script files sold?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nI have to go back and look. I think between the two quarters, we've probably gotten about $40 million, but we'll verify that for sure, Karru, and follow up with you.\n\nKarru Martinson -- Jefferies -- Analyst\n\nOK. And when we look at the increased shrink and some of the urban markets and the store closure programs that we have, I mean, one -- I don't know, is there insurance for this shrink? And does this change your mindset of what stores you should be closing?\n\nHeyward Donigan -- Chief Executive Officer\n\nAndre, I think why don't you comment on how I would say -- I mean, just to pat ourselves on the back, we've done pretty well with shrink until this quarter. And then I think, Andre, you guys can comment on the insurance and what you think this means. The reason we pointed out this is New York is because that was already a market where we have been shrinking our footprint. Andre?\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nThanks, Heyward. First, there isn't any insurance on shrink. It's a gross margin hit. The second is, over the last 24 months, the team has done incredible work on improving our product protection, improving our organized retail client program.\n\nI think the headline here is the environment that we operate in, particularly in New York City, is not conducive to reducing shrink just based upon everything you read and see on social media and the news in the city.\n\nHeyward Donigan -- Chief Executive Officer\n\nAnd can you just comment on some of the pilot work we're doing to alleviate some of these issues and still serve our communities?\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nYeah. We -- our goal is to stay in the communities. We're piloting, looking at how do we just operate a pharmacy only and as a pharmacy prescription-only format in some of the communities. We have to -- and the community wants us to do this.\n\nWe're looking at literally putting everything behind showcases to ensure the products there for customers who want to buy it. And then lastly, we've even had to go to the extent of using off-duty police officers in some of our stores just into some of these communities also.\n\nKarru Martinson -- Jefferies -- Analyst\n\nOK. And where are we on liquidity today? And where do we feel that we'll end the year?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nWe're at about $1.2 billion right now in liquidity. And as I talked about on the call, the timing of this build of the CMS receivable in the second quarter, as well as some of the timing in our interest payments, accruals and inventory always causes a -- if we don't have a CMS secure -- receivables securitized, in particular, it always causes the -- Q2 to be the kind of low point from a liquidity standpoint. We talked about getting back to a leverage ratio in the low fives by the end of the year. And coupled with that would be an expectation that we would have liquidity back in the $1.8 billion $1.9 billion range.\n\nKarru Martinson -- Jefferies -- Analyst\n\nOK. And the CMS facility normally is, call it, 600, 700, depending on how it builds during the year that you guys securitized?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah. Probably closer to six than seven, but yes.\n\nKarru Martinson -- Jefferies -- Analyst\n\nOK. Thank you very much, guys. Appreciate it.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nThanks, Karru.\n\nOperator\n\nYour final question comes from the line of Carla Casella with J.P. Morgan.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for squeezing me in. I'm wondering on that CMS facility, are you seeing any change in the funding or cost or the discount rates that you have to offer to get those? Has the market changed at all?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nIt has, Carla. The pricing tracks very close to the pricing that's in kind of the LIBOR benchmark rate. It's not at LIBOR, but it's at indices that move the same way that LIBOR does. So it will be not dissimilar to our other cost of funds.\n\nThere will be an increased cost to securitize that receivable. But there will be an increased cost, we kept it on the revolver, too. So net-net, we're still getting as good a deal as we can get.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. And so it's still an attractive source of funding over the revolver or cheaper?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nIt's around the same cost as the revolver, and what it does is it -- the reason I like it so much is it basically frees up liquidity because you're getting -- just frees up the amount of liquidity because the CMS receivable and that itself isn't something that collateralizes any of the other debt that we have.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. And then on the sale leaseback, could you give us a sense of the rent that will be associated with that or the implied cap rate?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nSo the cap rate on the latest round of sale leasebacks we've done this quarter is just under 7%. So we've seen the market move a little bit on us, but still just given all the other disruption in the market is still a pretty attractive cost of funds for us, all things considered.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. That's great. And then one last one. There's been a lot of press on different opioid settlements away from you or -- and I'm wondering, where do you have remaining cases ongoing? The two settlements you did last year on Ohio and Michigan, does that complete those states? Or was that -- are there still some counties outstanding and in any other major cases to call out nationwide?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah. Carla, besides the settlement in West Virginia, which got announced by West Virginia, there really haven't been a lot of movement other than what we previously discussed. We had the settlements with several counties in Ohio and New York. We had seven at West Virginia.\n\nA lot of discussion is still ongoing and really can't provide any more color than that.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nI will now turn the call over to Heyward Donigan for any closing remarks.\n\nHeyward Donigan -- Chief Executive Officer\n\nThanks for your time today, and I'd be remiss if I didn't once again mention that we do anticipate a very robust flu season and ongoing COVID infections. And there is a new bivalent vaccine available, which covers both the old strains and the new strains of COVID. And I -- my husband and I just got both our flu shot and our bivalent vaccine to protect ourselves for the season ahead. And I highly encourage you all to get yours to protect yourselves and your families, and we wish you all well.\n\nThanks for your attention today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nByron Purcell -- Vice President, Investor Relations and Treasurer\n\nHeyward Donigan -- Chief Executive Officer\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nKarru Martinson -- Jefferies -- Analyst\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nMore RAD analysis\n\nAll earnings call transcripts"
}