{
  "companyName": "Broadcom",
  "companyTicker": "AVGO",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/09/broadcom-avgo-q4-2022-earnings-call-transcript/",
  "content": "Broadcom (AVGO 0.24%)\nQ4 2022 Earnings Call\nDec 08, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to Broadcom Inc.'s fourth quarter and fiscal year 2022 financial results conference call. At this time, for opening remarks and introductions, I would like to turn the call over to Ji Yoo, head of investor relations of Broadcom Inc.\n\nJi Yoo -- Head of Investor Relations\n\nThank you, Sherri. And good afternoon, everyone. Joining me on today's call are Hock Tan, president and CEO; Kirsten Spears, chief financial officer; and Charlie Kawwas, president, semiconductor solutions group. Broadcom distributed a press release and financial tables after the market closed, describing our financial performance for the fourth quarter and fiscal year 2022.\n\nIf you did not receive a copy, you may obtain the information from the investors section of Broadcom's website at broadcom.com. This conference call is being webcast live, and an audio replay of the call can be accessed for one year through the Investors section of Broadcom's website. During the prepared comments, Hock and Kirsten will be providing details of our fourth quarter and fiscal year 2022 results, guidance for our first quarter, as well as commentary regarding the business environment. We'll take questions after the end of our prepared comments.\n\nPlease refer to our press release today and our recent filings with the SEC for information on the specific risk factors that could cause our actual results to differ materially from the forward-looking statements made on this call. In addition to U.S. GAAP reporting, Broadcom reports certain financial measures on a non-GAAP basis. A reconciliation between GAAP and non-GAAP measures is included in the tables attached to today's press release.\n\nComments made during today's call will primarily refer to our non-GAAP results. I'll now turn the call over to Hock.\n\nHock Tan -- President and Chief Executive Officer\n\nWell, thank you, Ji. And thanks, everyone, for joining us today. Before I provide color on our Q4 results, let me put in perspective what we achieved in fiscal year '22. For the year, I'm pleased to report that consolidated revenue hit a record of $33.2 billion, growing 21% year on year, yet another year of double-digit organic growth.\n\nThis growth was driven by our strong partnerships with customers and increased R&D investments, which enabled accelerated adoption of our next-generation technologies. With our robust business model, we grew our fiscal 2022 operating profit by 28% year on year and our free cash flow per share by 25% year upon year. Now to discuss details of our fiscal Q4. In our fiscal Q4 '22, consolidated net revenue was a record $8.9 billion, up 21% year on year.\n\nSemiconductor solutions revenue increased 26% year on year to $7.1 billion, and infrastructure software revenue grew 4% year on year to $1.8 billion. In Q4, our semiconductor business continued to perform well across hyperscale, service providers, and enterprise. On top of this, wireless grew sequentially as we ramp up the new platform and our North American customer. In reporting these results, I'd like to emphasize, we demonstrate our continued discipline in shipping our strong backlog only as and when needed by our end customers.\n\nSo, in contrast to weak consumer electronics spending today and despite concerns of a global recession, we believe overall infrastructure spending remains strong, and we continue to experience sustained demand in most of our end markets, and this is what we continue to see in Q1. So let me expand on this. Starting with networking. Networking revenue was a record $2.5 billion and was up 30% year on year, representing 35% of our semiconductor revenue.\n\nWe see strong growth from deployment of Tomahawk 4 for data center switching at hyperscale customers. And we see upgrades of edge and core routing networks with our next-generation Jericho portfolio at cloud and service providers. And at multiple cloud customers, we continue to lead in delivering custom solutions for compute offload accelerators and actually surpassed the $2 billion amount in revenues in fiscal '22. Looking into Q1, we do expect networking revenue to be strong and grow about 20% year over year.\n\nNext, our storage connectivity revenue was a record $1.2 billion or 17% of semiconductor revenue and up 50% year on year. As we have mentioned in previous earnings call, we are benefiting here from substantial content increases as both cloud and enterprise customers adopt our next-generation migrate and storage adapters. This trend will continue in Q1, and we expect server storage connectivity revenue to grow above 50% year on year. Moving on to broadband.\n\nRevenue of $1 billion grew 20% year on year and represented 15% of semiconductor revenue. Our broadband business is benefiting from ongoing multiyear deployments by North American and European service providers of 10-gigabit PON and DOCSIS 3.1 We've embedded Wi-Fi 6 and 6E. In Q1, we expect the secular drivers behind broadband to continue and our business to be strong at about 30% year-on-year growth. Moving on to wireless.\n\nMoving on to wireless. Q4 revenue of $2.1 billion represented 29% of semiconductor revenue with the 13% year-on-year increase coming largely from higher content. And in Q1, we expect wireless revenue to be sequentially flat and up low single digits year on year. Finally, Q4 industrial resale of $234 million grew 1% year over year as softness in China mostly offset the strength in North American and European automotive.\n\nIn Q1, we forecast industrial resales to continue the trend of low single-digit percent growth year on year. And so, in summary, Q4 semiconductor solutions revenue was up 26% year on year. And in Q1, we expect semiconductor revenue growth to sustain at approximately 20% year on year. Moving on to software.\n\nIn Q4, infrastructure software revenue of $1.8 billion grew 4% year on year and represented 21% of total revenue. Core software revenue grew 5% year on year. In spite of adverse forex impact in dollar terms, consolidated renewal rates averaged 117% of expiring contracts. And in our strategic accounts, we averaged 128%.\n\nWithin our strategic accounts, annualized bookings of $357 million included $101 million of cross-selling of our portfolio of products to these customers. Over 90% of the renewal value represented recurring subscriptions and maintenance. Over the last 12 months, consolidated renewal rates averaged 120% over expiring contracts. And in our strategic accounts, we averaged 135%.\n\nBecause of this, our ARR, which is annual recurring revenue, the indicator of forward revenue, at the end of Q4 was $5.4 billion, which was up 4% from a year ago. And in Q1, we expect our infrastructure software segment revenue to be flat year on year, reflecting core software revenue growth of mid-single-digit percent year over year, offset by a year-on-year decline in the Brocade enterprise and business. In summary, we're guiding consolidated Q1 revenue of $8.9 billion, up 16% year on year. While we are fully booked for fiscal 2023, in this environment, we are not providing you guidance for the year.\n\nBefore Kirsten tells you more about our financial performance for the quarter, let me provide a brief update on our pending acquisition of VMware. We are making progress with our various regulatory filings around the world, as we very much expect having received merger clearance in Brazil, Canada, and South Africa. We anticipate that timeline for the review process would be more extended in other key regions, especially given the size of this transaction. Having said that, we're still confident that this transaction will close and be completed in our fiscal 2023.\n\nThe combination of Broadcom and VMware is about enabling enterprises to accelerate innovation and expand choice by addressing their most complex technology challenges in this multi-cloud era. And we are confident that regulators will see this when they conclude their review. With that, let me turn the call over to Kirsten.\n\nKirsten Spears -- Chief Financial Officer\n\nThank you, Hock. Let me now provide additional detail on our financial performance. Revenue was $8.9 billion for the quarter, up 21% from a year ago. Gross margins were 75% of revenue in the quarter and up 10 basis points year on year.\n\nOperating expenses were $1.2 billion, up 3% year on year, driven by investment in R&D. Operating income for the quarter was $5.5 billion and was up 25% from a year ago. Operating margin was 62% of revenue, up approximately 240 basis points year on year. Adjusted EBITDA was $5.7 billion or 64% of revenue.\n\nThis figure excludes $129 million of depreciation. Now, a review of the P&L for our two reportable segments. Revenue for our semiconductor solutions segment was $7.1 billion and represented 79% of total revenue in the quarter. This was up 26% year on year.\n\nGross margins for our semiconductor solutions segment were approximately 71%, up 70 basis points year on year driven by product mix and adoption of next-generation products across our extensive product portfolio. Operating expenses were $825 million in Q4, up 4% year on year. R&D was $731 million in the quarter, up 4% year on year. Q4 semiconductor operating margins were 59%.\n\nSo, while semiconductor revenue was up 26%, operating profit grew 33% year on year. Moving to the P&L for infrastructure software segment. Revenue for infrastructure software was $1.8 billion, up 4% year on year, and represented 21% of revenue. Gross margins for infrastructure software were 91% in the quarter and operating expenses were $348 million in the quarter, down 1% year over year.\n\nInfrastructure software operating margin was 72% in Q4, and operating profit grew 6%. Moving to cash flow. Free cash flow in the quarter was $4.5 billion, representing 50% of revenue. We spent $122 million on capital expenditures.\n\nDays sales outstanding were 30 days in the fourth quarter compared to 29 days in the third quarter. We ended the fourth quarter with inventory of $1.9 billion, up 5% from the end of the prior quarter because we expect the mix of revenue in Q1 to have a higher cost of materials. We ended the fourth quarter with $12.4 billion of cash and $39.5 billion of gross debt, of which $440 million is short term. Based on current business trends and conditions, our guidance for the first quarter of fiscal 2023 is for consolidated revenues of $8.9 billion and adjusted EBITDA of approximately 63% of projected revenue.\n\nIn forecasting such operating profitability, we would like to point out that because of product mix changes, our non-GAAP gross margin could be down roughly 100 basis points from Q4 and R&D spending could be up sequentially as we step up hiring of engineers for multiple critical projects. Let me recap our financial performance for fiscal year 2022. Our revenue hit a record $33.2 billion, growing 21% year on year. Semiconductor solutions revenue was $25.8 billion, up 27% year over year.\n\nInfrastructure software revenue was $7.4 billion, up 4% year on year. Gross margin for the year was 76%, up 110 basis points from a year ago. Our operating expenses were $4.8 billion, up 6% year on year. Fiscal '22 operating income was $20.3 billion, up 28% year over year, and represented 61% of net revenue.\n\nAdjusted EBITDA was $21 billion, up 27% year over year, and represented 63% of net revenue. This figure excludes $529 million of depreciation. We spent $424 million on capital expenditures. And free cash flow grew 22% year on year to $16.3 billion or 49% of fiscal '22 revenue.\n\nTurning to capital allocation. For fiscal '22, we spent $15.5 billion, consisting of $7 billion in the form of cash dividends and $8.5 billion in repurchases and eliminations. We ended the year with $13 billion of authorized share repurchase programs remaining and expect to resume our repurchase of common stock as soon as we can under SEC rules. Excluding the potential impact of any share repurchases, in Q1, we expect the non-GAAP diluted share count to be $435 million.\n\nAligned with our ability to generate increased cash flows in the preceding year, we are announcing an increase in our quarterly common stock cash dividend in Q1 fiscal 2023 to $4.60 per share, an increase of 12% from the prior quarter. We intend to maintain this target quarterly dividend throughout fiscal '23, subject to quarterly board approval. This implies our fiscal 2023 annual common stock dividend to be a record $18.40 per share. I would like to highlight that this represents the 12th consecutive increase in annual dividends since we initiated dividends in fiscal 2011.\n\nThat concludes my prepared remarks. Operator, please open up the call for questions.\n\nOperator\n\nThank you. [Operator instructions] And today's first question will come from C.J. Muse with Evercore ISI. Please go ahead.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah, good afternoon and thank you for taking the question. You talked about infrastructure holding up well across most segments. I guess I was hoping you could speak more to why infrastructure to date has been so immune from the weakness we've seen elsewhere in semis. Specifically, can you speak to trends you're seeing perhaps in hyperscale versus enterprise? Any differences there? And also, can you speak to how you see these trends throughout all of fiscal '23? Thanks so much.\n\nHock Tan -- President and Chief Executive Officer\n\nAll right. Great question. What we see now, last quarter and this current quarter as we progress is hyperscale spending continues strong; enterprise consumption continues strong; and broadband deployment across North America, Europe, and even parts of Asia continues their multiyear trend of growth simply because out of COVID-19, there was a lot of invest -- there was a lot of plans to invest, and these are multiyear. So, exactly as I said, all these areas currently continue to be very much on track as we've seen it.\n\nNow, keep in mind, as I said in previous earnings call and I'd just reemphasize here today, again, it's -- I just want to assure you, we don't believe we are shipping beyond true demand. We continue to scrub -- to basically judge orders, the backlog we have, and we also take pains to only ship to customers who can consume it pretty much within the same quarter before we do it. And so, as far as we can tell, based on what we see as a willingness of our customers to accept and consume the products we ship, that's what we see right now. Asking me for the rest of '23, no, I tend to be more careful in being able to answer that.\n\nI don't know the answer to that is my opinion. I do not know whether the strength in acquisition and consumption of our products will continue to sustain for the rest of '23. What we do see is over the next several months, we see those orders still in place. We see customers willing to take the products.\n\nWe have -- talking to multiple, multiple CIOs among largest enterprise customers we have out there. We have not seen them talk about a reduction in their IT spending. We've seen many saying it will grow and others saying it will at least remain flat. So, I guess, I'm cautiously positive about trends looking forward.\n\nOperator\n\nThank you. One moment for our next question. That will come from the line of Ross Seymore with Deutsche Bank. Please go ahead.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nHi, everybody. Thanks for letting me ask a question. Hock, I want to follow on C.J.'s and maybe ask similar question but in a slightly different way. Last quarter, you talked about actively scrubbing your backlog.\n\nAnd clearly, that's helped to avoid some of the inventory pitfalls that some of your peers have seen. But have you noticed since last quarter's call a change in either the rate of your backlog growth? I think it was up about 7% sequentially last quarter, the composition of your backlog, or how actively and aggressively you need to scrub it? Any sort of changes in those forward-looking metrics that would alter your view on kind of the sustainability of demand, the duration of it, etc.?\n\nHock Tan -- President and Chief Executive Officer\n\nIt comes down very simply to we continue to scrub our backlog in a manner this quarter, last quarter, no differently than we did it six months or a year ago. We haven't changed our focus on ensuring that we do not ship products to the wrong people who just put it on the shelves. That is still very much, very, very intact in our view. Our backlog continues to be way up there, and you're right, makes us change.\n\nAs you can see, one quarter, it would be broadband growing 20% year on year and networking growing 30% year on year, and the following quarter is broadband growing 30% year on year and networking growing 20%. And it impacts not just from hyperscale, bearing their purchases in, for lack of a better word, seasonal manner; it's also the particular end markets it goes to. So, there's a mix of backlog, and products we ship in any particular quarter will vary, and they all change. But it doesn't change the fact that we have still a very, very strong backlog.\n\nAnd what we're shipping, which is most important in the current quarter, we believe, is what we are reflecting as end demand for our products.\n\nOperator\n\nThank you. One moment for our next question. That will come from the line of Stacy Rasgon with Bernstein.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nGreat, guys. Thanks for taking my questions. So, Hock, I guess just to ask the question explicitly. Last quarter, I think you said your semiconductor backlog was $31 billion and your lead times were still 50 weeks, give or take.\n\nWhat are those numbers now? Like, where is backlog and where are lead times?\n\nKirsten Spears -- Chief Financial Officer\n\nStacy, this is Kirsten Spears. We're not going to guide the year. So, we're not providing that --\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nI'm not asking you to guide the year. I'm not asking you to guide the year.\n\nKirsten Spears -- Chief Financial Officer\n\nRight. We're fully booked for the year. So, if I give you the backlog number, I'm effectively guiding you to the year. So, we've chosen not to provide that data at this time.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nOK. I guess, can you just tell me, has it gone up, flat or down?\n\nHock Tan -- President and Chief Executive Officer\n\nOur forecast for the year, if you want to call it, forecast based -- our backlog, it's not our forecast. We'll continue -- for the year, we'll continue to grow. Other than that, I'm not telling you what it is. We don't guide.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nGot it. But you think that backlog will grow for the year is what you're saying?\n\nHock Tan -- President and Chief Executive Officer\n\nOur year forecast will grow.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nGot it. Got it. Thank you.\n\nOperator\n\nThank you. One moment for our next question. That will come from the line of Harlan Sur with J.P. Morgan.\n\nPlease go ahead.\n\nHarlan Sur -- J.P. Morgan -- Analyst\n\nGood afternoon. Thanks for taking my question. Hock, your server storage connectivity business has been extremely strong, right, up 50% plus in fiscal '22. And more importantly, that business continues to sustain based on the January quarter outlook.\n\nWe typically tend to think about HDD controllers and preamps, but your business is much more diverse than this. So, can you just, first of all, walk us through like what percentage is MegaRAID, PCIe or what I call overall storage connectivity versus your storage controller business, which is primarily HDD controller and preamps? And maybe what's driving the near-term growth in the storage franchise when many of your storage competitors and customers are seeing major weakness in this segment?\n\nHock Tan -- President and Chief Executive Officer\n\nWell, that's an interesting question. It's -- our server storage connectivity -- and you're right, which includes nearline hard drives, which includes some, what we call, on-prem server storage connectivity, hosted by Synaptics included is broad. And I don't have the numbers on my mind exactly what it is. Just broad-based, particularly from the MegaRAID business, as I said, a big part of the growth, the big dollar -- the big percentage growth, as I indicated before, is due to the fact that the new generation of products are all subsystems, our boards.\n\nWe're not just shipping chips. So, that counts for a big part of the growth. Notwithstanding, unit growth is up, but not as much as the 50% we announced, obviously. A big part of 50% is content growth as we ship subsystems and boards versus chips.\n\nBut even then, unit growth is up, and it's across the board, and it's not everything that grows. But enough said that overall, it grows.\n\nHarlan Sur -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. That will come from the line of Timothy Arcuri with UBS.\n\nTimothy Arcuri -- UBS -- Analyst\n\nThanks a lot. Hock, you keep on scrubbing demand and you're shipping to what you think is consumption. So, I guess I take it to believe that there's still a gap between what you're shipping and what customers want in any given quarter, I guess we could call that delinquencies, some others call that delinquencies. Obviously, you haven't changed your approach, but I would imagine that this delinquency or this gap between what you're shipping in a quarter and what your customers want, that's probably declining.\n\nSo, I guess the question is, can you quantify the gap? And is the gap getting smaller? Thanks.\n\nHock Tan -- President and Chief Executive Officer\n\nThat's an interesting question. And we don't really try to quantify the gap. And a big part of it is -- I don't want to get you guys overly excited, but customer -- you know backlog is -- sometimes it's very often categorized or characterized under CRD or customer request dates. Our customer requests date in this particular quarter, for instance, our last particular -- last quarter was much, much higher than what we actually shipped, and it was the same way six months ago.\n\nHas it got better from six months ago? I can only guess, and in this forum is the last thing I want to do. But there's still a big amount of CRD's backlog in excess of what we actually ship up.\n\nTimothy Arcuri -- UBS -- Analyst\n\nGot it. OK. Thanks.\n\nOperator\n\nThank you. One moment for our next question. That will come from the line of Vivek Arya with Bank of America.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThank you. I actually have two very quick clarifications. First, Hock, have you seen the impact or you expect to see any impact of China lockdowns in your wireless business in Q2? I know there's nothing -- doesn't seem to be anything in Q1. I was just wondering if there's something we should be prepared for in Q2.\n\nAnd then on the gross margin, I thought I heard gross margin goes down sequentially in your semiconductor business in Q1. Is that really all mix-related, or is there a like-to-like impact that we should keep in mind?\n\nHock Tan -- President and Chief Executive Officer\n\nOK. Let's take your first question first and then go to a more interesting second question, which is interesting, because it connects a few dots here. On the first one, as you know, our wireless is one single customer, and the COVID shutdown and all that does slow down inter-quarter shipments. But nothing -- we don't see -- Q2 is too far away for me to really give you any sense and our accuracy of what is like, but that's obviously movements between Q4 and Q1 as our numbers does kind of reflect.\n\nBut -- which is why year on year is a pretty good measure. As you see there, Q4 year on year was just 13% -- and I shouldn't say just -- was 13%, and Q1 was actually still 1% up, but there's obviously some movements in between, but -- and I'm sure that has something to do with COVID logistics -- impact on logistics chain of our largest customer, but I can't really tell in the bigger picture. Now switching and certainly on Q2, I'm not positioned to give you any indication. We don't have visibility.\n\nNow turning to the second part of your question on gross margin, it's all product mix. And it's all product mix because there are some -- depending on the particular products we ship, as I've said many times before, the margin, product margin, gross margin does vary, simply because it's the nature of the market conditions, the ecosystem that we have in each of those markets, those niche markets we participate in. But broadly, to give you a sense, perhaps that gives you more color, networking tends to have some of the highest margins collectively of our products and much higher than broadband; and of course, wireless has the lowest. And when you look at Q4 to Q1, the mix shifts away from networking somewhat and more to broadband, and wireless still remains a big chunk of it, even though it hasn't receded as a percent.\n\nSo, that's why we see that impact on gross margin sequentially. Nothing more than just the mix of products we ship and the natural gross margin on those products vary one from the other. And you can actually see it with the way our inventory grew, too. As we -- as Kirsten reported, our inventory ending Q4 grew about 5% from that ending Q3, the quarter before.\n\nAnd obviously, the Q4 inventory is positioned to ship in Q1, and you see that increase even as our guidance on revenue remains pretty flat.\n\nOperator\n\nThank you. One moment for our next question. That will come from the line of Joseph Moore with Morgan Stanley.\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. You talked about being booked for the whole year next year. How much visibility do you think that gives you really? And I guess, what's your philosophy going to be if customers with noncancelable backlog come to you and try to make an adjustment in a potentially weaker economic period next year?\n\nHock Tan -- President and Chief Executive Officer\n\nLet's start with the first part. I mean, when we're booked, we're really booked. I mean we got paper that says they have committed orders for us to ship. And as you know, our orders are noncancelable orders.\n\nCustomers know that. We have the paper. And when we say we are fully booked, it means we have the backlog sitting there. Now, the second question you asked is a more interesting question.\n\nWhat if we all hit a massive recession, depression or recession, late next year, in the next six months, nine months, and customers -- and things really collapse around years, what would we do? My answer is I don't know, which is partly why we're not giving you annual guidance. We will react as and when circumstances require us to do. But at this point, we have the orders.\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nAnd one moment for our next question. That will come from the line of William Stein with Truist.\n\nWilliam Stein -- Truist Securities -- Analyst\n\nGreat. Thanks for taking my question, and congrats on the good results and outlook. It seems that the capital allocation policy in terms of the outlook -- maybe the policy didn't change, but at least the tactics did. The payout ratio relative to free cash flow, you're setting that a little bit lower than the 50%, and you're resuming the buyback.\n\nAnd I'm hoping you can just discuss why these decisions were made. Does it reflect an indication or a changing view about the timing of the VMware close, or is it related to concerns around macro or anything else? Thank you.\n\nKirsten Spears -- Chief Financial Officer\n\nWell, I would say that we are -- policy-wise, we've always said we would pay out approximately 50% of the preceding year's free cash flows. And in this economic environment that we're all seeing, we believe that a 12% increase year over year is a robust dividend. And so yes, we're quite happy with that.\n\nHock Tan -- President and Chief Executive Officer\n\nAnd don't forget, we're going to start buyback once the rules allow us to do that. And so, that's another return of cash to shareholders, and we fully intend to get that going as soon as we could.\n\nKirsten Spears -- Chief Financial Officer\n\nAs soon as we can, and we still have $13 billion under that program.\n\nWilliam Stein -- Truist Securities -- Analyst\n\nThank you.\n\nOperator\n\nAnd one moment for our next question. And that will come from the line of Matt Ramsay with Cowen. Please go ahead.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nYes. Thank you very much. Good afternoon. Hock, I think in some of the prepared script that you guys disclosed that you're now sort of in the compute offload ASIC franchise, the fiscal year was $2 billion.\n\nAnd I think that's maybe a third higher than it was last year. It looks like some of the -- you guys did an event on that business earlier in the year, and things really jumped up in fiscal '18 and then kind of leveled off a bit in terms of revenue. And this is a pretty big, I guess, acceleration in that compute offload business. Maybe you could talk a little bit about the trends there.\n\nAnd are you seeing a broadening of the customer base or maybe higher volumes per tape-out as you go down the node stack? I'd just be interested in seeing some of the trends there. It seems like hyperscale really wants custom silicon at this point. Thanks.\n\nHock Tan -- President and Chief Executive Officer\n\nYeah, you're right in that regard that we have multiple programs from the hyperscalers on custom or semi-custom silicon, or largely collectively we call as offload compute. And they all have -- do their own. So, that's -- in one way that's very positive and very opportunistic for our technologies to be deployed. On an ongoing basis, the tricky thing in all this is more will come on, the rate of ramp is harder for us to predict.\n\nThese are very lumpy programs, fairly large and lumpy, which is why we can get to $2 billion and a raise -- an increase of like, as you correctly say, a third from a year ago. But it's lumpy. And the trend is very hard for me to chart out unless you ask for it over the next five years. And even then, if you look it five years, it becomes a question of would these hyperscalers revert to merchant silicon versus continuing to use custom ASICs, and that poses another issue for me to figure it out.\n\nBut if you ask for me over the next year or two, where it will go, I'd be honest and say I'm not positioned to give you really a good forecast.\n\nOperator\n\nAnd one moment for our next question. That will come from the line of Aaron Rakers with Wells Fargo.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYes. Thanks for taking the question. Hock, I wanted to go back to the prior comment you had made, and I want to make sure I'm clear on it. I think possibly within the context of lead times, you talked about customers, I think it was giving you forecast that were notably longer.\n\nI just want to understand a little bit of the context behind that comment earlier. Any kind of -- appreciating that you're not giving backlog, any kind of context around that lead time discussion would be helpful.\n\nHock Tan -- President and Chief Executive Officer\n\nWe haven't in any major substantive way changed our lead times by any means, as I've said before, and we kind of go along on that practice mode. And we have forecast, but we're really not talking about forecast either as it relates to the previous comment. I think I was referring to backlog and paper that we use. And as I said before, even on those papers, we have with customer request dates for shipments, we scrub that date and then scrub each of those demands before we ship it out in the current quarter or the preceding quarter, depending on what it is.\n\nBut we don't -- we have forecast. But obviously, we're not giving you any indication of our forecast at this point simply because we are still grinding our way through the backlog.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOne moment for our next question. That will come from the line of Toshiya Hari with Goldman Sachs.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nHi. Thanks so much for taking the question. Hock, I was hoping you could talk a little bit about your business in China, not so much from a ship to perspective from -- end consumption perspective. I know you don't have perfect visibility into being what's consumed at the end customer level.\n\nBut if you can kind of talk about what you're seeing in terms of trends across enterprise, cloud, and service providers, that would be helpful. How significant of a headwind was China in fiscal '22? And what are your expectations going forward? And what are you hearing from your end customers? Thank you.\n\nHock Tan -- President and Chief Executive Officer\n\nWell, to answer your question directly is China has slowed down in terms of consumption of products across industries, across even infrastructure. It has slowed down, and we see that. They're still not totally collapsed, but they have slowed down compared to what they were taking a year ago. But that's -- and we see that, particularly in our industrial business, which as we -- I indicated in my prepared remarks, strength in Europe, strength in North America especially in automotive, but weakness in China, which is a big part of our industrial business slowed it down.\n\nBut beyond that, in the IT side, yes, we have seen a slowdown. But keep in mind, China represents just less than 10% of our total revenues today. So, while it obviously has some level of offsetting effect, it's not sufficiently launched to have that much impact on our overall growth trend for the entire company.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nAnd any signs of improvement going forward, Hock, on the IT side, or is it too early to tell?\n\nHock Tan -- President and Chief Executive Officer\n\nI think it's too early at this point for me to make a call. There's a sense of some reopening. But if I make a call, good chance I could be wrong in a month's time when things might shut down again.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nOne moment for our next question. That will come from the line of Christopher Rolland with Susquehanna.\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nThanks for the question and congrats on bucking the trend on semis here, Hock. So, my question, it was kind of addressed on the last one, but I wanted to talk about the divergence, particularly between storage and maybe China enterprise networking. You had -- there's a lot -- your other competitor in, call it, core hard disk drive, talked about a downturn in demand, in storage, a large inventory build, and something similar happening in China networking as well, and you guys have seemingly such a big divergence there. And I was wondering if perhaps you had an explanation for some of that and why the difference.\n\nHock Tan -- President and Chief Executive Officer\n\nThe only explanation to an earlier question was our portfolio in service storage is pretty broad-based. Now, with a couple of areas that are very large areas like RAID, MegaRAID, particularly pretty much, but they are more than MegaRAID we have. You're correct. It's pretty broad-based.\n\nAnd there are some puts and takes, obviously. But overall, we see what we value.\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nOK. Thank you.\n\nHock Tan -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nOne moment for our next question. That will come from the line of Edward Snyder with Charter Equity Research.\n\nEdward Snyder -- Charter Equity Research -- Analyst\n\nThanks a lot. Hock, I'd like to talk a little bit about your wireless business, which is more retail-focused and probably will be the first one to see any recessionary pressures if you hit them. I know your guidance is really solid. First, give us some idea of your firm order book.\n\nI know you get a projection when the model year starts on what the total number would be for the year, but you don't get a firm order for that for some time. So, just kind of what is -- what would you -- how would you characterize firm order book for that or orders per se? Is it a 30-day, 60-day? So, help anticipate if you see a change when would that be? And then maybe if you could touch on how we should think about overall content at your largest customer in the next year or so because there's obviously increased competition in some of your core areas, and I was wondering if you're looking to shift more of your focus there into some of the mixed signal custom stuff and maybe wait for some of the RF. Thanks.\n\nHock Tan -- President and Chief Executive Officer\n\nOK. Interesting question. Let me try and address that. First, I assume you imply when you say orders or forecast on shipments, we only guide Q1, so I can only give you Q1.\n\nAnd it's all -- we have been all on paper, orders. These are real orders, noncancelable. So, we're giving you numbers that we intend to ship that we think the customer needs as far as we can scrub. And we have it.\n\nThese are committed orders. These are not forecasts at all, especially when you talk about Q1, which ends, by the way, end of January. We have orders beyond end of January as it is. So, these are very committed orders.\n\nAnd in that -- by that same token, pretty committed revenue forecast. Just to make it clear. And by the way, we have pretty good visibility from that particular customer, too. Now beyond that, to the second part of your question, yeah, we're very pleased with content increase that we have experienced, not every year necessarily, as you know.\n\nBut over a period of years, we always see this content increase. And we're still very, very well-positioned in our product -- in those few product lines that are, I call it, almost franchise in our North American customers. And this is Wi-Fi, Bluetooth, this is RF front end, and this is touchscreen controllers, high performance, mixed single. And that's -- we can only -- and that's all we focus on because these are areas where we are the best, we believe we have the best technology and delivering value to our customers.\n\nThere's no reason to find something else where you're not the best and hope to gain share from someone else. I could apply the same to my competitors in their thinking.\n\nEdward Snyder -- Charter Equity Research -- Analyst\n\nBut you don't see the competitive landscape shifting and making things more difficult for you in that, especially in the RF section in the next coming year or so, you think your franchises or your franchises and you -- \n\nHock Tan -- President and Chief Executive Officer\n\nAnswer is no.\n\nEdward Snyder -- Charter Equity Research -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. And our last question of the day will come from the line of Pierre Ferragu with New Street Research.\n\nPierre Ferragu -- New Street Research -- Analyst\n\nHey, thanks for taking my questions. Hock, you mentioned you're fully booked for 2023. You've had a lot of questions on that one. So, I apologize in advance for squeezing in one last one.\n\nAnd I was wondering if you look at the year as you see it books today if you could tell us in this like booking dynamics, where do you see for the full year 2023 the most growth and the least growth? I know you can't give us like numbers, and you don't want to guide. I completely accepted that. But if you could give us like a kind of idea of where things keep growing very fast, where things are slowing down in your order dynamics over the full year.\n\nHock Tan -- President and Chief Executive Officer\n\nInfrastructure is still holding up very well, as we have said in this call so far. We see -- we continue to see infrastructure. And infrastructure, by looking at it, comes from hyperscale, in building their data centers and components to their data centers; in service providers, like telcos, where we see our strength in broadband access, gateways and broadband. And I know people are finding hard to imagine, we're seeing it even in enterprise, where we do not -- that's why I made a comment earlier, we do not see across a cross-section of large enterprises a reduction in the IT spending for 2023.\n\nWe have not seen -- we have not come across too many enterprise customers, and I'm talking real end-use customers, end-user enterprise customers who are seeing their IT budget drop below '22. For most that we have asked, it's either flat or even up as they all continue to have the compelling need to keep modernizing their platform and workloads and digitizing their business model. And I think that is the only -- that was the only explanation given to me why there was no such clear reduction even as we all hear every day the likelihood, possibility of a global recession.\n\nPierre Ferragu -- New Street Research -- Analyst\n\nThank you very much.\n\nHock Tan -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. As there are no further questions in the queue at this time, I would now like to turn the call back over to Ji Yoo for any closing remarks.\n\nJi Yoo -- Head of Investor Relations\n\nThank you, Sherri. Broadcom currently plans to report its earnings for the first quarter of fiscal '23 after close of market on Thursday, March 2, 2023. A public webcast of Broadcom's earnings conference call will follow at 2:00 p.m. Pacific.\n\nThat will conclude our earnings call today. Thank you all for joining. Sherri, you may end the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJi Yoo -- Head of Investor Relations\n\nHock Tan -- President and Chief Executive Officer\n\nKirsten Spears -- Chief Financial Officer\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nHarlan Sur -- J.P. Morgan -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nWilliam Stein -- Truist Securities -- Analyst\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nEdward Snyder -- Charter Equity Research -- Analyst\n\nPierre Ferragu -- New Street Research -- Analyst\n\nMore AVGO analysis\n\nAll earnings call transcripts"
}