{
  "companyName": "Nano-X Imaging Ltd.",
  "companyTicker": "NNOX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/nano-x-imaging-ltd-nnox-q3-2022-earnings-call-tran/",
  "content": "Nano-X Imaging Ltd. (NNOX 4.98%)\nQ3 2022 Earnings Call\nNov 10, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to NANO-X third quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator instructions] Please be advised that today's conference may be recorded.\n\nI would now like to turn the conference over to your speaker host, Mike Cavanaugh of investor relations. Please go ahead.\n\nMike Cavanaugh -- Investor Relations\n\nGood morning, and thank you for joining us today. Earlier today, NANO-X IMAGING, LTD. released its financial results for the quarter ended September 30, 2022. The release is currently available on the Investors section of the company's website.\n\nErez Meltzer, chief executive officer; and Ran Daniel, chief financial officer, will host this morning's call. Before we get started, I would like to remind everyone that management will be making statements during this call that include forward-looking statements regarding the company's financial results, research and development, manufacturing and commercialization activities, regulatory process operations, and other matters. These statements are subject to risks, uncertainties, and assumptions that are based on management's current expectations as of today and may not be updated in the future. Therefore, these statements should not be relied upon as representing the company's views as of any subsequent date.\n\nFactors that may cause such a difference include, but are not limited to, those described in the company's filings with the Securities and Exchange Commission. We will also refer to certain non-GAAP financial measures to provide additional information to investors. A reconciliation of the non-GAAP to GAAP measures is provided with our press release, with the primary differences being amortization of intangible assets, share-based compensation, secondary offering expenses, goodwill impairment, change in obligation in connection of acquisitions and legal fees in connection with class action litigation, and the SEC inquiry. I'd now like to turn the call over to Erez Meltzer.\n\nErez Meltzer -- Chief Executive Officer\n\nThank you, Mike, and thank you all for joining the call today. Reporting on our third quarter of 2022, I'm proud of the results our team has been able to deliver as we continue to advance our commercialization of the Nanox.ARC system. As in our last call, I will give an overview of our recent achievements and will share our outlook for the rest of 2022 before turning the call over to Ran Daniel, our CFO, to review our financial results in detail. We will then open the call up to questions.\n\nI'm pleased with the progress our team made during the quarter, which, as most of you know, includes our first 10-K submission to the FDA for our multisource Nanox.ARC system at the end of September and which is now under FDA review. I'm very proud of the hard work behind the scenes by our regulatory, product, and other teams to absorb the continuous feedback from our Q-submission process and incorporate it into the research submission. We do not have any insights into the timing of the FDA's response. In other regulatory news, we continue to pursue CE Mark approval in the European Union, and I'm happy to report that we have engaged with BSI, the notified body with whom we will work during this process.\n\nWe look forward to providing updates to you as the process advances in the coming month. I'd like to take a few minutes now to discuss our progress toward commercialization of the multisource Nanox.ARC system. It remains our goal to begin to deploy the multisource Nanox.ARC system in 2022, and we continue to push toward the goal. We continue to advance the process toward deployments of the multisource Nanox.ARC in Nigeria, subject to regulatory approval, as we recently received an import license.\n\nWe intend to ship the first system and begin training soon as we aim to secure regulatory approval. Globally, we have a total of 6,850 preordered units. We believe that once we begin to deploy the multisource Nanox.ARC in Nigeria and in other early adopting countries, health system hospitals and distributors will see the service that the Nanox.ARC provides. Clinical Updates.\n\nWe have received the Helsinki permit to conduct clinical trials in Israel using our multisource Nanox.ARC system. We anticipate that the results of these trials will generate clinical sample images of multiple body organs during the fourth quarter of 2022. Now, turning to our AI and teleradiology business segments. We continue to see revenue from these important business segments.\n\nI'm happy to report that during the third quarter of 2022, we signed nine new client agreements for teleradiology services, and we continue to see revenue growth in these services driven by new client additions, as well as organic growth from existing clients. These businesses generated top-line revenue of $2.4 million in the third quarter of 2022, compared to $2.2 million in the second quarter of 2022. Ran will review the financials in more detail, but these revenues continue to demonstrate the viability and utility of these additional services to the healthcare systems, which services are intended to be part of a fully integrated multisource Nanox.ARC system upon deployment and an integral part of our ecosystem and end-to-end solution. Before I turn the call over to Ran, I'd like to remind everyone that we will be hosting a multisource Nanox.ARC demonstration broadcast with a live audience in Neve Ilan on Wednesday, November 16th, at 9:30 a.m.\n\nEastern time. Due to the capacity limitation, we invite you to attend virtually. You can find the link for registration on our website. I want to thank our investors for their continued support of our vision to help make medical imaging accessible throughout the world.\n\nI'm very happy with the progress we made this quarter, and we look forward to meeting additional milestones as we move toward large-scale commercialization. With that, I'd like to turn the call over to Ran Daniel, chief financial officer, to review our financial results.\n\nRan Daniel -- Chief Financial Officer\n\nThank you, Erez. We reported a GAAP net loss for the third quarter of 2022 of $19.1 million, compared with a net loss of $13.5 million in the third quarter of 2021, which increased largely due to the consolidations of Nanox.AI and USARAD with the company since the fourth quarter of 2021, an increase in our research and development expenses, and increase in our general and administrative expenses, which was mitigated by a decrease in our sales and marketing expenses and a 1.0 million expense due to a change in our obligation in connection of acquisition. Revenues for the third quarter of 2022 was $2.4 million, and gross loss was $1.4 million. Revenue from teleradiology services for the same period was $0.3 million, with a gross profit of $0.6 million on a GAAP basis and a gross profit of $1.2 million on a non-GAAP basis, which represents a gross profit margin of approximately 49.4%.\n\nThe increase in the company's revenue and the gross profit margin in the third quarter of 2022 is due to revenues from a data monetization project with a total revenue of $0.3 million. Revenue from licensing of AI applications for the same period was $0.1 million, with a gross loss of $2.1 million on a GAAP basis and 0.0 million on a non-GAAP basis. Research and development expenses for the third quarter of 2022 were $6.1 million as compared to $3.7 million for the comparable period in 2021. The increase in our research and development expenses was mainly due to the consolidation of Nanox.AI with the company, as well as due to the development of the multisource Nanox.ARC and the Nanox.CLOUD and share-based compensation.\n\nSales and marketing expenses for the third quarter of 2022 were $0.7 million as compared to $1.5 million for the comparable period in 2021. The decrease was mainly due to a decrease in cost of labor and share-based compensation. General and administrative expenses for the third quarter of 2022 were $10.6 million as compared to $8.2 million for the comparable period in 2021. The increase was due largely to the consolidation of Nanox.AI and USARAD with the company since the fourth quarter of 2021, an increase in the company's headcount and the overall organization infrastructure, and an increase in the company's legal fees due to the U.S.\n\nSecurities and Exchange Commission inquiry and class action litigation, as described in the company's Form 6-K filed today and Form 20-F from the year ended December 31st, 2021, filed on May 2nd, 2022. Change in obligation in connection of acquisitions was $1.0 million as compared to none in the comparable period due to the increase in the company's contingent earnout liability. The non-GAAP net loss for the third quarter of 2022 was $8.1 million, compared to a non-GAAP net loss of $8.4 million for the same period in 2021. A reconciliation between GAAP net loss and non-GAAP net loss for the third quarter of 2022 and 2021 is provided in the financial results that are part of the press release we issued this morning.\n\nTurning to our balance sheet. As of September 30th, 2022, we had cash, cash equivalents, and marketable securities of approximately $117.1 million, and we had $3.5 million in loans from bank. We ended the quarter with property and equipment net of $44.1 million compared with $37.4 million as of December 31st, 2021. The increase is largely due to the purchasing the long lead items for our multisource systems and machinery and equipment for our fabrication facility in South Korea.\n\nAs of September 30th, 2022, we had approximately 52.3 million shares outstanding as opposed to 51.8 million shares outstanding as of December 31st, 2021. The increase was mainly due to the exercise of stock options. With that, I will hand the call back over to Erez.\n\nErez Meltzer -- Chief Executive Officer\n\n Thank you, Ran, for the financial update. And once again, thank you all for joining us today. I feel very good about NANO-X's results in the third quarter as CEO, but all of us recognize there is more to do. We hope to provide additional updates in the coming weeks and months.\n\nWith that, I'd like to now open the call for questions. Operator, please begin the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile the Q&A roster. And our first question coming from the line of Jeffrey Cohen with Ladenburg. Your line is open.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nHello, Erez and Ran. How are you?\n\nErez Meltzer -- Chief Executive Officer\n\nGreat. And you, Jeff?\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nJust fine. So, a few questions for you. I guess, firstly, as far as Nigeria and units that are maybe available for placement, could you give us a sense of manufactured ARC units as they stand at the moment?\n\nErez Meltzer -- Chief Executive Officer\n\nIn terms of manufacturing, we are, as we say, in the process. We have all the materials which is available. We are making -- actually, we work hand to hand with the regulatory approvals. So, once we get all the paperwork, we can start to ship the units.\n\nAnd it goes the same with the other countries when we get the -- all the regulation approvals. Just to complete the answer about Nigeria, the next step is send the first unit for demonstration. The demo center is ready already over there. And then to engage with those customers who are expecting to get the machines, to do the training.\n\nAs you know, we've indicated the work that we do with BVGH for the deployment and the training in Nigeria. So, that's the process that we do.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nCan you give us a sense of the size of the order over the coming year specific to Nigeria?\n\nErez Meltzer -- Chief Executive Officer\n\nWe don't -- as you know, and I'm going to stick to it until further or later or future other indications, we haven't given a number so far. The main reason, of course, was the relation. But we haven't given a number so far, and we may change it in the future.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nGot it. OK. And jumping over to the teleradiology. Could you give us a sense of the number of accounts and account growth and/or utilization trends and utilization growth?\n\nErez Meltzer -- Chief Executive Officer\n\nOK. Ran, would you like to address this question?\n\nRan Daniel -- Chief Financial Officer\n\nYes. Jeffrey, we had an additional nine accounts this quarter. The total accounts is approximately 400 as of now. And so, you can calculate yourself the growth rate for the year.\n\nErez Meltzer -- Chief Executive Officer\n\nBasically, you see the numbers in terms of the revenues, the growth rates. We are still waiting for all the approvals and licenses that -- and the accreditation that we are waiting always. When we sign, there is a gap between the time that we can start -- do the readings. But right now, the -- in terms of the customers, as always, we have the sort of, I would say, 60-40 or 70-30, where a few customers are generating pretty much of the, I would say, majority, at least 60% of the revenues.\n\nAnd right now, what we see is a lot of growth in those that have been with us for quite some time. And we see the future as well.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nOK. Got it. And then could you talk about the couple of million of goodwill impairment for the quarter? Is there more to impair? I can see the goodwill number, but will you anticipate any more write downs of that goodwill number for the balance of the year? Give us a sense of what was written down for the third quarter.\n\nRan Daniel -- Chief Financial Officer\n\nYes. And just to complete my answer before to the new accounts, the [Inaudible] accounts. It takes us -- as Erez said, it takes us two to three months to go through the credentialing process once we get the new client, just to complete my other answer. As for the goodwill, the goodwill is really -- the goodwill impairment comes from a few factors.\n\nThe two main ones are, first, you know, a change in the discount rate that we're using. And, you know, as long as the Federal Reserve continue to increase the rates, we should expect to -- at least to be required to examine if we are -- impairment is needed. And that's what we're doing on a quarterly basis. This specific quarter, there was no impairment, but there was indication that the impairment is needed.\n\nSo, we had to go through the whole process. As for your question for the third quarter impairment, there's no impairment expense, but we have to go through the whole process. As for the fourth quarter, and you can also consider the fact that, you know, we'll have to consider always to make for the -- for 2023 and going forward, coupled with any change that will be in the discount rate that will be done by the Federal Reserve.\n\nErez Meltzer -- Chief Executive Officer\n\nNow, you can imagine, by the way, that once we start at the point of the ARC, obviously, all the teleradiology services will be expanded and the growth.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nGot it. And then finally, first, just review where things stand at the FDA as far as the permutations that we should expect going forward. We do anticipate that, obviously, a clearance would be one option. The second would be that they would be back with additional questions.\n\nWhat are the few permutations that we could see?\n\nErez Meltzer -- Chief Executive Officer\n\nOK. The one thing that I don't bet or indicate is the timing of the process from the FDA. And we saw it in the last three years and I think the whole world, the whole business world. But we see it as we see it right now.\n\nWhat we are saying that we have done the utmost or everything that we could in order to increase the likelihood of the clearance from the FDA. Having said that, as I -- I think that -- we spoke about it, and we have emphasized that this year, NANO-X has changed a little bit its regulatory strategy from the single-step FDA submission process to a stepwise approach using Q-submission test for the questions and answer with the FDA team prior to the 510(k) submission. And frankly speaking, we intend to continue to use this dialogue with the FDA as we develop the next generation of the Nanox.ARC system, as well as the future products that NANO-X will generate.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nPerfect. OK. We look forward to next week. Thanks for taking our questions here, Erez. \n\nErez Meltzer -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. One moment before our next question. Now, our next question in queue coming from the line of Ross Osborn with Cantor. Your line is open.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nHi. I hope everyone's doing well. Congrats on the progress. \n\nErez Meltzer -- Chief Executive Officer\n\nHi. How are you? \n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nWell, thank you. So, is there any update on the Ghana contract? I know you noted a special approval process on last quarter's call. So, if you can provide a little bit more color just on what the regulatory environment is there and kind of where you stand in Ghana.\n\nErez Meltzer -- Chief Executive Officer\n\nYou ask about the Ghana deployment?\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nYes, that's correct.\n\nErez Meltzer -- Chief Executive Officer\n\nYou know, we did it up until now, and we did it -- we'll do it in the future, that as soon as we have information which is needed to be shared with the public, we'll do. We signed -- as you know, we signed the agreement. We're waiting for the regulatory processes. And once we get the clearance, as we did now with Nigeria, or the approval, then we'll release it.\n\nBy the way, in the meantime, of course, as we do with any other countries, then we do all the preparations. So, we're meeting with the customers, do initial trainings, checking all the availability of the Internet and telecommunication infrastructure, trying to see what is needed in terms of the training itself, etc., etc. And since we have already said that we expect that the initial deployment of the Nanox.ARC at scale, as we say, to be done in -- outside of the U.S., then basically, that's where we're doing all the stand-alone 3D digital tomosynthesis units. Our approach is, right now, to do the deployment in the U.S.\n\nonly in the next step, and we'll inform when we actually get the dialogue with the FDA as soon as we can get it. We're making all the preparation, even in the countries that will require the FDA, namely meeting distributors, getting to know better the customers, the preparation of the regulatory processes, etc., etc. And so, once we got the clearance, then we can actually move fast forward.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nSounds great. I guess just one more on the Ghana contract. I know you just closed 350 units, but are you able to provide us with a minimum annual fee, if there is a letter of credit existing in the contract?\n\nErez Meltzer -- Chief Executive Officer\n\nThere is always the difference between able and will. And the answer is that as soon as we have something to say, we will say.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nFair enough. And then I guess looking ahead of deployment, do you expect for the scan to be read in Nigeria, or would those be outsourced to that? And if it is the latter, you know, do you have radiologists in place? And are those radiologists, you know, financially motivated to read these scans?\n\nErez Meltzer -- Chief Executive Officer\n\nRight now, right now, based on everything that we know right now, which may change in the future, but based on the studies and the -- on the groundwork that we did in Nigeria, it will be both.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nOK, great. Thank you for taking my questions.\n\nErez Meltzer -- Chief Executive Officer\n\nThank you, Ross.\n\nOperator\n\nOne moment, please, for our next question. Now, our next question in queue coming from the line of Suraj Kalia with Oppenheimer. Your line is open.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nGood morning, Erez, Ran. How are you?\n\nErez Meltzer -- Chief Executive Officer\n\nGood. How are you, Suraj?\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nI'm doing well. Hey, so there is a bunch of questions. Erez, can you give us a -- as you look for commercialization, let's say, to pick it off in Nigeria, how would the workflow for these products look, i.e., what happens in Israel? What happens in Korea, especially your manufacturing facility? What happens in Japan, ceramic or glass? Just kind of walk us through how the workflow is expected to happen.\n\nErez Meltzer -- Chief Executive Officer\n\nYou know, it's interesting, and it's funny. But actually, what you are asking for is a promo for next week on the ARC Day. On the ARC Day, you will see the whole flow. As we have explained in the past, the chips are being manufactured in Korea.\n\nThe tubes are being installed in Korea. And we're planning to do more of it in the future in other -- from other suppliers. All the integration and the assembly is being done currently in Israel and will -- in the future, as we said in the prospectus and the 20-F, will be done, -- part of it will be done outside of Israel. So, the system is fully installed and assembled in Israel, and when it ships, it ships actually a few in a box and shipped to the place that they are going to be deployed.\n\nIn Nigeria, you asked specifically about Nigeria, but it will be the same in other countries. We are doing the installation, the connection to the network, to the system, sometimes, even to tax system in the future. We do all the training of the operators. We do all the training of the maintenance on site.\n\nWe do the training of the radiologist on premise. We have a demo center. We will have a demo center in every country that we're going to deploy. And right now, in Nigeria, we have already the demo center ready to be -- to install the first unit.\n\nAnd what else? And then, of course, the maintenance afterwards and the initial operating of the units will be on the ground. We work with partners in Nigeria. We're going to explore the work that we're planning to do with other partners as well. So, it's not only one, but it will be a few of them.\n\nWe have already engaged ourselves in a dialogue with the customers and hospitals in Nigeria, by the way, in other countries as well. So, that's actually -- I hope that I addressed in detail the answer to your question.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nFair enough. And there is -- I presume the Nigeria configuration is the same as the U.S. configuration.\n\nErez Meltzer -- Chief Executive Officer\n\nIt's a good question. Hopefully, yes. But we don't know what will be -- we hope that the FDA will be -- will approve the same as that we have intended to use. And I hope that no changes will take place.\n\nAnd the answer -- so, basically, that's the answer.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nGot it. And, Erez, finally, the 6,800 or so confirmed preorders that you talked about, how confident are you with the -- with these contracts in their ability to fulfill, you know, your ability to enforce? Because a lot of them, you know, our recollection is, you know, they are at least a few years old and have not gone through validation testing. So, any additional color would be greatly appreciated. Gentlemen, thank you for taking my questions.\n\nErez Meltzer -- Chief Executive Officer\n\nOK. So, I'm more than -- I think they are -- I'm more than 40 years in business, four-zero, and more than 35 years as CEO. And the one thing I have learned in business, that basically, you are confident in the deal and the transaction once the money is in your bank. Then this specific place when the money from each one of them will be in my -- in our bank account.\n\nSo, this is with -- in terms of confidence. But having said that, it all depends on the clearance processes and approvals and regulations in any one of the place. We are in continuous dialogue with the -- with these business entities that we signed the agreement with. A few of them, by the way, are coming from time to time to Israel to see the progress and to see -- to do some training and to get to know better the system and the product and the intended use.\n\nSo, that's basically the answer.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And one moment, please, for our next question in queue. And our next question in queue coming from the line of Rahul Rakhit with LifeSci Capital. Your line is open.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nHey, guys. Thanks for taking the questions. I was just wondering if you could touch a little bit on the initial utilization levels at Northwell and Spectrum Health. Maybe help us better understand how to think about the revenue generation from these IDNs moving forward.\n\nErez Meltzer -- Chief Executive Officer\n\nFirst of all, the -- we have not indicated specifically from each one of the IDNs, but I will add or I will say a couple of things. The discussion with one of the IDNs that we have already sold and received the money last year, the agreement -- or the extension of the agreement for next year is with much higher revenues coming from the IDN. In terms of the Northwell this is a continuous dialogue. We have the -- over the, I think, few hospitals that were already installed as part of the project.\n\nNorthwell, I would say, is more than just an IDN. They are kind of strategic IDN that we work with, that we jointly develop some applications, we jointly develop some business models and intended use of the AI application. They are planning to adopt and install all the applications that we have. We are -- as you know, we have two in place, and a few others are coming soon.\n\nAnd last but not least, we are in the final process of developing the business -- the future business model that will help us to indicate what is the value that we bring to the IDN, to the insurance company, to the pharmaceutical company and to tailor-made to each one of them, like what would be the best model in order for our benefits to grow the business, but also that they will enjoy from the added value of our services.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nGot it. OK. Thank you. Thanks, guys.\n\nErez Meltzer -- Chief Executive Officer\n\nAnd, Rahul, just one more sentence. We have not indicated the amount of revenue that we generated or going to generate from those two projects. Nevertheless, we have to bear in mind those are the two projects that we have in the process operations area.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nGot it. No, I appreciate that. Thank you. I just want -- can you talk a little bit more about the clinical trials that you intend to conduct in Israel? And if you can provide any color on trial design or what images specifically you guys are focusing on initially and what you -- and how you intend to leverage that data moving forward.\n\nThank you for taking the questions.\n\nErez Meltzer -- Chief Executive Officer\n\nWe'll update as soon as we complete the -- to getting the samples. And the one thing that we -- we have indicated that we have received the Helsinki permit to conduct the clinical trials at -- in one of the leading hospitals. The system is already installed there. The X-ray room is already installed there.\n\nAnd we anticipate that the results of these trials will -- for us, will generate sample of images of multiple body organs during this quarter, the fourth quarter of 2022. I do hope, believe, and anticipate that in the next earnings call, we'll be -- we'll have more to share about it.\n\nOperator\n\nThank you. And I am showing no further questions at this time. I would now like to turn the call back over to Mr. Meltzer for any closing remarks.\n\nErez Meltzer -- Chief Executive Officer\n\nSo, thank you all for taking the time to be with us. For those of you who have actually more interest in what we have to show and indicate, we -- I hope that next week will be good for those -- for these people that would like to see. I thank you, all the investors, for being with us. And we hope to fulfill our promises, the promises that we made to make everything happen and to really change the world in what we're doing.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Cavanaugh -- Investor Relations\n\nErez Meltzer -- Chief Executive Officer\n\nRan Daniel -- Chief Financial Officer\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nMore NNOX analysis\n\nAll earnings call transcripts"
}