{
  "companyName": "Chevron",
  "companyTicker": "CVX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/chevron-cvx-q3-2022-earnings-call-transcript/",
  "content": "Chevron (CVX 0.66%)\nQ3 2022 Earnings Call\nOct 28, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning. My name is Sara, and I will be your conference facilitator for today. Welcome to Chevron's third quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference call is being recorded.\n\nI will now turn the conference over to the general manager of investor relations of Chevron Corporation, Mr. Roderick Green. Please go ahead.\n\nRoderick Green -- General Manager, Investor Relations\n\nThank you, Sara. Welcome to Chevron's third quarter 2022 earnings conference call and webcast. I'm Roderick Green, GM of investor relations. Our chairman and CEO, Mike Wirth; and CFO, Pierre Breber, are on the call with me.\n\nWe will refer to the slides and prepared remarks that are available on Chevron's website. Before we begin, please be reminded that this presentation contains estimates, projections and other forward-looking statements. Please review the cautionary statement on Slide 2. I will now turn it over to Mike.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nThank you, Roderick, and thanks, everyone, for joining us today. We continue to see a challenging and dynamic macroeconomic and geopolitical environment. Current events highlight the importance of balancing economic prosperity, energy security, and environmental protection. In line with these three imperatives, Chevron remains focused on our objective to safely deliver higher returns and lower carbon.\n\nDuring the third quarter, we continued to make progress by delivering return on capital employed in the mid-20s, returning more than $5 billion to shareholders for the second quarter in a row and investing to grow both our traditional and new energy businesses. Earlier this week, we released our methane report with specific disclosures about our aim to be a leader in methane emissions management. Our goal is simple: keep methane in the pipe. I encourage you to read our report available on chevron.com.\n\nOur strategy remains clear and consistent. Our results keep getting better. While future market conditions are uncertain, we're well-positioned to deliver value to our shareholders in any environment. With that, I'll turn it over to Pierre.\n\nPierre Breber -- Chief Financial Officer\n\nThanks, Mike. Third quarter financial results were strong. Included in the quarter were $177 million of pension settlement costs and positive foreign currency exchange effects of $624 million. The appendix of this presentation contains a reconciliation of non-GAAP measures.\n\nWe repurchased shares at the high end of our guidance range and ended the quarter with a net debt ratio under 5%. Cash capex was $3 billion, up over 50% from last year. For the sixth consecutive quarter, Chevron's free cash flow exceeded $5 billion. We're on track to beat 2021's free cash flow record.\n\nAdjusted third-quarter earnings were up more than $5 billion versus last year. Adjusted upstream earnings increased mainly on higher realizations partially offset by inventory timing impacts. In Other, tax benefits are more than offset by higher operating expenses and other costs. Adjusted downstream earnings increased primarily on higher refining margins and favorable inventory timing impacts.\n\nThe planned turnaround at our Richmond refinery was a driver of higher opex and lower volumes for the period. In Other, lower chemicals earnings were partly offset by higher trading gains. Compared with last quarter, adjusted earnings were down modestly. Adjusted Upstream earnings increased primarily on higher liftings and tax benefits, partially offset by higher charges for abandonment accruals and exploration leases.\n\nAdjusted downstream earnings decreased primarily on lower refining margins and lower volumes and higher opex due to the Richmond planned turnaround. Partially offsetting is a favorable swing in timing effects. Third quarter oil equivalent production was flat compared to a year ago. Growth in the Permian, along with the absence of turnarounds and Hurricane Ida impacts were offset by the expiration of our contracts in Thailand and Indonesia and the sale of our Eagle Ford asset.\n\nNow looking ahead, in the fourth quarter, we expect modest turnaround. After producing a record number of LNG cargoes in third quarter, we expect fewer spot cargoes out of Australia due to maintenance and summer temperatures. In the third quarter, we received a dividend from Angola LNG. In the fourth quarter, we expect dividends from TCO and Angola LNG, and we expect to end 2022 at the top end of our full-year guidance for affiliate dividends.\n\nAs a reminder, Chevron pays a 15% withholding tax on TCO dividends that lowers earnings and cash flow. In the fourth quarter, we will pay over $700 million associated with the early termination of a long-term LNG regas contract at Sabine Pass. This payment was accrued previously through working capital. Also, we expect to buy back shares at the top end of our guidance range.\n\nIn closing, the third quarter showed again how Chevron's higher returns, lower carbon objective creates value for all of our stakeholders. Back to you, Roderick\n\nRoderick Green -- General Manager, Investor Relations\n\nThat concludes our prepared remarks. We are now ready to take your questions. [Operator instructions] Sara, please open the lines.\n\nOperator\n\n[Operator instructions] And our first question will come from Jeanine Wai with Barclays.\n\nJeanine Wai -- Barclays -- Analyst\n\nOK. Perfect. Sorry about that. You think I'd have that right by now.\n\nOur first question is on U.S. production growth. So either Mike or Pierre, the Permian was relatively flat quarter over quarter, averaged a little under 700,000 a day so far this year. Given industry dynamics and supply chain challenges, can you provide an update on how operations are going? And I guess what we noticed is that with only one quarter left in the -- left for the year, it looks like you'll be closer to the lower end of the 700,000 to 750,000 guidance range.\n\nAnd so we're just wondering if that's by design or if there's external factors driving that because we also noticed this morning, one of your integrated peers in the Permian lowered their '22 growth expectations.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nYes, Jeanine. My numbers say year to date, Permian production, a little over 700,000 barrels a day, up about 15% from first three quarters of last year, which was just a touch over 600. So we're seeing good growth. And for the quarter itself, production was up about 10% at 708,000 barrels a day versus 646 in the same quarter last year.\n\nI think the thing that some people may miss is during the pandemic, drilled but uncompleted well inventories really grew. And rightfully so, we didn't need to frac wells and bring them online when there was declining demand for the production. And we kept some drilling going. So that inventory grew as we went back to work, the first thing we did was send completion crews out and start to bring the DUCs online.\n\nAnd you saw that through the back half of last year and certainly the first part of this year, which may have misled a little bit in terms of the rate of growth because this was this kind of surge capacity. We're back to Factor VIII drilling now. Our DUC inventory is kind of in line with what our plan would suggest it would be. And so we're seeing production level out at a growth rate that is more the kind of underlying rate that you should see.\n\nSo we likely will be toward the lower end of the range. We get some nonratable bookings from our non-operated joint ventures. We give you a range because we expect to be in the range, but we don't always hit the high end of the range. So in this case, we'll be toward the lower end.\n\nBut we're not changing guidance for this year or our forward guidance.\n\nPierre Breber -- Chief Financial Officer\n\nAnd, Jeanine, I'll just add, that low end of the range, it represents 15% year-on-year growth. So that's very strong growth.\n\nJeanine Wai -- Barclays -- Analyst\n\nOK. Agreed. Maybe, Pierre, just sticking with you here. In terms of your comments earlier this morning, I think I caught it in an article that '23 capex would be at the top end of the $15 million to $17 million medium-term guidance range.\n\nThere's a lot of moving pieces, and I don't know if you're going to want to talk about this because you'll have to -- you'll [Inaudible] it in a month or so. But the most obvious moving pieces that we see next year are that TCO spend starting to roll off, and some of that will be absorbed by the Permian, which we know is going to garner some more capital next year. So our question is, is capital trending to the higher end of that range? Is that more a reflection of Chevron responding to the macro environment? Or was that always part of the plan? And maybe just some inflation is pushing the capital a little higher?\n\nPierre Breber -- Chief Financial Officer\n\nIt was always part of the plan for us to increase investment coming out of COVID, as Mike just spoke about. We're in the final stages of approving our business plan and our capital budget. And as you said, we'll announce that in December. You should expect it to be near the top end of the range, again, consistent with what our plans have been.\n\nWe're going to increase in the Permian and in other locations. We do have some cost inflation that is also -- will contribute to that. We'll share all those details when we announced in December. And that's about a 20% increase in next year relative to where we think we'll end up this year.\n\nSo year to date, we're a little bit below our capital budget on an organic basis. And so that will result in about a 20% increase, which is very, again, in line with our guidance and consistent with increasing investment and growing energy supplies.\n\nOperator\n\nAnd our next question will come from Neil Mehta with Goldman Sachs.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nThe first question was around Kazakhstan, and Mike, would just love your perspective on how you're viewing the assets out there, both the development of Tengiz? And then as you think through vacating barrels via the CPC pipeline?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure. So I'll start with the project. We're on track to complete bulk construction by the end of this year. No change to our cost or schedule guidance, we're 97% complete on construction right now.\n\nThere's still a lot of work to be done, but the risk and uncertainty are certainly narrowing and the remaining risks tend to be smaller in scale and potential impact. So we're moving into commissioning systems testing and start-up activities. We built a new integrated operations control center that I visited, which is fully operational with systems online. Our drilling program is complete.\n\nThe final metering station is online. So very good progress on the construction side, and we'll continue to update you as we progress toward WPMP, the pressure management start-up indicated right now for second half of '23 and then the future growth project in '24. On the CPC and the pipeline, there are no constraints on our ability to move barrels on that line. We've flowed everything out that we've been producing.\n\nAnd you've probably seen the media reports that a couple of the single-point moorings are offline right now for some repairs. So the buoyancy system, those repairs are underway and expected to be completed shortly. So at this point, everything flowing and it looks like we'll continue to do so.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nAnd, Mike, you spent many years as a downstreamer as well and have great perspective on the global refining system. I don't think I ever thought that these [Inaudible] cracks would be up here. So I do love your perspective of where we are in terms of the refining market, how do we work our way through the bottlenecks that seem to be existing in the system and what that means for your downstream business?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure. It's been an interesting couple of years in the refining sector, Neil. With COVID, we actually saw through that period of time, some refineries shut down around the world that maybe at a rate greater than we would have expected before as the economics really collapsed, as demand collapsed. There were -- been some refineries in the U.S.\n\nthat have been taken offline after storm damage or operating incidents that are not coming back. We see others being converted to renewable diesel. And so you had a constraint or a reduction in refining capacity that occurred over the last couple of years in a way we really haven't seen previously. And the other thing that happened is some of the new builds that are in various stages of development, primarily in the Middle East or Asia, slowed down during COVID.\n\nAnd a lot of the industry slowed activity until we had a better view on how we were going to come through that period of time. I think those will come back into developments and eventually online which will ease some of these global constraints. But the system is tight right now. And what you see is when you have some maintenance that runs along, some unplanned events, as we've seen on the West Coast, or when you see things like the strike that we've seen in France here recently, markets tighten up really quickly.\n\nAnd that sends a price signal to try to bring supplies in from further away. And so the entire refining complex right now is a little more tightly balanced than it historically has been. And I think in the short term, if you want to call that the next year, plus or minus, probably stays that way, maybe a little bit longer to some degree. And then I think as you see some of this new capacity come online, we get back into a situation where it's not quite as finely balanced as it is today.\n\nBut to no doubt, we're in a market that we really haven't seen probably in my career in terms of the overall tightness on supply and demand.\n\nOperator\n\nAnd our next question will come from John Royall with J.P. Morgan.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nJust thinking about your buyback range, $5 billion to $15 billion. 3Q is a strong quarter from a fundamental perspective, but maybe feels more repeatable to me than as an upside case than 2Q did. In 3Q, you still generated free cash flow well in excess of both your dividend and the buyback at the top end of the range. So my question is do you think you could go further than the $15 million at the top end, given you still have a good amount of deleveraging happening at this point in the cycle, it doesn't seem quite as extraordinary as 2Q did.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nYes. John, we've actually increased our rate of buybacks three times this year. We announced the first one at the end of last year. So we've steadily moved the range up and the purchases up.\n\nAnd so we're at an all-time high in terms of the rate of share repurchases. And you're right. We've got strong cash flow right now, which allows us to support all of our financial priorities and maintain the strong balance sheet. I think the thing that I just would reemphasize is we want to maintain the buyback program throughout the cycle.\n\nAnd we're not procyclical. We're not countercyclical. We want to operate across the cycle so that our shareholders see consistency out of us and know that they can count on that. And so we're positioned in a way where we're confident we can maintain that.\n\nAnd we regularly reassess it as our view on our business and commodity markets continues to evolve. And so we'll continue to do that and apprise you of anything further. Pierre, do you want to add anything to that?\n\nPierre Breber -- Chief Financial Officer\n\nI'll just point out that we increased our dividend 6% earlier this year. We've been growing our dividend at a compounded annual growth rate of 6% for 15 years. And that is our first financial priority. So there's a lot of tension on the buyback, but it's clearly our fourth priority after sustaining and growing the dividend, investing to grow both traditional and new energy businesses, maintaining a strong balance sheet.\n\nAnd as Mike said, we intend to do it across the cycle for multiple years.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nGreat. And then just looking at your bridge for international upstream, and I think Pierre may have mentioned in his remarks as well. You have this tailwind about $300 million from tax. Is that an impact from country mix? Or are there other moving pieces we should think about there? And should we think about this as sustainable?\n\nPierre Breber -- Chief Financial Officer\n\nIn terms of international upstream, the benefit in the third quarter was primarily around a record LNG cargoes out of Australia, primarily Gorgon and Wheatstone are very happy to see that. It was a time when the world needed the energy. And again, a lot of that is under long-term contracts, but that included cargoes in the spot market, which we know we're at high prices. So we signaled that we expect of fewer LNG cargoes in the fourth quarter because during the summer temperatures in the southern hemisphere is just how -- you just produce less.\n\nAnd then we do have a pit stop that is planned for one of our facilities. In terms of tax items, those are items that can be onetime in nature. And so I would not look for those to be necessarily repeating.\n\nOperator\n\nOur next question will come from Roger Read with Wells Fargo.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nMaybe just to ask a question that kind of ties a little bit into the question on the Permian. Maybe as you said, lower end in the non-op portion and the capex discussion. But just a broad question on inflation and not just inflation in the price sense, but some of the productivity challenges that come when you start getting busier. I mean you've got as good a global footprint as anybody.\n\nI'm just curious how you'd characterize that as you look across? And is there -- is it becoming more challenging to mitigate some of those issues?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nYes. Roger, I'd like to tell people we plan our work and work our plan. And so we've indicated for -- frankly, if you go back to pre-COVID, our trajectory is that we pretty much have stayed right on even with the interruption of COVID. And so in terms of contracting for rigs, completion crews, pipe, sand, you name it, we tend to have a longer-term visibility into that.\n\nWe commit to our service providers earlier, and that can result in both quality and availability of people, equipment, etc. So we don't see any meaningful constraints on our ability to execute our program. Certainly, we are seeing some cost inflation. And the Permian is probably the strongest that we see around the world, kind of into the low double digits year on year.\n\nIn other parts of our portfolio, the cost pressures are probably a little bit less and the constraints aren't quite as pressing. So I think you'll see a little bit of that in our capital guidance as it comes out as we wrap up our planning and we look to next year. And I do think that it is probably a very real, I wouldn't call it a governor, but a constraint on industry, the pace of industry activity and ramp up as we get into the next year. You'll hear other people talking about it from their point of view, and I'll let them comment, but yes, it's very real.\n\nAnd we've seen this movie before. In the Permian, we've seen it up in the oil sands a decade earlier. And in a cyclical business, this is a part of it.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nYes, for sure. Follow-up question. Renewable natural gas RNG, we saw big acquisition announced here a few weeks ago on that front. You've been one of the leaders.\n\nAnd I was just curious, as you look at what's been going on in terms of some of the legislation that's come out federally as well as just the extent of the impact of the LCFS in California. Any updates we should think about in the RNG business. One of the things mentioned in that acquisition was the position that company already had in terms of -- I guess you'd call it leaseholds, right, on landfills and stuff and just characterize kind of where you are relative to where you want to be and to where maybe this competitor is setting up.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure. We feel very good about where we are. We're a leader in RNG, leveraging strengths across the entire value chain, from feedstock to customer. We've been a partner of choice for a lot of the dairy farmers.\n\nWe've got a strong brand to pull through. We've got a really strong market position in California where the LCFS provides the strongest incentives for this. So we like the position that we've built up. We've got 75 CNG sites online are in progress right now through the retail side.\n\nSo our efforts, we were an early mover and we've preferentially focused on dairy as opposed to landfill gas. So there certainly are others that are active in this area. I don't want to comment on how somebody else looks at things. I would just say, our business is up and running, and we're supplying customers today, not kind of planning out into the future and kind of banking on that.\n\nI mean we intend to grow it further, but it's a real business for us today and it's performing well.\n\nOperator\n\nOur next question will come from Devin McDermott with Morgan Stanley.\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nSo I wanted to stick with New Energies first. And a few weeks ago, there was an announcement that you joined a consortium to look at a hydrogen project in the Gulf Coast. So I was wondering you talked in a little bit more detail around that. And then more broadly, with the inflation reduction at passage, how you're thinking about the opportunity set in your New Energies platform over the next few years?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure. So we're excited about the announcements to work with a number of really good partners to try to develop hydrogen opportunities there on the Gulf Coast. One of the things I think you're going to see in these New Energies businesses as they evolve is we're going to have to build entire new value chains. And that means we're going to partner with different people who have expertise in different parts of these value chains and can bring technology, can bring customers, can bring experience to a venture that no one company necessarily would have all of that, but collectively, we can work with people that can build these new value chains.\n\nAnd so it's early days on many of these things, we're studying all the different opportunities in terms of blue hydrogen, green hydrogen, there's a lot of different colors that are possible as you get down into the details of it. And it will require significant investments. So I don't want to get ahead of ourselves here. This is to really develop well-informed perspectives on the investment opportunities, the business models and ultimately, how we would build the business up there.\n\nBut it's exciting. They're high-quality partners that we are working with. And I think you'll see more of these efforts announced here. We've got a lot of it that we're working on around the world, not just here in the U.S.\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nGreat. Look forward to seeing the additional details there over time. My second question is actually on M&A and just consolidation. And if you think back over the last few years, you've had a great track record, the Noble deal in 2020 REGI more recently.\n\nWonder if you could talk a little bit more about how you're viewing the landscape for further acquisitions, upstream, downstream and even New Energies going forward.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure, Devin. So we're always looking. We've got an evergreen process where we scan all the different sectors that are of interest to us. And so we watch companies, we watch sectors, we watch opportunities.\n\nAlthough we've had a pretty high bar, which is why we've only done a few deals. And as you say, we feel like the deals we've done are likely to turn out well. We've got a strong portfolio. We've got a really strong base case.\n\nAnd so we don't need to do a deal unless it really improves on what we expect to deliver otherwise. So I would just say we're going to continue to be very disciplined. We don't have an open checkbook even when times are good like this, especially when times are good like this. We walked away from a deal a few years ago rather than chase value out of it.\n\nWe've sold assets out of our portfolio at well times. And as you say, the last couple of deals were done at a pretty good time. So over time, I think in the oil and gas business, there's likely to be some more consolidation. You need fewer and stronger companies that normally happens at the bottom of the cycle rather than at the top of the cycle.\n\nIn New Energies, there's a lot of activity, to Devin's question, and I think there's a very active market out there where you could see some things come together because nobody has all the pieces. And I think as you look at building these businesses, we're going to find combinations probably are necessary to actually begin to put those pieces together. But we're going to be disciplined as we have been all along. And if we do anything, we'll come out to explain to you how it's going to create value for shareholders.\n\nOperator\n\nOur next question will come from Doug Leggate with Bank of America.\n\nDouglas Leggate -- Bank of America Merrill Lynch -- Analyst\n\nMike or Pierre, maybe I've got one for each of you guys, and I'll go to Pierre first. So Yes, I think you've been -- both of you guys have been very clear about managing the buyback through the cycle. And I think we all probably agree that your breakeven is now one of the best in the industry. But you still end up building a ton of cash and your share price is at, I guess, pretty close to an all-time high.\n\nSo I'm just curious, the last thing you had this situation, you had multiple parallel projects going on to manage almost close to a net debt zero balance sheet. What's to prevent you from building cash on the balance sheet and being opportunistic, whether it be through M&A or whether it be a cyclical opportunity to buy back your shares at a low level? I'm just curious how you think about that.\n\nPierre Breber -- Chief Financial Officer\n\nWe've had a philosophy that goes back a long time and a track record. Again, I think that speaks for itself, 35 years of dividend increases, again, compounding at 6% for the last 15 years. Our investments in our traditional new energy growing both our guidance on upstream production growth is 3% compounded. We're now the second largest biorenewable diesel producer in the country with our REGI acquisition.\n\nAnd when we generate cash in excess of that, it first goes to the balance sheet. So we've been very clear that our stated net debt ratio is between 20% to 25%. That's still a very strong balance sheet. If you recall, as we entered COVID, we were the only company that showed a stress test at $30 Brent and our net debt ratio was going to go into the low 30s if in fact, we would have had two years at 30.\n\nBut that would have been where many of our peers started into COVID. So we've always maintained a strong balance sheet, and we think that's appropriate over the cycle to be in that range. But we're well below that. Our net debt is under 5%.\n\nSo that's just a function of cash coming in and our just commitment to not be procyclical, we could have a larger buyback program today. Absolutely, if we wanted to just peg our net debt ratio at a higher level. But I think our shareholders would appropriately question that strategy as not being across the cycle. So we're setting the buyback at a level that allows us to maintain it across the cycle when prices do correct.\n\nWe'll continue to buy back shares near the top end of the range that we've been talking about. In terms of acting countercyclically in terms of M&A or any kind of major capital project, we have the capacity to do that at all kinds of balance sheets. We've shown that on M&A, we use equity because we think it makes a lot of sense. There's oil price risk in any kind of transaction so we don't need to do it all with cash.\n\nIt will come with debt very likely. So we want to have some capacity but using equity in oil deals makes a lot of sense. And again, we have a great portfolio of projects, but we've shown a 10-year profile in addition to our five-year guidance where the growth continues. We have a lot of great projects to choose from.\n\nThe goal here is to sustain and grow the enterprise with the lowest capital possible. We're more capital and cost efficient than we've ever been. We've talked about that. And we're not really paid for growth by the market.\n\nSo we're growing at very appropriate rates, strong rates for the next five years. And again, we've shown beyond that, but we certainly have the balance sheet and the capability to do more if we think, again, as Mike said, it's in the interest of our shareholders.\n\nDouglas Leggate -- Bank of America Merrill Lynch -- Analyst\n\nMike, I hate to put you in the spot, but are you -- how the privilege or the challenge, I guess, of meeting with administration recently. I asked this question to your larger peer earlier today. And I'm just curious if you would care to share your thoughts on some of the potential legislative risks that might face the industry. And I guess, at a big-picture level, I'm curious whether you feel that the kind of ESG pendulum from an investor standpoint is beginning to swing back in your favor? Just that any thoughts you may care to share on that.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure, Doug. So look, when we meet with policymakers, including those in the administration, what I talk about is the importance in energy of balancing economic prosperity, energy security and environmental protection. And all three of those things matter. Economic prosperity is affordable energy underpins the ability of the economics or economies to thrive.\n\nReliable energy is tied to national security, and we're seeing that play out in different parts of the world today. And then, of course, there are the concerns about the environmental impacts of energy production and energy use, and we have to take those very seriously as well. And so my message to the policymakers is to be sure that we consider the appropriate balance of all three of those in policy because if you over-index on just one, you can create unintended consequences and vulnerabilities that may not manifest themselves for a little while, but they're there. And eventually, they do materialize.\n\nAnd so I'm a believer that we share a lot of common ground with governments around the world as we talk about these issues. We share common ground with our investors who are concerned about these things as well. And so look, we've been doing ESG for a long time. I keep a book on my desk called the Standard Oil Spirit that was written in 1923.\n\nAnd it talks about our commitment to people, that talks about our commitment to protecting the environment. And this has been in the ethos of the company forever, and it's evolved as society has evolved. And so we're committed to being a responsible company and being a part of the solution here in the U.S. and around the world.\n\nOperator\n\nOur next question will come from Ryan Todd with Piper Sandler.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nMaybe one follow-up question on biofuels, on the liquid side of the biofuels market. Could you maybe provide an update how you're seeing the liquid biofuels market maybe relative to your expectations, particularly with a little time with the REG acquisition under your belt? You're expanding pretreatment in Germany, Europe pitching things toward sustainable aviation fuel. So how is the market playing out relative to your expectations? How do you see the issue playing out between U.S. and Europe? And then maybe any update on the progress of the Geismar renewable diesel facility that you acquired from REGI?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure. So I'll start with the REGI acquisition. The assets are good, the people are little better. Any surprises so far have been to the upside.\n\nWe've already identified quick wins, commercial opportunities. We've lowered insurance and financing costs. Integration efforts are all on track and delivering on our expectations. We're seeing placement of biodiesel in the Chevron's West Coast refining -- or in the marketing network, and that continues to ramp up.\n\nWe're optimizing freight and feedstocks across the system. So all of that builds on the strength that both companies had in the renewable fuels value chain. And we just see it as a really a nice combination here. The Geismar expansion is underway, and we're halfway already to our renewable fuels target as that's completed.\n\nWe indicated we're going to grow to 100,000 barrels a day. We're well on our way to do that. And of course, we're investing in other relationships. We've got a joint venture with Bunge, where we're now participating in the soybean crush spread and bringing feedstocks into the system.\n\nWe're working on converting hydroprocessing capacity at some of our refineries to be able to run bio feedstocks. So this is a part of our business that will grow the economics on it, like anything in the downstream or a function of feedstock costs, supply demand in markets. But they've been good so far, and we expect across the cycle and out into time that they're going to continue to be an important part of our portfolio. We are seeing more people go into renewable diesel.\n\nIt's a market that, like any other commodity market at times may get long and margins may reflect that. But we're familiar with those dynamics from our traditional business.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nThanks, Mike. Maybe one more. Just maybe a little speculative, but any thoughts on what you think the impact of a Russian product import ban to Europe on how that could play out in terms of product flows? Are those barrels likely to find a home in Latin America or Africa? Or do you think that we may actually see a decent amount of that Russian product disappear from the market?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nYes. Any of these export bans have to be looked at within the context of the broader market. And as you say, just as we've seen on crude, where the U.S. has managed the import of Russian crude Europe hasn't yet that's coming.\n\nBut it's a global market. And you've got other buyers that need -- they the products and they're not participating in the sanctions necessarily. And so going to the earlier question from Neil about the products side of the business, markets are tight right now. Diesel, in particular, as we've seen here recently and likely to stay that way through the winter, I think.\n\nFurther, we get into the first quarter when the products ban comes into effect in Europe. And I think that's going to be set against a backdrop of pretty tight product markets, and you are going to find countries around the world need that fuel. And you get into logistics then, you've got longer shipping legs, which do you have enough ships to move it and how do you -- how does the system reoptimize? It's a less efficient optimization for sure than moving it to the natural closer markets. But I do think that you'll see those products continue to flow those just go to more distant markets with increased costs and logistics and continue to keep some of this pressure on the overall balances out there.\n\nJeanine Wai -- Barclays -- Analyst\n\nOur next question will come from Lucas Hermann with Exane.\n\nLucas Herrmann -- Exane BNP Paribas -- Analyst\n\nTwo, if I might. The first for you, Pierre. Just remind me, in terms of social contribution toward the top end of the range, I think the indication was $3 billion at the top end of the range, but perhaps you could give us an indication of the level of dividend that's been paid out of associate to date. And I guess I'm a little surprised that in the current environment, one might expect that the associate dividend would be beyond the 3 billion? And then, Mike, just if you could just give us a [Inaudible] or some world win, but just talk around the Gulf the developments that are taking place there within your own portfolio and how those are proceeding and your current thoughts on timing.\n\nThat'd be great.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nOK. I'll let Pierre start, and then when I come back, I'll just ask you to clarify, Gulf of Mexico or --\n\nLucas Herrmann -- Exane BNP Paribas -- Analyst\n\nSorry, Gulf of Mexico. Yes, no, Gulf of Mexico.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nOK. Very good.\n\nLucas Herrmann -- Exane BNP Paribas -- Analyst\n\nYou're welcome to talk about both, Mike.\n\nPierre Breber -- Chief Financial Officer\n\nLucas, you're right that affiliate dividends at last quarter, we guided to be above the top end of the range, and now we're guiding at the top end of the range, which we increased during the course of the year. And that reflects really 2 items. Angola LNG has in the affiliate income line, been generating earnings all year, but during the first half of the year, the cash return was a return to capital and the dividend. And so it's showing up in a different part of the cash flow statement.\n\nAnd then the second item is, given the uncertainty at CPC, TCO is holding more cash. We'll get more cash out of TCO. But I think TCO appropriately is just being cautious. As Mike said, all of our barrels are flowing.\n\nIn October, we expect them all to flow in November, we expect the repairs to be completed shortly. That said, they're just being cautious and holding a little higher cash balances. So we'll be at the top end of the range through 3Q, I think we're at about $2 billion of affiliate dividends. You can confirm that with Roderick.\n\nBut the reason why you're seeing that the cash flow line of affiliate income less dividends being a little bit larger than maybe you'd expect, it's primarily those two drivers in terms of the quirks of Angola LNG accounting and TCO holding cash balances, which will be a temporary thing, and we expect that, that we'll see higher cash in the future from them.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nOK. Gulf of Mexico, Lucas, as you know, we're one of the largest leaseholders in the Gulf. We've got over 270 leases out there and a strong base business, a lot of installed infrastructure that enables capital-efficient brownfield development. And importantly, it's one of the most carbon-efficient assets in our portfolio with a carbon intensity of about 6 kilograms of CO2 per barrel of oil equivalent.\n\nLease Sale 257 is the one that was in question. Here a few months ago, as a result of the Inflation Reduction Act, that's been clarified and that lease sale is proceeding. We picked up 34 leases in that sale. And we look forward to continued leasing by the federal government as indicated and kind of encouraged by the Inflation Reduction Act, and we'll participate in those.\n\nIn terms of production growth, we will advance a number of projects that are underway right now. Jack St. Malo has a multiphase pumping project that starts up this year and some additional development drilling. Bigfoot has ongoing development drilling and water injection that will begin in the first quarter of next year.\n\nMad Dog 2 is operated by one of our partners, and I would refer you to them for an update on that project. We've got at St. Malo, our waterflood first injection plan for next year. anchor a new greenfield project.\n\nWe expect first oil on that in 2024. Wale, another greenfield project operated by one of our partners. I expect first oil on that toward the end of 2024. And then we recently took FID in the second quarter of this year on the Ballymore project and expect first oil on that one in 2025.\n\nSo I appreciate the question because oftentimes, I hear people say, well, we can see the Kazakhstan growth. We can see the Permian. What else do you have? We've got a string of projects there in the deepwater Gulf of Mexico that are kind of sequentially lined out that will steadily contribute to production growth here in the U.S. from the deepwater.\n\nOperator\n\nAnd our next question will come from Biraj Borkhataria with RBC.\n\nBiraj Borkhataria -- RBC Capital Markets -- Analyst\n\nI've got two left, please. First one is just going back to Kazakhstan and CBC. My understanding is there's been sort of fortuitous timing for Tengiz because one of the other projects in Kazakhstan has been offline, which has allowed Tengiz to flow despite the capacity obviously being lower. So I was just trying to understand, hypothetically, if Kazakh production comes back up to full capacity, but the pipeline capacity is maintained to be reduced or is not at full capacity? Then do all the projects get pro rata down equally? Or is there any other quirks that we need to be aware of there as it relates to Tengiz? And then the second question is on your LNG portfolio, performed extremely strong this quarter.\n\nCan you say what proportion of your LNG portfolio is sold under long-term contracts? And what portion is sold on this on a spot basis, either for the year or over the medium term?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nYes. So at CPC, I mentioned earlier that right now, only one of the three single-point moorings is operational. The other two are down for some maintenance and repair work that's well underway. And so we would expect that work to be completed and to be able to handle full flows on CPC here before too long.\n\nIf for some reason that didn't happen, and we were constrained to the one SPM, that has the capacity to load out about 70% of what CPC can move when it's operating full. So there would be some constraints on movements. TCO has long been the initial, the largest [Inaudible] want to get into the details, but we would still be able to flow barrels, maybe not all of our barrels, but I think TCO would be well positioned to not be disadvantaged, let me say that, if there were some sort of proration underway.\n\nPierre Breber -- Chief Financial Officer\n\nI'll just add that the nominations for CPC for November have already been put in place and Tengiz TCO essentially got a full nomination even for November. And again, that's even in a situation if the SPMs are not repaired. Of course, if they're repaired by the bond issue, but even if they stay down for November, TCO has already received a full nomination. On the LNG question, it's notionally around 80% contracted, 20% spot.\n\nThat's a combination of both of our Australia LNG operations and our West Africa operations. Our West Africa tends to be almost all spot in Australia is closer to 90-10. So that averages out to about 80-20. And we'll give guidance on our spot price sensitivity.\n\nWe'll do that in the fourth quarter call at the end of January. It depends on how many spot cargoes are produced, both out of, again, our West Africa and Australia operations.\n\nOperator\n\nAnd our next question will come from Irene Himona with SocGen.\n\nIrene Himona -- Societe Generale -- Analyst\n\nCongratulations on the very strong results. My first question, your financial framework is clearly to manage through the cycle. But at the same time, the current uncertainty on the commodity price outlook is rather extreme, and that is partly because of the risks of fears or recession. So my question is, as you look at your downstream businesses, whether in the U.S.\n\nor Asia, have you seen any signs of an economic slowdown which would cause you some concern as you look ahead to 2023 and which might perhaps drive a more conservative approach to capex growth?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nYes, Irene, thanks. Demand remains pretty strong globally across the product barrel. Now there are some variations in that. Certainly, the U.S.\n\nWest Coast, which had some refining issues, and prices reflected that. We saw gasoline demand in the third quarter, responsive to those higher prices and a little bit of softness there. Diesel demand has been pretty strong around the world, maybe a little less so in China, given some of the lockdowns that they're seeing. And aviation demand has been steadily coming back as people are flying again not quite to pre-COVID levels yet, but steadily increasing.\n\nAnd so overall, I wouldn't say that product demand that we've seen to date is setting a strong signal that a recession is underway or that the economy is significantly slowing. As I said, there's always some kind of regional or maybe sectoral unique characteristics. But no, we're not really seeing that yet, Irene.\n\nIrene Himona -- Societe Generale -- Analyst\n\nMy supplementary question, if I can go back to renewable natural gas, please. LCSS prices have more or less halved over the last year. I wonder if you can help us understand the impact, if any, on your own R&D. Does it create some pressures to perhaps work more on the technology to try and reduce the costs, given that the value of the incentive is half what it was last year?\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure. So let me set the incentive aside for a second. In every one of our downstream businesses, we're always working on reducing costs and improving technology and finding ways to become more efficient. And so that's inherent in our business.\n\nThe dynamics around LCFS credits, RINs, AB32 credits in California, the EU trading scheme. All of these things, we have to manage through their own cycles. And it's a part of our business that is related to but not necessarily correlated to the fundamental supply demand dynamics that drive physical flows because you have government allocations of credits and whether people are building inventories or credits or drawing down inventories of these credits. And so they don't necessarily correlate with the underlying commodity.\n\nAnd we've got a fair amount of experience in managing that. Certainly, the economics on something like RNG on the credit structure and the regulatory framework that incentivized those businesses. And if you see the credits declining in value that it starts to erode a little bit of the margin in that business. We have to take a long-term view on these things.\n\nAnd I think the regulators do the same. And as they see credit values reflect a lot of length in credits, that suggests that the technology is advancing, the supply is advancing and they can set more ambitious targets. And so these things evolve over time. And I think our people have a pretty good track record of managing in that environment.\n\nOperator\n\nAnd our last question comes from Paul Cheng with Scotiabank.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nMike and Pierre, one question for each. First is a simple one. In the past in your presentation, when you're talking about downstream, we talk about what's the chemical earning sequentially, whether they are up or down. You didn't mention in your presentation at this time.\n\nDoes that means that chemical earnings is actually relatively flat, which is surprising given how much is the margin drop we've seen in the industry. So that's the first question. Second question on Mike, is for the LNG longer-term strategy. most of your peers that have been pretty aggressive in growing their LNG operation, you have very possible or at is very cash flow rich LNG operation, but you don't really have much time to grow at least on the table.\n\nCan you maybe elaborate that what is your longer-term, medium- to longer-term strategy in LNG.\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nSure, Paul. Yes, quickly on chemicals, earnings were a little bit lower quarter on quarter. And that's really a function of margins. We had higher ethane prices and lower polyethylene prices.\n\nAnd so the olefins margins, which is the largest driver of our performance were squeezed. So it did go down sequentially. On LNG strategy, we've long favored the Pacific Basin, given the best customers were in Japan, Korea, Taiwan markets and our resource position in the Pacific. The Atlantic Basin, we've got exposure to it.\n\nBut Europe traditionally has been a market where you were competing with Russian pipe gas and just less attractive. With the changes now that we see in markets, we're increasing exposure to Atlantic Basin LNG. We've done a couple of deals with Gulf Coast projects that are being developed that will give us offtake that we can move into global markets. And then we're advancing projects in the Eastern Mediterranean in the assets that were acquired with the Noble acquisition, that would potentially allow an expansion of the Leviathan field to provide LNG supply that can go into global markets.\n\nWe've looked at other things. So the big process has been underway in [Inaudible]. We certainly were deeply involved in evaluating that opportunity. Like everything that we look at, LNG has to compete against the other investment opportunities in our portfolio.\n\nWe're going to stay very disciplined on capital and we won't invest in everything that we could. We're going to invest in the best things that we can. And I expect that will include some LNG projects over time.\n\nRoderick Green -- General Manager, Investor Relations\n\nI would like to thank everyone for your time today. We appreciate your interest in Chevron and everyone's participation on the call today. Please stay safe and healthy. Sara, back to you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRoderick Green -- General Manager, Investor Relations\n\nMike Wirth -- Chairman and Chief Executive Officer\n\nPierre Breber -- Chief Financial Officer\n\nJeanine Wai -- Barclays -- Analyst\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nDouglas Leggate -- Bank of America Merrill Lynch -- Analyst\n\nRyan Todd -- Piper Sandler -- Analyst\n\nLucas Herrmann -- Exane BNP Paribas -- Analyst\n\nBiraj Borkhataria -- RBC Capital Markets -- Analyst\n\nIrene Himona -- Societe Generale -- Analyst\n\nPaul Cheng -- Scotiabank -- Analyst\n\nMore CVX analysis\n\nAll earnings call transcripts"
}