{
  "companyName": "Lexinfintech Holdings Ltd.",
  "companyTicker": "LX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/lexinfintech-holdings-ltd-lx-q3-2022-earnings-call/",
  "content": "Lexinfintech Holdings Ltd. (LX -1.04%)\nQ3 2022 Earnings Call\nNov 16, 2022, 8:30 p.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the LexinFintech third quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. And now I'd like to hand the conference over to Ms.\n\nEcho Yan, IR director of LexinFintech. Thank you. Please go ahead.\n\nEcho Yan -- Investor Relations Director\n\nThank you, operator. Hello, everyone. Welcome to LexinFintech's third quarter 2022 earnings conference call. With us on the line today are CEO Jay Xiao, president, Jared Wu, and CFO, Sunny Sun.\n\nBefore we get started, I'd like to remind you that the call and presentation contains business outlook and forward-looking statements, which are based on a assumptions as of today. The actual results may differ materially and we undertake no obligation to update forward-looking statements. Jay will first provide an update on our performance. Sunny will cover the financial results in more detail.\n\nAnd lastly, Jared-san will discuss risk management. I will now turn the call over to Jay. His remarks will be in Chinese and then his translation will be followed. Jay, please?\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nHello, everyone. It's my pleasure to speak with you, again.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nIn the third quarter, already COVID resurgence and the somewhat pressured macro economy will achieve a result that not only continued the recovery trend but also the past. Our second and third quarter results [Inaudible] obstacle has had under sustainable effect of clear change for the better.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nOur loan volume exceeded the previous guidance at RMB 53 billion, reaching RMB 56.2 billion for the last quarter, representing an increase of 14% quarter over quarter -- [Inaudible] revenue at RMB 2.7 billion, representing an increase of 12% quarter over quarter. Net profit at RMB 280 million, representing an increase of 65% quarter over quarter. Overall, outstanding loan balance at RMB 94.6 billion, representing an increase of 9% quarter over quarter. Total registered users at 180 million, representing an increase of 19% year over year.\n\nSince the beginning of this year, our asset quality, funding cost and loan volume improved quarter over quarter, providing improvement in our profitability. Net margin improved steadily from 4.8% in the first quarter to 10.2% in the third quarter.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nThe improvement continued in the fourth quarter. Based on our confidence in strategy and growth potential, the company repurchase program remains in execution. As of September 30, 2022, the company had repurchased approximately 20 million ADSs for approximately USD 44 million under this repurchase program. In addition, a new share repurchase program has been authorized under which the company could purchase up to an aggregate of USD 20 million over the next 12 months from November 17, 2022.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nOur ongoing recovery trend is accomplished, thanks to our asset quality all the time and operation strategy, that's being refined instantly, which is lowering our risk level, refining operations and better asset quality to the improvement of profitability. In particular, the asset quality will continue to strengthen our risk management team by introducing several talents in the industry to join us this quarter. We have also strengthened our investment in data and models to continuously improve the accuracy of risk identification. And I would like to elaborate more on these subjects now.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nOn the acquisition front, in the third quarter, we reinforced our online customer acquisition capabilities by expanding the leverage of the use of external data resources and deepening the corporation bonds with our advertisement partners to generate over 30 customer acquisition models. For the last quarter, our acquisition cost went down 14 % year over year and new customer per capita increased by 31% in September compared with that number in June.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nIn terms of our existing customers, we continue to enhance our capabilities into a more refined operation in customer management by incorporating external data resources with our own database, which contained many years of data. And increased our data abundance by 30%, extended the degree of the direct connection of the use of the credit reports from PBOC and derived nearly 400,000 risk identification dimensions. On top of that, we established and perfected a new risk model based on different trading patterns, increasing its accuracy by 10%. On the operational strategy front, we followed one of our priorities in exploring the potential of our qualified customers to whom we provided higher credit lines and lower interest rates and boosted their contribution in values throughout their life cycles.\n\nMeanwhile, we are continuing the course of a steady reduction of high-risk customers to further stabilize our risk level.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nThrough these approaches, our asset structure was improved to the next level for the third quarter. Low risk customer loan origination volume increased by 70% quarter over quarter and average contribution increased by 44%. In the meantime, the ARPU of our active customers increased by 33% year over year and the incremental scale of loan origination conversion of the existing users exceeded RMB 2 billion. In the third quarter, the 30-plus day delinquency rate was 4.61%, which decreased 0.24 percentage point quarter over quarter, while the 90-plus day delinquency rate was at 2.66%.\n\nThe day one delinquency rate continued to be decreased quarter over quarter, while the 30-day collection rate was maintained at above 90% with a steady increase.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nAll these cannot be done without the assistance of the optimization of our data and technology capabilities, which has always been the core driving engine of the development of the company. In the third quarter, research and development expenses were at RMB 140 million, a 7% increase year over year, continuing to take the lead of the industry. The smart business engine continued to be iteratively upgraded. In terms of the system capabilities, we established mechanisms or systems such as our user LTV model, indicator valuation alert and intelligent attribution scheme.\n\nWe increased the coverage of agile business scenarios to 100%, which greatly improved the company's decision-making and operational efficiency. In terms of AI applications, we strengthened the exploration application of deep learning to identify user risks from more dimensions. And the risk identification ability of new customers has been improved by 20%. The series of marketing models based on federal learning and the joint modeling has improved the marketing conversion of new and existing customers by more than 35%.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nI will [Inaudible] a little bit on the business acquisition surrounded by our three main business. The Double 11 e-commerce festival has just passed and our singular platform delivered an encouraging performance. From October 24 to November 12, total GMV increased by 97% year over year, and the number of transactions and users increased by 94% and 70%, respectively, benefiting from the consumption scenarios of the singular platform, our installment consumption scenarios led by Lehua card reached 15% increase year over year in transaction volume and ARPU of transaction users increased by 30% year over year, leveraging the advantages of consumption scenarios and focusing on high-quality customer operations. Our new consumption-driven local-based service business has continued to grow this year.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nLooking now in consumption scenarios and the core capabilities of data analysis and technology keep its progress of integrating with the business, which forms a circular enhancement task, our high-frequency consumption-driven local-based business, put Lehua at advantage of having opportunities to generate more high-quality customers for credit-driven business. Accumulated technology and risk management experience and capabilities of credit-driven business allow us to further provide services to our financial institutions and merchants, as well as promote synergetic development of our technology-driven platform business. The synergetic development makes Lexin connected with more funding pools and scenarios of virtuous circle first formed. Lexin's unique business ecosystem with three diversified revenue drivers allow us to more robustically respond to the complex and changing external environment.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nLet me spend a few minutes to update you about Lexin's corporate social responsibility, our CSR initiatives. In the second quarter, we launched a specific program called [Foreign language] to help SMEs to deal with their cash liquidity challenges and the program continues. The total amount of small and micro loans was RMB 5.4 billion in the third quarter. For SMEs, more affected by the pandemic resurgence, we took several measures to help them tide over the difficulties.\n\nIn addition, we also upgraded our customer protection initiatives in the fourth quarter by launching the 5S Guardian system, which makes full use of the AI technology to strengthen data security, anti-fraud protection safeguard, conduct standards, intelligence customer service and the strike for combating financial blackmail. All of the 5Ss together allows us to build a comprehensive security firewall for customers.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nLooking into the future, we will stay positive with an optimistic attitude to pursue continued sustainable quality development. We will do our bit to aid offline stores or even real business development with our advanced fintech technologies, while providing support to young people and SMEs. We will continue to strengthen the company's underlying capabilities, optimize our customer segmentation operation strategy and improve profitability by reducing the cost while increasing efficiency, thus making us and better prepared for any future challenges and uncertainties. The current momentum can be maintained in the fourth quarter and our loan origination is expected to be in line with the volume of this quarter.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nLet me now hand over the call to our CFO for financial updates. Thank you.\n\nSunny Sun -- Chief Financial Officer\n\nThank you, Jay. Good morning and good evening, everyone. It is my pleasure speaking to you again. I'm excited to report that despite external uncertainties, our third quarter performance continued with a positive and upward trends guided by our principle of pursuing sustainable and quality growth.\n\nWe continue to build up a diversified revenue structure, advanced risk identification capabilities and operational efficiencies. Our never-ending efforts on technology innovation and digital transformation also contributed to the achievement of Q3's performance. Now, let me go through some key financial and operational metrics with you. Total loan origination in the third quarter was RMB 56.2 billion, representing a 14.4% growth quarter over quarter.\n\nThe outstanding loan balance stood at RMB 94.6 billion, delivering a 9.2% increase compared with last quarter. If we look at the results at the end of fiscal year 2021, our outstanding loan balance as of Q3 already increased by 10.1%, demonstrating the ongoing resilience of our business. We are delighted to see that the positive momentum of both our loan originations and outstanding loan balance has continued for two consecutive quarters. And based on current information, it is on course for the rest of the year.\n\nWhile driving a solid growth continuity, we keep an close eye on potential fluctuations externally such as COVID resurgence-related economic impact and are confident to make the corresponding adjustments if needed. At the current point of time, the management believes quality over quantity is the right approach to sustain a healthy status of our business. Total operating revenue was RMB 2.7 billion, achieving an 11.5% increase quarter over quarter. Revenue from new consumption-driven location-based services was RMB 525 million, an increase of 31.3% from the same period of last year, a modest decrease of 2.5% quarter over quarter.\n\nIt is worth noting that the June 18, [Foreign language] online shopping festival made meaningful contribution to the Q3 revenue. Revenue from technology-driven platform services was RMB 500 million, representing a 14.6% increase quarter over quarter. Revenue from credit-driven platform services was RMB 1.7 billion, delivering a 15.8% increase quarter over quarter. I'd like to take the opportunity to emphasize again that we have reorganized our revenue segmentation since Q1 this year, which we believe better reflects the diversity and resilience of our revenue and the nature of our business.\n\nOnce again, the contribution from noncredit driven services was about 40% of the total revenue this quarter and has reached RMB 1 billion, achieving a 5.1% increase quarter over quarter. This is in line with our strategic goal of realizing high quality and complementary revenue structure, which enables us to better overcome future external challenges in the long run. In line with government guidance, loan pricing in Q3 continued to fall and moved closer to 24%. The mix within 24% APR was above 80%, like the last quarter.\n\nLet me move on to the expense side of the third quarter. Sales and marketing expenses decreased by 11.1% quarter over quarter and by 13.5% year over year to RMB 425 million. This is as intended by the management to maintain a prudent overall spending in view of the uncertain trading conditions. However, we are reaching our customers more precisely through various online and offline channels, thanks to our digitalized and data-driven marketing programs.\n\nResearch and development expenses increased by 7.3% year over year to RMB 141 million, reflecting our continuous investment in upgrading our technology capabilities. G&A expenses went down by 7.7% quarter over quarter to RMB 104 million. While the loan origination and top line revenue capped their upward trend this year, our G&A expenses remained stable and decreased on a Q-on-Q basis for two quarters. I'm particularly happy to note that the net profit of Q3 was RMB 276 million, achieving a 64.4% significant increase quarter over quarter.\n\nIt is encouraging to see that our profitability has continued its strong recovery trend on a Q-on-Q basis. While our major risk indicators remained stable, we expect net profit to be further improved in Q4 based on the current external conditions. On March 16, 2022, the company's board of directors authorized a USD 50 million share repurchase program. As of Q3, the company has repurchased approximately 20 million ADS for approximately USD 44 million under this program.\n\nThe board has also authorized a new USD 20 million repurchase program. However, prioritizing and concentrating resources on strategic and meaningful performance-related initiative will be our guiding principle. We will continue to pursue a sustainable and resilient business approach and we'll also keep ourselves in the know of any material signs of external changes that may impact our business. We are very confident that we are well positioned to react quickly and responsibly.\n\nWith that, I will turn the call over to our president, Jared Wu, who is overseeing the risk department. Jared, please?\n\nJared Wu -- President\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nThank you, Sunny. Good morning, and good evening, everyone. It is a great pleasure to speak to you all -- to all of you today.\n\nJared Wu -- President\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nNow, let me elaborate on the risk management performance of our business. Last quarter resulted to be a quarter of improvement amid macro environment uncertainties and the residual impact of sporadic COVID resurgence. We are witnessing a continued lowered day one delinquency rate as of the end of September. And our 30-plus day delivery was at 4.61% this quarter, representing a decrease of 0.24 percentage points from the last quarter.\n\nAs for our 90-plus day delinquency, it held relatively steady at 2.66% this quarter, which fell into our prediction at up three basis points. And we expect the impact from second quarter's COVID restrictions has been fitted out and our 90-plus day delinquency has peaked in the third quarter. Should no interruptions caused by external force majeure happen, we are prudently optimistic to state that our delinquency metrics are to go on a stable downward trend to reach a more balanced level and our overall risk level to continue to fill in a more favorable direction.\n\nJared Wu -- President\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nIn the last quarter, further serving high-quality uses and boosting the contribution of our high-quality users was one of our priorities. Surrounding such, we expanded the depth and the breadth of the use of more high-quality data resources and boast on strengthening the exploration and application of credit reports from the PBOC, as well as further upgrading the refinement models for different user segments. These measures helped us identify high-quality users more accurately and match them with lower interest rates. So, our APR has continued to decline, promoting a significant increase in the customer unit price of high-quality users.\n\nJared Wu -- President\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nIn the last quarter, the melting point resurgence of the pandemic has in fact, impacted our risk management front. And we can see that the risk of assets in high-risk cities rose to some degree. But everything last year, we started to build a risk monitoring and targeted strategy adjustment mechanism for pandemic areas. And this system has matured to the point that we are now able to quickly adjust our pre-lending, mid-lending and post-lending strategies according to the situation in each pandemic area, which is one of the important measures for us to continue to improve our risk performance in this quarter.\n\nJared Wu -- President\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nAs we continue to devote resources to our risk management section of refined risk management capabilities advanced rapidly. For the past two quarters, on one hand, we actively brought in several risk management talents in the industry. On the other hand, we have been accelerating the relative upgrade of various models of risk management and have been increasing the investment in data resources and models, which have had a timely effect on refining the identification of our user risk. We have made good progress in all aspects, respectively, from customer acquisition to asset management from credit line granting to pricing and the corresponding initiatives in the aforementioned have demonstrated effectively in their early stage results in this quarter.\n\nGoing forward, we will keep on working on supplementing these initiatives to further enhance our risk management capabilities and continue to improve our asset mix and risk performance. Thank you. This concludes our prepared remarks. Operator, we are now ready to take questions.\n\nOperator\n\nThank you. Ladies and gentlemen, we will now begin the question-and-answer session. [Operator instructions] Our first question comes from the line of Hans Fan from CLSA. Please ask your question.\n\nHans Fan -- CLSA -- Analyst\n\n[Foreign language] I've got two questions. First of all, this is Hans from CLSA. Congrats to the improvement in the results on a quarterly basis. I got two questions.\n\nOne is on regulation, another one is on APR. So can you give us some updates regarding the rectification process, especially the decoupling of data feeds to the banks? Especially that over the recent days and weeks, we have noticed some signs of pivots in China fintech regulation. So, just wondering what's our progress there. Number two is about the APR.\n\nThe APR of our company has been coming down in the past few quarters based on regulatory requirements and also our adjustment of the customer base. So, just wondering what's the outlook for the APR? And also what's the exact APR in the third quarter? That's my question. Thank you very much.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nLet me take the question. The first one about the regulations. As you know, we are not in the first bench of the name list. So currently, there is no specific requirements to our company yet.\n\nBut however, we are closely working the situations. And we want to get the ideas of what is the specific requirements to the first bench of name list. Meanwhile, we are maintaining very close communications with [Inaudible] these two vendors in the industry, and we are very aware of the solutions of these two companies. And currently, we are already about all the plans as long as the requirements from the authorities can be clear and the current conducted plans have been approved, we can take very quick initiatives to be connected as well.\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nIn this quarter, our APR is very close to 24%, 24.3%, only a little bit above 24%. And the pricing, which is above 24 percentage is very, very limited. And going forward, we'll continue to further decreasing our APR. And we believe, together with the increased percentage of our high-quality customers and the increase of our asset qualities, our pricing will continue to be decreased.\n\nFrom other perspective, we believe the higher quality customers, the better quality of the asset management is actually in line with the further decreasing of our APR. Only with a better APR, we have attracted a higher quality of the customers.\n\nHans Fan -- CLSA -- Analyst\n\n[Foreign language] Thank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Frank from Credit Suisse. Please ask your question, Frank.\n\nFrank Su -- Credit Suisse -- Analyst\n\n[Foreign language] This is Frank from Credit Suisse. Thank you management for giving me the opportunities to ask questions. I've got two questions. The first one is on credit quality.\n\nWe see that in this quarter, 90-day kept flattish quarter-on-quarter, 30 days started to fall already, and the company suggested it's likely to improve going forward. If the credit quality continues to improve, should we see some sizable write-backs on the provision expenses in the next few quarters? And the second question is on funding costs. This quarter, funding costs improved by 20 basis points. What is the main driver behind this? And also recently, we have seen some marginal tightening in the monetary market.\n\nDo we expect further optimization on the funding cost in the fourth quarter? Thank you.\n\nSunny Sun -- Chief Financial Officer\n\n[Foreign language] I will translate myself for the English-speaking audience. For the first question, we are also very happy to see that our asset quality remained stable and is going an upward trend. However, we will probably not in a position to say that there will be significant reduction in provision due to the uncertainties of the external environment, particularly the COVID resurgence-related economic impact. Of course, we do see the possibility of such a reduction of the provisions.\n\nBut at the moment, we think that it will remain stable. We will closely -- we will keep a close eye on the conditions in the market. So at this moment, I think there are uncertainties. And the second question regarding the drivers of the cost of funding.\n\nWe are also happy to say that we have a 20% basis point reduction for the last quarter. And this is, of course, due to the favorable policies adopted by government on one hand and also thanks to the years of relationship that we have built up with our partners and we are having close cooperation. So I guess this is a result of both drivers.\n\nOperator\n\nThank you. Our next question comes from the line of Alex Ye from UBS. Please ask your question, Alex.\n\nAlex Ye -- UBS -- Analyst\n\n[Foreign language] So I will translate for my question. The first one is on our customer mix migration. So, I've noticed that our per customer loan volume, the ticket size has increased sizably Q-on-Q. So, I would presume that was largely driven by our customer mix upgrade.\n\nBut I just want to get more color on for example, what was percentage of our -- the high-quality customers per our definition and how does this change Q-on-Q? And what's the outlook from here? And second question is on the take rate. So, given our ongoing customer mix upgrades, so how has been the impact to our take rate. So specifically, I want to know more about the take rate for this quarter on the new volume perspective? And how does it compare to our total -- the take rate from our total portfolio? And could we say that we have probably seen our take rate bottom from here?\n\nJay Xiao -- Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations Director\n\nTalking about the premium or high-quality customers, we divided our customers into different dimensions from the risk level. And currently, internally, we're mainly focusing on level one to three as our major targeted high-quality customers. We are -- from three dimensions. First of all, we further understand the good performance customers who attracted back our original existing customers.\n\nAnd in the future, together with further provide better services and better -- and based on the better understanding of our current high-quality customers, we are also taking the assets to further limit the high-risk customers. Internally, we define them as the risk level from six to eight. So together with all these assets, we believe our overall risk management structures or asset structures will be continue to be optimized. Talking about the take rate, together with the further optimization of our risk management and asset structures, we believe our take rate will be also on up trend in the future.\n\nAnd at the beginning of this year, we have the overall view of our take rate level for the whole year, which is 3%. Currently, this whole year view is not changed.\n\nOperator\n\nGreat. Thank you. [Operator instructions] There are no further questions. I would like to turn the call back to the management team for closing remarks.\n\nEcho Yan -- Investor Relations Director\n\nThank you all again, everyone, for joining us today. If you have further questions, please contact us where our contact information available on our IR website. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEcho Yan -- Investor Relations Director\n\nJay Xiao -- Chief Executive Officer\n\nSunny Sun -- Chief Financial Officer\n\nJared Wu -- President\n\nHans Fan -- CLSA -- Analyst\n\nFrank Su -- Credit Suisse -- Analyst\n\nAlex Ye -- UBS -- Analyst\n\nMore LX analysis\n\nAll earnings call transcripts"
}