{
  "companyName": "Regis",
  "companyTicker": "RGS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/regis-rgs-q4-2022-earnings-call-transcript/",
  "content": "Regis (RGS 4.27%)\nQ4 2022 Earnings Call\nAug 23, 2022, 10:00 a.m. ET\n\nBiz McShane\n\nGood morning, and thank you for joining the Regis fourth quarter 2022 earnings release conference call. [Operator instructions] The prepared remarks by our president and chief executive officer, Matthew Doctor, and executive vice president and chief financial officer, Kersten Zupfer, are accompanied by slides to help participants follow along. [Operator instructions] Also joining Matt and Kersten on this call is Jim Lain, our chief operations officer. I'm your host, Biz McShane, vice president and corporate controller.\n\nAs a reminder, this conference is being recorded. I would like to remind everyone that the language on forward-looking statements included in our earnings release and 8-K filing also apply to our comments made on the call today. These documents, along with our presentation today can be found on our website, www.regiscorp.com/investorrelations, along with the reconciliation of any non-GAAP financial measures mentioned on today's call with our corresponding GAAP measures. Today's slides are located in the Supplemental Financial section of the Investor site.\n\nWith that, I will now turn the call over to Matt.\n\nMatt Doctor -- Chief Executive Officer\n\nThanks, Biz, and good morning, everyone. First off, I want to thank you all for listening in and your interest in Regis. This is a call I was very much looking forward to because there's been a lot going on in our business with some major announcements coming out from us over the last few months. Announcements that I'm very proud of and excited to bring forward.\n\nThe goal of today's call is to fill you in on the details of those major items, go through the results for the quarter and the fiscal year and further discuss the key initiatives we are focused on for fiscal 2023. As I reflect on fiscal '22, there are some key themes that come to mind. Those themes are: one, the right team; two, business transformation; three, progress; and four, momentum. In terms of the team, there have been several changes that took place over the last year.\n\nI mean starting with me, I came into my role as CEO in the middle of our fiscal year. Our chairman, Dave Grissen, will not new to the board, stepped into his role as chairman in November 2021. And alongside of us is a great mix of tenured members like our chief financial officer, Kersten; our chief operations officer, Jim; and our head of education and merchandising, Jamie, who has been elevated to the leadership team due to his connection with a stylist community, which is so key in this industry; as well as our new hires, including our chief technology officer, John; who has recently been appointed as our chief digital officer; our chief people officer, Michael; general counsel, Andre; and brand new as of a day ago, head of marketing, Michelle. I say all of this is I want you to know we have a new leadership team that represents the right mix of tenure, skill sets, passion, and dedication to continue driving the turnaround of Regis.\n\nThis is a group that fights for this company, is solution-oriented and forward-thinking. This is the right team at the right time, and I am proud that we have been able to band together during times of major change and challenges. And I look forward to continuing on this journey with them, and I'm grateful to have them as teammates. Regarding business transformation.\n\nOn my very first conference call, I outlined three of our top priorities relating to refinancing our debt, providing the right technology solution to our franchisees and continuing the wind-down of our legacy businesses. On this call today, I can say with confidence that we have successfully delivered on those three priorities. Over the last several months, our efforts have culminated in the successful renegotiation of our credit agreement, the sale of our proprietary point-of-sale software, Opensalon Pro to Zenoti, the exit of our product distribution business and the further runoff of our company-owned salons. By delivering against these 3, we have put reaches on solid financial footing, and we can now focus 100% of our efforts on our core business of being a hair care franchisor.\n\nGoing a bit deeper into each one of these. Addressing our capital structure has been an area that a great deal of time and effort is in place, and we are very pleased with the outcome here. By working with our lender group to amend and extend our credit agreement. Our renegotiated deal represents what we believe to be the best outcome from an overall term, liquidity, and cost of capital perspective.\n\nIn addition to avoiding further shareholder dilution, all of this with the backdrop of a challenging credit environment. By converting our existing debt to a term loan, extending our maturity by a meaningful two and a half years through August 2025 from the original maturity date of March 2023, securing a $55 million revolver and lowering our minimum liquidity requirements. We have the runway and capital required to continue the turnaround of our business and can now fully focus on the underlying fundamentals. I want to thank our lender group once again for working with us and believing in this team and our plans as well as our advisors at Jefferies and Wilde for their hard work throughout this process and helping us navigate the proper solution.\n\nAs I mentioned, this was a long time in the making and perhaps the item we received the most questions on but could say the least about. And while I understand the frustration at the time, this was always a top priority, and we are proud to deliver this result. Regarding the sale of Opensalon Pro or OSP, as we referred to it, and I chose my words very carefully since I became CEO regarding OSP. And it was for this exact reason.\n\nI want to spend some time going deeper into why we made the decision to sell and what the benefits are for our franchisees and for Regis. Selling OSP started with a simple question. What business are we in? We took a hard look in the mirror, and we had to choose whether we're a hair care franchisor or a technology company, we cannot be both. It's hard enough being a tech company when that is your sole focus.\n\nIt is doubly hard when your primary business is a franchisor of salon brands. OSP is, quite frankly, was more of a distraction than an enabler. Too much of our conversation with franchisees were taken up by OSP, taking away from time that we should be really be spending about talking with our franchisees, which is hair care. We do not get the credit for simply providing a technology platform for our franchisees businesses.\n\nWe needed to drive it. Franchisees needed a proper solution to drive their business and they need it now. To put it bluntly, we had some functionality gaps with OSP. And given there was a better platform in the market already with Zenoti, no longer made sense for us to continue to invest money in a technology business, we can provide our franchisees a better solution overnight.\n\nBy partnering with Zenoti, we accomplished many things. First and foremost, getting a best-in-class technology platform to our franchisees in a timely fashion, and becoming the right catalyst for our digital initiatives and engagement with our salons. Not only that, but they receive a more robust platform at the equivalent monthly fee to OSP, in addition to minimal to no switching costs. Another benefit as the sale provides Regis with a return on its investment in OSP and cash to delever.\n\nInitial proceeds went to pay down our credit facility. With subsequent payments coming in overtime as salons migrate that will go toward paying down our term loan as well. You'll notice some one-time noncash accounting adjustments hitting our P&L due to some nuances around the sale, which Kersten will go into. But the punchline is this was a great financial deal in addition to a strategic one as well.\n\nAnd perhaps the most exciting thing for me as we look forward, this allows Regis and our franchisees to be the beneficiaries of the full focus on the core business as well as the best of both worlds when it comes to technology. While we're exiting the point-of-sale business and leaving that up to the experts. Going forward, Regis will continue to retain a small technology footprint with engineers dedicated strictly to developing value-added features on top of the Zenoti platform to further enhance the salon experience and marketing efforts as well as drive competitive differentiation with our own in-house capabilities. While we were not necessarily in a position to build the full technology platform required to run our franchisees businesses.\n\nWe have always been in a great position to identify how technology can properly drive our salons. And in the Zenoti landscape, we can do just that. And lastly, on the business transformation front, we have essentially completed the liquidation of our excess product inventory, and we ended the year with 105 corporate-owned salons versus the 276 at the start of the year. Combined, these businesses contributed an EBITDA loss of $12.4 million in fiscal year '22 compared to a loss of $46.6 million in fiscal 2021, a significant improvement of $34 million and we expect further improvement as we move into fiscal year 2023.\n\nOn the theme of progress, I view this through the lens of both our financial results in connection with the franchisee community. Turning to the results for the quarter and fiscal '22. We continue to see positive trends in our profitability. Same-store sales came in at 7.1% in Q4 versus the prior year's quarter and 14.8% for the full year versus fiscal '21.\n\nOur fourth quarter adjusted EBITDA, excluding the effects of salon sales came in at $1.1 million versus a loss of $14.5 million in Q4 2021. This represents the second time in three quarters, we generated positive consolidated EBITDA. Our Franchise segment EBITDA for the fourth quarter was $2.5 million, representing the third quarter in a row of positive franchise EBITDA. Further adjusting these figures for one-time items in our legacy businesses, our Q4 results represent our strongest results both in terms of EBITDA and cash use not only for our fiscal year, but also since Q3 of 2020.\n\nWe ended the year with positive adjusted EBITDA, excluding the effects of salon sales of $0.5 million versus a loss of $60.2 million in fiscal 2021. To get back to above breakeven EBITDA after a year of significant losses is a major milestone for us to build on as we look forward. I want to point out in my earlier comments of winding down our legacy businesses that our fiscal year 2022 results included an EBITDA loss of $12.4 million from our product business and our company-owned salons, which continue to be winding down. We expect that loss for our product business and company-owned salons in fiscal year 2023 to be roughly half of the losses we saw in fiscal '22.\n\nAnd with substantially the entire company-owned portfolio ran off by the end of fiscal '24. As we look ahead to fiscal 2023, barring any unforeseen shifts in the world around us and in our business, we believe we are in a position to consistently deliver positive EBITDA results going forward, as Regis is in the strongest position it has been in for quite some time. Now I began this call talking about having the right team in place, and I strongly believe these results demonstrate this team's ability to prioritize and execute. And while I am no doubt proud and want to recognize our achievements and progress, I also want to be fair and balanced about the challenges that remain in our business.\n\nTo us, this represents just the beginning. I recognize that the last few years have been challenging for the stakeholders in our business that is not lost on me. But just as we have delivered on the top three priorities we laid out months ago. I am confident we will do the same in our next set of priorities that are intended to address head-on the challenges we continue to face in our business.\n\nStylist retention, recruiting, customer traffic, and technology. I've spoken about these items in the past, and they remain the same given that they are the critical elements to drive our business to the next level. We need more styles and customers, full stop. I mentioned earlier the notion of progress coming in the form of building trust and connection with our franchise community.\n\nWhile we certainly have a ways to go, and there's room for improvement. We believe at a high level, we're on the right track. And the manifestation of these stronger connections we've been building with our franchisees through our go-forward strategic initiatives. They are a direct result of what we've heard during our in-person regional meetings as well as our ongoing discussions with franchisees.\n\nThis is why we have such conviction around each of these, as I not only comprise the views of the leadership team, but also the voice of the franchise community. In terms of the timeline on how these came to be, I would characterize these initiatives as being conceptual, the first time we spoke back on our call in February. On our May call, I detailed a greater level of focus given the listening we did between February and May. Today, our plans and tactics are set and actions are starting to take place.\n\nBy the end of the calendar year, I expect us to be full steam ahead. And it should be noted from an execution standpoint, that every single member in our entire company will be sharing the same overarching company goals versus cascading various versions of individual KPIs. This is to ensure full alignment of our individual and collective efforts in fiscal 2023, which brings me to momentum for the future, specifically in driving further sales and EBITDA. To us, nothing is more important right now than moving the needle on stylist recruitment and retention, driving customer traffic and ensuring we have the right tech platform rolled out, as these initiatives are geared toward driving sales and profitability for our franchisees, which, in turn, drives sales and EBITDA for Regis.\n\nOn the stylist recruitment and retention front, I don't want to give away too much in detail here what we have planned, as I think this is a major, major source of competitive differentiation. At a high level, we are substantially increasing our investment into education with the goal of building the largest, best-in-class education platform in the industry and ultimately forming a large foundational element of the why stylist should work for our brands. This is something that we know matters to stylists and something that we can offer at a scale that if done right, will be difficult to match. And we have programs in place to ensure that this will be felt at every single level at our salons.\n\nFrom a franchise owner perspective, we're ensuring that each owner has access to specialized trainers whether they be corporate employees or franchisee team members who became certified educators to help our franchisees with the cost burden of employing these trainers and getting them into salons, we are rolling out programs to help offset these costs to our franchisees. With an increased number of field-based trainers in place, we will be ensuring those trainers receive even more personalized attention and live education opportunities to be able to execute seasonal trends or any other technical aspect they feel requires attention. Those trainers will now be going into our salons multiple times per year in a structured manner to provide further in-person touch points to our stylists, ensuring consistency and raising the collective skill sets. I really want to emphasize this point as this is a departure from the past few years where in-salon visits have been limited and a shift has been made to digital.\n\nWe recognize in this industry, while digital is a great complementary tool that cannot replace hands-on training. We will also be recognizing and awarding these trainers as well as our top managers and stylists through all expenses paid trips with the first one taking place in Las Vegas in October, followed by another in January of 2023, with ongoing events to be scheduled thereafter at a regular cadence. The goal of these trips is to ensure our brands retain our top talent, create excitement in the system and provide opportunities to gather, learn, share best practices and cultivate a sense of belonging in community beyond the four walls of their individual salons. We have a large brands.\n\nWe want to ensure that our trainers, managers, stylists all feel they are part of something larger with the support network that we are building on. It's one thing to launch and establish these programs, it's another to ensure that the right audience knows about. In addition to the investment we're making in education, we are placing an importance on bringing our talent brand to life and to reach new stylists through recruitment marketing. In addition to our collective internal focus, we have established agency partnerships to concentrate exclusively on generating the right campaigns, collateral assets and toolkits for us and our franchisees to use in beauty schools, social media and salons to get the right messaging out and a relevant authentic manner as this is something that should be widely publicized and celebrated.\n\nThere are many more elements and details that go beyond what I just stated. But the overall goal of all of this is to increase the average total stylist hours of work per day per salon. And if we're successful in our goals of retaining our existing stylists and hiring new stylists, we should see a requisite increase in hours worked and in turn, drive meaningful, profitable sales for both our franchise owners and for Regis, leading to further EBITDA growth. Shifting gears to our marketing efforts.\n\nOne piece of this that I mentioned was a focus on recruitment marketing to drive our talent brand and attract stylists. The other is driving customer traffic. We announced yesterday the hiring of our new marketing head, Michelle DeVore, and we could not be more excited that Michelle is joining our team. Her background in digital marketing, retention and loyalty is exactly the focus that we need for short- to medium-term tactics to drive traffic as well as laying the foundation for broader life cycle marketing, CRM and loyalty efforts.\n\nMichelle's knowledge of the beauty industry, combined with her experience with franchisees in the Zenoti platform from her days at European Wax Center bring the right combination of skills at the right time for Regis. And while Michelle have no doubt, I'll be shaping the direction of our marketing function over the coming months, changes have already started. I mentioned on our last call that our approach to marketing is shifting, and we have engaged a specific agency partner to aid in this transition. Historically, our ad funds have either been, one, used in a dispersed manner, and/or two, heavily weighted toward expensive top-of-funnel awareness.\n\nCurrently, our brands have awareness, but we need us to drive decisions. We are in the process of shifting our ad fund dollars to more middle and bottom funnel performance marketing, things like paid search, promotions and loyalty programs and increased advertising for local spending. We are looking forward to enriching our CRM data to better segment and target our audiences and determine the right cadence and campaigns to improve their retention. We will be enhancing and increasing our social media content and presence to meet the stylists and customers where they are.\n\nThese efforts will not only optimize our dollars for the greatest return on investment, but will also provide us more real-time visibility into what is working versus what isn't and that will enable us to quickly flex our dollars accordingly. The shift has already started, but we are in the early stages and expect a more wholesale sales shift over the coming months. And the goal and combination of these efforts should be moving the needle on existing and new customer retention and, in turn, increase customer traffic and sales, once again calling ultimately in EBITDA growth. More to come on this in the months ahead.\n\nAnd turning to our last companywide goal, the transition to Zenoti. Since we closed the OSP sales at Zenoti at the end of June, our collective teams have been working closely together to get this platform readjust rollout ready. There are several work streams to ensure the transition goes as smoothly as possible and is a massive undertaking for both companies. The majority of this work is getting the product and functionality to be readjust ready as there are some nuances of our brands, and we want to ensure that the functionality our franchisees are used to are not lost in transition, in addition to all the added features the Zenoti platform brings.\n\nAnd I am pleased today to announce that this work has already bearing fruit. And that yesterday morning, our Roosters brand was successfully migrated and is now running on Zenoti. There are pilot tests underway for our other brands, and we expect the next waves of salon to migrate in mid-September. And while we will not sacrifice quality for speed, our plan is to transition the roughly 3,000 salons from the legacy Pro Point system by the end of the calendar year with OSP locations migrating in calendar Q1 2023 or our fiscal Q3.\n\nHaving all the locations on the right singular point-of-sale system is a catalyst to our digital marketing initiatives. So we are very eager to having our salons transition over in a timely and orderly manner. Tying this back to how this drives our results. As more salons transitioned over to Zenoti, we will receive migration payments that will go toward further debt paydown.\n\nIn addition to the positive impact we expect to see on sales given the robust nature of the platform that will help drive further customer and stylist engagement. As with the other two companywide goals, more to come on this one in the coming months as well. Now I know that was a lot, but there was a lot to update on. And I want to reiterate that I am proud on what we have been able to achieve in a short period of time.\n\nAnd I am also aware of the current challenges we face and where we need to dedicate our energy. Quite frankly, a lot of our time has been spent ensuring that we have the proper time to continue to move our business forward. Now that we have that, we can dedicate 100% of our focus to a targeted set of companywide goals that will have -- that we all have such strong conviction around. Execution on these goals will move the needle.\n\nAnd I have the utmost confidence in our team to be able to deliver just as we have since the beginning of the year. Regis is in a strong position as we have been in quite some time, and we look forward to delivering strong EBITDA growth in our fiscal 2023. I will now turn the call over to Kersten to provide more detail on our Q4 and full year results. Kersten?\n\nKersten Zupfer -- Executive Vice President and Chief Financial Officer\n\nThanks, Matt, and good morning. Yesterday, we reported on a consolidated basis improved fourth quarter revenues compared to the prior quarter, which was driven by an increase in royalties. Year-over-year total revenue of $66 million, declined $32 million from the prior year as we expected due to 98% of our salons now being franchised compared to 95% in the prior year. The revenue decline also reflected the transition away from our product distribution business.\n\nThese businesses caused revenue to decline $34 million, offset by $2 million of improved royalty and advertising revenue. Same-store sales growth was 7% in the quarter compared to the fourth quarter of 2021. On an adjusted basis, fourth quarter adjusted EBITDA was $1 million compared to a loss of $23 million in the prior year's quarter. We delivered positive adjusted EBITDA in the quarter despite incurring $2 million of losses associated with our 105 remaining company-owned salons.\n\nThe improvement in adjusted EBITDA is a result of higher systemwide sales and our lower G&A structure. On a full year basis, adjusted EBITDA improved $75 million to an annual loss of $2 million from a loss of $77 million in fiscal 2021. Excluding the loss associated with selling our salons to franchisees, we recorded positive adjusted EBITDA in fiscal '22 of $1 million versus a loss of $60 million on a comparable basis. Our core franchise business posted adjusted EBITDA of $3 million in the quarter, a $12 million improvement compared to a loss of $9 million in the prior year quarter.\n\nThis is the third consecutive quarter that our core business has been profitable. This improvement is driven primarily by higher systemwide sales and the rightsizing of our G&A structure over the past year. The company-owned segment recorded an adjusted EBITDA loss of approximately $2 million in the quarter, which is a $12 million improvement from the same period last year. The improvement is primarily related to having fewer company-owned salons in the current period.\n\nWe expect losses associated with the company-owned segment to continue to decrease as we reduce the number of remaining salons through closures or lease file. We reported an operating loss from continuing operations of $1 million in the fourth quarter, which includes a loss on franchise product sales of approximately $1 million. The transition away from product distribution is nearly complete, and we do not expect to incur significant losses going forward. Additionally, the company-owned segment with 105 salons remaining reported operating losses of approximately $3 million.\n\nAs leases end and terminate early, we expect to mitigate these losses going forward. Our adjusted G&A for the quarter was $14 million, which is an $8 million improvement year over year. While we saw the same level of G&A in the third quarter, we do expect G&A to increase marginally in fiscal year 2023 as we invest in the revenue-generating activities that Matt mentioned. We have stated previously that we believe our run rate G&A will be in the range of $65 million to $70 million.\n\nBased on our strategic plans for this year and the removal of G&A associated with the OSP platform, we believe our run rate G&A will be slightly lower in the range of $60 million to $63 million annually. In discontinued operations, we reported a loss of $39 million, driven by a noncash goodwill derecognition of $38 million and asset write-offs of $10 million, offset by $13 million of cash proceeds received. The remaining purchase price of our OSP platform of up to $26 million will be recorded as a gain in discontinued operations when the cash is received, which we expect the majority to be received in fiscal year 2023. In fiscal year 2023, as the additional proceeds are received, we expect to recognize a gain in discontinued operations and further pay down our debt.\n\nThe cash consideration of up to $39 million from Zenoti represents a significant return on the investment made in the OSP platform. Turning to cash flows. In the fourth quarter, we used $4 million of cash from operations. which is an improvement of $6 million compared to our cash use in the third quarter and a $16 million improvement from the fourth quarter of 2021.\n\nAdjusting for onetime items, including approximately $4 million of fees paid in connection with our debt amendment, offset by $3 million of cash from product sales, our cash use was approximately $3 million in the quarter. Cash flows from operations improved each quarter in fiscal year 2022. While we expect the first quarter of fiscal year 2023 to be a higher cash use quarter due to fees associated with the credit agreement amendment and annual bonus payments. After the first quarter, we expect continued improvement in cash used in operations.\n\nWe used $5 million in fiscal year '22 related to capital expenditures. Going forward, we expect to use significantly less cash related to capex as we will no longer be investing in OSP. As we announced last week and as Matt mentioned earlier, I am pleased with the outcome of our refinancing efforts. We have amended our credit facility and extended the maturity date from March 23, 2023 to August 31, 2025.\n\nUnder the amendment, the revolving credit facility was converted to a $180 million term loan and a $50 million revolving credit facility with a minimum liquidity covenant reduced to $10 million from $75 million. Under the terms of the amendment, we currently have total liquidity of approximately $56 million. The amended credit agreement includes typical provisions and financial covenants, including minimum EBITDA leverage and fixed charge coverage ratio covenants. The latter two of which are not tested until December 31, 2023.\n\nWe believe the amendment provides us with adequate runway and liquidity to invest in the strategic priorities discussed earlier in the call. This concludes my prepared remarks. I'd like to turn the call back to Biz who'll lead us through Q&A, and thank you all for your continued support and interest in Regis.\n\nBiz McShane\n\n[Operator instructions] Our first question is from Stephanie Wissink with Jefferies.\n\nSteph Wissink -- Jefferies -- Analyst\n\nGood morning, everyone. We have a few questions. The first is, maybe this is for you, Kersten, it's just to talk a little bit about the 7% comp in the period, any sense of volume versus value? Just thinking about the price increases that you've taken over the last year or so?\n\nMatt Doctor -- Chief Executive Officer\n\nYes. Steph, it's Matt. I can take that one. Yes.\n\nSo a number of it is driven by price increases, and that's actually -- we didn't talk about this on the call as we kind of outlined the three much higher level of strategic priorities that drive the underlying fundamentals of the business. As I think about kind of some near-term levers and tactics to drive sales as we -- in the first half of, call it, this year, probably we'll continue to lean a bit on price, just given what's going on in the industry and the world around us. So that will continue to take hold. And probably would expect the investments that we're making in education and the investments were -- and shift of dollars that we're talking about from a marketing perspective, that will end up being the traffic-driving catalysts that, as I mentioned, action starting now, probably come into play and probably have a major shift in those dollars.\n\nOur education efforts will be fully launched toward the end of the year and kind of think about it, price will kind of hold us as we move through the next couple of months with traffic starting to come through our initiatives thereafter. So we'll probably have a good mix of both price and traffic heading into the back half of this year.\n\nSteph Wissink -- Jefferies -- Analyst\n\nOK. That's helpful. And Matt, can we just spend a little bit more time on the different monikers, the different business segments, any delta or performance difference between SmartStyle and the other business lines? Just maybe talk a little bit about by moniker, by brand?\n\nMatt Doctor -- Chief Executive Officer\n\nYes. No. As we mentioned previously, and it's in our release, I mean, SmartStyle from an overall sales perspective and traffic perspective is lagging behind the other ones a little bit, but kind of more close to each other from an overall comp perspective and traffic perspective. The one thing that we didn't talk about is probably a good piece to touch on here is actually kind of made some really good headway regarding the SmartStyle brand.\n\nWe got a number of initiatives going on there regarding a large-scale reimaging program, which will be a big deal kind of from a marketing perspective, in and of itself when you think about the captive nature thereby having a large-scale remodel, bringing that image up to [Inaudible] and presence will probably go a really long way. So that's a big piece. Another one is kind of the captive nature. We've been talking a lot to Walmart to get more ingrained in their digital ecosystem.\n\nAnd we're actually, for the first time doing just that. We've made some really awesome inroads. We had some great marketing programs we're going to be launching in-store. Examples of that will be on their TV walls, which basically are huge ad banners as part of the store, we're going to run video loops that will just raise awareness and show that SmartStyle is there.\n\nFirst time in a long time that anything like that has happened. Another is we're going to have a campaign where every single kiosk, self-checkout kiosk will have smart style awareness and ads being displayed on them. And also we're in talks of getting as a partner on the Walmart Plus platform. So a lot of really exciting things going on from a SmartStyle perspective.\n\nBut going back to your initial question, yes, there is a little bit of a gap from the SmartStyle brand and the rest. But in addition to all the things we spoke about regarding education, shift in marketing dollars, Zenoti, which will help SmartStyle as well, we have those extra in-salon traffic-driving ecosystem mechanism that will hopefully go above and beyond for that brand in addition to reimaging.\n\nSteph Wissink -- Jefferies -- Analyst\n\nAll right. That's encouraging to hear. I mean I apologize. This is going to be a little bit nuanced and technical, but I wanted to just, Kersten, kind of true up the model with respect to the outstanding lease obligations on your balance sheet, what portion of that is related to Regis-owned facilities versus what you're carrying on behalf of your franchisees? And then on the product revenue, I think you mentioned that you're largely complete with that transition to Sally Beauty, should we anticipate any sort of fees? And where will those fees be recorded in the P&L, is it going to be in the season in royalties line?\n\nKersten Zupfer -- Executive Vice President and Chief Financial Officer\n\nYes. Maybe I'll hit on the -- I'll have the first one first. So I know it's deep in the 10-K, but there is a pretty good footnote as it relates to the lease obligations. So of the total that's on the balance sheet related to leases, there's only about $7 million left associated with our opco salons.\n\nAnd then the remainder relates to the $12 million associated with corporate leases and then the remainder relates to franchise leases.\n\nSteph Wissink -- Jefferies -- Analyst\n\nOK. That's it for us. Thank you so much.\n\nBiz McShane\n\nThere are no other open questions at this time. We thank everyone for your interest in Regis. Have a great day.\n\nDuration: 0 minutes\n\nBiz McShane\n\nMatt Doctor -- Chief Executive Officer\n\nKersten Zupfer -- Executive Vice President and Chief Financial Officer\n\nSteph Wissink -- Jefferies -- Analyst\n\nMore RGS analysis\n\nAll earnings call transcripts"
}