{
  "companyName": "Eagle Pharmaceuticals",
  "companyTicker": "EGRX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/eagle-pharmaceuticals-egrx-q2-2022-earnings-call-t/",
  "content": "Eagle Pharmaceuticals (EGRX 0.86%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, everyone. My name is Katie, and I will be your conference operator. At this time, I would like to welcome everyone to the Eagle Pharmaceuticals second quarter 2022 financial results. [Operator instructions] As a reminder, this conference call is being recorded today, August 9, 2022.\n\nIt is now my pleasure to turn the floor over to Ms. Lisa Wilson, investor relations for Eagle Pharmaceuticals. Please go ahead.\n\nLisa Wilson -- Investor Relations\n\nThank you, operator. Welcome to Eagle Pharmaceuticals second quarter 2022 earnings call. This is Lisa Wilson, investor relations for Eagle Pharmaceuticals. With me on today's call are Eagle's president and chief executive officer, Scott Tarriff; chief financial officer, Brian Cahill; and vice president of medical affairs, Dr.\n\nMike Greenberg. This morning, Eagle issued a press release detailing its financial results for the three months ended June 30, 2022. This press release and a webcast of this call can be accessed through the Investors section of the Eagle website at eagleus.com. Before we get started, I would like to remind everyone that any statements made on today's conference call that express a belief, expectation, projection, forecast, anticipation or intent regarding future events and the company's future performance may be considered forward-looking statements as defined by the Private Securities Litigation Reform Act.\n\nThese forward-looking statements are based on information available to Eagle Pharmaceuticals' management as of today, and involve risks and uncertainties, including those noted in this morning's press release and our filings with the SEC. Such forward-looking statements are not guarantees of future performance. Actual results may differ materially from those projected in the forward-looking statements. Eagle Pharmaceuticals specifically disclaims any intent or obligation to update these forward-looking statements except as required by law.\n\nA telephone replay will be available shortly after completion of this call. You'll find the dial-in information in today's press release. The archived webcast will be available for one year on our website at eagleus.com. For the benefit of those who may be listening to the replay or archived webcast, this call was held and recorded on August 9, 2022.\n\nSince then, Eagle may have made announcements related to the topics discussed, so please refer to the company's most recent press releases and SEC filings. And with that, I'll turn the call over to Eagle's president and CEO, Scott Tarriff.\n\nScott Tarriff -- President and Chief Executive Officer\n\nThank you, Lisa. Good morning, everyone, and thank you for joining our call today. We are pleased that our second quarter 2022 results are bearing out the vision that we have been articulating for Eagle for some time now. Over the last year or so, we have focused on strategically building out our portfolio through acquisitions, licensing agreements and launches of organically developed products, with a stated expectation that we would double our revenue and more than double our earnings in 2022.\n\nWe are achieving that aspiration. In fact, our first half '22 non-GAAP earnings came in at $5.60 per share, already more than double the full year 2021 number. And our first half '22 revenues of $190 million already exceeded our revenues for all of 2021. In just six months, we have already outperformed our best year.\n\nOur main objective is to grow from here. The largest disconnect we need to bridge for our investors is that our internal forecast suggest that we will continue at the 2022 level in '23 with significant growth thereafter. This is also without further deploying our cash and balance sheet. Let me take the next few moments to explain our point of view.\n\nFirst half 2022 sales of vasopressin and PEMFEXY combined reached nearly $100 million. Our expectations for the third and fourth quarters of this year are that we will remain quite profitable. Our cash position is strong at $37 million, with $86 million in receivables, for total cash plus receivables of $122 million as of June 30, '22. And this is after our acquisition of Acacia.\n\nAnd we have only $48 million in outstanding debt. We are confident that '22 rebased our revenue and earnings. 2022 continues to be an active and exciting period for Eagle as we broaden our ability to bring much needed medicines to those who depend on them. It comes down to the fact that 2022 is a year of significant step-up in revenue and earnings for us.\n\nThe questions we are asked most frequently are where does Eagle go from here, can Eagle continue to grow from here after posting such significant EPS growth and what do '23 and '24 look like. I would like to make it very clear that our objective is to use 2022 as a springboard for further growth. We have a very good chance of achieving growth next year and beyond. On the upside, we have added our BARHEMSYS and BYFAVO and hopefully Landiolol to our product mix next year.\n\nWe also expect to grow PEMFEXY year over year. On the downside, vasopressin will decline, and we'll lose some BENDEKA royalty in '23. All in all, with our current product lineup, our projections today lead us to expect a very strong 2023. As previously mentioned, we have $122 million in cash and receivables, and we do not require a major deployment of cash to achieve our goals.\n\nAdd into the mix the potential fulvestrant, CAL02 and now the three Enalare pipeline opportunities announced this morning, and we see the potential for dramatic growth from where we are today. To be clear, we do not need a significant acquisition to achieve growth in 2023. Let's see how it all unfolds, but we are very focused on growth beyond the significant earnings and revenue step-up that we have achieved so far in '22. Let's discuss PEMFEXY and the rest of the opportunities in further detail.\n\nPEMFEXY is a unique market and one that is new to us. We developed a product with many benefits. Our customers have embraced PEMFEXY, as evidenced from our first half sales of $54 million. As this market matures, we believe many of our customers are highly likely to use a generic form of ALIMTA through the end of this year.\n\nThis is due to the way that generics are reimbursed in the first six months of their life cycle. Thereafter, we expect the dynamics in the market will allow many of these customers to transition their demand back to PEMFEXY, starting in the first quarter of '23. As of today, we believe that we will sell more PEMFEXY in 2023 than we had in 2022. Turning now to our hospital business and our recent acquisition of Acacia, which directly supports our stated objective of becoming a leading diversified pharmaceutical company.\n\nWith the closing of the transaction, Eagle picked up BARHEMSYS and BYFAVO, two commercially compelling FDA-approved hospital products with meaningful differentiation. Both are new chemical entities with patent life extending into the early 2030s, and we are seeing a lot of excitement around these two products. Let me spend a few minutes walking through why we think there is such a strong synergistic fit here and a sizable opportunity. BARHEMSYS is the first and only antiemetic approved by the FDA for rescue treatment of postoperative nausea and vomiting, referred to as PONV, despite prophylaxis.\n\nWe already call on most of these same healthcare providers and institutions. BARHEMSYS is also approved for the treatment of PONV in patients who have not received prophylaxis and for the prevention of PONV. The total estimated annual U.S. addressable market for prophylaxis and rescue is $2.7 billion.\n\nThe second product, BYFAVO, is indicated for the induction and maintenance of procedural sedation in adults undergoing procedures lasting 30 minutes or less. Here, the estimated addressable market in the procedural sedation is more than $400 million per year in the United States. As we commenced the integration, we were impressed with Acacia's previous plans and the positioning of BARHEMSYS and BYFAVO. In our view, the two products were underinvested both from a cost and manpower perspective.\n\nAdditionally, the products were launched into a very difficult COVID environment in which access to decision-makers and prescribers was limited. Acacia had approximately 70 employees prior to the acquisition, of whom we retained approximately 20. Most of these individuals are now members of our commercial team. In reviewing the future plans, we were immensely impressed with the vision, experience and leadership skills of Acacia's Debra Hussain, who we recently welcomed as Eagle's senior vice president, Head of Commercial.\n\nEagle's team is now at its peak commercial strength with approximately 50 individuals. Debra brings nearly 25 years of pharmaceutical industry experience leading commercial launches in the hospital and critical care space, having spent 22 years at Eli Lilly prior to Acacia. We look forward to her leadership as we work to realize the full potential of BARHEMSYS and BYFAVO and future launch products. BARHEMSYS and BYFAVO serve to diversify and complement our revenue streams and have the potential to accelerate our growth trajectory and strengthen our advantage in acute care.\n\nWe believe that peak U.S. annual sales of the two products combined could potentially total $275 million, and we look forward to demonstrating the strength of the acquisition as usage builds over the next 12 months. Now, turning to Landiolol. On June 1, we announced the submission of a new drug application to the FDA seeking approval for Landiolol, an ultra-short-acting, cardio-selective beta blocker.\n\nLandiolol is a leading hospital critical care product in Europe and Japan. Based on feedback from FDA, we expect approval around mid next year with a commercial launch soon thereafter. Together with BARHEMSYS and BYFAVO, this would give us three newly approved NCEs with strong patent life going into the growth stage, with projections of peak sales just shy of $400 million. Our hospital pipeline is very strong.\n\nWe believe CAL02 has blockbuster potential and could be a groundbreaking opportunity in severe bacterial pneumonia, which is a leading cause of death worldwide. In simple terms, CAL02 is being developed as an add-on to the clinically indicated antibiotic treatment that neutralizes bacterial toxins from the body. It is well-established medical understanding that these toxins significantly contribute to the severity of pneumonia. We start our clinical trials later this year and anticipate interim results at the end of '23.\n\nImportantly, the trial asked clinicians to add CAL02 to their current pneumonia treatment regimen. In the fall, we will begin opening what we expect will eventually be over 100 clinical sites worldwide. Now, we add Enalare to the mix, strengthening our hospital pipeline. This transaction broadens our acute care business with the addition of a portfolio of novel NCEs with strong intellectual property protection from the mid-2030s into the early 2040s, including composition of matter patents.\n\nENA-001 is a new chemical entity with a mechanism of action that, simply described, is a molecule that stimulates breathing. Think of it like a pharmacologic ventilator. You can imagine a number of indications where being able to stimulate breathing would be extremely valuable. At present, Enalare has elected to move forward with three targeted indications: Postoperative respiratory depression, its most advanced development program; community drug overdose, a problem that continues to increase in prevalence and severity; and apnea of prematurity, a common condition in preterm infants.\n\nWe see tremendous potential to address significant unmet medical needs for millions of patients worldwide suffering from acute respiratory depression. This is another example of our acquiring pipeline products that represent a strong strategic fit with our specialized sales and marketing organization, and we believe will serve to expand our portfolio of hospital and anesthesia products. We believe we will have approval for postoperative respiratory depression in 2026 and community drug overdose thereafter. Now, let me turn it over to Dr.\n\nMike Greenberg, our vice president of Medical Affairs, who will explain in greater detail about the initial targeted indications for ENA-001. Mike?\n\nMike Greenberg -- Vice President, Medical Affairs\n\nThank you, Scott. ENA-001 is a promising molecule and one that we believe has several important uses. It's an NCE with a unique mechanism of action being developed as an agnostic respiratory stimulant. Agnostic in this case means that it stimulates breathing irrespective of the cause of respiratory depression because it utilizes the body's innate respiratory control system.\n\nCurrent treatments may have limited use. For example, naloxone only reverses respiratory depression due to opioids as flumazenil only reverses benzodiazepines. Because ENA-001 is agnostic, it reverses respiratory depression due to opioids, benzodiazepines, even propofol, and we see potential use across multiple patient populations. The first indication is postoperative respiratory depression, which is common in patients recovering from surgery and anesthesia.\n\nIn fact, up to 36% of patients are at high risk of postoperative respiratory depression, which is associated with an increased risk of in-hospital mortality, increased length of stay and higher costs. ENA-001 has the potential to treat respiratory depression without interfering with pain suppression or sedation. This, and the potential ability of ENA-001 to address respiratory depression associated with multiple agents, such as opioids, benzodiazepines or propofol, differentiates it from other available options. The second targeted indication is community drug overdose.\n\nSadly, drug overdose deaths are at a record high and polysubstance abuse is increasingly common. Current pharmacologic options are limited in that they only address a single substance of abuse, typically opioids, and are usually implicated in inducing a withdrawal syndrome. ENA-001 has the potential to treat respiratory depression associated with polysubstance abuse without inciting the withdrawal effect experienced with opioids' antagonist, which can be a potential safety consideration. And the IM, or intramuscular, formulation being developed in conjunction with the Biomedical Advanced Research and Development Authority or BARDA has the potential to make this a treatment available in the hospital and in the community setting.\n\nThe third indication is apnea of prematurity, referred to as AOP. The prevalence of AOP increases with decreasing neonatal gestational age and birth weight and is present in up to 80% of infants born at less than 27 weeks of gestation. Pharmacologic treatment for these neonates is typically limited to caffeine or other methylxanthines. This proposed treatment could be used as monotherapy or in conjunction with the standard of care.\n\nWe look forward to providing updates as we advance the pipeline. I will now turn the call back to Scott.\n\nScott Tarriff -- President and Chief Executive Officer\n\nThank you, Mike, for highlighting the important differentiators. Continuing with our pipeline. Let me say a few words about fulvestrant. We spent about $6 million on an additional study this quarter, representing roughly 75% of our external R&D spend here in Q2.\n\nWe expect to have a preliminary data readout in about a month or so. If the readout is positive, we hope that we will have finally figured out this very complex product, which we believe could have tremendous benefit to breast cancer patients. Positive findings would afford us an important opportunity to provide meaningful value to our shareholders as well. If the study results are not positive, we will permanently discontinue this undertaking and no more money will be invested other than unblinding it.\n\nWith that, I'd like to turn the call over to Brian Cahill to discuss our second quarter financials. Brian?\n\nBrian Cahill -- Chief Financial Officer\n\nThank you, Scott, and good morning. In the second quarter of 2022, total revenue was $74.1 million compared to $48.1 million in 2Q of 2021, primarily reflecting continued revenue from sales of vasopressin and PEMFEXY. Product sales during the second quarter were $49.2 million compared to $19.6 million in 2Q of 2021. Vasopressin sales were $11.3 million and PEMFEXY sales were $16.5 million in the second quarter of 2022.\n\nBELRAPZO product sales were $8.1 million in the second quarter of 2022 compared to $7.6 million in Q2 of 2021. Second quarter RYANODEX product sales were $8.8 million compared to $7.9 million in 2Q of 2021. 2Q 2022 royalty revenue was $24.9 million compared to $28.5 million in the prior-year quarter. Royalty revenues include royalties earned on sales of BENDEKA in the U.S.\n\nand TREAKISYM in Japan. On the expense front, R&D expenses were $11.4 million for the second quarter of 2022 compared to $9.9 million in the prior-year quarter. This increase is largely attributable to clinical expense for fulvestrant and spend on CAL02. Excluding stock-based compensation and other noncash and nonrecurring items, second quarter 2022 non-GAAP R&D expense was $10.8 million.\n\nWe continue to expect R&D spend in 2022 on a non-GAAP basis to be between $46 million and $50 million. This reflects expected clinical and CMC work on CAL02 and fulvestrant and costs of other ongoing programs, including the post-approval obligations for the newly acquired Acacia products. SG&A expenses in the second quarter of 2022 were $36.8 million compared to $16.6 million in the second quarter of 2021. This increase was primarily related to costs associated with the acquisition of Acacia, including severance expense as well as other deal costs.\n\nAdditionally, external sales and marketing expense increased due to the launch of PEMFEXY. Excluding stock-based compensation and other noncash and nonrecurring items, the second quarter 2022 non-GAAP SG&A expense was $15.2 million. We expect our SG&A spend in 2022 on a non-GAAP basis to be between $62 million and $66 million. This increase from prior guidance is inclusive of the headcount and external costs associated with commercializing or BARHEMSYS and BYFAVO.\n\nNet loss for the second quarter of 2022 was $9.5 million or $0.74 per basic and diluted shares compared to net income of $3.6 million or $0.28 per basic and $0.27 per diluted share in the prior year period. Adjusted non-GAAP net income for the second quarter of 2022 was $20.3 million or $1.58 and per basic and $1.56 per diluted share compared to adjusted non-GAAP net income of $12.4 million or $0.95 per basic and $0.93 per diluted share in the prior year period. For a full reconciliation of non-GAAP measures to the most comparable GAAP measures, please see the tables at the end of our earnings press release. As of June 30, 2022, and following the completed acquisition and synergizing of Acacia, the company had $36.6 million in cash and cash equivalents, we had $85.9 million in net accounts receivable and $47.9 million in outstanding debt, resulting in $74.6 million in net cash plus receivables.\n\nWith that, I'll ask the operator to open the call for questions. Operator, please go ahead.\n\nOperator\n\nThank you. [Operator instructions] Our first question will come from Tim Lugo with William Blair. Your line is now open.\n\nUnknown speaker\n\nHey, guys. This is Lachlan on for Tim. Thanks for taking on the question, and congrats on another strong quarter and another deal in the works. So Scott, I was wondering, you mentioned that the sort of the payer dynamics around generic ALIMTA and how that will impact the first two quarters of launch.\n\nI was wondering if you can give any color on sort of what you've seen so far since they launched. I know it's not been very long, but have you seen sort of slowing growth or declining use of PEMFEXY? Any sort of commentary you could give there would be great. And second is on the -- well not, I guess, launch of BYFAVO and BARHEMSYS. Can you just talk about what the uptake expectations should be there? Because I know they came with some reimbursement already sort of underway.\n\nSo how should we think about the uptake of them?\n\nScott Tarriff -- President and Chief Executive Officer\n\nAwesome. Thank you and good morning. It's nice to hear from you today. So taking PEMFEXY first.\n\nIt's just an unusual market that we haven't been in previously. Generics come into the market, and their price is below where the market was, obviously. And the way reimbursement works, they will wind up -- there will be heavy generic usage in the next two quarters, three and four. And then based on the attributes of PEMFEXY, we expect those sales to come back to us pretty significantly.\n\nAs we mentioned a little while ago, we expect PEMFEXY sales to grow in '23 over '22. And we did over $50 million in the first half this year. So we're pretty excited about PEMFEXY. It really turned out to be a great product for us.\n\nAnd then as far as BARHEMSYS and BYFAVO go, the -- Acacia actually did a very good job. They have a very significant number of formulary victories and now it's really all about pull-through. We have the most significant number of commercial members and the team on it now. It's obviously a focus of ours.\n\nWe don't know exactly how the ramp is going to work out, we're going to have to see. But as we mentioned, the expectation is those two products will reach $275 million at peak sales, which is tremendous for our size, tremendous for the company. Let's see what the next two, three quarters look like as we put the new team in place and try to pull through. But we're just very excited about it.\n\nAnd if we're right or anywhere close to right, you can see where the trajectory of this company winds up. Put Landiolol in there next year as well, same sales force, and that's our excitement right now.\n\nUnknown speaker\n\nThanks.\n\nOperator\n\nThank you. Our next question will come from David Amsellem with Piper Sandler. Your line is now open.\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nThanks. So just a couple. So first, I know you've talked about this in the past, but I thought it would make sense to just get a refresher on your latest thinking on where your bendamustine folks -- I should say BENDEKA share will go amid the presence of generics on the legacy form. So just talk about how you're thinking about market dynamics next year for that franchise.\n\nAnd then secondly, with vaso and the competitive dynamics evolving, I think you've said in the past that you expect it, even with more competition, to be a meaningful contributor. Can you just talk to how you're thinking about that? If you can't quantify it, at least provide some qualitative color on what you mean by meaningful even amid evolving competitive dynamics going forward.\n\nScott Tarriff -- President and Chief Executive Officer\n\nThank you, David. So let me try to summarize your two questions up. On bendamustine, as we continue to look at the landscape, and our thinking is solidified by what we see with PEMFEXY, a couple of items to bring up. First of all, BENDEKA is by far the best product on the market.\n\nIt's a 10-minute infusion instead of 30 and 60 minutes. And it has been embraced very successfully with everyone involved: Patients and caregivers, nurses and physicians. When we receive competition from TREANDA later in the year, early next year, those are therapeutic substitutions to BENDEKA. They're not generic substitutions for BENDEKA.\n\nBENDEKA will be protected into 2028. So BENDEKA will clearly be a meaningful product to the company for many years to come. It's just going to be difficult for that switch to take place to a therapeutic alternative with the benefits of BENDEKA. We've been pretty consistent.\n\nWe think the loss will be, give or take, 30% of our revenue, which is very manageable for the company. And with the growth that we have, we don't believe that the decline that we'll get from BENDEKA is going to be significant relative to the size of the company. And our view of that is more solidified now than it has been. In terms of vaso, what we've always said in the past, David, is that we looked at vaso and PEMFEXY combined.\n\nIn the case of vasopressin, as more people come into the market, obviously, the vasopressin market is going to decline for us. I mean, there's no way of getting around that. We'll just have to see over time here how many people actually come into the market and what happens to price. It's hard to predict.\n\nThough on the other side, we have PEMFEXY, which is very strong and is expected to grow next year compared to this year, and it's a big number, right? We've already done over $50 million of PEMFEXY this year. And so we expect a decline in vaso, an increase in PEMFEXY. And all in all, growth in those two products for a while. We'll have to see how long that is, but we expect growth from these two products, or at least significant earnings from the two products, in the near and midterm.\n\nAnd we'll just have to see how it unfolds. But when you take in the ups and the downs, our expectation is '23 is going to be pretty close to '22, and that's without deployment of our balance sheet or cash. So we're pretty excited about the future.\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nOK, thank you.\n\nScott Tarriff -- President and Chief Executive Officer\n\nThanks, David.\n\nOperator\n\nThank you. It appears that we have no further questions at this time. I'll now turn the program back over to Scott Tarriff for any additional or closing remarks.\n\nScott Tarriff -- President and Chief Executive Officer\n\nWell, thank you again, everyone, for joining our call. We've been making significant progress in diversifying our revenue base and increasing the breadth of our product and development portfolio. And it's only midyear, and we've already turned in the best earnings performance in the history of our company. And we look to sustain and accelerate the growth, and we continue to support our commercial launches and broaden our portfolio through acquisitions, such as Acacia; now our investment, the potential to acquire Enalare, both of which would enhance our position in hospital and critical care.\n\nAnd we appreciate your interest and support of Eagle. I look forward to sharing more updates as we move forward. Thank you again, and stay well. I appreciate it.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLisa Wilson -- Investor Relations\n\nScott Tarriff -- President and Chief Executive Officer\n\nMike Greenberg -- Vice President, Medical Affairs\n\nBrian Cahill -- Chief Financial Officer\n\nUnknown speaker\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nMore EGRX analysis\n\nAll earnings call transcripts"
}