{
  "companyName": "StoneMor Partners L.P.",
  "companyTicker": "STON",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/stonemor-partners-lp-ston-q2-2022-earnings-call-tr/",
  "content": "StoneMor Partners L.P. (STON)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the StoneMor 2Q earnings release. [Operator instructions] As a reminder, this call is being recorded today, Thursday, August 11, 2022. I would now like to turn the conference over to Keith Trost, senior vice president of corporate development. Please go ahead.\n\nKeith Trost -- Senior Vice President of Corporate Development and Investor Relations\n\nThank you. Good afternoon, everyone. And thank you again for joining us on the StoneMor Inc. conference call to discuss Our 2022 second quarter financial results.\n\nYou should all have a copy of the press release we issued earlier today. If anyone does not have a copy, you can find the full release on our website at www.stonemor.com. With us on the call this afternoon are Joe Redling, president and chief executive officer; and Jeff DiGiovanni, senior vice president and chief financial officer. Before we begin, as usual, I would like to remind everyone that this conference call will include certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nAll statements that address operating performance, events or developments that we expect or anticipate to occur in the future are forward-looking statements. These forward-looking statements are based on management's good faith, beliefs, and assumptions. Our management believes that these forward-looking statements are reasonable. However, you should not place undue reliance on any such forward-looking statements because such statements speak only as of today's date.\n\nWe do not undertake any obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. In addition, forward-looking statements are subject to certain risks and uncertainties that could cause actual results, events and developments to differ materially from our historical experience and our present expectations or projections. These risks and uncertainties include, but are not limited to, those described in the reports which we file with the SEC. During the call, we will reference certain non-GAAP financial measures, such as EBITDA, field EBITDA, adjusted EBITDA and unlevered free cash flow.\n\nA reconciliation of these measurements to the most directly comparable measures calculated in accordance with GAAP is provided in the press release and the investor presentation, which is also available on our website. With that, I'll now turn the call over to Joe Redling, who will take it from here.\n\nJoe Redling -- President and Chief Executive Officer\n\nThank you, Keith. Welcome again to our second quarter earnings call. The purpose of today's call is to provide an update on our operational performance during the second quarter. While I'm sure there are questions regarding the proposed merger agreement, we will not be addressing those in today's call.\n\nWe filed preliminary proxy materials with the SEC last Friday on August 5. Definitive proxy material will be sent out to our stockholders and will contain important information about the merger. They should be reviewed carefully. The proxy material will also state where additional information can be obtained if desired.\n\nNow let me move to the second quarter results. As we mentioned on our last earnings call, we are facing tougher comps after the record sales production performance throughout 2021. During the second quarter of 2022, we certainly faced a tougher comp with the second quarter of last year being up 21% over the second quarter of the previous year, making those comps even more challenging where a difficult economic environment, coupled with the headwinds associated with declining death rates in our markets, with the CDC's preliminary data for the second quarter reporting a 6% decline in our whole death. With that said, I'm proud to report that our team has once again stepped up and met the challenge, delivering 6.5% growth in total cemetery sales production versus the second quarter of 2021, despite a 6% decline in admin sales production in the quarter compared to the second quarter of 2021, a decline that mirrored the CDC's reported declines.\n\nThis new high mark was driven by the strength of our pre-need sales production program, which yielded year-over-year pre-need growth of 12%. This one was accomplished by delivering strong monthly results throughout the quarter, including double-digit growth in the month of May and June, which recorded historic new high. As we look ahead to the remainder of 2022, we expect to see continued downward pressure on at-need sales production as compared to a year ago, particularly those associated with COVID. Accordingly, we continue to leverage our pre-need sales production programs to offset that anticipated decline in at-need sales production.\n\nAnd similarly, we remain focused on continuing the successful strategy of optimizing our net pricing strategy with targeted price increases and reduced discounts designed to offset potential at-need declines, as well as rising supply chain costs. For the six months ended June 30, 2022, our total revenues were $161 million, which is flat versus the six months ended June 30, 2021. For the second quarter of 2022, our total revenues were $80 million, representing a 3.5% decline in total revenues versus the three months ended June 30, 2021. The decline in our revenues during the second quarter was driven largely by a decrease in our trust and investment income that Jeff will touch on in a minute, and the stated decline in death rates that we've experienced in our markets.\n\nThe cemetery segment had total revenues of $140 million for the first six months ended June 30, 2022, which, again, was flat year over year. Cemetery revenues for the second quarter of 2022 was $70.5 million, representing a decline of 2% when compared to the same period last year. The funeral segment had total revenues of $21.1 million and $9.6 million for the six and three months ended June 30, 2022. That represented a 5% and 12% decline, respectively, when compared to the same periods in the prior year.\n\nAs a reminder, both cemetery and funeral home revenues are largely driven by at-need and pre-need turned at-need production, both of which were negatively impacted by declining death rates. Revenues associated with pre-need cemetery merchandise and service sales are largely deferred until the contract turns at-need, meaning that the positive impact from the growth in our pre-need sales production is largely negated when we look at our GAAP financial statements. Turning to expenses. We continue to experience supply chain and other cost challenges that contributed to a 14% increase in our total expenses or $11.1 million when comparing the second quarter of 2022 to the second quarter of 2021.\n\nThese increases, most notably those related to corporate overhead were negatively impacted by cost and expenses associated with various corporate special projects, including those related to the proposed merger. Additionally, we continue to reinvest into our properties with necessary repairs and maintenance. That planned increase in expenditures coupled with material inflationary cost increases in operating supplies and an increase in selling expense were the main contributors to the year-over-year uptick in cemetery expenses. This increase in expenses was the primary driver of the decline in operating income year over year.\n\nJeff will provide additional detail on both the changes in total revenue and expenses in a minute. With respect to our previously discussed targets for 2022, we remain confident that we will meet or exceed our projected unlevered free cash flow and organic trust growth targets. We utilize and report on these two key targets as we feel they represent the value that has been created during the year, in not only our operations, but also through our trust management strategies. First, we targeted $40 million of unlevered free cash flow for the full year of 2022.\n\nWe generated $11.3 million of unlevered free cash flow during the second quarter. Coupled with the $6.3 million that was generated during the first quarter, we're now sitting at $17.6 million for the six months ended 6/30/2022. Secondly, we targeted $70 million of organic trust growth. As of June 30, 2022, we have generated total trust growth of $46.9 million, including $18.7 million during the second quarter.\n\nThis growth included $9.9 million of trust assets acquired through our acquisition activity. Excluding these acquired trust assets, we've generated $37 million of organic trust growth for the six months ended June 30, 2022. This trust growth is driven by the combination of growth in pre-need sales production, as previously discussed, as well as strong investment income that is retained in the trust and not distributed as cash in accordance with the various state laws. With that, I'll now turn it over to Jeff for further discussion on our second quarter and year-to-date financial performance.\n\nJeff DiGiovanni -- Senior Vice President and Chief Financial Officer\n\nThank you, Joe, and thank you, all, for joining us today. Total revenues for the second quarter of 2022 were $80 million, representing a 3.5% decrease when compared with the $83 million for the second quarter of 2021. Total revenues for the six months ended June 30, 2022, were $161 million, representing a 0.2% decrease when compared with the $161.3 million for the six months ended June 30, 2021. As a reminder, when we talk about revenue, the application of GAAP revenue recognition standards does not reflect the full impact of our pre-need sales production, but instead relies heavily on the timing of pre-need turning to at-need and service on pre-need merchandise and services.\n\nThe sales production metrics that Joe discussed earlier are a measure of our current period sales activity and is not directly related to the current GAAP revenue results. Cemetery revenues, which comprised 88% of our second quarter -- 2022 revenues were $70.5 million for the second quarter of 2022, compared with $72.1 million for the second quarter of 2021, a 2.3% decline, which was primarily driven by the decrease in investment and other income. For the six months ended June 30, 2022, cemetery revenues were $140 million, compared to $139.1 million for the six months ended June 30, 2022, or a 0.6% increase. Impairment revenues, which generally are recognized as revenues in conjunction with our sales production performance decreased $0.8 million or 3.4% compared to the second quarter of 2021, driven primarily by the decrease in at-need revenues.\n\nMerchandise revenues, which generally are deferred into the merchandises delivered, increased by $2 million or 11% compared to the second quarter of 2021. Service revenues, which generally are similarly deferred until services are rendered, increased by $0.7 million or 3.8% compared to the second quarter of 2021. Investment in other income, which includes interest income, decreased $3.5 million or 25.7% compared with the second quarter of 2021. The decrease was primarily driven by a decrease in investment income associated with the perpetual care trust of $4 million and a decrease of $0.6 million in other income.\n\nThese decreases were offset in part by an increase in investment income associated with the merchandise trust of $2.1 million. Moreover, Q2 2021 benefited from a one-time investment-related fees of approximately $1.5 million earned in 2021. General home revenues which represented the remaining 12% of our second quarter 2022 revenues, decreased $1.3 million or 11.6%, compared to $9.6 million for the second quarter of 2022 compared with $10.9 million for the second quarter of 2021. The decrease was largely attributable to declining death rates.\n\nFrom an expense standpoint, our cost of goods on cemetery revenues increased $0.1 million or 0.7% to $12.5 million in the second quarter of 2022, compared with $12.4 million in the second quarter of 2021. As a percentage of cemetery revenues, cost of goods was 17.8% and 17.2% for the second quarter of 2022 and 2021, respectively. We continue to experience inflationary cost pressures from our suppliers on key merchandise categories. Our focus on pricing throughout the first half of 2022 has allowed us to effectively manage our margins.\n\nCemetery expense during the second quarter of 2022 was $21.6 million, representing a $3.5 million increase compared to the second quarter of 2021. Last quarter, we discussed some of the key drivers of cemetery expense, including maintenance and planned repairs and maintenance projects that do not meet capitalization standards. In addition to transition costs associated with the termination of our relationship with new landscaping, we discussed last quarter, we continue to experience inflationary pressures on payroll and material costs associated with the operations of our locations. We are working diligently to manage these costs and identify opportunities to reduce costs overall.\n\nOf note, cemetery expense decreased more than $0.5 million when compared to the first quarter of 2022 when we first noted these cost increases. Selling expense as a percent of cemetery revenues increased from 20.5% for the second quarter of 2021 to 24.5% for the second quarter 2022. During the second quarter of 2022, we implemented several policies designed to attract new sales counselors that resulted in higher fixed costs. Additionally, in an effort to drive sales production, we continue to invest in certain advertising initiatives.\n\nCollectively, these targeted advertising and hiring initiatives contributed to the 12% year-over-year growth in pre-need sales production during the second quarter of 2022. That's more than a $5 million increase in pre-need sales production when compared to the second quarter of 2021. Similar to our revenues, variable selling costs such as bonus and commissions are deferred to match with the corresponding revenue recognition standards, whereas fixed costs such as advertising, training and base payroll or expense has occurred. Accordingly, many of these initiatives utilize to drive current period sales production result in an expense in the current period.\n\nCemetery G&A expense for the second quarter of 2022 was $12.3 million, a $1.6 million increase compared to the second quarter of 2021. The increase is largely attributable to an increase in payroll and related costs. General home expenses increased $0.1 million or 0.9% to $9.3 million for the second quarter of 2022 when compared to the second quarter of 2021. And lastly, on the expense side, as Joe touched briefly on this, corporate overhead increased by $3.3 million to $12.8 million for the second quarter of 2022.\n\nThis increase was largely driven by an increase in legal and other professional fees including cost in excess of $1.7 million associated with the various corporate initiatives that are onetime in nature. These initiatives include costs associated with the proposed merger agreement. EBITDA for the second quarter of 2022 was a negative $4 million, compared with a negative $31.2 million for the second quarter of 2021. However, the 2021 period included a $40.1 million loss associated with the debt extinguishment.\n\nThe decrease in EBITDA, excluding the debt extinguishment impact was largely attributable to changes in revenue and expenses that we've already discussed. Although our EBITDA calculation does adjust for certain noncash items, including stock-based compensation and cost of loss, does not give us credit for strong pre-need sales production that Joe discussed. Our organization is built to support the pre-need sales program. Accordingly, we utilize the adjusted EBITDA calculation that considers the growth in deferred revenue, in our view, more appropriately measures the performance based on current production levels.\n\nAdjusted EBITDA also adjusts for certain gains and losses, including the aforementioned loss on debt extinguishment. Adjusted EBITDA for the second quarter of 2022 was $12.1 million, compared to $32.1 million for the second quarter of 2022, representing a $20 million decline. In addition to the revenue expense fluctuations already discussed, adjusted EBITDA was negatively impacted by the decline in trust investment performance. Field EBITDA, which adjusts GAAP EBITDA for corporate overhead, was $8.3 million for the second quarter of 2022, compared with a negative $22.29 million in the second quarter of 2021.\n\nAs with the EBITDA calculation, it should be noted that the prior-year number included the $40.1 million loss associated with the debt extinguishment. As previously noted, with the decrease in EBITDA, the decrease in field EBITDA, excluding the debt extinguishment impact largely attributable to changes in revenue expenses that we've already discussed. Joe touched briefly on our key metrics. We remain confident in those targets and our ability to meet those for the full year.\n\nFirst, during the second quarter, we generated unlevered free cash flow of $11.3 million. For the six months ended June 30, we have generated $17.6 million in unlevered free cash flow against a full year target of $40 million. Last year, we generated $26.2 million of unlevered free cash flow through the six months ended June 30, 2021. Included in the $40 million target was $12 million in planned capital expenditures.\n\nAs of June 30, 2022, we had spent $6.1 million against that $12 million plan, and that compares to $3.4 million spent during the six months ended June 30, 2021. The second key metric is organic trust growth. Joe mentioned that we have grown our trust by $46.9 million, which included $9.9 million of trust assets acquired as part of our acquisition. Excluding those acquired trust assets, we experienced organic trust growth of $37 million.\n\nAs of June 30, our merchandise trust balance was $604.8 million, representing $36.9 million in growth for the six months ended June 30, 2022. As a reminder, the merchandise trust grows through contributions of new pre-need sales and customer collections. Additionally, the growth was also driven by the retention of investment income and those trusts accordance with various state laws. The perpetual care trust balance was $349.2 million as of June 30, 2022, representing $10 million in growth for the six months ended June 30, 2022.\n\nThe perpetual care trust grows primarily through contributions on new impairment sales in accordance with various state laws. Collectively, between organic trust growth and unlevered free cash flow, we generated $54.6 million against the full year target of $110 million. We thank you for your time today. With that, we'll open -- we will now open the floor to any questions you may have.\n\nOperator\n\n[Operator instructions] And Mr. Trost, there are no questions at present time. I'll turn the call back to yourself. Please continue with your presentation or closing remarks.\n\nKeith Trost -- Senior Vice President of Corporate Development and Investor Relations\n\nThank you again for your time this afternoon. In the meantime, if you have any questions that were not answered or discussed on today's call, please reach out to investor relations at (215) 826-4438. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKeith Trost -- Senior Vice President of Corporate Development and Investor Relations\n\nJoe Redling -- President and Chief Executive Officer\n\nJeff DiGiovanni -- Senior Vice President and Chief Financial Officer\n\nMore STON analysis\n\nAll earnings call transcripts"
}