{
  "companyName": "Oyster Point Pharma, Inc.",
  "companyTicker": "OYST",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/oyster-point-pharma-inc-oyst-q2-2022-earnings-call/",
  "content": "Oyster Point Pharma, Inc. (OYST 0.18%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Oyster Point Pharma second quarter 2022 earnings conference call. [Operator instructions]. I would now like to hand the conference over to your speaker for today, Arty Ahmed, vice president, investor relations.\n\nYou may begin.\n\nArty Ahmed -- Vice President, Investor Relations\n\nGood evening, everyone, and welcome to Oyster Point Pharma's second quarter 2022 earnings conference call. This evening, we issued a press release containing our financial results and recent business highlights for the second quarter ended June 30, 2022. In addition, our earnings press release and Form 10-Q, which were filed with the SEC after the close of market today, are available on our website under the Investors and Media section at www.oysterpointrx.com. Joining us on our call today are Dr.\n\nJeffrey Nau, the president and chief executive officer of Oyster Point Pharma; Dan Lochner, our chief financial officer and chief business officer; and Mike Campbell, our senior vice president and head of commercial. Following our prepared remarks, we will open up the line for questions. Please note that during the call today, we will be making forward-looking statements regarding potential future events, including statements on Oyster Point Pharma's potential future financial status and results of operations, and our plans and potential for success relating to commercializing Tyrvaya nasal spray. These forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause our actual results to differ materially from any future results, performance or achievements expressed or implied by such statements.\n\nFor a description of these factors, please see our quarterly report on Form 10-Q for the quarter ended June 30, 2022, filed with the SEC after the close of market today. I will now turn the call over to Dr. Jeffrey Nau, our president and chief executive officer.\n\nJeffrey Nau -- President and Chief Executive Officer\n\nThank you, Arty. Good evening, everyone, and thank you for joining us on our call today. I am pleased to report a strong second quarter for Oyster Point, which included continued robust growth and positive sales momentum for Tyrvaya nasal spray for the treatment of the signs and symptoms of dry eye disease. Our continued growth in this quarter highlights the value that our differentiated product brings to patients and physicians.\n\nWe're excelling in our goal to continue to expand access to Tyrvaya to more eligible patients and progressing the development of our exciting pipeline assets.  Today, I will provide an update on our commercial progress with Tyrvaya and discuss additional business and development highlights. We are excited by the impact that Tyrvaya has had on the dry eye landscape. Dry eye disease is a condition affecting an estimated 38 million people in the U.S. alone.\n\nPatients and eye care professionals, or ECPs, have traditionally struggled to find suitable long-term treatment that are efficacious, practically administered and fast-acting. Tyrvaya is easily administered to patients, even those with poor dexterity and provides natural tear film production for most within manufacture administration. Tyrvaya's differentiated clinical profile, which rapidly bioactivates tear film production to help the body create more natural tear continues to garner high levels of interest and enthusiasm with both patients and ECPs alike. We remain confident that this is the beginning of a paradigm shift in the way that ECPs think about dry eye treatment by harnessing the body's own natural tear producing machinery to delivery therapy with Tyrvaya. We believe Tyrvaya's brand perception has been increasing on a quarterly basis since launch with this enthusiasm illustrated by our refill rates and persistence data. Our 60-day refill rate is 65%, representing a blended average between our mail order and traditional retail pharmacy outlets as of the last data available from June 3.\n\nBased on data from IQVIA from the November 2021 dry eye cohort, Tyrvaya has the highest persistence rate of all prescription dry eye medications in the first six months after initiation of therapy. In addition, from that same data set and time period, Tyrvaya has the highest percentage of restarts after any interruption in therapy. This data highlights the leading patient adherence and restart profile for Tyrvaya, characteristic not common with other branded dry eye therapeutics, which can often take a long time to work. We believe that this data illustrates how Tyrvaya has quickly become an important part of the current treatment paradigm for ECPs and how patients suffering from dry eye disease are positively responding to Tyrvaya.\n\nIn the second quarter of 2022, Tyrvaya generated $4.7 million in net revenue. Approximately 30,000 prescriptions were filled during the quarter and were written by over 5,700 unique eye care professionals, reflecting strong quarter-on-quarter growth.  Our commercialization strategy continues to focus on engagement with both ophthalmology and optometry. Since launch, approximately 7,700 unique eye care professionals have written a prescription for Tyrvaya as of July 22, 2022, which represents over one-third of the total number of ECPs being targeted by our field-based sales resources. Prescriber numbers continue to show consistent growth month-over-month.\n\nWe expect that we will continue to build commercial insurance coverage and attain coverage by Medicare Part D plans and that adoption will continue to increase as a result. We remain focused on growing Tyrvaya into a leading dry eye disease brand underpinned by our belief that Tyrvaya is a transformative solution. Simply put, there is no substitute for a patient's own natural tear film, and this is a message that is resonating with both ECPs and patients alike. In our mission to make Tyrvaya widely available to all patients suffering from dry eye disease, I'm also pleased to share that formulary access to Tyrvaya has grown meaningfully.\n\nAs of July 2022, Tyrvaya is now covered by commercial prescription drug plan, managed by the nation's top three pharmacy benefit manager group purchasing organizations. In addition to our unique patient assistance program, TEAMTyrvaya, we've introduced new programs to expand access to Tyrvaya for eligible patients. Mike Campbell our senior vice president, head of commercial, will shortly provide further details on these programs as well as Tyrvaya's commercial performance during the quarter.  Outside of the United States, Ji Xing pharmaceuticals, our licensing partner, in Greater China, announced in July that the first patients were enrolled in the single Phase III clinical trial to support a new drug application for regulatory approval of OC-01 nasal spray for the treatment of the signs and symptoms of dry eye disease in China. We are pleased with the progress being made and how the global footprint of Tyrvaya continues to grow.\n\nWe remain excited about the prospect of helping patients suffering from dry eye disease in China, where an estimated 200 million people suffer from disease. The differentiated profile of OC-01 is drawing positive interest from partners in numerous ex-U.S. geographies. We continue to engage with potential partners to explore opportunities to provide patient access to Tyrvaya in international markets beyond Greater China and to improve the health of patients worldwide and create long-term value for our shareholders.  Moving on to provide the quarter's update on our pipeline assets.\n\nWe have made important strides to progress our phase 2 OLYMPIA clinical trial of OC-01 nasal spray for the treatment of Stage 1 neurotrophic keratopathy, or NK, and our preclinical studies of Oyster Point's enrich tear film or ETF gene therapy program for the treatment of Stage 2 and 3 neurotrophic keratopathy.  Given our unique and differentiated expertise of working in harmony with the body's natural processes, we believe that OC-01 nasal spray will become a truly differentiated treatment option for Stage 1 NK, which is estimated to affect as much as 15% of the 38 million dry eye disease patients in the United States. In our phase 2 OLYMPIA study of OC-01 nasal spray, we have continued to enroll patients throughout the quarter and remain on track to deliver results in the fourth quarter of 2022. Within the discovery engine of Oyster Point Labs, our enriched tear film gene therapy platform has progressed. And much like recent advances in mRNA vaccines, the goal is to turn the lacrimal gland into a protein-producing factory that naturally secretes a multitude of potential therapeutic targets into the tear film.\n\nThis preclinical platform is robust, and we believe it will fuel the development of new and innovative therapies for patients with high unmet needs. We have now completed our second preclinical study of OC-101, and adenoviral vector encoding the gene for human nerve growth factor delivered as a single intralacrimal gland injection. After injection, we observed significant amounts of nerve growth factor present in the natural tear film as early as day seven and for up to 42 days after transduction. In addition, cholinergic activation of our OC-01 nasal spray produce a further significant increase in NGF levels in the tear film within minutes after administration.\n\nThese results support the future potential for our enriched tear film gene therapy program to leverage the lacrimal gland as a natural biofactory that can deliver therapy to the ocular surface. Based on this groundbreaking data, we have submitted a pre-IND meeting request to the FDA for the treatment of Stage 2 and 3 neurotrophic keratopathy. We're excited about the potential to change the treatment paradigm for Stage 2 and 3 neurotrophic keratopathy, which currently requires the reapplication of refrigerated drop six times a day over a two-month treatment course. We're also pleased to announce the second asset in our enriched tear film gene therapy program, OC-103, and adenoviral vector encoding for the gene for diamine oxidase, a naturally occurring human enzyme responsible for the cleavage of histamine.\n\nOnce injected into the lacrimal gland, the promise of this approach is discrete this naturally present enzyme in increased amount as part of the natural tear film with the potential to create anti-histamine tear film. The development plan will initially target patients suffering from vernal or atopic keratoconjunctivitis, two severe site-threatening commissions to the ocular surface.  In summary, I'm very pleased with our performance in the second quarter and the value Tyrvaya is delivering to patients and eye care professionals. Given the size of the U.S. market and the notable high levels of satisfaction among patients and clinicians, we see significant opportunity ahead.\n\nI am also very excited about our multiple pipeline opportunities aimed at delivering transformative innovation for ocular surface disease where there remains significant unmet need. I would now like to introduce Mike Campbell, Oyster Point's senior vice president and head of commercial. While this is Mike's first earnings call at Oyster Point, Mike has been with Oyster Point since January of 2020 and has been instrumental in the pre-commercial planning for Tyrvaya as well as the day-to-day commercial operations since Tyrvaya's commercial launch in November 2021. Mike is a known commercial leader in pharma biotech and particularly, in ophthalmology with approximately 30 years of experience, including J&J Vision Care, Genentech, Shire, and Novartis.\n\nMike will now discuss our recent commercial activities related to Tyrvaya.\n\nMike Campbell -- Senior Vice President and Head of Commercial\n\nThank you, Jeff, and good evening, everyone. In just over nine months since launch, we've remained enthusiastic about Tyrvaya's growth prospects, underpinned by the metrics generated to date and the positive feedback we have received from both patients and ECPs. We remain confident that Tyrvaya's unique mechanism of action and route of administration for the treatment of signs and symptoms of dry eye disease well positions Tyrvaya to change the paradigm for dry eye disease. To begin with, I'd like to provide an update regarding Tyrvaya's launch to date success.\n\nAs of July 22, 2022, over 62,000 Tyrvaya's prescriptions have been filled by around 7,700 unique ECPs since Tyrvaya's launched in November 2021. This TRx performance is notable, particularly when putting Tyrvaya's launch into perspective with the last two prescription dry eye product launches. With Tyrvaya's cumulative TRxs having outpaced those products on a launch-to-date basis, this conclusion for Tyrvaya also remains similar when comparing the quantity of ECPs adopting Tyrvaya on this launch to-date basis. For Tyrvaya, we remain committed to helping as many patients as possible, and this starts with ECPs adopting Tyrvaya as an important product for their treatment paradigm.\n\nAs we have previously highlighted, our commercial team has already activated around 7,700 unique ECPs since launch, which actually represents over one-third of the ECPs targeted by our field-based sales resources, and this activated ECP base has grown consistently each week since launch. Looking forward, we expect continued ECP growth notably upon Tyrvaya securing Medicare Part D access. We anticipate new ECP momentum to build, particularly from ECP practices with high quantities of Medicare Part D patients, given access and reimbursement has been a requirement for adoption. In total, by the end of this year, we would expect to have approximately half of our total 21,000 targeted ECPs activated, which is expected to further drive new patient adoption and prescription growth.  We continue to remain focused on ECP adoption as a result of Tyrvaya's early market share results in ECPs who have adopted the product.\n\nAs we announced for the week of July 1, 2022, within those ECPs that have written a prescription for Tyrvaya, Tyrvaya has achieved approximately a 21% market share of commercial new-to-brand prescriptions.  This market share number illustrates three key takeaways for Tyrvaya: first, since launch, Tyrvaya has become a key therapeutic option for ECPs treating dry eye disease patients; second, an early read on the potential for Tyrvaya's commercial market share with continued ECP adoption; and third, this market share has been achieved prior to launching a full-scale direct-to-consumer marketing campaign, which has been shown across the industry to stimulate prescriptions and impact market share. Another driver that will remain important to Tyrvaya's launch success is patient refill and patient persistence. We continue to observe strong refill rates for Tyrvaya, and since launch, approximately 65% of prescriptions have been refilled within 60 days. Furthermore, this year, Oyster Point commissioned a study with IQVIA to evaluate Tyrvaya's patient persistence, beginning with the cohort of patients who adopted Tyrvaya in November 2021.\n\nSix months into the study when following the November 2021 patient cohort, the results demonstrated that Tyrvaya has the highest persistency and restart rates among the five prescription dry eye products evaluated in the study with an average number of refills at 3.4, which has continued to grow as the study has matured.  We will continue to follow this study out to month 12. However, this data underpins our confidence in the efficacy and safety profile of Tyrvaya. Its acceptance by patients and the refill potential for Tyrvaya being an important TRx driver going forward.  To drive awareness, we've completed 125 peer-to-peer programs since we launched the initiative in April of this year. In addition, these programs have captured approximately 1,800 ECP engagements through August 4, 2022.\n\nThese targeted activities, among other marketing initiatives, have helped inform the ECP community about the potential of Tyrvaya. Our market access team has continued to execute in securing coverage for Tyrvaya. As we previously announced on July 27, 2022, Tyrvaya is now covered by commercial prescription drug plans managed by the top three PBMs, GPOs in the country. As previously discussed, our market access team has been aiming to secure Medicare coverage determinations in 2023.\n\nThe company is currently in discussion with Medicare Part D plans, and to start, the company is now expecting Tyrvaya to have up to approximately 40% of Medicare Part D lives covered by Q4 2022, with approximately up to half of those lives to be covered as early as September 2022.  We're particularly excited about gaining access to Medicare Part D patients, given this patient group accounts for almost half of the U.S. dry eye prescriptions. We also expect that once Medicare coverage determinations are in place, this improved market access would open up another segment of prescription growth for Tyrvaya. Lastly, on market access, we've expanded our patient support programs to provide additional financial assistance to more eligible patients.\n\nThis includes patients who have prescription coverage with out-of-pocket cost over $150 for a 30-day supply or whose prescription insurance plans do not cover Tyrvaya as well as patients who have no prescription insurance. With our expanded patient support programs and increasing commercial coverage, we are committed to optimizing access to Tyrvaya for eligible patients. For more information about these programs, please visit the website at Tyrvaya-pro.com. With that, I will now turn the call over to Dan Lochner, Oyster Point's chief financial officer and chief business officer, to discuss our second quarter financial results.\n\nDan Lochner -- Chief Financial Officer and Chief Business Officer\n\nThank you, Mike. I will now provide a brief overview of Oyster Point Pharma's second quarter financial results. Additional details about our second quarter can be found in our Form 10-Q that was filed with the SEC this evening. For Q2 '22, Oyster Point Pharma reported a net loss of $49.9 million, compared to a net loss of $22 million for the same period in 2021.\n\nAs of June 30, 2022, cash and cash equivalents were $104.9 million, compared to $143.4 million as of March 31, 2022.  For Q2 '22, Tyrvaya achieved net product revenues of approximately $4.7 million, demonstrating strong quarterly performance, increasing 74% versus Q1 '22 following Tyrvaya's U.S. commercial launch in November 2021. As a reminder, the company did not generate any revenues during Q2 '21. Cost of product revenues for Q2 '22 was approximately $1.3 million and consisted of product royalty expenses, third-party manufacturing costs, reserves for inventory obsolescence and material costs.\n\nSales and marketing expenses for Q2 '22 increased by $21.9 million compared to the same period in 2021. The increase was primarily due to higher payroll-related expenses of $11.4 million, which was driven in part by the growth of the company's sales force since 2021. The increase in payroll-related expenses included an increase in severance expense of $1.4 million due to the reduction in force announced on June 28, 2022. Other sales and marketing expenses increased by $10.5 million for Q2 '22 compared to the same period in 2021, in connection with advertising, samples, trade shows, educational programs, patient services, payer access and other marketing efforts related to the commercialization of Tyrvaya.\n\nG&A expenses for Q2 '22 increased by $4.9 million, compared to the same period in 2021. The increase was primarily driven by additional payroll-related expenses of $3 million due to an increase in headcount to support the company's business operations. The increase in payroll-related expenses also included an increase in severance expense of $0.5 million due to the reduction in force announced on June 28, 2022. Other G&A expenses increased by $1.9 million in Q2 '22 compared to the same period in '21, related to accounting, public relations, legal, insurance, and other professional services, primarily driven by the company's transition from a clinical stage to a commercial stage company.\n\nR&D expense for Q2 '22 decreased by $2.1 million compared to the same period in 2021. The decrease was primarily due to lower expenses following FDA approval of Tyrvaya in October 2021. This was partially offset by an increase in severance expense of $0.6 million due to the reduction in force announced on June 28, 2022.  The company incurred interest expense in Q2 '22 of approximately $3.2 million related to the credit agreement with OrbiMed. Interest expense included contractual interest of $2.1 million as well as noncash expense of $1 million related to the amortization of loan commitments fees and accretion of long-term debt-related costs.\n\nThe company had no interest expense during Q2 '21. Other expense net for Q2 '22 was $3.4 million and consisted of $3.5 million change in the fair value of the net embedded derivative liability, which was recorded in connection with the credit agreement, partially offset by interest earned on money market funds. Other income net for Q2 '21 primarily consists of interest income earned on money market funds. With that overview of our financials, I will now turn the call back over to the operator to open the line for questions.\n\nOperator\n\n[Operator instructions]. Our first question comes from the line of Patrick Dolezal with LifeSci Capital. Your line is open.\n\nPatrick Dolezal -- LifeSci Capital -- Analyst\n\nHi. Thanks for taking the questions. So you mentioned that within prescribers who are writing Tyrvaya scripts, they're capturing about 20% of new-to-brand market share. Just curious for some color on the factors that you think are influencing this number over time.\n\nFor example, are there any simulations on contracting such as step through? And what's ultimately going to be key for you guys in activating the non-prescribing target physicians overtime?\n\nJeffrey Nau -- President and Chief Executive Officer\n\nYes. I'm going to have -- thanks, Patrick. That's a great question. We'll have Mike jump in on this one.\n\nI think one of the important data points that will drive that we're pretty proud of is about 40% of our actually from patients that have not tried branded eye therapies in the past. And so we think that, that's a really exciting metric that is helping that new brand number. But I think Mike can weigh in here and talk about some of the rest of your questions.\n\nMike Campbell -- Senior Vice President and Head of Commercial\n\nYes. Thank you for the question, Patrick. One of the business strategies we have about activating -- continuing to activate prescribers is really focused around the coverage. We obviously expect our commercial coverage to continue to grow, really excited about the opportunity with our Med D coverage that we announced today.\n\nWe're really bringing a whole new group of doctors into this mix to be able to activate them with Tyrvaya.\n\nPatrick Dolezal -- LifeSci Capital -- Analyst\n\nGot it. And I guess, one more for me. Just curious what level of direct-to-consumer marketing you're really incorporating into Tyrvaya launch presently? And if you could speak to just the relative importance of DTC as a marketing modality in the dry eye space generally. And then just curious if there are kind of cost-efficient ways that you're able to roll this out over time.\n\nMike Campbell -- Senior Vice President and Head of Commercial\n\nYes, great question. Obviously, direct-to-consumer advertising is a big part of our business strategy looking forward. You know this is a promotionally sensitive space. Really excited to get coverage in a place where more physicians have experience with Tyrvaya.\n\nWe believe that as we continue to grow this coverage, both commercial and Med D, we will have a base of physicians with experience with Tyrvaya that it makes a lot of sense to be able to invest in the direct-to-consumer campaign at some point. But there's no question that it's business strategy for both. And that would add that this has been something that we've talked about since the launch, which was a very smart campaign in order to go out and go to those consumers, whether that be on paid search or whether that've been through social media. And then as we grow coverage and we have both commercial and Medicare Part D, now we have the confidence to be able to go right to that consumer base and not about whether we're pushing patients through [Technical Difficulty] then would have no coverage or poor coverage.\n\nWe're getting very close to about the right time to do that. We're also being very [Technical Difficulty] as a company in the way we deploy our capital.\n\nPatrick Dolezal -- LifeSci Capital -- Analyst\n\nGreat. Thanks for taking the questions.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Ken Cacciatore with Cowen. Your line is open.\n\nKen Cacciatore -- Cowen and Company -- Analyst\n\nHey, team, a lot of really nice metrics you've given and good to see all the progress, and congratulations on the Part D. My question is, Mike, you took over kind of the leadership role. So I was just wondering if you gave us a lot of different components and things for us to think about. Can you talk about what was kind of priority one? Was there anything that you did different or wanted to press on when you assumed your position? Just give us a little bit of maybe where you thought you were lacking or where your point of focus.  And then also, just wondering if Dan could speak to where we think we're going with net value per Rx eventually.\n\nYou can answer it with where you think the gross to nets are going to go. I know we're making slow and steady progress and Part D being in place finalized will be fantastic. I'd love to hear that. And then also, Dan, maybe you can speak to the ability to maybe access nondilutive financing as you think about the go forward in the company and any progress on that front as well.\n\nMike Campbell -- Senior Vice President and Head of Commercial\n\nKen, those are great questions. I'm going to jump in there first, and we'll probably go maybe in reversal with the question. As we previously stated, Oyster Point is engaged with a number of potential partners, and we have positive momentum with our current licensing partner, Ji Xing, in Greater China. As our goal really to choose the best partner or partners to maximize that international value for Tyrvaya.\n\nThere's many regions in the world where Tyrvaya can be immediately commercialized. There are also large market opportunities such as Europe and Japan, where we believe there will be a need to conduct some additional clinical studies. That being said, we want to ensure that the partner or partners that we work with have the right combination of development and commercial acumen really successful to enter those various healthcare markets throughout the world. So we look forward to providing an update once we finalize our strategy on that front, and we see this as an opportunity to add to our current balance sheet.\n\nJeffrey Nau -- President and Chief Executive Officer\n\nAnd what I would say in addition to that is, obviously, on the finance side, we really look at the various upfront that these sorts of transactions could bring as well as doing an NPV of collaboration in general and then look at that market from a strategic value perspective. And so that's a lot of the work that's ongoing and part of our financing strategy going forward on the nonmotive side. So that's a very important part for us, and we're very focused on it. I would say, in addition to your question, we expect to continue to make progress on the gross to net.\n\nYou probably saw that in the quarter is a sequential growth. We expect some improvement for the remainder of the year based on the Q2 number that we put up today, and then expect a more notable improvement next year as the business transitions away from the [Technical Difficulty], and there'll be an inflection [Inaudible].\n\nMike Campbell -- Senior Vice President and Head of Commercial\n\nYes. And, Ken, thanks for the thoughtful question, actually. It's -- having been part of Oyster Point from the beginning -- prelaunch, it's been a lot of activity to really get established in the marketplace. I think priority one has been to make sure that we're continuing to invest in our resources.\n\nWe've got a lot of really good valuable resources here, and we feel really good about the talent of our sales organization and all of our field resources.  And secondly, what you heard, the market access and really the coverage has been a real focus of ours. We see that as a real upside for us moving forward.\n\nJeffrey Nau -- President and Chief Executive Officer\n\nAnd I would say just in general as well, we're quite happy with the 74% sequential revenue growth in the quarter versus Q1, and we believe that entry into Medicare Part D will be an important inflection point for the business with regard to not only just prescribers, but also TRx.\n\nKen Cacciatore -- Cowen and Company -- Analyst\n\nThanks so much. Congrats on all the progress.\n\nOperator\n\nThank you. Please standby for our next question. Our next question comes from the line of Joe Catanzaro from Piper Sandler. Your line is open.\n\nJoe Catanzaro -- Piper Sandler -- Analyst\n\nHey, guys. Thanks so much for taking my questions here. Maybe one -- first one following up on the Medicare Part D potential coming in early September 4Q. Just wondering what the underlying drivers there of that timeline moving forward for an event.\n\nI think it was originally in early 2023. And then maybe following up related to that on gross net whether -- if that does occur, we should expect an impact from that on gross to net at the end of the year. And maybe I have a follow-up.\n\nJeffrey Nau -- President and Chief Executive Officer\n\nGreat. Well, thanks, Joe. I think from the Medicare Part D side, obviously, one of the things that's really an important attribute of Tyrvaya is really think that this is a product that is really foundational therapy for patients with dry eye disease. And in particular, as you probably know, the disease is related to age.\n\nIt's related to women going through menopause. We really think that this is going to be an important therapy for patients that are in that Medicare category.  As we engage with payers, both on the clinics and medical side as well as on the financial side, patients that are in that Medicare category -- As we engage with payers, both on the clinics and medical side as well as on the financial side, I think the team has done a great job in really having discussions and just how important this therapy is for this group of patients. So there's obviously a number of [Technical Difficulty] in the marketplace that have occurred over the course of the year, including generic entry. But I do really think that this early program also has something to do with the differentiated profile of the product and really what it brings to this older population of patients.\n\nMike Campbell -- Senior Vice President and Head of Commercial\n\nAnd then to your question, Joe, I'd say, the response [Inaudible] would still be quite consistent here. Our financial model incorporates all this additional access consideration for Medicare Part D, including base structure and the fully loaded [Technical Difficulty] to GTN. And so reiterating kind of the same response to Ken, which is that we expect the net unit price to continue to steadily grow sequentially based on Q2 number. And then with the sunsetting of [Inaudible], there will be a more material impact to bridge in a positive way for '23.\n\nJoe Catanzaro -- Piper Sandler -- Analyst\n\nOK. Got it. That's helpful. And then maybe just one quick follow-up.\n\nJust wondering if there's a milestone associated with Ji Xing initiating that phase 3. And if not, when is the next associated milestone potentially from that collaboration?\n\nJeffrey Nau -- President and Chief Executive Officer\n\nYes. Under that collaboration, then there isn't a milestone related to the initiation, but it's more tied to the approval in that jurisdiction.\n\nJoe Catanzaro -- Piper Sandler -- Analyst\n\nOK. Got it. Thanks for taking my questions.\n\nOperator\n\nThank you. [Operator instructions]. Please standby for our next question. Our next question comes from the line of Daniil Gataulin with Chardan.\n\nYour line is open.\n\nDaniil Gataulin -- Chardan Capital -- Analyst\n\nHello. Thank you for taking the question. I have one with respect to the streamlining plan that you announced recently. Does your opex guidance account for potential launch of OC-01 clinical trials in NK potential next year?\n\nJeffrey Nau -- President and Chief Executive Officer\n\nYes. Thanks, Daniel. That's a great question. So with the announcement of the streamlining plan, we have continued our development of our gene therapy platform.\n\nSo both OC-101 and OC-103. As we think through next year, as we stated in the prepared remarks, we will have a feedback from the FDA from our pre-IND meeting request very shortly. So we would expect that this month. And then 2022  really will look like all of the IND-enabling studies, and then we would expect at some point in time in 2024 to go into first in human, although, obviously, that has some bearing on some of the feedback that we may receive from the FDA.\n\nSo surely, we'll have more clarity on what those IND-enabling studies look like, but that's our thoughts at the moment and that restructure will not impact that program.\n\nOperator\n\nThank you. I'm showing no further questions in the queue. I would now like to turn the call back over to Dr. Nau for closing remarks.\n\nJeffrey Nau -- President and Chief Executive Officer\n\nGreat. Thank you, Operator, and thanks to all of you for joining the call today. In closing, we are pleased with performance during the second quarter, including the progress made in commercializing Tyrvaya, expanding group of patients and develop potentially transformative ocular disease therapies. We are particularly encouraged by the overwhelmingly positive feedback from patients and eye care professionals and remain excited about the potential for Tyrvaya to continue reshaping dry eye disease treatment.\n\nI want to thank everybody for joining us today, and have a great evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nArty Ahmed -- Vice President, Investor Relations\n\nJeffrey Nau -- President and Chief Executive Officer\n\nMike Campbell -- Senior Vice President and Head of Commercial\n\nDan Lochner -- Chief Financial Officer and Chief Business Officer\n\nPatrick Dolezal -- LifeSci Capital -- Analyst\n\nKen Cacciatore -- Cowen and Company -- Analyst\n\nJoe Catanzaro -- Piper Sandler -- Analyst\n\nDaniil Gataulin -- Chardan Capital -- Analyst\n\nMore OYST analysis\n\nAll earnings call transcripts"
}