{
  "companyName": "Amphastar Pharmaceuticals",
  "companyTicker": "AMPH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/amphastar-pharmaceuticals-amph-q2-2022-earnings-ca/",
  "content": "Amphastar Pharmaceuticals (AMPH -1.02%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Amphastar Pharmaceuticals second-quarter earnings call. [Operator instructions] Please note that certain statements made on this call regarding matters that are not historical facts, including, but not limited to, management's outlook or predictions for future periods are forward-looking statements. These statements are based solely on information that is available to us. We encourage you to review the section entitled Forward-Looking Statements in the press release issued today and the presentation on the company's website.\n\nAlso, please refer to our SEC filings, which can be found on our website and the SEC's website, for a discussion of numerous factors that may impact our future performance. We will also discuss certain non-GAAP measures. Important information on our use of these measures and reconciliations to U.S. GAAP may be found in our earnings release.\n\nPlease note that this conference call is being recorded. Our speakers today are Mr. Bill Peters, CFO; Mr. Dan Dischner, VP of corporate communications; and Mr.\n\nTony Marrs, SVP of regulatory affairs and clinical operations. I will now turn the conference over to your host, Mr. Dan Dischner, vice president of corporate communications. Dan, you may begin.\n\nDan Dischner -- Vice President, Corporate Communications\n\nThank you, Paul. I'd like to thank everyone for joining us for our second-quarter earnings call for 2022. We believe we made great strides in the first half of 2022 toward portfolio diversification with approvals while driving our existing portfolio revenue growth. We look forward to discussing the specifics behind the quarter's commercial success and our regulatory developments.\n\nOn the call with me today are Bill Peters, CFO and executive vice president of finance; and Senior Vice President of Regulatory Affairs and Clinical Operations Tony Marrs. Following the prepared remarks from management, we'll open up for Q&A. I will first discuss our financial and commercial strengths, supported by our portfolio that remains strong [Inaudible] changing volatile market landscape. The second quarter saw net revenues of $123.5 million, representing a solid 21% increase compared to Q2 2021, with a significant increase in net income.\n\nOur existing products have again provided a solid baseline [Inaudible] the strength. Primatene Mist sales recorded solid revenues, representing a 14% increase over the same period in 2021. Our existing IMS product sales recorded strong revenues, validating our planned increased capacity designed to meet the increased market demand our competitors remain troubled in supporting. We remain confident that our current capacity will meet the increased demand for our products even if competitor shortages remain for an extended period.\n\nWe believe that demand for our IMS products will remain robust into the second half of 2022. Glucagon remains a valued asset in our portfolio as the only FDA-approved generic as the product continues to have strong sales. Looking to Q3, we look forward to our ganirelix product which will see a full quarter of sales as the product was launched late in June, and we are excited about the imminent launch of our vasopressin product this month. Regarding our regulatory efforts, I would like to bring our discussion toward our AMP-002 ANDA filing, to which we received a CRL last month.\n\nWe believe the issues raised are addressable and will be fully responded to this quarter. Therefore, we anticipate the GDUFA action date for this filing in the first quarter of 2022. While this news is certainly not one we would have liked to receive, we remain confident with AMP-002's future commercial prospects as it remains without any generic. We aim to work closely with the FDA to make this [Inaudible] first generic available to the market and patients as quickly as possible.\n\nTo our AMP-015 ANDA filing, teriparatide, and the CRL received in June, we anticipate filing our response in the fourth quarter this year. Likewise, we remain confident that the inquiries made for this filing are entirely achievable. I think it's important to remember that these products are highly complex, remain without any generics and are in line with Amphastar's business model [Inaudible] challenging to develop products and hopes of increasing patient access to these high-in-demand products while benefiting from its difficulty as it creates market sustainability, insulating our portfolio from substantial price erosion and product sales life cycles that occur with traditional generic products. We remain committed to the pursuit of approvals for these two ANDAs.\n\nOn our AMP-008 ANDA, our first ANDA inhalation filing, it's important to point out that this filing received priority review by the FDA. AMP-008's development remains positive with a positive mid-cycle review received and conducted last quarter. All of the clinical site inspections that have been performed were completed without observation. This maintains our confidence [Inaudible] and AMP-008 remains on track for a fourth quarter GDUFA date.\n\nWhile I'm on the topic of our inhalation pipeline, I'm excited to announce that another inhalation pipeline candidate has progressed and is anticipated to be filed by Q1 2023. This is our AMP-007 product. This represents two of our five announced yet undisclosed inhalation ANDAs as seen in our updated corporate presentation representing over an $8 billion market opportunity in combined IQVIA sales. As for our proprietary products in development, we continue to make progress on our intranasal naloxone response, which we expect to be filed this month.\n\nSpeaking briefly on this product, we continue to believe that there is a community need for intranasal naloxone and a healthy supply continues to be part of our nation's strategy, combined with several state and local strategies for combating the opioid abuse epidemic. As for intranasal epinephrine, another proprietary product representing a potential plus $1 billion market opportunity, the pipeline candidate continues to progress well within several studies and discussions with the agency. We anticipate intranasal epinephrine to be on track to be filed in 2023 as planned. And finally, turning to our biosimilar pipeline as one of our three-pronged strategy, our diabetes portfolio with our insulin candidates aiming to all achieve interchangeable designation, we continue to see positive development on the front and an increasingly constructive and encouraging regulatory landscape that supports biosimilar interchangeable designation.\n\nWe are seeing more biologic products achieve interchangeable status, which is generally encouraging. It supports our strategy and shows the FDA's willingness to provide approval to different scientifically logical approved pathways. We remain confident that the insulin market remains robust. At the same time, our extensive complex molecular development experience, most notably our proven sophisticated characterization technology and achievements in highly purified peptides, along with an in-house developed API platform, supports a full-scale launch pending approval as we continue to invest in R&D.\n\nWe are excited to announce that we plan to file our first BLA for an interchangeable insulin product, AMP-004, in 2023. Again, I'd like to reiterate that while our pipeline remains challenging in pursuing difficult-to-develop products, it is made with a deliberate purpose supported by extensive thought and research investments and self-funding. As proven with our current product portfolio, we continue to be supported by complex products that serve as a solid support base for the further development of complex proprietary and biosimilar candidates. We foresee this three-pronged strategy as an enduring stronghold for the company, backed by our commitment toward quality and high purified products as all of our finished products continue and will remain to produce in the United States.\n\nLikewise, with current volatile market landscapes that seemingly will persist for some time, we see this U.S.-focused strategy as increasingly beneficial and advantageous to the company as a long-term driver for further sustainability within our business model and the commercialization of our portfolio. As we have seen with previous approvals and launches, such as the impressive execution on Primatene Mist, epinephrine and glucagon, all of which were exampled in recent quarters in driving growth while being supplemented with our high-in-demand IMS products, we are confident that challenges met to approvals remain within the company's reach to overcome. I would like to turn the call to our CFO and executive vice president of finance, Bill Peters, to discuss the second quarter's financial results and give further details behind this quarter's commercial success.\n\nBill Peters -- Chief Financial Officer\n\nThanks, Dan. We're just going to pause here a second because I think there's some beeping around. Let's see if we can solve this a second. [Technical difficulty]\n\nOperator\n\nThank you, everyone, for your patience. One moment as we deal with this technical difficulty.\n\nBill Peters -- Chief Financial Officer\n\nThank you very much. Sorry about that annoying beeping that was going on before. I'm not sure exactly what happened there. But turning back to our planned call.\n\nSales for the second quarter increased 21% to $123.5 million from $101.7 million in the previous year's period. Primatene Mist continues to show strong growth, compared to the second quarter of last year with sales up 14% to $19 million from $16.7 million due to increased marketing efforts. Strong sales of epinephrine marked the biggest increase totaling $18.1 million, nearly double the prior year's $9.2 million due to strong unit volume. Lidocaine sales increased to $16 million from $11.6 million on strong unit growth.\n\nPhytonadione sales increased to $13.4 million from $10.4 million in the second quarter of last year due to increased volumes at higher average selling prices. Our other finished pharmaceutical product category also had strong growth due to products such as dextrose and sodium bicarbonate, which benefited from market shortages as well as the launch of our ganirelix prefilled syringe in late June. Our insulin API business had sales of $3.3 million, down from $6.9 million in the prior year primarily due to the timing of shipments. As we've discussed in the past, the products we've launched in the last few years, including Primatene Mist, epinephrine multi-dose vials, and glucagon, have higher margins than our corporate average.\n\nThat trend continued this quarter with gross margin increasing to 51% of sales in the second quarter of 2022 from 47% of sales in the same quarter last year. We also had the benefit of fewer purchase commitments for heparin and enoxaparin components which are reserved at the lower of cost or net realizable value at the time of commitment. Selling, distribution, and marketing expenses increased $5.8 million from $4.1 million primarily due to increased advertising of Primatene Mist and increased freight expenses. General and administrative spending decreased to $10 million from $14.6 million primarily because of a decrease in legal expenses and a decrease in expenses in China due to the restructuring of our ANP subsidiary in 2021.\n\nResearch and development expenditures increased to $22.8 million from 2022 from $18.1 million last year as we made significant purchases of raw materials and components for our AMP-018 and insulin pipeline products. Other income expense flipped to a $1.5 million expense from an income of $3.6 million due to currency fluctuations this year as opposed to a gain associated with lowering the litigation accrual for our lawsuit with Aventis, which we booked in the second quarter of last year. The company reported net income attributable to Amphastar shareholders of $17.3 million or $0.33 per share in the second quarter, compared to a net income of $7.8 million or $0.16 per share in the second quarter of 2021. The company reported an adjusted net income of $20.7 million or $0.39 per share, compared to an adjusted net income of $10.6 million or $0.21 per share in the second quarter of last year.\n\nAdjusted earnings exclude amortization, equity compensation, impairment of long-lived assets, and onetime events. In the second quarter, cash flow provided by operations was $2.8 million. And year to date, it was $53.6 million. We used a portion of our cash to repurchase $6.1 million of stock during the quarter.\n\nI will now turn the call back over to the operator to begin Q&A.\n\nOperator\n\n[Operator instructions] Our first question is from Tim Chiang with Capital One.\n\nTim Chiang -- Capital One Securities -- Analyst\n\nBill, could you just comment on the high gross margins this quarter? I know you talked about it, but do you think a 51% gross margin is sustainable in the back half of this year?And my follow-up question is on AMP-002. I think you said that your plan is to try to refile that in the first quarter of next year. When do you think you could get a response from the FDA? Would that be sometime in the back half of '23?\n\nBill Peters -- Chief Financial Officer\n\nYes. Thanks, Tim. So I think the better way to look at the gross margins is not just taking a look at this one quarter, but rather taking a look at the 6-month number instead. And so our six-month gross margin was 49%.\n\nSo I think that's a better way to look at it because there were certain onetime events or certain events related to the commitments that we mentioned on the heparin and the enoxaparin components, which hit higher in the first quarter than in the second quarter. So those skewed results a little lower in the first and a little higher in the second. So that six-month number is I think the right way to look at it. And as far as your second question goes --\n\nDan Dischner -- Vice President, Corporate Communications\n\nYes, Tim. Do you want me to do it? Yes. AMP-002, we're going to respond this quarter with an action date. We anticipate an action date in Q1 of next year 2023.\n\nTim Chiang -- Capital One Securities -- Analyst\n\nI see. I see. So it should be a pretty quick response. And I guess it wasn't a major or it wasn't major items in the CRL.\n\nIs that right?\n\nBill Peters -- Chief Financial Officer\n\nTony, do you want to handle that?\n\nTony Marrs -- Senior Vice President of Regulatory Affairs and Clinical Operations\n\nYes. It's not something that's going to take us a long time to respond to. So we don't view it as a complex issue that is quite a long time to respond to.\n\nOperator\n\nOur next question is from Elliot Wilbur with Raymond James.\n\nElliot Wilbur -- Raymond James -- Analyst\n\nFirst question for Bill. Just looking at a couple of the individual products and performance of the quarter, specifically lidocaine, epinephrine. I know you mentioned strong unit sales, but the numbers are just kind of so far above historical levels and baseline. Maybe you could just elaborate a little bit more in terms of what is driving the strength, just an expansion in overall utilization of the molecule itself or you're gaining share vis-a-vis competitor.\n\nWas their pricing involved there at all? And then second question is, with respect to your intranasal epinephrine program, company recently emerged from, I guess, semi-stealth mode, ARS, or has a competing product, a potentially competing product that they're looking to file this year. Just wondering if you have any thoughts on that as a competitive product looking to do essentially the same thing. I'm assuming you're not thinking that the competitive profile of that product is so superior that would stop you from developing your own asset, but just anything that you could share with respect to view on that potential competitor would be helpful.\n\nBill Peters -- Chief Financial Officer\n\nYes. I'll start with the question about epinephrine and lidocaine. Epinephrine was just volume. And a lot of that is because of shortages from the competitors that we have on that product.\n\nLidocaine was almost all volumes, a little bit of pricing. We did take a price on 1 of the SKUs there, but there's a half a dozen different SKUs that we sell in that area. And also, lidocaine also got a little bit of a boost this quarter, too, as we had been back-ordering some of the lidocaine products in the previous quarter due to some supplier issues. But we got that out of the way during the quarter.\n\nAnd then as far as the epi product, we're very confident in that product and we're very excited about that product. I think we have an excellent product that works very well. And we have been -- we're aware of ARS' product, and I'm not really sure we want to say much else about their product this time.\n\nDan Dischner -- Vice President, Corporate Communications\n\nNo. We just continue to execute our strategy because we do believe we have a great product that is targeting a large market. And yes, we're very confident with ours and we're continuing to develop it regardless of what ARS is doing.\n\nOperator\n\nOur next question is from Serge Belanger with Needham & Company.\n\nSerge Belanger -- Needham and Company -- Analyst\n\nA couple of questions on AMP-008. I know you haven't provided much details around this program probably by design. But as we get closer to this 4Q GDUFA, can you maybe talk a little more about the market opportunity it could address? And secondly, since it's your first inhalation product in front of the FDA, what is your confidence for first-round approval? I guess if you can talk maybe about the complexity of it and whether that will play a role around the PDUFA decision.\n\nDan Dischner -- Vice President, Corporate Communications\n\nYes. Yes. I think as we get closer to it, I think we are going to play our cards a little closer to our vest on the market opportunity because this is when we think it could really affect the marketing prospects of the product. So we're probably not going to discuss too much on the market opportunity.\n\nOn your second part of your question, Tony, do you want to give a little more detail around that?\n\nTony Marrs -- Senior Vice President of Regulatory Affairs and Clinical Operations\n\nYes. For us, it's an exciting product. The agency has been very, very positive [Inaudible] when we look at all the aspects and all of the interaction that we've had with the agency from a mid-cycle review meeting, from them putting a priority review of products and the number of inspections, timing of the inspections for our clinical side, all of it has been very positive. Of course, first cycle approvals are always something that we strive for and we're prepared for.\n\nAnd for a product that is combination product of this nature, it provides a little more complexity, but we're very positive about it and all of our interaction with the agency seems to be aligned with that as well.\n\nOperator\n\n[Operator instructions] Our next question is from David Amsellem with Piper Sandler.\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nSo I just had a few. So first, on that impression, just given the competitive dynamics, it's a fairly crowded market. Can you just talk about the extent to which you think that's going to be a meaningful driver in the back half of the year? That's number one. Number two, I apologize if I missed this, but on 007, which you're planning to file in the first quarter, can you say if that is going to be a Paragraph 4 or something else? And are you willing to identify what the -- how large the underlying brand sales are for that product? And then just back to 002, just with -- this is a multi-cycle review, no surprise, complex product, all that, but are you still expecting it to be first to market and limited competition or no competition opportunity? I just wanted to get an update on your latest thoughts there.\n\nDan Dischner -- Vice President, Corporate Communications\n\nYes. David, on vasopressin, I think as you know, it wasn't a product that we really targeted, though it is a peptide and we are making our own API in the products -- along with this product. So it kind of is something that -- it's a good product for us, but it wasn't -- it doesn't necessarily 100% fit into our business model. Yes, I think, as you know, the market is crowded and it could get even more crowded, but I think we'll fit ourselves in and do the best we can with that product, and it will have some revenue for us.\n\nOn AMP -- was it 007, that was your next question about whether -- yes, at this time, we haven't disclosed whether it's a Paragraph 4 filing or any of the market data behind it for competitive reasons. And I think we're going to keep it at that at this time. As for AMP-002, yes, as I mentioned in my prepared remarks, it still remains without any generic competition. So we're still very excited about it.\n\nWe think it still has a great opportunity for us. As I said, this was -- the CRL wasn't the outcome we were looking for, but it's understandable as a complex generic. There are different questions that come up and we feel we can address them, and we'll do it in the fourth quarter of this year -- in the next month, I guess. And then we'll have -- we're anticipating an action date in the first quarter of next year 2023.\n\nBill Peters -- Chief Financial Officer\n\nYes. It's not just a complex product. I think the other issue is that it's the first approval of a complex product. And I think sometimes there's extra work that the FDA has to do around that when there's not a clear pathway going into the approval process.\n\nSo I think that that has a lot to do with it.\n\nOperator\n\nThank you. There are no further questions at this time. I'd like to turn the floor back over to management for any closing comments.\n\nDan Dischner -- Vice President, Corporate Communications\n\nGreat. Thanks again, Paul, and thank you all very much for joining us today. We appreciate it, and we look forward to updating you on our progress next quarter. As always, if you have any questions, please don't hesitate to contact us as those questions arrive.\n\nAnd again, thank you for your time today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDan Dischner -- Vice President, Corporate Communications\n\nBill Peters -- Chief Financial Officer\n\nTim Chiang -- Capital One Securities -- Analyst\n\nTony Marrs -- Senior Vice President of Regulatory Affairs and Clinical Operations\n\nElliot Wilbur -- Raymond James -- Analyst\n\nSerge Belanger -- Needham and Company -- Analyst\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nMore AMPH analysis\n\nAll earnings call transcripts"
}