{
  "companyName": "Velodyne Lidar, Inc.",
  "companyTicker": "VLDR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/velodyne-lidar-inc-vldr-q2-2022-earnings-call-tran/",
  "content": "Velodyne Lidar, Inc. (VLDR -3.96%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Velodyne Lidar second quarter 2022 financial results call. All participants will be in listen-only mode. Please also note today's event is being recorded for replay purposes. [Operator instructions] At this time, I would like to turn the conference over to Mr.\n\nJim Fanucchi of Darrow Associates. Sir, please go ahead.\n\nJim Fanucchi -- Investor Relations\n\nThank you, operator. Good afternoon, everyone, and thank you for joining us. With me today on the call today, are Dr. Ted Tewksbury, Velodyne's chief executive officer; and Mark Weinswig, chief financial officer.\n\nOn today's call, we will discuss Velodyne's second-quarter financial results and provide an outlook for the third quarter. Shortly after the market closed today, Velodyne issued a press release announcing its second quarter 2022 financial results. Velodyne also published an investor presentation, and you may access these documents in the Investor Relations section of velodynelidar.com. Today's discussion includes forward-looking statements.\n\nPlease refer to our press release and our SEC filings, including our most recent 10-K and 10-Q for a discussion of factors that could cause the company's actual results to differ materially from these forward-looking statements. Please also note, unless otherwise stated, all results and projections discussed in this call are non-GAAP. Management provides non-GAAP metrics because it uses them for budget-planning purposes and for making operational and financial decisions and believes that providing these non-GAAP financial measures to investors as a supplement to GAAP financial measures, help investors evaluate Velodyne's core operating and financial performance and business trends consistent with how management evaluates such performance and trends. In addition, management believes these measures facilitate comparisons with the core operating and financial results and business trends of competitors and other companies.\n\nA full description and reconciliation of these non-GAAP measures versus GAAP is included in the company's press release issued today. Now, I'd like to turn the call over to Dr. Ted Tewksbury.\n\nTed Tewksbury -- Chief Executive Officer\n\nThanks, Jim, and thank you all for joining us today. Our second quarter of 2022 was one of solid execution in the face of continuing supply chain headwinds. Billings of $12.5 million and revenue of $11.5 million, both came in within our guidance range for the second consecutive quarter. Demand for our products remained robust.\n\nAnd thanks to the tireless efforts of our team, we were able to procure adequate quantities of critical components to meet the majority of our customers' requirements. I'd now like to share more about our second quarter business results, provide an update on the status of our transformation and discuss our outlook for Q3. Mark will then review the financial results in greater detail. Velodyne continues to be one of the most diversified suppliers of lidar solutions with superior performance, power efficiency, and reliability as differentiators across key industries.\n\nIn Q2, we saw increased customer traction across all three of our target markets; industrial and robotics, intelligent infrastructure, and autonomous vehicles, roughly half our sensors shipped into the industrial, robotics, and infrastructure markets. Within Industrial and robotics, our lidar-based solutions are being used across an increasingly diverse set of applications, including last-mile delivery robots, truck docks, cargo handling, and shipping. In the infrastructure, use cases include traffic systems, vehicle-to-infrastructure networks, and security, space, and asset monitoring. Lastly, we are seeing demand for our solutions in virtual and augmented reality applications such as mapping, entertainment, and online interactions.\n\nThe other 50% of units shipped in the quarter were for L4 and L5 robo taxi and autonomous shuttle customers who depend on Velodyne's sensors to power their systems. During the quarter, we also expanded our customer reach with several new multi-year agreements. We signed a sales agreement with Boston Dynamics, a global robotics market leader. They selected Velodyne's high-performance sensors to enhance and extend the capabilities of their mobile autonomous robots.\n\nOur Intelligent Infrastructure Solution or IIS was deployed in Helsinki, Finland for traffic flow monitoring at multiple intersections to improve safety. Along with delivering multimodal traffic counting and classification, our IIS demonstrated its efficacy in detecting near-miss collision situations such as running red lights and jaywalking. This proliferation of nonautomotive use cases validates our thesis that the first wave of commercial lidar adoption will be dominated by industrial automation, robotics, and intelligent infrastructure. According to research firm, Yole, these segments are estimated to be a $2.8 billion per year total available market by 2026.\n\nAs I enter my third full quarter as CEO of Velodyne, I continue to be pleased with the progress we've made on the turnaround plan I announced in the February earnings call. To highlight just a few examples, we accelerated the outsourcing of manufacturing to our low-cost contract manufacturer in Thailand with completion targeted for next year. This transition will significantly advance our efficiency in operations, allowing us to increase capacity, improve yields, reduce costs, and expand gross margins. We reprioritized and rationalized products in development by deploying our valuable technical resources on opportunities with attractive returns on investment and high contribution margins.\n\nThis process led to the discontinuation of some products in development, including the Velarray H800. We defined our next-generation product road maps, encompassing highly differentiated sensors, software, and solutions that we expect to be introduced over the next 18 to 24 months. Recently, we've implemented other changes that will enhance Velodyne's governance and leadership, including the appointment of Mark Weinswig as our new Chief Financial Officer, the addition of seasoned and highly experienced new board members that will help management take the company to the next level and the redistribution of stock ownership, including a dramatic reduction in founder ownership. From day one, I have emphasized the priority of scaling lidar into a profitable growing business, delivering attractive shareholder returns.\n\nI discussed our strategy in detail in the past two earnings calls. And while it will take time to execute fully, we are making progress every day. As we look forward to the remainder of 2022 and 2023, we are taking steps to align our expense structure with our revenue expectations. In parallel, we will continue to invest in strategic, differentiated, high ROI product categories that are essential to our long-term growth.\n\nThese actions are designed to deliver industry-leading smart vision solutions to our customers while accelerating time to breakeven. Before handing the call over to Mark, I want to offer some commentary around our guidance for the third quarter. We entered the third quarter with robust demand. However, based on information from our suppliers, we expect supply challenges will extend into 2023, making it difficult for us to fully support all of this demand.\n\nOur efforts to modify our sensors to utilize alternative sources is on track and will help us to partially mitigate these supply chain risks. Combining all of these factors, we expect billings to be between $10 million and $12 million and revenue to be between $8 million and $11 million. The difference between billings and revenue is due to estimated noncash contra revenue related to the Amazon warrants. Our cost reduction initiatives, including the expanded use of outsourced manufacturers, improvements in operating efficiencies, and the growth of offshore design center capabilities will deliver incremental improvements in the third quarter of 2022 with the full benefit expected to be realized in the second half of 2023.\n\nWith that, it is my pleasure to welcome Mark to this call.\n\nMark Weinswig -- Chief Financial Officer\n\nThank you, Ted. Good afternoon, everyone. I'm very excited about joining the Velodyne team during this pivotal time, and I look forward to contributing to the next stage of Velodyne's evolution. During my initial time with the company, I worked closely with the executive and finance teams to analyze opportunities to improve our results.\n\nI believe there is room for significant improvement in our operating efficiencies. We have a healthy balance sheet with approximately $230 million in cash and equivalents, providing us with the capital to execute on our strategic plan. I want to echo Ted's earlier comments that we would take the steps needed to reduce our cost structure and focus on profitable revenue growth in order to reach the goal of cash breakeven. Now, turning to our Q2 financial results.\n\nTotal revenue was $11.5 million and included an approximately $1 million noncash impact from the Amazon warrant accounting. Total product revenue was $9.7 million. This compares with $4.4 million in the first quarter. In the first quarter, the accounting for the Amazon warrants had a noncash impact of $5.3 million on our revenue.\n\nLicense and service revenue was $1.9 million, compared with $1.8 million in the first quarter. Billings were $12.5 million, compared with billings of $11.5 million in Q1. Billings while up were impacted by the continued supply chain constraints. GAAP gross loss was $7.1 million.\n\nThis compares with $9.3 million in the first quarter. The second quarter was impacted by $2.2 million in losses from the discontinuation of a product line, as Ted discussed previously. Non-GAAP gross loss was $4.2 million. This compares with a gross loss of $8.8 million in the prior quarter.\n\nGAAP operating expenses were $37.5 million, compared with $39.6 million in Q1. Non-GAAP operating expenses were $31.8 million, compared with $35.1 million in the prior quarter. Lower expenses were partially driven by cost containment strategies implemented during the quarter. I look forward to discussing more of our progress in future quarters.\n\nGAAP net loss was $44.3 million or $0.22 per share and compares with $49.1 million or $0.25 per share in the prior quarter. Non-GAAP net loss was $35.7 million or $0.18 per share, compared with $44 million or $0.22 per share in the first quarter. Finally, moving on to the balance sheet. With approximately $230 million in cash and investments at the end of the quarter, our capital and liquidity remains healthy.\n\nAs we move through the year, I look forward to discussing the progress we are making in improving our financial performance as we balance the need to develop new products and invest in long-term growth, while streamlining our operations to reduce our cash burn. With that, I'll turn the call back to Ted.\n\nTed Tewksbury -- Chief Executive Officer\n\nThank you, Mark. Every day, we see exciting new examples of lidar being used to make our communities safer, our supply chains more efficient, and our planet greener. With over 73,000 of our lidar sensors shipped to date into our three target markets; industrial and robotics, intelligent infrastructure, and automotive, Velodyne is leading the way. We are working intensely to bring our next-generation products to market and expand our solutions into new industries and applications.\n\nQ2 was a quarter of progress, however, we know there is much more to do. We have completed a top to bottom analysis of the business and are investing in new programs to deliver the highest return on investment, while simultaneously implementing cost reductions to accelerate our time to breakeven. We believe our strong balance sheet provides us with the capital we need to execute these plans. In closing, I want to thank our stakeholders, including investors, customers, and suppliers for their continued support.\n\nAnd most of all, I want to thank the Velodyne team for their hard work in helping us to achieve our goals. Operator, we will now open the call to questions.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] The first question comes from Raji Gill with Needham and Company. Please go ahead.\n\nRaji Gill -- Needham and Company -- Analyst\n\nYeah. Thank you for taking my questions. I appreciate it. I just wanted to get a little more clarity on the supply chain issues.\n\nLast quarter, the supply chain issues were pushing your sensor ASPs higher, and the units were lower because of higher component costs and that increased your pricing power. Wondering how you're thinking about pricing trends for the remainder of 2022 because of those underlying components, the increasing cost of those components? And how do we expect those costs to trend into 2023?\n\nTed Tewksbury -- Chief Executive Officer\n\nYeah. Thanks for the question, Raji. First of all, maybe I can just provide a little bit of background on the supply chain because there's really two separate components here. The first being the company's specific component with respect to our specific FPGAs.\n\nAs you're aware, some of those were nearing end of life and we had to replace them and went through a design retrofit procedure to do that. That is on track and is scheduled to be complete by the end of this year. The second component is really the macro supply constraint issues that everybody is seeing across the industry. And we don't have a great deal of visibility into when those will subside, but a lot of our suppliers are saying that the macro supply constraints could last into 2023.\n\nSo, what's happening here is that we are in the process of doing those redesigns. We expect those to be completed by the end of this year. And once that's done, we expect to get into the more normal macroeconomic determine pricing environment. In the meantime, as we scramble to procure scarce components, we do expect that ASPs could continue to go up in order to offset the increased price of components.\n\nBut again, once we get into 2023 and we have those new designs, we expect that they will start to come back down.\n\nRaji Gill -- Needham and Company -- Analyst\n\nAppreciate it. For my follow-up, Ted, you mentioned when you joined the company that priority No. 1 was to ramp lidar adoption in the industrial robotics market, while at the same time lower the cost for lidar for the passenger vehicles, I believe you'd mentioned kind of below $30. So, it seems like you're making a lot of progress on lidar adoption in kind of industrial robotics.\n\nI'm curious, where are we with passenger vehicles? I know that's about a third or so of the volume. But have you got the ASPs, or do you have line of sight where you think the ASPs could go based on your kind of current cost structure? And just maybe touch a little bit upon what you're seeing on the industrial side as well? Thank you.\n\nTed Tewksbury -- Chief Executive Officer\n\nYeah. We're getting really good traction in the industrial and robotics and intelligent infrastructure markets with the product portfolio that we have today. And we're really seeding that market across an enormously broad range of applications, some of which I discussed in the prepared remarks. So, as those designs start to go to production, we expect to see an inflection point where revenue will start to grow in the next one or two years in industrial robotics and infrastructure.\n\nAs far as automotive is concerned, as you know, there are two segments there. There's the autonomous vehicles where there's a very good product market fit with the products that we already have. And as you saw, 50% of our revenue in the second quarter came from the AV segment, specifically robo taxis and autonomous shuttles. Those are primarily prototype designs and are still some years away from full production.\n\nBut when they happen, Velodyne will be there. With respect to passenger vehicles, as we've talked about in past calls, our discussions with OEMs and Tier 1s in the automotive industry and we've talked to all of them. The feedback has been loud and clear that prices have to come down below $500, preferably in the $300 to $400 range. And we have designs in progress right now that we expect to be ready for production when those markets materialize, which is probably still two or three years away.\n\nRaji Gill -- Needham and Company -- Analyst\n\nThank you.\n\nOperator\n\n[Operator instructions] The next question comes from Colin Rusch with Oppenheimer. Please go ahead.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThanks so much, guys. You know, within the industrials market, can you talk about the diversity of applications that you're in right now and how that's changing, including how many are going on indoor versus outdoor applications? Thanks.\n\nTed Tewksbury -- Chief Executive Officer\n\nThanks, Colin, for the question. There's really an enormous number of applications. As far as outdoor applications, we're seeing outdoor space monitoring, in parking lots and stadiums, community spaces. Our IIS solution, for example, is a great solution to monitor the safety of public spaces, as well as intersections and traffic systems to monitor traffic, make traffic flows more efficient, and also reduce congestion, greenhouse gases, and all that good stuff.\n\nIn addition, we see Sidewalk delivery applications, truck docks, the applications are immense and it seems that they're growing every day. We continue to see mapping applications. We talked about defense at the last earnings call with the design win at Kinetic. We see applications in agriculture, in mining, sending lidar into hazardous locations where people don't want to go.\n\nSo, that's just a quick few examples for outdoor applications. And then indoors, warehouses are the big ones. And then many others as well, including data centers, fulfillment centers, procurement centers the -- there's just an enormous range of applications in industrial and robotics.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nOK, great. Thanks. And then on the cost side, at the manufacturing level, can you walk us through the key elements and cadence for implementation on the pieces that are going to get you to positive gross margins?\n\nTed Tewksbury -- Chief Executive Officer\n\nYeah. So, it's really a three-point plan as far as gross margins are concerned. The first component being to increase our ASPs through full system solutions, as we've talked about before, that provide the hardware sensor together with the software and the ML capabilities and analytics to help business obtain insights. So, we're not just giving a business, a point cloud, we're allowing them to actually derive business insights and analytics from our products.\n\nSo, that's number one. That's going to enable us to increase our ASPs and also eventually derive the recurring source of revenue through SaaS revenue. The second component is to reduce our BOM costs through architectural innovation. We already talked about that with regard to the ADAS products we have in development.\n\nAnd then third is manufacturing efficiencies to drive down product costs. And specifically, we're accelerating the transition to Thailand to increase our operational efficiencies. And then in parallel with that, as Mark talked about in the prepared remarks, we're realigning our cost structures with revenue, bringing down opex, and identifying a lot of opportunities for cost efficiency across the organization.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThat's super helpful. Thanks, guys.\n\nOperator\n\nThe next question comes from Sam Peterman with Craig-Hallum Capital Group. Please go ahead.\n\nSam Peterman -- Craig-Hallum Capital Group -- Analyst\n\nHi, guys. Thanks for taking my question. I wanted to ask on the product you exit. I think you said you exited the H800 with Velarray.\n\nI think you had a couple of other products based on that solid-state architecture, including the Vella Dev. So, curious, if you could give some more color around why the Velarray was exited and then what that means for your other products that are based on that architecture, that would be great.\n\nTed Tewksbury -- Chief Executive Officer\n\nYeah. Great question, Sam. So, as I mentioned earlier, we're rationalizing our products and development and really investing our limited engineering resources on those products that have the greatest chance of success and that meet our requirements for profitability. The H800 was really one of our first solid-state sensors and we used it to test the market.\n\nAnd we learned a great deal about what customers really want and need. And while H800 offered outstanding performance and power efficiency. We heard loud and clear from customers that they need much lower pricing. And we don't see anybody else out there.\n\nWe don't see any of our competitors who are able to hit the kind of price points that I alluded to earlier. And so, low cost really became one of the main pillars of our strategy. And as I talked about, we now have a really exciting next-generation product road map. And it makes more sense for us to invest our engineering resources on bringing those new products to market rather than looking backwards and trying to improve existing products.\n\nSam Peterman -- Craig-Hallum Capital Group -- Analyst\n\nGotcha. That makes sense. Thanks for the detail there. Second question, just thinking about the guidance going forward, I'm assuming you're down a little bit quarter over quarter, and I'm assuming that's primarily on the product side rather than the licensing side.\n\nIs that correct? And can you talk about which end markets kind of you're seeing relative to strengthen versus relative weakness or any color there?\n\nTed Tewksbury -- Chief Executive Officer\n\nYeah. Again, the strength is coming from industrial and robotics, as well as the intelligent infrastructure with continuing contributions from AVs. And yeah, let me just emphasize that we're going into Q3 with enormous demand and enormous backlog. And the only thing that's holding revenue growth back right now is supply.\n\nAnd as I explained earlier, we are well underway in redesigning our Pucks to use new FPGAs, which we expect to get us out of this company-specific supply constrained by the end of the year.\n\nOperator\n\nWas there a follow-up, Mr. Peterman?\n\nSam Peterman -- Craig-Hallum Capital Group -- Analyst\n\nSorry, that's it for me. Thank you.\n\nTed Tewksbury -- Chief Executive Officer\n\nOK. So, maybe I could just wrap up by bringing everybody back to the big picture and the main takeaways. We have got a great new strategy that we all feel good about. We've upgraded the management team with top talent.\n\nWe have a whole new board of directors with the right skills and experience to help take the company to the next level. The founders are off the board and out of the stock, eliminating an overhang of uncertainty for investors. We met our guidance, and we grew revenue sequentially in the second quarter. We're getting great customer traction in industrial, robotics, and intelligent infrastructure.\n\nWe have strong demand in backlog going into Q3. We have some supply constraints, but our efforts to redesign our products are on track. We have a new game-changing product road map of high-performance, low-cost sensors, and solutions. And we have a detailed plan to increase gross margins to realign our cost structure with our revenue to accelerate the path to profitability.\n\nAnd we have a $230 million cash balance in the bank to accomplish all these things. So, with that, I want to thank everybody for joining us today. We look forward to speaking to you in the weeks to come. Have a good afternoon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJim Fanucchi -- Investor Relations\n\nTed Tewksbury -- Chief Executive Officer\n\nMark Weinswig -- Chief Financial Officer\n\nRaji Gill -- Needham and Company -- Analyst\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nSam Peterman -- Craig-Hallum Capital Group -- Analyst\n\nMore VLDR analysis\n\nAll earnings call transcripts"
}