{
  "companyName": "Pfizer",
  "companyTicker": "PFE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/pfizer-pfe-q3-2022-earnings-call-transcript/",
  "content": "Pfizer (PFE -0.17%)\nQ3 2022 Earnings Call\nNov 01, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to Pfizer's third quarter 2022 earnings conference call. Today's call is being recorded. At this time, I would like to turn the call over to Mr. Chris Stevo, senior vice president and chief investor relations officer.\n\nPlease go ahead, sir.\n\nChris Stevo -- Senior Vice President and Chief Investor Relations Officer\n\nGood morning. Welcome to Pfizer's third-quarter earnings call. We anticipate that this call will last 60 minutes. I'm joined today by Dr.\n\nAlbert Bourla, our chairman and CEO; Dave Denton, our CFO; and Dr. Mikael Dolsten, president of worldwide research and development and medical. Joining for the Q&A session, we will also have Angela Hwang, chief commercial officer and president, global biopharmaceuticals business; Aamir Malik, our chief business innovation officer; Dr. William Pao, our chief development officer; and Doug Lankler, our general counsel.\n\nBefore we begin the call, I'm also happy to announce that we will host an Analyst Day in New York City on the afternoon of December 12. Members of our executive team and other leaders of Pfizer will share information on our rich slate of potential near-term product launches and the R&D readouts which will drive the next wave of product launches after that, both of which will support our 2030 revenues and beyond. In-person attendance will be by invitation, but we will also be webcasting the event. While we're not going to talk more about the agenda today, we look forward to providing more details as we get closer to December 12.\n\nMaterials for this call and other earnings-related materials are on the Investor Relations section of pfizer.com. Please see our forward-looking statements disclaimer on Slide 4. And additional information regarding these statements and our non-GAAP financial measures is available in our earnings release and in our SEC forms 10-K and 10-Q under Risk Factors and Forward-looking Information and Factors That May Affect Future Results. Forward-looking statements on the call are subject to substantial risks and uncertainties, speak only as of the call's original date, and we undertake no obligation to update or revise any of these statements.\n\nWith that, I will turn the call over to Albert.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you, Chris. Hello, everyone, and thank you for joining us today. I will briefly touch on some recent highlights. I will then spend the bulk of my time speaking to our expectations for what we feel will be a promising and prosperous future for Pfizer and the patients we serve.\n\nIn addition to generating a stellar financial performance, since our last earnings call, we reported positive pivotal data for several exciting pipeline programs, including our RSV vaccine candidate for older adults, Prevnar 20 for children, the potential combination of treatment of Talzenna and Xtandi in men with metastatic castration-resistant prostate cancer, our pentavalent meningococcal vaccine candidate for adolescents and young adults as well as exciting progress for our GLP-1 program in type 2 diabetes and obesity. Just this morning, we announced positive top-line data from the Phase 3 clinical trial investigating our bivalent RSV vaccine candidate when administered to pregnant participants to help protect their infants from RSV disease after birth. We established a new commercial structure within our global biopharmaceutical business that is focused on three broad therapeutic areas: primary care, specialty care, and oncology. We believe this new structure will enable us to maximize the commercial success of the multiple exciting product launches, including several potential blockbusters that are poised to emerge from our scientific pipeline over the next few years.\n\nWe have continued to advance potentially game-changing vaccines in the fight against respiratory disease by entering into a Phase 3 study for our mRNA flu vaccine candidate and initiating a Phase 1 study for a vaccine candidate that combines our mRNA flu and COVID-19 vaccine in one sort. We completed the acquisitions of Biohaven Pharmaceuticals and Global Blood Therapeutics, giving us market-leading franchises in both migraine and sickle cell disease, respectively. Less than six months ago after launching in Accor for a healthier world, a breakthrough initiative designed to close the health equity gap for 1.2 billion people living in 45 lower-income countries, I'm proud to say that the first shipments of our products have arrived to these countries, and we are working with governments on health system improvements that can help make sure these products reach those in need. And of course, we continue to lead the fight against COVID-19.\n\nMost notably, our omicron-adapted bivalent COVID-19 vaccine has been authorized by the U.S. Food and Drug Administration, by the European Medicines Agency and several other regulatory bodies. And as part of Pfizer's commitment to providing equitable access to COVID-19 oral treatments, we agreed to supply at the non-for-profit price up to 6 million Paxlovid treatment courses to the Global Fund for low and lower middle income countries. An exciting quarter for sure, but in our company and our industry, it's all about what's next.\n\nThe next breakthrough medicine or vaccine, the next game-ending technology, the next solution to an unmet patient. This continued pursuit of what's next is embedded in Pfizer's DNA and the foundational driver of our purpose: Breakthroughs that change patients' lives. It's also why we have confidence that Pfizer story is a story of growth. We recognize that some are questioning Pfizer's longer-term growth projects, particularly in the '25 to '30 time frame, but understandable given that we currently expect a negative impact of approximately $17 billion in revenues from losses of exclusivity during that period based on our internal calculations.\n\nWe believe we not only can overcome these expected declines but also can potentially generate strong growth through the end of the decade. Let's take a closer look on how we expect to accomplish this. Our strong capital position has given us the ability to pursue business development opportunities with the potential, if successful of course, to add at least $25 billion of risk-adjusted revenues to our 2030 top-line expectations. We believe the deals we have already done for Arena, Biohaven, Global Blood Therapeutics, and ReViral has the potential to get us more than one-third of the way there and that we have more than enough capital to invest in the additional opportunities needed to meet or exceed this target.\n\nPerhaps even more exciting is the way the potential growth drivers emerging from our R&D pipeline in the near term. Over the next 18 months, we expect to have up to 19 new products or indications in the market, including the five for which we have already begun co-pro promotions or commercialization earlier this year. You can find the list of these launches in the appendix of the presentation we posted today for this earnings call. If successful, these 19 launches, of which more than two-thirds have the potential to be blockbusters, will be the most ever in Pfizer's history.\n\nThe 15 in-house developed projects alone could potentially represent approximately $20 billion in 2030 sales which would more than offset the expected LOE impact. Many of these programs are already largely derisked from a clinical perspective. The majority of them were discovered in-house and nearly all of them would be for indications outside of COVID-19. If approved, we expect each of these to be key contributors to our growth aspirations through 2025 and beyond.\n\nAnd of course, we have many more potential vaccines and medicines in our pipeline with numerous launches expected in the '24 to '30 time line. These include gene therapy candidates for hemophilia A, B, and Duchenne muscular dystrophy; our oral GLP-1 for diabetes and obesity; a potential combo vaccine that would cover flu and COVID-19 in one shot and many, many more. With regard to our COVID-19 products, while their sales may fall from our expected 2022 levels of approximately combined $55 billion, we believe our COVID-19 franchises will remain multibillion-dollar revenue generators for the foreseeable future which should serve as a buffer for any unforeseen challenges with other products in our portfolio. Our confidence to execute this plan stems from the depth of our financial resources and the firepower it gives us to pursue business development opportunities, the power brand equity we have built up over the past 170 years and further enhanced in the past two years.\n\nAccording to a recent survey, our brand awareness now stands at an impressive 82% and our favorability stands at 61%, compared with 42% for the industry as a whole, results that were obtained just a couple of months ago. And of course, the strength of the three foundational pillars of our company, our world-class scientific, our world-class commercial and our world-class manufacturing engines, and you will see on this slide some highlights of each one of them. Let me now briefly highlight three potential blockbusters that we expect to contribute to our long-term growth. RSV is an area of significant unmet need, particularly in older adults and infants.\n\nEach year, it is estimated more than 177,000 older adults are hospitalized and 14,000 of them die in the U.S. alone due to RSV. That is fulfilled by a diagnostic test. We believe we have the potential to be a leader in this space and have a real impact on public health.\n\nOn March 24 of this year, the FDA granted breakthrough designation for our RSV vaccine candidate for the prevention of lower respiratory tract disease caused by RSV in individuals 60 years of age or older. We are excited to report positive top-line data from the Phase 3 Renoir trial in late August, with the recent presentation of detailed results at ID week 22. A pre-planned interim analysis showed vaccine efficacy of 67% against RSV-associated lower respiratory tract illness, defined by two or more symptoms. And vaccine efficacy of 85.7% was observed in participants with more severe disease, presenting three or more RSV-associated symptoms of lower respiratory tract illness.\n\nWe are also excited about the potential for our maternal RSV vaccine candidate. Globally, each year, RSV [Inaudible] more than 6.5 million infants under six months old and kills approximately 45,000. As announced this morning, our maternal RSV study met the success criterion for one of the two primary endpoints. Vaccine efficacy of 81.8% was observed against severe medically attended lower respiratory tract illness due to RSV in infant's birth through the first 90 days of life.\n\nAnd high efficacy of 69.4% was demonstrated through the first six months of life. So there is the potential that, subject to regulatory approval, by late 2023, early 2024, we could have the only RSV maternal vaccine in the market, along with an RSV vaccine for older adults, that has high efficacy, and it is well tolerated with no safety concerns. Combined, the two indications represent a potential multibillion-dollar peak revenue opportunity if approved, especially with our high-respected primary care sales force executing these launches. Including the RSV antiviral investigational candidates we acquired with ReViral, we aim to have end-to-end solutions with both preventative vaccines and therapeutics to treat those infected with RSV.\n\nUlcerative colitis or UC is a chronic and often debilitating inflammatory bowel disease that affects an estimated 1 million people in the U.S. alone. Many patients living with this disease never achieve or maintain remission, and physicians are seeking effective, proven oral therapies with a favorable benefit-risk profile that can be an attractive first-line advanced therapy option. As a result, we expect the market opportunity to grow by about 50% over the next five years.\n\nThe positive Phase 3 data from the Elevate UC 12 and 52 trials reinforce our belief that etrasimod has a differentiated clinical profile and can be an important treatment option if approved. We believe that etrasimod can be a multibillion-dollar blockbuster product. We expect to launch the product in the U.S. as soon as the second half of 2023, pending regulatory approval, through our specialty care sales force, which already has strong relationships in the UC market, thanks to its work with Xeljanz biosimilar specifically.\n\nLastly, let's look at migraine. Following our acquisition of Biohaven in early October, we are now aiming to build the world's leading global migraine franchise with the potential to impact 1 billion patients around the world. Migraine is a debilitating disease and has 11.6% prevalence worldwide. In the U.S.\n\nalone, there are 40 million patients with migraine, and one out of five women are migraine sufferers right now. The economic burden is significant at $36 billion per year. We believe our portfolio, including Nurtec ODT, Vydura, and zavegepant could meet the range of needs in the market, allowing physicians and patients to decide how to appropriately monitor migraine treatment and prevention. As a result, we see the potential to reach more than $6 billion in peak revenue altogether.\n\nIn the U.S., Nurtec is growing very well, including the impact of Pfizer's co-promoting, which began in August pre-close. Nurtec has further strengthened its No. 1 market share position in the oral CGRP market, and we expect even stronger growth as we deliver on our promise to further enhance our commercial efforts behind this program. Outside the U.S., it has been approved in the EU, U.K., Israel, Kuwait, United Arab Emirates and we have filed for registration in an additional 10 markets.\n\nWhile this is not a new product launch, we believe this is a great example of how we can take this portfolio to new heights by leveraging the full strength of Pfizer's global commercial engine, including in primary care physicians. Moving over to zavegepant. We recently expect to launch zavegepant intranasal in the U.S. next year, pending FDA approval, and we plan to globally commercialize.\n\nLastly, the oral prevention Phase 3 trial is ongoing with a data readout that is expected in the third quarter. So with that, I turn it over to Dave to update you on the results and outlook for the financials. After Dave, Mikael will speak about the progression of our pipeline.\n\nDave Denton -- Chief Financial Officer\n\nThank you, Albert, and good morning. I'll begin this morning with a few comments regarding how the company continues to deploy capital in a disciplined manner in support of long-term growth and, importantly, enhanced shareholder returns. As you know, Pfizer's cash generation capabilities has expanded significantly over the past several years and the efficient deployment of this capital is more critical than ever. During the first nine months of 2020, the company has deployed and committed capital in three main areas: First, we've invested $7.8 billion in internal R&D as we continue to support our growing pipeline of innovative medicines.\n\nThese investments are squarely focused on driving revenue growth through 2030. Secondly, in the first three quarters of this year, we have invested approximately $8 billion in completed business transactions. Additionally, early in the fourth quarter, the company completed investments for more than $18 billion in transactions, including both Biohaven and GBT, which brings us to approximately $26 billion in capital deployed for business development transactions thus far in 2022 alone. These transactions illustrate our progress toward the goal of adding $25 billion in risk-adjusted 2030 revenues through BD.\n\nAnd finally, we have returned nearly $9 billion of capital to shareholders through a combination of both dividends and value-enhancing share repurchases. Clearly, maximizing shareholder value through prudent capital allocation will continue to be a major focus for Pfizer. So with that, let me briefly review our financial results for the quarter. I'll limit my remarks largely to adjusted and operating growth figures.\n\nThird-quarter revenues demonstrated strength across many areas of the business, but much of that strength was somewhat obscured by our incredibly strong performance in the third quarter of 2021. Given the strength in the prior year, revenues this quarter decreased 2% operationally. However, looking at it on a two-year basis, revenues this quarter were up more than 120% compared to the third quarter of 2020. The slight decrease compared to last year was in line with our expectations given the phasing of scheduled deliveries of Comirnaty, which we discussed in our earnings call last quarter.\n\nAlso underlying our results this quarter was the strong performance of Paxlovid as well as continued strength from a number of our other key products. Excluding direct sales and alliance revenues related to the COVID products, Pfizer's revenues grew 2% operationally in the quarter. Gross margins expanded by 1,450 basis points versus the third quarter of LY. This improvement is largely due to increased sales of higher-margin Paxlovid and decreased sales of lower gross margin Comirnaty compared to last year.\n\nThese improvements were partially offset by the impact of a $400 million charge related to excess raw materials for Paxlovid. Given the unpredictable nature of the virus, we intentionally chose to order additional stock to ensure we can meet any global health demand if an extreme need were to arise. Adjusted SI&A expenses in the third quarter grew 23% operationally. The increase was primarily driven by spending for Paxlovid and Comirnaty and higher healthcare reform fees.\n\nThe 2% operational increase in adjusted R&D expense in Q3 was primarily driven by increased costs to develop recently acquired assets as well as investments for certain oncology and non-COVID-19 vaccines programs. This was partially offset by lower spending on programs to prevent and treat COVID-19 and various late-stage clinical programs. The effective tax rate on adjusted income in the quarter was 4.4%, significantly lower than typical, driven by tax benefits related to global income tax resolutions in multiple tax jurisdictions spanning several tax years. Excluding these tax resolutions, the underlying tax rate was consistent with historical trends.\n\nAs a result, reported diluted earnings per share of $1.51 grew by 6%, while adjusted diluted earnings per share of $1.78 grew 44% on an operational basis for the quarter. Now foreign exchange movements continue to dampen our results, negatively impacting revenues by approximately $950 million and adjusted diluted earnings per share by $0.05 this quarter. Now let me move to our updated 2022 guidance. Given our strong third-quarter performance and our improving outlook for the year, we are increasing our operational expectations for revenues by $1.7 billion and adjusted diluted earnings per share by $0.19.\n\nThis operational increase on the bottom line would have been even higher if not for an incremental $0.06 negative impact due to higher acquired IPR&D expenses. Partially offsetting these operational increases is the impact of additional strengthening of the U.S. dollar since the last updated guidance in late July. Incremental foreign exchange movements negatively impacted our expectations for 2022 revenues and adjusted diluted earnings per share by $700 million and $0.09, respectively.\n\nThe net impact of these cross-currents result in increases to the midpoint of our revenue and adjusted diluted earnings per share guidance ranges. These revised ranges reflect operational growth rates of 31% for revenues and 70% for adjusted diluted earnings per share at the midpoint compared to 2021. And this was up from our previous operational growth expectations for revenues and adjusted diluted earnings per share of 29% and 65%, respectively. Regarding our COVID-19-related revenues, we now expect the vaccine revenue for the year to be approximately $34 billion, up by $2 billion compared to our prior guidance.\n\nFor Paxlovid, we expect sales of approximately $22 billion, keeping the guidance range unchanged despite the negative incremental impact of changes in FX. You can see on this slide our updated costs and expense guidance which incorporates our performance to date, our recent acquisitions and our updated expectations for the remainder of the year. More information on each of these updates can be found in this morning's press release. 2022 guidance once again assumes no incremental share repurchases beyond the $2 billion of share repurchases we completed in March of 2022.\n\nIn closing, it's an exciting time in the history of Pfizer. We believe that our strong financial performance in the quarter and our improving operational outlook for the year sets the stage for long-term shareholder value creation. With that, I'll now turn it over to Mikael.\n\nMikael Dolsten -- President of Worldwide Research and Development and Medical\n\nThank you, Dave. Today, I will focus attention on high-value programs that will potentially deliver breakthroughs in areas of high unmet need and are expected to be key contributors to our growth aspiration through 2025 and beyond. With anchor products such as Comirnaty, Paxlovid, Ibrance, and Xtandi we are building out comprehensive franchises in several areas, including respiratory, metabolic disorders, genetic hematology and certain cancers. We have deep expertise in these areas, and there is exciting science emerging.\n\nI will share updates from three of these today, respiratory, metabolic and prostate cancer. Building on our success with Comirnaty and Paxlovid, we see enormous potential to help address major courses of respiratory disease through vaccines and therapeutics. Work on the next-generation vaccine candidates are well underway. And last week, we started a Phase 1 clinical trial of our second-generation oral therapeutic candidate.\n\nOur quadrivalent modRNA flu program has progressed into Phase 3, and we will start shortly A Phase 1 study of an mRNA-based vaccine candidate that combines our quadrivalent modRNA vaccine candidate with the omicron-adapted bivalent COVID-19 vaccine based on BA.4/BA.5. In RSV, we believe a dual focus on developing a vaccine and antivirals could make a significant impact globally. I will share new data with you shortly. Paxlovid continues to be important in helping to combat the impact of COVID-19.\n\nAnd secondary endpoints from the EPIC high-risk study as well as data from real-world evidence support the product's efficacy profile. In the EPIC HR study, Paxlovid reduced COVID-19-related death and ICU admissions by 100% and COVID-19-related hospitalization by 86% in unvaccinated, high-risk patients compared to placebo. It also reduced the duration of COVID-19 symptoms by two to three days compared to placebo. We are pleased to see Paxlovid leading the COVID-19 treatment landscape and remain confident in its safety and efficacy in treating patients and high risk for severe outcomes.\n\nWe recently reported a positive interim analysis from our Phase 3 study in older adults of our novel RSV vaccine candidate which targets the pre-fusion F protein, on both RSV A and B, without need for an adjuvant. We saw a remarkable vaccine efficacy across the first RSV season. The vaccine was extremely well tolerated with favorable systemic tolerability, a key consideration for vaccines. We also are developing the RSV pre-F vaccine candidate for use in pregnant women so that protection may be conferred to newborns.\n\nAnd this morning, we announced exciting results from a free planned interim analysis of our Phase 3 trial. We observed vaccine efficacy of nearly 82% against severe medical-attended lower respiratory attractiveness illness or MALRTI due to RSV in infants from birth through the first 90 days of life and efficacy of more than 69% through the first six months of life. Success for them was not met for the second primary endpoint. However, clinical and meaningful efficacy was observed with MALRTI of 57% in infant from birth to 90 days of life and efficacy of 51% over the six months follow-up period.\n\nThe Data Monitoring Committee indicated the vaccine was well tolerated with no safety concerns for either vaccinated women or their newborns. Given these impressive results, we look forward to filing BLA for both older adults and pregnant women with the U.S. FDA by year end with potential launches in '23. If approved, our maternal vaccine candidate, potentially would be the first available to help prevent its common and potentially life-threatening respiratory illness in young infants.\n\nTurning now to prostate cancer. We're building upon the standard of care set by Xtandi in castration-sensitive and castration-resistant population. The Phase 3 Embark study of Xtandi non-metastatic castration-sensitive prostate cancer is expected to read out first half of '23. And the Phase 3 of Talzenna and Xtandi is expected in '24.\n\nThese trials may indicate benefit in up to 20% more patients than are currently treated and potentially prolong duration of use, subject to clinical success and regulatory approval. Now in Talapro-2, we observed the first clinical benefit of a PARP inhibitor plus Xtandi in men with metastatic castration-resistant prostate cancer with or without homologous recombination repair or HRR gene mutation. Irrespective of HRR gene mutation status, the study achieved its primary endpoint. The combination delivered a significant and clinically meaningful improvement in radiographic progression-free survival and appears to have resulted in the longest observed such survival in a randomized trial in this setting.\n\nWe are encouraged by these results and believe that Talzenna in prostate cancer marry blockbuster potential, subject to regulatory approval. Turning to metabolic disorders. I previously shared that we are developing two oral GLP-1 receptor agonist, danuglipron and 1532. Recently presented Phase 1b data for 1532 show dose-dependent reduction from baseline at four to six weeks in new daily glucose, fasting plasma glucose, HbA1c, and body weight.\n\nBoth candidates are potentially best-in-class and differentiated by offering a full agonist which may be required to achieve the same level of response as injectable GLP-1 receptor agonist while offering a convenient once-daily dose for 1532. Glucose effect plateau at lower doses, while body weight effects continue to improve at high dose. The planned Phase 2b study will evaluate 1532 versus both oral semaglutide and placebo in type 2 diabetes and separately versus placebo in obesity. Using semaglutide as a comparator in the type 2 diabetes arm should allow us to observe potential early signs of differentiation in efficacy tolerability and safety.\n\nWe will evaluate doses up to 260 milligrams in this study, higher than the studies in the Phase 1b. We plan to begin dosing soon and anticipate the readout in first quarter 2024. The ongoing Phase 2b study of danuglipron in obesity with now once-monthly titration is expected to complete second half of 2023. Data from these studies will be available in relatively quick succession and, assuming clinical success, allow us to select one based on efficacy, tolerability and dosing to advance to Phase 3 in both type 2 diabetes and obesity.\n\nIn closing, we are excited about the developing science within these franchisees and share recent and anticipated milestones in the next 18 months. We look forward to continue our development but for potential patient benefit and sustainable growth. Thank you. Let me turn over to Chris to start Q&A.\n\nChris Stevo -- Senior Vice President and Chief Investor Relations Officer\n\nThanks, Mikael. With that, let's start the Q&A session. We have about 30 minutes for this session. We will answer as many questions as time permits.\n\nAnd Investor Relations will be available after the call to answer any follow-up questions. Chelsea, please go ahead and queue up the first question.\n\nOperator\n\n[Operator instructions] Our first question will come from Umer Raffat with Evercore ISI.\n\nChris Stevo -- Senior Vice President and Chief Investor Relations Officer\n\nUmer, are you there?\n\nOperator\n\nUmer, your line is open, please make sure you are not muted. We'll go to our next question. Colin Bristow with UBS.\n\nColin Bristow -- UBS -- Analyst\n\nOn COVID expectations, should we expect anything from you here on the December 12 Investor event? And then just more broadly around this, how are you thinking conceptually about guiding to this? Will it be similar to last year? Are you thinking of more sort of scenario-based guiding? Anything that would be helpful. And then just a sort of temperature check on business development, if you could update us on your priorities and interests. And then from a deal perspective, just how big would you be willing to go?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you. On December 12, what you should expect, it is a good overview of our very important new product launches in the coming 18 months, with more details about the science and the market potential of those launches as well as some of the most important pipeline potential, new medicines and vaccines, that they are not going to be launched in the next 18 months but will be launched in the period between '24 and '30. Now for the BD priorities, I would ask Aamir to reiterate once more our strategy when it comes to BD.\n\nAamir Malik -- Chief Business and Innovation Officer\n\nThanks for the question, Colin. The BD priorities remain consistent with what we've articulated before. And principally, we are most excited about scientific substrate that has the potential for patient breakthroughs. That's going to continue to be our north star.\n\nWe're looking for deals that accelerate our top-line growth in the back half of the decade. And importantly, we're focused on opportunities where we can add substantial value, and that can come in the form of either shaping the science or also accelerate in our commercial momentum. And if you look at the deals that we announced and closed in 2022 including Arena, Biohaven, Array, GBT, they would all be very consistent with those priorities. We've said that we are agnostic to size of transaction.\n\nBut you've also heard us be very clear about the fact that cost synergy-driven deals is not where our focus is going to be. We're going to be focused on driving growth through our BD.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you, Aamir. And also, Dave, maybe you can also address the question about guidance on COVID and are we going to provide it and when for '23, etc.\n\nDave Denton -- Chief Financial Officer\n\nYes. Thank you, Albert. Maybe let me discuss the stage as it relates to COVID and the COVID franchise. I think if you look out longer term, the franchise is going to be a multibillion-dollar franchise in the respect that this is going to be somewhat like a flu, sustained flu, but actually more deadly than the flu.\n\nSo, therefore, I think the products, both from a vaccine and the therapy perspective that Pfizer has developed, they're going to be quite relevant for many years to come. Having said that, when we provide guidance for 2023, when it's appropriate to do so, we will give investors a perspective on what our expectations are for the year. We will break out that guidance specifically so you can hold us accountable for delivering on those revenue promises when the time comes.\n\nOperator\n\nNext, we have Louise Chen with Cantor.\n\nLouise Chen -- Cantor Fitzgerald -- Analyst\n\nSo I wanted to ask you, first off, how you think about -- or maybe more color on how you think about the pushes and pulls in 2023. There's a lot of moving parts there. And then secondly, on your RSV franchise, there seems to be several players with drugs in development and they've all reported out positive data. So curious how you think about this market playing out over time?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nYes. Let me say a few words about the push and pull, then I will ask Angela to complement and speak about how we see the RSV market. Clearly, '23 is a very, very important year for us given the unprecedented number of new launches that we are going to have in the next 18 months. And most of them will happen in '23 and some beginning of the first quarter of '24.\n\nBut we are launching products, not only a very big number of them, but only the internal ones, $20 billion, excluding the BD, Biohaven, and the Global Blood $20 billion of peak sales were expected, 2030 sales we are expecting from launches. So it's a very, very big number. And it's very important for us to do it well. So clearly that will bring our non-COVID business will be a significant boost for our non-COVID business.\n\nNow when we move to COVID, we expect '23 will be a transition year with likely in the U.S. moving from government model into a commercial model for vaccines and therapeutics. The timing is not certain. So we are ready to do either side, but will be phased over the years.\n\nAnd it likely will not be the same for Paxlovid or Comirnaty. And clearly also, there will be some stuff that will have to be depleted in '23. And clearly, there will be new price dynamics as we are moving to '23. So probably will be a little bit more of a transitional year in '23 until it will be established into more like flu volumes type of market, but of course, with different price points and different severity of the disease, that will bring both therapeutics and vaccines into a multibillion-dollar franchise, but we are not going to predict now what will be the number for the years out, but we will try to be as accurate as possible for our '23 numbers when we will provide guidance.\n\nNow under anything to add on the push and pulls, you are carrying a lot of the weight for the new launches and also speak about one of them, which is going to be the RSV maternal and adult.\n\nAngela Hwang -- President, Pfizer Biopharmaceuticals\n\nWell, we're extremely excited about both the adult vaccine as well as the maternal vaccine. First and foremost, because it is in the sweet spot of what Pfizer does, respiratory vaccines, right? We have a lot of experience of this created through the legacy of our pneumococcal franchise and the strength we have there, but also recently from Comirnaty. I'll also add that Pfizer is the only company that has both the adult vaccine as well as the maternal vaccine. And it really does fit so extremely well into our existing commercial footprint.\n\nThese are large populations, both the adult as well as maternal. Let me just start with adult and just sort of characterize that a bit. There Arena 61 million 65-year-olds, all of whom are eligible for the vaccination. It's actually a -- it's quite a devastating disease.\n\nThe hospital costs from RSV for adults is over $1.2 billion. It is also underreported and underdiagnosed. And so we have a really great opportunity here to drive awareness of this disease, but also to use the commercial footprint that we already have to create awareness, to create education, and to bring this vaccine to those who need it. Equally, in the maternal space, a devastating disease.\n\nMost of the mortality and the morbidity is in infants that are under six months old and those that are preterm. And actually, over 102,000 deaths worldwide are resulting from instantiations of RSV. So again, we see a tremendous opportunity to make a difference here. As you know, through the work that we've done on Prevnar, we have a tremendous legacy in pediatric vaccines.\n\nAnd so that, coupled with our strength in women's health, and the commercial footprint we have there as well, is going to be perfectly suited for us to launch the maternal RSV vaccine. And so bringing all of this together, I think that we have the scientific knowledge, we have the technology, we have the relationships with the vaccinators and the sites of vaccinations. We are also very well versed in our work with the vaccine technical committees around the world, in bringing together a broad recommendation, which we believe is what's going to give us access to many, many infants as well as adults to these two tremendous breakthroughs. So I think we have the best-in-class capabilities to do a great job with this respiratory portfolio.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nVery well, Angela, and I agree with you.\n\nOperator\n\nNext, we have Steve Scala with Cowen.\n\nSteve Scala -- Cowen and Company -- Analyst\n\nI have three questions, but they're all short. First, what impact on RSV-associated infant hospitalizations did Pfizer see in the Phase 3 Matisse trial? Second, can you tell us what Nurtec sales were in Q3? I know you didn't own Biohaven in Q3, but you likely know the number. And then lastly, all things considered, is it unrealistic to think that Comirnaty plus Paxlovid sales could be as much as $15 billion in 2030?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you very much. Mikael, what about the RSV data?\n\nMikael Dolsten -- President of Worldwide Research and Development and Medical\n\nThank you for the question. So as you have seen in our press release, we reported out very impressive data and two separate primary endpoints that were independent, it is sufficient to hit one for filing. And to our privilege and encouragement, we hit strongly on the most important. And that was defined as severe, medically attended lower tract respiratory infection, where we had close to 82% vaccine efficacy.\n\nThat is defined by clinical features, such as the rate and the stress of respiration, oxygenation levels, etc., in the children and will include patients, whether they are hospitalized or not. We will later release data on secondary endpoints that include hospitalization. When you look at this dramatic effect on the severe infections, it seems very reasonable to project that we will have a dramatic impact in lowering hospitalization. I'm probably talking about tens of thousands of hospitalizations in the U.S.\n\nthat may not happen if this vaccine is used to vaccinate maternal prior to delivering the children as appropriately studied in this vaccination. So we're very encouraged and optimistic about that type of value.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you, Mikael. Before I turn to Dave to answer the question about the sales of Nurtec in the third quarter, let me make a comment on Comirnaty and Paxlovid and the franchise. Clearly, we said they will provide us a good picture of what we expect to be the sales for next year. Now you're asking about year 2030, which is even more challenging.\n\nBut also, the way you are asking the question, is it unthinkable -- is it unreasonable to think that we could have a $15 billion franchise? Well, taken that it is 55 right now, it's not unreasonable to think that in year 2030 could be that. But it's not clear that it will be done. So that will depend on the virus and how it saves. Will depend on if it will become a standard practice to vaccinate together with flu.\n\nIf we will have a combination product, clearly, that will enhance this direction. So I think it's a little bit too early, but no, it's not unreasonable to think given where we are right now. Now, what about Nurtec sales?\n\nDave Denton -- Chief Financial Officer\n\nYes. Steve, this is Dave. As you said, we didn't own the business last quarter, but maybe just a little bit of color on how the product is performing. If you look at the volume last year, or last quarter, rather, Q3, if you compare it to last year, it was about a 45% growth rate in year-over-year script volume.\n\nAnd then if you look at it sequentially, which I think is really important, we saw about a 16% growth rate sequentially Q2 going into Q3. So I think this shows the promise of this product, number one. And number two, I think once we get it, now that we have it in the hands of our field force, and into our primary care force, we can really maximize the value of this needed medicine into the patient population here in the U.S. and abroad.\n\nOperator\n\nOur next question will come from Robyn Karnauskas with Truist Securities.\n\nRobyn Karnauskas -- Truist Securities -- Analyst\n\nGreat. On Paxlovid, I was just -- I'm sure you saw the recent publication citing how many people have died from not even getting an antiviral. Can you talk a little bit about the efforts you're making to educate physicians to give the drug. And do you think we'll ever get to a point where people will be more comfortable, doctors will be more comfortable taking it, given all the news around the Paxlovid rebound? And second question, can you talk a little bit about the opportunity for vitiligo in alopecia in your pipeline? And when should we hear the next readout?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you very much. Both questions, I think, can be answered very nicely by Angela.\n\nAngela Hwang -- President, Pfizer Biopharmaceuticals\n\nWell, thank you for the question. So let's talk a little bit about Paxlovid and how that's been going. I mean, first and foremost, we are under an EUA, so that means that we are working hand-in-hand with the U.S. government to ensure that we are providing the education to the public.\n\nThe U.S. government and the state government, I think, have created a tremendous amount of education already using public service announcements and public campaigns. And equally, we have provided education to all the potential prescribers of Paxlovid. So if you think about where we are today, over 500,000 physicians have written Paxlovid.\n\nAnd what you have in addition to that is education that we've provided not only to doctors, but also to pharmacists. We've trained over 80,000 pharmacists in terms of how to write Paxlovid. And so I think the education is really firing off, both at a prescriber level but also at a consumer level where we have worked, again, also closely with state governments and local governments, to ensure that we're providing the right amount of education. I will say that the test-to-treat sites that the government has stood up federally, there's now 27,000 of those around the country, have also been great sources of education for Paxlovid.\n\nSo I think that it's -- frankly, I think it's going well. I think that we're continuing to do more in anticipation of the fall. But the fact that you've had 500,000 physicians write this Paxlovid already is a great indicator of their confidence with this. And the fact that probably the one most important area of education that we need to continue to emphasize is just who are the eligible people for Paxlovid.\n\nAnd actually, if you look at the definition that the CDC provides, there are 22 risk factors for who should be eligible. And they include those who are over 65, right, age-related risks, but equally risks such as mental health illness, risks such as an inactive lifestyle, risks that you may not be aware of. And so I think that that's really where we want to focus now through this fall.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nAnd what about vitiligo?\n\nAngela Hwang -- President, Pfizer Biopharmaceuticals\n\nI think we're really excited about these new indications for ritlecitinib. I think probably the main theme here is that there are not effective -- there aren't any treatments for these highly -- very serious inflammatory conditions today. So huge unmet need, just a place where there's just no options today. So the fact that we're able to bring a treatment like this to market I think will have tremendous uptake by patients who up to now just are left with no options.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nAnd, William, can you please address a little bit the issue about the Paxlovid rebound that was also --\n\nWilliam Pao -- Executive Vice President, Chief Development Officer\n\nSure, Albert. Well, Mikael already mentioned that we gave updated data from our EPIC-HR study on the effect of Paxlovid versus placebo in patients with high risk for COVID-19. And we had additional end points there which we showed a 100% decrease in ICU admissions, a 100% decrease in mechanical ventilation among hospitalized patients. 100% who got tested at home versus 53% placebo.\n\nWe also had 82% reduction in oxygen support, 86% of COVID-19-related hospitalization, 89% reduction in need days hospitalized versus 100 patients and also a 73% reduction in only COVID-19-related medical visits. Importantly, we also showed sustained time to symptom alleviation and sustain time to symptom resolution of an impact of two to three days of Paxlovid versus placebo. But most importantly, about rebounds, there's been several studies recently that have shown actually the rebound occurs with COVID in general. For example, there was a recent publication of 158 patients of patients who got placebo with COVID and actually a third of those had recurrent symptoms after the resolution of their symptoms, suggesting that it's a phenomenon associated with COVID and not with Paxlovid.\n\nImportantly, we also haven't seen any evidence of resistance that is clinically meaningful. Whereas with antibodies, for example, we have seen that we also can get symptom rebound, but that is associated with resistance. So again, Paxlovid not associated with resistance but the antibodies are. So we feel very confident that Paxlovid has a significant impact in the goal against COVID.\n\nOperator\n\nNext, we have Andrew Baum with Citi.\n\nAndrew Baum -- Citi -- Analyst\n\nA couple of questions. Firstly, as it relates to the maternal RSV vaccine. Could you talk about reimbursement coverage in the U.S. I'm assuming you'll get an ACIP recommendation, and therefore there will be zero out of pocket which may differentiate it versus the monoclonal.\n\nAnd I'm sure on a cost basis, that will be material. And then secondly, could you talk to your efforts with your ER degrader with Arvinas in light of the evolving data on SERDs, thinking about Astra's recent positive trial and then the L1 subgroup. Do you believe that this is a function of defining the right patient population at the right stage of the disease rather than the potential risk development of the entire category?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nDrew, thank you. In the interest of time, let me give the first answer. Yes, you are right. As long as the product is recommended by CDC, and we believe with this part of efficacy will be recommended, there is zero co-pay.\n\nThe relevance of the insurance, if it is commercial or if it is public, their obligation is zero co-pay from the payers, and they have to cover it. Mikael, what about the Arvinas molecule?\n\nMikael Dolsten -- President of Worldwide Research and Development and Medical\n\nYes. Thank you for asking. Clearly, we think that there are two factors that will separate out the good drugs from the less good in this class of degraders. And we think the Protac, which is the mechanistic name of the 471, is more effective in down-regulating the receptor and selecting the right patients compared to standard of care, that includes selecting patients that have gene receptor mutations and need more powerful drugs and is related to the property of the drug itself.\n\nWe look forward to advance that drug with Arvinas to pivotal studies in the relatively near future and also to soon reveal to you a lot of progress we had in our breast cancer franchise, including the CDK4 drug. And that may be part of what we consider to share in December at the investor update on launches and next wave.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you, Mikael, another reason to attend this great event.\n\nOperator\n\nNext, we have Evan Seigerman with BMO Capital Markets.\n\nEvan Seigerman -- BMO Capital Markets -- Analyst\n\nCongrats on the progress. Two questions for me. On BD, I want to be briefed here. But can you talk about what other therapeutic areas you might want to explore? I know you're in neurology with Biohaven, nonmalignant hematology with GBT and, of course, inflammation.\n\nWould you consider adding oncology? And on the same line, kind of, Albert, in some previous comments ahead of this call you had mentioned going alone with some of your mRNA technologies. What applications of mRNA do you see outside of COVID? I mean this personalized cancer vaccine is an area that you would explore.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nMaybe I'll pass that to Aamir.\n\nAamir Malik -- Chief Business and Innovation Officer\n\nSure. I mean, thanks for the question. As far as our therapeutic areas of focus, as I mentioned before in our priorities, our focus is on where we can make a difference and shape the science. And the good news is we actually have distinctive capabilities across many different therapeutic areas.\n\nSo you've seen us active in internal medicine, anti-infectives, INI, and, certainly, oncology. And our focus is going to be on where we have breakthrough science and the potential to shape it. And we feel very good about the breadth of our scientific capabilities to give us lots of flexibility to work in different BA.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nYes, we didn't answer the mRNA and how we think about it, Mikael.\n\nMikael Dolsten -- President of Worldwide Research and Development and Medical\n\nYes. So I'm excited to share we're broadening that platform. You heard about advance of the mRNA flu vaccine successfully to the next stages. Albert mentioned plans that are going to combine it with COVID vaccine to build more broader respiratory vaccine with improved convenience in single administration, single-patient visits.\n\nWe are on our way to the Phase 1 study, together with BioNTech, on our shingles vaccine that really aim to deliver the power of the mRNA, but remove what we've seen as a pretty significant issue with recognition of the current adjuvanted vaccine. We're looking at several other mRNA vaccine that we will share in further time, but also that we briefly alluded to, we have made progress in our alliance with Beam to really identify the first type of candidates that will move forward to genetic medicine in some of the important rare diseases. And we're looking at application, certain areas of in vivo cancer medications, where we think this technology can be more successful where compared to the past of cancer vaccines.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you very much, Mikael.\n\nOperator\n\nNext is Mohit Bansal with Wells Fargo.\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nI almost wanted to ask, but this is not the court. So on RSV vaccine side, congress on the data in maternal vaccine. My question is, Sanofi has an antibody which you can give to infants directly and it shows good results. So in your opinion, I mean, the strategy there could be one strategy.\n\nYou immunize moms, expecting moms versus infants directly. How do you think about the end market shaking out eventually?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nYes. Angela, do you want to say how we could compete potentially with an antibody in infants?\n\nAngela Hwang -- President, Pfizer Biopharmaceuticals\n\nI mean, first of all, if you look at where the -- most of the morbidity and mortality is happening, it's really at the under six months, right, in that age group and also with preterm babies. And so you really need that protection from day one. And I think that's where we believe our differentiation is. From birth, literally from the moment of birth, you have protection.\n\nAnd you have duration of protection throughout the six months, which is what we've shown in our clinical trial. So I think while there -- I mean, obviously, it's great to have many different options. I think that the option that we have with our vaccine is truly a unique one and one that plays well to the situation with the infants.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you very much. And of course, Andrew made also the point, with vaccines, we do not have co-pays. And antibodies are quite expensive, and you do have co-pays.\n\nOperator\n\nNext, we have Tim Anderson with Wolfe Research.\n\nBrian Tsang -- Wolfe Research -- Analyst\n\nThis is Brian on for Tim. Just two from us. What is Pfizer's current level of interest in Alzheimer's disease? And do you think there are compelling business development opportunities in the market? Or would the efforts likely to be homegrown? And then second, on the Prevnar 20 and the competition. Wondering if you can opine on Merck's strategy, which is to bifurcate the market between peds and adults and have a product tailored to each segment.\n\nThey have strains in each and they will be going head-to-head against Prevnar. They said a tailored approach is better than a one-size-fits-all approach, which is what Prevnar is. wanted to get your thoughts on that.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you very much. Clearly, as you know, Pfizer had externalized the neuroscience portfolio, and we have created a company that's working on that actually. And we have a very significant equity over there. We are monitoring how science is evolving.\n\nAnd apparently, there are a few things that are happening right now. I'm not referring only to the positive data of one study that we just saw, I'm more referring to earlier science that is emerging that seems to have a high promising for most clinical results. So we are monitoring that. And if we think that there is a good opportunity, we may reexamine entering.\n\nThe reason why we actually want to exit because we felt the science is not ready at the time. Now I will move it to Angela to answer your second question.\n\nAngela Hwang -- President, Pfizer Biopharmaceuticals\n\nWe're really proud of our pneumococcal vaccine franchise. And I want to begin with just talking about the great successes that Prevnar 20 has had since its launch. Even though it's competing with other -- with another pneumococcal -- or other pneumococcal vaccines, we have a 95% market share. We have 97% pulmonary access.\n\nAnd we just recently had an updated ACIP recommendation that is going to enable Prevnar 20 to be used for catch-up in the those that are 65 plus as well as 65 under. And so I think that, that is a great demonstration of the leadership and the legacy that Pfizer has in pneumococcal vaccine or respiratory vaccine and a tremendous relationships and knowledge that we have in the space. Equally, that plays out in the pediatric space. So even though we're obviously anticipating the launch of pediatric Prevnar 20, but in the meantime, Prevnar 13 is competing really well with the PCB 15.\n\nI think that, again, the relationships that we have, the deep trust and knowledge that physicians have of the -- our pneumococcal vaccine is really standing -- it's really helping us competitively. And I think that there's great anticipation for the five additional serotypes that you're going to be able to get with Prevnar 20 over 15 in the pediatric space. So I think all in all, we're off to an extremely strong start and we look forward to bringing our next vaccine to the market.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nOK. Thank you very, very much.\n\nOperator\n\nNext, we have Chris Schott with J.P. Morgan.\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nI had kind of a qualitative question on how to think about opex dynamics going forward. It seems like we've seen some upward bias and spend at the company which has kind of coincided with the ramp in COVID sales. I guess for a position where that COVID market resets as we transition past the pandemic, is there an opportunity? Or should we think about a pullback in opex spend associated with that? Or should we think about these as more normalized levels of spend given all these growth initiatives that you're highlighting and investing behind at this point?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you, Chris. Nice question. And our new CFO clearly has views on this. So Dave, what do you think?\n\nDave Denton -- Chief Financial Officer\n\nChris, good question. Listen, before getting into -- it's probably a little too early for guidance for '23. But my expectation is that there would not be a pullback in expenses. I think if anything, what we're fortunate to have is a very robust launch schedule over the next 18 months.\n\nAnd we're really focused on investing to make sure that those launches are extremely successful and these medicines get in the hands of patients pretty quickly. And so if anything, our focus is to get behind these launches, make sure that we execute them flawlessly and that we see the ramp-up and drive our sales performance, particularly in the 2025 to 2030 time frame.\n\nOperator\n\nNext is Geoff Meacham with Bank of America.\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nThanks for the question. Just had a few. The slide on long-term growth is really helpful. On the $20 billion on Slide 9 that you guys have highlighted, can you talk to the long-term contribution that has not COVID? I know there's some -- there's a long-term piece for COVID, but most investors are focused on kind of the non-COVID drivers.\n\nAnd then on II, looking to next year when we'll have many biosimilars launching for Humira, how much of market disruption do you think we'll see from higher buyers similar volumes and payer preferences, I'm thinking about the effect on Cibinqo and then the etrasimod launch specifically, but also Xeljanz and Inflectra.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nYes. I will ask Angela to answer the second question. On the first one, maybe I can give some clarifications. On the $20 billion, so we have included revenues from new launches.\n\nThis is our estimation for 2030. New launches that are happening either started in '22, Cibinqo, for example, is there, because it started. And then we are getting claims or are about to happen. And we have the list in the appendix.\n\nAnd in this list, excluding the BD, which we do not count over there, we count on the previous bar, where we have the $25 billion of revenues are summing to $20 billion in our expectation. Just to clarify, this does not include Core. This is excluding COVID, excluding new things that may come from COVID, excluding new things that may come in antivirals or new vaccines or combination vaccines or any of them. These are not part of that.\n\nNow in the other pipeline, which are things that are not in the near, near short term and things that will launch after the 18 months period all the way to '30, clearly, a lot of these things maybe are not known to you yet. But among the things that they are known to you, and they should be included over there, should be the GLP-1, should be any combinations between flu and COVID or RSV, should be our interferon BIM. And the line vaccines, the Arenas should be the gene therapies that could come. All of that should count toward that bar that we haven't quantified yet publicly.\n\nOf course, we know what we expect ourselves. Thank you very much. Now, Angela.\n\nAngela Hwang -- President, Pfizer Biopharmaceuticals\n\nSo the way to think about it is the biologics market and the oral market is -- the way we think about it is that it's different. And the reason I say that is because there is, if you look at the treatment algorithms and how the biologics are used and how the orals are used, you picked Xeljanz as an example, right? Clearly, there, the label says that you have to have used anti-TNF before you move on to an oral JAK. And so I don't think that the competition is across biologics with orals. I think the competition is literally with Humira and the biosimilars of Humira, and then the orals have their role.\n\nSo I use Xeljanz as one example. I'll use etrasimod as another example. There is the benefit of this is that you have an oral -- an oral therapy that actually can be used earlier line and actually pre-biologic. So again, there, you -- it's the different lines of treatment and the fact that I think there are distinct places where you would use an oral and a distinct place where you would use a biologic, and I don't think that's the crossover.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you, Andrew. We're running a little bit later, we have many more questions, and we'll have to make to answer them very quickly.\n\nOperator\n\nNext is Terence Flynn with Morgan Stanley.\n\nTerence Flynn -- Morgan Stanley -- Analyst\n\nI was just wondering on Paxlovid, it looks like there's going to be some doses remaining on the current U.S. contract as we head into 2023. So just maybe, I know you talked about how Comirnaty would work as we move to a commercial market, but maybe just help us think about how that will work here in the U.S. as we transition out of the pandemic here.\n\nAnd the second question I had is just any more detail you can share on the Prevnar data in peds regarding the serotype coverage. I know that was a question that came out post the Phase 3 data.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nVery quickly on the Paxlovid, it is not very different than what is happening with the vaccine. There will be a transition period, we will have to announce this price, then we have to work with the U.S. government to transition so that when they stop distributing their, let's say, goods that they have, we will, let's say, start and we have a seamless transition. So the market will always become covered.\n\nBut we will give more details given these dynamics, what happens and when this happens, the transition next -- in the guidance for next year. Mikael, anything you have to say on the pediatrics.\n\nMikael Dolsten -- President of Worldwide Research and Development and Medical\n\nJust very brief that we have had positive studies in U.S. three plus one schedule, European Union two plus one, after either four or three doses, which is the toddler complete schedule. We covered 20 serotypes in U.S. and 19 in the EU.\n\nBut the totality of data for all endpoints, we believe, clearly speaks to that this is an important vaccine that adds coverage. And it's likely going to be the vaccine in the near term and for quite many years that have the broadest coverage.\n\nOperator\n\nNext, we have Chris Shibutani with Goldman Sachs.\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nIn terms of RSV, if you could share some thoughts in terms of the velocity of the uptake that you're expecting? Is flu a good barometer? And how quickly do you think, if that's the case, that we could possibly reach through? And then with etrasimod, in the previous owner's hands, there were additional opportunities, I believe, Crohn's disease data Phase 2, atopic dermatitis Phase 3 were originally in the time lines for calendar 2022. Will we get some insights on that -- those clinical programs?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nYes. I will ask, actually for the clinical programs, William, to speak a little bit about that.\n\nWilliam Pao -- Executive Vice President, Chief Development Officer\n\nYes. Sure. For etrasimod, there is nothing new to update at this time.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nAll right. And then for RSV, I would say, clearly, we think that could become like flu. I think all respiratory diseases eventually will have coverage like we have right now in flu. The question is how often that will happen.\n\nAnd that will depend on several factors. Education, of course, of the people and their physicians, but also the availability of combination programs and products that could significantly bring all three of them together, RSV, COVID, and flu.\n\nOperator\n\nNext, we have Umer Raffat with Evercore ISI.\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nI wanted to ask two questions on pricing today, if I may. Perhaps first one, Albert, I know the COVID vaccine repricing was a very bold decision. And I understand the dynamics around the value proposition, the pandemic versus endemic era pricing, etc. But I think the sheer magnitude of the increase is making a lot of investors ask questions around ESG implications, any political blowback, etc.\n\nI'm just curious how you guys thought about this very important decision and how you're thinking about the expectation on net pricing. And then separately, on Paxlovid. I know you're running a 10-day trial versus the five-day course that's currently approved. Does that mean Paxlovid will effectively become 2x the price once a 10-day course is approved?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nYes. I can answer both of them. Look, I think what was very bold and the right absolutely decision was to price the Paxlovid during the pandemic at a very, very, very low price. Clearly, the price that -- excuse me, the vaccine at a very, very low price.\n\nThat was the right thing to do, and we did it and we maintained that for the years to come. Now that we are coming to the end of this period, and as we are moving to very different products, which is very different presentations, which are -- now we are moving to single instead of mass viral multi-dose vial, we are pricing the vaccine according to the cost effectiveness, and the cost effectiveness of the current vaccine. The way that CDC is pricing, it is way, way, way below than what the price that we have set [Inaudible] start. Also keep in mind that people will not see any difference and the system will get the benefit of a cost-effective product.\n\nAnd the people wouldn't see the difference because there's no copay. Now on the Paxlovid, I think it's too early to speak. We haven't announced any price. And we do not know what will be the outcome of the studies or the outcome of a new class that is coming following it actually.\n\nSo now -- thank you very much.\n\nOperator\n\nOur last question will come from David Risinger with SVB Securities.\n\nDavid Risinger -- SVB Securities -- Analyst\n\nSo my two questions are regarding the core growth, which was 2% operationally in the third quarter, could you talk about what you're assuming and how we should think about growth prospects in the future, specifically in the fourth quarter since you've guided to that in your updated guidance. And then second, could you provide an update? And I might have missed this, if I did, I apologize. But could you provide an update on your next-gen oral antiviral for COVID?\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nThank you. One, on the 2% operational excluding COVID, just to make a clarification, if you exclude also the contract manufacturing business that we have, that was really COVID-related. It has very increased revenues last year because we were contract manufacturing for BioNTech territories. That we don't have to do now, because BioNTech took over for their territories their own manufacturing.\n\nIn fact, the growth was 4% of our pharmaceutical business, excluding COVID and excluding this piece of contract manufacturing. Now, Angela, based on that, what will we expect to be the growth trajectory?\n\nAngela Hwang -- President, Pfizer Biopharmaceuticals\n\nWell, we've talked about our five-year CAGR, right, to be 6%. And just I want to reiterate that, that is exactly the track that we're on. Every year does not necessarily have to look identical. But over the five-year period, we're absolutely confident that we're going to deliver the 6% CAGR.\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nAll right. So thank you very much. So with that, I think we are close to bring our call to a close. Please don't forget to attend our event on December 12, where we will provide details about our very important new product launches in the next 18 months and some of our most important pipeline potential, new medicines, and vaccines.\n\nThank you for joining us today. Have a great rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Stevo -- Senior Vice President and Chief Investor Relations Officer\n\nAlbert Bourla -- Chairman and Chief Executive Officer\n\nDave Denton -- Chief Financial Officer\n\nMikael Dolsten -- President of Worldwide Research and Development and Medical\n\nColin Bristow -- UBS -- Analyst\n\nAamir Malik -- Chief Business and Innovation Officer\n\nLouise Chen -- Cantor Fitzgerald -- Analyst\n\nAngela Hwang -- President, Pfizer Biopharmaceuticals\n\nSteve Scala -- Cowen and Company -- Analyst\n\nRobyn Karnauskas -- Truist Securities -- Analyst\n\nWilliam Pao -- Executive Vice President, Chief Development Officer\n\nAndrew Baum -- Citi -- Analyst\n\nEvan Seigerman -- BMO Capital Markets -- Analyst\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nBrian Tsang -- Wolfe Research -- Analyst\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nTerence Flynn -- Morgan Stanley -- Analyst\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nDavid Risinger -- SVB Securities -- Analyst\n\nMore PFE analysis\n\nAll earnings call transcripts"
}