{
  "companyName": "Olo Inc.",
  "companyTicker": "OLO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/olo-inc-olo-q2-2022-earnings-call-transcript/",
  "content": "Olo Inc. (OLO 1.13%)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Paul, and I will be your conference operator for today. At this time, I would like to welcome everyone to the Olo second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded.\n\nI would now like to turn the call over to Olo's vice president of investor relations, Ms. Stephanie Daukas. Please go ahead.\n\nStephanie Daukus -- Vice President, Investor Relations\n\nThank you. Good afternoon, everyone, and welcome to Olo's second quarter 2022 earnings conference call. Joining me today are Noah Glass, Olo's founder and CEO; and Peter Benevides, Olo's CFO. During our call today, some of our discussion and responses to your questions may contain certain forward-looking statements, which represent our beliefs and assumptions only as of the date such statements are made.\n\nThese forward-looking statements include, but are not limited to, statements regarding our expectations of our business, future financial results, total addressable market and growth opportunity and guidance and strategy. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those described in our forward-looking statements and such risks are described in our earnings release and our risk factors, including in our SEC filings, including our quarterly report on Form 10-Q for the quarter ended June 30, 2022. You should not rely on our forward-looking statements as predictions of future events. We undertake no obligations to update any forward-looking statements made during this call to reflect events or circumstances after today.\n\nAlso during this call, we'll present both GAAP and non-GAAP financial measures. Reconciliations to the most directly comparable GAAP financial measures are available in our earnings release, which we issued a short while ago. This earnings release is available on the Investor Relations page of our website and is included as an exhibit in the Form 8-K furnished to the SEC. Finally, in terms of our prepared remarks or in response to your questions, we may offer incremental metrics.\n\nPlease be advised that this additional detail may be onetime in nature, and we may or may not provide an update in the future on these metrics. I encourage you to visit our investor relations website at investors.olo.com to access our earnings release, investor presentation, periodic SEC reports, a webcast replay of today's call or to learn more about Olo. With that, let me turn the call over to Noah.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nThank you, Stephanie. Hi, everyone. Thank you for spending time with us today. Olo delivered solid second quarter results.\n\nWe generated $45.6 million in total revenue, a 27% increase year over year, as our platform supported continued growth in new brands, increased module adoption within our existing customer base and increased transaction volume. We increased average revenue per unit, or ARPU, to $544, 12% year over year and 5% sequentially as existing customers adopted additional modules, including early adoption of Olo Pay. We deployed roughly 3,000 new locations to the platform with ending active locations increasing 11% year over year, flat sequentially to approximately 82,000. More on that in a moment.\n\nWe're excited to have welcomed a number of leading brands to the Olo platform this quarter. These brands span various hospitality service models from quick service to fine dining and virtual brands to convenience stores or C-stores. Most notably, Freddy's Frozen Custard & Steakburgers, a fast casual restaurant with hundreds of locations, deployed Olo's full stack of digital ordering solutions this quarter, including Ordering, Dispatch, Rails, Network and Olo Pay. Freddy's represents one of our newest and largest customers to adopt Olo Pay.\n\nIn addition to welcoming new brands to the platform this quarter, we expanded relationships within our existing customer base, increasing adoption of products across several Olo product suites, brands such as California Fish Grill, CiCis Pizza and Duck Donuts expanded their usage of ordering solutions. Twin Peaks and Whataburger expanded their usage of Delivery Enablement solutions. O'Charley's Restaurant + Bar and Sprinkles adopted Guest Engagement solutions. And On the Border and Smokey Bones adopted Front-of-House solutions.\n\nAs Olo continues to innovate in order to help restaurants embrace their digital opportunity by offering more mission-critical solutions, such as Olo Pay and Guest Engagement, we expect an increase in share of our revenues to be driven by upsells. In the same way that customer expansion is an important growth driver for the company, we continue to be excited by the momentum of our on-premise digital ordering solutions, which are supercharging our restaurants in their pursuit to be 100% digital. For example, last quarter, I spoke of Nando's, a fast casual restaurant utilizing Serve as its exclusive dine-in ordering system as well as the benefits associated with this offering, specifically increasing basket size, higher staff tips and operational efficiencies. Given these benefits, this quarter, the brand signed on to adopt our Olo Pay solution, combining our best-in-class solutions for both on-premise digital ordering and payments.\n\nThese examples of adding new brands to the platform, expanding within our existing customer base, including enabling on-premise digital ordering and increasing revenue per order are reflective of Olo executing toward our 100x opportunity. And while encouraged by the underlying trends in support of our 100x opportunity, we remain highly focused on helping our brands navigate through several macroeconomic challenges. Currently, the industry is facing major challenges brought on by the residual impacts of the COVID-19 pandemic, including structural labor challenges, margin pressure due to inflationary economic conditions as well as supply chain challenges and resulting concerns related to a recessionary environment. These industry dynamics have impacted our customers and prospects in two ways.\n\nAt the brand level, these challenges have resulted in elongated sales cycles as fewer brand resources have lengthened the decision-making process. And at the operator level, these challenges have resulted in elongated deployment time lines as many operators are unable to deploy in a timely manner. While we continue to actively work to help alleviate these issues at the brand and operator levels through product enhancements, expanding our network of implementation partners and directly managing more of the deployment process, we anticipate both of these dynamics to continue through the balance of the year and, therefore, have factored in lower expectations for net new deployments and revenue in the second half of the year. That said, it's our belief that over time, restaurants will increasingly rely on technology to alleviate macroeconomic pressures, improve profitability, ease operational burdens and enable digital hospitality to drive or repeat business and increase revenues.\n\nAs this trend continues, Olo is well positioned to help brands achieve their digital ambitions through our modular suite of order management, delivery enablement, guest engagement, front-of-house and payment solutions. Olo can be a force multiplier in helping brands address macroeconomic challenges while realizing their digital goals in a cost-effective and operationally lean manner. Regarding recessionary dynamics, I'd like to remind investors that unlike other retail categories, food is nondiscretionary. Consumers tend to eat 20 to 25 times every week.\n\nAnd in times like these, consumers don't typically begin to cook. Instead, they trade down. This is a phenomenon that Olo witnessed firsthand in 2008 and 2009 when consumers purchase food from lower ticket size restaurants with greater prevalence. In fact, the on-demand food dollar, which we define as total spend on food to be eaten away from home, has consistently shifted two restaurants versus grocery even through recessions, accounting for $1.17 trillion in 2021 or 55% of total food expenditures.\n\nOlo's customer base, consisting of enterprise brands primarily within the limited service, quick service and fast casual segments leaves Olo in a favorable position as these types of restaurants have fared well during economic slowdowns. As we look at the opportunity ahead, I'm excited to have new sales leadership to help Olo realize this opportunity. Since our last call, we've welcomed Diego Panama as our Chief Revenue Officer. As a reminder, Diego is a seasoned public company executive with a proven track record of successfully scaling SaaS companies, bringing deep and relevant domain knowledge as well as go-to-market experience on a global scale.\n\nWe look forward to Diego amping up our go-to-market and deployment strategies that will drive long-term durable growth. As I mentioned earlier, this quarter, we deployed roughly 3,000 new locations to the platform with ending active locations increasing 11% year over year, flat sequentially to approximately 82,000. This quarter, our active location count was impacted by a change in our relationship with Subway. In February of 2020, we announced a relationship with Subway in which approximately 15,000 locations would utilize the Rails module to integrate and manage third-party marketplace orders.\n\nCertain Subway locations began directly integrating with marketplaces, impacting our ending active location count by roughly 2,500 locations in the second quarter. We expect Subway's direct marketplace integration to continue with the balance of their locations being removed from our total active location count in the fourth quarter of this year or the first quarter of 2023. This is not a trend we expect to experience broadly as Subway's global proprietary point-of-sale platform is an unusual circumstance in the industry and not representative of the broader long-term opportunity with our current or prospective customers. As brands continue to navigate through macro uncertainties, this quarter, we continue to implement product enhancements to better serve our customers, including launching several innovations in our first-ever summer release event.\n\nSecond quarter product advancements include: first, we launched borderless Olo Pay in pilot with three brands on July 5. As a reminder, borderless capabilities allow guests to securely speed through an accelerated checkout at any participating restaurant within the Olo Pay network, whether through app, website or on-premise. This is possible as borderless Olo Pay stores payment credentials at the platform and brand level, allowing seamless checkout regardless of the restaurant a consumer transacts with. Borderless will enable brands to capture data for guests without requiring guests to create a new account for every brand.\n\nEarly results are compelling, with 76% of guests saving their credit card information for future purchases, roughly 2.5 times the average number of guests saving their cards on file. We've also observed a meaningful increase in basket conversion rates, leading to increased revenues and transactions for restaurants and Olo. And we're on track to expand borderless capabilities to more restaurant brands before the end of the year. Second, we furthered our commitment to being an open platform by growing our diverse technology partner network in two ways: one, by completing our first ordering integration with QSR Automations, a market leader in kitchen display systems or KDS.\n\nKDS integrations enable Olo customers to see and optimize all orders, whether on or off-premise providing a 360-degree view of all orders in production. This information will allow Olo to provide brands with operational decision-making abilities by including capacity management features that quote and throttle orders based on the real-time kitchen activity levels, ultimately creating a more integrated technology solution for restaurants and expanding our vertical offerings throughout the restaurant value chain. Two, through strategically partnering with two leading geo-fencing platforms, Flybuy from Radius Networks and Radar. These partnerships ensure guests receive food as fresh as possible, minimizing pickup and drive-through wait times through the use of location-aware technology, augmenting QSR digital ordering programs.\n\nOlo's growing open ecosystem of more than 300 integrated technology and service partners that span the full digital tech stack from enterprise-ready solutions to emerging technologies is essential to delivering a best-in-class experience powered by the Olo platform. Our partnerships also create a flywheel in which adding a new customer to our restaurant network benefits all Olo partners and adding a new technology partner to our partner network benefits all Olo customers. Third, we continue to invest in enhancing the Olo platform by introducing new features that help our customers provide digital hospitality. For example, we added a party seated webhook, which emits an event when a wait list or reservation party is seated from the Olo host app.\n\nThis unlocks the ability to fire a queued order to the kitchen when a guest arrives to be seated, unlocking a win-win for guests and restaurant with faster service and increased table turns. I'm proud that Olo continues to implement product enhancements to better serve our customers, and I'm glad the industry recognizes it. Recently, we earned best feature set and best relationship from the TrustRadius Best of Summer awards. We are honored to support our restaurant brands and look forward to delivering on the high expectations they set for us, and we'll continue to make advancements in our partner network, platform and products for the benefit of our customers and to rev up the engine of hospitality.\n\nAnd finally, as I typically do on earnings calls, I'd like to provide a corporate update. Olo is committed to building a diverse and inclusive culture that promotes growth and equity for underrepresented groups, while supporting and celebrating all voices and perspectives. In the spirit of transparency and commitment to this effort, we've updated our DEI website with gender and ethnicity metrics as of June 30, and we remain on track to have our team be comprised of 42% women and 18% underrepresented ethnicities by 2024. We also furthered our commitment to equity by adopting a new equitable access to healthcare policy, signing the Human Rights Watch business statement on anti-LGBTQ legislation to support our LGBTQ+ employee population and signing the Don't Ban Equality statement in response to the U.S.\n\nSupreme Court's Dob's decision. I am personally honored to be deeply involved in these efforts, along with my executive team as DEI is hugely important to our success as a company and as a pillar in the community. To close, we believe now more than ever that Olo is a mission-critical solution that will enable brands to be successful in spite of the current macro environment. To do more with less, relieving labor challenges, increasing operational efficiencies and enabling every guest to feel like a regular.\n\nWe're encouraged by the underlying trends in our business in support of Olo's 100x revenue opportunity as we remain highly focused on helping our brands to thrive and gain share through the industry's digital transformation. And with that, I'd like to hand it over to Peter to discuss more detailed results. Peter?\n\nPeter Benevides -- Chief Financial Officer\n\nThanks, Noah. In the second quarter, we grew revenues as we added new brands to the platform, continue to increase module adoption within our existing customer base and increased transaction volume on the platform. Total revenue in the second quarter was $45.6 million, an increase of 27% year over year. Platform revenue in the second quarter was $44.5 million, an increase of 29% year over year.\n\nIn terms of key metrics, we ended the quarter with approximately 82,000 active locations on the platform, an 11% increase year over year and flat sequentially. While we added roughly 3,000 new locations to the platform this quarter, net new locations were impacted by a portion of Subway locations coming off of the platform. As mentioned earlier, we anticipate this trend to continue through the balance of the year, which I'll address in more detail in a moment. ARPU for the second quarter was approximately $544, representing a 12% increase year over year and a 5% increase sequentially.\n\nContinued growth in ARPU was driven by further expansion within our existing customer base and to a lesser extent, fewer Subway locations on the platform, whereby their relative ARPU is less than other Olo customers. And lastly, net revenue retention in the second quarter was approximately 106%. It would have been 500 basis points higher, excluding the impact of Subway. For the remainder of the financial metrics disclosed unless otherwise noted, I will be referencing non-GAAP financial measures.\n\nGross profit for the second quarter was $34 million. This compares to $29.5 million a year ago. The year-over-year increase in gross profit was driven by continued growth in revenue partially offset by incremental costs associated with our current Wisely and Omnivore acquisitions, increased compensation costs to support new locations coming on to the platform and to a lesser extent, processing costs associated with Olo Pay. Sales and marketing expense for the second quarter was $7.2 million or 16% of total revenue.\n\nThis compares to $3.2 million and 9% a year ago. As a reminder, this past quarter, we held our first in-person user conference in two years, beyond four, which increased sales and marketing expenses for the period by approximately $1 million. Research and development expense for the second quarter was $13.8 million or 30% of total revenue compared to $11.1 million a year ago or 31% of total revenue. General and administrative expense for the second quarter was $11.1 million or 24% of total revenue.\n\nThis compares to $8.8 million and 25% a year ago. Operating income for the second quarter was $2 million compared to $6.5 million a year ago. Net income in the second quarter was $2.2 million, or $0.01 per share based on approximately 181.9 million fully diluted weighted average shares outstanding. Turning our attention to the balance sheet and cash flow statement.\n\nOur cash, cash equivalents and short and long-term investments totaled $464.7 million as of June 30, 2022. Regarding cash flows, net cash provided by operating activities was flat in the quarter as compared to net cash provided by operating activities of $11.3 million a year ago. Free cash flow was negative $3 million, as compared to positive $10.8 million a year ago. We believe our strong balance sheet puts us in a good position to proactively capitalize on our 100x opportunity while continuing to be prudent capital allocators with rigorous operating discipline as we have in the past.\n\nI'll wrap up by providing our guidance for the third quarter and full year 2022. For the third quarter, we expect revenue in the range of $46.5 million and $47 million and non-GAAP operating income in the range of $1.8 million and $2.2 million. For the fiscal year 2022, we now expect revenue in the range of $183 million and $184 million and non-GAAP operating income in the range of $7.6 million and $8.4 million. In terms of guidance for the year, there are a few things to highlight.\n\nFirst, as previously mentioned, macroeconomic challenges at the brand and operator level have resulted in elongated deployment in sales cycles, impacting revenue in the back half of the year. While the pipeline remains robust and we continue to actively work to help alleviate these issues, we anticipate both of these dynamics to continue through the balance of the year and therefore, have factored in lower expectations for new deployments in the back half of the year. Second, we're encouraged by the continued enthusiasm, early adoption and performance metrics of Olo Pay. Given this momentum, we have now factored a few million dollars of revenue into our assumptions for the year.\n\nThird, consumer demand for digital ordering continues to prove durable. Data from NPD demonstrated that roughly 15% of restaurant transactions in the second quarter were digital, levels consistent with the past three quarters. This data supports the fact that the increase in digital transactions in recent years is a secular trend. While we expect the digital transactions to continue to grow over the long term, we remain prudent in our approach to forecasting digital transaction volumes in the near term.\n\nFourth, as mentioned earlier, we expect the balance of Subway locations to directly integrate with marketplaces in the fourth quarter. While this will likely impact our ending active location counts in the fourth quarter of this year or the first quarter of 2023, it did not impact the third quarter or full year guide. Said another way, based on our understanding of Subway's longer-term business plans, we believe the relationship could evolve sometime this year with a wide range of outcomes and took a conservative approach to our relationship with Subway in our prior guidance. And lastly, we continue to focus on capitalizing on the large opportunity ahead of us while maintaining profitability, which is reflected in our updated guidance.\n\nStrong discipline in capital efficiency are intrinsic to Olo. Over our history, we have demonstrated our ability to generate profits while meeting increased demand and providing new and innovative products to our customers cost effectively. We expect that this year will be no exception. And with that, I'd like to now turn it back over to the operator to begin Q&A.\n\nOperator\n\n[Operator instructions] Our first question is from Terry Tillman with Truist Securities. Please proceed with your question.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah, good afternoon. Thanks for taking my questions. I have two questions. The first one is a two-parter, though.\n\nI guess, Noah, in terms of the elongated sales cycles, is this sporadic? Or is it across the emerging and large brands as well? And what are they saying? Are they going to wait a couple of quarters because this could have implications into next year? So just a little bit more on that. And then Peter had mentioned something at the end of his prepared remarks about Subway. I was kind of confused. This midpoint reduction that doesn't include any Subway? I just need to understand that better.\n\nAnd then I had a follow-up on Olo Pay.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nSure, Terry. This is Noah. I'll jump in on elongated sales and deployment cycles. I think this is a temporary matter, something that restaurants are dealing with at the brand level and at the operator level.\n\nAt the brand level, it's really reflected in elongated sales cycles of selling into different constituents within the restaurant, headquarters, someone in operations, someone in technology, someone in marketing for the different product suites, having a lot of things on their plate at the moment in the environment you're operating in where you have very high inflation in wholesale food prices labor concerns, et cetera. So I think that is something that is transitory from the brand level. At the operator level, that's really manifesting in the elongated deployment cycles where it just takes longer for us to have the restaurant operators doing what they need to do to get live and up and running on the platform. So as we mentioned, we're taking a number of steps on that.\n\nWe're doing things to the platform to make it easier for operators to do deployments on their own. We're also working with more third-party resources around deployment, implementation with firms, doing more -- taking on more ourselves to speed up deployment cycles. But that's how it's manifesting in sales and deployments.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nGot it. And then -- yes, go ahead. Sorry, Peter.\n\nPeter Benevides -- Chief Financial Officer\n\nYes. The second part of your question there in terms of Subway and implications on the guide. So when we entered the year, there was indication that Subway may plan to directly integrate with marketplaces. But at that point in time, the time line was unclear.\n\nSo like all data points and assumptions that feed the model, we took that information, we factored in the possibility that Subway may integrate directly by doing two things: one, reducing their transaction volumes throughout the year and in turn, reducing a portion of their revenue contribution throughout the year. So as that has begun to happen, the guidance for both the third quarter and the full year are aligned.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nOK. Just a final question and I'll turn it over is, I mean, on the glass-half full side here, Olo Pay sounds like an exciting opportunity. Borderless came out with summer release, and that's great. What are you seeing in terms of the aspirational goal of four x kind of ARPU lift? And how do you see this attach rate kind of playing out in that $2 million or so building into next year?\n\nNoah Glass -- Founder and Chief Executive Officer\n\nYes, Terry. This is Noah. I'll take that one. So yes, borderless, we were excited to talk about borderless for the first time in February, and we sort of thought that it would happen at some point this year.\n\nIt was great to be able to get it out in pilot, with three pilots on July 5 and have now over a month of -- we're really encouraged by what we're seeing primarily around how many of the guests using borderless are creating accounts and are saving cards on file. I mentioned in the prepared remarks, that number is 76% of guests who are ordering through borderless or saving account file and saving a credit card on that account. And that is 2.5 times with a typical checkout looks like in a non-borderless scenario with statistically significant numbers. I mean this is a material number of accounts that have been created.\n\nSo that's very exciting. There is nothing that is required for us to see that four x lift in revenue per transaction. That's just the very nature of Olo serving as both the order processor and the payment processor when we're the payment processor in the form of Olo Pay. So that's playing out exactly as we knew that it would.\n\nAnd it's really exciting to see brands adopting Olo Pay and adopt borderless and seeing the wins for the guest experience and for more transactions actually manifesting through higher basket conversion rates and customers saving accounts on file and cards on file to speed through checkout the next time around. So highly encouraged by what we're seeing from those three pilots, borderless, Olo Pay brands, and excited to have more brands come on to the borderless form of pay through the end of the year.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Matt Hedberg with RBC Capital Markets. Please proceed with your question.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat guys. Thanks for taking my question. So follow-up on Subway. So it sounds like, just to be clear, when you started the year, you assumed less Subway contributions, and it seems like that is playing out.\n\nAnd so I just maybe wanted to confirm that. But then I guess, the two follow-ups to that are -- can you help us think about -- I know you said a Subway carries lower ARPU than your corporate average. But just sort of any sort of rough idea of how much lower it is than your base? And second, how do you weigh the possibility of Subway leaving? I know you said you don't think that's maybe likely, if I think I heard you say that correctly, but maybe just understand sort of the risks and the opportunities with Subway?\n\nPeter Benevides -- Chief Financial Officer\n\nYes. So this is Peter. I can take the first couple of questions there, Matt. So in terms of how we factored Subway into the year as we enter the year in sort of the relative ARPU contribution.\n\nSo on a full year basis, Subway contributed about a few million dollars of revenue on a full year basis. And what we had done during the year is really start to tail that off in the second quarter through the balance of the year, really as a hedge to some of the indications that we had heard as we entered the year. Now in terms of their ARPU contribution, it is -- I would say it's about one-thirds of kind of the platform average on a quarterly basis. And the reason why it is lower than the platform average is because they are a single module customer.\n\nThey subscribe only to the Rails module. And as we disclosed at the end of last year, on average, customers subscribe to 2.7 modules per location. So the ARPU tends to be much higher on multi-module locations, but that's sort of the thinking that went into planning the year and what that means from an ARPU contribution.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nAnd Matt, I'll jump in on the second part. So what I said in the prepared remarks was not that I didn't think that Subway would taper off as Peter just described, but rather that we didn't think that this was representative of a large -- so we continue to have a really great respect for the Subway team and vice versa and to help with the Subway team and really every restaurant brand that is representative of top 20 enterprise restaurant brands. This is a moment in time in these macroeconomic conditions where every dollar in the restaurants budget is being scrutinized and the wisdom of a SaaS platform that can enable a brand to repurpose its spend to have a higher purpose to really differentiated capabilities and use Olo as a SaaS platform underneath is making a lot of sense to restaurant brands. We're hearing them say that we can do more of what we have in our digital position with the same digital budget by utilizing components of the Olo platform, that's a great thing for us.\n\nSo I think that's why we feel there's a great opportunity for us with the top 20 restaurant brands that are out there. We feel like those are conversations that we'll continue to have, and we'll continue beating the drum about why we believe and why we think commonly across people are waking up to the philosophy that SaaS is superior to homegrown software.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGot it. Thanks a lot. Super helpful. Thanks.\n\nOperator\n\nOur next question comes from Brent Bracelin with Piper Sandler. Please proceed with your question.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThanks for taking the question. And good afternoon. I had one for Noah and a couple of follow-ups for Peter. Noah, Obviously, the loss of Subway here relative to the QSR space, it feels like a little bit of a step back.\n\nAnd I was hoping if you could just weigh on the QSR opportunity. Give us a kind of current state of affairs. What's the next largest QSR brand that you have beyond Subway? And how are you generally looking at that market opportunity kind of going forward? Love to get a current viewpoint on QSR.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nSo Brent, it's a great question. Subway, I think if they're a QSR fast food shift or in some ways, sort of a fast casual concept. They don't typically have drive-through operations that tends to be kind of the hallmark of QSR brands. They do this wall and build sandwich and then pay at the end of the transaction.\n\nSo a little bit different than the way that most QSR brands work. But I think that your point more broadly is thinking about these large enterprise restaurant brands and what needs are and how our solutions kind of map to those needs. So I think we look at -- well, first, the answer that I just gave around why we believe that SaaS is superior to homegrown software and that all restaurant brands, no matter the size, can benefit from the platform that we've built and also from the platform innovations that we've built with 82,000 restaurants on the platform, which is more than any individual restaurant has in their portfolio. But also to the drive-thru operation, which is so important for QSR, these product innovations that I mentioned around geo-fencing and are plug in with Flybuy by Radius Networks and Radar to really speed up that handoff at drive-thru.\n\nI think that's a really compelling new benefit of our solution for the QSR operators. If I look across our portfolio, I mean, we have a lot of QSR brands that we've welcomed just since our IPO. If you look at Carl's Jr. and Hardee's, CKE.\n\nIf you look at Culver's, if you look at Whataburger, I mean these are traditional QSR operators, and I think that's a big area of opportunity for us and is a really ripe area for us to go and penetrate in the coming quarters.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nHelpful color there. And then just as a follow-up, Peter, for you. I think you talked about 3,000 net adds in the quarter, 2,500 Subway locations that obviously suggests there might be other restaurants here. So just trying to understand, did you see other restaurants churn beyond subway in the quarter? Or is that just kind of rounding?\n\nPeter Benevides -- Chief Financial Officer\n\nThat's just rounding. Yes.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nOK. That's helpful. And then I know you talked about Subway being a few million dollars. I just wanted to dive into the guidance.\n\nSecond half reduction is about $12 million -- a little over $12 million for the second half. And how much of that is -- would you attribute to kind of derisking Subway here versus other macro factors, longing sales cycles? Just trying to better understand a few million dollar contribution some Subway and a $12 million guide down?\n\nPeter Benevides -- Chief Financial Officer\n\nYes. So sorry if I was a little confusing on that. So in terms of Subway, nothing attributed to the evolving relationship with Subway. Again, that was something we had an indication of as we entered the year, factored that into the model and as Subway has started to roll off the platform that is aligned with the underlying conservatism that we baked into the year as we set guidance back in February.\n\nIn terms of the two dynamics that are impacting the full year guide, it really is a healthy mix of both between elongating sales cycles and deployments taking longer than we anticipated when we walked into the year. In terms of sales cycles, there's really two underlying dynamics driving our year-to-date performance. So first, for deals that we've signed, many of the large deals happened really late into the second quarter, which means based on our standard deployment time line, revenue won't be recognized on those deals until sometime in 2023. And then for deals that did not close in the quarter, those conversations are ongoing and have been ongoing longer than our typical sales cycle.\n\nSo those two are pushing into 2023. As for deployments, now we walked into the year with a sufficient pipeline of activity to deploy, but the time to deploy projects really across all modules have elongated for the primary reasons that we talked about on our prepared remarks, constraints at the brand and operator level. And just to go a level deeper there, we have several brands, which in total represent several thousands of locations that are partially deployed. So they're at some stage of the deployment process.\n\nAnd it is our practice that we don't announce brand deployments until we've reached a critical mass, until we've nearly deployed the entire franchisee network. That's when we typically announce the deployment. We have a number of brands again that are in the deployment process and making progress, but the progress has been much slower than we anticipated and much slower than we've historically done, which is what's creating some of that impact in the back half of the year.\n\nOperator\n\nOur next question comes from Stephen Sheldon with William Blair. Please proceed with your question.\n\nPatrick McIlwee -- William Blair and Company -- Analyst\n\nHey, this is Patrick McIlwee on for Stephen this evening. So aside from the moving pieces with Subway, it seems like NRR took a nice step up this quarter. Can you just talk a bit more about the dynamics at play there and how we might expect that to trend for the remainder of the year?\n\nPeter Benevides -- Chief Financial Officer\n\nYes. So this is consistent with what I believe we talked about on the last call, which is we anticipated NRR to improve throughout the year as multi-module adoption increased and transaction volumes increase throughout the year. And that's really what is sort of underlying that improvement in NRR. I think we'll continue to see some modest improvement as we go throughout the year and I think into 2023, presumably as Olo Pay becomes a larger portion of the mix that will help to grow NRR over time.\n\nBut again, what you're seeing there is consistent with what we anticipated as we entered the quarter.\n\nPatrick McIlwee -- William Blair and Company -- Analyst\n\nGot it. OK. And then can you just give us an update on how the cross-sell of Wisely has been since you've plugged that in and what the reception has been like there?\n\nNoah Glass -- Founder and Chief Executive Officer\n\nYes. This is Noah. So this has been a really successful cross-sell motion. We're excited about how brands are seeing the next logical step in getting great addition -- being around guest engagement and specifically having a first-rate guest data platform where they can really measure guest lifetime value of all of their guests.\n\nSo we announced a couple of the new brands to come on to the guest -- suite. We also announced Olo -- the brands that are coming on to the host suite, which is managing table wait and wait list and reservation. I think across the board, we're really pleased with the fit that we're seeing between, but Wisely brought to our solution set and what our restaurant customers are looking for as they're seeking to really engage with their guests in a direct manner and increase the hospitality they can offer and so doing increased guest lifetime value?\n\nOperator\n\n[Operator instructions] Our next question comes from Brad Reback with Stifel. Please proceed with your question.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. Peter, can you give us some sense on active locations or active vending locations for 3Q and the year just to try to level set, so we're all on the same page?\n\nPeter Benevides -- Chief Financial Officer\n\nYes. So what's implied in the guide, Brad, is adding an incremental 2,000 locations per quarter between now and the balance of the year. As we noted on the call, we anticipate Subway to fully roll off in the fourth quarter and into the first quarter of next year. Now the nuance there is with respect to Subway or in general, we count a location active in the quarter if they've had an order in the quarter.\n\nSo to the extent Subway starts to roll off in Q4, but generates an order at some point in the quarter will count those active locations. And then in the first quarter is where you'll see the full impact of Subway rolling off the platform.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nOK. So that's 2,000 net, not growth, right?\n\nPeter Benevides -- Chief Financial Officer\n\nThat is 2,000 net. That's correct.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nOK. That's great. Switching gears, I don't know for you or for Noah. Given that Subway's sort of been an ongoing thing for you guys for a couple of quarters here, are there any other large brands out there that are having similar discussions or where you feel there's the risk that they may terminate? Thanks.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nHey, Brad. This is Noah. So no, we truly believe that Subway is -- and we believe that because Subway has this global proprietary point-of-sale and digital ordering platform, all built in-house. It's consistent around the globe.\n\nAnd they were only using Olo for the Rails module. So they're in a unique position to have leverage with marketplaces to have that direct integration conversation with them. That puts them in a very place in any brand. Typically, we have restaurant brand customers at the end of last year on 2.7 product modules of Olo's and the more product modules that they're on, the more mission critical, we believe, with that are and the more value that we're generating.\n\nSo I think you should think of Subway as an anomaly in this case and not just in our restaurant customer population really in the restaurant industry itself.\n\nOperator\n\n[Operator instructions] There are no further questions at this time. I would like to turn the floor back over to Noah Glass for any closing comments.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nOK. Well, thank you all for joining us again today. We're honored to -- mission-critical platform for a growing roster of customers as the engine of hospitality, helping restaurants make every guest feel like a regular -- to your hard work and execution, miles to go before we sleep.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStephanie Daukus -- Vice President, Investor Relations\n\nNoah Glass -- Founder and Chief Executive Officer\n\nPeter Benevides -- Chief Financial Officer\n\nTerry Tillman -- Truist Securities -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nPatrick McIlwee -- William Blair and Company -- Analyst\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nMore OLO analysis\n\nAll earnings call transcripts"
}