{
  "companyName": "Freshworks Inc.",
  "companyTicker": "FRSH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/freshworks-inc-frsh-q3-2022-earnings-call-transcri/",
  "content": "Freshworks Inc. (FRSH 1.31%)\nQ3 2022 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Freshworks third quarter 2022 earnings call. [Operator instructions] I would now like to turn the call over to your host, Joon Huh, you may begin.\n\nJoon Huh -- Vice President, Investor Relations\n\nThank you. Good afternoon, and welcome to Freshworks third quarter 2022 earnings conference call. Joining me today are Girish Mathrubootham, Freshworks' chief executive officer; Dennis Woodside, Freshworks president; and Tyler Sloat, Freshworks' chief financial officer. The primary purpose of today's call is to provide you with information regarding our third quarter 2022 performance and our financial outlook for our fourth quarter and full year 2022.\n\nSome of our discussion and responses to your questions may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on Freshworks current expectations and estimates about its business its industry and macroeconomic environment in which it operates. Management's beliefs and the ability to continue to operate efficiently and drive growth and certain other assumptions made by the company as of the date hereof, all of which are subject to change. These statements are subject to risks, uncertainties and assumptions that could cause actual results to differ materially from those projected in the forward-looking statements.\n\nFor a discussion of material risks and other important factors that could affect our results, please refer to today's earnings release, our most recently filed Form 10-Q and other periodic filings with the SEC. Freshworks assumes no obligation to update any forward-looking statements in order to reflect events or circumstances that may arise after the date of this presentation, except as required by law. During the course of today's call, we will refer to certain non-GAAP financial measures. Reconciliations between GAAP and non-GAAP financial measures are included in our earnings release, which is available on our investor relations website at ir.freshworks.com.\n\nI encourage you to visit our investor relations site to access our earnings release, periodic SEC reports, a replay of today's call or to learn more about Freshworks. And with that, let me turn it over to Girish.\n\nGirish Mathrubootham -- Chief Executive Officer\n\nThank you, Joon. Good afternoon, everyone, and welcome to the Freshworks Q3 earnings call. We delivered a strong quarter with $128.8 million in revenue, which represents growth of 37% on a constant currency basis. Our non-GAAP operating loss came in well ahead of expectations as we adjusted our spend in a changing macro environment.\n\nOverall, we continue to operate efficiently while growing at a healthy rate. In Q3, we added approximately 1,700 new customers and saw good momentum in new business led by Freshservice. This quarter, we crossed over 61,000 customers as our powerfully simple products for consumer brands like HelloFresh and Plume and B2B companies like Dynata and Altasciences. This quarter, we added some exciting new features across all three business lines.\n\nSpecifically, in CX, we continue to make enhancements to the Freshchat product to help support teams engage conversationally with their customers. Earlier this year, we added new channels like Instagram, Google Business Messages and WhatsApp. In Q3, we invested in making the agent experience of managing those channels even easier. An exciting new addition in Freshchat is the ability to bring support for customer emails into the unified agent inbox.\n\nWe have also added new auto-complete responses that turns Freshchat into a high-speed engagement solution for model CX space. An exciting new feature in our Freshdesk product is the Freddy auto-triage feature where the system automatically categorizes, prioritizes and routes the ticket to the right support agent or group saving agents' hours of manual effort, giving them time to focus on solving critical issue. Together, Freshchat and Freshdesk improve the agent and customer experience. An example of this is Blueknight, a leading online retailer of fine jewelry, who uses Freshdesk and Freshchat to resolve approximately 90% of its customer queries in the first touch point.\n\n200 agents are able to engage their customers across telephone, email and chat channels. Blue Nile also recently added Freshsales to offer personalized experiences across the entire customer life cycle. We also enhanced our unified CRM solution by adding AI-powered features to help sales and marketing teams increased productivity to win more business. Our Freddy AI for Freshsales, new intelligent lead scoring, help businesses understand how customers use their product and who's ready to buy more.\n\nThe AI learns from customer data and behavior to deliver insights and predictions that help companies make data-driven decisions and have more personalized conversations with their customers. A large American HVAC manufacturer of more than 200,000 products chose Freshsales with Freshdesk to unify its new business and upsell processes. The new predictive lead scoring identifies buyers that are most likely to reorder and alert sellers, ensuring that they can stay on top of customer requests and orders. The unified Freshworks dashboard create alignment across sales, marketing and support teams ultimately helping the company deliver more value to their customers.\n\nWe also help our customers create incredible employee experiences. That's why we have made it easier and more secure to extend Freshservice beyond the IT department to now support all business teams. There are already thousands of companies who use Freshservice within HR, finance and legal teams to support their internal stakeholders. Databricks, for example, after using Freshservice to support the IT needs of 4,500 employees, Databricks expanded its deployment to HR, legal, security and learning and development departments to provide its employees with the same great experience when interacting with any team internally.\n\nRecently, we announced an exciting new module, Freshservice for Business Teams with capabilities that enable departments beyond IT to offer a modern employee experience. What makes Freshservice for Business Teams unique is the support for private workspaces for every team. These new workspaces within Freshservice empower the HR, finance, legal or any internal operations team with the ability to manage employee requests and automate their departmental workflow. Multiple teams can coexist independently within a single Freshservice instance with the ability to configure, manage and control access to their industrial workspaces.\n\nViessmann, a German provider of climate solution with EUR 3.4 billion in revenue is another customer that cemented our decision to launch this product. Viessmann has 13,000 employees spread across 74 countries and their people organization and IT team use Freshservice to unify their internal teams with a single service management solution for a fast, easy and seamless employee experience. Companies of all sizes are realizing the benefit of expanding IT service management principles to non-IT departments, empowering the employee experience with uninterrupted service delivery. What makes all of these product innovations possible is our platform, Freshworks Neo.\n\nIt has evolved from being a set of internally focused shared platform services and analytics, deployed across Freshworks products to a customer-impacting developer-friendly platform that makes building apps for fresher products faster and easier. Today, more than our customers extend the core utility of our products through the Freshworks marketplace and custom-built apps powered by the Neo Platform. In Q3, our team built a brand-new SaaS application entirely on top of the Neo Platform, an NPS survey tool to help businesses run surveys to measure customer satisfaction and delight. We are using it internally for now, but this serves as a great example that demonstrates the power of our platform.\n\nIn Q3, we held our first developer summit in Bangalore and have another in San Francisco scheduled later this month. Next week, we'll be hosting a virtual event to demo all of these Q3 product updates companies from our all products released to our customers. To recap, we had a strong quarter given the changing market conditions. Our continued growth, coupled with our operational efficiency is a differentiator among new public software companies.\n\nBut like others in the tech sector, we are not immune to the slower economy. While our new business activity picked up, expansion slowed down as companies reduce their growth forecast and headcount needs. On a positive note, we saw good new business growth in North America, in the mid-market and enterprise. Our overall gross churn rate remains roughly the same, and we even saw SMB churn stabilize in the quarter.\n\nAnecdotally, we are hearing that mid-market and enterprise businesses are focused on value and managing their software costs toward the end of the year. Our model affordable solutions are well poised for this segment of customers. As we look ahead, I'm optimistic about our future. I'm happy to introduce our new President, Dennis Woodside, who comes with a proven track record of helping businesses scale.\n\nWe brought in Dennis to accelerate our growth, and he will start with a focus on go-to-market strategy and operations. This will enable me to focus on our long-term vision and product strategy. The entire management team will report to both Dennis and I as we partner together on our journey ahead. Now I would like to welcome Dennis to talk about why he chose to join Freshworks, what he's observed so far and the opportunities he sees for us.\n\nDennis Woodside -- President\n\nThanks, Gi, and good afternoon, everyone. I'm excited and honored to be here today as a member of the Freshworks management team. I spent 20 years working in technology for growth companies that have challenged the status quo and delivered amazing experiences for their customers: Google, Dropbox, Impossible Foods and now Freshworks. I've always been inspired by founders, Larry Page, Drew Houston, Pat Brown, they push the limits of what the rest of us think is possible, and I know how to help them scale.\n\nThat's why I joined Freshworks. I believe in the company's vision. We put the power of software back in the people's hands with applications easy enough for everyone to use. Gi has always believed that enterprise software doesn't have to be complicated and that business is can add powerful technology without sacrificing agility.\n\nI believe in that mission. During my first two months, I've had several observations that make me excited about the opportunity ahead for Freshworks. First, our customers love our products. I traveled around the world and met with customers like Viessmann and Internet stores in Germany, Sodexo in France and Frasers Group in the U.K.\n\nIt's clear that Freshworks customers see an immediate value from our software, and we continue to innovate fast to keep our customers happy. Second, we are set up to continue innovating at scale. You heard Gi talk about the differentiating features and new products we introduced in just one quarter. That's because we have a team of product and engineering veterans from the world's leading tech companies.\n\nAnd finally, there is a huge opportunity to serve larger customers and to win more big deals. As Gi mentioned, I've been focused initially on our go-to-market operations. Over the last few years, Freshworks products have evolved to meet the needs of larger companies, and I see this as a big opportunity for our growth. We have a great team, and we're already making changes to our sales organization to meet that demand.\n\nI believe that with a few adjustments, we can make our field sales even more efficient and effective. Earlier today, we announced the upcoming departure of our chief revenue officer, Jose Morales. We thank Jose for his contributions over the last two years toward the growth of the business. In the interim, our chief customer officer, Paddy Rathinam has taken over CRO responsibilities.\n\nHe is acutely familiar with our customer needs and products and has decades of sales experience at Microsoft and Harman. I am looking forward to working closely with Paddy and the other go-to-market leaders to build a sales motion that can deliver the consistent performance that we expect. I am bought into Gi's vision and believe that our value to customers, our business model and our people can achieve it. Over the coming months, I'm sure I'll be meeting with many of you and sharing more insights on our journey ahead.\n\nNow I'll hand things over to Tyler.\n\nTyler Sloat -- Chief Financial Officer\n\nThanks, Dennis, welcome aboard. We're excited to have you on the Freshworks team, and we are looking forward to working with you. Now looking at our Q3 performance. We delivered a strong quarter of financial results, beating expectations for revenue by approximately 3% and coming in more than $10 million ahead of expectations on non-GAAP operating loss, further highlighting our ability to drive efficient growth in our financial model.\n\nGiven the FX rate changes throughout the quarter and the year, including since our last earnings call, I'll spend more time today talking through constant currency comparisons to provide a better view of our business fundamentals. I'll review our Q3 financial results, provide background on key metrics, and close with our expectations for the upcoming quarter, Q4 and full year 2022. Most of our discussion for the financial results will be around non-GAAP numbers, which exclude the impact of stock-based compensation and related expenses, payroll taxes on employee stock transactions, amortization of acquired intangibles and other adjustments. Starting with the income statement.\n\nRevenue grew 37% adjusting for constant currency or 33% as reported to $128.8 million. While overall macro pressures led to slower expansion activity in Q3, we saw increased year-over-year growth for our new business bookings in the quarter. Our diversified business mix across multiple product segments with customers ranging from SMB to mid-market and enterprise continues to be durable through a tougher macro environment. In Q3, the overall churn rate for the company remained in line with the prior quarter and has been relatively consistent over the first three quarters of the year.\n\nCustomers using more than one product continued its steady increase, up 1% again to 24% in Q3, and represents approximately half of our overall business. We saw good wins in CX with customers seeking modern solutions for conversational messaging, and we're addressing the ongoing need for unified sales and marketing solution. In ITSM, customers are discovering the powerful capabilities of Freshservice and extending use cases into other functions. In Q3, Freshservice continued to be the largest contributor to ARR growth.\n\nTurning to margins. Our non-GAAP gross margins increased slightly, rounding up to 83% for the quarter. This is the fifth consecutive quarter with strong non-GAAP gross margins in the 82% to 83% range. So we're pleased with these levels as our business grows.\n\nIn Q3, non-GAAP operating margins improved approximately 11 percentage points quarter over quarter to negative 2%. Most of the improvement was driven by lower-than-expected costs related to head count, digital marketing spend and shifting of spend into Q4. While we are continuing to add to our Fresh Books family, we're slowing the pace of hiring as we align our resources with the current market. We also had a onetime tight benefit of nearly $3 million related to the reversal of accrued expenses from earlier in the year.\n\nThe revenue beat, combined with a more efficient cost base led to non-GAAP operating loss of $3.1 million, which was significantly ahead of our previously given estimates. I'm really pleased with our ability to invest prudently to drive efficiency. Moving to our operating metrics. Net dollar retention was 113% on a constant currency basis or 107% as reported as we saw increasing impacts from FX rates and lower expansion activity in the quarter.\n\nAs we mentioned in the prior call, the slowing economic environment is resulting in lower growth projections for businesses and impacting the expansion motion. Looking ahead to Q4, we expect constant currency net dollar retention to be 110% and assuming the current FX rates hold, reported net dollar retention to be 105%. Looking at our customer metrics. Customers contributing more than $5,000 in ARR, grew 19% to 16,713 customers in the quarter and continues to represent 86% of our ARR.\n\nOnce again, a large number of customers fell below the threshold of $5,000 in ARR because of FX moves. So we're also providing the constant currency figure of 23% growth year over year for this metric. For larger customers contributing more than $50,000 in the ARR, this customer count grew 36% to 1,717 and represents 43% of our ARR. Adjusting for constant currency, this customer cohort grew at 44%.\n\nLastly, our total customers grew to over 61,600 customers with a net add of approximately 1,700 customers in Q3 as our average revenue per account increased in the quarter. Now moving to billings, balance sheet and cash items. Despite increasing FX pressures during the quarter, calculated billings grew 25% to $136.9 million. Holding currency constant over the past year, calculated billings grew 31%.\n\nOther factors impacting the growth rate include billing duration mix of positive 2% and reserve activity of negative 1%. Adjusting for these factors, the normalized calculated billings growth was approximately 32% in Q3. Looking ahead to Q4, our preliminary estimate for calculated billings growth is 22% on a constant currency basis or 16% as reported based on current FX rates. As a reminder, we will have tougher year-over-year comparisons in Q4 as we had significant early renewal activity and duration benefit in Q4 of last year.\n\nTurning to our balance sheet and cash items. We maintained a similar cash balance as we ended the quarter with cash and marketable securities of approximately $1.2 billion. Free cash flow was negative $7.2 million in Q3, beating expectations by approximately $3 million. We continue to net settle vested equity amounts and used just over $13 million under financing activities for Q3.\n\nOnce again, this financing activity is excluded from free cash flow. We expect to continue net settling vested equity amounts for the foreseeable future, resulting in quarterly cash usage of approximately $18 million at current stock price levels. Looking out to the remainder of the year, we expect to generate positive free cash flow in the range of $1 million to $2 million in Q4. This translates to an estimate of negative $17 million to $18 million of free cash flow for the full year, which is better than our prior estimates.\n\nWe're pleased with our ability to manage spend and show improvements throughout the year. We expect to maintain positive free cash flow on an annual basis in the upcoming years. As we've said before, we've built a durable and efficient financial model for the business. We are well capitalized with no debt and have a strong balance sheet, creating financial flexibility to drive sustained growth for our business.\n\nTurning to our Q3 share count. We had approximately 326 million shares outstanding on a fully diluted basis as of September 30, 2022. The fully diluted calculation consists of 287 million shares outstanding and approximately 36 million related to unvested RSUs and PRSUs and nearly 3 million shares related to outstanding options. Let me now talk about our forward-looking estimates.\n\nI'll go through the numbers first and then provide background commentary afterwards. For the fourth quarter of 2022, we expect revenue to be in the range of $129.2 million to $131.2 million, growing 22% to 24% year over year. Adjusting for constant currency, this reflects growth of 27% to 28% year over year. Non-GAAP loss from operations to be in the range of $10.5 million to $8.5 million, and non-GAAP net loss per share to be in the range of $0.05 to $0.03, assuming weighted average shares outstanding of approximately 288.5 million shares.\n\nFor the full year 2022, we expect revenue to be in the range of $494 million to $496 million, growing 33% to 34% year over year. Adjusting for constant currency, this reflects growth of 36% to 37% year over year. Non-GAAP loss from operations to be in a range of $30 million to $28 million, and non-GAAP net loss per share to be in the range of $0.13 to $0.11, assuming weighted average shares outstanding of approximately 284.6 million. These estimates are based on FX rates as of October 28, 2022.\n\nAs always, we're trying to provide our best view of the business today and in a dynamic market environment, so a few areas to call out. First, on FX. With the dollar strengthening again over the quarter, this has resulted in a negative impact of approximately $1.5 million to our full year 2022 revenue compared to our previously provided estimates. Second, on expansion.\n\nAs we called out earlier, the macro environment is having an impact on our expansion activity, and especially for our smaller customers. Our biggest driver of expansion revenue is agent addition with higher costs and downsizing of workforces were seen in hearing of customers planning for slower headcount growth going forward. Third, on operating loss. In addition to incorporating our significant Q3 beat on operating loss into the full year estimates, we're improving our outlook by another $1 million, given our ability to effectively manage our cost base.\n\nWe plan to continue to drive efficiencies wherever possible. We feel really good about our financial position, we have a strong balance sheet with nearly $1.2 billion in cash and equivalents. We're growing at healthy rates and have a good handle on our cost structure. We expect to generate positive free cash flow in Q4 and the years ahead.\n\nLet me close by saying I'm pleased with our results for this quarter. Our diverse business model has proven to be resilient and durable in a changing market environment. We're continuing to execute on our operating plans and remain excited about our opportunities ahead. With that, let us take your questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] The first question comes from Scott Berg with Needham. Your line is now open.\n\nScott Berg -- Needham and Company -- Analyst\n\nH, everyone. Congrats on a good quarter and thanks for taking my questions. I guess I'll start with the macro question, will follow up to maybe, Tyler, the exact last thing that you talked about there, which was less seat expansions. How should we think about the magnitude of this? Obviously, it's been an important component of your kind of expansion strategy, but is this, I don't know, 10% lighter from an expansion cadence on what you're seeing? Or is this maybe more significant to that?\n\nTyler Sloat -- Chief Financial Officer\n\nHey, Scott, it's Tyler. Yeah, we're not quantifying the expansion rates right now, but it is a significant part of our business. And as you know, agent addition drives the majority of our expansion. And as such, that's what's driving that dollar retention down and is causing some of the growth coming down as well.\n\nSo expansion is significant for our business. And as companies are not expanding, they're just not adding as many agents.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Helpful there. And I guess, as you look at your business today and think about the success that you've had in the sales and marketing side, yet balancing the profitability of the business as you mentioned $1 million improvement in Q4 here and being mindful of that is, how do you think about the company's own growth investments, you or Gi, maybe over the next I don't know, two to four quarters? Do you continue to invest at the pace that we've seen over the last year to year and a half? Or have you may be changed your philosophy a little bit based on what you're seeing in the market today?\n\nTyler Sloat -- Chief Financial Officer\n\nYeah. I think if you look at what we did in Q3, right, we were able to drive efficiencies in Q3 and essentially every line item, G&A, R&D and sales and marketing came down as a percentage of revenue. And there's a lot of factors just thinking about cost and efficiency, but also we've been hiring at a really high pace and it gives us the opportunity to just kind of digest. Now we're still going to invest in sales and marketing.\n\nSpecifically, we're actively hiring quota-bearing reps right now. We think there's a big opportunity there still, and we're going to continue to do that. But of course, we're going to look at efficiencies. We said, Scott, as you know, we're going to produce cash in Q4, and we said on an annual basis, we plan to produce cash going forward.\n\nAnd that just is leverage that we see in our model that we can gain.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. That's all I have. Thanks for taking my questions, and congrats on the strong quarter.\n\nTyler Sloat -- Chief Financial Officer\n\nThanks, Scott.\n\nOperator\n\nYour next question comes from Elizabeth Porter with Morgan Stanley. Your line is now open.\n\nRyan Bressner -- Morgan Stanley -- Analyst\n\nHi. Thanks for taking my question. It's Ryan Bressner on for Elizabeth. You mentioned a little bit earlier, strength in new business as for mid-market and enterprise the last few quarters.\n\nWhat's driving this? How much of this is due to kind of product advancements market versus just an increased focus on lower cost solutions by these type of companies in a slowing environment.\n\nGirish Mathrubootham -- Chief Executive Officer\n\nHey, Ryan. I'll take that. This is Girish. So I think it's a combination of both.\n\nOur products, especially Freshdesk and Freshservice are both mature products, which are helping us win more and more into larger accounts. Specifically, Freshservice does not play as much into SMB. It's more mid-market focused. That is the primary reason, but also given the changing macro companies need to kind of spend more cautiously looking to save costs.\n\nI think the Freshworks promise has always been a lower total cost of ownership and a rapid time to value. I think that is resonating well with customers.\n\nRyan Bressner -- Morgan Stanley -- Analyst\n\nGot it. That's very helpful. Thank you. Maybe just one more for me quickly then.\n\nWhen we're taking a step further on the conversation around expansion. Is it purely just a slowdown in net expansion for these customers? Or are we seeing maybe some contraction from specific customers that are most impacted by slowing macro?\n\nTyler Sloat -- Chief Financial Officer\n\nYeah. Hey, Ryan, I'll take that. So what we did say is that churn has been relatively stable, and we've been making improvements on churn kind of quarter over quarter for the last year and a half, which we've talked about, and we've been able to keep it stable. When we talk about contractions or what would be a downsell theoretically, that is recorded in churn.\n\nSo we've been able to see the stability there. So it really is more on the expansion motion that is reflected in the numbers.\n\nRyan Bressner -- Morgan Stanley -- Analyst\n\nOK. That makes sense then. Very encouraging. Thank you.\n\nI appreciate your time.\n\nOperator\n\nOur next question comes from Alex Zukin with Wolfe Research. Your line is now open.\n\nRyan Krieger -- Wolfe Research -- Analyst\n\nHey, guys, it's Ryan on for Alex. Thanks for taking the questions. So I just had one around kind of the changes to the sales motion. With the change to CRO this quarter, you talked about broader changes in the sales motion that you want to implement.\n\nI just want to know what can you guys do to kind of ensure that you aren't taking a step backward in your sales execution, particularly in Europe, where it was an issue earlier this year with all the new changes. And then how long do you expect those changes to take to implement until productivity and execution is back to where you want it to be?\n\nDennis Woodside -- President\n\nHi, Ryan, it's Dennis. Thanks for the question. First of all, I think we're very excited about Paddy coming in as our interim CRO. Paddy had 20 years of sales experience and previously was our chief customer officer.\n\nSo we don't envision in the very near term, substantial changes in our model. We are very happy with the traction we're getting with larger customers. I think Gi talked about this on -- in his remarks earlier, customers over $50,000 in ARR really are driving a big part of our business, a big part of the growth. So we're excited about that.\n\nWe're excited to lean more into that. And we'll continue to, I think, be successful in those kinds of deals.\n\nRyan Krieger -- Wolfe Research -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nOur next question comes from Adam Bergere with Bank of America. Your line is now open.\n\nAdam Bergere -- Bank of America Merrill Lynch -- Analyst\n\nHey, thanks for taking my question. I guess for you, Tyler, has the macro deteriorated in Q2 versus Q3? Or is it mostly consistent between two? And put another way, would you say that there's been like an added level of conservatism or cushion in the guide between Q3 and Q4?\n\nTyler Sloat -- Chief Financial Officer\n\nNo. I think in Q2, at the end of our call, we said we expected to see pressure. And so it kind of -- the pressure on expansion motion is what we saw. The rest of the quarter kind of came out as we expected.\n\nAnd I think what we're seeing now is, OK, number one, FX has continued to move against us, right? And so that's -- we've taken that into account. And then secondarily, we actually have now seen the pressure on the expansion motion. We expect that to continue for a while. And so I don't think it's gotten dramatically worse than what we expected.\n\nIt's just that now they're flowing through the numbers.\n\nAdam Bergere -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Super helpful. Thanks. And then for you, Dennis, you used the word interim when describing the new CRO.\n\nSo do you plan on hiring another at some point [Inaudible]. Thanks.\n\nDennis Woodside -- President\n\nWe don't -- we have no plans now. We want to see how Paddy does, and I'm going to be working very closely with him over the course of the next couple of months thinking about next year. So that's why we're sticking with interim for now.\n\nAdam Bergere -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, guys.\n\nOperator\n\nOur next question comes from Brent Thill with Jefferies. Your line is now open.\n\nBrent Thill -- Jefferies -- Analyst\n\nGreat. Thanks. Hey, Tyler, I just -- I think kind of the new being strong and expansion slowing was kind of countered to what most would think would you expect kind of the new customers to slow and expansions to continue. Can you just explain a little more on that dynamic? And I guess, Dennis, just to follow up, you've served in a lot of go-to-market roles and when typically you have a change at the top, it takes time for that to filter through.\n\nCan you just give us a sense, a little more color on why you think this is maybe not a severe or kind of give us a sense of just what's happening from that side.\n\nTyler Sloat -- Chief Financial Officer\n\nYeah. Hey, Brent, I'll take the new business, one that we did see increased year-over-year growth in new business compared to Q3 of the prior year, and that was a positive. And especially, we got some good CX wins in the U.S. in North America with our Freshdesk products.\n\nFreshservice continues to do well. And we've been talking about that product for a long time. And again, I think is the largest contributor to ARR growth again in the quarter. So it's not like it was like shockingly spiked up in terms of new business.\n\nBut in these environments, we've also proven that we are a great alternative for companies if they are trying to move away from expensive solutions or making new decisions and they can see the value in our products and the right size for them. So we were pleased in how we did there.\n\nDennis Woodside -- President\n\nI think on the go-to-market side, a couple of things. One is -- one of the big reasons I joined is that I see this huge opportunity with where we are in having very clear product market fit across multiple very big TAMs. And I spent the last two months, both traveling the world and talking to customers, probably spoke to about 20 customers. It's very clear to me that we have an opportunity to, number one, get -- participate in bigger deals.\n\nThis fact that the biggest -- the fastest-growing segment that we're going after are $50,000-plus deal. That's really important for us. Those deals tend to be in larger companies. And those deals also tend to have the opportunity for multiproduct sales from day one or through expansion.\n\nSo that will entail as we press more in that direction. That will entail adjustments to the team, to the talent to the way we go to market. I don't anticipate massive changes anytime in the near future. We're not going after $10 million deals.\n\nWe're going after sweet spot, $50,000, $100,000, $200,000 deals. So I don't think that we're going to have like a period of massive instability, if that's what you're concerned about. It's really more a refinement, and a focusing of the team on the deals that are going to move needle.\n\nBrent Thill -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Ryan MacWilliams with Barclays. Your line is now open.\n\nUnknown speaker -- Barclays -- Analyst\n\nHey, it's Jack on for Ryan. Thanks for taking the question. Just one quick one for Dennis. Congrats on new role Dennis.\n\nJust wanted to see if we can get any more specifics on improvements you can help with in the next year and just how you're thinking about the opportunity broadly. Thanks.\n\nDennis Woodside -- President\n\nYeah. Well, like I said, I think the opportunity is massive and the -- you think about what we're going after with our ITSM product, that is a massive, massive market. You think about what we're doing with our desk product and how customer support is evolving to a much more conversational application. We have the products that can serve a modern B2C or B2B company when it comes to their service operations.\n\nAnd then you think about CRM, another massive space, where there's quite a bit of innovation, and we think there's an opportunity for us to play there. So all these product spaces are very interesting for us. I think we can get sharper in how we are participating in deals and making sure we're in as many deals as possible. Our awareness among IT decision-makers can -- has room for improvement, and then that directly leads to how we're actually -- the swings we're getting.\n\nSo I think there's a lot of, let's say, executional adjustments that we can make to take a team that's already operating quite well to the next level, and that's really why I joined.\n\nUnknown speaker -- Barclays -- Analyst\n\nGreat. That's it for me. Thanks.\n\nOperator\n\n[Operator instructions] Our next question comes from Pinjalim Bora with JPMorgan Chase. Your line is now open.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nThank you. Congrats on the quarter. Two questions from me. One, Tyler, on the opex side, it seems like a nice sequential downtick.\n\nHow much of that is kind of a deliberate on cost reduction versus FX savings, if you can help us think about that a little bit? And any way to think about the trajectory of the margin into 2023 at this point? And the second part is, I guess, billings guidance of, I think I heard 22% in constant currency. When I look back a year ago, I think your renewals was about a 3-point benefit. I'm trying to think if we kind of try to adjust for that, is adjusted for early renewals going to be about 25% in terms of the guidance. Any way to help us there would be helpful.\n\nTyler Sloat -- Chief Financial Officer\n\nHey, Pinjalim. So yeah, let me break down to two questions. On opex, we did really, really well. Now I wouldn't say it was necessarily just cost focus, meaning that it wasn't like we entered into the quarter dramatically trying to lower cost.\n\nWhat we did do is we slowed down some hiring and we looked at areas around our sales and marketing spend in other areas. And we're able to just try to drive some efficiencies. We're still hiring a bunch, but [Audio gap] we were able to do that now. We did get some FX benefit from the INR side, which was your question.\n\nBut I think in general, it has more to do with just having kind of control over the growth rates there on operating loss. We also had some nuances from quarter to quarter. It's -- we had a larger marketing event and our focal process in Q2 that makes the expenses higher. The second question on billings.\n\nYeah, on a constant currency, I think we said 22% for Q4. And it is also over a tougher compare because in Q4 of last year, we did have some duration stuff and early renewals. But I wouldn't adjust the 22% to try to normalize for that necessarily. I would just use that as constant currency number.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from Brian Peterson with Raymond James. Your line is now open.\n\nJohn Messina -- Raymond James -- Analyst\n\nHi. Thanks for taking the question. This is John on for Brian. I'm just curious on the channel partner here.\n\nAny updates you can give us on those efforts over the last 90 days? And any key data points we should watch for as we head into 2023? Thanks.\n\nGirish Mathrubootham -- Chief Executive Officer\n\nHey, John, this is Girish. I'll take that question. So just to give you a quick overview, we have over 500 partners in more than 50 countries. So we have different types of partners.\n\nWe have solution partners who sell or resell our software, implement and customize it for customers. We have technology partners where we do integrations between products. We also have a start-up program, and we partner with multiple institutions. And we also have affiliates who are more like referrers for the business.\n\nSo this is in addition to like the Tier 1 partners like Amazon, Google, Facebook, etc. And we also have channel partnerships with Instagram, WhatsApp and other stuff. So we continue to add partners. So partners drive approximately 15% of our new business.\n\nAnd I think that number is the same for this quarter as well. And -- so we continue to add partners across all of these dimensions.\n\nJohn Messina -- Raymond James -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question comes from Brent Bracelin with Piper Sandler. Your line is now open.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you for taking my question here. Juggling a few calls tonight, apologize if questions have been asked and answered. But I wanted to go back to kind of competition. If I look at Zendesk, for example, their bookings and billings growth rate this quarter did slow meaningfully to about 8%.\n\nI was wondering if you're seeing less of Zendesk or if there's been any sort of kind of change in the competitive environment in either smaller customers, international or the larger deals? Any change relative to what you're seeing them in the field would be helpful. And then I have one follow-up.\n\nGirish Mathrubootham -- Chief Executive Officer\n\nSure. I'll take that, Brent. This is Girish. So first of all, I think we are still continuing to see Zendesk in deals, and we feel good about our win rates against them.\n\nWhat we are seeing a lot is if it is a bake-off with Zendesk, we tend to win more. If they are an incumbent, it's a little bit harder, a longer conversation to kind of replace them. But CX continues to be competitive space with some action moving on to the conversational space, where we also launched new initiatives and [Inaudible] like we got our Freshchat product. So we have some good wins in North America in the third quarter, specifically against Zendesk.\n\nSo it's not like -- yes. So I think customers -- anecdotally, I can tell you we are starting to hear some conversations of our customers wanting to move, but we are also seeing that Zendesk is turning very aggressive on pricing in their current environment where they're trying to continue to win.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGreat. And then my follow-up here is really for Dennis. Obviously, you've been able to scale several tech businesses in the past. As you look at the Freshworks opportunity here, what are you most encouraged about? I know it's still early days, but is there a great opportunity to really accelerate the scale in the U.S.? Is it international that you're going to be focused on first? Just love to hear where your focus is on, scaling U.S.? Is it going to be bundling? Is it going to be specific products? Any color there.\n\nAnd then specifically, as you think about the Freshservice business, as you look under the hood of that business, do you think that business can scale into the larger environments? Or what part of that Freshservice business do you see having the most success from a swim lane perspective? Thanks.\n\nDennis Woodside -- President\n\nYeah. Thanks for the question. I think just taking the last part first, I think the Freshservice business absolutely can scale up into very large accounts. If you look at our account list today, just across Freshservice and Freshdesk, you've got some amazing names already.\n\nKlarna, Discover, Blue Nile, AMEX Travel, Viessmann, Thomas Cook, Sodexo, these are big sophisticated buyers. And the process we go through is rigorous. Every one of those deals is competitive, and we're winning consistently. And that's -- from the outside, I thought of Freshworks has more of a true SMB play.\n\nI think what's been really encouraging is how much progress has already been made in these larger and larger accounts, which is why I think we continue to invest on the -- as we get more efficient, we're still investing in growing our AE force and getting more coverage. There's a lot more opportunity in the U.S. I think we absolutely have to win in the U.S. for sure.\n\nBut Europe also offers a pretty meaningful opportunity over time. And our home market of India is actually pretty interesting for us as a place where we can experiment and try things very close to the product team. So I think all those things are positive. The other thing I've been impressed with is just the strength of the product team.\n\nWe have -- our product leaders have typically spent 15-plus years in organizations like Microsoft or Salesforce or elsewhere where they truly understand their spaces quite well. And yet, we get -- we take advantage of the fact that we're -- most of our product development is in a much lower cost center, which also, over time, should help us with overall operating efficiencies. So I think we're set up really for a very promising future. There's -- obviously, there's all kinds of macro stuff going on.\n\nBut so far, it's been great to get in and see under the hood and start getting going.\n\nGirish Mathrubootham -- Chief Executive Officer\n\nHey, Brent. To add on to what Dennis was saying, specifically on the Freshservice part, we also just announced Freshservice for Business Teams, which basically takes the modern employee experience that IT teams are delivering and expanding that into all the other departments of the enterprise, whether it's HR, finance, legal or any operations team. I think it presents -- it increases the addressable market significantly for Freshservice, as well as provide us a good expansion opportunity to go into existing customers as well. And the good news there is it's already a proven use case where we have thousands of customers using Freshservice internally.\n\nSo now with the new capability, I think we would be able to expand more and drive faster adoption of Freshservice within enterprise.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nHelpful color. Thank you so much.\n\nOperator\n\nOur next question comes from Rob Oliver with RW Baird. Your line is now open.\n\nRob Oliver -- Baird -- Analyst\n\nGreat. Thank you, guys, good afternoon. Dennis, also one for you. Just you had a chance, as you mentioned, to go out and see a talk with a bunch of customers.\n\nThere's a bit of a narrative evolving particularly among enterprise software companies now around some vendor consolidation, and I think it's still early to call that out in a multi-tenant SaaS world, but some big vendors like Salesforce have called that out. I'm wondering, as you look at the product portfolio for Freshworks, which, again, multi-product adoption moving up ever so slightly, but what strikes me that there's a real opportunity there. And to the extent that some of these headwinds could potentially be tailwinds for that multiproduct sale for you guys? Just how you think about that? And then I have a quick follow-up for Tyler.\n\nDennis Woodside -- President\n\nThanks for the question. So first of all, I think there's also another opportunity for us that maybe you were alluding to, which is that the companies are -- at least the companies I've been talking they all are looking to drive efficiency and cost. And in some cases, they haven't been satisfied with the solutions that they've had for CRM or elsewhere or otherwise. And in the time that they signed their contract, let's say, three or five years ago to now, our products have advanced massively.\n\nAnd so we're now in the consideration set when those deals come up for renewal, I talk to a large transportation company in Europe that recently had made a switch off of a Salesforce stack, and it was driven by value and the -- both product value and the overall total cost of ownership when you look at things like consultants that you need just to keep sales force up and running and truly get value out of it. So I think that's an opportunity for us as well. There's just -- there's a customer base that may not be satisfied with the incumbent tools. And I think we're going to have an opportunity there.\n\nWhen it comes to multiproduct, there's multiple dimensions of that. There's a number of very small solutions, point solutions. In particular, we're seeing them in CX. And there, our opportunity is to kind of embrace and extend into that kind of functionality, you think about the chat applications and so forth where we have a very robust chat suite now.\n\nWe've continued to launch new features that enhances the value of that product. That is the kind of bots and elsewhere and otherwise. Those are the kinds of, I think, applications and use cases that we can shine in. And as our product set continues to expand, we continue to have an opportunity to consolidate spend within our customers.\n\nRob Oliver -- Baird -- Analyst\n\nGreat. That's super helpful color. Appreciate it, Dennis. And then Tyler, for you, I know one of the things that Dennis had mentioned in his comments earlier was just around some of the awareness of Freshworks in some accounts.\n\nI know you talked about lower digital marketing spend. So can you help us understand a little bit about are you guys able to drive increased efficiencies with the digital marketing spend that you have? Is it about resource allocation? Any change? Is that just relevant to that kind of lower end flywheel-type inbound model. And where do you see the opportunities and other risks to kind of that lower marketing spend, particularly around kind of a need to raise awareness? Thank you.\n\nTyler Sloat -- Chief Financial Officer\n\nYeah. Hey, Rob. I think that visual marketing spend, I'm not sure how much awareness it drives as opposed to true click-through inbound the awareness. But when we look at the sales and marketing and look at the total spend and then even looking toward next year, there is this balance of how much we want to spend on brand and then field marketing, which is actually going out and engaging with customers or potential customers versus digital, which is -- we're just trying to get our name out there when people are searching for things.\n\nAnd so it's going to be a balance, and we're going to continue to obviously drive that inbound motion and didn't continue to do efforts to optimize that we don't have to rely on the digital spend as much. But that balance will also come with additional brand and field marketing things that we'll be investing in as well. So it will be across the board.\n\nRob Oliver -- Baird -- Analyst\n\nGreat. Helpful. Thanks, guys. Appreciate it.\n\nTyler Sloat -- Chief Financial Officer\n\nThanks, Rob.\n\nOperator\n\nOur next question comes from Nick Altmann with Scotiabank. Your line is now open.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGreat. Thanks, guys. It seems like the messaging is sort of you guys are going after larger deals, just given the SMB weakness. And I guess my question is, how does that sort of change your guidance philosophy, just given larger deals maybe were more of an upside driver in the past? I guess, put another way, how do you guys make sure you're not over-indexing on the large deal side of the equation, just given it's a little bit lumpier versus SMB?\n\nTyler Sloat -- Chief Financial Officer\n\nHey, Nick, this is Tyler. I'll take that one. So number one, it doesn't change our guidance philosophy at all, right? We're trying to guide based on what we see now. SMB, it actually -- it has seasonality to it and Q4 is typically lower for SMBs, but the SMB machine is still working.\n\nIt's doing well. We're not moving away from that. So I want to be clear about that. We do think that's really important.\n\nAnd we have different products to play across different customer segments. I think for the big-deal commentary or the larger-deal commentary, that has more to do with the fact that we're already seeing traction with those customers, and we have made significant investments in the field over the last couple of years, and we're going to continue to do that. And just I think the commentary Dennis and Gi had is that, hey, we should be leaning into that. And we should actually be doing more to optimize to go engage with those customers and win those deals.\n\nAnd we think that we now have the products, levels of maturity that they are being received by customers and proving success. And so that's more around what that means as opposed to over-indexing to that.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGot it. And then I guess just going back to the channel side of the equation, as you sort of lean more into mid-market and enterprise, how does that change your philosophy around the channel or even on the direct go-to-market side. Does that mean trying to work with new partners that are maybe more geared toward mid-market and large enterprise? Does that mean kind of shifting headcount resources out of more hunters on the mid-market and enterprise side, out of the inbound go-to-market sales force? Just any color around that would be very helpful. Thanks.\n\nGirish Mathrubootham -- Chief Executive Officer\n\nHey, Nick, I'll take that. First of all, this is not -- there's no significant change in strategy, right? So OK, just to level set. So we have inbound driving almost half of our business, right, if you take new business. Our outbound field sales is generating approximately in the last two quarters, I would say, at 25% of our new business and then the partners putting the other 25%.\n\nNow this is the current mix. If you look at the overall revenue mix between SMB and mid-market. I think SMB is around 43%, which is 250 employees and less. And the mid-market share over the years has grown.\n\nCurrently, it stands at 57%. Now we will continue this trend with like, OK, yes, is there going to be a little bit more focus on hunting in the mid-market, yes. But as Tyler said, we have reps who have been hired and ramping, and we will continue to go after that. And Freshservice really doing well.\n\nLast quarter, we said, hey, we want to kind of focus more because the better customer profile, more big market. So we continue to do that. On the channel side, I think we are -- there is no significant change in strategy as of now to report. But to be very clear, we are not going after the -- as Dennis was also mentioning, we're not going after the $5 million, $10 million deal.\n\nSo it's still sticking to our sweet spot where we have customers, we have enough product market fit to show that we can easily win the $50,000, $100,000, $200,000 deals. And so we want to focus on that.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGot it. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoon Huh -- Vice President, Investor Relations\n\nGirish Mathrubootham -- Chief Executive Officer\n\nDennis Woodside -- President\n\nTyler Sloat -- Chief Financial Officer\n\nScott Berg -- Needham and Company -- Analyst\n\nRyan Bressner -- Morgan Stanley -- Analyst\n\nRyan Krieger -- Wolfe Research -- Analyst\n\nAdam Bergere -- Bank of America Merrill Lynch -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nUnknown speaker -- Barclays -- Analyst\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nJohn Messina -- Raymond James -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nRob Oliver -- Baird -- Analyst\n\nNick Altmann -- Scotiabank -- Analyst\n\nMore FRSH analysis\n\nAll earnings call transcripts"
}