{
  "companyName": "Freshpet",
  "companyTicker": "FRPT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/freshpet-frpt-q2-2022-earnings-call-transcript/",
  "content": "Freshpet (FRPT 1.27%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to Freshpet's second quarter 2022 earnings call and webcast. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions].\n\nAs a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Jeff Sonnek, investor relations at ICR. Thank you. You may begin.\n\nJeff Sonnek -- Investor Relations\n\nThank you. Good afternoon, and welcome to Freshpet's second quarter 2022 earnings call and webcast. On today's call are Billy Cyr, chief executive officer; and Heather Pomerantz, chief financial officer. Scott Morris, chief operating officer, will also be available for Q&A.\n\nBefore we begin, please remember that during the course of this call, management may make forward-looking statements within the meaning of the federal securities laws. These statements are based on management's current expectations and beliefs and involve risks and uncertainties that could cause actual results to differ materially from those described in these forward-looking statements. Please refer to the company's annual report on Form 10-K filed with the SEC and the company's press release issued today for a detailed discussion of the risks that could cause actual results to differ materially from those expressed or implied in any forward-looking statements made today. Please note that on today's call, management will refer to certain non-GAAP financial measures such as EBITDA, adjusted EBITDA, among others.\n\nWhile the company believes these non-GAAP financial measures provide useful information for investors, the presentation of this information is not intended to be considered in isolation or as a substitute for the financial information presented in accordance with GAAP. Please refer to today's press release for how management defines such non-GAAP measures. A reconciliation of the non-GAAP financial measures to the most comparable measures prepared in accordance with GAAP and limitations associated with such non-GAAP measures. Finally, the company has produced a presentation that contains many of the key metrics that will be discussed on this call.\n\nThat presentation can be found on the company's investor website. Management's commentary will not specifically walk through the presentation on the call, but rather it's a summary of the results and guidance that we'll discuss today. With that, I'd now like to turn the call over to Billy Cyr, chief executive officer.\n\nBill Cyr -- Chief Executive Officer\n\nThank you, Jeff, and good afternoon, everyone. The message I would like you to take away from today's call is that the dual challenges of inflation and economic slowdown, which have resulted in unwelcomed volatility in our results. have not derailed our ability to deliver our long-term goals, including significant margin expansion. During this call, you will learn that, first, net sales are strong and growing in line with our expectations, price sensitivity is modest and also in line with our expectations and household penetration growth has accelerated and is more consistent with our long-term goals.\n\nIn fact, our net sales growth is outpacing our long-term plan, which only requires a 28% compound annual growth rate to achieve our 2025 goal. Second, adjusted EBITDA was below expectations in the quarter due to media investment timing, inflation, logistics challenges and the quality issue we had in June. We have already taken the necessary actions to adjust for the critical issues, including announcing a third price increase. However, the cost of the quality issue and the new timing gap on inflation versus our pricing require us to lower our adjusted EBITDA guidance for the year to $48 million from $55 million.\n\nThird, we are updating our capex expectations to reflect our current best estimate of the actual timing we will experience with our various capacity additions and fridge expansion projects. Our initial estimates were very conservative and designed to give us significant flexibility. But now that we are more than halfway through the year, we have much greater visibility and expect that we will spend approximately $80 million less this year than the $400 million previously projected. The impact on our available capacity will be minimal and still leave ample room to grow at or above the rates we had projected.\n\nAnd fourth, the underlying health of the business both its growth potential and the underlying margin structure remains sound. Despite the litany of new obstacles and our own admitted missteps, we deeply believe that Freshpet remains one of the best growth opportunities in the CPG space, if not the broader consumer sector. We have consistently demonstrated an ability to grow the business at very strong rates and have now done it at higher prices, improving the pricing power of the brand. Importantly, our growth is the result of very solid and sustainable consumer fundamentals, including strong increases in the size of our consumer franchise at steadily increasing buying rates.\n\nThis combination is only made possible by strong satisfaction and high customer retention. Retailers are responding to that strong consumer interest and now realize that Freshpet is the future of pet food. So they are increasing their placements of Freshpet fridges and the number of stores with double and triple fridges is expected to grow dramatically in the next year. We already have more than 27,000 fridges in stores and retailer interest is growing, not shrinking.\n\nBut the strength of our competitive moat goes beyond our retail presence as we are now building increasingly efficient manufacturing facilities that are unlike any others in the world. Our existing Freshpet Kitchen Bethlehem is operating at full capacity and producing strong cash flow, and we are about to open an even larger and more efficient facility in Ennis, Texas. We have consistently demonstrated an ability to capture the benefits of increasing scale in our G&A costs, and we aim to demonstrate our ability to deliver consistent gross margins as well, regardless of the operating environment. Finally, with a strong balance sheet, in combination with the cash generation of the business and our credit agreement, we can support our long-term growth ambitions without the need for additional capital.\n\nThere are very few businesses that can say all that. While the past two years have presented some very unusual and difficult challenges, we have worked diligently to ensure that Freshpet can achieve its potential and change the way people nurse their pets forever. For much of that time, we did not have enough capacity to meet demand. We outgrew our ERP system and labor shortages plagued the business regularly, but we've solved those problems.\n\nToday, we have enough capacity to meet demand with more coming online soon. The stores are in much better shape with steady improvement in fill rates and better in-stock conditions. We have implemented a new ERP system to enable greater efficiencies and our proactive Freshpet academy approach to labor has turned a weakness into a strength. But it goes without saying that the backdrop we are facing today is very different than what we have experienced over the past several years, making it hard to see and appreciate those accomplishments and the potential of the business.\n\nWe have replaced a pandemic with inflation, yet we've unfortunately kept the supply chain problems that came with the pandemic. And now we are facing a potential recession. We recognize the desire and need to stay aligned with, if not ahead of the shifting macroeconomic forces. Ramp in inflation and higher interest rates necessitate strengthening our focus on the cash-generating capability of the business while simultaneously delivering the long-term 11 million household prize.\n\nWhile the recent challenges have caused inconsistency in our margin delivery performance, we are in a much stronger position today than we have been over the past two years with a more formidable organization that provides greater control and confidence in the long-term opportunity that Freshpet presents. The new capacity plan that we outlined in May provided some early hints of how we might make better use of our cash. including a realignment of where we build various incremental capacity, the use of leases for nonstrategic assets and a focus on more space-efficient technology, but the current environment requires that we go further. There are three areas in particular that we need to focus on: capital spending; start-up expenses; and working capital.\n\nEach of these is the necessary use of cash to support our rapid growth but we have significant opportunities to improve our capital efficiency and prove to investors that Freshpet can at scale and as we scale, generate significant operating cash flow and ultimately, free cash flow. Key to accomplishing that will be to continue strengthening our organizational capability and processes. For example, our new ERP system is operating and supporting our day-to-day operations. but we are not getting full value for its expanded functionality.\n\nThat has led to inventories that are larger than we need, less efficient use of freight and higher accounts receivable balances. We've put in place a highly focused team designed to capture those benefits, ASAP. Encouragingly, since the quarter ended, we have implemented a more timely billing process which will dramatically reduce our accounts receivable by the end of this month. Additionally, we have focused on getting new capacity online as fast as possible and that has come at a cost.\n\nThat was necessary because we are so far behind on customer orders, but stores are in much better shape today, thanks to our significant inventory improvements. As a result, we are finally in a position where we could be more prudent with our planned start-up expenses. The same could be said for capital expenses. The intense focus on getting plants built and lines installed quickly often came at the expense of efficiency.\n\nWe are adding an intense focus on adding capacity in the most efficient manner while maintaining our commitment to speed and quality. Those efforts will not compromise our ability to grow, but rather they will provide added focus on the cost of that growth, ensuring that we get full value for every dollar we spend and that we time our investments to maximize the impact they can have. As part of this renewed focus on capital efficiency, you will see us change how we report adjusted EBITDA. Beginning with Q3, we will no longer add back plant start-up expenses for the new store marketing investment.\n\nThat will provide greater clarity on our path toward generating positive net income as the business scales further following our planned capacity additions. We will provide updated guidance using this new definition at that time, and we'll also provide historical data that shows both approaches. This will create a seamless transition from the old measure to the new measure. To be clear, there are no new disclosures and our transparency will remain intact.\n\nThis is simply providing greater visibility on the cash usage and generation of the business to meet the shifting needs of the marketplace. While we fully realize this approach will create much lumpier adjusted gross margin and EBITDA results. We also believe that it will allow us to demonstrate the emerging profitability of the business with greater clarity and more easily compare it to other high-growth businesses. Looking ahead, we are keenly aware that our net sales are running well ahead of the pace needed to deliver our 2025 goal and that the price increases are driving up the buying rate, making that goal much easier to achieve.\n\nWe intend to revise our long-term goals by year-end to capture the impacts of the price inflation, including any impact on our ability to attract new users any loss of users due to higher pricing and the full benefit of higher buying rates. We will also need to adjust for the updated methodology that Nielsen is using due to determine household penetration. That new methodology is now in place, and it indicates that we have even more users than we previously reported, about 500,000 more users. The new method also indicates that we've been adding users over the past two years at a faster rate than Nielsen previously projected, adding an incremental 220,000 users over the past two years and with more balanced growth over time.\n\nI've included a comparison of the old and new data sources in the investor presentation so that you can see those changes. Before I turn the call over to Heather to discuss the Q2 results and our guidance for the year, I also want to make a comment on the planned start-up of the NS facility and how we think Freshpet will perform in a recession. We are in the final countdown to lift off in Ennis. We remain on track to start up our role line there next month and produce saleable products by the end of the month.\n\nThat will not turn into meaningful shipments until October, but it's very exciting to reach this milestone for such a pivotal project. We have begun sending the highly trained production staff back to Texas from Pennsylvania, and they are ready to go. All the role line equipment is installed, and we are going through our start-up checklist. Additionally, Much of the equipment for the first bag line has already been installed, and we remain very confident that we will be able to start that line up in Q4.\n\nOnce that start-up happens, it will unlock significant potential for Freshpet. In addition to the significant increase in production capacity, it is designed to be our most cost-efficient, most sustainable, highest quality facility with room to grow and support an even larger business. With the first phase of that facility opened next year, we will have more than $1.1 billion in capacity available to us enough to support almost double the volume we have guided to this year. thus ensuring our ability to continue our rapid growth next year and beyond.\n\nWe've already spent the cash to create most of that capability, and we will finally be able to generate returns on those investments. Turning to the impact of a potential recession on the business. I think it is safe to say that pet food is a category and Freshpet as a brand should perform very well in a recession. History has shown that pet food is one of the most recession-resistant businesses as consumers are unlikely to stop eating their pet and the number of dogs in households has grown consistently through each of the recessions of the past 20 years.\n\nWhile Freshpet was in its infancy during many of those recessions, our track record of growth has been extremely consistent, doubling the business at every three years since its founding in 2006. Further, as we have studied the household penetration and buying rate data for Freshpet versus the entire pet food category during the recent period of rapid price increases, we've seen that the Freshpet user base has been more committed to maintaining the Freshpet habit, than the pet food category overall. While this is not the same as weathering a recession, it does speak volumes about the overall loyalty of the Freshpet franchise even under economic duress. That leaves us confident that we will be able to continue our rapid rate of growth even if we experience a recession.\n\nThere's also a positive side to a recession. We believe that a short and not very deep recession could better align supply and demand for the various ingredients and equipment we buy, lowering cost, shortening lead times, and improving availability of the materials we depend on. That could lead to greater capital efficiency and better margins. In summary, the underlying health of the business is strong, and we are more focused than ever on ensuring that the business will generate the margins cash and profitability that you would expect of a company that is leading and defining the future of pet food.\n\nWe are navigating some difficult times with the ramp in inflation that the entire industry is facing, but we are engaged we are reacting, and we are improving. And once we find equilibrium with cost and price, we will deliver the gross margins that we know this business is capable of delivering. In combination with the leverage from scale that we get on our G&A costs, -- we believe we are on track to deliver our 25% adjusted EBITDA goal by 2025. Now let me turn it over to Heather to take you through the highlights of the quarter.\n\nHeather Pomerantz -- Chief Financial Officer\n\nThank you, Billy, and good afternoon, everyone. We had strong net sales in the quarter, in line with our guidance, but the adjusted EBITDA was below our expectations. A meaningful portion of this shortfall was timing of marketing spend and will correct itself by year-end. Some of it was due to the cost of the quality issue we had in the quarter.\n\nSome of it was due to some logistics challenges we had in June and which we think we can overcome in the back half of the year. And some of it was due to incremental inflation that exceeded our plan and for which we are taking pricing. Let me take you through each element one piece at a time. Net sales were $146 million in the quarter, up 34.4% versus a year ago.\n\nNielsen measured consumption in the quarter was up 41%. The difference between Nielsen measured growth rate and the net sales growth rate is the size of the trade inventory refill that occurred in the year ago period versus what we did this year. The consumption growth rate consisted of approximately 21% unit growth and 20 points of pricing growth. While we still only have about four months of data with full pricing in effect, this balance between pricing growth and unit growth is in line with our expectations and represents very modest price sensitivity compared to other CPG businesses.\n\nFor perspective, our unit growth of 21% in the quarter can be compared to unit growth in Q4 of 19%, which was prior to the price increases and 28% in Q1 when we had strong distribution and advertising and the smaller of our two price increases was in effect. You should expect that we will always have price growth due to innovation and consumers moving into our higher-value items over time. So our total Nielsen measured sales growth should always be a few points higher than our unit growth. Driving the net sales growth was a return to household penetration gains closer to what we would expect over the long haul.\n\nOver the past 12 weeks, our household penetration has increased by 19% versus a year ago. As Billy indicated, Nielsen is now reporting that the size of our consumer franchise is larger than we had previously reported, and it is growing more quickly. Our consumer data and the feedback we get from retailers would support that. We did see both a downturn in retail foot traffic and household penetration gains in June, when gas prices hit a national average of $5, but we are seeing a strong bounce back as gas prices are dropping again.\n\nThat did have a modest impact on the net sales in Q2 as consumers seem to consolidate or defer trips in June, but our shipments in July have been strong as have consumption and household penetration gains. It is also interesting to note that the seasonal consumption patterns we are seeing this year are in line with those we saw in the pre-pandemic era, with consumption going flat during the summer months due to established seasonal feeding patterns and then growth resuming in late August. We expect to see that again this year. This suggests that consumers have returned to more normalized pre-pandemic lifestyle.\n\nYou can see this on the three-year stacked growth rate chart in the accompanying presentation, which helps smooth the volatility of the last two years and compares our performance to the pre-pandemic period. That shows our growth rate by week when compared to 2019 is extremely consistent, reinforcing the strong and steady growth of the Freshpet business. We continue to get strong interest from retailers in placing additional Freshpet fridges. Our focus and the focus of many retailers has turned toward multi-fridge placement in the highest volume stores so that we can both expand the assortment and improve holding power.\n\nMany retailers have been waiting for us to increase our supply before they replace those fridges. That is now happening, but many retailers are running into either labor issues or budget issues that will prevent some of the more major renovations of their pet food sections that are necessary to accommodate the significant increase in space that they are planning for Freshpet. That will push some of the bigger launches of multi-fridge sets into next year, so we will likely come in light on the number of upgrades and second, third fridges this year, but will over deliver by quite a bit on the net new stores because those installations require less labor and can be managed within existing retailer budget. Those deferred upgrades and second fridges will likely result in a very strong first half of the year next year.\n\nAll of this has us feeling very bullish about our prospects at retail over the next 12 months or so. The adjusted EBITDA was $3.9 million in the quarter, below our expectations. Part of this shortfall was timing with the marketing investment in the quarter coming in at almost $24 million. Spending was not incremental to the year.\n\nIt simply reflected a timing adjustment. We made this investment to help sell through the 12% price increase that went into effect in mid-March, which is when consumers were most sensitive to the price increase. Based on the unit movement and household penetration gains that follows, we are pleased with the strategy and the limited price sensitivity that we encountered. Adjusted gross margin was 42.4% for the quarter and was 42.1% for the year-to-date.\n\nThis is up sequentially from the 41.9% we generated in Q1 but does not reflect the magnitude of the improvement we had expected our price increase to produce given our quality issues. However, when you exclude those costs, the adjusted gross margin would have been approximately 43.8% or about 140 basis points higher. The amount of affected products that got into the market and had to be retrieved was very small. But the cost of the product disposals related to the underlying production issue, some additional lab work and testing and some supplemental processing was much bigger than anticipated.\n\nWe experienced increased inflation in some input costs, mainly due to labor and energy as well as transportation cost increases at our suppliers and expect them to continue for the balance of the year. Further, our cost for diesel and natural gas is well in excess of the cost we estimated when we gave our initial guidance. And while diesel has moderated recently, it is still well above where it was when we set our budget at the beginning of this year. Our third price increase, which will be 2.6% and goes into effect in late September, is designed to protect our margins in the face of those higher costs, and we expect to end the year with much stronger margins and position ourselves with a much more balanced set of costs and pricing as we enter 2023.\n\nHowever, the timing of the increase will create another mismatch between our cost increases and our pricing in the third quarter. In simple terms, the cost increases we have seen since we set our budget are in the range of approximately $10 million to $11 million or about $15 million on an annualized basis, and our price increase will cover less than half of that this year primarily because it won't be effective until the beginning of Q4. We promised you that we would plan more conservatively this year and we did. But while we are absorbing some of the incremental costs -- we cannot absorb all of them, but we are lowering our adjusted EBITDA guidance to reflect that mismatch.\n\nWe are encouraged by some emerging cost trends that suggest that inflation in the materials that most impact us may be moderating. This may be the result of the economic slowdown we have been hearing about and an early indication of the potential cost benefit we might get if we have a mild recession. Spot freight rates have declined over the past three months, and we have gotten a rate reduction that begins in the third quarter. Diesel costs have dropped significantly since peaking in mid-June.\n\nWhile many of our key ingredients and their key inputs continue to move up, the cost of our proteins has stabilized, and there was some suggestion that they might actually provide some relief next year versus the cost we are paying this year. The underlying cost of the materials used in construction and equipment such as steel, nickel, zinc, and copper have also dropped considerably. While none of these declines will help us in the short term, they are positive indications that much of the inflation that has plagued us for the past 18 months may have peaked and that will enable us to restore our margins and complete our capacity projects with less pain. I think it is important to be cautious on this because it only takes one Gulf hurricane to drive up energy and diesel cost further or another outbreak of disease to impact the bird block, offsetting the otherwise positive momentum we are seeing.\n\nBut the underlying supply and demand characteristics are improving, so I am optimistic that we will finally be able to reap the margin benefits of our price increases, or at least narrow the gap. Our production performance in the quarter was strong, with increasing throughput during the quarter, which puts us in a much better position on retail availability. We achieved the highest number of total distribution points in our history during the quarter and have maintained them. As Billy indicated, labor has gone up for being an issue for us to be in a real strength.\n\nWe have successfully increased the talent of our recruits, invested in their training and are now seeing significant reductions in turnover and much higher productivity. Logistics costs, including warehousing, diesel and lane rates, drove approximately $2.4 million of incremental cost in the quarter. This was most pronounced in June when diesel soared to $5.81 and we also incurred higher warehousing costs. including those needed to segregate the products affected by the quality issue and the cost of starting up our new warehouse in Dallas.\n\nDiesel prices and lean rates have dropped considerably since then, and we should return to more normal logistics costs in Q3. A, our inability to start up our inventory allocation tool prevented us from filling trucks as we had intended. While our natural order fill rate continued to improve, our inability to fill trucks completely cost us about $1 million. We expect to continue improving our fill rate and hope to have our inventory allocation tools turned on later this year, but we will get the bulk of the benefit as our fill rates continue to improve naturally.\n\nFor perspective, our most recent week fill rate was over 80% and growing. We are continuing to deliver the leverage benefits in SG&A that our plan requires. Year-to-date, our SG&A as a percent of net sales has dropped by 150 basis points, and we believe it will continue to improve as the year goes along. Capital spending in the quarter totaled $39 million.\n\nAs Billy noted, we are expecting this year's total capex spending to be approximately $320 million instead of the $400 million we previously projected. The delay in the multi-fridge expansion less maintenance capex and both efficiencies and timing adjustments on our larger capacity projects will free up about $80 million in cash. We are also expecting the same delays to push back some of the capex previously planned for the next year, so will not increase next year's capex, but will instead push the spending back into 2024 or later. We can do this and still deliver our capacity and fridge expansion plans without the need for additional equity.\n\nOperating cash flow used in the first two quarters was $62.4 million, which was driven by inflated receivables and inventory levels, which were the result of delays in invoicing and some inventory reporting challenges in our new ERP system. And I'm pleased to say that we worked through those issues since the second quarter end. We are also addressing the inventory issues, which was caused in part by the need to hold and have a large amount of product due to the quality issue and expect to see a significant improvement in Q3. That is offset in part by the start-up of our second distribution center in Dallas.\n\nWe drew $27 million on our borrowing facilities in the quarter. At the end of the quarter, we had gross availability of $272 million on our credit line, subject to various women. Looking forward, we continue to believe we are on track for our net sales guidance for the year. Our net sales are up 38% to date.\n\nQ2 was our toughest year-on-year comparison, but we feel comfortable that we could achieve our net sales guidance for the year. We are also lowering our adjusted EBITDA guidance to account for the cost of the quality issue and the incremental inflation we are incurring prior to our increased pricing going into effect. Thus, we are lowering our adjusted EBITDA guidance to greater than $48 million from greater than $55 million. In closing, as you have undoubtedly heard from us and others, this is a turbulent time, but the infrastructure and organizational capability we have built and the underlying strength of the Freshpet brand have enabled us to continue our rapid growth, and we are very optimistic about the future.\n\nWhile we continue to experience short-term hiccups, we learn from each of them, and they become less significant, and this makes us stronger as we pursue our long-term goals. We are motivated by our mission to change the way people notice their pets forever, and we believe we are on track to delivering that goal. That concludes our overview. We will now be glad to take your questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions]. Our first question comes from the line of Steph Wissink with Jefferies. Please proceed with your question.\n\nSteph Wissink -- Jefferies -- Analyst\n\nThank you. Good afternoon, everyone. I would like to spend a little bit more time on the EBITDA revision for the year. And maybe, Heather and Billy, if you could both talk about this, but how much of the burden occurred already in the second quarter versus what do you expect that timing mismatch to account for in the balance of the year? If I just look at that, I think it's on Slide 8, that EBITDA bridge, just help us break down what's already been resolved and what's still to come? And then also related to the capex to settle along the same lines, how much of the deferral has already occurred versus how much is yet to come in terms of the overall revision.\n\nThank you.\n\nBill Cyr -- Chief Executive Officer\n\nHeather, do you want to take that?\n\nHeather Pomerantz -- Chief Financial Officer\n\nYes. So I'll start with, of course, the -- on the EBITDA guide. So the reduction is approximately $7 million. The quality issue is $2.2 million.\n\nSo of course, that already has already occurred in June. -- the balance of the change coming from the missed maximum inflation versus price about $1 million of that has incurred in the first half, with the expectation and the balance of that comes in the second half. Steph, can you just state on the line on the capex question?\n\nSteph Wissink -- Jefferies -- Analyst\n\nYes. Just the revision lower in capex. I'm wondering how much of that has already occurred versus how much is yet to occur. So the capex for the quarter, did it come in below, meaning what's left to be realized is also below? Or is all of the deferral in the revision of the year in the back half?\n\nHeather Pomerantz -- Chief Financial Officer\n\nGot it. Yes. Yes. So a portion of about a quarter of it occurred already in the first half that and then the balance is reductions in the second half.\n\nThe main driver of the second half shift is around the phasing of spend that we'll have around the innovation kitchen. That's the biggest driver of the shift in the second half.\n\nSteph Wissink -- Jefferies -- Analyst\n\nOK. So that innovation kitchen is now going to be a 2023 event?\n\nHeather Pomerantz -- Chief Financial Officer\n\nMost of it. Yes, there'll be a small spend in the second half, but the majority will be in 2023. That's correct.\n\nSteph Wissink -- Jefferies -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nOur next question comes from the line of Peter Benedict with Robert W. Baird. Please proceed with your question.\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nHey, guys. First question, just can you give us a sense of what we should expect plant start-up costs and the launch expenses could be for the full year? I think there were around $11 million in the first half. What should we think about for the full year? And maybe just a sense for what it should look like next year?\n\nHeather Pomerantz -- Chief Financial Officer\n\nSure. So Peter, the -- well, first of all, we'll provide a very sharp clarity when we issued the revised view for Q3. But for now, the best assumption is that the second half is going to be largely in line with the first half. So you could sort of double it.\n\nWhat you have going on there is with the net start-up you have increase in costs, as you would expect, as we ramp up to start up. But then, of course, then starting up, we stopped adding back largely in Q4. And so there's sort of the increased costs offset by that cost would have come into the cost structure anyway. For next year, it's -- we will have less start-up.\n\nI mean we have -- we have the last line in phase 1 of NS starting up. At some point next year, again, we'll provide a revised phasing of exactly when we plan to start that up. But that's the main start-up for next year that you should expect. So a much less significant start-up impact given that NS is really fully operational.\n\nIt's just adding one last line next year.\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nGot it. OK. That's helpful. And then just I mean maybe -- I don't know it can help us here.\n\nLike just how you're thinking about kind of the EBITDA margin flow through, kind of incremental margins on sales growth using this new method and then maybe getting past some of the noise that's out there right now in terms of just what's going on with -- in the business. Is there a way to think about that? Or what does your model tell you in terms of the incremental as we continue to kind of grow sales over the next several years?\n\nHeather Pomerantz -- Chief Financial Officer\n\nYes. So, Peter, I mean, I think -- I mean, we said it in the prepared remarks that certainly, there will still be some lumpiness to this. So as we have years of a larger start-up like this year, just using -- let's just use premiering in the first half, so $20 million as a proxy. It's a big impact in plant start-up.\n\nAs you look at next year, you're going to get a really nice pickup on the gross margin coming from -- and it's being started up and running. And again, just to reinforce our most efficient and profitable facility. You're going to get a really nice benefit next year. But then the following -- and that of flow through on the higher revenue.\n\nBut then on the following year, we will be starting up things like the Innovation Kitchen, which will have, again, volatility that will come with that. We will, of course, provide as much visibility and foresight to that as we move through it, we'll be extremely transparent as we always are. But it will be a little bit lumpier. The longer-term road map and flow-through doesn't change.\n\nThe expectations of -- Ennis as we bring on not only phase 1, but phase 1 and 2 with even greater efficiency continues to be a key driver in terms of the margin improvement, and then the continued benefits from the SG&A leverage benefits around both logistics and G&A leverage will continue and should continue to be a more consistent part of that flow through.\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nOK. And then maybe if I could, just a follow-up kind of on price. And you kind of talked about how some of the cost pressures may be peaking here. We'll see if that's the case.\n\nBut how do you think about price in an environment where, let's say, the costs are starting to moderate and come down. Do you expect prices will hold in this category? I know -- or do you think you're rolling back a bit? What's-how do you maybe think about that right now?\n\nBill Cyr -- Chief Executive Officer\n\nScott, do you want to take that one?\n\nScott Morris -- Chief Operating Officer\n\nYes. Peter. So we've been trying to as we've done pricing, we've been trying to be really thoughtful as to how this is all going to land eventually. And it's one of the reasons that it's put us behind in a couple of quarters where we've been 30 or 60 days, a little bit slower to take some pricing action.\n\nBecause when this is all said and done, and it's leveled out, we want to end up in a really good place. What we anticipate is many others in the category in just dry and wet food we'll use significant amounts of promotion dollars to adjust prices, both kind of in the near term and in the mid and longer term. We don't do any promotion as you know. So we really don't want to -- we want to be very careful of how our approach to the pricing where we end up in making sure that we create a portfolio of products that has really, really wide appeal to 11 million plus consumers.\n\nAnd that's kind of how we've been thinking about it.\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nOK. That makes sense. Thanks so much, guys.\n\nBill Cyr -- Chief Executive Officer\n\nThanks, Peter.\n\nOperator\n\nOur next question comes from the line of Bill Chappell with Truist. Please proceed with your question.\n\nBill Chappell -- Truist Securities -- Analyst\n\nThanks. Good afternoon.\n\nBill Cyr -- Chief Executive Officer\n\nHey there, Bill.\n\nBill Chappell -- Truist Securities -- Analyst\n\nHey, Billy, Scott. I guess, I know you are waist deep, at least in the analytics and the customer. And I think -- the concern I hear or see most is not your existing consumer base trading down because they're highly loyal and obviously, they don't want to change what their dog is eating. But it's that new consumer trading up and the worry that, that will -- the pace will slow with the higher prices than just that you're at the super premium as we go into a potential recession.\n\nSo I guess are you seeing anything from that new consumer slowing down, except for the small little spikes where you've seen some unevenness? Or do you think you can hold up really well and -- you talked about growing through past recessions, but you're obviously a much smaller base at that point. So just trying to -- any color or any food you have to back that would be great.\n\nBill Cyr -- Chief Executive Officer\n\nYes, Bill, this is a topic we've been spending a lot of time thinking about and watching the data very closely. We included in the presentation today, a few slides that give you a little bit, a bit of a glimpse of what we're seeing. We did see a little bit of a slowdown in June when gasoline hit $5 as Heather said in the prepared remarks. But since then, we've seen it bounce back up.\n\nThe number that we saw in the last 12 weeks, the household penetration gains have been up 19% versus a year ago. When we look at it across a variety of demographics, we look at it, small dog households, large dog households, both up, we look at it by generation. We've seen virtually all the generations are moving up. The millennials.\n\nActually, we're moving up the most. We're getting the most traction in that group, and we look at the cross income groups. And across income groups, we are not seeing any significant differences in their willingness to buy Freshpet or join the Freshpet franchise. There were little bits and dips in June.\n\nI don't want to gloss over that June was a little bit lumpier than we would like, but it came right back in July. So we're feeling pretty good about the ability to attract new users to the franchise. -- because the proposition is pretty darn attractive. But that's what our data is saying so far, and it's in line with where we'd expect to be or would hope to be.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOK. Thanks. And then -- just kind of a minor question. I guess I'm a little surprised that diesel prices kind of impacted you intra-quarter.\n\nI thought you had done some diesel hedges or maybe just educate me on what is hedged and what is not hedged? Thanks.\n\nBill Cyr -- Chief Executive Officer\n\nWe don't hedge any diesel, but we do have some hedges on natural gas for a portion of our production facility. But even those will roll off by the end of November. So we're going to face that challenge at the end of the year. But we don't hedge -- we currently don't hedge any of our diesel exposure.\n\nAnd that's certainly something as we get a little bit larger in scale in our distribution that we ought to consider. But so far, we have not.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOK. Good. Thanks.\n\nOperator\n\nOur next question comes from the line of Anoori Naughton with JPMorgan. Please proceed with your question.\n\nAnoori Naughton -- JPMorgan Chase and Company -- Analyst\n\nHi. Good afternoon. Thanks for the question. A quick clarification and apologies if you said this on the call, but how does your new household penetration target or your metric of $4.9 million compared versus the first quarter of this year? And then my question is, what does the shape of the trajectory look like for Freshpet to get that back on track with its longer-term household penetration goal of 11 million households? I believe the additional plan when you set it out was closer to 7.6% in '23, which is still sizable 50% jump from where you are today.\n\nSo I guess the cost of the question is, will Freshpat need to spend more than 12% on ad spending for the next couple of years to catch up, so to speak. Thank you.\n\nBill Cyr -- Chief Executive Officer\n\nYes. First of all, we provided a comparison in the deck of the June data from the old method to the new method. So you can see the difference. I don't have the new method for the period at the end of Q1.\n\nSo it's hard to say. But in total, it's like 186,000 more users in the new method and the old method. And the rate of gain over the last couple of years has been 200,000 more than what the old method would have shown. What was most intriguing about the way in which the data has come out, and we've also seen a similar piece of data from Numerator.\n\nSo it kind of validates it is that our rate of growth has been more in households has been more consistent over the last two years than what they had previously projected. And it gets to your second part of your question is, what do we need to do to get to that 11 million households? The answer is we need to get household penetration growth going back up into the mid-20s, which is where we've been in the past. And the last 12 weeks were up 19%, and that includes a little bit of a dip that occurred in June. So I'm expecting as we go further toward the end of the year, you're going to see that number continue to go up and will move into the 20s numerator, which provides similar data with a larger panel is already showing us moving into the low 20s with their more recent data.\n\nSo I'm feeling pretty good about we're moving back up into the 20% plus growth rate, and we need to stay there. We need to get into the mid-20s and stay there.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOne other thing to just take into consideration is as the business gets bigger, obviously, this is a simple math that you can do. But the 12%, it starts to be -- the dollars start to be tremendous, and it allows us to basically drive more and more consumers in. If we can keep our CAC in a similar range, we should be able to achieve that 11 million number fairly easily.\n\nAnoori Naughton -- JPMorgan Chase and Company -- Analyst\n\nUnderstood. And just to clarify though, you've accelerated some of your ad spending into the second quarter. So presumably, there would be very little incremental spending as move into the back half. So I guess I'm just trying to square how we'll see your household penetration start to accelerate from here if you're going to be spending less incremental dollars between move through the back half.\n\nBill Cyr -- Chief Executive Officer\n\nYes, it's -- always remember the comparison, too. The year ago was pretty soft in this area.\n\nScott Morris -- Chief Operating Officer\n\nYes. We have a very healthy Q3 advertising wise. And then as Billy was mentioning, we have -- we typically have a very fairly soft Q4 in advertising. Look, the big thing is there is a tremendous amount of disruption in the marketplace with whether it's gas prices, fear of recession that I think the fear was may be as bad as the actual recession itself.\n\nWe can see consumers stabilizing in their behavior and their traffic into stores. And it looks like this next period, our prices are now stable, consumers are kind of calmed down, and we're going to see them go back into stores with fuller fridges than we've ever had, and we anticipate making some progress in this quarter.\n\nAnoori Naughton -- JPMorgan Chase and Company -- Analyst\n\nOK.Thank you.\n\nOperator\n\nOur next question comes from the line of Brian Holland with Cowen and Company. Please proceed with your question.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nYes. Thanks. I have that effect on people. Good afternoon, everyone.\n\nSo if I could ask first about maintaining the net sales guidance. Given prior year track volume compares get tougher in the second half, pet specialty appears to be a drag. I appreciate that part of that is comp driven. But I'm just curious how we get comfortable because it would seem that one or both of track volume will need to sequentially get better from here, assuming price at why you get another little bump there in the fourth quarter.\n\nBut that and/or pet specialties got to get better. So can you help us understand the volume path over the balance of the year and next?\n\nBill Cyr -- Chief Executive Officer\n\nYes. So the way I think about it is we're going to be in this summer horizontal period until probably the end of August. And then because of the media investment we made, because of the better in-stock conditions because of the purge placements that we've done, I'd expect to see it start ramping up on the consumption as you went through the fourth quarter. Remember that last year, again, I hate to go back and talk about lapping them last year.\n\nBut last year, we had a disastrous July because of the warehouse issue that our third-party warehouse -- we fortunately survived this year's July and had a very strong July. And then on top of that, if you recall in the fourth quarter last year, we had the spare parts issue. That impacted our ability to ship in the end of November, December. And so while we need to see good consumption numbers and expect to see strong consumption numbers, between now and the end of the year.\n\nThere are some anomalies in the year ago that kind of give you a sense that the growth rate on a net sales basis as well as on a consumption basis where you're able to deliver the guidance. And frankly, it should give us a little bit of room.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nAnd then just as a follow-on to that, obviously, trade inventory, I think it was maybe like a 700 bps headwind or whatever it was in the quarter, forgive me them not looking at that site at this moment. But I'm curious if you can help remind us what that looks like in the second half of the year. what you're lapping as far as impact there? And then also on the elasticity side, I appreciate the data that you gave us, but you've also called out some nice distribution growth in the first half. So I'm wondering how you discern between kind of unit growth that's sort of apples-to-apples and what the distribution benefit is? Because if you had some distribution benefit in the first half, it was -- the logic would be you might have to keep that up to make the math look the same, but maybe you can walk us through that.\n\nBill Cyr -- Chief Executive Officer\n\nYes. I'm probably going to get lost in some of your questions there. But the best way to neutralize, Brian, what you're talking about is velocity, measuring the velocity on the business. And the velocity on the businesses continue to do quite nicely even though we've been in this in this period where we had $5 gas and whatnot.\n\nSo I don't know if you've seen that. We didn't include it in the deck this time we have done in the past, but velocity in the business of dollars per point of distribution have been fairly healthy. So I think, yes, we've gotten distribution where we have more distribution coming in the back half of the year, and we're going to have velocity gains behind the advertising. So I think that all gets us to where we want to get to.\n\nI don't know if that addresses the question or not though.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nNo, that's helpful and exactly what I was getting at. I was trying to be confusing, but you got it. Trade inventory was the other one there. Just help us understand what.\n\nBill Cyr -- Chief Executive Officer\n\nYes, there was trade inventory. There's fairly significant amount of trade inventory refill in the year ago. It was kind of odd. It was more skewed to the fourth quarter than the third quarter.\n\nBut even in the end of the fourth quarter, we had some drawdown when we had our supply problem. So it's going to be lumpy throughout the back half of the year. So we do need to have consumption in excess of our net sales growth to compensate for it. So there's going to have to be some over delivery, but it's not exactly clear how big that number is going to be because the trade inventory needs to grow year-on-year as well as we get more distribution and a bigger business, the customers hold three weeks of inventory and three weeks inventory is a bigger number on the 35% larger business than it was a year ago.\n\nSo there will be some trade inventory build that happens this year as well.\n\nBrian Holland -- Cowen and Company -- Analyst\n\nAppreciate it. Thank you.\n\nOperator\n\nOur next question comes from the line of Rupesh Parikh with Oppenheimer. Please proceed with your question.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood afternoon. Thanks for taking my question. So I just wanted to go back to operating cash flow. So year-to-date, you guys burned a little over $60 million.\n\nIt looks like mainly due to AR and inventory. I just want to get a sense of how you're thinking about this cash burn by the end of the year on the -- at the OCF level?\n\nHeather Pomerantz -- Chief Financial Officer\n\nSure. So I think the first thing is the receivables. So it's significantly inflated all driven by the growing pains from our new ERP system. Basically, our inability to invoice on time has obviously caused delays in terms of our cash collection.\n\nNow, as you mentioned already on the call. We now have a solution in place that basically allows us to invoice real time with shipments as we had done previously. And so as we collect what was past due and are invoicing our clients, we expect to be back to our normal DSO run rate of about 25 days based on our customer payment terms. So that's the first piece.\n\nThe other piece on working capital. On the finished goods inventory side, that is sitting on a day that is largely in line with our objectives to be at around four to five weeks of inventory on hand, and we've needed to build inventory to improve customer service. But we did have -- we are sitting on inflated raw materials and packaging inventory. In Q2, that was about $5 million worth of an impact.\n\nAnd that also is attributable to ERP growing pain, where we needed to hold on to some incremental inventory to ensure that from a planning perspective, we have what we need as we work through. Again, we have a very dedicated team in place now to finish up some of the needed post implementation solutions, but this should really turn around. And what you will see in working capital movement from here on will be driven by the growth in the business and not by the ERP impact.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOK. Great. And then maybe just one additional question. Just on the guide.\n\nI'm just curious what you guys see now is a bigger risk for the guide for the remainder of the year.\n\nBill Cyr -- Chief Executive Officer\n\nWe think we've -- Rupesh, I think we've captured -- we went through and looked at all of the inflation elements because that's the thing that caught us. I mean we're absorbing in our guidance, some of the conservatism that we built in at the beginning of the year, we absorbed it. We can't, as Heather said, absorb all of it. We think we've identified and captured all the inflation that we're going to get.\n\nBut there are a few things like diesel and like natural gas that we don't have hedge positions. And if those things ran wild, that could be -- those could be remaining risks for us. Not enormous, but they could be risks for us. The flipside is the same thing that we've had and we keep trying to prevent is any supply interruptions, whether it's upstream for us or it's our ability to produce and supply to our customers.\n\nAnd I would include in that, we need a timely start-up of our NS facility. We feel very good about where we are, we're ready to start it up. But we need that roll line to come on to produce the product to deliver our net sales for the year. So I don't want to make it sound like we don't think there are any risks because there are, and we have to go out and manage them, but they would come on the supply.\n\nNot on the demand side, it would come on the supply side, and it would come on inflation. Scott or Heather don't know if you see it any differently.\n\nHeather Pomerantz -- Chief Financial Officer\n\nI don't. I think he's covered it fully.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood. Great. Thank you for all the color.\n\nOperator\n\nOur next question comes from the line of Mark Astrachan with Stifel. Please proceed with your question.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nThanks for a one afternoon. I wanted to ask about volumes. So they seem a little bit slower than at least I would have thought, inclusive of more ad spend that you said earlier in the second quarter. And if we take a look at just the scanner data of the two-year volume CAGR has sequentially decelerated.\n\nI think each period since, call it, late March, early April. So I guess I'm curious how that has stacked up versus your expectations. You touched on elasticity on the prepared remarks, but I don't think updated the actual elasticity. So if you could perhaps talk to that? And then how do you think about it if not potentially getting worse with the incremental pricing that you talked about today?\n\nBill Cyr -- Chief Executive Officer\n\nYes. We expected, I think, as we said in the prepared remarks, we expect to go flat during the summer because it looks like 2019, and that's why we provided the three-year stack. So you could see from 2017 to 2019, we saw very consistently in the summer, consumption goes flat, whether it's people on vacation, dogs eating less. But you went flat and then you came back up again late August into early September.\n\nAnd we'd expect to see that continue. We did see in June, we saw some softness, so said it about $5 gas, but we frankly also saw come back in July and saw very, very strong shipments in July. We saw household penetration bouncing back up. So we feel pretty good about the trajectory of the balance of the year.\n\nI mean, we're all in uncharted waters, and we don't know whether there's a recession. We don't know if there's -- if the next price increase is going to be something that is the straw that breaks the camel's back. But the data we included in the deck and data that we have beyond that shows that pricing is pretty stable at this point. The sensitivity we have is about where it's going to be is what you'd expect.\n\nAfter about four or five months, you'd expect to get to a fairly stable place. And so we think we know what it looks like, and we think we know what the trends look like going forward. And our shipments and order rates match up pretty well with the projections and the guidance that we're giving.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nOK. And maybe just sticking with that, thinking about just broader strokes on affordability. So with the new price increase, I think you'll be up something, call it, high teens versus where you were 12 months ago, I guess that's roughly consistent with what we're seeing across the pet food, dog cat category. But to earlier points about potential for increased promotions coming out of this period of heightened inflation or potentially deflation at some point.\n\nYou don't promote, you're not going to do that. But if others are doing it and they promote back half of it, then how do you think about the relative affordability for the product going forward at that point.\n\nBill Cyr -- Chief Executive Officer\n\nScott, do you want to take that?\n\nScott Morris -- Chief Operating Officer\n\nYes. So, Mark, so one of the things that we were really conscious about, and I touched on this a tiny bit with Peter, but not didn't get into the details. When we -- even this last price increase and all along, we made sure that we had a handful of items that were still as affordable for everyone as possible. And we were really conscious about that.\n\nWe did it in a couple of different sizes and a couple of different product forms. So no matter where the dust settles, those products will be available to people and they have seen modest price increases, but they have not beared the brunt. They're not carrying the biggest amount of the price increases. So anyway, I think we tried to be mindful of that.\n\nWe put those in place. It will be in our six-pound chicken roll or some of our one, one and a half pound sizes. We've tried to make sure that they continue to remain accessible and affordable.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from the line of Robert Moskow with Credit Suisse. Please proceed with your question.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHi. Thanks. I guess I cover a lot of food companies, and I don't recall hearing any of them talk about a slowdown in consumption from $5 gas, except for maybe impulse. So can you be a little more specific as to what type of products within your portfolio felt that impact? Are there some items that are more discretionary in your portfolio? That would make more sense to me than saying that people look at the price of gas and then reduce their -- the volume of consumption for their pets.\n\nBill Cyr -- Chief Executive Officer\n\nYes. Rob, it's -- what we saw was foot traffic down and what people were doing was consolidating trips. And so what we were seeing was people were shopped less frequently, and they move to our bigger sizes. And so it was -- I think it was a temporary phenomenon because if you look -- if we look at our business in July, it bounced back.\n\nIn fact, it looks like it's filling a hole that might have been created in June. And I can't put my finger on exactly how that happened or why that happened. But we look at the data on trip frequency and the size of the units that they're buying. It clearly suggests that people who are consolidating trips and buying larger sizes when they made the trips, but there was a little drawdown of pantry inventory that happened, and they're making up for it in July.\n\nAgain, I don't know the psychology that works behind it, but that's what the data shows.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. And then maybe one more follow-up. You said that you increased your media spend in order to sell through price increases. Is that for the benefit of the trade like do you increase the media spending to help the trade with this price increase? Or is it for the consumer? Because like I don't know why I'm not sure who is helping it sell through to.\n\nBill Cyr -- Chief Executive Officer\n\nIt's to make sure that as you're seeing your prices rise that you're making sure that you're keeping your growth rate intact, right? And one of the things that we looked at when we look at growth rate is we're looking at units, we're looking at pounds, etc., because dollars are a little bit hard to kind of get a handle around right now. And we've been able to see units stay in the high teens, even in same-store sales, high teens into the early 20s and similar with volume. So if you look at it that way, through this period of taking a net 17% price increase, we've been able to keep our overall kind of velocity growth strong. And actually, I mean, I look at it and I go, that's pretty encouraging, especially with what we saw in the category.\n\nIf you look at units across the category, everyone's kind of high-fiving across the type-two category, celebrating that they're having growth. But if you remove the price increase growth that they have in place, units are -- look pretty bad or volume looks pretty bad for the majority of the category. So I think that we've come out of this in pretty good shape.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. I don't know if you're making me more optimistic or less by saying that the pet food category is getting hurt, but -- OK, Scott. But here's the follow-up. Like you're raising pricing in the back half, so why is this just a pull forward in media? Would you have to do it again in the back half?\n\nScott Morris -- Chief Operating Officer\n\nIt's literally all we literally call it a IP and to price increase. It's 2.7%. And is what we're seeing in the back of the year. It's literally rounding if we're at $5.79, we're going to $5.99 on items.\n\nI'm just using that as an example. So it's gap very much.\n\nBill Cyr -- Chief Executive Officer\n\nOne of the lessons that I've taken away from this experience is that we would -- we did one modest price increase than on enormous price increase and then another modest one. And the consumer could digest more smaller price increases rather than the size of the second price increase, which was pretty big because that creates sticker shock and could cause the consumer to reconsider or reevaluate, do I really need this. And as opposed to more frequent, but smaller. And for the next one, I don't think a lot of people are going to add an eyelash app, but they certainly noticed the second one.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from the line of Jon Andersen with William Blair. Please proceed with your question.\n\nJon Andersen -- William Blair -- Analyst\n\nYes. Thanks for the question. first question is, Bill, I think you referred to providing an update at some point in the future with respect to addressable households and the -- I guess, the underlying algorithm of household penetration and buy rate. Were you referring to that as being just kind of a mechanical exercise given the change in approach or methodology by Nielsen or something more fundamental based on price changes, a different kind of consumer behavior or both?\n\nBill Cyr -- Chief Executive Officer\n\nIt's somewhere in between. I don't think we're going to go back and revisit the addressable market. We -- at least we haven't committed to doing that yet, but we are looking at the driver. So for example, as Scott mentioned earlier, what is the customer acquisition cost with our current pricing in the market? Does that change in any appreciable way? What does the buying rate look like once consumers are digesting the pricing we've got? And just reconstruct the model that gets us from where we are to the 11 million households and the $1.25 billion in net sales because as I think I said when I framed it up, I framed it up and saying, we know we're running at a rate that's well in excess of what you need to get to the target.\n\nAnd the question now is, with the higher pricing and the higher buying rate, what is the composition of that going to look like? Do you make any changes because the CAC is higher or lower, the buying rate is higher or lower, the households are easier or harder to get. And that's the algorithm we need to put together, and we wanted to see the pricing stabilize before we made that decision.\n\nJon Andersen -- William Blair -- Analyst\n\nOK. So no change to your level of confidence in the $1.25 billion or the 25% EBITDA margin. It's just kind of maybe the algorithm underneath that is what you're saying?\n\nBill Cyr -- Chief Executive Officer\n\nYes. That's probably the right way to think about it, John.\n\nJon Andersen -- William Blair -- Analyst\n\nOK. And then I guess, just a follow-up. I just have a broad question on direct-to-consumer. You didn't really mention at least in the prepared comments, e-commerce growth this quarter.\n\nIf you could give us an update on that? And then are you -- do you have broader plans for a direct-to-consumer offering? When might we hear about that? If so, I just want to get your perspective on that from a competitive standpoint, too. Thanks.\n\nScott Morris -- Chief Operating Officer\n\nSo we've continued to see really nice growth. It's actually -- what we consider e-commerce, which is any place someone can sit down in a computer and order our product. Some of that's directly delivered and some of that's click and collect. It's actually paid, I believe, 45 and 46 in the deck, John, and I know we provide a ton of materials to go through.\n\nBut -- so that continues to grow. It's -- there's a couple of retailers that are doing like a really, really great job with this. And we're continuing to invest with them and work with them. And over time, we recognize that from a DTC standpoint, we don't believe that going direct to consumer is the right path for us, but we do believe that modifying our product portfolio and working with our existing partners is the right path.\n\nAnd we feel like we've come up with kind of a new and differentiated model that will be really helpful to kind of break into that piece of the market. And I think whether it's later this year or Q1, we'll be introducing some kind of a new product line in order to do that.\n\nJon Andersen -- William Blair -- Analyst\n\nGreat. Thanks. Thanks, Scott.\n\nOperator\n\nOur next question comes from the line of Ben Bienvenu with Stephens. Please proceed with your question.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nHey, guys. Jim Salera on for Ben. I wanted to circle back to the capex guidance reduction. If we look at pushing the investment in the innovation center more into 2023, just given the overall inflation in building materials and things that go into setting up a new facility, does that $80 million, add that into the capex, I would assume that if you shifted some of that goes into the new year, but it looks like the capex cadence outside of this year is still the same $300 million, $200 million, $100 million [Inaudible].\n\nBill Cyr -- Chief Executive Officer\n\nSo with that innovation center, it literally is we were we can't get as much done as we would like to from a timing perspective. We actually think that can work to our advantage. So I think we touched on whether it's stainless steel, building materials, etc., standard deals, the amount of it we use in our equipment is pretty extraordinary. So as we look at planning that out, we may have to put deposits down at the similar timing, but we anticipate that as the markets on some of those commodities, stainless steel, for example, or some of the other building materials cools off a little bit.\n\nwe think there may be advantage in that innovation center, and we're hoping that there's additional savings through that, too.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nSo to be clear, that's in the $80 million. Is the assumption that some of those like core commodities come down?\n\nBill Cyr -- Chief Executive Officer\n\n$80 million is the timing and a little bit of an efficiency. As we said, we had a conservative set of assumptions. As we get further along, we get more realistic assumptions on both timing and the actual cost, and we pushed some of the projects back. It's also -- you have to know that some of this is a cascading effect where one project leads to the next project.\n\nAnd so what you're seeing is we showed you capex going out through 2025, but there's some stuff that is just kind of cascading will fall back into '26 in that case. So the $80 million is a total reduction in the horizon we're showing you. Some of it is efficiency, some of it is timing, but some of it is pushed out into the latter years.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nGot it. So also, I think it seems like a waterfall back out past '20. 2026 could contain some of that incremental spend of like, I think, the 100-ish on that you talked about before?\n\nScott Morris -- Chief Operating Officer\n\nBut I think importantly -- but importantly. The capital spending that we have planned out in this revision gives us plenty of head space to grow and meet the objectives that we have.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nAnd then just real quick on -- I know we got a lot of questions on the ad spending. But just given that there was such firm add support in the first half of the year. If the economy continues to deteriorate into the back half of the year, would you guys feel OK turning some of the ad spending back on to support volumes? Or would that be something that you're more focused on margins in the back half of the year and so you'd rather take the volume hit and wait until the first quarter of next year starts to pick back up.\n\nBill Cyr -- Chief Executive Officer\n\nI think that we're very committed to making sure we continue delivering on the top line, and we feel very good about the plan that we've got. There's also lead times on media commitments that would make it hard to do that in an efficient manner. So we're pretty committed to delivering the net sales line, we said, but also delivering the EBITDA that we've committed to. So I don't want people to get the sense that we would erode the profitability because we want -- we do know, as we said in the call, we're very focused on generating cash and cash efficiency as we grow.\n\nAnd so we want to make sure we're very mindful of the investments we make and when we make them.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nOK. Great. Thanks, guys.\n\nOperator\n\nThere are no further questions in the queue. I'd like to hand the call back over to Mr. Cyr for closing remarks.\n\nBill Cyr -- Chief Executive Officer\n\nGreat. Well, thank you very much for your interest and your attention. I'd like to close with a statement in honor of Olivia Newton John who passed away earlier today. She said, \"The only wait I left from my dogs to which I would add if she fed them Freshpet, they would be lean and the lift easier.\" Rest in peace.\n\nThank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Sonnek -- Investor Relations\n\nBill Cyr -- Chief Executive Officer\n\nHeather Pomerantz -- Chief Financial Officer\n\nSteph Wissink -- Jefferies -- Analyst\n\nPeter Benedict -- Robert W. Baird -- Analyst\n\nScott Morris -- Chief Operating Officer\n\nBill Chappell -- Truist Securities -- Analyst\n\nAnoori Naughton -- JPMorgan Chase and Company -- Analyst\n\nBrian Holland -- Cowen and Company -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nJon Andersen -- William Blair -- Analyst\n\nJim Salera -- Stephens Inc. -- Analyst\n\nMore FRPT analysis\n\nAll earnings call transcripts"
}