{
  "companyName": "American Software",
  "companyTicker": "AMSWA",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/american-software-amswa-q1-2023-earnings-call-tran/",
  "content": "American Software (AMSWA -0.41%)\nQ1 2023 Earnings Call\nAug 24, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to today's first quarter fiscal year '23 preliminary financial results. [Operator instructions] Please note, today's call may be recorded, and I will be standing by should you need any assistance. It is now my pleasure to turn the conference over to Vince Klinges, CFO of American Software.\n\nVince Klinges -- Chief Financial Officer\n\nThank you, Chloe, and good afternoon, everyone, and welcome to American Software's first quarter fiscal 2023 earnings conference call. On the call with me is Allan Dow, president and CEO of American Software. Allan will provide some opening remarks and then I'll review the numbers, but first our safe harbor statement. This conference call may contain forward-looking statements including statements regarding among other things, our business strategy and growth strategy.\n\nAny such forward-looking statements speak only as of this date. These forward-looking statements are based largely on our expectations and are subject to a number of risks and uncertainties, some of which cannot be predicted or quantified and are beyond our control. Future developments and actual results could differ materially from those set forth in contemplated by or underlying the forward-looking statements. There are a number of factors that could cause actual results to differ materially from those anticipated by statements made on this call.\n\nSuch factors include but are not limited to, changes and uncertainty in general economic conditions, the growth rate of the market for our products and services, the timely availability in the market acceptance of these products and services, the effect of competitive products and pricing and other competitive pressures and the irregular and unpredictable pattern of revenues. In light of these risks and uncertainties, there can be no assurance that the forward-looking information will prove to be accurate. At this time, I'd like to turn the call over to Allan for opening remarks.\n\nAllan Dow -- President and Chief Executive Officer\n\nThank you, Vince. I'm pleased to report that our first quarter results were in line with expectations. As such, we're on track to meet the guidance we provided on the last call. We achieved 8% year-over-year revenue growth in our Supply Chain Management segment during the quiet summer months where we traditionally see downward pressure on consulting services.\n\nOur subscription revenue growth remained solid at 23% and we are especially encouraged by the continued growth in our pipeline and the trust our clients place in us to help them stay on top of emerging technology trends. Our strong top line performance was accompanied with a significant expansion in our adjusted EBITDA margin, which increased to 14% from 13% in the prior year. We anticipate continued revenue growth in fiscal year '23 with the continued growth of the cloud business and a healthy backlog of project work. In spite of a very competitive labor market, especially in the supply chain and technical space, we're continuing to expand our team across all aspects of the business and are anticipating that we can stuff our expansion needs on a timely basis.\n\nAlthough the lingering impact of the pandemic, continuation of major world events, inflationary pressures and now the signs of recession continue to store some business uncertainty, we have not seen any slowdown in pipeline expansion. However, we're mindful of the potential for an extension and close rates. So we're working hard to keep projects on track and to get contract signed as soon as possible. Staffing shortages in the supply chain and IT organizations continue to be the primary impact on the timing of contract approvals as clients grapple with how to implement projects while struggling with day-to-day operations.\n\nHowever, we've not seen any material change in this impact relative to the last few quarters. Overall, our pipeline continues to increase driven by the needs for clients to holistically manage their supply chains in a sustainable and economically resilient way and the need for rapid and informed decision-making that has never been more in demand as our clients are facing another period of disruptions and uncertainty. We remain confident that between a larger opportunity set and improved execution, we're poised for a strong year ahead. Overall, we're pleased to see the continued growth in our recurring revenue stream of cloud services and maintenance, which represents approximately 67% of total revenues in fiscal Q1.\n\nWith the increase in new subscription contracts and the continued stability of our cloud and on-prem client community, we expect to see the recurring revenue as a percent of total revenue continue to rise over time. During the first quarter, we announced our most recent acquisition. So I want to offer a brief update on our progress there. The team that came over from Starboard has been fantastic to work with.\n\nThe client community has embraced our strategy and we did not miss a beat on the opportunities that were in the pipeline we inherited. I would say that we're ahead of plan in the integration work and are accelerating the pipeline for network design optimization opportunities faster than we had anticipated. We closed one stand opportunity in July with an e-commerce logistics and fulfillment company to help optimize their logistics operations. We also successfully attached the network design optimization solution to one of the Logility projects we closed prior to the end of the quarter.\n\nThis win was with a multi-billion dollar automotive services and parts company that is growing rapidly through acquisition. As soon as we presented our strategy for blending network design enables part of the planning suite, they were immediately on board. We will leverage the network design optimization solution to give them early insights on how best to integrate the acquired companies logistics operations, which in turn will provide insights on how to streamline the design of the planning solution. After go live, we'll have an integrated solution to manage an iterative design and planning process.\n\nWe're on track with building and executing on the pipeline for network design optimization and see this acquisition to be everything we expected, if not more in regards to a productive expansion of our footprint. The rapid success on this one clearly leaves us with the capacity to pursue other acquisitions with an objective to find at least one more with a strategic fit to our portfolio before the end of our fiscal year. As I mentioned in my opening comments, based on our Q1 results, we're confident in our performance will be in line with the guidance we provided back in June, which is for total revenues to be between $132.5 million and $135 million and adjusted EBITDA to come in between $16 million and $18 million. As the traditional, busy fall season comes into full effect and with our continued expansion of recurring revenue as we close in on the 70% milestone, we will be in a better position to provide any revisions to this guidance in our November report.\n\nIn summary, we're pleased with the first quarter results and expect to extend the performance improvements of our financial model during the remainder of this fiscal year. We remain intently focused on executing against our growing pipeline and look forward to reporting our progress next quarter. Our mission of making our clients more successful year after year is paying off in client retention and expansion, while we -- in parallel we introduce innovative capabilities for managing sustainable supply chains that attract new clients to our community of partners. At this time, I'll turn the call over to Vince, who will provide the details on our financial results.\n\nVince Klinges -- Chief Financial Officer\n\nThank you, Allan. For the first quarter of fiscal '23, the revenues were $31.3 million, which -- that was a 7% increase from $29.3 million in the same period last year, both drive of that was our subscription fees which increased 23% year over year to $12.1 million. Our software license fees were $0.3 million, compared to $0.5 million in the same period last year. Our professional services and other revenues increased 5% to $10 million from $9.5 million a year ago period.\n\nThe year-over-year increase reflects an 8% increase in our supply chain unit and a 1% increase in our IT staffing business, the proven method which was impacted by timing of project work. The maintenance revenues declined 6% year over year to $8.9 million, reflecting a normal fall-off rate. So the total recurring revenues comprised of subscription and maintenance fees represented 67% of total revenues for the first quarter and that compares to 66% in the same period last year. Looking at gross margin, it increased to 60% for the current period and that compares to 58% in the same period last year.\n\nOur subscription fee margin increased to 70% compared to 67% in the same period last year and that's primarily due to increase in subscription revenue and lower amortization of cap software expense excluding the non-cash amortization of cap software expense of $508,000 for the first quarter and our subscription gross margin would have been 74% versus 75% last year. And the amortization of cap software last year was 819,000 in the prior year period. So our license fee margin was also up to 72% compared to 68% in the same period last year and our services margin increased to 27% from 26% last year. And that's due to higher billing rates at our supply chain unit and it was partially offset by lower utilization of our IT staffing business.\n\nOur maintenance margin was 82% for the first quarter compared to 79% in the same period last year. Gross R&D expenses were 14% of total revenues for the current period and that's compared to 15% in the same period last year and our sales and marketing expenses were 19% of revenues for the current quarter compared to the 21% in the same period last year. Our G&A expenses were 18% of total revenues for the current quarter compared to 15% last year and this was higher due to variable and stock option and incentive compensation, insurance, computer software costs, recruiting and also legal fees related to our Starboard acquisition. So on a GAAP basis, our operating income increased 44%, $2.6 million for this quarter and that compares to $1.8 million same period last year.\n\nNet income decreased 28% to $2.1 million or earnings diluted share of $0.06, compared to net income of $3 million or $0.09 earnings per diluted share last year. On an adjusted basis, which excludes non-cash amortization of intangible expense related to acquisitions and stock-based compensation expense, our adjusted operating income increased 49% to $3.9 million, compared to $2.6 million last year. Adjusted EBITDA increased 26% to $4.6 million from $3.7 million last year. And our adjusted net income decreased 12% to $3.2 million on adjusted earnings per diluted share basis of $0.09 for the first quarter and that compares to adjusted net income of $3.6 million or adjusted earnings per diluted share of $0.11 in the same period last year.\n\nInternational revenues this quarter were slightly up to 18% of total revenues compared to 17% in the same period last year. Our remaining performance obligation this quarter or what we referred to as backlog, was $125 million. Looking at the balance sheet, our financial position remains strong with cash and investments at approximately $114.8 million at the end of the quarter. During the quarter, we purchased Starboard, a network design optimization company for $6.5 million and also we paid $3.7 million in dividends.\n\nOur days sales outstanding, as of the end of the quarter was 68 days and that compares to 78 days from the same period last year. This decrease was primarily due to timing of billings and improvement in collections when compared to last year. And as Allan mentioned, our guidance, we're reaffirming the fiscal '23 annual guidance that we provided at the beginning of the fiscal year. So we anticipate revenues in the range of $132.5 million to $135 million.\n\nThis includes recurring revenue of $86.5 million to $89 million range. And then on an adjusted EBITDA basis, we are guiding to $16 million to $18 million range and this reflects the planned headcount expansion across the company to support growth and also higher compensation to retain talent, as well as some other costs such as travel and marketing expenses. At this time, I'd like to turn the call over for any questions.\n\nOperator\n\n[Operator instructions] And we'll take our first question from Matt Pfau. Please go ahead.\n\nMatt Pfau -- William Blair and Company\n\nGreat. Thanks for taking my questions, guys. I wanted to ask, in terms of what you're seeing in the pipeline from a deal size perspective, is there any change there? And I guess what I'm wondering is, are some of the transformational deals getting perhaps broken into components given some of the macro concerns that are out there?\n\nAllan Dow -- President and Chief Executive Officer\n\nYeah, Matt, good question. We've seen basically the consistency with the last couple of quarters, but I think as we've -- it is smaller than we were three or four years ago, but that's consistent here, as we've exited the pandemic and moved into this new climate. So I'd say it's pretty consistent with the last couple of quarters. We do have large transactions in the pipeline that are the transformational type projects, but we are seeing a number of folks who just want to take it a bite-sized chunk of the time and have a long-term plan, but short term chance to really focus in on getting some results.\n\nMatt Pfau -- William Blair and Company\n\nGot it. And then the Starboard acquisition, which certainly seems interesting, what is the go-to-market plan on that one? You signed an independent deal and then you also signed one that was in conjunction with Logility. So maybe just help us understand how you're thinking about the go-to-market with that longer-term?\n\nAllan Dow -- President and Chief Executive Officer\n\nYeah. We certainly -- we'll continue to do stand-alone projects with clients much like we do with any of the other applications we have in the portfolio. There is nothing that really is -- has an inter-dependence that stops us from doing that anywhere in the suite. But as we see the real value is to add it to the planning suite and we're really crafting -- we're plowing new ground here with this strategy where we have a tightly coupled network design solution attached to a planning application and those two interoperate.\n\nSo the planning application is feeding the data necessary for network design on a real time basis back into the network design, so it's readily available for doing analysis if something comes up an opportunity or risk presents itself. And then likewise, you translate the other way, where once you make a decision in the design -- network design application to make a change to how the network is flowing how products are flowing through the network that will immediately provide the update into the planning application. So that's the automotive company I mentioned, completely saw that vision that we're excited about that opportunity as one of the things they struggled with for years and it's a very unique set of capabilities in the marketplace. Nobody else is doing that today.\n\nAnd we're on the forefront of that. So we think that's going to be the real driver behind -- and the accelerated growth model behind this acquisition. So we're very excited about that.\n\nMatt Pfau -- William Blair and Company\n\nGotcha. And then last one for me, just on the comment about wanting to find one more acquisition before the end of the year. So that would be, I mean it basically two within this fiscal year and it had been some time before you had -- since you had made your last one. So are you seeing just a change in terms of willingness to sell or quality of assets that are out there valuations, that's sort of driving you to become a bit more acquisitive when it's been on pause for a little while now?\n\nAllan Dow -- President and Chief Executive Officer\n\nYeah, I think there is a good friend tell me this everything comes in three. So I'm probably going to give you four answers. But it's yes, yes and yes. So yes, we see a willingness to engage in the dialogue and ultimately to consummate a transaction for an acquisition for us.\n\nWe've seen a tremendous realignment of the valuation, which we've seen across the board. You all have seen that as well. But we think the valuations are very positive for us for making an acquisition. We think that there are more opportunities out there in the marketplace as well.\n\nAnd then the fourth point is we're ready. We believe that there are some tuck-in acquisitions that extend our portfolio like the one we just talked about around Starboard that will make a strategic difference for us as we go forward. And with our capital position continuing to grow cash and no debt. And we think it is the right move to actually deploy that -- the capital resources against the future growth model.\n\nSo probably those four things coming together really are driving our moves right now and we wouldn't limit ourselves to one more actually. If we found two, we would act on both.\n\nMatt Pfau -- William Blair and Company\n\nGot it. Thanks a lot, guys. Appreciate taking my questions.\n\nAllan Dow -- President and Chief Executive Officer\n\nThank you, Matt. Thank you for joining us.\n\nOperator\n\nAnd we'll take our next question from Matthew Galinko. Please go ahead.\n\nMatthew Galinko -- Maxim Group -- Analyst\n\nHi. Thanks for taking my question, and congrats on getting the deal done. I'm curious how the cadence of hiring might look through the year. I know you provided some comments about your plans, but help us with the timing there and your confidence level on being able to hire against this labor market?\n\nAllan Dow -- President and Chief Executive Officer\n\nWe are very confident actually. Matthew, thank you for the question. What we're seeing right now is actually, it's easier to hire today than it was a few months ago. I think there is a couple of factors, people have come back from vacations, they've got that behind them and they're ready to make some decisions and move, where worse we've got a very good pool of candidates were interviewing we got more people joining us in the month of August that we had in July or June or May for that matter and we're coming in, we're closing in very quickly on getting the resource loading we need for to carry us out through the rest of this calendar year.\n\nSo that feels really good. I think the labor market is shifting, people are looking for good-quality companies to join. I put us in the category of good quality companies. We're in an exciting space, supply chain space, we're a stable organization.\n\nWe're doing some exciting things that they're learning about as they read and learn about us. So we're very attractive and we're quite successful. First of all, pulling a diverse community of resources for us to consider and then our ability to actually get them to come join us is -- we're highly successful on once we find the right ones.\n\nMatthew Galinko -- Maxim Group -- Analyst\n\nThanks. And then I guess, I didn't hear anything in the prepared remarks but can you maybe talk about the pipeline of maintenance conversions at this point? And any cloud conversions to cloud in your existing customer base. And given the -- some of the macro environment factors that you highlighted, does that change the mix of how you see the pipeline converted to revenue over the next few quarters?\n\nVince Klinges -- Chief Financial Officer\n\nYeah, as far as what we call lift and shift moving for the on-prem clients that are out there today moving over, we did five of those transactions in the first quarter where -- if you went back to last fiscal year, we will probably do in three. So that's almost 50% improvement. Those numbers are small. So I don't like to do that kind of math against that.\n\nBut yes, I believe that we will continue to see that trend, if anything, maybe accelerate more will move up to half a dozen seven, eight maybe a quarter or something like that. It's being driven by two things, one is our clients are under more pressure than I think we are relative to the ability to attract and retain folks. So their IT organization is under a lot of pressure and they are less inclined to continue to operate applications, very strategic applications like ours, on-premise. So that trend is continuing to accelerate.\n\nAnd as we add new capabilities, it is a perfect time to shift, they get a chance to upgrade to the latest release. We put new capabilities in play, add those at those components to the mix and they move to the cloud that way. So both of those drivers are pushing more and more clients to move over to cloud-based operations and putting the responsibility in our hands to deliver day to day. So I think the -- I think those two factors are going to continue to drive.\n\nI don't think the -- I don't think we're seeing anything materially from the anxiety around the economic turmoil really has changed in the profile much, those other factors.\n\nMatthew Galinko -- Maxim Group -- Analyst\n\nAll right. Thank you.\n\nAllan Dow -- President and Chief Executive Officer\n\nSure. Thank you, Matthew. Appreciate your questions and thank you for joining us.\n\nOperator\n\nAnd we'll move next to Zach Cummins. Please go ahead.\n\nZach Cummins -- B. Riley Financial -- Analyst\n\nYeah. Hi. Good afternoon, Vince and Allan. Congrats on the solid quarter and thanks for taking my questions.\n\nAllan, just building off of some of your commentary in the script around overall customer sentiment. I mean can you just dive a little bit deeper into maybe the pace of deal closures that you're seeing across the entire customer base? And I know there is a variety of macro headwinds, but just trying to get a general sense of how customers are thinking about their investments in supply chain?\n\nAllan Dow -- President and Chief Executive Officer\n\nYeah, I think the nice trend we have -- the retention that we've been working on for years now, and really high retention rates is really a positive for us. What that carries forward is one that recurring revenue sticks. But those clients are really expanding their footprint with us, they're adding new capabilities. We haven't gone back to the installed base yet with closing contracts for instance on the network design, we've gone to them with the presentation.\n\nWe've got a number of them that are now in the pipeline to add that as an extension to their footprint. So that's just one example of our ability to sell back into the installed base. We're still lot of pretty consistent run rate where a roughly 50% of our project business is coming from the installed base. So we've got a healthy balance, we're putting new logos into the mix, that represents about 50% of the new project work.\n\nAnd we've got the other 50% half of it's coming from the installed base. So we believe that's a healthy ratio. You know, I've been at this long enough and been around here for 20 years in the supply chain space. Here in past recessions, we've seen a trend toward the installed base, doing more and more of the work and less brand new projects from the ground up.\n\nThat is a, a bit of a normal trend in a down market or recessionary market that we've seen a couple of times in the past. We're not seeing that mix change yet, we still see new clients still investing and coming to us, adding to the pipeline and the close rate still look strong there. So we think at least this next quarter ahead of us, the one we're in the middle of now, that will retain that mix of the 50-50 as we go. So it's quite exciting.\n\nLike everyone we're anxious as you watch the news, it makes you pause for a moment, but then when I look at the pipeline and the activity and the close rate, we've got going on. I just don't see that impact in our activity right now. So we're excited to just keep it rolling.\n\nZach Cummins -- B. Riley Financial -- Analyst\n\nUnderstood. And just building off of some of the new customer commentary, have you seen any meaningful changes in the overall competitive landscape in the last couple of quarters, I know there has been some pretty notable transactions in the space with Blue Yonder being acquired. I'm just curious if the overall competitive set have seen much of a change.\n\nAllan Dow -- President and Chief Executive Officer\n\nNo, I think the most notable trend, the best of breed providers are still there, Blue Yonder, Kinaxis, o9 and others, so I think that those markets are pretty consistent, those are play in the marketplace. And we all have our unique value proposition that differentiates us out there. We continue to see the ERP providers being less and less entrenched so more opportunities that are popping up where they're either aren't getting considered or aren't winning and I believe that that is a clear recognition in the marketplace that they just don't have the depth of capability that's necessary to manage the complexity of today supply chains, the pace at which things change, the dynamics of it, just don't suit those capabilities very well and they are not keeping up with the best-of-breed providers. So that's probably the most dramatic thing.\n\nWe've seen that trend starting sometime back. We don't see it swinging back to the other way. So it looks like the trend is continuing.\n\nZach Cummins -- B. Riley Financial -- Analyst\n\nUnderstood. And final question for me, probably geared more toward Vince, but is there anything meaningful assume for Starboard and kind of the current guidance for the year on the revenue side?\n\nVince Klinges -- Chief Financial Officer\n\nZach, no, I think when we acquired Starboard, we really didn't acquire for its current customer base at the time because it was fairly small. So if we're not putting a lot of meaningful revenue of the current customer base that we acquired, but we do have some anticipation that going forward from post-acquisition, it will start building into the revenue guidance, more and more. So we'll be watching that for about mid-year to see how that effects the guidance for the year.\n\nZach Cummins -- B. Riley Financial -- Analyst\n\nUnderstood. That's helpful. Well, thanks again for taking my questions and best of luck with the rest of the quarter.\n\nAllan Dow -- President and Chief Executive Officer\n\nThank you, Zach. Thanks for joining and thanks for the questions.\n\nOperator\n\n[Operator instructions] We'll move next to Anja Soderstrom. Please go ahead.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nHi. Good afternoon and thank you for taking my questions and congratulations on a good performance. And so I'm just a little bit -- questions asked already. So I'm just to follow-up on the Starboard acquisition.\n\nHow did that come about and had you been looking at and adding that specific capability for a while or how are your thoughts around the acquisition?\n\nAllan Dow -- President and Chief Executive Officer\n\nAnja, it's a great question. It is one that we can clearly say that was good planning and good luck coming together. We had -- I think we were talking about this maybe three quarters ago or so where we thought that the market landscape was going to be right for us to get back in the acquisition mode. We have put together a team identified four strategic areas that we thought were the most important, one of those in the top of the list actually did rise to the top of the list was this idea of network design and how it would fit in.\n\nAbout that same time, we've got an outreach from one of the team members at Starboard whose since joined our team and in helping us move forward on our strategic moves there. So we kind of -- that's where a good luck and good planning come together, we were ready. We had already started to investigate the marketplace, we had identified them but they beat us to the punch and reached out to us, around a potential partnership and the partnership evolved into an acquisition. And you can have a tighter partnership than what we got right now, it's just a fantastic team moving in and really accelerating the market for us.\n\nSo good luck and good fortune and good planning all coming together.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. Sounds good. And congrats again on that. So do you anticipate to be able to excel this to all this time or what other times sort of alternative to this?\n\nAllan Dow -- President and Chief Executive Officer\n\nThere is no one in our installed base that is not a candidate for this, everybody is. So number one, we are actively going back and presenting this to all of our clients. If they've got a stable supply chain where they don't change much around the flow of products, maybe there is less appetite for it, but that's almost nobody these days. If you had a very stable or single line of supply chain, our product sets could only come from one place and had very unique manufacturing requirements or something like that and network design is probably less prominent in that space, but even part of this is about the raw materials coming into the supply chain, so everyone has dynamics around that.\n\nSo there is a -- there is an ability to use that. Probably the other gating factor is just their appetite to take on anything new right now that maybe the bigger challenge that we face. But will plant to seed today in hopes of getting their attention sometime soon in that -- in the portfolio. Also takes us -- when we go the other way, they didn't, the Starboard team didn't bring client base is big as ours over to the table.\n\nSo we didn't double, but there are a handful of clients over there that were already actively engaged on how to position the rest of our portfolio back into them and the other really exciting thing is they came with a partner network that is very active today and we've been able to shore up some of the partners, SI partners and add a meaningful new component, as well as we've picked up a couple of new folks that are really excited about leveraging the rest of the portfolio we have and taking it back to their client base. So there is three or four synergies in there that I just outlined that are really, really powerful.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. It sounds very exciting. Thank you. That was all for me.\n\nAllan Dow -- President and Chief Executive Officer\n\nThank you, Anja, and thank you for joining us.\n\nOperator\n\n[Operator instructions] And it does appear there are no further questions at this time.\n\nAllan Dow -- President and Chief Executive Officer\n\nOK. Chloe, thank you so much for helping us with the call today. Thank you for all the participants that joined us this afternoon. We appreciate your time and look forward to speaking with you again in the near future and the future updates on the remainder of our year.\n\nHave a good afternoon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nVince Klinges -- Chief Financial Officer\n\nAllan Dow -- President and Chief Executive Officer\n\nMatt Pfau -- William Blair and Company\n\nMatthew Galinko -- Maxim Group -- Analyst\n\nZach Cummins -- B. Riley Financial -- Analyst\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nMore AMSWA analysis\n\nAll earnings call transcripts"
}