{
  "companyName": "Yatsen Holding Limited",
  "companyTicker": "YSG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/22/yatsen-holding-limited-ysg-q3-2022-earnings-call-t/",
  "content": "Yatsen Holding Limited (YSG 6.57%)\nQ3 2022 Earnings Call\nNov 22, 2022, 7:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, good day, and welcome to the Yatsen third-quarter 2022 earnings conference call. Today's conference is being recorded. At this time, I would like to turn the conference over to Irene Lyu, head of strategic investment and capital markets. Please go ahead.\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nThank you, operator. Please note the discussion today will contain forward-looking statements relating to the company's future performance and are intended to qualify for the safe harbor from liability as established by the U.S. Private Securities Litigation Reform Act. Such statements are not guarantees of future performance and are subject to certain risks and uncertainties, assumptions, and other factors.\n\nSome of these risks are beyond the company's control and could cause actual results to differ materially from those mentioned in today's press release and this discussion. A general discussion of the risk factors that could affect Yatsen's business and financial results is included in certain filings of the company with the Securities and Exchange Commission. The company does not undertake any obligation to update this forward-looking information, except as required by law. During today's call, management will also discuss certain non-GAAP financial measures for comparison purpose only.\n\nPlease see the earnings release issued earlier today for a definition of non-GAAP financial measures and a reconciliation of GAAP to non-GAAP financial results. Joining us today on the call from Yatsen's senior management are Mr. Jinfeng Huang, our founder, chairman, and CEO; and Mr. Donghao Yang, our CFO and director.\n\nManagement will begin with prepared remarks, and the call will conclude with a Q&A session. As a reminder, this conference is being recorded. In addition, a webcast replay of this conference call will be available on Yatsen's Investor Relations website at ir.yatsenglobal.com. I will now turn the call over to Mr.\n\nJinfeng Huang. Please go ahead, sir.\n\nJinfeng Huang -- Founder, Chairman, and Chief Executive Officer\n\nThank you, Irene, and thank you, everyone, for participating in Yatsen's third-quarter 2022 earnings conference call today. We started the year by launching a five-year strategy, outlining our plans to evolve our business and drive the long-term and sustainable growth. With this strategy targets as our road map, the management team continued to fine-tune our business model. Although negatively impacted by the softened beauty market and resurgence of COVID-19, our skin care brands recorded solid growth in the third quarter of 2022.\n\nWe have also seen improvements in gross margin, net loss, and non-GAAP net loss on account of our cost optimization plan. Overall, our sales in the third quarter of 2022 continued to experience slowdowns as a result of challenging macro headwinds and the lower levels of consumer spending, which have been exacerbated by resurgence of COVID-19. Beauty retail sales in the third quarter of 2022 went down by 3.2% year over year according to the adjusted data published by China National Bureau of Statistics. Sales of both color cosmetics and skin care products on Tmall fell by double digits year over year in the third quarter of 2022, extending the downward trend in the second quarter of 2022.\n\nOur total net revenues for the third quarter of 2022 declined by 36.1% year over year to RMB 857.9 million, meeting the high end of our revenue guidance. Let's look at our revenue mix in detail. Net revenues of skincare brands increased by 33% year over year to RMB 269.4 million. As a highlight, total net revenues of our fast-growing clinic and premium brands, DR.\n\nWU, Eve Lom, and Galenic delivered solid growth of 69% year over year this quarter. In terms of revenue contribution, our skincare brands contributed 31.4% of total net revenues for the third quarter of 2022, which has exceeded 30% of total net revenues for two consecutive quarters, compared with 51% of total net revenues for the third quarter of 2021. Our color cosmetic brands, on the other hand, saw a 48.8% decline year over year in total net revenues to RMB 559.3 million, reflecting the continued softness in market demand for our color cosmetics, as well as intensified industry addition from both domestic and international brands. Gross margin for the third quarter of 2022 increased by 1 percentage point to 58.9% from 57.9% for the third quarter of 2021 due to increased sales of higher gross-margin products from our skincare brands, cost optimization, and stricter pricing and discount policies across all our brand portfolios.\n\nOur net loss margin was 24.6% in the third quarter of 2022, representing an improvement of 3.2 percentage points from the second quarter of 2022 or 2.4 percentage points from the previous-year period. Our non-GAAP net loss margin was 14.7% in the third quarter of 2022, representing an improvement of 7.1 percentage points from the second quarter of 2022 or 1.4 percentage points from the prior-year period. The improvement is attributable to our continued cost optimization. Now, I will share some of the quarter's major initiatives and developments.\n\nIn the third quarter of 2022, our business teams were active in developing and strengthening our portfolio of high-performing brands tailored to Chinese consumers' evolving needs and space. And DR. WU recently launched new products infused with Triple Action Repair technology, which was proven efficacious on the iconic repair serum. We celebrated the brand's 19th anniversary with its loyal customers across China, especially those with sensitive or exposed skin who seek efficient products designed for their skin types.\n\nEve Lom achieved a robust growth despite the challenging industry environments. While the brand remained strong in premium cleanser category, we expanded to serum category by launching radiance repair retinol serum. In September, Eve Lom partnered with exquisite Harrods Tea Rooms in Shanghai to cultivate a worldly and luxurious experience for the celebrated brand. Galenic also recorded very strong online growth in the third quarter of 2022.\n\nWe have gained more market share and stayed No. 1 for two consecutive quarters in the premium serum category on Douyin. While our hero VC serum maintained its leading position, the Secret D'Excellence active serum also experienced steady growth in the third quarter of 2022. The launch of the Secret D'Excellence active serum in the third quarter of 2022 was attended by industry experts and thought leaders and raised awareness of the brand, amplifying its leadership in the premium dermatological skin care sphere.\n\nWhile our color cosmetics business experienced a year-over-year decline of 48.8%, we saw improved gross margin in aggregate. Our color brands went through channel optimization and promotion control to develop sustainable business model. Perfect Diary sales on Douyin achieved strong year-over-year growth of 97% and ranked No. 2 among all cosmetics brands, another improvement from No.\n\n3 ranking it achieved last year. We have also closed underperforming offline stores throughout 2022. As a result, as of September 30, 2022, we operated a total of 198 experience stores of the Perfect Diary brand, representing a net reduction of 88 stores since the beginning of the year. In the fourth quarter, this offline store optimization program will continue, and we are constantly monitoring the market situation of the offline retail space to best support our brand strategies moving forward.\n\nIn addition to channel optimization, we are also adjusting the category mix to increase our market share in facial makeup and complexion products. Perfect Diary's translucent blurring loose powder, an upgrade that adds anti dullness efficacy in addition to the original SmartLock technology gained more market share in the loose powder category on Tmall compared to last quarter. We also applied this patent technology to the newly launched clear cover 3-color concealer palette as an attempt to expand it to other facial categories. Our robust new product launch and a healthy pipeline are backed by continuous investments in R&D.\n\nR&D expenses increased to 3.9% from 2.7% of net revenues in the prior-year period. We debuted at the International Federation of Societies of Cosmetic Chemistry Congress, with two cutting-edge technologies in September. We will continue our efforts to build a strong R&D capability as our core strategy for future grows. We are also constantly reminded of the importance of our commitment to our environmental, social, and governance program.\n\nIn the third quarter of 2022, Yatsen donated computers and projection equipment to the government of Zhongshan town located in Guangdong province to help improve the townships information technology infrastructure. We are actively involved in elevating the quality of life of those in more challenging circumstances, and we'll continue to take the initiative to assume corporate social responsibility and to contribute our support in the future. While we expect the retail environment to remain challenging for the rest of 2022 and for the first half of 2023, we have sufficient resources to meet our strategy objectives. During the Double 11 shopping festival this year, we saw outstanding performance in our skincare brands.\n\nGalenic achieved high triple digits year-over-year sales growth. Eve Lom and DR. WU got the first place in premium cleanser category and acne-control category with their hero product cleanser and mandelic gentle renewal serum, respectively, on Tmall. In summary, we have already made significant progress in our strategy evolutionary journey with higher contribution from our skin care brands, improved gross margin, and significantly narrowed net loss in the third quarter of 2022.\n\nWith the cash, restricted cash, and short-term investment balance of RMB 2.6 billion at the end of this quarter, we have sufficient resources and flexibility in pursuit of our long-term strategic goals. With that, I will now turn the call over to our CFO, Donghao Yang, to discuss our financial performance. Thank you, everyone.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nThank you, David, and hello, everyone. Before I get started, I would like to clarify that all financial numbers presented today are in renminbi amount, and all percentage changes refer to year-over-year changes unless otherwise noted. Total net revenues for the third quarter of 2022 decreased by 36.1% to 857.9 million RMB from 1.34 billion RMB in the prior-year period. The decrease was primarily attributable to a 48.8% decrease in net revenues from our color cosmetics brands, partially offset by a 33% increase in net revenues from our skincare brands.\n\nGross profit for the third quarter of 2022 decreased by 35.2% to 591.3 million RMB from 911.8 million RMB in the prior-year period. Gross margin for the third quarter of 2022 increased to 68.9% from 67.9% in the prior-year period. The increase was primarily driven by increased sales of higher gross-margin products from our skin care brands, cost optimization, and stricter pricing and discount policies across all of our brand portfolio. Total operating expenses for the third quarter of 2022 decreased by 33.1% to 857 million RMB from 1.28 billion RMB in the prior-year period.\n\nAs a percentage of total net revenue, total operating expenses for the third quarter of 2022 were 99.9% as compared with 95.4% in the prior-year period. Fulfillment expenses for the third quarter of 2022 were 63.8 million RMB as compared with 102 million RMB in the prior-year period. As a percentage of total net revenues, fulfillment expenses for the third quarter of 2022 decreased to 7.4% from 7.5% in the prior-year period. The decrease was primarily attributable to a decrease in warehouse and logistics costs due to optimization of our fulfillment capacity.\n\nSelling and marketing expenses for the third quarter of 2022 were 564.8 million RMB as compared with 911.3 million RMB in the prior-year period. As a percentage of total net revenues, selling and marketing expenses for the third quarter of 2022 decreased to 65.8% from 67.9% in the prior-year period. The decrease was primarily attributable to the higher efficiency of online marketing activities, partially offset by store closure-related expenses and provisions. General and administrative expenses for the third quarter of 2022 were 194.5 million RMB as compared with 233.9 million RMB in the prior-year period.\n\nAs a percentage of total net revenues, general and administrative expenses for the third quarter of 2022 increased to 22.7% from 17.4% in the prior-year period. The increase was primarily attributable to the lower total net revenues in the third quarter of 2022, creating a low base effect. Research and development expenses for the third quarter of 2022 were 33.9 million as compared with 35.8 million in the prior-year period. As a percentage of total net revenues, research and development expenses for the third quarter of 2022 increased to 3.9% from 2.7% in the prior-year period.\n\nThe increase was primarily attributable to the lower total net revenues in the third quarter of 2022, creating a low base effect. Loss from operations for the third quarter of 2022 decreased by 28.1% to 265.7 million RMB from 369.3 million RMB in the prior-year period. Operating loss margin was 31% as compared with 27.5% in the prior-year period. Non-GAAP loss from operations for the third quarter of 2022 decreased by 26.6% to 162.6 million from 221.7 million in the prior-year period.\n\nNon-GAAP operating loss margin was 19% as compared with 16.5% in the prior-year period. Net loss for the third quarter of 2022 decreased by 41.7% to 210.7 million from 361.8 million in the prior-year period. Net loss margin was 24.6% as compared with 26.9% in the prior-year period. Net loss attributable to Yatsen's ordinary shareholders per diluted ADS for the third quarter of 2022 was 0.37 RMB as compared with 0.57 RMB in the prior-year period.\n\nNon-GAAP net loss for the third quarter of 2022 decreased by 41.5% to 126.5 million RMB from 216.3 million RMB in the prior-year period. Non-GAAP net loss margin was 14.7% as compared with 16.1% in the prior-year period. Non-GAAP net loss attributable to Yatsen's ordinary shareholders per diluted ADS for the third quarter of 2022 was 0.22 RMB as compared with 0.34 RMB in the prior-year period. As of September 30, 2022, the company had cash, restricted cash, and short-term investments of 2.6 billion RMB as compared with 3.14 billion RMB as of December 31st, 2021.\n\nNet cash generated from operating activities for the third quarter of 2022 was 21.8 million RMB, compared with net cash used in operating activities of RMB 225.3 million RMB in the prior-year period. Looking at our business outlook for the fourth quarter of 2022, we expect our total net revenues to be between 916.7 million RMB and 1.07 billion RMB, representing a year-over-year decline of approximately 30% to 40%. This forecast reflects our current and the preliminary views of the market and operational conditions, which are subject to change. With that, I would now like to open the call to Q&A.\n\nOperator\n\nYes, thank you. At this time, we will begin the question-and-answer session. [Operator instructions] So, with these instructions in mind, we'll pause momentarily to assemble the roster. And today's first question comes from Dustin Wei with Morgan Stanley.\n\nDustin Wei -- Morgan Stanley -- Analyst\n\nThanks for taking my question. First question is related to the Double 11 performance. I'm wondering if management can comment in terms of the performance by brand or by skin care brands and the color brand? And do we expect that the GP margin in the fourth quarter could be sequentially lower versus third quarter because of the promotion for Double 11? And the second question related to the performance for the skin care brands in third quarter. It sounds like excluding Abby's Choice, the other three major skin care brands performed pretty strongly.\n\nBut could you sort of elaborate a little more in terms of -- maybe provide a range of the performance or some of the different strategy and their progress? And just, you know, from a management's perspective, the key skin care brands performance is kind of a little ahead of the expectation or there's something more to do?\n\nJinfeng Huang -- Founder, Chairman, and Chief Executive Officer\n\nThank you. First question for the Double 11 results. For skin care brands, right now, our Galenic, Eve Lom, and DR. WU achieved robust sales growth in Double 11 with GMV higher than 100 million RMB for each of the brands.\n\nSo, some of the hero products of each brands are performing quite well. I think Galenic has high triple-digit year-on-year sales growth and also achieved as the top of the new brands for Tmall Double 11. And so, for the VC serum, it's also a high triple-digit year-on-year sales growth. And we also launched a new product, the Secret D'Excellence serum.\n\nAnd that becomes the important essence top-sales in the -- for the [Inaudible] Eve Lom still continue to taking the No. 1 premium cleanser category. And also for DR. WU, right now, the Renewal Serum is already pretty strong in the acne control category.\n\nAnd some of the new products at DR. WU are performing really well, especially the triple action repair serum is ranking as the top 4 repair serum on Tmall. So, looking forward, I think the -- some of the hero products of the skin care brands will help to contribute the growth of the brands and, in aggregate, improving the percentage of the revenue of our total revenue in the future.For color cosmetics, well, I think right now, our color brands are still facing a pretty big challenge. And also Perfect Diary has been undergoing a turnaround.\n\nSo, we prioritize profitability, and we applied a very strict pricing and discount policies across all those color brands in order to improve the gross margin and also to improve the profitability, as well as protecting the brand image. So, looking forward, for Q4, I think we, on the right chance, to continue optimizing the gross margin and also the bottom line.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nWell, on your second question, gross margin, well, gross margin has a lot to do with the category mix and inventory provision, a lot of things. And we're not in a position to make comment on the gross margin in Q4. But what I can tell you is, over the long term, as the skin care business grows stronger and take a higher percentage in the total product mix, and we believe in the long term, our gross margin will see an upward trend.\n\nDustin Wei -- Morgan Stanley -- Analyst\n\nGot it. Thank you. Can I ask one more question related to sort of the expenses and the restructuring? So, understanding that company has been focused on like store closure, organization, optimization, etc., so can we have an update on the status now? Like, do we expect that those exercise will be pretty much done in the fourth quarter this year, or some of those will continue into the 2023 depending on the macro environment? And is there some number that you can share in terms of the sort of one-off costs like for the full year this year, year to date, including the human resource like severance costs or one-off store closure costs, kind of one-off expenses that we likely won't see in 2023?\n\nDonghao Yang -- Chief Financial Officer and Director\n\nAll right. So, we have been pretty aggressive in closing the nonperforming stores due to mostly the challenges in our economic situation, especially caused by COVID-19. So, at the beginning of this year, we have more than -- close to 300 stores. But according to our current plan, by the end of this year, you know, we're going to have a little over 100 -- about 100 stores, including self-operated stores and franchise stores.\n\nWell, in terms of the expenses that we've incurred in the -- during the process, well, it has been quite substantial. We can provide you with a breakdown, if you want, after this call. But going into next year, I don't think we're going to incur, you know, substantial loss or substantial expenses due to store closure related provision expenses. Because now, I think we have reduced the total number of stores to a very manageable level.\n\nDustin Wei -- Morgan Stanley -- Analyst\n\nGot it. Thanks a lot for answering my questions.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nSure. Thank you.\n\nOperator\n\nThank you. And the next question comes from [Inaudible] with CICC.\n\nUnknown speaker\n\nHi. Thanks for taking my questions. I've got two questions. The first one regarding color cosmetics.\n\nIt seems that sales of color cosmetics keep decreasing each quarter. However, we still believe in the company's competitive edge in color cosmetics, as well as the brand asset of PD. So, at what time or what sales size do management expect the color cosmetics will return to growth? So, this is the first question. And my second question is related to guidance for the fourth quarter.\n\nSo, the total net revenue is expected to decrease by 30% to 40% in the fourth quarter. Could you elaborate more about the trend of color cosmetics and skin care, like just break down by category? Thanks.\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nYes, sure. So, for Perfect Diary, actually, you can see for the past three quarters, where the color cosmetics in total, the year-over-year decline is in a similar scale. So, we're not actually changing. It's more a stable trend right now.\n\nAnd then in terms of what we're doing for Perfect Diary right now, the key goal is to achieve profitability. So, how we're going to do that? We think there are two major plans that we're undergoing right now. One is in terms of channel optimization, and the second one is on the product category optimization. And on the channel one, we have alluded earlier is that offline right now because of the challenging macro environment.\n\nSo, we're closing down the number of stores that will contribute to the sales decline. But we think that will likely to stabilize by the end of this year. And then secondly, in terms of channel mix, you can see all the online channels, color cosmetics are also dropping, except for Douyin. So, we're also doing heavily -- investing heavily on Douyin to promote the growth and attracting customers.\n\nSo, for this quarter, our Douyin has experienced a year-over-year increase of 97%. So, that part, we're pretty comfortable and continue to hope to do well on the Douyin part. So, that's about the channel optimization. And on the product category optimization, Perfect Diary used to be very -- have very high market share on the lip and also eye category.\n\nBut in terms of complexion and facial makeup, that's actually a larger market that we think we need to tap in and also increase our market share. So, as mentioned in our conference call, we are introducing a number of complexion products which are endorsed by our SmartLock technology. And we're seeing quarter-over-quarter increase of market share in the facial makeup. So, that's another driver that will help Perfect Diary brand's turnaround and likely turn into a more healthy trend next year.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nYeah. Well, regarding your second question about our guidance for Q4, you know, we're guiding the market that our total revenue is going to decline by 30% to 40%. And the decline will come primarily from our color cosmetics business, offset by our fast growth of skin care business. So, the general trend of our business and especially our category mix in the future will be very fast and healthy growth in our skin care business.\n\nAnd in the meantime, we're working very hard to try to turn around our color cosmetics business.\n\nUnknown speaker\n\nGot it. Thanks a lot. I have no other questions.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] And our next question comes from Olivia Tong with Raymond James.\n\nOlivia Tong -- Raymond James -- Analyst\n\nThanks. Good morning. I wanted to ask you about your view on the competitive environment, local brands versus international brands, how they stack up, particularly with 11/11. And then also your thoughts as you go into next year.\n\nAnd then specifically for you about fiscal '23, the Q4 guide would suggest that on a two-year stack basis on revenue that the sales deceleration starts to -- it's a greater deceleration in sales. So, as you think about the go forward over the next 12 months, is your view that that's sort of the steady-state pace now, or is there something that changes materially as you go into fiscal '23? Thank you.\n\nJinfeng Huang -- Founder, Chairman, and Chief Executive Officer\n\nWell, I think as the market -- the growth for the total beauty market right now, it's already almost 0 or sometimes declining. So, basically, the competition will be intense. But that's -- I think it's normal in this market. So, if we're looking at the international sales, they are fewer investment loss and also continue to discount basically for the whole year since Double 11 last year.\n\nSo, for domestic brands, I think the new brands emerging as capital challenges challenged the beauty industry in the past two or three years, especially on the fast-growing Douyin platform. So, for us, I think we will be more focused on our strategy and try to focus on the external competition. Right now, we have a very clear strategy to grow our skin care brands in the portfolio and also to turnaround our color business. So, profitability will be the priority, and also skin care brands will be the priority.\n\nSo, as we look forward, I think we are executing the strategy consistently and also we will continue to move forward with that very clear strategy in the future as well.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nYeah. And your second question about our next year's outlook. Well, first of all, we do not provide guidance for our -- for any time horizon beyond the next quarter. But anyway -- well, for 2023, I think the decline in our growth rate, I don't think it will be, you know, as deep as this year for a number of reasons.\n\nOne, we've been working very hard to turn around our color cosmetics business, and we've seen some very good positive signs in our efforts. And secondly, we've got a very strong growth in our skin care business, which we believe will continue into next -- well into next year. So, if you consider these two trends together, I think, overall, our -- next year, I think our growth rate of our business will start to stabilize, if not, turn positive from a year-over-year standpoint.\n\nOlivia Tong -- Raymond James -- Analyst\n\nThank you so much.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nThank you.\n\nOperator\n\nThank you. And that concludes the question-and-answer session. I would like to turn the conference back over to management for any closing comments.\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nThanks for joining us today. If you have any further questions, please feel free to contact us at Yatsen directly or through TPG Investors. Our company information for IR in both China and the U.S. can be found in today's press release.\n\nHave a good day. Thank you.\n\nOperator\n\nThank you. [Operator signoff]\n\nDuration: 0 minutes\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nJinfeng Huang -- Founder, Chairman, and Chief Executive Officer\n\nDonghao Yang -- Chief Financial Officer and Director\n\nDustin Wei -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nOlivia Tong -- Raymond James -- Analyst\n\nMore YSG analysis\n\nAll earnings call transcripts"
}