{
  "companyName": "Zumiez",
  "companyTicker": "ZUMZ",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/zumiez-zumz-q2-2022-earnings-call-transcript/",
  "content": "Zumiez (ZUMZ -0.46%)\nQ2 2022 Earnings Call\nSep 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the Zumiez Inc. second quarter fiscal 2022 earnings conference call. At this time, all participants are in a listen-only mode. We will conduct a question-and-answer session toward the end of this conference.\n\nBefore we begin, I'd like to remind everyone of the company's safe harbor language. Today's conference call includes comments concerning Zumiez Inc.'s business outlook and contains forward-looking statements. These forward-looking statements and all other statements that may be made on this call are not based on historical facts and are subject to risks and uncertainties. Actual results may differ materially.\n\nAdditional information concerning a number of factors that could cause actual results to differ materially from the information that will be discussed is available in Zumiez filings with the SEC. At this time, I would like to turn the call over to Rick Brooks, chief executive officer. Mr. Brooks, the conference is yours.\n\nRick Brooks -- Chief Executive Officer\n\nHello, and thank you, everyone, for joining us on the call. With me today is Chris Work, our chief financial officer. I'll begin today's call with a few remarks about the second quarter and back-to-school before handing the call over to Chris, who will take you through our financial results and outlook in more detail. After that, we'll open the call to your questions.\n\nReflecting back on this time last year, the U.S. portion of our business was benefiting from several very strong tailwinds. The U.S. consumer is primed to spend with a wallet fortified by another round of government stimulus and further enabled by local economies more broadly reopening after many months of closure.\n\nZumiez, fresh off a record first quarter in 2021, posted the best second quarter in the company's history as we captured our fair share of that outsized demand. Over the past 12 months, those tailwinds have dissipated. Headwinds have materialized and then intensified, particularly in our U.S. business.\n\nOn top of the difficult sales comparison a year ago, the operating environment has become increasingly more challenging due to lingering supply chain disruptions, higher logistics costs, a tight labor market, negative foreign currency exchange impacts, and most acutely, high level of inflation, leading to intense competition for declining discretionary dollars. While each of these factors was incorporated into our outlook for this quarter and thoughts on the year, inflationary pressure on the consumer intensified as the quarter unfolded. Beyond the macroeconomic factors, we have also continued to feel the pressure of skate hardgoods declines on the business as well, a push to more value-added offerings away from our higher price point branded product. The combination of these factors led to our sales coming in $12 million beneath the bottom of our expected range.\n\nThis sales shortfall, coupled with inflationary cost pressures, only partially offset by other savings during the quarter and resulted in earnings well below our stated range. We're disappointed that our recent performance fell short of expectations. As we mentioned last quarter, we intend to remain flexible and agile in adjusting inventory, expense, and capital allocation plans based on any changes in the macroeconomic environment. We are actively adjusting our merchandise assortments and managing expenses in order to better position ourselves for the current operating environment.\n\nWhile comparisons do begin to moderate in the back half of the year based on recent trends, we believe it is prudent to adopt a more cautious view on the remainder of 2022 that account for the increased pressure we've seen on the consumer. Despite the challenges with our business, there were bright spots in the quarter, including Fast Times in Australia performing exceptionally well to our plan. Product margins remaining strong. While they were down slightly from the prior year, we have not given back the vast majority of gains we've made over the past few years, and that our teams are able to mitigate the challenging operating environment, as well as a negative country and product mix impacts.\n\nInventory was managed very well with an overall foreign exchange adjusted increase of only 4.4%. And substantial work was completed in our long-term initiatives, including the opening of 34 new stores across our business since the same time last year. While the current environment has caused a near-term pause on our quarterly sales growth, our focus remains on creating long-term shareholder value. Zumiez's four-decade history of adept management through multiple business and fashion cycles, coupled with our strong balance sheet, gives me confidence that this slowdown is temporary.\n\nWe've been through recessionary cycles before, and our experience has been that we lead into them given the discretionary nature of our business and the impact of tough economic times on our customer base. 2008-2009, we saw annual comparable sales down 6.5% and 10%, respectively, only to be followed by comparable sales increases of 11.9%, 8.7%, and 5% over 2010, 2011, and 2012, respectively. Our customer-centric strategy and strong brand and culture are our driving force toward sustainable growth over time. Our brand partnerships that enable unique self-expression for our customers, our enviable footprint that informs us of global trends, our channels organization that allows us to create synergies across sales channels, and our business model that gives our customers full control of their shopping experience, we'll continue to differentiate Zumiez in this challenging environment.\n\nThat differentiation will allow us to capture new opportunities and emerge as an even stronger competitor when these market forces subside. With that, I'll turn the call to Chris to discuss the financials.\n\nChris Work -- Chief Financial Officer\n\nThanks, Rick, and good afternoon, everyone. I'm going to start with a review of our second-quarter results. I'll then provide an update on our third quarter-to-date sales trends before providing some perspective on how we're thinking about the full year. Second-quarter net sales were $220 million, down 18.1% from $268.7 million in the second quarter of 2021 and down 3.7% from $228.4 million in the second quarter of 2019.\n\nExcluding the impact of foreign currency translation, net sales were down 16.4% compared with the prior year and down 3% compared to 2019. The year-over-year decrease in sales was primarily driven by the benefits from domestic stimulus in the prior year, as well as increased macroeconomic headwinds as inflation weighed on consumer discretionary spending during the current-year quarter. From a regional perspective, North America net sales were $189.9 million, a decrease of 20.1% from 2021 and down 8.2% compared with the same period of 2019. Other international net sales, which consist of Europe and Australia, were $30.1 million, down 3.4% from last year and up 40.2% from pre-pandemic levels in 2019.\n\nExcluding the impact of foreign currency translation, North America net sales decreased 19.8%, and other international net sales increased 10% compared to 2021. From a category perspective, all categories were down in total sales from the prior year during the quarter, with men's being our most negative, followed by hardgoods, accessories, women's, and footwear. Second-quarter gross profit was $75.1 million, compared to $105 million in the second quarter of last year and $77.2 million in the second quarter of 2019. Gross margin as a percentage of sales was 34.1% for the quarter, compared to 39.1% in the second quarter of 2021 and 33.8% in the second quarter of 2019.\n\nWhile product margins were strong in most geographies on full-price selling this quarter, the sales mix shift away from our higher-margin U.S. business overshadowed this impact at the company level, resulting in a mix-driven decrease of 17 basis points. The 500-basis-point decrease in gross margin was primarily driven by lower sales in the quarter, driving deleverage in our fixed costs, as well as rate increases in several areas. Store occupancy costs deleveraged by 220 basis points on lower sales volumes.\n\nShrink increased by 120 basis points as we saw a return to more normalized pre-pandemic levels. Web shipping costs increased by 80 basis points, and distribution center costs deleveraged by 70 basis points. SG&A expense was $70.1 million or 31.8% of net sales in the second quarter, compared to $73 million or 27.2% of net sales a year ago and $65.5 million or 28.7% of net sales in 2019. Compared to 2021, the 460-basis-point increase in SG&A expense as a percent of sales resulted from the following: 290 basis points in our store wages tied to both deleverage on lower sales, as well as wage rate increases; 90 basis points related to other store operating costs, primarily impacted by lower sales levels; 90 basis points in corporate costs; and 90 basis points in nonstore wages.\n\nThese increases were partially offset by a 110-basis-point decrease in legal costs due to a settlement recorded in the second quarter of 2021. Operating income in the second quarter of 2022 was $5 million or 2.3% of net sales, compared to $32 million or 11.9% of net sales last year. In the second quarter of 2019, we had an operating profit of $11.7 million, or 5.1% of net sales. Net income for the second quarter was $3.1 million or $0.16 per diluted share.\n\nThis compares to net income of $24 million or $0.94 per diluted share for the second quarter of 2021 and net income of $9 million or $0.36 per diluted share for the second quarter of 2019. Our effective tax rate for the second quarter of 2022 was 44.7% compared with 26.8% in the year-ago period and 30.7% in 2019. The tax rate in the quarter is inflated due primarily to the allocation of income across entities and the exclusion of net losses in certain jurisdictions. We expect our annual tax rate for the year to be approximately 31%.\n\nTurning to the balance sheet. The business ended the quarter in a strong financial position. We had cash and current marketable securities of $166.2 million as of July 30, 2022, compared to $412 million as of July 31, 2021. The $245.8 million decrease in cash and current marketable securities over the trailing 12 months was driven primarily by share repurchases of $271.2 million, resulting in a reduction in shares outstanding over the last year of 23.6%.\n\nWe also had capital expenditures of $20.6 million, partially offset by cash generated through operations of $58.7 million. As of July 30, 2022, we had no debt on the balance sheet and continue to maintain our full unused credit lines. We ended the quarter with $151.1 million inventory, up 1.1% compared with $149.4 million last year. On a constant-currency basis, our inventory levels were up 4% from last year.\n\nSecond quarter 2022 inventory was flat to our second quarter 2019 inventory. Overall, the inventory on hand is healthy and selling at a favorable margin. Now to our third quarter-to-date results. Net sales for the 37-day period ended September 5, 2022, decreased 18.1% compared to the same 37-day period in the prior year ended September 6, 2021.\n\nCompared to the 37-day period ended September 9, 2019, net sales decreased 12.6%. Comparable sales for the 37-day period ended September 5, 2022, were down 19.7% for the comparable period in the prior year and decreased 15.3% from the comparable period in 2019. From a regional perspective, net sales for our North America business for the 37-day period ended September 5, 2022, decreased 19.5% over the comparable period last year and were down 15.4% compared to the 37-day period ended September 9, 2019. Meanwhile, our other international business decreased 2.7% versus last year and increased 25% -- 25.1% compared with the same period of 2019.\n\nExcluding the impact of foreign currency translation, North America net sales decreased 19.4%, and other international net sales increased 11.9% compared with 2021. From a category perspective, all categories were down for the third quarter to date. Men's with our largest negative category, followed by hardgoods, women's, accessories, and footwear. With respect to our outlook, I want to remind everyone that formulating our guidance involves some inherent uncertainty and complexity in estimating sales, product margin, and earnings growth given the variety of internal and external factors that impact our performance.\n\nWith that in mind, we are currently expecting that total sales for the third quarter of fiscal '22 will be between $220 million and $228 million. Consolidated operating profit as a percent of sales for the third quarter is expected to be between 0.5% and 2.5%, and we anticipate diluted earnings per share will be roughly $0.03 to $0.18. Now, I want to give you a few updated thoughts on how we're looking at fiscal 2022. With the first half of 2022 behind us, we are more cautious in how we're looking at the full year and the potential impacts of the current operating environment, including inflationary pressures on the consumer discretionary spending.\n\nWhile comparisons do begin to moderate in the back half of the year, based on recent trends, we believe it's prudent to adopt a more cautious view on the remainder of 2022 that balances the headwinds we are facing. We now anticipate total sales will be down in the 18% to 19% range in 2022 as compared to 2021. This is inclusive of our third quarter guidance and anticipates further pressure in the fourth quarter given the outsized inflation concerns in the current market and current trend lines. In fiscal 2021, we achieved peak product margins once again, representing our sixth year in a row of product margin expansion.\n\nAs we have moved through the first half of the year, we have closely managed inventory and seen only a slight decline in product margin despite inflationary pressures and mix pressures between categories and across countries. We currently believe we will continue to see some product margin erosion in the third and fourth quarter and are planning in the back half to be down slightly to the prior year. We continue to manage costs across the business. However, with our current sales projections, we are anticipating deleverage across our fixed cost of the business.\n\nWe currently anticipate year-over-year operating profit dollars will be down approximately 73% to 77% for fiscal 2022 on the drop in sales, inflationary cost pressures, and the return to normal for items like mall hours and training and events. Diluted earnings per share for the full year is currently planned to decrease less than operating profit related to the share repurchases earlier in the year. We currently anticipate 2022 diluted earnings per share to be between $1.30 and $1.55. We are currently planning our business assuming an annual effective tax rate of approximately 31%.\n\nWe are planning to open approximately 35 new stores during the year, including approximately 16 in North America, 14 stores in Europe, and five stores in Australia. We expect capital expenditures for the full 2022 fiscal year to be between $29 million and $31 million, compared to $16 million in 2021, with the majority of the increase tied to the addition of stores in 2022. And we expect that depreciation and amortization, excluding noncash lease expense, will be approximately $21.5 million, down slightly from the prior year. We are currently projecting our share count for the full year to be approximately 19.5 million diluted shares.\n\nWith that, operator, we'd like to open the call up for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Sharon Zackfia with William Blair. Your line is open.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nHi. Good afternoon. I guess, firstly, a question on the October quarter guidance relative to the current trend. It's obviously assuming kind of a greater falloff.\n\nAnd I'm curious if that's kind of what you've seen already as back-to-school is kind of ebbed. I know you tend to do much better when there's kind of peak shopping periods. I'm wondering if that's informing the guidance.\n\nChris Work -- Chief Financial Officer\n\nSure. I'll go ahead and take that, Sharon. And obviously, we're seeing quite a few different things happening in the business right now, I mean, as we kind of lived through this roller coaster over the last few years and as we're thinking about kind of what's happened here in the back-to-school time, just with the pressure on the consumer tied to higher levels of inflation and the competition. And we're seeing a shift away from our higher-priced brands to value.\n\nWe continue to see challenges, as we mentioned in our prepared remarks, around skate and the negative impact of FX, not to mention some of the more higher level of political challenges like the war on Ukraine and other things that are impacting supply chain. So, I think I'll talk about the quarter here in a sec, but just kind of to further add some commentary on just what we're seeing as we kind of look at the business, I think we're definitely seeing credit card spend has increased pretty meaningfully here as we think about just the domestic business. We're seeing an increase not only in store that's pretty dramatic with all of the offset really coming from our debit card and cash spend. We're also seeing an increase on web that's kind of giving away from other forms of payment.\n\nAnd then as we talked about kind of this value product or our private label offering has really seen a spike, were up almost 450 basis points through the first six months of the year in regards to a percentage of overall sales. So, all of that is kind of playing into how we're thinking about the guidance. And as we think about the Q3 guidance, particularly, we saw pretty soft results really across the quarter or across the period to date, I should say, in back-to-school. And so, as we think about how we're planning Q3, we're actually planning to see a little more drop-off here in the domestic business.\n\nI think it'll be a little tougher than the current trend lines. And then internationally, we're expecting to hold the trend lines better, about where we're at through the first five weeks, is sort of how our planning has played out, I think. On the expense side of the business, where we are planning product margins down in Q3, we started to see some further falloff through the back-to-school timeline, although I do want to reiterate, we continue to be, what I believe, is a full-price, full-margin retailer. We've been really strong margins.\n\nAnd if we look at our margins to '19, we're still significantly ahead of where we were pre-pandemic. So, while we've seen a little bit of a backdrop to 2021, that was our sixth year in a row of positive product margin gains. So, we're feeling really good about how the teams are managing inventory and how they're managing product margin. I think the bigger part of our gross margin decline that's factored into the guidance is really tied to some of the things that have hit us in the first six months of the year.\n\nWe're seeing deleverage and cost pressure specifically around occupancy and distribution and shipping costs. On the SG&A side, we also are showing deleverage. Again, a large portion of this tied to store wages and store costs as -- with those types of sales declines, we're going to see some pressure there. And then on the general corporate SG&A as well, we'll see some deleverage there.\n\nSo, that's kind of how we thought about Q3.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nThanks for that. And I know you kind of put a lot of numbers out there very quickly, but I think -- I benchmark a lot still in 2019 because the last few years have been very odd. So, if I think about the third quarter operating margin guidance relative to '19, I think it's down maybe 700 to 800 basis points. It sounds as if the fourth quarter is going to be more like maybe 600 basis points delta.\n\nIs that some sort of cost savings you're putting in? Or is there something more favorable happening with margins? I'm just trying to reconcile a bit of that kind of narrowing of the gap, if you will, sequentially in the quarters.\n\nChris Work -- Chief Financial Officer\n\nSure. Totally a fair question. I think as we're thinking about Q4, we're also as -- our annual guidance or our annual thoughts imply that we're thinking Q4 is going to continue to be tough based on the current trend lines. It's not quite planned at the same level than what we've shown for Q3.\n\nIn fact, we are showing that we get a little bit better really across all entities heading into Q4. And I think that's just really based on where our overall performance was last year. We did have some pretty important closures in Q4 last year that we're not expecting to happen again this year. As we think about kind of the trend lines of the business, we've been pretty clear the U.S.\n\nhas been our toughest operating area at this point. And the penetration of international really grows in Q4. It ends up being about 21% of the business converts to 16% of the business in Q4. So, we are seeing -- as Rick pointed out, Australia has been really strong.\n\nEurope has been performing stronger than the U.S. as has Canada. So, we're not seeing as much of a part of the business tied to domestic. And then I do think there's probably a few other trend lines that we think will be stronger in Q4.\n\nSo, in relation to your question, I think we're expecting sales to be stronger, which will help ease the decline. I think as we've seen in our model, and we saw during the Great Recession that Rick referenced in his comments, when we see sales fall out of the model, there's a large flow-through to the bottom line. But similarly, when we're able to beat that kind of leverage point, we should see a huge flow back to the bottom line. And so, that's how we're thinking about the business.\n\nI think with the sales declining a little bit less in Q4, we won't see as much of a falloff.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Jeff Van Sinderen with B. Riley.\n\nYour line is open.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nOh, yes. Hi. So, just to kind of follow up on the line of discussion on the P&L. Given the pressures you're experiencing, what would you consider to be a normalized gross margin rate? I'm just wondering if you're thinking that it's kind of close to what it was in 2019.\n\nAnd then also how might you reduce SG&A without cutting muscle, so to speak, at this moment? And what seems like a feasible operating margin target over the next year or two for Zumiez?\n\nChris Work -- Chief Financial Officer\n\nOK. Quite a bit there. Let me try to tackle the SG&A side first because this is one that we're obviously spending a lot of time thinking through, and this might bleed into a little bit of our fixed costs around gross margin as well, just how we're thinking about it. But I think with this guidance, obviously, it's a disappointing result for us in a pretty challenging environment, but we're actively working to reduce costs where we can, obviously, while still investing in the business.\n\nI think I'd start off by saying we still really believe in the long term. I think we're good long-term thinkers. We invested a lot in '08 and '09, and it paid huge dividends for us. So, as we think about this time, we are continuing to think about the long term and how we continue to invest.\n\nThat being said, we are also trying to manage during some pretty short-term challenges. So, I think first and foremost, we're really trying to reduce hours across both our stores and distribution center where possible, like I think you've heard a lot of retailers trying to do that. I think we've been working very hard in that area. We've been trying to manage things like marketing and travel to really try to only hone in on those key areas that are driving the highest return.\n\nAs you know, it's -- in these times, it can be hard to get the full return that you're looking for. And then I think anywhere where there's variable costs we're looking to remove from the business, at the same time, managing corporate costs really closely. So, we have had some success here, unfortunately, just not enough to offset the sales declines that we've reported and seen in the business. So, that's kind of how we think about SG&A and where the big points of focus are.\n\nIn regards to normalized gross margin percentage and operating margin percentage, I'll tell you, we still continue to believe the business can operate in the double-digit operating income. I mean, there's no -- nothing that we've seen even here in this pullback that would tell us we don't believe that. I think the challenges that we're seeing in the business is that we're not unique, to us, is just how the sales drop-off is impacting us when we're also seeing increases in other areas. So, like, for example, domestically here, we're seeing the drop-off in sales to both 2021 and 2019.\n\nWe've been able to take hours down to 2021. We're down about 2% hours to 2021. We're down about 6% in hours to 2019 in our stores. At the same point, we've seen wage rate increase 7% to 2021 and 16.5% to 2019.\n\nNow I know other people have reported some of these facts, and I just kind of caveat that with we're not always comparable with other retailers because of where your -- all your stores are and how minimum wage has impacted us, but I think it still highlights the challenges that retailers are facing with the rising cost of minimum wage and labor overall in relation to sales trends. So, I think over time, that should moderate, and we would expect that our sales will adjust from there as well. So, I think long term, we continue to think that double-digit operating profit is where we can live. I think we've talked before, Jeff, just about some of the other areas of the business that are not contributing to that right now in our international business, specifically Europe.\n\nAnd I think over time, we'll continue to figure that out as well. And that will also help drive the overall operating income level back to where we want it to be.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nOK. That's helpful. And then just sort of as a follow-up to that. And I know you mentioned labor being different in different regions.\n\nThat's certainly a factor. But are you seeing a difference that's notable in regional or, call it, store type or store class performance? In other words, I don't know, maybe a different kind of a shopping center mall, different regions performing differently based on demographic factors that you might be able to read into?\n\nChris Work -- Chief Financial Officer\n\nSure. Yeah. Let me kind of take it. I think from an overall perspective, if we look at -- we typically break our business into the East, the South, the Midwest, and the West.\n\nWhen we look at those four areas, yes, there is a deviation across them. But I would tell you, they've all been pretty bad and negative. So, the West has probably been our best. The Midwest and East have been the more challenged areas, but again, not by a huge volume across those areas.\n\nI think more as we start to think about the geographic changes have been more the U.S. to Canada, to Europe, to Australia, we've seen differences. And so, we've seen stronger internationally, as we've laid out. I think as you talk about mix of store and what's working, A centers, B centers, C centers, we've really seen actually down fairly similar across the board, maybe a little bit tougher on some of the lower volume centers, but overall, pretty similar across types of volume stores, even similar across our regular online stores versus outlet centers.\n\nSo, I think -- and then -- been challenged even probably a little bit more on the web. And so, our stores have performed stronger than the web as we kind of break this out.\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nOK. Thanks for taking my question.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Mitch Kummetz with Seaport. Your line is open.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nYes. Thanks for taking my questions. You, guys, in your press release and also in some of the comments on the call so far, you talked about adjusting the merchandise assortments, focusing more on what's important to the consumer. And then, Chris, you talked about the strength of private label on a relative basis.\n\nSo, I guess I'm just hoping you can elaborate on what exactly you're looking to do with the assortments. And based on maybe what you've seen through the first half, what sort of confidence do you have in -- that those adjustments will maybe help drive some better results in the back half?\n\nRick Brooks -- Chief Executive Officer\n\nAll right. I'll start and let Chris add to the conversation, Mitch. Well, the first and the probably, the most primary thing is, again, we have to -- our customers tell us they want more value from us. So, we're defining -- of course, each customer might define value differently in terms of how they combine price points and [Inaudible] of product.\n\nSo, we have a number of different strategies, really, three different groups of buckets here that our product teams are working on that would be ways for us to deliver more value to that consumer base. And during back-to-school, a lot of that -- you saw, as Chris said, our private label penetration was much higher. We did that through the back-to-school cycle with really the bucketing of -- the bundling of product to get there. So, we have, again, Mitch, about three different value points of view we have that -- I'm not going to share them all, but I believe are -- what we're going to be working toward enhancing those as we move forward through the remainder of this quarter and into the fourth quarter.\n\nAnd, of course, promotional strategies will be probably a bit different in fourth quarter versus the bundling you saw relative to outfit building in Q3. So, again, they really fall into these three different buckets, Mitch, which I'm not going to share them all. Private label is clearly one of them, and we certainly can deliver more private label in this window. And we have actually, in some categories, the product been low because the sell-throughs have been so strong.\n\nSo, we'll be replenishing those here in the next few weeks. And then the faster-turning categories, of course, will be much more quick in replenishing.\n\nChris Work -- Chief Financial Officer\n\nI'd just add to that, just sort of one gets a feel on just where we're at with private label. I mean, this is -- as Rick said, it's really been a business for us that will let the customer sort of dictate where they want to go. And we peaked in product -- in private label at about 21% as a percent of overall sales in 2015. And then really a theme since then, a decline in private label, it got down to about 11% and then ended, actually, last year in 2021 at 13%.\n\nI think what's interesting is over the last six years, we've talked about product margin expansion. And so, I think this is a, really, testament to our teams, our buying teams, and our sales teams. It's just about how they've been able to manage product and still grow margin despite private label decreasing as a percent of the business. And I think this is a strength of ours even in an environment like this where we have not seen product margin decline, as we've heard with other retailers as much.\n\nAnd so, I think this mix swing will be something that will help support us a little bit as the customer -- as we assume the customer is going to go back to, you know, more value-added products.\n\nRick Brooks -- Chief Executive Officer\n\nAnd I just want to add to that, Mitch. It also doesn't mean that we aren't going to be introducing new emerging brands at a good pace here over -- through the back half of the year as we have in the first half of the year. It's still a central part of our business. And when we see young brands, we still see young brands have in the moments where they resonate and generate some volume for us.\n\nSo, that's still on the longer-term perspective for us. We're going to see the cycle back. Again, as Chris said, we go where the customer want to go right now. They're telling us they want more value in our offering.\n\nBut that doesn't mean we won't launch young brands in this world. We will, and I think there are some exciting things out there to consider on that front, too. But they're going to come back, right? As we come out of the cycle, I fully believe that the uniqueness of emerging brands will again drive -- we'll see private label move back down again as customers move toward the branded merchandise.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nGot it. And then on the skate hardgoods piece, I know there was some good trend there prior to COVID, and then it kind of went on steroids for a year or so. And it's been more difficult in the last year. Is there any way you can kind of frame where that business stands today, kind of volume-wise, from where it was like in 2018 before it really took off, just so that we get a sense as to maybe how much risk there still is there to -- and I'm not saying this going back to 2018 or below 2018, but just be curious to know kind of where it stands versus the big run that you guys experienced until recently.\n\nRick Brooks -- Chief Executive Officer\n\nYeah. I think you framed that well, Mitch, again. I just -- we did -- we had a tough run in skate hardgoods from '15 through '18. And then in early 2019, we saw it take off everywhere across all of our global businesses.\n\nAnd virtually simultaneously, skate hardgoods really started to be strong. Good 2019, obviously '20 pandemic, as you said, that business on steroids really was crazy. Even the early part of '21 was good, and then we started to see it tick down about probably mid-2021. So, I just think that's a healthy framing for thinking about where we're at now in the cycle.\n\nAnd I do believe that a lot of -- that the pandemic and the stimulus really juiced and pulled forward a lot of demand and perhaps potentially shortened that what would have been a longer skate hardgoods cycle. So, I think that's just good context for things, but I'll let Chris talk more about the numbers and where we're at.\n\nChris Work -- Chief Financial Officer\n\nYeah. And I think we peaked at 19% of sales in 2020 and dropped to 15% in 2021. So, as you know, it has been a decline. We've -- that's been one of our larger areas of decline over the last few quarters.\n\nAs we wrapped up Q2, it was definitely getting closer to its trough with us. And it's hard for us to know where this will land. Will it trough at 10% or 12% or even go below 10%? I'm not sure we know for sure. What we do know is based on these trend lines and what we factored into our guidance for the remainder of the year, as we move into Q4 and we start to -- we're anniversary-ing tougher and tougher numbers with each quarter that goes along, we would expect it to kind of be near that trough in the back half of this year and the front half of 2023.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. That's helpful. Thanks, guys.\n\nChris Work -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line of Corey Tarlowe with Jefferies. Your line is open.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi. Good afternoon and thanks for taking my question. So, with inventories elevated across the retail industry at present and promotions also heightened, how are you thinking about your current positioning from an inventory and promotional perspective? And then maybe how are you expecting this to unfold over the next few quarters?\n\nRick Brooks -- Chief Executive Officer\n\nAll right. Corey, I'll start and let Chris add on. Again, as you know well, we've always -- we're very proud of the fact that we have been a full-price, full-margin retailer. I think it represents the strength of our brand and what we offer our customers.\n\nAnd again, I think as our buyers and -- our buying teams around the world have done a great job of minimizing the impact, particularly relative to the other retailers so far, relative to product margin declines. I think we've probably done better than almost everyone out there. Now, you could argue that's made by sales are a bit tougher because we haven't been marking down -- we haven't needed to be as aggressive in marking down product as perhaps some other retailers have had to be, but that's because we -- again, we want to stand on our own. We want to stand consistently for what our brand means for our customers and what it represents for our customers.\n\nSo, we feel that our teams have done a good job managing inventory. And our job, as I mentioned a couple of questions ago, is to find new ways to deliver for our customers and to the value they want offered from our assortment. So at this point, we do think that it's probably going to be a more promotional environment. I don't think there's probably any way -- any way that does take that is probably, I think, going to get a rude surprise.\n\nBut it probably won't be come from us, Corey, as much will be from our competitors having to really mark down pricing. So, our job is to find ways that we can convey value through our unique strategies relative to our product mix and our product assortments, and how we work with our brand partners. So, I think we have done a great job of managing inventory through the cycle. I think that we feel positive about where our inventory is and in relation to if we get down to a category-by-category basis that we have the ability to manage relative to where our sales will be that we can control it based upon looking at those category details.\n\nSo, I think we are going to be probably covering our own unique path in there, where I'm not sure we be as promotional as others. But I think it's the right thing for us. I think it's the right thing for our brand. I don't know, Chris, you have anything to offer?\n\nChris Work -- Chief Financial Officer\n\nNo. I mean, I would just say our inventory -- we feel really good about the cleanliness of it and where it stands. And obviously, as we reported, up 4% on an FX-adjusted ratio to 2021 and pretty even with where we were in 2019. I think the teams have done a really good job trying to manage the risk in inventory.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGot it. And then just -- because you mentioned by category, how is the customer responding to those categories where you might be having a little bit of, call it, lower merch margins as a result of competitive pressures?\n\nRick Brooks -- Chief Executive Officer\n\nAgain, I don't quite think a lot that way. If we're driving lower merch margins, often probably because of our value strategies around bundling and things like that. We're still only marking down product where we don't have the rate of sell-through and -- or we can't work with our brands on that topic, whether it be brand supporting through RTVs, return to vendors, or through assistance and markdown dollars. So, I think about a bit differently, Corey, in terms of how our teams work through it.\n\nAnd so, for me, it's -- like again, I think we've done a pretty amazing job through this environment of managing product margins. And we're still taking -- and we're only marking down things where we can't find a way to work through -- otherwise work through with our brand partners.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGreat. Very helpful. Thank you very much and best of luck.\n\nRick Brooks -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. I'm showing no further questions in the queue. I would now like to turn the call back over to Rick for closing remarks.\n\nRick Brooks -- Chief Executive Officer\n\nAll right. Again, thank you, everyone, for your time today, and we always appreciate your interest in what we're doing at Zumiez. And despite the challenges, I know that we, here, as a team, remain incredibly confident in our long-term position and the strategies we have to execute for earning and winning share in the marketplace. So, thank you, everyone, again, for your time, and we look forward to talking to you in December when we release our third-quarter results.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRick Brooks -- Chief Executive Officer\n\nChris Work -- Chief Financial Officer\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nJeff Van Sinderen -- B. Riley Financial -- Analyst\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nMore ZUMZ analysis\n\nAll earnings call transcripts"
}