{
  "companyName": "Bank of America",
  "companyTicker": "BAC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/17/bank-of-america-bac-q3-2022-earnings-call-transcri/",
  "content": "Bank of America (BAC -0.06%)\nQ3 2022 Earnings Call\nOct 17, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, everyone. And welcome to today's Bank of America earnings announcement. [Operator instructions] It is now my pleasure to turn today's program over to Lee McEntire. Please go ahead.\n\nLee McEntire -- Senior Vice President, Investor Relations\n\nThank you, Catherine. Good morning. Welcome. Hope everyone had a good weekend.\n\nThank you for joining the call to review our third quarter results. I hope everyone also had a chance to review our earnings documents released earlier this morning. As always, they're available, including the earnings presentation that Brian and Alastair will refer to during the call on the investor relations section of the bankofamerica.com website. I'm going to first turn the call over to our CEO, Brian Moynihan, for some opening comments.\n\nAnd then, I'll ask Alastair Borthwick, our CFO, to cover the details of the quarter. Before I turn the call over to Brian, I'll just remind you that we may make forward-looking statements and refer to non-GAAP financial measures during the call. Forward-looking statements are based on management's current expectations and assumptions, and are subject to risks and uncertainties. Factors that may cause actual results to materially differ from expectations are detailed in our earnings materials and the SEC filings that are available on the website.\n\nInformation about non-GAAP financial measures, including reconciliations to U.S. GAAP, can also be found in our earnings materials that are available on the website and in the docs. So with that, I will turn it over to you, Brian. Thank you.\n\nBrian Moynihan -- Chief Executive Officer\n\nGood morning, and thank you for joining us. I want to start by sending our thoughts to the impacted areas from the devastation of recent storms, especially our impacted teammates and their families. Our teams remain busy assisting those clients and associates in the impacted areas. So, we can start on Slide 2 of the earnings materials.\n\nThis quarter, Bank of America reported $7.1 billion in net income, or $0.81 per diluted share. We grew revenues 8% year over year. We delivered our fifth straight quarter of operating leverage. Every business segment delivered operating leverage.\n\nThis takes us back to our five-year run before the pandemic. The highlights this quarter were also once again marked by good organic customer activity. This was coupled with a significant increase in net interest income. In addition, the teams adapted well to our new capital requirements.\n\nAnd as a result, our Common Equity Tier 1 ratio, or CET1 ratio, improved by nearly 50 basis points to 11%, moving 60 basis points above its current minimums. The decline from prior-year reported net income and EPS comparisons reflect a reserve build versus reserve release from last year. At the same time, however, our asset quality remains strong as net charge-offs and several other metrics, in fact, improved from the second quarter of 2022. Pretax, pre-provision income grew 10% year over year.\n\nFrom our term perspective, we produced a 15% ROTCE and a 90-basis-point ROE. Our efficiency ratio this quarter dropped to 62%. Taking out the litigation, it would have been 61%. So, even while investing in marketing and people and technology and physical plant, the team continues to drive operational excellence.\n\nAn easy way to think about this is we currently operate Bank of America with less people than we had in 2015 seven years ago. Let's go to Slide 3. There's continued investments over the past several years in our people, tools, and resources for our customers and teammates, as well as our new and renovated financial centers that's allowed us to continue to enhance the customer experience and fuel organic growth as we drive responsible growth. In the third quarter alone, we added more than 400,000-plus net new consumer checking accounts.\n\nWe added 1.3 million new credit card accounts. We added 100,000 new funded investment accounts in our consumer business. Customers are finding it increasingly convenient to access us. Digital users grew to 56 million.\n\nLogins by those users cleared 3 billion in the past quarter, 1 billion per month. Erica surpassed 1 billion interactions since it was introduced four years ago this quarter. It has become a primary interaction method for our clients with more than 130 million interactions this quarter alone. When you look at our sales, 48% of third quarter sales are digital, a 36% year-over-year increase.\n\nThis occurred even as we fully reopened our financial centers and had our teammates also selling. Now, once again, you can find all these digital statistics and more in the appendix of our earnings material as usual. I encourage you to look at those statistics for every one of the lines of business, not just consumer. They compare favorably to any other competitive measure that we see because we -- when we see people actually publish their numbers.\n\nAt the same time, 27 million customers visit our financial center in the quarter. This highlights the importance of having both high-touch and high-tech approach. In the wealth management business, we added 400 advisors this quarter. Our advisors added nearly 6,000 new households in the Merrill and Private Bank areas.\n\nWe saw solid net flows despite the turbulence in the markets. Eighty percent of our customers are digitally active. Thirty percent of the new Merrill accounts are opened digitally. That, combined with our consumer investments business, has seen more than 100 billion of net client flows year to date.\n\nWe continue to see increased activity, both in investments, as well as the banking products in this area. This quarter, GWIM opened a record number of bank accounts. GWIM also saw its 50th consecutive quarter of average loan growth. The banking capabilities and success differentiates our platform.\n\nThe business grew revenue, delivered operating leverage, and saw record pre-tax, pre-provision growth even in choppy markets. As we turn to global banking, ending loan balances were down linked quarter. However, we did see solid production in this area. And that was offset by client paydowns decrease in the value of foreign denominated loans and loans sold to manage our risk-weighted assets, which helped us build the capital levels I talked about earlier.\n\nAs we look at global markets, the team had a strong third quarter in sales and trading performance. In fact, in the third quarter of 2022 was the strongest since the third quarter of 2010. It grew 13% from last year. It was led by strong performance of our macro FICC business, which has benefited by investments made over the past year.\n\nWe had no trading loss days this quarter. But let me also make a few points using the customer activity highlighted on the continued resilience of Bank of America's broad customer base. So if you look at Slide 4, you can see some points about the overall health that demonstrate what's going on in the customer base. Let me make a couple of key points.\n\nFirst, consumers continue to spend at strong levels. Second, consumer customer average deposit levels for September of 2022 remain at multiples under pre-pandemic levels. You can see that in the lower right. Third, there's plenty of capacity for borrowing as credit card balances of BAC are still 12% below pre-pandemic levels.\n\nAnd the payment rates on those credit cards are 1,000 basis points over pre-pandemic levels. So, in spending, a couple thoughts. A perspicacious analyst might wonder whether talk of inflation, recession, and other factors would rectify in a slower spending growth. We just don't see it here at Bank of America.\n\nYear-to-date spending of 3.1 trillion through September is up 12% compared to last year. Second, as you look across the periods, you can see in the trend of year-over-year spending, as we entered the pandemic, we saw spending decline and quickly recover and grow across the quarters. And while still strong in September at 10%, spending growth has slowed just a bit by 12% year to date pace, which shows you that early in the year, a faster year-over-year growth rate. But it's still strong.\n\nIn the first two weeks of October, it showed that strength is still growing at 10%. It is notable that it isn't just inflation that is driving spending, as transactions are up single digits year-over-year pretty consistently. You also note on the bottom left the continued growth in goods and services, particularly retail, toward experiences of travel and entertainment. While fuel price volatility continues, it is not currently impacting the spend levels in this quarter as prices stabilize.\n\nOn the level of customer liquidity -- the level of customer liquidity remained strong. Average deposit balances of our consumer customer remained at high levels relative to year ago. These balances are still multiples of the pre-pandemic period, and they were largely unchanged at these elevated amounts for the month of September. These deposit levels suggest continued capacity for spending at healthy levels.\n\nOn Slide 5, we show you, as we did last quarter, some other stats about resiliency. As you can see, whether you look at early or late-stage card delinquencies, they all remain well below our pre-pandemic levels. These are decades-old lows. And we're just now seeing a gradual move of these lows and early stage delinquencies.\n\nLate-stage delinquencies are still 40% below pre-pandemic levels. Keep in mind, asset quality metrics are strong even before the pandemic. On this page, what you see is the 30-day card delinquencies. If you compare them against the average for the past five years leading up to the pandemic, a period of growth and unemployment falling, those averages 183 basis points and 91 basis points, respectively.\n\nSo, the current ratio delinquencies would have to worsen 30% or more to even approach that five-year pre-pandemic average time of economic growth and falling unemployment. So, consumers remain resilient. Let me take a couple of minutes to talk to you quickly about the balance sheet, and I'll turn it over to Alastair. As you think about loan or deposit base balances in general, we're seeing what we expected.\n\nAs monetary policy tightens on deposits, we see clients with excess liquidity looking for yield, with that being the global banking movements you can see moving from noninterest bearing to interest bearing accounts, or in our wealth manager business, where we saw clients shift out of brokerage suites into preferred deposits or other investment products, like treasuries, that we offer. But if you look at our core customer base, where the transactional balances drive the outcome, we are seeing steady balances driven by new account activity and a good value proposition we have for our customers. When you think about loans, consumer loan balance growth was led by card and reflects increased market and continued reopening of financial centers lending high levels of new customer relationships. On commercial, average loans were at $16 billion linked quarter, or 12% annualized.\n\nYou did see a modest ending balance decline as good loan production was offset by the seller syndication, a $3 billion of loans, and also by $4 billion negative foreign currency impacts. We obviously took activity on balance sheet optimization, which helped our RWA discussion and have -- that lead us to RWAs and led to the capital levels I talked about earlier. We have provided an update in the appendix as to the credit transformation of the loan portfolio and a few other consumer credit slides that help illustrate the quality of our portfolio under years of responsible growth. We updated slides again this quarter to show you them, and you can find them in appendix, and I recommend them to you.\n\nSo, in summary, client activity remains good and has improved quickly, and the customers' resilience and health remain strong. We've also managed our expenses very well. We drove our operating leverage. The team managed the balance sheet well and improved capital, even increased our dividend and bought back a modest amount of shares.\n\nWe call that responsible growth. With that, I'll turn over to Alastair.\n\nAlastair Borthwick -- Chief Financial Officer\n\nThank you, Brian. And I'll start by adding a little more detail on the income statement and refer you to Slide 6 highlights. You can see here revenue of 24.5 billion grew 8% with an NII improving 24% year over year, while our fees declined 8%. And I'll cover the NII improvement in just a moment.\n\nOn noninterest income, the volatility and the levels of market activity drove a year-over-year decline in investment banking and asset management fees, while sales and trading benefited from investments made in the business and the volatile market conditions. Additionally, service charges moved lower for two reasons. First, in consumer, we completed the sweeping changes around insufficient funds and overdraft in June, marking a 90% reduction from June of 2021. Second, our corporate service charges declined as earned credit rates increased for clients, and that overwhelmed organic growth and the gross fees associated with treasury management services performed for our clients.\n\nExpenses this quarter were 15.3 billion, and they included the settlement of our last large remaining legacy monoline insurance litigation. As you likely saw on October 7th, we filed the 8-K announcing a settlement that resolved all of the outstanding litigation with Ambac, and that dates all the way back to the 2008 financial crisis. We recorded 354 million in litigation expense this quarter, above previous accruals for payment of the settlement. And without that litigation costs, our expense would have been just below the 15 billion mark.\n\nOK, let's move to the balance sheet, and we'll look at Slide 7, where you can see, during the quarter, the balance sheet declined 38 billion to 3.07 trillion. That was driven by a 46 billion decline in deposits and coupled with a 53 billion decline in securities. Our average liquidity portfolio declined in the quarter, reflecting the decrease in deposits and security levels. At 941 billion, our liquidity still remains 365 billion above pre-pandemic levels, just to give you an idea of just how much our liquidity has increased.\n\nShareholders' equity was stable with the second quarter at 270 billion as earnings were offset by capital distributed to shareholders and the change in AOCI from [Inaudible]. We paid out 1.8 billion in common dividends. We bought back 450 million in gross share repurchases. And that covered our employee issuances in the quarter, leaving no dilutive impact for shareholders.\n\nAOCI declined 4.4 billion as a result of the increase in loan rates. And we saw the impact primarily in two ways. First, we had a reduction from a change in the value of our AFS debt securities. That was 1.1 billion, and that impacted CET1.\n\nSecond, rates also drove a 3.7 billion decline in AOCI from derivatives, and that does now impact CET1. That reflects cash flow hedges mostly put in place last year against some of our variable rate loans, and that protected us against CET1. With regard to regulatory capital, our supplemental leverage ratio increased to 5.8% versus our minimum requirement of 5%, which still leaves plenty of capacity for balance sheet growth. And our TLAC ratio remains comfortably above our requirements.\n\nOK, let's go to CET1 waterfall on Slide 8, and we can talk about that. As you'll recall, back in last quarter, we talked about our June CCAR results, where our stress capital buffer increased from 2.5% to 3.4%. And that increased our overall CET1 ratio minimum requirement from 9.5 to 10.4 as of the beginning of the fourth quarter. Our capital levels today remain strong with 176 billion of CET1.\n\nAnd through the good work of our teams, we improved our CET1 ratio by 49 basis points compared to June 30th, taking us to 11%. That leaves us well above our new 10.4% minimum requirement. So, we'll walk through the drivers this quarter. First, it's 6.6 billion of earnings, net of preferred dividends, and that generated 40 basis points of capital.\n\nAnd then, also, importantly, through optimization of the balance sheet, we managed our RWA balances down, and that added 26 basis points more of capital ratio improvement. Dividends used 11 basis points of capital. And this quarter, the movement in treasury and mortgage-backed securities rates caused the fair value of our AFS debt securities to decrease. And that lowered our CET1 ratio by 7 basis points.\n\nWe remain well-positioned for the rate movement because of the hedge of a large portion of this portfolio continuing to protect us from AOCI movements while benefiting NII since [Inaudible]. So, we feel like our teams rose to the challenge well this quarter in terms of increased capital requirements. On Slide 9, we laid out average loans. And looking at those loans and providing a bit more detail on a year-over-year basis, you can see 12% average growth as commercial loans grew 17% and consumer loans grew 7%.\n\nWithin consumer, credit card grew 12%. Focusing on more near-term growth versus the second quarter of '22, our average total loans grew 8% on an annualized basis, led by 12% annualized commercial loan growth and 21% annualized credit card growth, while other consumer loans were relatively flat linked quarter. This lower linked quarter growth included two notable impacts that Brian mentioned. We saw good commercial loan demand, and we also saw FX valuations adjustments as a result of the strong dollar, and then some loan sales and syndications that lowered our RWAs.\n\nPartially offsetting some of the strong card growth in consumer loans, we sold about 1 billion of residential mortgage loans. Adjusting for the FX impact and loan sales, loan growth from Q2 was closer to the industry's growth rate. Let's focus now on deposits using Slide 10. And you can see there that our average deposits year over year are up 1% at 1.96 trillion.\n\nThe noninterest bearing deposits are down 3%, while the interest bearing are up 4%. So, overall, we grew our deposits. And as you would expect in a rising rate environment, we've seen some shifts from noninterest-bearing into interest-bearing. And it's important to understand the makeup of these moves.\n\nIn consumer, our total deposits are up 7% year over year. These are core and foundational elements of the customers' financial activities. And we've seen growth in both noninterest-bearing and interest-bearing balances. And we remain very disciplined on 1.1 trillion of total consumer deposits while Fed funds is now at 3.25.\n\nSo, customers see the value in their total relationship with us through their personalized client engagement and our industry-leading digital capabilities and rewards. We expect that to continue. Do we expect deposit rates to increase? Yes, of course. And we will remain both disciplined and competitive, and that is built into our asset sensitivity.\n\nOn a linked quarter basis, our consumer deposits moved lower by less than 1%. In wealth management, total deposits are flat year over year. And again, it's important to understand that, as expected, these are the clients who generally have more excess liquidity and have historically sought higher rates, both in deposit accounts, as well as movements outside of deposits, where we offer alternatives for those clients. While flat year over year, within that, we saw a $12 billion decline in year-over-year average deposits on our brokerage platform, with some shifts from sweeps to preferred deposits within the platform.\n\nMeanwhile, Merrill Bank deposits and deposits with Private Bank have grown 12 billion. The higher-tiered preferred deposit products represent a little more than 20% of the mix of deposits, and they're moving largely in line with short-term rates, while the other 80% or so deposit products are paying much lower rates. On a linked-quarter basis, we saw total GWIM deposits decline by 7%, further highlighting these trends. In global banking, we hold about 500 billion customer deposits, and we saw a 7% year-over-year decline.\n\nIn a rising rate environment, where excess balances can be more expensive, we typically see some runoff, particularly in high liquidity environments, as clients both use cash for inventory build and begin to manage their cash for yield. And we've seen the mix of interest-bearing deposits moved from 30% a year ago to nearly 35%. And we're paying an increased rate on those interest-bearing deposits. Pricing is largely customer by customer, based on the depth of relationship, and many other factors.\n\nAnd again, we're not really seeing anything unexpected here. Betas, at this point, are still favorable for the last cycle. And as we would just note, relative to the last cycle, the Fed increases have been pretty rapid. And we'd expect to pay higher rates as we continue to move through this rate cycle.\n\nIt's probably too early to say right now if, at the end of that cycle, the percentage of those rate pass-throughs will be similar to the last cycle. Turning to Slide 11 and net interest income, on a GAAP non-FTE basis, NII in Q3 was 13.8 billion. And the FTE NII number was 13.9 billion. Focusing on FTE, net interest income increased 2.7 billion from Q3 '21, or 24%.\n\nAnd that's driven by benefits from higher interest rates, including lower premium amortization and from loan growth. Versus the second quarter, NII is up 1.3 billion, driven largely by the same factors, plus an additional day of interest in the quarter. Year over year now, average short-term interest rates have increased 200-plus basis points, driving up the interest earned on our variable rate assets, while we've maintained discipline on our deposit pricing. And that has driven nearly 1 billion of the improvement.\n\nLong-term interest rates and mortgages have increased even more than short-term rates. And that's improving fixed rate asset replacement and driving down refinancing of mortgage assets, therefore, slowing the recognition of premium amortization recognized in our securities portfolio. Year over year, that premium amortization has improved $1 billion. And additionally, lower securities balances over the past six months modestly offset the benefits of year-over-year loan growth.\n\nNet interest yield was 2.06, and that improved 38 basis points from the third quarter of '21. Twenty basis points of that improvement occurred in the most recent quarter. And as you will note, excluding global markets activities, our net interest yield was 2.51% in this quarter. Looking forward, as it relates to NII guidance, I'd like to make a couple of comments.\n\nAnd first, I need to make a couple of caveats. Our guidance is going to assume interest rates in the most recent forward curve and that they materialize. But we see modest loan growth and modest deposit balance changes with market-based deposit pricing increasing baked in. With that said, we expect NII in Q4 to be at least 1.25 billion higher than Q3.\n\nSo, last quarter, when we were together, we told you we expected to see consecutive NII increases of about 1 billion in Q3 and another billion in Q4. And that would make a total of 2 billion then in Q3 and Q4. Given we just put up 1.3 billion in Q3 and that outperformance, and refreshing our expectation for Q4 at 1.25 billion, we're now seeing that aggregate quarterly improvement won't be the 2 billion we initially thought. It's increased to around 2.6 billion or more.\n\nTurning to asset sensitivity and focusing on a forward-yield basis, at September 30th, declined 0.7 billion to 4.2 billion of expected NII over the next 12 months, with now roughly 95% of the sensitivity driven by short rates. And on a spot basis, our sensitivity to 100 basis points instantaneous rate hike would be 5.3 billion. OK, let's turn to expense, and we'll use Slide 12 for the discussion. Third quarter expenses were 15.3 billion and were flat with the second quarter, as litigation costs for our settlement in Q3 nearly offset the fines agreed to last quarter on the comparative basis.\n\nAnd it's nice to bring resolution to these matters. Without the costs associated with the resolutions in both periods, expenses would have been just less than 15 billion. We continue to make steady investments in our people, technology, marketing, and financial centers. And what allows us to help pay for these investments are the operational process improvements we've talked about and the increased digital adoption rates by our customers and by our bankers.\n\nOur headcount this quarter increased by 3,500. And if we adjust for the release of our summer interns, our headcount is actually up by closer to 5,500. We welcomed 1,800 new full time associates from college campuses around the world into our company this quarter. And we hired another 3,800 net new people on top of that.\n\nThat included just less than 3,000 across our various lines of business and another 1,000 in staff and support and technology positions to support those lines of business. And with all the great benefits and talented people already at this company and with our great brand, it highlights that Bank of America is a great place to work. As we look forward, we'd expect our fourth quarter expenses will land our full year reported expense at approximately 61 billion. That obviously includes the costs noted for resolving the second quarter and third quarter regulatory and litigation matters.\n\nSo without that, our expenses are expected to be a little more than the 60 billion level we talked about earlier in the year. And we're proud of our team's discipline around expense, particularly in this inflationary environment, while, at the same time, we're modestly increasing our level of investment in the company's future and our growth. Turning to asset quality, on Slide 13, and I want to start by saying, just as Brian did, the asset quality of our customers remains very healthy. Net charge-offs of 520 million declined 51 million from the second quarter.\n\nThat decline was driven by prior-period charge-offs associated with the sale of some noncore mortgage loans we discussed last quarter. Absent those losses, net charge-offs were relatively stable with the prior period. Provision expense was 898 million in the third quarter, and that was 375 million higher than the second quarter. And we built 378 million of reserve in the period compared to a modest release in Q2.\n\nThe reserve build in the quarter primarily reflects good credit card loan growth and a dampened macroeconomic outlook. Even as we build our reserves for the future, this quarter, we saw many of our asset quality metrics continue to show modest improvement as NPLs and reservable criticized both declined from Q2. And you can see that in the supplement. On Slide 14, we highlight the credit quality metrics for both our consumer and commercial portfolios.\n\nAnd there's only one point I want to make looking at this slide, and that is delinquencies. Because our consumer delinquencies remain well below pre-pandemic levels. And as Brian noted earlier, we're watching closely the early stage card delinquencies as they begin to increase modestly. Lastly, the recent hurricane impacted some areas where we have strong market shares for many of our businesses.\n\nAnd our teams have spent the past days assessing the damages and insurance coverage down to the loan level. And we've already incorporated that analysis into our reserves for the quarter. We compared our analysis to other large storms in recent years like Sandy, Harvey, and Irma, where we incurred just a small amount of financial losses. Turning to the business segments, let's start with consumer banking on Slide 15.\n\nAs Brian shared earlier, we've got organic growth across the checking accounts, the card accounts, and investments picking up this quarter, not necessarily because of anything we're doing differently in the past 90 days, but as a result of many years of retooling and continuously investing in the business. Ae have the leading retail deposit market share. We have leadership positions among all of the important products with a leading digital bank with tremendous convenient capabilities for consumer and small business clients. We've got a leading online consumer investment platform and the best small business platform offering for our clients.\n\nSo, as a result, customer satisfaction is now at all-time highs. And that is helping us to drive strong financial results. The consumer bank earned 3.1 billion on good organic growth and delivered its sixth consecutive quarter of operating leverage, while we continued heavy investments for the future. The impact of strong year-over-year revenue growth of 12% was partially offset by an increase in provision expense.\n\nAnd the provision increase reflected reserve builds for this period, mostly for card growth versus our reserve release in third quarter of '21. Our net charge-offs remain low and stable. While reported earnings were only modestly up year over year, pre-tax, pre-provision income grew 12% year over year, which highlights the earnings improvement coming through without the impact of the reserve actions. Card revenue was solid and increased modestly year over year, as spending benefits were mostly offset by higher rewards costs.\n\nService charges were down 338 million year over year, as our insufficient funds and overdraft policy changes were in full effect by the end of Q2. And because of the scale of the business and the diverse revenue, we fully absorbed that revenue impact and are now benefiting from the benefits of overall customer satisfaction, lower attrition in our client base, and lower cost associated with fewer customer complaint calls associated with less nuisance fees. Expense increased 11% from business investments for growth, including people, digital, and marketing, along with costs related to opening the business to fuller capacity. Much of the company's increased salary and wage moves in the quarter impact consumer banking the most.\n\nWe also continued our investment in financial centers, opening another 16 in the quarter, while we renovated nearly 200 more. Both digital banking and operational process improvements are helping to pay for those investments. And as revenue grew, we've improved the efficiency ratio to 51%. Moving to Slide 16.\n\nWealth management produced strong results, earning 1.2 billion. And that's a particularly strong result, given both equity and bond market levels. If they remain unchanged for the rest of the year, this would be only the first time since 1976 that both equity and bond markets were down for the year. Now, the volatility and generally lower markets levels have put pressure on revenue in this business.\n\nAnd what's helping to differentiate Merrill and the Private Bank right now is a strong banking business, in this case, to the tune of 339 billion of deposits and 224 billion of loans. So, while many of our brokerage peers face declines in revenue and margin, we've seen year-over-year revenue growth of 2% and a margin of 29%, driving sixth straight quarter of operating leverage. And we saw enough revenue growth from banking products in Q3 that more than offset declines in assets under management and brokerage fees. Our talented group of financial advisors, coupled with our powerful digital capabilities, allowed modern Merrill to gain 5,200 net new households.\n\nAnd the Private Bank gained 550 more in the quarter, both up nicely from net household generation in 2021. We added 24 billion of loans since Q3 of '21, growing 12%. And this marks our 50th consecutive quarter of average loans growth in the business, consistent and sustained performance. Assets under management flows were 4 billion in the quarter and 42 billion since this time last year.\n\nExpenses increased 2%, driven by continued client-facing hiring and higher other employee-related costs, as our advisors are increasing their in-person engagement with clients. And that's partially offset by lower revenue-related incentives. On Slide 17, you'll see our global banking results, where we are 2 billion in Q3 on strong revenue growth, as higher NII more than offset lower noninterest income. Earnings were down year over year, driven in large part by the absence of a prior-period reserve release.\n\nOur 7% revenue growth is quite healthy, given the more than 40% decline in investment banking fees, coupled with lower leasing revenue. While the company's overall investment banking fees declined a billion year over year in a continued tough market, investment banking fees did improve modestly from Q2. And the teams did a nice job of holding onto our No. 3 ranking in overall fees in a tough environment.\n\nOtherwise, in fees, we saw a decline in corporate service charges, as enterprise credit rates rose with increased rates. And that outpaced the growth in gross treasury service fees generated from new and existing clients. I'd also remind you that GTS benefits greatly from the NII off of deposits. That more than offsets this, so our year-over-year total GTS revenue is up 44%.\n\nWe also had lower leasing related revenue comparatively. The provision expense increase reflected a reserve build of 144 million in Q3 '22 compared to a 789 million release in the year-ago period. And with regard to expenses, they increased 5% year over year, driven by continued investments in the business. For example, in commercial banking, our strategic hiring over the years has just continued to increase our client and prospect calling efforts.\n\nSwitching to global markets on Slide 18. And as we usually do, we'll talk about segment results excluding DVA. Inflation, continued geopolitical tensions, and the changing monetary policies of central banks around the world continue to drive volatility in both the bond and equity markets. As a result, it's another quarter that favored macro trading, while credit trading businesses faced the continued challenging market environment with wider spreads and recession concerns.\n\nSo, the third quarter of net income of 1.1 billion reflects a good quarter of sales and trading revenue. Focusing on year over year, sales and trading contributed 4.1 billion to revenue, improving 13%. FICC improved 27%, while equities declined 4%. The FICC improvement was primarily driven by growth in our macro products, while our credit-traded products were down.\n\nAnd we've been investing heavily over the past year in several macro businesses that we identified as opportunities for us, and we were rewarded this quarter. The decline in equities was driven by lower client activity in Asia and a weaker performance in cash, partially offset by good performance in derivatives, where we saw increased client activity. Year-over-year expense declined, reflecting the absence of costs associated with the realignment of liquidates and business activity that we took in the fourth quarter of '21. And the business generated a 10% return in the third quarter.\n\nFinally, on Slide 19, we show all other, which reported a loss of 281 million, declining from the year-ago period, driven by the litigation settlement that I noted earlier and higher tax expense. On income tax expense, I just want to mention one thing that made our tax rate a little higher this quarter. And that is with the recent passage of the Inflation Reduction Act of 2022. Among other things it incorporated, there was a change that allowed solar energy investments to elect production tax credits versus upfront investment tax credits.\n\nAnd those production tax credits have the potential to earn more credits over the expected life of the production facility. So, as a result, our third quarter tax expense is approximately 150 million higher due to the net reversal of tax credits accrued for 2022. Some of the deals taken in the first half of 2022 that were recognized under initial investment tax credits at the time, and we replaced with production tax credits. So, a little impact this quarter, but net benefit to the shareholder over time.\n\nThis drove the effective tax rate a little higher this quarter to more than 14%, still, obviously, benefiting from our ESG investment tax credits. And excluding the impact of ESG tax credits, the tax rate would have been approximately 24%. Given the change noted for solar investments, we expect the fourth quarter tax rate to be similar to the third quarter tax rate. And we'll examine the further effects of these changes and how they impact full year 2023 and report on that next quarter.\n\nAnd with that, I'm going to stop there and open up for Q&A.\n\nOperator\n\n[Operator instructions] We'll take our first question today from Jim Mitchell with Seaport Global. Your line is open.\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nHey, good morning, guys. Maybe just on NII. I think there's a lot of uncertainty around deposit behavior, betas, what the catch-up rate could be with deposit pricing. But you guys indicated that you do -- you're still pretty asset sensitive.\n\nSo, how do you think about the trajectory of NII next year? Can it kind of keep growing from sort of the Q4 level through next year?\n\nBrian Moynihan -- Chief Executive Officer\n\nThanks, Jim. So --\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nAssuming when your curve is realized. Sorry.\n\nAlastair Borthwick -- Chief Financial Officer\n\nYeah. Yeah. So the short answer is yes, we believe so. And we believe that really for three reasons.\n\nThe first one is, you know, we're still expecting future rate hikes, and, you know, there's going to be some lag to their impact. So, you'll start to feel some of that in Q1, for example, from the late hikes in this quarter. Second, you know, we're anticipating -- you know, loans growth is still pretty good at this stage. So, we're anticipating that will keep growing on the loan side.\n\nAnd then, third, we've got an opportunity to restrike our balance sheet at higher rates with every opportunity now, as things come off of our existing securities portfolio. So, look, we've got our assumptions in there to be competitive on deposit pricing in each of the various segments. But, yes, we believe we'll grow NII next year.\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\n4Q run rates?\n\nAlastair Borthwick -- Chief Financial Officer\n\nYes. Correct.\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nOK. And then, maybe as a follow-up, you guys have done a pretty great job on hedging AOCI risk in the AFS book. My understanding is that the benefit -- those are sort of delayed start swaps. Is there a material benefit coming from those swaps in the fourth quarter and beyond? How do we think about that?\n\nAlastair Borthwick -- Chief Financial Officer\n\nSo, just the way our own ALM projected over the course of the next couple of years, we had some forward-starting swaps. Those are going to pay us floating in the fourth quarter. And that's a contributor to the NII growth in the fourth quarter. But I think you should assume a little bit third quarter, most all in fourth quarter.\n\nAnd that's probably it.\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nWe'll go next to Erika Najarian with UBS. Your line is open.\n\nErika Najarian -- UBS -- Analyst\n\nHi. Good morning.\n\nAlastair Borthwick -- Chief Financial Officer\n\nGood morning, Erika.\n\nErika Najarian -- UBS -- Analyst\n\nI wanted to ask a question about expenses. You know, I think part of a bearish thesis on the stock is that, you know, bearish investors expect some sort of expense to catch-up relative to how your closest peer -- one of your closest peers is budgeting expenses for not just this year but next year. I heard you loud and clear on the 61 billion-plus litigation settlement for a full year 2022. But as you think about coming years and think about the investments that you've made, you've highlighted the headcount additions in the third quarter, will the expectation of, you know, 1% to 2% expense growth still hold as we look forward? Or does inflation and investments change that range upward?\n\nBrian Moynihan -- Chief Executive Officer\n\nSo, Erica, you know, we continue to invest heavily along multiple dimensions, people, technology, restructuring all the physical plant, marketing. And so -- you know, but yet, through the core operational excellence discipline this company has and shown, as I said earlier, seven years later, we have the same number of people. The company is a lot bigger than it was in 2015, you know. And so, we continue to reposition money from things we can eliminate the work by the engineering and work in the technology investments we make, enabling the customer to use that technology and plow back into the production side of the company.\n\nAnd so, we don't -- you know, I think if you think about just this year's third quarter '22 versus third quarter '21, if you take it out, the litigation, it's about $600 million increase in expenses year over year, 100 million of that's marketing. Another chunk is another couple of hundred million dollars technology this quarterly -- not annual, the quarterly numbers. And then, on top of that, you know, the amount of physical plant change in that time is huge, not only in our branches but all over our companies. So, yeah, we feel strong.\n\nWe continue to increase investments. Technology will go up 15% this year versus -- I mean '23 versus '20 in those expense numbers we're giving you. But we pay for by not investing and hoping something happens. We -- you know, we expect the things to rectify in the near term and bring forth the fruit and drive the expense efficiencies and effectiveness.\n\nAnd that's how we can take the managers in that time period I gave you, the headcount and managers came down 10,000 people in that period of time. We invested all in front-line people to help serve our clients.\n\nErika Najarian -- UBS -- Analyst\n\nGot it. And my second question is on more significant buyback activity. Brian, you know, I think that the CET1 build is certainly coming, you know, faster than I think The Street expected. And I'm wondering, you know, do we need to see, you know, Bank of America get to that 11.4% before heavier buyback activity? Or do you think you could manage, you know, the heavier buyback activity as you build to that 11.4% CET1 by January 1, 2024?\n\nBrian Moynihan -- Chief Executive Officer\n\nThe -- So, you know, we bought back shares this quarter and still grew the capital. You know, our job is to drive our company to serve our customers, and that first order of business for our capital is always healthy or, you know, the growth in the balance sheet, especially on the lending and market side. And so, you should expect these buybacks will continue to increase. But remember, we are now sitting above what we were supposed to be sitting at January 1, 2024.\n\nAnd so, next year is already here. So, obviously, the trade between building the buffer up a little bit more, as you said, from where we are now to 50 basis points of the requirement is a little bit different. We already exceed the requirements. So, we'll put a little bit toward a buffer.\n\nWe'll support the organic growth a little bit toward the buffer and then use the rest to send back to the guys.\n\nErika Najarian -- UBS -- Analyst\n\nThank you.\n\nOperator\n\nWe'll go next to Glenn Schorr with Evercore ISI. Your line is open.\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nThanks very much. I'm curious, you -- half your capital builds was thanks to RWA mitigation. You mentioned no lost space in the quarter despite all this market volatility. You also, I think, mentioned some loan sales.\n\nI don't know if that has to be some of the leveraged loans working off book. So, I wonder if you could talk about RWA mitigation going forward and include in that what's left in the levered loan book to distribute. Thanks.\n\nAlastair Borthwick -- Chief Financial Officer\n\nSo -- well, there's a couple of things that are going on there. I don't want to confuse them. Let me first talk about the leverage finance thing. That, we just marked through our numbers.\n\nIt's in the numbers that pushed it through to it every week. So, that's included. When you look at those global markets or investment banking results, they include anything we're doing in investment banking. I don't think that's what Brian was referring to.\n\nWhat Brian was referring to is the RWA optimization that we're doing as a company to make sure that we're in a great place to serve our customers and to be in a position to have the flexibility for buybacks in the future. So, a couple of things that we did there. We did sell some loans. You saw that in prior quarters in all other.\n\nYou can see some of the legacy loans we were able to sell in prior quarters. This quarter, we sold 1 billion of loans in consumer and wealth and maybe 1 billion in global banking. So, it's not big, but it's important for us just to make progress in different areas. And then most of the RWA optimization, Glenn, that we've been doing is pretty quiet.\n\nIt's taking these securities that are 20% risk-weighted asset. And as they roll off, and remember, there's like 15 billion of them roll off every quarter, we can replace those with treasuries at a higher yield. So, we're getting more yield, and we're reducing the RWAs with that. And then the other thing I'll just say on RWA optimization is, you know, we've probably tapped the brakes a little bit on loan production this quarter in a couple of places.\n\nAnd we did a little bit of CDS hedging here and there. And you'll see -- if you look at our numbers, you'll also see the global markets, just the way that the customers are demanding balance sheet. The balance sheet is still growing, but the RWAs are a little bit lower. So, there's a lot that goes into RWAs.\n\nBut it's a billion here, a billion there. You add it all up, and it makes a difference.\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nThat was awesome. I appreciate that. And I guess, very much related, you just touched on it a little bit. But I'm curious, you're a prime and super prime bank in consumer land.\n\nYou gave us enough details. I know how you're thinking about growth there. On the commercial side, given what we're all facing in this potential real buzzsaw of the economy, how do you approach risk and what business to take on? I don't know if you can include in that thought what kind of maturity wall you're looking at on the commercial side of the book. Thank you for all that.\n\nAppreciate it.\n\nBrian Moynihan -- Chief Executive Officer\n\nSo, Glenn, what we always say to ourselves and teammates is that the response of growth across the last decade-plus leads us to where we are. And so, you're not going to do anything like this afternoon to change the impact. You know, Candace and her team have negative growth, not this quarter, but the fourth quarter, the first couple of quarters next year, modestly negative growth. You know, you're not going to change your portfolio overnight.\n\nSo then, the question is, how do you manage it? Right? So, we put -- we have limits across all the different categories, and you see the spread of risk in a supplemental book. You can see that nobody is a big part of it. Then we look at customer by customer, anticipate who's going to be needing money in terms of refinancing, but also in terms of just, you know, operating, like we did during the pandemic, went through every single loan for the company with 5 million in revenue or more in our company on a quarterly basis for a lot, ensure we had it. So, you know, we've worked the construct to the book.\n\nWe underwrite client selection, the structures of the deals, etc., in a spread of diversity among industries and, you know, U.S. versus non-U.S., etc. But then, on top of that, we always working the book hard. And our ratings integrity is very high.\n\nWe can see as measured in the [Inaudible] and other things against the third party, it's very rare that we have much to do with anything we have rated. And we make sure we test that continuously with our credit review team under Christine Katziff and Jeff Greener's team. Because that -- and at the end of day, make sure we're not fooling ourselves, and we continue to look at that. And frankly, I think this quarter, we still had upgrades exceeding downgrades.\n\nIf you look at NPLs and reservable criticize, they both went down this quarter again. And so, you know, we're seeing improvement in the credit book, even though all of the parade of horribles that you sort of alluded to. And it wouldn't take a perspicacious person to read -- to see that because it's in the paper every day. But right now, the credit continues to improve.\n\nBut it's what we did in the last 12 years, 13 years of this in good stead as we head into the second --\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nThanks, Brian. I appreciate it.\n\nOperator\n\nOur next question comes from John McDonald with Autonomous Research. Your line is open.\n\nBrian Moynihan -- Chief Executive Officer\n\nHi, John.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nGood morning. Thanks. I wanted to ask about the assumptions and maybe just your outlook around loan growth and what you're seeing in the economy, what you expect from loan growth. You mentioned modest.\n\nAnd then also, Alastair, just the pace of deposit mix shift and betas that you're kind of building into your outlook would be helpful. Thanks.\n\nAlastair Borthwick -- Chief Financial Officer\n\nWell, on the loan side, I'd say, you know, we talked about it at the beginning of the year that we thought loans would be high single digits. And we've slightly outperformed that, obviously. This quarter was a little bit of a 90-day reset for us in some ways. You didn't see that so much in consumer because the card growth just came through.\n\nIn commercial, certainly, we probably held that back just a touch. So, we think we'll resume that sort of high single digit maybe if things begin to slow a little bit. So we've got that in our forecast. We sort of resume the path that we've been on.\n\nWith respect to deposits, I'd say on betas, obviously, we're just increasing those because we've got to be competitive in this environment. And around balances, I think there's a sense that the industry will be flattish, maybe down. We think we're going to outperform the industry average just slightly. So, that's what's largely baked into our assumptions at this stage.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nAnd in terms of funding that gap between the loan growth and flattish deposits, securities came down a fair amount this quarter. Can you continue to run down the securities portfolio? And what kind of volume do you get from cash flows off the book there?\n\nAlastair Borthwick -- Chief Financial Officer\n\nYeah. So, the securities portfolio runs off at about 15 billion a quarter. It was a little more this quarter because we actually had an opportunity to sell some securities that offset some gains, some losses, and freed up some RWAs. So, we took advantage of that this quarter.\n\nAnd so, the securities number this particular quarter was a little larger. But I think on an ongoing basis, John, you should assume that we've got 15 billion that just comes in. And then broadly, we've got, you know, 175 billion of cash at the Central Bank. And we've got another couple of hundred billion of stuff that's mostly treasury swap to floating.\n\nSo, we've got lots of ways to pay for loans growth in the future.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nOK. Thank you. If I could just clarify the discussion with Erika around expenses. The 61 billion this year includes the litigation.\n\nDid you say next year you're kind of targeting low single-digit expense growth, would you say, positive operating leverage?\n\nBrian Moynihan -- Chief Executive Officer\n\nI think we said that, yeah, they closed the litigation. And the next year, we said, basically -- this year, they close the litigation. And next year, we said, at some point, we'll get back to the 1% to 2% rise. We'll just have to see how some of the ins and outs play in terms of some of the stuff running off this year still left over from [Inaudible].\n\nBut look at the 15.3 for three quarters in a row. You know, honestly, each quarter has had a little bit of something in it, John. If you think about it, the first quarter would have the, you know, FICA and that type of stuff, and the second quarter had that regulatory seven circled after litigation. So, we're bouncing around low 15s, and we expect that run rate to kind of hold.\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nWe'll go next to Mike Mayo with Wells Fargo. Your line is open.\n\nBrian Moynihan -- Chief Executive Officer\n\nGood morning, Mike.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nHi. I'd like a little bit more details on how you add employees and resources for the additional revenues. From the second quarter to third quarter, your profit margin on the new revenues was 100%. I mean, revenue is up 2 billion, expenses up zero.\n\nClearly, that's not sustainable. But I would like you to, if you can, tie that in to Slide 22, more digital users and Zelle; Erika, 1 billion interactions. Your headcount is not growing a whole lot. You know, how long can you keep that going? And, you know, theoretically all this digitization over the past few years equates to like how many employees or how much in expenses or what's a terminal efficiency level relative to the past.\n\nBrian Moynihan -- Chief Executive Officer\n\nSo, I think, Mike, that's a lot of questions, but I'll try to sort it out a little bit starting with the last. There is no terminal efficiency ratio. Our idea is when you work on expansion, you're not working on the ratio. It ends up in a ratio.\n\nWe work on the actual dollar spent. And so, we can keep working on investing heavily to drive that. And the digitization of all the operational process in the company is what you see on Slide 22 on the consumer side. And you see it in the other slides on some of the wealth management commercial operations, still a lot of paper, and the GTS business that we continue to take out.\n\nSo, you know, that's what we're trying to do. But interesting enough, what's driving the near-term growth and employees has there's obviously financial advisor growth. You saw the 400 this quarter that's investing in the training programs and hiring some people into the offices, especially outside our footprint, to get them growing again. There's investment in, you know, commercial bankers.\n\nThose are not huge numbers. A big investment is in the GCIB platform over the last year, I think, a thousand teammates the last couple of years. And so those investments come in. But also, you know, we're investing to drive the operational excellence platform and actually ensuring that we've got great customer service dealing with all of the things that are going on.\n\nBut a major part of it, frankly, is getting -- even though we have less branches year over year, less numbers of units, we have more people in them because we continue to build out the relationship manager capabilities and branches. As you said on Page 22, the work goes out of the branches from the day-to-day, you know, sort of service things. We're putting more and more in the relationship management, and that's why you see 400,000-plus net new checking households this quarter, which is a record for us going back to pre-financial crisis. We don't know how far back it is.\n\nAnd if you look at, you know, small business, originations are going up. If you look at merchant services sales, which, you know, that was an investment in salesforce there and investments. So, it's just a combination of driving that. And the continued digitization allows us to continue to be efficient and effective, and, frankly, plowed the money, saved back into marketing, back into more technology to make us even more effective, and then in the people where we need them.\n\nBut, you know, Tom Scrivener that runs up our operations group sees a lot of stuff ahead of me can take out, and Bruce Thompson of the credit operations platform across all the businesses, a lot they can take out of our time, and we just go work on it.\n\nAlastair Borthwick -- Chief Financial Officer\n\nMike, I think it's -- we don't necessarily translate it into that sort of idea of how many more people this digital thing, you know, replace or productivity metrics. But if you look at by different line of business, if you just take consumer for a moment, it's 50% of our consumer sales now are taking place digitally, you can almost think about that being the equivalent of 4,000 more financial centers. And it turns out, if you get 35 million people banking in their pocket with a mobile phone, makes a big difference.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nAnd then just a quick follow-up then. So, Brian, you said before, the NII benefits would come barreling through to the benefit of investors. That was the case this quarter. Do you expect that to continue to be the case over the next year?\n\nBrian Moynihan -- Chief Executive Officer\n\nYes, we -- that's -- we said it last quarter, and I hope I proved it through there to what you asked about last quarter.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nAll right. Thank you.\n\nBrian Moynihan -- Chief Executive Officer\n\nOne of the things, Mike, you know, to think about is if you go back and look at the consumer page in the deck, you'll see, you know, the cost of deposits, which is the overall cost of all the stuff against deposits basis, continues to, you know, basically 100 to 120 basis points, which is down from 300 basis points, you know, 15 years ago. And that is extremely leverageable. And by the way, you know, the profit margins once back up to 30% and driving through. So, you know, we're letting that NII pore through, which then drives those numbers up.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nOne quick follow-up. I asked it for someone else and said they didn't really know. The consumer deposit betas are outperforming for you and for some others. Why is that outperforming now? And do you think that's going to last?\n\nBrian Moynihan -- Chief Executive Officer\n\nThe consumer, if you go to the page on the slide, there's only one -- there's a distinguishing fact that goes on in consumer that in -- that our company and generally, which really drives out the tremendous value proposition we have to be the core transaction, core relationship, a bank for our customers. And if you look at Page 10, you can see that the interest checking noninterest bearing accounts, you know, the dollar value of deposit as a total percentage deposits are a very high percentage. And that's what we focus on. And that allows you -- you know, those are zero or very low rates because the amount of services that are coming out of that access to 3,900 branches, to the call centers, to the digital platform, to the ability to, you know, Zelle payments, etc., etc.\n\nAnd that's what drives it. So, it's a -- the beta is a product of the mix more than it is a product of any pricing strategy because zero-based -- zero-interest -- noninterest-bearing checking are zero in any rate environment.\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nOur next question comes from Matt O'Connor with Deutsche Bank. Your line is open.\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nGood morning. The capital build was obviously faster than expected or at least what most of us have expected. And it doesn't really seem like there was much revenue drag from that. But can you kind of flip the script here and lean into certain businesses? And I guess I'm thinking, you know, if you look globally, there's some peers that are moving to build capital, so maybe there is some opportunity for further share gains in areas like markets and global banking.\n\nBrian Moynihan -- Chief Executive Officer\n\nYeah. Yeah. Look, we're in a good position on capital, even after, you know, the increased stress capital buffer results, which, you know, surprised our industry and our company. And we appealed that, as you well know and didn't get released.\n\nBut we hope it's looked at in the future. But the capital improvement, you know, really didn't take much of revenue hit. Honestly, the only place we had to hold -- you know, just be careful on, you know, loan production in the high-end businesses, i.e., GCIB. Other than that, the markets business has an allocation of the size of balance sheet in capital and RWA, which, you know, basically, you know, they were able to achieve all the results and not even use it enough.\n\nAnd, you know, Jimmy DeMare and the team do a great job there. The rest of it -- everything else was there was no real change. And frankly, where we are now, those changes are -- you know, that that tapping has gone for this quarter already. And we're off doing we should do.\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nAnd then separately, just a little nerdy modeling question. As we think about the timing of the tax credits being pushed out, driving the tax rate slightly higher, is there an offset in that all other fee line that I think is viewed in tandem with the tax rate and, you know, [Inaudible].\n\nAlastair Borthwick -- Chief Financial Officer\n\nYeah. So, I would think about it this way. The effective tax rate for Q3 and Q4 likely a little bit higher than our original guide of 10 to 12. But for the full year, it should end up right around that 12% mark.\n\nAnd then, you know, I'd say, this year, you're right, in the fourth quarter in all other, we have to take into account the fact that the ESG deals and their timing. So, I think for your model, Matt, I would use 700 million of an after-tax loss for the fourth quarter as the most likely. And I'm talking all other now. And if you're asking me with respect to the consolidated other income, then I'd use something very similar to the fourth quarter of 2021, where we had an $800 million pre-tax loss.\n\nSo, I'll just use that there. OK?\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nOK. And that's the high watermark of the year, right?\n\nAlastair Borthwick -- Chief Financial Officer\n\nYeah. It's just the seasonal nature of these ESG deals and their installation, generally.\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Ken Usdin with Jefferies. Your line is open.\n\nKen Usdin -- Jefferies -- Analyst\n\nThanks. Good morning. Just another -- just a question or two on fees. Can you just walk us through some of the deltas and the service charges line? Just talk about -- I know you had mentioned both the overdraft run ratings, deposit changes, and CCR.\n\nJust how much of that, you know, is embedded by now? And what should we look for going forward from those areas? Thanks.\n\nAlastair Borthwick -- Chief Financial Officer\n\nYeah. So, Ken, I think, with respect to card, you know, kind of flattish as I would think about it right now, a little bit of fourth quarter seasonality maybe that should benefit there. Service charges, most importantly on the consumer side, all the NSFOD, we're now at a steady state run rate. So, that won't be hurting us again in, you know, from this point forward.\n\nThe commercial part, you're right to highlight. Look, the commercial business, the GTS business is adding clients. We're doing more with clients. So, that's adding gross fees.\n\nMany of the clients prefer that earnings credit adjustment as the way that they essentially, you know, pay interest, receive interest, and then pay fees. So, that came down probably 150 million this quarter. I think you should expect that to come down again next quarter just with the way rates are going. And then, you know, the other fees are probably pretty straightforward.\n\nWealth will be all about market levels with a one-month lag based on where the markets are. Investment banking, kind of flattish, I would think. Maybe hoping for a little bit of positive at some point but not necessarily this quarter. And then sales and trading, your guess is as good as ours.\n\nBut we generally point to the sort of 15% seasonality in Q4 compared to Q3. And, you know, we're coming off obviously a pretty good period.\n\nBrian Moynihan -- Chief Executive Officer\n\nYou know, let me -- Ken, one of the things that I think -- it goes a little bit to Mike's point, a little bit to some of their points, is that about 80-odd percent if I got -- I think it's 84, if I got it right, of the interchange goes back to the customer base in terms of rewards products, either directly through our own rewards programs, or through some of the affinity group programs. So, you know, obviously, as charges go up, you know, a fair amount of that goes back. Now, what does that produce in value? It produces incredible value. So, a lot of that in our preferred rewards fee structure, which -- the rewards structure, which goes across all products in our company, you k now, if you even just look at the preferred segment and why deposit pricing and the stability of our accounts is different than peers did last cycle, mostly what happens this time, is that, you know, that reward structure cements a customer relationship.\n\nAnd so, that then has a 99% retention rate, plus of those preferred customers that have about 80% of all the deposits are in consumer segment. And, you know, they are very stable, important customer base, as all of our customer bases are. So, you have to think through on those fees. You know, we're effectively investing those fees and the duration of the customer base, the length of customer base, the profitability of the customer base, the stability of the customer base, and the fact that then we can produce a lot more customers because we're not having to replace a run-off.\n\nAnd so, as you see so many fee lines staying with NSFOD by doing what we've done, the attrition rate has obviously dropped to the floor. And you see more production of that accounts there. And these are all related to total revenue per customer, profit per customer, as opposed to any individual decision.\n\nKen Usdin -- Jefferies -- Analyst\n\nGreat. Thanks for all that color. Just one separate question on -- you know, you mentioned that as credit continues to improve, and you're seeing some underlying, can you just walk us through just to remind us just where you are in terms of your scenarios from a seasonal perspective? And, you know, if the economy does, in fact, change, you know, how weighted are you already to an already worsening scenario?\n\nAlastair Borthwick -- Chief Financial Officer\n\nYeah. So, this quarter, very similar to last quarter, we use blue chip consensus as our baseline. Talking to 50 different economists, some of whom are in the middle, some of whom are pessimistic themselves, some of them are more optimistic. That's 60%.\n\nThat's the baseline. The other 40% is downside scenarios that we built. And there, that's the weighting that we're applying. And in this particular quarter, just to give you an idea, Ken, once again, we increased our forecast for inflation in that scenario.\n\nWe increased unemployment in that scenario, and we decreased GDP through the course of the next couple of years. So, all of that -- you know, that's a few quarters now in a row where that pattern is continuing. And we did it again this quarter. And we'll just keep adjusting that over time based on the macroeconomic situation as it develops over time.\n\nBrian Moynihan -- Chief Executive Officer\n\nJust, Alastair, just to give a sense of -- you know, it's a 5% unemployment like now and then continues all the way through next year. So, there's an inherent conservatism built into that reserving level. That -- our reserves scenario is 60/40 and has those kinds of -- those kinds of statistics around -- so whether it has inflation. But more importantly, it's based on that kind of unemployment level, which is 150 basis points over where we are in October.\n\nSo, it would be pretty quick to move to the five at the end of the year.\n\nKen Usdin -- Jefferies -- Analyst\n\nGreat. Thank you very much.\n\nAlastair Borthwick -- Chief Financial Officer\n\nIt moves -- it moves even higher than that next year, just to give you an idea. It's sort of in the mid-fives, just to give you a general sense.\n\nKen Usdin -- Jefferies -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nWe'll go next to Vivek Juneja with J.P. Morgan. Your line is open.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks. Just a couple of questions, Brian and Alastair. Hung loan marks, a quick one, how much were those in the third quarter?\n\nAlastair Borthwick -- Chief Financial Officer\n\nSo, we didn't call that the out just for the simple reason it was smaller this quarter. We run those through the P&L every week, as you know. So, the results that you see in global markets and investment banking did include them last quarter. We called it out last quarter, but it was just bigger.\n\nThis quarter, we didn't feel that we needed to.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nOK. Brian, you talked about tech spending up, if I caught it correctly, 15% in '23. Is that right? And if so, what's the dollar amount of tech spend that you're expecting in either this year or next year?\n\nBrian Moynihan -- Chief Executive Officer\n\nThis year, we're at three, three. Next year, we move up 15%, three, four, or something like that.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nOK. This is for the new -- new business -- new product development type of setup.\n\nBrian Moynihan -- Chief Executive Officer\n\nYeah. Other people talk about the overall numbers, like 10 billion, for the platform. And the -- all their -- so this is purely new code. Yeah.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nYeah. Got it. And for both of you, what are you expecting as the impact of Q3 on deposits? What are you modeling in?\n\nAlastair Borthwick -- Chief Financial Officer\n\nWell, we're obviously modeling in probably the same thing you are. We're going to have to price competitively for deposits in an environment where obviously market-based. Expectations are changing every day. So, we're anticipating it's going to be a little bit tougher from this point forward, but that's already baked into our NII.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nI guess, to get more precise assessments, you have better resources and better data than we do. What beta -- where do you expect betas to get to?\n\nAlastair Borthwick -- Chief Financial Officer\n\nWell, that's going to differ by customer base. And I don't want to get into this on this call just because it's competitively important for us, obviously. But you can assume that at the higher end of wealth, for example, I shared that we're passing through most of that at this stage. That's going to be very different versus our noninterest-bearing accounts.\n\nIt will be different for operational versus nonoperational and commercial. So, betas should be in quite different places, but I'm anticipating that they'll just continue to drift up over time.\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nThanks.\n\nOperator\n\nWe'll go next to Betsy Graseck with Morgan Stanley. Your line is open.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nHi. Just a couple of questions. One is on how we think about comp going into next year. We've got this inflation rate that's obviously seems higher for longer.\n\nAnd while we expect it comes down over the next 12 months, you're going into the year with a pretty high level and Social Security is even going up like 8%, as we all know. So, wondering how you think about that. You've done a great job at, you know, being on the front foot with regard to minimum wage increases in your shop. So, should we expect more of that to come into next year's expense guide as well?\n\nBrian Moynihan -- Chief Executive Officer\n\nWe are -- you know, the last several months, we've done the fifth share our success program. We did our usual merit. We did a three, five, and seven merit increase for everybody under $100,000 in compensation based on years of service. We -- we accelerated $22 starting wage, which is $48,000 a year now.\n\nAnd, you know, we'll continue those patterns. And the good news is we're seeing the attrition rate start to move back. It was 12%, drop to 6%, move back up to 15%-ish, and has now dropped down to low 14%. And each month, it starts to drop even more.\n\nSo, we -- we feel that we've got the right mix. And, you know, we all look at benefits continuously. We continue to -- you know, it didn't vary any benefits during -- but we looked -- increased our child care benefit to $275 per month per child, increased our tuition reimbursement and did it in advance. And so, it's a -- it's a complex package.\n\nBut, you know, we should -- we've been able to absorb all that and keep expenses bounce along at 15.3 a quarter for the last three or four quarters. And we'll continue to do that. And that's where it comes down to also using the technology investments and operational excellence investments to continue to reduce the aggregate number of people we have working and -- and -- and pay those talent teammates we have even more what they worked.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nOK. So, expectation for that to persist, meaning flat expenses year on year as we go into '23.\n\nBrian Moynihan -- Chief Executive Officer\n\nYeah. We've said that we've started growing in the 1% to 2% category. And that's, you know, part of these types of inflationary things that you're mentioning which are higher now and then working it down over time. And so, right now, we're running in the low 15 per quarter, you know, 15.3.\n\nAnd we expect it to maintain and grow. But most of that growth does come, as you're saying, into the compensation, and it ebbs and flows where it goes on a given -- you know, when the markets are driving more investment banking markets and wealth management. And, you know, those come down a little bit. And the other compensation comes up as we've changed up base pay and things like that.\n\nBut it's just -- it's, you know, 214,000 people. It's a very complex discussion all over the world. So, there's no one answer for the whole team.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nYeah, I get that. OK. Thanks. That's helpful color.\n\nJust one other one, Alastair. You mentioned the securities roll-off that you've been able to, you know, mix shift toward a higher yield over time. Can you give us a sense as to what kind of pull-apart we should be thinking about for the model on the AOCI hits that you've had to take? You know, how many quarters or a year should we be thinking that gets erased over?\n\nAlastair Borthwick -- Chief Financial Officer\n\nSo, I'd say on the treasuries, generally speaking, you just think about the duration there being somewhere between four and five years. And on the mortgages, it's probably seven to eight. So, it takes a while to pull it apart. And then, there'll be some derivatives as well.\n\nAnd I think the team can probably help you model at some point. But those are those are, broadly speaking, about the numbers I would use.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nOK. Thank you.\n\nAlastair Borthwick -- Chief Financial Officer\n\nObviously, it'll be faster for any securities that repay in the meantime.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nRight. Yeah. Got it. Thanks.\n\nOperator\n\nWe'll take our next question from Gerard Cassidy with RBC. Your line is open.\n\nBrian Moynihan -- Chief Executive Officer\n\nGood morning, Gerard.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nHi, Brian. Hi, Alister. Alister, you touched on there is, you know, some early stage delinquencies in the consumer book and not so much with the hurricane. But can you give us any color -- and your numbers obviously are very strong.\n\nBut can you give us some color of what you're seeing there? Is it a lower FICO score customer? Anything you can read into it?\n\nBrian Moynihan -- Chief Executive Officer\n\nYou know, there is one thing, Gerard, you have to be careful of. Because, obviously, when the person doesn't pay you, the FICO is going down de facto. So, the origination statistics we put in the back of the deck there are very strong, remained strong. And what we're seeing is, you know, I gave you the five-year averages, which are still far exceed where we are today.\n\nWe're still lower pre-pandemic. So, even though we're taking back up, the word \"normalization,\" you know, I ask people to be careful because we're moving back to what was all-time lows, and we're not even there. So, I think if you look in the auto business, you know, the number of repossessions and stuff is down a half on a monthly basis. So, we build -- on a responsive growth, we build a book and a consumer side that we knew would be durable through different modeled outcomes, which is what we do in the stress testing and what we do in the preserve setting process and stuff, but also through actual outcomes.\n\nAnd what you're seeing is it's weathering, you know, any notion of issues in the economy well now. And then in the commercial book, as we said, you know, we still see upgrades exceeding downgrades. The simple way to think about it is I think we are -- that through the P&L provision cost with flab reserved build, pre-pandemic was basically, you know, $1 billion a quarter. We're running around that number now.\n\nAnd that -- that's building $400 million of reserves. It's a little different constitution. And that means, unless charge-offs take up, you're going to see the reserve build start to mitigate because sort of we're sitting there a pretty conservative scenario now. And it'll depend on that as we look forward.\n\nBut, you know, the baseline is now baking in effectively a recession based on the blue chip.\n\nAlastair Borthwick -- Chief Financial Officer\n\nGerard, I think, too, if you -- if you went back through our supplement over the course of the past 10 years, you're going to find these numbers are so low. We're squinting to see a change here, and it's coming off of really historically extraordinary numbers. So, is there a little bit of movement? Yes. But is it the second best of all time? Yes.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nVery good. Very good color. Can I follow up on the provision, Brian, you just mentioned about, you know, the billion dollars in the past. If you took that worst -- you know, you guys, I think, said 60/40 in terms of your reserve build in terms of the base case on the economy versus a really difficult economy.\n\nIf that really difficult economy went to 100%, what type of provision on a quarterly basis would that push up to?\n\nBrian Moynihan -- Chief Executive Officer\n\nYou know, I think we have -- but remember that -- I'd be careful about that because basically, the baseline now has built into it, you know, fairly weak, you know, for path in the near term. And so, you know, I wouldn't speculate exactly the numbers. But if you saw -- you know, we built a bunch of reserves with a 15% unemployment and projection, and that was going to go longer like it was in the pandemic. And you saw us move up.\n\nBut we're sitting closer to what we call CECL day one and pandemic, you know, implementation. You can see some of that in the stress test. So, you know, we don't really speculate on that. But we have on stress test to test it to make sure.\n\nAnd you can see the Fed stress test and the adverse case, you can see the numbers, frankly, which I don't think would ever materialize, given if what you do in the period of time between then and there, but that gives you some sense if you look us up.\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nVery good. Appreciate the color. Thank you.\n\nOperator\n\nWe'll take our final question today from Charles Peabody with Portales. Your line is open.\n\nCharles Peabody -- Portales Partners -- Analyst\n\nYeah. Most of my questions were asked already. But I'm just curious if you had any thoughts about how the Basel III end game might play out in the timing of implementation of that. Any general thoughts or color?\n\nAlastair Borthwick -- Chief Financial Officer\n\nNo particular updates at this point. Obviously, we're waiting along with everybody else. And once we get the rules, Charles, we'll sit down, and we'll start working through our own capital base. But obviously, as Brian pointed out earlier, just the fact that we've put ourselves in a position where already we're ahead of where we need to be in January of 2024, we've got a lot of flexibility at this point for whatever the end game it does come up with.\n\nCharles Peabody -- Portales Partners -- Analyst\n\nThank you.\n\nBrian Moynihan -- Chief Executive Officer\n\nOK. Well, thank you for all your questions and your attention. Let me just summarize for the third quarter 2022, you saw responsible growth in action once again. We had organic growth in all businesses.\n\nWe had top-line revenue growth driven by the NII increases. We had strong expense control, flat expenses for the third straight quarter, operating leverage for the first straight quarter. And good work on that. We had good risk management.\n\nYou can see that we're still running strong risk parameters. And we built the capital to the end state 1,124 levels that we need. So, that's what we call responsible growth. And now, you're seeing it in action.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLee McEntire -- Senior Vice President, Investor Relations\n\nBrian Moynihan -- Chief Executive Officer\n\nAlastair Borthwick -- Chief Financial Officer\n\nJim Mitchell -- Seaport Global Securities -- Analyst\n\nErika Najarian -- UBS -- Analyst\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nJohn McDonald -- Autonomous Research -- Analyst\n\nMike Mayo -- Wells Fargo Securities -- Analyst\n\nMatt O'Connor -- Deutsche Bank -- Analyst\n\nKen Usdin -- Jefferies -- Analyst\n\nVivek Juneja -- JPMorgan Chase and Company -- Analyst\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nGerard Cassidy -- RBC Capital Markets -- Analyst\n\nCharles Peabody -- Portales Partners -- Analyst\n\nMore BAC analysis\n\nAll earnings call transcripts"
}