{
  "companyName": "Cigna",
  "companyTicker": "CI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/cigna-ci-q3-2022-earnings-call-transcript/",
  "content": "Cigna (CI 0.19%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by Cigna's third quarter 2022 results review. [Operator instructions] As a reminder, ladies and gentlemen, this conference including the Q&A session is being recorded. We'll begin by turning the conference over to Mr. Ralph Giacobbe.\n\nPlease go ahead, Mr. Giacobbe.\n\nRalph Giacobbe -- Vice President, Investor Relations\n\nGreat. Thanks. Good morning, everyone, and thank you for joining today's call. I'm Ralph Giacobbe, senior vice president of investor relations.\n\nWith me on the line this morning are David Cordani, Cigna's chairman and chief executive officer; and Brian Evanko, Cigna's chief financial officer. In our remarks today, David and Brian will cover a number of topics, including Cigna's third quarter 2022 financial results as well as an update on our financial outlook for 2022. As noted in our earnings release, when describing our financial results, Cigna uses certain financial measures, adjusted income from operations and adjusted revenues, which are not determined in accordance with accounting principles generally accepted in the United States, otherwise known as GAAP. A reconciliation of these measures to the most directly comparable GAAP measures, shareholders net income and total revenues, respectively, is contained in today's earnings release, which is posted in the Investor Relations section of cigna.com.\n\nWe use the term labeled adjusted income from operations and adjusted earnings per share on the same basis as our principal measures of financial performance. In our remarks today, we will be making some forward-looking statements, including statements regarding our outlook for 2022 and future performance. These statements are subject to risks and uncertainties that could cause actual results to differ materially from our current expectations. A description of these risks and uncertainties is contained in the cautionary note to today's earnings release and in our most recent report filed with the SEC.\n\nBefore turning the call over to David, I will cover a few items pertaining to our financial results and disclosures. Regarding our results, in the third quarter, we recorded after-tax special item charges of $23 million or $0.07 per share for integration and transaction-related costs. We also recorded an after-tax special item benefit of $1.4 billion or $4.52 per share associated with the sale of our international life accident and supplemental businesses to Chubb. As described in today's earnings release, special items are excluded from adjusted income from operations and adjusted revenues in our discussion of financial results.\n\nAdditionally, please note that when we make prospective comments regarding financial performance, including our full year 2022 outlook, we will do so on a basis that includes the potential impact of future share repurchases and anticipated 2022 dividends. With that, I'll turn the call over to David.\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nThanks, Ralph. Good morning, everyone, and thank you for joining today's call. Our team is performing well in a dynamic environment, and we delivered another strong quarter of revenue, earnings, and cash flows. I'm going to spend a few minutes highlighting key drivers of our results in the third quarter and while we are once again raising our 2022 full-year outlook for adjusted earnings per share as well as for growth in medical customers and enterprise revenues.\n\nThen I'll address how we continue to expand and enhance our capabilities for the evolving market needs, and I'll also provide some initial perspective relative to 2023. Brian will share more details about our third-quarter results and our outlook for the rest of the year. Then we'll take your questions. With that, let's get started.\n\nDuring the third quarter, we delivered results that were better than our expectations, including total revenues of $45.3 billion, and adjusted earnings per share of $6.04. We continued building out our momentum this year, and we are confident we will deliver on our increased full year 2022 adjusted EPS guidance of at least $23.10. We also expect to continue advancing our capital deployment strategy, including investing in our business to drive innovation and growth and repurchasing at least $7 billion of our shares this year, all while paying a meaningful dividend. Our performance in the quarter reinforces the impact of our sustained commitment to service and innovation, our progress in retaining clients and expanding relationships with additional services as well as winning new business.\n\nEvernorth, our health service platform performed well again with solid top line and bottom-line results driven by our market-leading innovation and affordability across our pharmacy benefit services, specialty pharmacy and Evernorth Care Solutions. Cigna Healthcare, our benefits portfolio also was key to continuing our momentum in the quarter. Our U.S. commercial business is having a very good year with solid client retention levels and new business wins, particularly in the middle market and select segments, leading us to once again raise our full-year outlook for medical customers.\n\nOur medical care ratio for Cigna Healthcare was better than expectations at 80.8% in the third quarter demonstrating the effectiveness of our affordability initiatives and targeted pricing actions. Overall, we're very pleased with the third quarter results. Now I'll take a few minutes to walk through how we are well-positioned going forward with Evernorth and Cigna Healthcare. Within both platforms, we have differentiated businesses and a clear, durable three-part growth framework.\n\nFirst, through our foundational businesses, including our pharmacy benefit services, U.S. commercial and international health businesses. With these mature-scale businesses, we established core relationships with corporate clients, health plans, and governmental entities. Our capital-efficient operating models will further support steady growth as well as strategic and financial flexibility for our company.\n\nAs we look ahead for these businesses, in 2023, pharmacy benefit services, we're expecting another year of high client retention levels complemented with new business wins. We're also very pleased with our solid start to the selling season for 2024, including our new multiyear agreement for Express Scripts to be the pharmacy benefits and specialty services provider for Centene. Working with Centene, we will make prescription drugs more affordable and accessible for approximately 20 million Centene members. The strategic collaboration with Centene builds on Express Scripts' track record as a partner of choice and will present growth opportunities to provide additional Evernorth Health services over time.\n\nWe continue showing how we have a unique ability to partner across the healthcare landscape, expanding our reach and impact to more customers and patients, and with this new health plan relationship, we are building on our previous collaborations such as Prime Therapeutics, Oscar and Kaiser Permanente. For U.S. commercial, we are driving strong customer growth with wins throughout 2022, and enabled by our consultative sales approach and our affordability gains, enhancing more competitiveness in more geographies, all while maintaining ongoing pricing discipline. The sales and net growth in our National Accounts segment are solid and outpaced prior year results, and we are confident this momentum carries into 2023.\n\nAnd in international health, we are sharpening our healthcare focus for targeted growth opportunities in serving individuals, employers seeking healthy and productive employees and governmental entities that value our care management programs. We have momentum this year in customer growth, revenue and earnings and expect to sustain these results and performance throughout 2023. The second way we drive growth is through our Accelerate businesses, which include Accredo Specialty Pharmacy, Evernorth Care Services and our U.S. government business.\n\nThese businesses have outsized opportunities to grow with compelling secular tailwinds and as well as differentiated capabilities that benefit our clients and customers. Looking forward for our Accelerate businesses, we continue to be excited about the value creation opportunities in specialty pharmaceuticals, including biosimilars over the next several years. With our leading capabilities and expertise, we expanded our relationship to be the exclusive specialty pharmacy provider for the Department of Defense starting in 2023. This is further reinforcement to how we fuel sustained long-term growth in Evernorth by improving clinical quality for the benefit of patients and achieving significant savings for our clients.\n\nIn Evernorth Care Services, we are advancing our care management and delivery strategies. One area of focus is enhancing virtual care that strengthens relationships between patients and their physicians to better anticipate health issues and intervene earlier. For example, with MDLIVE, we are providing better experiences and improved affordability with personalized care that is more convenient and effective in directing patients to the most appropriate care settings. When a person -- when in-person care is needed, MDLIVE successfully guide patients to urgent care facilities or other alternative sites to care, decreasing avoidable emergency room visits by at least 10%.\n\nWe intend to further build on this progress by enhancing our virtual primary care offerings for patients with chronic conditions by providing continuous engagement with their physician, remote monitoring with connected devices and real-time interventions between appointments. In U.S. government, we are continuing to make investments, positioning us to grow in 2023 and beyond. We are strengthening this business by building on our high-quality affordable Medicare Advantage benefits we offer with geographic and network expansion as well as further product enhancements.\n\nFinally, the third way we drive growth is through a cross-enterprise leverage. Here, we harness capabilities across our company to accelerate innovation and have a greater impact than any individual could have on its own. Our opportunities here are driven in part by a rich longitudinal data and information we have to accelerate the development of new, more effective solutions for our clients and customers. Our Pathwell programs are a good example.\n\nWith Pathwell Specialty, we're working across the medical and pharmacy benefits to reduce the cost of specialty infusions and injectables. In our Pathwell Bone and Joint program, we harness Evernorth digital navigation and advanced predictive analytical capabilities to reduce unnecessary musculoskeletal surgeries and provide better-coordinated care. There is a significant addressable market for these programs as 50% of adults suffer from bone, joint, and muscle conditions, and these are major drivers to U.S. healthcare costs.\n\nAdditionally, we continue to take an enterprise view of our client relationships and successfully broaden and deepen them with our overall suite of capabilities. This has supported a number of attractive wins and a good example is a very large new fee-based relationship for 2023 in our U.S. commercial team that has secured this offering by bringing a solution to a long-standing Express Scripts client. With our Evernorth and Cigna Healthcare platforms and our growth framework, we anticipate driving another year of earnings, customer, and revenue growth in 2023.\n\nWe will provide detailed guidance as we always do on our fourth-quarter earnings call. Having said that, I'll provide a view of some of the tailwinds and headwinds we see for 2023, which are largely consistent with the points we highlighted at our Investor Day in June. With a strong selling season, we anticipate a tailwind of continued growth across both our Evernorth and Cigna Healthcare platforms. We expect additional margin improvement in Cigna Healthcare and with our leading position in the rapidly growing specialty pharmaceuticals market will begin capturing value from biosimilars.\n\nRelative to anticipated headwinds, we will make meaningful strategic investments in our accelerated growth businesses. We will have additional costs as well as we prepare to support renewed and expanded relationships with the Department of Defense and Prime Therapeutics. And a new development since Investor Day is our exciting strategic win with Centene, which will create a 1-year headwind as we onboard this new partner. Putting all that together, we anticipate that these tailwinds and headwinds will largely balance themselves off next year with the exception of our Centene headwind, which represents incremental cost for us in 2023.\n\nNow I'll briefly summarize. Overall, our strong performance in the quarter and throughout the year shows how we are addressing the most pressing needs of our customers and clients and growing our business. We're investing in innovation to enhance our capabilities for future growth and continue delivering for all of our stakeholders. We're confident we remain on track for our full year 2022 commitments, including our increased adjusted EPS guidance for this year of at least $23.10.\n\nAnd with that, I'll turn the call over to Brian.\n\nBrian Evanko -- Chief Financial Officer\n\nThank you, David, and good morning, everyone. Today, I'll review key aspects of Cigna's third quarter 2022 results, and I'll discuss our updated outlook for the full year. We're proud of another strong quarter and are pleased to drive continued momentum from the first half of 2022, with third-quarter adjusted earnings per share exceeding our expectations. With that, we are again increasing our full-year adjusted 2022 earnings outlook to at least $23.10 per share, representing growth of 13% of our reported full year 2021 adjusted EPS.\n\nLooking at the quarter specifically, key consolidated financial highlights include total revenues of $45.3 billion, after-tax adjusted earnings of $1.9 billion and adjusted earnings per share of $6.04. Regarding our segments, I'll first comment on Evernorth. We are pleased with the continued profitable growth in Evernorth, with our client-centric approach, deep pharmacy expertise and strong track record of service continues to resonate with new and existing clients. One good example of this is our recently announced partnership with Centene that will deliver greater prescription drug affordability and access for their approximately 20 million customers starting in January of 2024.\n\nThis mutually beneficial partnership will bring significant revenue and will be financially accretive over the course of the multiyear contract term. Turning to third-quarter results for Evernorth. Revenues grew 6% over third quarter 2021 to $35.7 billion, and pre-tax adjusted earnings were $1.6 billion. Evernorth's results in the quarter were driven by continued expansion of our Accelerate growth businesses led by our specialty pharmacy, as well as our focus on affordability and delivering lowest net cost solutions for our clients and customers.\n\nWe also continue to make meaningful strategic investments to both sustain and create new sources of differentiation. These include investments, which serve to deepen our client relationships and expand our services portfolio and digital capabilities. Overall, Evernorth delivered another quarter of strong results, consistent with our expectations. Turning to Cigna Healthcare.\n\nOur 2021 results presented an opportunity to expand future margins, and our team has executed extremely well and achieved both strong membership growth and improved profitability here in 2022. Third quarter 2022 performance continued this pattern as adjusted revenues were $11.2 billion, pre-tax adjusted earnings were $1.1 billion and the medical care ratio was 80.8%. Our medical care ratio was better than expectations and continues to demonstrate the impact of our affordability initiatives and pricing discipline. The favorable medical costs in the quarter were partially offset by lower net investment income.\n\nTurning to medical customers. We ended the quarter with 18 million total medical customers, growth of 873,000 customers or 5% year to date. We continue to drive strong customer and client growth in our U.S. commercial and international health businesses.\n\nOverall, Cigna Healthcare results reflect continued execution against our commitment to increasing both customer relationships and profit margins in 2022. For corporate and other operations, the third quarter 2022 pre-tax adjusted loss was $299 million. As a reminder, this segment previously included our earnings contributions from the international life, accident and supplemental benefits businesses that we divested to Chubb on July 1, 2022. Overall, we delivered strong third-quarter financial results that exceeded our expectations, continuing our momentum with contributions across our foundational and accelerated growth businesses.\n\nNow turning to our outlook for full year 2022. We have positioned the enterprise for continued strong performance in these dynamic times. As demonstrated by our strong year-to-date results and heightened reinvestment into our business. With that said, we remain mindful of the current economic backdrop and utilization environment heading into the upcoming winter months.\n\nIn light of these moving pieces, we are increasing our outlook for full-year adjusted revenue and adjusted earnings per share. We now expect full year 2022 consolidated adjusted revenues of at least $179 billion, enabled by continued growth and deepening of customer and client relationships in both Evernorth and Cigna Healthcare. We are also raising our adjusted earnings per share guidance to at least $23.10 per share, representing growth of 13% over reported full year 2021 adjusted EPS. In Cigna Healthcare, we expect to continue to grow customers while expanding margins over 2021.\n\nWe are improving our expected 2022 medical care ratio outlook to 81.5% to 82.2%. We are raising our expected full year 2022 adjusted earnings to approximately $4.05 billion. And we are raising our medical customer growth expectation to approximately 900,000 customers, which reflects strong new business growth and attractive retention levels in our U.S. commercial and international health businesses.\n\nOur full year 2022 enterprise SG&A ratio is now expected to be approximately 7.3%, an increase compared to our prior guidance as we further accelerate investments into our business. Now moving to our 2022 capital management position and outlook. Year-to-date through November 3, 2022, we expect to have repurchased approximately 22 million shares of common stock for $5.8 billion, including the accelerated share repurchase agreements announced in June. We also continue to expect to deploy at least $7 billion to share repurchases for the full year 2022.\n\nAnd during the third quarter, we delivered strong cash flow from operations of $3.3 billion. We remain on track for another strong year of cash generation, providing us the fuel and flexibility for ongoing capital deployment opportunities. Our balance sheet and cash flow outlook remains strong, benefiting from our asset-light framework that drives strategic flexibility, dollar margins and attractive returns on capital. Now to recap.\n\nResults in the third quarter were above expectations, reflecting strong growth across our diversified portfolio. Evernorth continues to deliver attractive results while Cigna Healthcare continues to grow and expand both customer relationships and margins. giving us confidence we will deliver on our increased 2022 adjusted EPS guidance of at least $23.10 per share. We remain well-positioned and expect another year of customer, revenue and earnings growth in 2023.\n\nRelative to 2023, we deem the current consensus EPS to be reasonable when excluding the Centene contract win. Although consistent with our historical approach, our initial guidance would have likely started more prudently. As David mentioned, Centene implementation-related costs introduced a net new headwind for our 2023 financials. That said, we expect the two-year compounded EPS growth rate from 2022 to 2024 to be within our long-term average 10% to 13% annual range, driven by the strong earnings contribution from our broad portfolio as well as 2024 contributions from the Centene contract win, following the implementation cost impact that we will incur in 2023.\n\nWe look forward to providing you with more detailed 2023 guidance during our fourth-quarter call. And with that, we'll turn it over to the operator for the Q&A portion of the call.\n\nOperator\n\n[Operator instructions] Our first question comes from Mr. Stephen Baxter with Wells Fargo.\n\nStephen Baxter -- Wells Fargo Securities -- Analyst\n\nI just wanted to ask you -- and congratulations on the Centene contract win. I wanted to ask specifically, is it too early to have a view on what you're expecting the implementation cost to be in 2023? It sounds like you're kind of suggesting that we should potentially add that back to 2023 to kind of create a jump-off point. Is it too early to think that 2024, we'll see the contract to be financially accretive? Basically, how should we be thinking about that? Is 2024 too early to think about accretion?\n\nBrian Evanko -- Chief Financial Officer\n\nStephen, it's Brian. I appreciate the question very much. So maybe I'll give you a little bit of a flavor for the multiyear view here. So I'd be remiss if I didn't start by saying this is a huge win for the organization and a great validation of the value proposition in the Evernorth segment of our company, and in particular, the Express Scripts team did a great job partnering with our new client here.\n\nAnd we'll be laser-focused on successfully implementing the new client over the course of the next 14 months to ensure a smooth execution of their $20 million customers. And as I mentioned over the lifetime of the contract, the relationship will be accretive to our financials. But you should think of the profit margin percentage being below the book average as is typical for a contract of this size and scale. But in terms of the year-by-year pattern and how to think about that, you should think of 2023 being a headwind, as both David and I said, due to the implementation-related costs that are incurred prior to any revenue being received.\n\nWe're currently sizing that at about $200 million for the 2023 year. Given we're only a week or so into the contract award, we still have a lot of detailed planning to do to refine that. But that's our current best estimate for what 2023 implementation-related costs will look like. For 2024, we are currently expecting to be in a neutral to a small positive contribution standpoint in terms of the income.\n\nSo you can think of that 2023 headwind essentially unwinding in the 2024 financials. And then for 2025 in the subsequent years, we would expect to be at approximately run rate contribution levels on the relationship.\n\nOperator\n\nOur next question comes from Mr. A.J. Rice with Credit Suisse.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nMaybe just to ask, I know last year or coming into '22, you made a comment that you wouldn't be doing any larger deals, and I think you define that as anything north of $10 billion in acquisitions. I wonder as you think about '23 now, a lot's changed over the course of the year. You've been very active on the share repurchase front. What is your current thinking about whether you'd be open to transactions? Any comment about priorities or the pipeline and what that looks like? And then the flip side, of course, is your ongoing share repurchase activity.\n\nWhen you're giving these '23 comments, do you have any sense of where you might size share repurchase activity and all of that?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nA.J., it's David. So let me provide a couple of landing points there. First, stepping back relative to our capital priorities, our capital priorities remain consistent, which is, first and foremost, to make sure the ongoing growth of the underlying business continues to be funded properly from a capital standpoint as well as from investments in innovation. Second, to obviously service very attractive dividend; and then third, we selectively pursue all attractive and financially attractive M&A and/or return excess capital to our shareholders through share repurchase.\n\nSpecific to M&A priorities. As we discussed at our Investor Day, you can think about our M&A priorities, largely focused on our Accelerate business and within the Accelerate businesses, a bit more pinpointed within Evernorth Care in our U.S. government business. We may do tuck-ins in other aspects of our portfolio that are highly financially attractive, but the strategic accelerants would be more in the Accelerate business.\n\nTo your question relative to earlier this calendar year, we deem 2022 to be a bit unique for ourselves in that as we step into fiscal year 2022, we had the strong operating cash flow that Brian articulated earlier as well as the anticipated inflow from the divestiture of a portion of our international business at Chubb -- so those two numbers create well in excess of $10 billion that we had to steward forward. That, coupled with our view of the price of our equity at that point in time led us to create as much clarity as possible for our shareholders in '22 relative to our commitment to share repurchase that we're on track for. Looking forward, we'll maintain the capital discipline. We will be open to strategic M&A that advances us in the Accelerate businesses.\n\nAnd then the final note you asked relative to '23, as you have in the past, you just think about we will deploy capital in the way I talked about before, either in a shareholder accretive way to achieve through the shareholder share repurchase and/or through accretive M&A and our contribution to our EPS growth rate in the 3% to 5% range year in, year out from the successful capital deployment that remains intact.\n\nOperator\n\nOur next question comes from Mr. Justin Lake with Wolfe Research.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nJust a couple of numbers questions. First, the accelerated growth in your stop-loss revenue has been impressive this year. Just wanted to get some color on what's driving that? And do you think it continues at, we'll call it, a solid double-digit pace in 2023. And then quickly, your medical cost reserves were down about 5% in the quarter.\n\nJust curious if there was anything driving that.\n\nBrian Evanko -- Chief Financial Officer\n\nJustin, it's Brian. On the stop loss, we're really pleased with the strong growth that we've shown this year as you can see, both in terms of the quarter over quarter and the year-over-year premium growth with 13% and 12% growth, respectively, on that. Important to keep in mind, there's a few components that drive that. One is we've shown a very strong growth in our fee-based Cigna Healthcare customers this year, and many of those bring with them a stop-loss contracts.\n\nSo there's some additional units, if you will, of stop-loss that are embedded in the year-over-year growth rate. On top of that, we have had strong firm price increases on our existing client base. And as you noted, now in the double-digit level with the 13% quarter over quarter, representing some of the later 2022 renewal dates, seeing strong price increases. And then finally, we have seen a bit of increased penetration on our existing ASO clients as well of the stop-loss products.\n\nSo a few different factors that drove that strong growth. As we talked about in prior calls, we still have some margin expansion opportunity in our stop-loss book of business as we head into '23. So we would expect another year of strong growth in premiums for the stop-loss product in the 2023 calendar year. On the reserve side, there's really nothing in particular I'd call to your attention there.\n\nWe continue to employ a consistent methodology to establishing our reserves. There will be some natural variability just between product mix shift and inventory levels changing from quarter to quarter. And overall, we feel good about the appropriateness of our reserves, and if you look year over year at the reserve levels, they -- all the key metrics that we evaluate screen appropriate and prudent.\n\nOperator\n\nOur next question comes from Mr. Kevin Fischbeck with Bank of America.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Maybe just a quick fact question and then jump into the other question. But can you help us size the revenue that gets a little bit of difference on how Centene talks about the revenue contribution versus what it looks like CBS was booking from a revenue perspective. So can you help us size from a revenue perspective with the Centene contract and whether you get all of that in '24, whether that ramps up? And then I guess like my main question is just going to be about maybe going back to the M&A point, I just find it very interesting that you've got some competitors who are just out there constantly buying things and adding capabilities and other companies focusing more on share repurchase and selective smaller acquisitions.\n\nI guess -- do you not see this as an arms race. It almost feels to me like a lot of companies are out there building capabilities. Do you feel when you think about M&A that potentially not pursuing M&A will be a disadvantage over the next three to five years if you're not doing deals today?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nKevin, it's David. On your first piece, again, we'll look forward to providing you a lot more detail as we get into 2023 relative to 2024. At a macro level, I think the two data points to think about relative to the size of the relationship. And at today's state, there's about $40 billion relative to spend capacity.\n\nAnd as I noted in the prepared remarks, approximately 20 million customer relationships that will evolve and change over time. And as we provide more detailed guidance going forward, we'll try to separate that versus the revenue contribution. To your strategic question relative to M&A, first and foremost, I think you're framing is quite important. I wouldn't call it an arms race, I would call it stepping back.\n\nThe marketplace demand for further value creation is and will remain consistently aggressive from that standpoint. Hence, innovation, additional value creation, strong operating execution and then selectively expanding your addressable market demand the strategy we deem to be mission-critical. Two, now stepping back to ourselves, as we discussed in our Investor Day, we're positioned with strong performing foundational businesses and well positioned to accelerate business. Those accelerated businesses are in sectors that have secular tailwinds.\n\nAnd then to the core of your point, how do we fuel additional capability growth. I'd ask you to think about it in a multipronged approach as opposed to M&A yes or no. One is significant targeted ongoing organic investment back into ourselves with new innovations and some of which I talked about today, some of which we profiled at our Investor Day, our new Pathwell programs, our unique longitudinal programs that take into consideration data, navigation support best-in-class clinical engagement with physicians and will increase value by taking costs out of the system through improving clinical quality. So organic investments are number one; two, is smartly and successfully leveraging our ventures capabilities to partner up with organizations to accelerate innovation; and the third is M&A.\n\nWe remain quite open to M&A. We do not deem it to be a silver bullet. It's a part of the growth support strategy. So organic execution, investments in organic innovation, smart leverage of our ventures capabilities as well as M&A over time.\n\nAnd I would just come back and anchor it. Hence, our track record of strong top-line growth, and strong bottom-line growth with tremendous cash flow generation over the last decade by playing that recipe through which we will on a go-forward basis.\n\nOperator\n\nOur next question comes from Ms. Lisa Gill with J.P. Morgan.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nI just really wanted to better understand as we think about the comment on the tailwind for 2023 around biosimilars. As you think about the plan design for '23, are you seeing employers and health plans willing to put the biosimilars on the formulary? I mean how much color and visibility do you have to that tailwind for '23? And is that primarily HUMIRA? Or are we thinking about other biosimilars as well?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nLisa, it's David. First, relative to the category, as you know from prior conversations, we deem the category to be a net positive from a client, patient and customer standpoint as we look forward, '23 and beyond. As it relates to further improvements in affordability. And given the positioning of our Accredo capabilities, a net positive for ourselves.\n\nSo just grounding on that for starters in terms of the capabilities to bring this to bear. Second, 2023 represents the start of another step function, but the start of another step function as it relates to the biosimilars. Third, we will communicate our national formulary conclusions later this quarter. As you very well know, that's one dimension.\n\nAnd then there's client-specific formularies, decisions that are made that are underway. So to the core of your question, it will vary in 2023 between international formulary as well as client-specific formularies on a go-forward basis. We deem it to be a net positive for the franchise in 2023. As I noted, it will present a tailwind for us in 2023.\n\nAnd that is HUMIRA-specific or the category specific, but others will begin to ramp as we move through 2023 into 2024. So a transitional -- I view '23 as a transitional year for the space with acceleration. Our decisions are about to be communicated and finalized relative to formulary decisions, and they're varied at an employer or health plan level. Our national formulary decisions will be consistent across that subset of our portfolio.\n\nOperator\n\nOur next question comes from Mr. Josh Raskin with Nephron Research.\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nSo the $200 million you mentioned for Centene preparation costs, is that pre-tax or after-tax? And then my real question is the outlook for Medicare Advantage for 2023. I'm curious, I know you've made some investments through this year, and you've talked about opportunities for margin next year, but I'd be curious on the growth front. And if you could just give us some color on how some of the newer county expansions have gone in recent years, that would be helpful.\n\nBrian Evanko -- Chief Financial Officer\n\nJosh, it's Brian. I'll take the first part of your question, and I think David will comment on the Medicare Advantage component. The $200 million that we quoted is a pre-tax figure. And again, as we work through the detailed implementation plans in terms of rate and pace.\n\nWe'll continue to refine that estimate. But you should think of that as a $200 million pre-tax number for 2023 specifically. David, do you want to talk about Medicare?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nSure. So specific to Medicare Advantage, let me take it maybe a little bit in reverse order to your question. Because as you articulate, we've been systematically adding new geographies, net new geographies and adjacent counties over the last several years and successfully opening those counties in those markets. Second, as you would expect, your early sales in a net new market would tend to have a lower contribution than your sales in mature existing markets.\n\nThe sheer nature of the operating cost environment and getting those businesses up and running from that standpoint. Having said that, while we are very early in the 2023 decision-making process cycle as every day kicks on, early presence reporting are positive as it relates to our current net growth algorithm and both in mature counties and markets as well as some of our new market entries. Looking at 2023, given the continued geographic expansion, we've made network improvement. We've made investment in distribution and marketing support as well as more resources and capabilities to begin to harness some of the commercial agents to Medicare, we expect 2003 to be a year of growth for our Medicare Advantage portfolio, and we look forward to updating you on that as we get through the latter part of this year.\n\nOperator\n\nOur next question comes from Mr. Nathan Rich with Goldman Sachs.\n\nLindsay Golub -- Goldman Sachs -- Analyst\n\nThis is Lindsay Golub on for Nate. Congratulations again on the Centene contract win. Could you talk through some of the opportunities for future Evernorth service expansion and just strategic collaboration with Centene?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nLindsay, it's David. Thank you for the acknowledgment. And as Brian noted earlier, we're excited and we're proud to be given the opportunity, and we'll seek to earn that opportunity day in, day out. And as Brian noted, before going to the core of your question, the team is 110% focused on a successful implementation and initiation of the relationship on January 1, 2024, and is heads down relative to that.\n\nAs it relates to future opportunities, I want to get ahead of ourselves relative to that, but we've demonstrated over time when we successfully partner and successfully collaborate, we have an opportunity to broaden and deepen relationships. And we enter this relationship with Centene, First and foremost, needing to, wanting to and fully committed to performing on the existing commitment. And then availing Centene as a partner relative to our Evernorth capabilities and our broad service capabilities to co-collaborate and innovate. So we see opportunity over time, but we're not getting ahead of ourselves.\n\nWe're focused on the present and the present is a significant win for us. I would wrap around it. Our track record demonstrates deepening of relationships and broadening relationships like co-collaboration and co-development, and that's what we will seek to do with Centene after we successfully deliver on this promise.\n\nOperator\n\nOur next question comes from Mr. Scott Fidel with Stephens.\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nWanted to talk -- ask about the ACA exchange market and how you're thinking about the setup for 2023 there. Obviously, some moving pieces on the competitive chessboard that should be favorable for potential enrollment growth. So interested in how you're thinking about enrollment growth for 2023 and then confidence in your pricing setup for 2023, if you do end up adding more membership than expected given some of the competitor exits confidence in also achieving your target margins for that segment as well?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nScott, it's David. So broadly speaking, we have viewed this space as a space where we have an opportunity to grow over time. And as you all know, there's been a little bit of volatility since its inception, and we were -- we entered at inception and remained in the marketplace and continue to systematically grow. We'll grow our geographies as we step into 2023.\n\nAnd -- as it relates to the volume, we would expect to have net customer growth. Our current outlook is to have net customer growth in '23, and we would expect that there would be a positive margin contribution. As Brian and I both noted, we expect the Cigna Healthcare portfolio in aggregate to have some further margin expansion opportunity. We believe that this subset of our space will have net positive margin contribution going forward.\n\nI'm not going to comment in terms of the latter part of your question went back to target margins as we continue to invest in, we know what the underlying book is performing at and what we expected to perform at. We'll make investment decisions in 2023 for 2024. That may dampen a little bit of the margins. Those are discretionary decisions for ongoing growth.\n\nBut headline is well-positioned for '23, expect to have net growth and expect to have good margin performance for the portfolio.\n\nOperator\n\nOur next question comes from Mr. Gary Taylor with Cowen.\n\nGary Taylor -- Cowen and Company -- Analyst\n\nOne quick one for Brian and one for David. Brian, just on investment income in the quarter, looked a little light, even accounting for divested assets, the return looked a little light. So just wondering if there was something there, perhaps a little nonrecurring in terms of potential run rate on investment income. And then for David, I had a couple of clients ask lately about the DOJ intervening in the AMA lawsuit as well as the AMA joining the class action on the multiplan lawsuit.\n\nI guess the question really is just the legal profile of the company changed in any material way. I just wanted to give you a chance to comment on those.\n\nBrian Evanko -- Chief Financial Officer\n\nGary, as it relates to our investment income, within the third quarter, in aggregate, the investment income did slightly trail our expectations, but that shortfall was more than offset by the favorable medical care ratio performance within Cigna Healthcare, which allowed us to outperform both our Cigna Healthcare and Enterprise income outlook. Two things that are important to keep in mind as you reflect on that, and you referenced this in your question. The first one is the Chubb divestiture that was completed on July 1, resulted in a step-down of our investment income, and you can think of that as in the range of $50 million to $60 million per quarter. That's essentially removed starting in the third quarter.\n\nSo any comparisons to historical periods need to normalize for that factor. The second area is within our alternative asset portfolio, which consists of think of this is private market, non-coupon assets. And this represents a minority of our invested assets, but it's subject to mark-to-market accounting for U.S. GAAP requirements.\n\nAnd given some of the challenges in the public capital markets this year, we had expected some downward mark-to-market adjustments in the third quarter and the fourth quarter, and that did transpire. Some of the downward marks were a little bit larger than what we had been projecting. But as I said earlier, strong medical care ratio performance in the quarter allowed us to exceed our overall income and EPS outlook. And as you think about the future and trying to run rate this, if you were to remove the Chubb-related contributions from 2022, the all-in net investment income for '23, you can think of it as approximately similar to the all-in 2022 investment income.\n\nSo either a tailwind or a headwind as we step into '23 and the investment income one. David, I'll let you comment on the Medicare Advantage.\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nThanks, Brian. Gary, your broader framework, Gary, I'd step back and say, we have -- we do and we continue to operate in an active regulated space. Two, I'd point to, as we look at today in the past, we have a strong track record as an organization of being well governed and strong, healthy compliance-related programs. To that point and to the core of your question, I do not deem that the legal exposure, I think, is where you're going after with the profile of the company has changed meaningfully.\n\nAnd in some ways, given the strategic positioning of our franchise being more services-based, I would make the argument that the legal exposure footprint on a relative basis to the space is lighter from that standpoint, given the services-based nature of our portfolio is more intense and heavy. But no doubt, it's an active space has been, is, and will continue to be an active space, but we're proud of our governance and compliance functions and capabilities.\n\nOperator\n\nOur next question comes from Ms. Ricky Goldwasser with Morgan Stanley.\n\nRicky Goldwasser -- Morgan Stanley -- Analyst\n\nYes. So a couple of follow-up questions here. Just to clarify, for 2023, is the EPS starting point that we should use is the $23.10. And then as we think about the Centene headwind, if it's $200 million around of earnings growth.\n\nAre you assuming that excluding Centene, sort of the core business would have grown at that long-term target of 10% to 13%?\n\nBrian Evanko -- Chief Financial Officer\n\nRicky, it's Brian. So let me try to clarify some of the comments I made earlier as it relates to our 2023 outlook. So prior to the Centene contract award, the current 2023 consensus EPS estimate we see is reasonable. And so the last I looked this was in the range of $25.30, give or take a few cents.\n\nWith the recently announced Centene contract, this will create an incremental 2023 headwind that will essentially need to be deducted from that 2023 earnings per share figure that I just referenced. And then as I mentioned, as is normal, we typically start with our initial guide having some level of prudence in it, particularly since we have an at least EPS convention with the way that we communicate our outlook. So those are the different moving pieces that I would point to as you think about 2023. And then as I said earlier, relative to the two-year 2022 to '24 growth rate, we would expect that to be within our 10% to 13% compounded annual EPS growth rate range.\n\nRicky Goldwasser -- Morgan Stanley -- Analyst\n\nOK. And then just one quick follow-up question. As we think about the Centene contract, is there any leverage that you gain with the additional scale that you'll see across the rest of the Evernorth book of business?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nIt's David. Broadly speaking, a framework of growth always presents opportunity. So I think your basic tenant is positive here. Additionally, our opportunity to further enhance the value we're able to deliver to existing clients especially those with higher government portfolios of business and/or strengthen our value proposition even further relative to winning new clients on a go-forward basis.\n\nSo I would give you a directional answer, not a yes, no answer, but a directional answer that growth is a net positive, whether it's the ongoing investment back in innovation, the capabilities in subsectors of the space in terms of being much more government intensive within this portfolio or otherwise, I would say, net directional positive.\n\nOperator\n\nOur next question comes from Mr. Steven Valiquette with Barclays.\n\nSteven Valiquette -- Barclays -- Analyst\n\nI guess with the increase in membership guidance for '22 and the Commercial risk membership growth year over year actually accelerating as the year progresses. Just curious to hear a little more color just on the positive tailwinds there, kind of what's driving the extra commercial risk membership success?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nSteven, it's David. Let me talk a little bit more about the selling season, the dynamic in the process. As I noted in my opening, 2022 results for commercial portfolio business. First and foremost, we're pleased with the MLR performance.\n\nWe're pleased with the retention. We're pleased with the net growth. Two, in '22, a primary driver of that growth is good performance in our middle market and sustained success in our Select segment. Within our Select segment, we regularly offer ASO or self-funded with stop-loss, shoulder-to-shoulder with derivatives of and specific risk alternatives.\n\nAnd we provide choice, we provide choice declines relative to funding. We've designed our sales process, our underwriting process. and our solutioning process, we're able to put that choice forward. And year in, year out, it ebbs and flows between a different mix between ASO and stop-loss and risk business.\n\nWe're pleased with the net risk results that underline that. But I think the overall headline is to sustain strong success of the Select segment. Now more broadly, as you look at the portfolio, our fee-based business continues to grow -- prior point it back to the meaningful growth in stop-loss. And finally, in my comments pointing toward 2023, we will have a very good national account, January 1.\n\nThat's largely fee-based business. That's retention, it's expansion and this new business has as well as addition of large, what we would call middle market fee-based relationships going forward. So the underlying net growth is consistent. The quality is there in the MLR and our risk business, you see is really fundamental strength within our Select segment.\n\nOperator\n\nOur next question comes from Mr. Lance Wilkes with Bernstein.\n\nLance Wilkes -- AllianceBernstein -- Analyst\n\nYes. Congratulations on that Centene win, a great job. Two just cleanup questions. One is in Evernorth, just understanding the driver of fees in the Evernorth segment? And the other is just a comment on utilization.\n\nObviously, MLR was really down this quarter. Just interested in getting any comments on relative to maybe a baseline or kind of pre-COVID levels for commercial, public exchange and Medicare Advantage contrasted with sort of the nonmedical products. Like what's kind of the environment you're operating in, they're seeing right now?\n\nBrian Evanko -- Chief Financial Officer\n\nIt's Brian. So as it relates to the fees in Evernorth and you can see the strength in this line, if you look at the statistical supplement in terms of fees and other revenue with strong 16% quarter over quarter, 21% year-to-date growth. There's a few different components that contribute to this -- so one, this is where our MDLIVE business shows up, and we've continued to see strong growth throughout the year in utilization of our MDLIVE services. Secondly, we have a number of Express Scripts or pharmacy benefit services clients who choose a pure fee-based relationship with us.\n\nSo we offer a choice relative to how they want to work with us as some of them might want a formulary or a network-only relationship. And so that shows up in this line item. And then also our Evercore business in terms of medical benefit management, some of the post-acute care solutions, etc., all roll up into this line item. So all these things in totality are showing nice growth for the Evernorth business.\n\nAs it relates to your second question, I think that was pointed at Cigna Healthcare more specifically in terms of utilization environment. Third quarter did run favorable to our expectations. Most of that favorability was in the U.S. commercial book of business with our government lines essentially in line with expectations.\n\nAnd within the quarter, both COVID and non-COVID costs in the U.S. commercial book were favorable to our expectations. Non-COVID favorability was predominantly driven by inpatient and emergency room. And on the COVID side of the house, we saw third-quarter COVID-related costs running at a very comparable level to what they were in the second quarter, whereas we had assumed a bit of an uptick.\n\nSo broadly speaking, that's how I would summarize what we saw in the third quarter. All in, our commercial book of business is running just slightly above what a pre-pandemic baseline would have been trended forward to your question there with Medicare a touch below that.\n\nOperator\n\nOur last question comes from Dave Windley with Jefferies.\n\nDave Windley -- Jefferies -- Analyst\n\nI joined late, so I apologize if this has been asked. But as you think about 2023 and kind of Fed pushing to slow labor market and potential recession implications, will you be thinking about recession possibilities as you set your guidance for '23? And how do you think the business is positioned to be resilient against that?\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nIt's David. So I think a really important question and that we didn't spend time on that. So thanks for the opportunity. First, from our point of view, there's little doubt the economy has been confronting some challenges.\n\nSo recession, nonrecession, there's been some challenges. And to date, important grounding, we've seen little direct impact for the demand of our services or the underlying performance for our portfolio, right? Movement in costs here or there. But broadly speaking, we've seen a little direct impact. As we look forward, by and large, we still see an environment where net-net employers are more oriented in terms of maintaining and/or hiring employees seeking to get to full employment.\n\nWe do see instances where that has slowed. We do see instances where employers are putting freezes. But when you balance the portfolio as a whole right now, there's still a net hiring environment that sits in front of us, not to today. As we look forward, we absolutely play through scenarios that could have further softening of the economy or recessionary impact.\n\nAt this point, we believe, given the visibility we have into the starting point of 2023 with the net growth we expect to step in the year with, coupled with the strength that we expect in 2022 with, those two points and the various levers we have within our diverse services portfolio and benefits portfolio, we believe we'll be in a position to deliver another strong 2023. Ending with, we acknowledge the fact that the economy is in a bit of a challenged environment in the current state. But all in, we believe our portfolio will be durable and is in a position to perform next year because of the strong start we'll have to the year and the various levers we have to manage in our portfolio.\n\nOperator\n\nI will now turn the call back over to David Cordani for closing remarks.\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nFirst, let me thank everybody for joining our call today, and I'll just wrap up with a few thoughts. First, our business is performing well. Our new collaboration with Centene is great evidence of the strength of our value proposition and how it continues to resonate in the market. We're growing with high levels of retention and winning new clients.\n\nWe're performing well in this dynamic environment and our sustained disciplined execution is benefiting those we serve as well as our shareholders. We are delivering for our shareholders and remain on track for our full-year adjusted EPS outlook of at least $23.10, which is elevated from our prior outlook, and we are confident we are well positioned over the long term to continue to deliver on our annual adjusted EPS growth of 10% to 13% plus our meaningful dividend. This is all possible because of the breadth of capabilities we have across our organization, our proven commitment to innovation, but most importantly, the dedication of our more than 70,000 coworkers across the globe. I personally appreciate our team and what they do every day for our clients, our partners, our customers and patients and I thank them for the commitment to making a positive impact on people's lives each and every day.\n\nWe thank you again for your interest in Cigna, and we look forward to continuing our conversation as we go into the latter part of this year. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRalph Giacobbe -- Vice President, Investor Relations\n\nDavid Cordani -- Chairman and Chief Executive Officer\n\nBrian Evanko -- Chief Financial Officer\n\nStephen Baxter -- Wells Fargo Securities -- Analyst\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nJustin Lake -- Wolfe Research -- Analyst\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nLindsay Golub -- Goldman Sachs -- Analyst\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nGary Taylor -- Cowen and Company -- Analyst\n\nRicky Goldwasser -- Morgan Stanley -- Analyst\n\nSteven Valiquette -- Barclays -- Analyst\n\nLance Wilkes -- AllianceBernstein -- Analyst\n\nDave Windley -- Jefferies -- Analyst\n\nMore CI analysis\n\nAll earnings call transcripts"
}