{
  "companyName": "Crestwood Equity Partners LP",
  "companyTicker": "CEQP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/crestwood-equity-partners-lp-ceqp-q3-2022-earnings/",
  "content": "Crestwood Equity Partners LP (CEQP -0.19%)\nQ3 2022 Earnings Call\nNov 02, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to today's conference call to discuss Crestwood Equity Partners' third quarter 2022 financial And operating results. Before we begin the call, listeners are reminded that the company may take certain forward-looking statements as defined in the Securities and Exchange Act of 1934 that are based on assumptions and information currently available at the time of today's call. Please refer to the company's latest filings with the SEC for a list of risk factors that may cause actual results to differ. Additionally, certain non-GAAP financial measures, such as EBITDA, adjusted EBITDA, distributable cash flow and free cash flow will be discussed.\n\nReconciliations to the most comparable GAAP measures are included in the news release issued this morning. Joining us today with prepared remarks are president, Robert Halpin, executive vice president and chief financial officer, John Black, and executive vice president and chief operating officer, Diaco Aviki. Additional members of the senior management team will be available for questions and answers, for the question-and-answer session with Crestwood's current analysts following the prepared remarks. Today's call is being recorded.\n\n[Operator instructions]. At this time, I would like to turn the call over to Robert Halpin.\n\nRobert Halpin -- President\n\nThank you, operator. Good morning, everyone, and thank you for joining us today as we discuss our third quarter financial and operating results, as well as our outlook for the remainder of 2022. Now, before we get started, we do have a couple of housekeeping items I wanted to touch on. First, Bob Phillips is unable to join us this morning as he is traveling internationally on a previously planned trip and unfortunately, is in a location with unreliable Internet service.\n\nI know Bob is disappointed to not be on the call this morning, but he sends his regards, and he looks forward to connecting with many of you over the course of the fourth quarter at some of the various investor conferences or other events around the upcoming holidays. Second, I would like to recognize and congratulate Johnny Black, who was recently promoted to chief financial officer. Johnny has been with Crestwood since 2014 in various financial roles of increasing responsibility, and we are really excited to have him join our executive committee here. So let's get started.\n\nI'll kick off the call with a few opening remarks and then turn it over to Diaco to cover an operational update, and then finally, over to Johnny to cover our financial results in more detail. The third quarter was another busy quarter for Crestwood with a number of significant accomplishments that position the company to better execute our long-term strategy around our core assets. Early in the quarter, we closed on the previously announced acquisitions of Sendero Midstream and CP JV, our 50-50 joint venture with First Reserve. Collectively, these transactions significantly increased our operational footprint in the Delaware Basin and make the Delaware Basin a much larger contributor to our overall cash flow.\n\nThe Sendero assets are already significantly exceeding our expectations as our diverse set of public and private producers continue to drill strong wells and maintain very active drilling programs. In just a few short months, our operations and project management teams have fully integrated and interconnected the Sendero and Willow Lake assets. This now enables Crestwood to efficiently accelerate utilization of existing gathering and compression capacity, as well as available processing capacity at both our Orla plant and the newly acquired Carlsbad plants. The Delaware Basin continues to be the most robust and prolific and active play in North America, and we remain very excited about our growth opportunities in that basin as our producer customers continue to aggressively develop their substantial inventory positions.\n\nIn September, we completed two more strategic initiatives that align with our strategy to maximize unitholder value. First, we announced the divestiture of our Marcellus gathering and compression assets to Antero Midstream for $205 million in cash, which further streamlines our asset portfolio in our high-growth core operating regions. Second, we immediately redeployed a portion of those Marcellus divestiture proceeds by playing a significant role in the 16 million unit secondary offering from Chord Energy, alongside many of our long-term public unitholders. As a part of that transaction, Crestwood repurchased and retired 4.6 million Crestwood common units from Chord Energy for approximately $124 million.\n\nAnd Chord's ownership in Crestwood was reduced to less than 5% of total units outstanding. We are very excited to play a sizable role in this transaction through another large unit repurchase, which when you combine this transaction with the First Reserve transaction we completed back in March of 2021, adds up to Crestwood having repurchased approximately $380 million in common units over the last 18 months, which amounts to a very sizable return of capital to our unitholders. I would be remiss if I did not also take a minute to thank our long-term dedicated CEQP investors that partnered with us in the Chord secondary transaction. You all showed tremendous support with your participation and enabled us to reach a win-win solution with Chord, who has been a great partner to us over the last 14 months or so and remains a very important customer for us going forward.\n\nNow, shifting gears, and before I hand the call over to Diaco and Johnny, I wanted to provide some high-level commentary on a few factors that impacted our results in the quarter and outlook for the remainder of 2022. In the wake of our series of M&A transactions, our portfolio's adjusted EBITDA has grown substantially and has evolved to be comprised of 90% gathering and processing assets. The fundamentals around our business remains strong, and we have an extremely active producer set running 16 drilling rigs across our dedicated acreage. Additionally, we have seen a meaningful amount of producer M&A activity around our assets, including Oasis' merger with Whiting to create Chord Energy, Devon's acquisition of RimRock on our Arrow assets and Continental's multiple acquisitions in the Powder River Basin.\n\nAll of these transactions further enhance our customer base around our core assets and highlight the quality and long-term value of the inventory behind our dedicated acreage. During the quarter, Williston Basin gathering and processing volumes were negatively impacted by timing delays to well connects on our system. As our key customers integrate those recently acquired assets and work to catch up from second quarter weather disruptions, near-term challenges in the oilfield services labor market and supply chain constraints, we have seen delays in well completions, which have led to the DUC count on the Arrow system to increase to approximately 20 wells. As a result, we have solid visibility to the fourth quarter and 2023 activity levels but are revising our full year 2022 adjusted EBITDA guidance range to $780 million to $800 million to fully reflect some of these timing shifts.\n\nAs Crestwood and our customers continue to work through these short-term challenges, we are increasingly confident in the strength of our portfolio. And with our operations now squarely focused on the leading North American basins, we expect our asset base to generate meaningful and growing free cash flow that enables us to continue creating long-term value for our unitholders. With that, I'll turn the call over to Diaco to provide additional details on our operations for the quarter.\n\nDiaco Aviki -- Chief Operating Officer\n\nThank you, Robert, and good morning, everyone. I'd also like to echo Robert's settlement on our high-graded asset portfolio and how we are positioned heading into 2023. As the budget season kicks off for our customers, receiving upsided guidance for 2023 activity and expect to have an active year. Our producers are in excellent financial health and are now better equipped to navigate some of the oilfield service constraints experienced this year.\n\nOur strategic execution in the past year has built competitive scale in our core basins and commercial operations and project management teams are capturing additional value. Let's get started in the Williston Basin. As discussed, this year was impacted by winter weather and well connect delays. Some wells originally expected to come online in the second and third quarters have shifted into the fourth quarter and a few fourth quarter wells are now expected to come online in 2023.\n\nToday, we've got four rigs currently running on our acreage. We expect to have 40 to 45 wells connected in the fourth quarter. Our gathering and processing assets support some of the best acreage in the Williston Basin that offers producers exceptional economics in this commodity price environment. Cash flow growth in the fourth quarter and into 2023 is coming from this high level of activity, and I am really pleased to highlight our teams continue to capture incremental merger synergy through the optimization and improved efficiencies.\n\nWe are well on track to exceed our previously identified 2023 operational synergy cost target of $25 million in 2022. Moving southwest to the Powder River Basin, excluding the Continental Express pipeline, during the third quarter, there are six new wells connected to our Jackalope system. That drove year-over-year volume growth of 11%. Operators are currently running three rigs on Crestwood's acreage, targeting multiple formations as our producers continue to delineate a STACK formations across over 400,000 dedicated acres.\n\nWe expect this ongoing level of activity to result in increasing volumes on the Jackalope system throughout 2023. In the Delaware Basin, both public and private producers continue to operate strong development plans across our footprint. During the third quarter, 43 wells were connected across our systems and producers are currently running a total of nine rigs that are expected to result in an incremental 40 to 45 well connects in the fourth quarter. Since completing the Sendero and CP JV acquisitions, our commercial teams continue to capture incremental opportunities to attract volumes to our expanded system.\n\nCurrent activity in the basin is placing a premium on excess processing capacity and our optionality process volumes both in New Mexico and in Texas is a big advantage for our producers as we're better able to optimize activity and provide them flow assurance. Finally, I'll conclude with a quick update on Tres Palacios's gas storage facility in South Texas. We recently filed a FERC application for a 6.5 Bcf expansion to the facility by converting an existing brine production well into a fourth cavern. This expansion is fully supported by two long-term contracts with existing investment-grade counterparties and expected to be in service in approximately six to nine months after the approval of the application.\n\nCrestwood continues to see strong interest in the facility since Winter Storm Uri in February 2021 and through increased Gulf Coast LNG demand from customers needing incremental storage and wheeling services. With that, I'll turn it over to Johnny to cover our quarterly financial results.\n\nJohnny Black -- Executive Vice President and Chief Financial Officer\n\nThank you, Diaco. For the third quarter, Crestwood generated adjusted EBITDA of $209 million and distributable cash flow of $131 million, year-over-year increases of 50% and 53%, respectively, driven by our M&A activity over the past 18 months. For the third quarter, Crestwood announced a $0.655 distribution payable on November 14 to unitholders of record as of November 7, resulting in a quarterly coverage ratio of approximately 1.9 times. Looking at the segment results.\n\nIn the Gathering and Processing North segment, third quarter 2022 EBITDA totaled $157 million, an increase of 48% over the third quarter of 2021, driven by higher natural gas gathering, natural gas processing and water gathering volumes from the expanded operations of the Oasis Midstream assets. In the Gathering and Processing South segment, third quarter 2022 segment EBITDA totaled $53 million, more than double year over year. Segment growth was driven by a combination of the Sendero and CP JV acquisitions, coupled with volume growth from the legacy Crestwood assets, offset by the sale of the Barnett assets, which closed on July 1. In the Storage and Logistics segment, EBITDA totaled $11 million for the third quarter, a decrease year over year due primarily to realized hedge losses.\n\nOur NGL storage and logistics business continues to perform in line with our original expectations for the year and is positioned to perform well for the upcoming winter heating season. On the cost side, Crestwood has done a great job managing expenses despite the inflationary environment throughout 2022. O&M and G&A expenses totaled $79 million for the quarter and increased over the third quarter of 2021, primarily due to the Permian and Williston Basin acquisition this year. During the third quarter, we invested approximately $59 million in growth capital, primarily related to the continued build-out of the multiproduct gathering system for Chord energy and other recently contracted third-party producers in the Williston Basin, expansions of our gas gathering and compression system in the Delaware Basin, as well as the build-out of our Panther crude oil and water gathering system for Percussion Petroleum in the Delaware Basin.\n\nBased on the deferral of well connects in the Williston Basin, as previously mentioned from earlier this year to later in 2022 and into 2023, and the exceptional job executing projects below cost targets in an inflationary environment, we have been able to optimize our capital spend throughout the year and are, therefore, reducing our growth capital guidance range for this year to $200 million to $220 million, a $20 million reduction at the midpoint of the range, and we are reducing our maintenance capital guidance range to $25 million to $30 million, representing a $5 million reduction at the midpoint of the range. Based on these updated and reduced capital figures, we are projecting positive free cash flow after distributions this year of approximately $5 million to $25 million on a full year basis. Turning to the balance sheet. Crestwood ended the third quarter with $3.6 billion in long-term debt outstanding, including $2.25 billion of senior notes and $1.3 billion outstanding on our two revolving credit facilities.\n\nAs mentioned, on October 25, Crestwood closed on the sale of the Marcellus assets for $205 million in cash and all of the sale proceeds were used to pay down revolver debt. Pro forma for the sale of the assets, Crestwood now has $3.4 billion of long-term debt outstanding and a consolidated leverage ratio of 4.1 times at the end of the third quarter. As we think about our capital allocation priorities going forward, we remain squarely focused on the balance sheet and are committed to reducing our leverage ratio to our long-term target of less than 3.5 times through a combination of EBITDA growth and free cash flow allocation to debt paydown. As we start to look into 2023, we are focused on the continued integration and optimization of our acquisitions through the capture of commercial and cost reduction opportunities and maximizing our free cash flow generation from the assets.\n\nBased on our preliminary outlook for the business, we believe the company is well positioned next year to accelerate our leverage reduction goals and create financial flexibility in the balance sheet. With that, operator, we are ready to open up the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Jeremy Tonet with J.P. Morgan. Please proceed with your question.\n\nSteve McGee -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning. This is Steve McGee on for Jeremy. I guess, starting out just going through the walk down in EBITDA.\n\nIf you could just kind of walk us through what led to that? How much of it was the asset sale? And then how much of it was timing? Is it possible for fourth quarter to come in better than your expectations because of the timing? Just walking us through that would be great.\n\nJohnny Black -- Executive Vice President and Chief Financial Officer\n\nYes. No problem at all. This is Johnny speaking. There's really two drivers of the change in the guidance range, the midpoint coming down from $820 million to the new guidance range of $790 million.\n\nThe first factor, obviously, the Marcellus assets were estimated to contribute an additional kind of $5 million to $6 million of EBITDA for part of October, November and December. That will obviously be removed from earnings after the divestiture closed on October 25. And then, the remainder is really driven by the shifting in deferral of well completions in the Williston from the second and third quarters of this year into the fourth quarter in 2023. This drives a roughly $20 million impact to our earnings for the second half of 2022 compared to our original expectations.\n\nSo that miss, coupled with the removal of the Marcellus cash flow really drives the approximate $30 million revision downwards. I would say, to answer the second part of your question and what could kind of push us toward the higher low end of that range. Obviously, as Diaco mentioned, we are projecting a significant amount of connections here to catch us up volumetrically in the fourth quarter across both the Williston and the Delaware, with 40 to 45 incremental wells in the Williston and 45 to 50 incremental wells in the Delaware. So just given the substantial amount of connections here this quarter, the exact timing and the initial production rates for those new wells will have a big impact on our EBITDA this quarter and really be the driver of kind of the low to the high end of the guidance range.\n\nSteve McGee -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then, as far as the delays go and on the OFS constraints, do you see this opening up into 2023, is there any risk that maybe it gets delayed further because of these constraints, just how you see 2023 kind of shaking out now? And then also with the DUCs, how many are on the Bacreage or the Bakken acreage.\n\nDiaco Aviki -- Chief Operating Officer\n\nYes. This is Diaco Aviki. Let me answer the second one first. The DUCs that we quoted are only on Arrow.\n\nThere's additional DUCs across our footprint across the U.S. So those are only on Arrow in our expectations for that number at this point in time in the year were much lower than what we quoted of 20 going into the impacts of the OFS activity. We don't expect that to continue into 2023. We think our customers have kind of done the -- taking appropriate actions to manage those issues.\n\nSo 2023 should shape up to be pretty robust and the activity we have today is a good reflection of that.\n\nSteve McGee -- JPMorgan Chase and Company -- Analyst\n\nAll right. That's it for me. Thanks, guys.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Neal Dingmann with Truist. Please proceed with your question.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nOh, sorry about that, guys. Good morning. Thanks for the time. My first is just on the Bakken.\n\nYou all mentioned a little bit on, I think, anticipated four rigs and 40 to 45 wells. Were you talking about some weather that you're currently seeing? Or maybe just talk about expectations on Bakken a little bit, not just beyond the color you gave, but maybe into '23, if you could.\n\nRobert Halpin -- President\n\nYes, Neal, this is Robert. The weather we were referencing was really the second quarter storm back in April and May of 2022. But what we've experienced kind of as a result of that is that obviously kicked out a lot of the timing of completions in the second quarter, and we anticipated those and our producers anticipated those to come on in 3Q and 4Q of this year. As they kind of tried to bounce back from that and then navigated some of the operational challenges on the OFS side, that's really what we've seen in the timing slippage.\n\nAnd then, adding to that a little bit, we've also had a decent amount of M&A activity from some of our key operators. And obviously, the integration time frame around those assets has caused some of those timing shifts as well. So that 40 to 45 well connects is for the fourth quarter of this year. We've got pretty good line of sight to that coming online.\n\nWe've seen a handful of pads come on here already through the first month of the quarter. So I think we have a good degree of confidence in that outlook given those wells are ready to go and completion crews are up and running. And then, I think further to that in 2023 and to Diaco's commentary, we do feel, based on our producer feedback that they have navigated well through this, and they've made appropriate plans to be able to navigate some of the operational challenges and we feel pretty good about our '23 outlook up in the Williston Basin on both the Arrow assets, as well as the Rough Rider assets from the Antero Midstream acquisition.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGreat details. And then, just a quick one. I feel like you had just slightly revised the commodity type. I'm just wondering when you look into '23, do you anticipate that shifting a bit more? I mean, right now, I think you're around 53% gas and 14% NGLs and the rest are on water.\n\nDo you think that could potentially get a little bit oilier in '23? Or how are you thinking about that?\n\nRobert Halpin -- President\n\nI really don't -- I think the mix stays relatively consistent because the well completions are going to come from the same basins. We have our three core operating areas up in the Bakken, the Powder and the Williston -- sorry, the Bakken Powder and the Delaware. I think as we look at the acceleration of activity, obviously, we expect Delaware to be pretty robust next year. So you could see volume metric mix shift a little bit to the gas side given our gas service there.\n\nBut overall, I think it stays pretty consistent.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGreat. Thanks again for the time.\n\nOperator\n\nOur next question comes from the line of Ned Baramov with Wells Fargo. Please proceed with your question.\n\nNed Baramov -- Wells Fargo Securities -- Analyst\n\nHey, good morning. Thanks for taking the question. It seems the inventory build in the S&L segment is now complete. You also got the proceeds from the sale of the Marcellus assets.\n\nAnd I think capex requirements should be moderating from here. So can you maybe elaborate on the decision to exercise the accordion on your revolving credit facility?\n\nJohnny Black -- Executive Vice President and Chief Financial Officer\n\nYes, sure. No problem, Ned. This is Johnny speaking again. That was really just, like you said, the Marcellus divestiture gives us an extra $205 million of liquidity.\n\nThe accordion -- the major reason we exercised it was just given the larger scale of our business now pro forma for the acquisitions in the Delaware felt it was prudent to increase the size of that just based on the level of revolver size of our peers. In addition, just given the volatility in the broader market and the uncertainty of kind of the bond markets, inability to access that in the near term, wanted to go ahead and secure the additional liquidity now at this point, just given that was an option in the credit agreement with our banks, and we were able to get that done under the existing set of terms.\n\nNed Baramov -- Wells Fargo Securities -- Analyst\n\nThat makes sense. And then, a question on capex. I know it's a little bit early, but if you can talk about capex in 2023, given some of the shift in activity from the fourth quarter into 2023?\n\nJohnny Black -- Executive Vice President and Chief Financial Officer\n\nYes. No problem. As we've talked about before, extremely excited about the level of activity on our footprint right now in fourth quarter. Obviously, that will lead into 2023 as well.\n\nWe've generally at this point, built out the backbones of our G&P systems in our kind of three core G&P areas. That, with the exception of the multiproduct system, we are building out for Chord Energy for the Western Williston Basin development plans. But overall, expecting capital to step down next year and will primarily be focused around well-connect capital and gathering expansions to meet the capacity needs of our customers in the areas they are developing for next year. So definitely stepping down next year.\n\nAs we talked about, the capital guidance is stepping down about $20 million this year. A little bit of that will be deferred into 2023. But for the overall, the program will be stepping down next year in 2023, driving our kind of free cash flow positive business model.\n\nNed Baramov -- Wells Fargo Securities -- Analyst\n\nThen maybe just one more on capex, but this time, just related to the expansion of Tres Palacios, is there any like a meaningful capex budget associated with the expansion? And then also maybe how much of the currently operating capacity is up for renewal in the next 12 months? And then I guess, last on this, given the improved demand environment, what type of rate increases would you expect to realize upon recontracting? Thank you.\n\nRobert Halpin -- President\n\nYes. Good question, Ned, and I'll take those. So the first question around the capex associated with the cavern four expansion. It's a fairly manageable capex number, roughly $30 million attached to the JV.\n\nSo $15 million net to Crestwood. Obviously, in a very attractive long-term project, getting everything going on in the markets down there with LNG and everything else. And have that underpinned with 10-year take-or-pay contracts with high investment-grade counterparties, who would be logical players in that marketplace. So very excited about that opportunity set and a very manageable amount of capital and a very attractive risk profile attached to it.\n\nFor the -- in terms of excess capacity, we're actually an open season now about 3.5 Bcf of excess capacity available for next year. And early indications look very positive around that, which I think speaks to your third question on rates are looking good.\n\nNed Baramov -- Wells Fargo Securities -- Analyst\n\nVery thorough. Thank you. That's all I had.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Elvira Scotto with RBC. Please proceed with your question.\n\nElvira Scotto -- RBC Capital Markets -- Analyst\n\nGood morning, everyone. I guess my question is just a follow-up question on the Tres Palacios expansion. Can you provide kind of what your return outlook is for that expansion? And then I think you said this open season was oversubscribed. I know you have some capacity -- excess capacity and you're saying that that early indications on contracting that look good.\n\nCurious if there's potential for even further expansions there?\n\nRobert Halpin -- President\n\nI'll answer the last piece first. I think, yes, there is opportunity for further expansion at Tres as you look out into the out years, just given all that's going on in the gas markets in South Texas, some of the volatility we've seen around some of the winter events and unpredictability of the power grade and everything else. And so, everything is looking very, very positive for their current business, as well as future expansion opportunities at that facility. I want to speak clearly to your questions around the open seasons and excess capacity.\n\nSo there's two considerations. One was the cavern four expansion process and the FERC filing that we made. That expansion is fully subscribed with PAs in place and we're working through the FERC process as we speak. That is separate and apart from the 3.5 Bcf open season, I mentioned around available capacity due to contract renewals heading into next year.\n\nSo the rate environment across both of those legs of capacity looks very, very solid, and we have a lot of increasing confidence and optimism around the direction of Tres. Your last question around return profile I would say that it's an extremely attractive project, high [teens] unlevered rate of return on simply the 10-year contract term, and I think we expect ability to optimize as we expand and grow from there.\n\nElvira Scotto -- RBC Capital Markets -- Analyst\n\nGreat. Thanks. That's all for me today.\n\nOperator\n\nThere are no further questions in the queue. I'd like to hand the call back over to Mr. Halpin for closing remarks.\n\nRobert Halpin -- President\n\nYes. Thanks, operator. And again, thanks to everybody for joining us this morning. I appreciate you taking the time.\n\nAs I said in my onset, I know Bob was disappointed not to be here but had some travel plans that he couldn't avoid. I'm sure he will be back in touch with many of you over the course of the quarter as we run into you at conferences and in some of the other holiday gathering. So as we speak, look forward to catching up, and obviously, everybody have a happy holidays upcoming.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRobert Halpin -- President\n\nDiaco Aviki -- Chief Operating Officer\n\nJohnny Black -- Executive Vice President and Chief Financial Officer\n\nSteve McGee -- JPMorgan Chase and Company -- Analyst\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nNed Baramov -- Wells Fargo Securities -- Analyst\n\nElvira Scotto -- RBC Capital Markets -- Analyst\n\nMore CEQP analysis\n\nAll earnings call transcripts"
}