{
  "companyName": "Agile Therapeutics",
  "companyTicker": "AGRX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/agile-therapeutics-agrx-q2-2022-earnings-call-tran/",
  "content": "Agile Therapeutics (AGRX 13.78%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Agile Therapeutics second quarter 2022 financial results conference call. Please note today's event is being recorded. I would now like to turn the conference over to Matt Riley, head of investor relations.\n\nMatt Riley -- Head of Investor Relations\n\nHello, everyone, and welcome to today's conference call to discuss our second quarter 2022 financial results and corporate update. Before we start, let me remind you that today's call will include forward-looking statements based on current expectations, including statements concerning our financial outlook and financing prospects for the future; our outlook for the second half of 2022; management's expectations for our future financial and operational performance, including our expectations regarding the market growth of Twirla; our business strategy; our partnership with Afaxys and its ability to promote growth; our product supply agreement with Nurx and its ability to educate patients about Twirla; our connected TV campaign and its ability to promote growth; and our assessment of the combined hormonal contraceptive market in general, among other statements regarding our plans, prospects, and expectations. Such statements represent our judgments as of today, are not promises or guarantees, and may involve risks and uncertainties that may cause actual results to differ from the results discussed in the forward-looking statements. Please refer to our filings with the SEC, which are available through the Investor Relations section of our website for information concerning risk factors that may affect the company.\n\nWe undertake no obligation to update forward-looking statements, except as required by law. The information on today's call is not intended for promotional purposes and not sufficient for prescribing decisions. Joining me on today's call are Al Altomari, Agile Therapeutics' chairman and chief executive officer; and Amy Welsh, vice president of marketing. Following our prepared remarks, we'll open the call to your questions.\n\nI will now turn the call over to Al.\n\nAl Altomari -- Chairman and Chief Executive Officer\n\nThank you, Matt, and thank you all for joining us on our call this afternoon. We had a busy and productive quarter. And on this call, I'll review the key areas of the second quarter 2022 financial performance, our current cash position and then provide a commercial update on Twirla. I'll then hand over the call to Amy Welsh, who leads our commercial efforts, to preview the upcoming launch of a new initiative with a leader in female telehealth, Nurx, a Thirty Madison reproductive health brand.\n\nWe believe the execution of our plan in the first half of 2022 has set us up well for the remainder of 2022, and I want to start off by discussing three accomplishments. We continue to grow Twirla demand and revenue. We have since significantly reduced our operating expenses, or opex. We have raised additional capital that we believe is sufficient to fund our operations through the end of 2022.\n\nFirst, let me touch on Twirla demand and the company's opex. We are proud that today we report our second consecutive quarter of growth of Twirla demand or cycle and, at the same time, reducing our opex. Total cycles for the second quarter were 21,083, which fell within our updated guided range of 21,000 to 21,500. Growth in the second quarter cycles represents a 27% increase from the first quarter of 2022 and helped us realize net product sales revenue of $2.1 million, which is also within our guided range.\n\nOpex for the second quarter of 2022 was $11.3 million, which is below the updated guidance range of $11.5 million to $12.5 million. The reduction in opex was primarily attributable to the optimization of the Twirla sales force to better focus on the most productive territories with high volume and favorable third-party reimbursement, as well as reducing expenses across all other areas of our business. These improvements in opex have resulted in a $12.2 million net loss for the second quarter of 2022. In the second half of 2022, we expect quarterly opex to be generally in line with the second quarter of 2022.\n\nCurrent and prospective investors have expressed the desire to see the company effectively manage expenses while continuing to grow the Twirla demand. By demonstrating consistent progress in both of these areas, we believe investors are beginning to see what we see, which is a company with a path of reaching our goal of becoming cash flow positive. We believe we advanced our goal of financing our operations by raising proceeds through our at-the-market, or ATM, offering in the second quarter of 2022 and via the public offering in July of 2022. The $12.2 million in net proceeds from our ATM financing activity have allowed us to extend the second quarter of 2022 with approximately $13 million in net cash.\n\nWhen combined with the $22.2 million in net proceeds from the July public offering, we believe we can fund our operations through the end of 2022. As previously announced, we have reduced our outstanding debt with Perceptive Advisors to $3 million by using the proceeds from the ATM. We paid $5 million to Perceptive during the second quarter. And in July of 2022, we made an additional prepayment of $7 million in exchange for a waive of certain financial covenants at the end of 2022 and the release of our manufacturing equipment to help us restructure our commercialization agreement with Corium.\n\nWe appreciate the many years of support from Perceptive but believe the meaningful reduction in our debt improves our balance sheet and give the company flexibility in future capital raises as well in business development and partnership opportunities. Securing this capital was a testimony to the management team and the business plans we have in place. So, we believe we're now positioned to move forward in the second half of 2022, and we believe the right question to ask us now is, how can we continue to responsibly manage expenses and continue to meaningfully grow the Twirla business? And we think the answer to this question is to continue to execute on the initiatives that drive volume in both the nonretail and the retail channels while also seeking and mobilizing new strategic initiatives that can augment our business. I will now provide an update on Afaxys and our DTC marketing efforts.\n\nI'll then turn over the call to Amy, who has been leading the charge on all of our commercial efforts, to talk to you about the upcoming launch of our collaboration with Nurx. One of the most important questions we received is, is the Afaxys relationship making impact for Agile and Twirla in the nonretail channel? While the Afaxys partnership required a significant lead time to train and deploy, we believe we're starting to see that translate into volume. In the first quarter of 2022, 485 nonretail cycles of Twirla were dispensed. In the second quarter of 2022, that number increased by 189%, with dispensing of 1,404 nonretail cycles of Twirla.\n\nWe believe there's even more upside in this channel based on the reach of the Afaxys customer network. With the recent Supreme Court ruling, we are proud to make Twirla available to nonretail channel. Amy, who you'll be hearing from shortly, galvanized our partnership with Afaxys in January of 2022, ahead of the Supreme Court decision, and we continue to believe it is important to support the Planned Parenthood organization. Through their group purchasing organization, Afaxys primarily provides services to the nonretail channel.\n\nAdditionally, a co-promotion program for Twirla with Afaxys Pharma has the potential to access over 25,000 accounts, including Planned Parenthood and college and university health centers. Therefore, we believe we can realize even more meaningful volume in the nonretail channel. And with Afaxys, we expect to continue to make inroads in Planned Parenthood and other nonretail customers. Related to college and university health centers, we are approaching the back-to-school season, which has historically been an active time of year in contraception.\n\nFor that reason, we'll be focusing on targeted promotion of our Twirla direct-to-consumer campaign on connected TV, also known as CTV. As we previously stated, we are deploying this commercial with a highly targeted, efficient focus on women in the target demographic of 18 to 24 in states that have large markets for contraceptive and potentially strong reimbursement for Twirla. Our initial run of the commercial launched in April 2022 and garnered positive results as we helped raise awareness, trial, and adoption of Twirla. Our data continue to show it, and many women who try Twirla stay on Twirla and become repeat users.\n\nBy deploying our CTV commercial at this time, when women in our target audience are having birth control conversations with the prescribers, we expect to add more long-term repeat users of Twirla. Again, we think the right question to be asking, are Afaxys and CTV programming working and having an impact on our business? We believe the answer is yes. In the first week of July 2022, we surpassed 33,739 total prescriptions dispensed for Twirla. To put that in perspective, that's more than we did all calendar year 2021, and we believe the partnership with Afaxys, along with our targeted DTC efforts, helped drive this growth.\n\nWe have always said we will explore the right partnerships and initiatives at the right time to help grow our business. We continuously look for opportunities to grow our business, and I'll turn over the call to Amy, who is excited to discuss an upcoming initiative with Nurx, which we believe can contribute to retail growth by driving our DTC and CTV efforts. Over to you, Amy.\n\nAmy Welsh -- Vice President, Marketing\n\nThank you, Al, and hello to all of you joining us today. We are excited to share that we recently signed a product supply agreement with Nurx, Thirty Madison's reproductive health brand, which will make Twirla an available option for their patients in the upcoming months. So, why is this important for Agile and Twirla? Nurx is a leader in female-focused digital healthcare among our target audience and offers patients access to its telehealth platform and expert medical providers that have prescribed contraception to more than 1 million patients. We believe the advantage of collaborating with Nurx is the sophistication of their operations.\n\nPatients who are looking for contraceptive options will be able to learn about and potentially access Twirla. By combining Twirla with Nurx's broad reach, we believe this initiative will help further engage patients and increase awareness and access for Twirla. Once the initiative is officially launched, we will make an announcement, but I want to emphasize that we are excited about the potential impact this can have on Twirla's awareness, adoption, and ultimately, cycles dispensed. Stay tuned for more.\n\nWe'd now like to give our covering analysts the opportunity to ask questions. Operator, you may now open the call for Q&A.\n\nOperator\n\nThank you. [Operator instructions] The first question is from Oren Livnat with H.C. Wainwright.\n\nOren Livnat -- H.C. Wainwright -- Analyst\n\nThanks for taking the question. I have a few. Obviously, a lot has been made in recent months about the momentum coming out of Washington toward, hopefully, enforcing this ACA contraceptive mandate that has been getting clouted by the insurance companies. And so, I'm just curious, what extent, if any -- have you seen any changes on the ground as a result of at least headlines? And is there anything you can do proactively on this front now that this, I guess, threat is out there from Washington to actually enforce it? Are you submitting -- are you collecting data and submitting reports or complaints to the administration? Are you able to leverage this language coming out of Washington in ongoing, probably around now, negotiations for next year? Just help me understand what the real effects potentially are of this new messaging.\n\nAnd then I have a couple of follow-ups.\n\nAl Altomari -- Chairman and Chief Executive Officer\n\nGreat. Hi. It's Al. Great question.\n\nSo, a lot is happening in D.C. I think you remember -- I think the most important thing that's happened is that we got our message to the right audience. The Monday after the announcement of Roe v. Wade, the Commissioner of Health and Human Services, Becerra -- Secretary Becerra put out in the press that there was 13 insurance companies, including the PBMs, that were brought to the White House to talk about the enforcement of the ACA specifically.\n\nAnd he is the right person. This issue is on kind of his doorstep, if you will, along with the two other secretaries that also regulate it, the Secretary of Treasury and Labor. So, we weren't at the meeting, but we understand it was a very hard-hitting meeting about -- if necessary, the government enforcement. Following that meeting, there was an issue of additional guidance, so the guidance in this area.\n\nAnd for the first time, Oren, we saw in that guidance the word enforcement. It was prominent. So, I think we're at that crossroad. Related to this, I go back to the Presidential Order that was signed by President Biden, where Becerra was over his shoulder, that actually empowered Health and Human Services to have, on the president's order, more, if you will, teeth into this.\n\nSo, we're at a good point, Oren. This is the first time that the guidelines included rhetoric about enforcement. I believe they're at that point. So, we're starting to see things.\n\nAs I think we pointed out before, we're starting to see some of the smaller downstream plan and some of the smaller PBMs comply more fully with the ACA. So, we're seeing some improvement there. So, your next question is, what more can we do proactively? Gosh, Oren, I wish -- I'm so proud of our group and the industry. This is not an Agile issue as we talked before, this is an industry issue.\n\nWe work collaboratively with our peers, both big and small, and formed a coalition. That really does try to educate our providers of what we're -- I mean, our regulators, what we see on the ground. So, to answer your question, sure, we provide information, and we support -- because we are on the ground. We know what's happening.\n\nSo, we work very collaboratively. And I should say, like we look forward today to work more collaboratively with the insurance companies. We really want to make Twirla and all our products available to a broader audience as we possibly can. And so, we're doing that through Afaxys.\n\nWe're doing that through the relationships we have on telemarketing that Amy will talk more about, as we talked about. So, Oren, I mean, I wish I could answer your question more fully if there's anything more we can do. I think we've done great work. The ball is really in the court now for the insurance companies to come in full compliance.\n\nAnd I certainly do believe if that doesn't happen, there needs to be enforcement. And we're just at that point. But I'm optimistic that with all the attention D.C.'s got on this that we'll see better compliance. We're seeing it, and I'd like to see more faster.\n\nSorry for the long-winded answer.\n\nOren Livnat -- H.C. Wainwright -- Analyst\n\nI'll dig into that more with you off-line, but let me follow up with a different one on Afaxys. Obviously, a really impressive quarter-over-quarter growth in that nonretail channel. And I'm just curious, are you starting to see patterns of orders, large orders, repeat orders such that you can start theoretically projecting even that channel going forward, how big it could be? Or at this point, is it still too early and really one-offs at this point? And I guess along those lines, do you have any visibility, whether it's claims data or some other sources of data that allows you to connect the dots between orders from like Planned Parenthood from Afaxys to actual dispensing of prescriptions? Do you know if they're just stocking up because it's available, especially in the wake of Roe? Or are they actually dispensing those prescriptions through those channels?\n\nAl Altomari -- Chairman and Chief Executive Officer\n\nYeah. I'll answer maybe the last part and then a couple of your points, and I'll ask Amy to comment more fully on the customer level. Their business flows through IQVIA and Symphony, as we've discussed, but on a different audit club, the nonretail audit or the institutional audit. Unfortunately, the organizations don't report prescriber-level data in that audit.\n\nSo, it's sort of like a hospital system, Oren, that -- we see it going in, we don't see the pull-through. What gives us great comfort that Amy will comment on, we see repeat orders. We love repeat orders. That -- something's walking around when we see that.\n\nI want to say also, we saw a lot happening before Roe. So, this wasn't a Roe v. Wade. That volume, so it wasn't Roe v.\n\nWade. We saw that continuously grow. And then -- but I will say our customer got significantly distracted during Roe v. Wade.\n\nThe Planned Parenthood accounts, because we have to go through a formulary situation, they came off game in July. So, we still see significant volume there. And we've got a number of customers set off. Amy will talk about what she's seeing in the repeat orders.\n\nIf you want to give a little more color on it?\n\nAmy Welsh -- Vice President, Marketing\n\nNo, thank you. And, Oren, thank you. I know we can talk more offline, but to answer your first part of your question, yes, we do now see a pattern, right? For some of the early Planned Parenthoods, they came on board in Q1. And even at the start of Q2, we're understanding which ones order monthly, which ones order weekly, what that looks like and how do we project from a forecasting perspective.\n\nAnd now that we're looking at some more -- even some larger accounts coming on board, we're able to properly forecast this in the back half of the year. So, it's not, I think, an exact science just yet, but now that we're after the middle of the year, we're able to properly plan.\n\nAl Altomari -- Chairman and Chief Executive Officer\n\nAll right. It's still -- Oren, even for us, I mean, it's a little lumpy. We're starting to understand their patterns. Some customers buy once a week.\n\nSome customers buy once a month. So, we're getting the hang of it, but it's not like a pharmacy that buys every day, right? Pharmacies get on-demand shipping. There's a little bit of -- what gets us all comfortable, we love repeat orders. We know it well, and we're seeing repeat orders.\n\nSo, that gets us excited.\n\nOren Livnat -- H.C. Wainwright -- Analyst\n\nAll right. I appreciate it. I'll let somebody else ask a question.\n\nAl Altomari -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nNo further questions at this time. I'll turn it to Mr. Altomari for any closing remarks.\n\nAl Altomari -- Chairman and Chief Executive Officer\n\nGreat. Well, thank you, all. So, just a couple of closing remarks. Our goal of the company, as you can see, are to grow the Twirla brand but also -- and a big -- and get the cash flow positive.\n\nWe believe we've taken important steps toward these goals in the second quarter by once again increasing Twirla's demand and revenue significantly, at the same time reducing our opex footprint. For the second half of 2022, our focus is on expanding growth of Twirla, which is our rallying cry, and operating -- opex in line with what you've seen in the second quarter. We do believe that our execution in the first half has set us up for success in the second half, and we'll continue to drive the initiatives. Even as we bring on new initiatives, they don't replace the previous ones.\n\nOur job is to keep executing all the initiatives that we've been talking about so we can continue to keep seeing the double-digit quarterly growth. Those initiatives that we talked about are the Afaxys in the nonretail, that's our partner; our targeted efforts with CTV and the launch of our new relationship with telemarketing channel or teleprescribing channel with Nurx; and supporting most -- or as importantly, our sales force, who's on the ground and generating demand for us. We'll continue to engage on and look at the external factors that Oren was just talking about that we're not totally in control of, but we still think we should be at the table discussing these because they do have an impact on our growth. And we believe, as I said, things are turning to the better.\n\nWe continue to believe that the enforcement of the federal law on the contraceptive coverage is good public policy. And these times, we also see this as a real opportunity for us. We're both engaged on this issue and very supportive of the progress that the Health and Human Services, in particular, has been making. Until then, we continue to focus on what we can control and delivering on what we think are achievable and a very targeted plan to build our business.\n\nSo, hopefully, you get a sense that we have strategic initiatives in both of these channels, which can really grow our business, both on the retail side and on the nonretail side. We've signed up with some great partners. And so, to me, we've got all the pieces in place to really significantly grow this business and to get to cash flow positive. So, I thank you all for listening.\n\nWe appreciate it. Looking forward to seeing more of you in the upcoming months. So, thank you again for listening in today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Riley -- Head of Investor Relations\n\nAl Altomari -- Chairman and Chief Executive Officer\n\nAmy Welsh -- Vice President, Marketing\n\nOren Livnat -- H.C. Wainwright -- Analyst\n\nMore AGRX analysis\n\nAll earnings call transcripts"
}