{
  "companyName": "Skyworks Solutions",
  "companyTicker": "SWKS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/skyworks-solutions-swks-q4-2022-earnings-call-tran/",
  "content": "Skyworks Solutions (SWKS 0.21%)\nQ4 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Skyworks Solutions fourth quarter fiscal year 2022 earnings call. This call is being recorded. At this time, I'd like to turn the call over to Mitch Haws, investor relations for Skyworks. Mr.\n\nHaws, please go ahead.\n\nMitch Haws -- Investor Relations\n\nThank you, David. Good afternoon, everyone, and welcome to Skyworks' fourth fiscal quarter and year-end 2022 conference call. With me today are Liam Griffin, our chairman, chief executive officer, and president; and Kris Sennesael, our chief financial officer. Before we begin, I would like to remind everyone that our discussion will include statements relating to future results and expectations that are or may be considered forward-looking statements.\n\nPlease refer to our earnings press release and recent SEC filings, including our annual report on Form 10-K for information on certain risks that could cause actual outcomes to differ materially and adversely from any forward-looking statements made today. Additionally, the results and guidance we will discuss include non-GAAP financial measures consistent with our past practice. Please refer to our press release within the Investor Relations section of our company website for a complete reconciliation to GAAP. With that, I'll turn the call to Liam.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nThanks, Mitch, and welcome, everyone. Before reviewing the fourth fiscal quarter results, I want to highlight the significant accomplishments that underpinned another year of record financial performance for Skyworks. Specifically, for fiscal 2022, we generated a record $5.5 billion in revenue, a 7% year-over-year increase. We achieved a record $2 billion in revenue for our broad markets, up 37% year over year, representing 36% of total revenue.\n\nWe drove earnings per share to a record of $11.24, and we returned $1.3 billion to shareholders through dividends and share repurchases. Now turning to the September quarter. Our diversified portfolio and expanding set of customers drove record Q4 performance. We delivered revenue of $1.4 billion, a Q4 record and above consensus estimates.\n\nWe achieved gross margin of 51.3% and operating margin of 37.6%. And we posted earnings per share of $3.02, exceeding our guidance by $0.12. In addition to the record financial results, we continued building a foundation for long-term growth with strong operational execution and design win momentum. In mobile, we delivered integrated platforms to the leading 5G smartphone OEMs, including flagship and mid-tier launches at Google, Samsung and others.\n\nIn IoT, we continue to gain new customers and extend the content. We partnered with Vodafone to launch the U.K.'s first WiFi 6E platform. We shipped into tri-band platforms for Frontier Communications, and we launched connectivity solutions with Amazon, supporting their WiFi 6 power-over-ethernet access points. Across the infrastructure and industrial markets, we provided programmable timing solutions for a leading optical transport OEM, simplifying 400G capacity in data centers and telco networks.\n\nWe captured new infrastructure wins at Samsung, enabling service providers to expand mid-band capacity and coverage. And we delivered comprehensive timing technologies delivered to a leading O-RAN small cell provider. In automotive, we achieved another record of quarterly results with revenue strength highlighting our connectivity and power isolation portfolio. We secured digital radio platforms with a global EV leader, as well as a top European luxury brand.\n\nWe developed onboard charging solutions for a leading Korean OEM, and we received a key supplier award from Schneider Electric, highlighting the capabilities of our power isolation portfolio. Moving forward, mobility, the shift to the cloud and the electrification of automobiles are all key catalysts driving demand for our unique solutions. The value and utility of mobile data continues to grow, with estimates of 750 million mobile subscribers being added by 2027. In parallel, global cloud revenues are expected to reach $1 trillion by 2028, representing an annual growth rate of 16%.\n\nAnd by 2030, an estimated 96% of new vehicles will feature onboard connectivity and nearly 25 of those vehicles will be electric. Each of these trends require complex connectivity engines underpinning the need for high-speed, ultra-reliable, low latency performance. Skyworks is uniquely positioned to craft faster, smaller and more efficient form factors, seamlessly integrating and customizing for an expanding set of customers, end markets and applications. As these opportunities emerge, Skyworks is poised to win with a talented team that has executed extraordinarily well in the face of macroeconomic and geopolitical headwinds.\n\nWith our market-leading profitability and scale, we are leveraging strategic technologies from high-performance filters to custom gallium arsenide and advanced packaging while elevating performance for a coveted set of diverse customers. With that, I will turn the call over to Kris.\n\nKris Sennesael -- Chief Financial Officer\n\nThanks, Liam. Skyworks revenue for the fourth fiscal quarter of 2022 was $1.407 billion, up 7% year over year and up 14% sequentially, driven by both mobile and broad markets. Broad markets were particularly strong at just over $500 million of revenue in the quarter, up 30% year over year and representing 36% of total revenue. Gross profit in the fourth quarter was $721 million, resulting in a gross margin of 51.3%, up 30 basis points year over year.\n\nOperating expenses were $192 million or 13.7% of revenue. We generated $529 million of operating income, translating into an operating margin of 37.6%. We incurred $15 million of other expenses, and our effective tax rate was 5.3%, driving net income of $486 million. Top line growth and execution on margins drove diluted earnings per share of $3.02 ahead of consensus estimates and representing growth of 24% sequentially and 15% compared to Q4 of last year.\n\nTurning to cash flow. Fourth fiscal quarter cash flow from operations was $236 million and capital expenditures were $142 million. In terms of capital allocation, during the quarter, we returned $179 million to shareholders, paying $99 million in dividends and repurchasing approximately 800,000 shares of our common stock for a total of $80 million. Let's also review our fiscal year '22 performance.\n\nRevenue grew 7% to a record of $5.5 billion, gross profit was $2.8 billion, resulting in a gross margin of 51.2%. Operating income reached $2 billion with an operating margin of 37.3%. Net income was $1.8 billion, translating into a record of $11.24 of diluted earnings per share, up 7% year over year. Cash flow from operations was $1.4 billion.\n\nAnd during fiscal '22, we returned $1.3 billion of cash back to the shareholders with $373 million in dividends and $887 million in share buybacks. So in summary, the Skyworks team delivered record revenue and earnings per share in fiscal '22, while fortifying the business with the investments that advance our technology leadership and support long-term profitable growth. Now let's move on to our outlook for Q1 of fiscal 2023. Given broad demand weakness, we expect revenue to decline on a sequential basis.\n\nSpecifically, we anticipate revenue between $1.300 billion and $1.350 billion. Gross margin is projected to be in the range of 51.25% and to 51.75%. We expect operating expenses of approximately $190 million to $193 million. Below the line, we anticipate roughly $16 million in other expense and a non-GAAP tax rate of approximately 12.5%.\n\nThe increase in the tax rate from prior fiscal years reflects the impact of the U.S. tax loss requiring the capitalization and amortization of R&D expenses for tax purposes starting in Q1 of fiscal '23. Absent legislative action to reverse the R&D capitalization rules we expect our full year fiscal '23 non-GAAP effective tax rate to be consistent with the 12.5% we are estimating for Q1. We also expect our diluted share count to be approximately 160.5 million shares.\n\nAccordingly, at the midpoint of the revenue range of $1.325 billion we intend to deliver diluted earnings per share of $2.59. And with that, I'll turn the call back over to Liam.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nThanks, Kris. As our record financials demonstrate, our portfolio is powering an increasingly broad set of applications across the market's most essential and fast and growing -- fastest growing segments. Our proven execution and deep customer partnerships position Skyworks to outperform. Moving forward, our revenue diversification, profitability and cash generation will fuel long-term growth, while increasing shareholder returns through dividends and share buybacks.\n\nThat concludes our prepared remarks. Operator, let's open the line to questions.\n\nOperator\n\nThank you. [Operator instructions] We'll take our first question from Harsh Kumar with Piper Sandler. Your line is now open.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nYeah, hey, guys. Liam, Kris and team, first of all, congratulations. These are amazing results compared to the rest of the people in the industry. Liam and Kris, you talked about macro when you talked about the guide.\n\nI wanted to understand how much of a function China and inventory problems in China is part of the decline for the December quarter? Or is U.S. a part of that as well? And then most folks are indicating that China is pretty off. I'd be curious about how your business is doing in China. So any color you have there would be appreciated.\n\nAnd then I've got a follow-up?\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nSure, Harsh. Appreciate the question. Yeah, it's certainly been volatile across the space, but I would say that China markets have been certainly a unique, unique situation. Now as you know, for us, we've been much more focused on the higher-end brands, although we're exposed to global markets broadly.\n\nWhat we have seen is Android markets contract quite a bit, and within there, the OVX portfolios and mobile have been hit quite hard. But the good news for us, Harsh, and I think you know this, is that we've been slowly driving more toward the higher-end brands. The exposure to the OVX markets have been radically reduced and derisked in our portfolio. Even going back to the early days of the Huawei and ZTE and coming down to the OVX markets, we've been able to manage through those headwinds.\n\nBut I would say that as we go forward, the portfolio that we have in front of us is outstanding, the technology developments that we put forth, the investments that we've made in scale and technology, the diversification themes that we put forth, they are all going to be incredible benefits and tailwinds for us once these markets normalize. So we feel really good about it. China is definitely a weak spot. I think in terms of relative strength, there's still some opportunity for us, but it's definitely a bumpy part of the landscape today.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nThanks, Liam. And then for my follow-up, the question that we're already getting from investors is that everybody else is sort of hurting in the industry relative to you guys. So the question that we're getting is maybe as we start to look past December, do you think that the flush in China for at least Skyworks is largely contained in the December quarter? Or do you think it's possible that China gets materially worse for you as you look into the March and maybe even the June quarter?\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. It's hard to tell for sure, Harsh. But I would say that the relationships that we have with the key customers and the visions that we have together on opportunities, we still feel like there can be some recovery here. Of course, this is unique circumstances for the industry in general, but I definitely would look at Skyworks to outperform on a relative basis.\n\nThere may be some headwinds here continued, but I expect that our team is going to be able to navigate that better than others. It's not just words. The ability to manage our fabs to deliver very, very high-performance solutions in our factories and put those together with our customers day to day. So we're not a company that puts products on the shelf and looks for our customers to pull.\n\nWe work together to drive a demand curve to be very, very much in lockstep with the players that we're with. And hopefully -- that has been in the past, and hopefully, we'll continue that we can continue to drive success with our customers knowing that we're a proven supplier and a proven solution for them.\n\nKris Sennesael -- Chief Financial Officer\n\nYeah. And maybe I would add there that December for China is definitely the low point. It can get much lower than that. The question is when does it switch back on? Is it in March? We expect some of it to start in March or the following quarter.\n\nBut again, in December, it's completely derisked, can get much lower than that.\n\nOperator\n\nNext, we'll go to Matt Ramsay with Cowen. Your line is now open.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nYeah, thank you very much, guys. Good afternoon. I guess for my first question, Liam, maybe you could talk to me about the non-mobile business and the trends there? I know there'll be a lot of questions around inventory corrections and whatnot in the smartphone market in China and with your largest customer, but I wanted to focus on the broad markets business because it's a bit more diverse. Maybe you could kind of walk us through the different sort of subsegments of that collection of businesses, the stuff that you acquired, the core Skyworks business? And if there's any puts and takes on where you're seeing weakness? I know there's some folks that across consumer devices there's certainly some weakness.\n\nThere's been hints at the start of some weakness in industrial. You guys are exposed to data center where -- and wireless, where there's some different trends in different markets. But if you could just kind of walk through the puts and takes there and what you expect that broad markets business to do in the guidance on a sequential basis, that would be really helpful? Thank you.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nSure. Sure. Good question. Just to kind of kick that off, we ended our fiscal '22 with a $2 billion broad markets business.\n\nSo that's really good. 36% of annual revenue there. So a lot of good work going on. But the opportunity there is outstanding.\n\nIf you look at some of the markets that we have today, really good position, a lot of strength in mobile, and that will continue. But the broad markets business has an entirely different set of opportunities. It's much broader. The technology nodes are more far reaching, and the customer set is extremely large.\n\nI think those are important, important points. If you think about where we're going right now, we're making strides in the automotive business. We're making more and more headwind here -- or more an upside in infrastructure. The IoT portfolios continue to grow, a lot of connectivity in that, but also looking at more industrial applications and industrial customers.\n\nSo there's a lot going on there in broad markets. And our sales and marketing teams are working every corner of the globe here to drive revenue. There's definitely for Skyworks, a lot of headroom coming from our current base, and we expect that to be a key driver going into FY '23 and beyond.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nGot it. Thank you for that, Liam. Just as my follow-up, Kris, a quick clarification in the guide for December, up, down, flat for broad markets. And I guess my second question is, we were talking to the folks at Qualcomm last night, they have a pretty good view of the global smart mobile market given their breadth.\n\nAnd they talked about weakness in mid-tier Android in China, which has been there for a while, sort of expanding to weakness globally and moving into higher tiers of the market, including the premium tier with customers wanting to hold less inventory, basically across the board in smartphone. Is that something that you guys are observing in sort of the premium tier of the market as well? Thank you.\n\nKris Sennesael -- Chief Financial Officer\n\nYeah. So clarification on broad markets, in the guide to December, so it's kind of flattish on a sequential basis, but still up, on a year-over-year basis, low single digits.\n\nOperator\n\nAll right. Next, we'll go to Raji Gill with Needham & Company. Your line is open.\n\nRaji Gill -- Needham and Company -- Analyst\n\nYeah, thank you for taking my questions, and congrats as well on kind of better-than-expected results relative to peers for the December guide. But I'm just curious going back to the December guide and the commentary around China. My understanding that you had significantly derisked your China handset business December of last year as you started to stop basically shipping into the channel. And China was a relatively small percentage of revenue, 2%, 3%, 4% in terms of smartphones, I might be mistaken there.\n\nAnd so I'm just curious, the sequential decline in mobile phone when your kind of your top customers have been ramping pretty well, better than the expectations, so just curious why the smartphone business is down sequentially in Q4 given your top customer ramp and then given your limited exposure in China?\n\nKris Sennesael -- Chief Financial Officer\n\nYeah. So there's two parts to the business, right? So there is the large customer and then is Android. Within Android, there are two large players as well. There is China, basically Oppo, Vivo, Xiaomi and then there is Samsung.\n\nWe definitely have been derisking China for the last couple of quarters, given the COVID-19 lockdowns and the well-documented softness in end customer demand in the China market. But there is also a Korean player in Android where we have been doing really well. We have seen very strong year-over-year revenue growth in fiscal '22 with that customer. However, that customer is also not immune to some of the softness on the global demand, including some of the European markets.\n\nAnd so that -- it's very well documented as well there. There is some inventory overhang at that customer and that's definitely having an impact on our December guide.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. I would also say that despite the near-term bumps with that customer, there's a great opportunity for content gains, and so we're excited about that. And there's really -- there isn't anything that's going to impede on an effort. So there's a lot of opportunity for us to round that out.\n\nI think in the China case, we have derisked appropriately but we have a great deal of opportunity with the other leading smartphone players. So -- and we're -- our teams are all over that.\n\nRaji Gill -- Needham and Company -- Analyst\n\nYeah. Thank you for that. And just for my follow-up, just a question on the inventory, both kind of internal inventory, as well as inventory in the channel. So if I look at the absolute dollar inventory, it's up about almost 30% on a year-over-year basis relative to revenue growth of 7%.\n\nSo number one, I just wanted to get understanding of how you're managing internal inventory? And then how would you characterize, I guess, smartphone channel inventory or any inventory in the broad market? That would be helpful. Thank you.\n\nKris Sennesael -- Chief Financial Officer\n\nYeah. So as it relates to the internal inventory, I'm comfortable with where inventory is on our books. Actually, in the September quarter, it came down six days in terms of days of inventory. You have to keep in mind that the products and the solutions that we bring to market are very complex, highly integrated solutions, and we're actually doing more and more in that.\n\nThat also means that actually, your production cycle times are getting extended as you have to integrate more and more, especially filters, more and more filters into our integrated solutions. In addition to that, I've talked about that before. In a supply chain challenged environment over the last couple of years, we definitely have increased buffer stocks, making sure that we can supply to our customers. In addition to that, we are level-loading our factories.\n\nWe have seasonality in our business, and we are trying to maximize factory utilizations through level loading. Having said all of that, I think the supply chain disruptions and the tightness in the supply chain is probably going to get a little bit easier. So that will allow us to potentially in the future, reduce some of those buffer stocks and will further help us to gradually bring down the days of inventory. That's on the internal inventory.\n\nOn the external, in terms of channel inventory, we manage that very carefully. I would say that's at a normal level. I think we're -- the bigger issue is some of the inventory at our customers, at the phone level, and again, that's been very well documented. There's definitely pockets of elevated inventory at the phone level, especially in the Android part of the business.\n\nOperator\n\nAnd next, we'll go to Gary Mobley with Wells Fargo Securities. Your line is open.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nHey guys, thanks for taking my question. And I need to congratulate you as well on a strong finish to the year. I wanted to start off by asking about some customer mix percentages for the fourth quarter. Specifically, what was the mix from your largest customer? And were there any other greater than 10% customers in the fourth quarter?\n\nKris Sennesael -- Chief Financial Officer\n\nYeah. So our largest customer in the September quarter was approximately 63% of our business. So great execution by the team here, reporting the launch of our largest customer, new products that translated into a 30% sequential growth or a 14% year-over-year growth. And now there is always a lot of question about this Skyworks game content or not, while those numbers clearly illustrate that we had a major uplift in content in the new products that have been launched by our large customer.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nThe other greater than 10% customers?\n\nKris Sennesael -- Chief Financial Officer\n\nNo. That was the only plus 10% customer in the quarter.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nOK. As my follow-up question, what sort of big or double-clicks into your Q1 guide? So it looks like it's about few hundred million dollars shy of what you would normally expect given the normal seasonal sequential comp. Can you quantify how much of that is just general market weakness versus what is inventory drawdown from what sounds like your Samsung?\n\nKris Sennesael -- Chief Financial Officer\n\nI think the biggest culprit is definitely an inventory overhang in Android, right? In China -- I'm talking at the phone level, not necessarily at the component level. China with Oppo, Vivo, Xiaomi and then more recently as well with our Korean customer. That is definitely the main culprit here.\n\nOperator\n\nNext, we'll go to Amber Srivastava with BMO. Your line is open.\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nThank you very much. What is the percent of the China Android business for you now, Kris?\n\nKris Sennesael -- Chief Financial Officer\n\nVery small. Very small. As I said, we've derisked it. We've been bringing it down over the last couple of quarters because we noticed that there was an inventory overhang building up, and so we derisked it, and it's now very small.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. And that being largely -- we're talking about China here. Obviously, we have other Android players that are continuing to drive solutions and have some -- I think some really good opportunities that will flow through the year.\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nThat's -- OK. I understand. And so just to make sure, when you say very small, it's like low single digit as a percent of total sales. And what was it at the peak? And then a quick follow-up, Kris, what's the capex for the full year?\n\nKris Sennesael -- Chief Financial Officer\n\nSo in fiscal '22, we did $489 million, $490 million of capex, which was 9% to revenue. So we definitely will continue to invest in the business, but we also will do that in a smart way. And given some of the demand softness that we experience now, we definitely are going to manage our capex accordingly.\n\nOperator\n\nNext, we'll go to Blayne Curtis with Barclays. Your line is now open.\n\nBlayne Curtis -- Barclays -- Analyst\n\nHey guys, thanks for taking my question. I just wanted to ask you, on March, and I know you don't want to guide March probably, but just the moving pieces, obviously, big misses from Qorvo and Qualcomm, but they did both highlight content games at Samsung, that seems to be the one offset for March. So I guess as a two part, how do you feel about your content and growth at that customer? And then if you can just more thoughts as to the two moving pieces, should the box inventory, I guess, zero, you're shipping basically nothing, but should the Korean inventory situation be done by then? And I guess, your prospects for growth kind of with new business there?\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nSure, Blayne. This is Liam. The content opportunity for us continues to grow. We have penetrated some really unique solutions with our largest customer and really the opportunities going forward are very bright.\n\nThe engagement is outstanding. And our ability to outperform technically with that customer is continuing, and I don't think that's going to change at all. So we're really bullish on that. When we go back to things like Samsung, I think there's a lot of opportunity there.\n\nWe just got an odd turn right now the way that market grew it out. But the opportunities continue to be strong. We are, I think, right now dealing with some really nice new technology that we're bringing forth in the portfolio beyond handsets. If you look at where this business is going to go after some of the inventory burns down -- and we're very, very tight on that, by the way.\n\nWe know how to work with the largest customer. We've been doing this for years, and we're very close in terms of the signals that we have that will help us manage inventories, etc. But a lot of good stuff going on there, and we should definitely expect from us to do more on the Android side, maybe absent some of the China players.\n\nBlayne Curtis -- Barclays -- Analyst\n\nThanks. And then I just wanted to get on Matt's question on broad markets and the moving pieces because obviously, consumer WiFi sounds very weak, maybe service provider and more mixed. And then you tell me, I guess, I'm curious the direction that the Silicon Labs business is because I know they were shorted for a while and have more in terms of exposure, maybe more industrial communications and such. So just thoughts on those kind of moving pieces as to what drove the beat? And then you're not seeing much of a dip in December.\n\nAre you seeing weakness in one area and its offset? Or are you just not seeing much weakness?\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. So I would look at two things. On the MSS lab portion, really good stuff. I know you've heard it from us before, but honestly, this is a deal that has gone better than we expected and it continues to increase.\n\nSo we're really excited about that. A lot of new opportunities. But then on the WiFi portfolio, as we start to move through WiFi 6 and 6E, we've got a great lead in that product line. There's a lot of technology that we're bringing to bear.\n\nIt's higher grade. It's higher performance. Consumers are just now starting to buy into that, think of that WiFi as kind of a cycle similar like 5G. There's a lot of replacement and new engagement around that portfolio, and we have a great solution.\n\nSo we're feeling good about that. And then another market that's popped up, obviously through the slab deal was automotive, and we didn't talk that much about it today yet, but it's a really critical part of the portfolio. We've got a power isolation business that's doing incredible things. We've got customer engagements with names that we wouldn't have had with the Skyworks two or three years ago.\n\nSo we're really excited about that. The brands are starting to extend the application set is getting stronger, and the technologies that we're populating are really, really critical and unique.\n\nOperator\n\nOK. Next, we'll go to Karl Ackerman with BNP Paribas. Your line is open.\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nYes. Thanks, Liam and Kris. I appreciate you taking my question. I want to follow up on Blayne's last one, which was your comps in broad markets being flattish for December.\n\nThat does seem exceptionally strong versus peers after coming off outperformance in September versus your previous guide, I think to the tune of roughly 10 points. And so I guess how much of the outperformance is from some of the backlog you have serviced that I think was initially challenged by match set issues in the last quarter or two, that seems to be loosening up. So I guess, how much of that outperformance is driven by that? And then I have a follow-up.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. I mean there's some gains with kind of unfreezing that backlog. But the truth is, it's really new design wins and new opportunities. And I know we've said it before in other calls, but the organization is really melding now into a period where we've got great technology.\n\nWe have engagements with customers on both sides, the slab side and obviously the core Skyworks, and the business development is going really well. The revenue is growing better than we thought actually, and we continue to see more and more opportunities for growth. And also, you've got pretty solid margins in that portfolio as well. So it's going really well.\n\nA lot more to do. I would bet hard on data center and automotive here in that portfolio, that's starting to really ramp. But it's been a great transaction, and there's a lot more to go from there.\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nYup. No, I appreciate that, Liam. I guess to that point, the I&A division you acquired brought you new opportunities in automotive connectivity and power isolation for electric vehicles and data center hardware. Could you just talk about that? Could you just double-click on some of those opportunities because they seem to be gaining much traction? So maybe any things you might call out on that.\n\nThank you.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. I mean -- so I'll give you an example. We're dealing with companies like AWS and Google Cloud and data center. That wasn't there a year or two ago.\n\nWe didn't have that business. We come around and look at automotive, power isolation, really critical technologies. We didn't have those a year ago or two years ago. There's a lot of great stuff going on in the infrastructure markets that we have had a position in, but now we're expanding.\n\nAnd you get deeper into the automotive space, there's just an amazing set of technologies that require wireless and/or high-performance semiconductor products, and that's what we do really well. It also helps us, as we start to move further and further into autonomous, where high-speed connectivity, wireless high-speed connectivity, is absolutely critical. We all know that. So it is really a -- it's a dovetail between great customer engagement, technology and also really diversified end markets that are growing.\n\nSo we're excited about it. And like I said, we've been outperforming on that transaction. We're putting more investment into that portfolio because it's returning phenomenally. And there have been some sticky spots with supply chain, and you mentioned that in your question, that was one of the things that would drag a bit, and I think we're getting through it.\n\nBut it's a different business where Skyworks is a little bit more of a big game hunter approach, and that's fine. But the I&A portfolio is much broader. And with the support and funding from the larger Skyworks, I think there's just incredible things that we can do competitively, and we're looking forward to that.\n\nOperator\n\nNext, we'll go to Timothy Arcuri with UBS. Your line is now open.\n\nTim Arcuri -- UBS -- Analyst\n\nThanks a lot. I have two. Kris, I have a question on the December guidance. I mean even if I zero out China Android and zero out Samsung, the big customer is down about 10% year over year, and you were down 30% year over year in September.\n\nThe units at least aren't a really big mystery for September. So I'm just trying to foot that and reconfirm that you actually gained share this launch. I think you were planning to gain 5% to 10% content. And maybe if you did gain the share, could it be that maybe that customer bought parts for this launch much earlier because of how much money they left on the table during the last cycle due to the constraints.\n\nCan you just help us fit all that?\n\nKris Sennesael -- Chief Financial Officer\n\nYeah, Tim, I think we probably will have to take that offline and go into a deeper dive there. I think you have to take into account that part of the large customer revenue is in broad markets as we sell many of our solutions into other devices than their phones, and I think that's part of the reconciliation there. But again, the business, as I said before with the large customer is strong. It was strong in September and continue to be relatively strong in December as we execute with content gains in the new form lineup and continue to support their ramp.\n\nTim Arcuri -- UBS -- Analyst\n\nOK. Yeah. Let's take it offline. I guess then the second question is really on March.\n\nAnd I know there was a question just asked about this, but to ask it maybe a little different way. So seasonality this year, obviously, is a bit wonky because December is usually not down, and it's down this time. March is usually down low teens, sequentially. I would think maybe it could be a little bit better than that.\n\nCan you sort of give us a little bit of a sense on March just in light of how December is like so much below normal seasonal? Thanks.\n\nKris Sennesael -- Chief Financial Officer\n\nTim, so this is a very volatile environment. There is macroeconomic headwinds. There is a war going on in Europe. There is COVID flares.\n\nSo we're going to stick to guiding one quarter at a time. But I mean some of the elements that you mentioned there, of course, could potentially have an impact on the March quarter. We discussed before, it will depend to a certain extent on how the inventory at the phone level gets resolved and when some of that Android business start picking up again.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. And I will say that we definitely will have visibility. So we're not blind. We're really close to the customers, and so we're on top of the transaction.\n\nSo everything that Kris said is exactly true. And I would just add that our ability to look through the channel and be engaged with our customers and our suppliers is very strong.\n\nOperator\n\nAnd next, we'll go to Edward Snyder with Charter Equity Research. Your line is now open.\n\nEd Snyder -- Charter Equity Research -- Analyst\n\nThanks a lot. Liam, first of all, congratulations on the content gain. It's a largest customer, especially with the transmit DRX parts, but I suppose that puts the rest, at least for the next year, the prelaunch rumors of a net decline in content and share loss. Our total on the part showed a lot of our filters which has been a trend for you over the last several years.\n\nI was just wondering, has this brought you to the point where you feel confident about competing for something like a mid-high band module? Or is this reliance still on really complex MUX filters put it out of reach unless we see like an RFP architecture change that would pull those modules out. I'm just trying to get a feel for -- you said really good content gains in the last several years largely on new parts. So I'm just wondering if you're going to start looking at poaching off some of the stuff that's been around for quite a long time, but you didn't have the technology for in the past. And then I have a follow-up.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. Yeah. Good question, and I appreciate that. Yeah, I mean, you've heard me say it before, we like to take the fast ball early, right? So we try to really capitalize on the most challenging opportunities and then kind of go downhill, and that's what we've been doing.\n\nAnd we really do our best work in the higher-end most challenging environments, and our design teams are exceptional, and they really enjoy this -- again, they like the hunt as well. So you're going to see us to -- I appreciate your visibility on what we've done already, which is pretty solid and more to go. But our design teams and our engineers are fired up. They want to take more.\n\nWe're going to try to grow the portfolio with the largest customer, but also with many, many others outside the largest customers. So as you know, performance wins; complexity, resolution wins; having the ability to put that all together and make it look really easy, that's what we try to do, and hopefully, that trend will continue.\n\nEd Snyder -- Charter Equity Research -- Analyst\n\nOK. And then just as a kind of housekeeping there. By our calculations, that was in excess of about 10% content gain. I just want to check, Kris, maybe if you could give us a reality check on that.\n\nIs that in the ballpark? Or do we feel like we're a little low there? And then if I could, Liam, should we expect the architectures -- WiFi 7 is coming? And should we expect the architecture of that, especially in phones to shift back to external amps? And if so, can they use those frequencies will have to be gas because Qorvo, obviously mentioned last night, it's an area of growth for them. So I was just curious about the technology breakdown for that and then if you're seeing more competition in that area.\n\nKris Sennesael -- Chief Financial Officer\n\nYeah. So first, yeah, you did a great job about the teardowns and your conclusion of content gains in excess of 10% is absolutely true.\n\nOperator\n\nAnd our final question comes from Vivek Arya with Bank of America. Your line is now open.\n\nBlake Friedman -- Bank of America Merrill Lynch -- Analyst\n\nYeah, this is Blake Friedman on for Vivek Arya. So just a quick question on your large Korean customer. I know one of your peers last night also highlighted various design wins there. So just curious, from your perspective, if you're seeing an overall expansion of the TAM at this customer or if you believe you're seeing share gains in any way?\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. Honestly, here, we're starting to see an expansion of TAM with the largest Korean customer. That's always been kind of a battle for lower cost versus performance. And what we're seeing is that performance is the driver.\n\nAnd if you look at the incremental user experience between a mid- to a higher-end phone is exceptional. And we see it here in the U.S. with the leading player, but it's also a great opportunity for mid-tier. So there's a lot to do there, and I think that's a great opportunity for us with the largest Korean player.\n\nWe've got the China business derisked, and we've got great position with the top brand. So we're looking forward to getting through some of the bumps that we're dealing with right now and moving into a stronger 2023.\n\nBlake Friedman -- Bank of America Merrill Lynch -- Analyst\n\nGreat. And then just kind of a follow-up to that, maybe more at a higher level outside of the more on the content side. At this point with 5G penetration being about like 55%, 60% of the overall market and your largest customer mostly transitioned to a full 5G suite I was just kind of hoping you could talk about the future content opportunities as the cycle matures, and more importantly, from generation-to-generation, what on average maybe the expected content growth should be?\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nYeah. I mean the utility of these high-end smartphones is so critical to the user. So we've been seeing consistently opportunity for growth in what we call content, our technology reach, and we're not seeing that abate. And the nice thing is it's also branching out.\n\nIt isn't just -- we've done some great work with Bulk Acoustic Wave and TC-SAW and capitalizing on our in-house gallium arsenide, all these unique solutions and bringing them together in a holistic solution that can go into multi-end markets. The good news is, the companies that we deal with, especially the largest ones, they want to push the envelope. They want the performance to get stronger. They want the performance to drive more applications, and that drives more technology reach for Skyworks.\n\nSo we really don't see that change. And the usage cases around mobility and connectivity, I think everyone on this call, we all know it. It's really vibrant. We'll have pockets at quarters where things get bumpy, but the net output here is going to be up onto the right and the technologies and the know-how to put that together and engage with the right customers is, I think, very critical, and it's something that we continually try to improve upon.\n\nOperator\n\nLadies and gentlemen, that concludes today's question-and-answer session. I'll now turn the call back over to Mr. Griffin for any closing remarks.\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nThank you all for participating in today's call. We look forward to talking to you at upcoming investor conferences during the quarter. Thanks, again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMitch Haws -- Investor Relations\n\nLiam Griffin -- Chairman, Chief Executive Officer, and President\n\nKris Sennesael -- Chief Financial Officer\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nRaji Gill -- Needham and Company -- Analyst\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nBlayne Curtis -- Barclays -- Analyst\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nTim Arcuri -- UBS -- Analyst\n\nEd Snyder -- Charter Equity Research -- Analyst\n\nBlake Friedman -- Bank of America Merrill Lynch -- Analyst\n\nMore SWKS analysis\n\nAll earnings call transcripts"
}