{
  "companyName": "Home Depot",
  "companyTicker": "HD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/15/home-depot-hd-q3-2022-earnings-call-transcript/",
  "content": "Home Depot (HD -1.42%)\nQ3 2022 Earnings Call\nNov 15, 2022, 9:00 a.m. ET\n\nOperator\n\nGreetings and welcome to the Home Depot third-quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. A brief question and answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Isabel Janci. Please go ahead.\n\nIsabel Janci -- Vice President, Investor Relations\n\nThank you, Christine, and good morning, everyone. Welcome to Home Depot's third-quarter 2022 earnings call. Joining us on our call today are Ted Decker, chair, president, and CEO; Jeff Kinnard, our executive vice president of merchandizing; and Richard McPhail, executive vice president and chief financial officer. Following our prepared remarks, the call will be open for questions.\n\nQuestions will be limited to analysts and investors. And as a reminder, please limit yourself to one question and one follow-up. If we are unable to get to your question during the call, please call our investor relations department at 770-384-2387. Before I turn the call over to Ted, let me remind you that today's press release and the presentations made by our executives include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995.\n\nThese statements are subject to risks and uncertainties that could cause actual results to differ materially from our expectations and projections. These risks and uncertainties include, but are not limited to, the factors identified in the release and in our filings with the Securities and Exchange Commission. Today's presentations will also include certain non-GAAP measures. Reconciliation of these measures is provided on our website.\n\nNow, let me turn the call over to Ted.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nThank you, Isabel, and good morning, everyone. We appreciate you joining us on our call this morning. Sales for the third quarter were $38.9 billion, up 5.6% from the same period last year. Comp sales are up 4.3% from the same period last year.\n\nAnd our U.S. stores had positive comps of 4.5%. Diluted earnings per share with $4.24 in the third quarter compared to $3.92 in the third quarter of last year. From a geographical perspective, each of our 19 U.S.\n\nregions delivered positive comps versus last year, while Mexico posted comps above the company average, and Canada, below the company average, both in local currency. The team has done a fantastic job serving our customers while continued to navigate global supply chain disruptions, inflation in a tight labor market. This quarter also marked another active hurricane season. As they always do, our associates and suppliers did an incredible job supporting those in the path of both hurricanes Fiona and Ian.\n\nMy thoughts continue to be with those impacted by these storms. Our results in the quarter reflect continued solid demand for home improvement projects. While we did see some deceleration in certain products and categories, as Jeff will detail, the project business remains strong across most of our departments. We also saw year-over-year growth with both our pro and DIY customers in the quarter.\n\nWhile the business performed very well and our consumer remains resilient, we are navigating a unique environment. We can't predict how the evolving macroeconomic backdrop will impact our customer going forward. However, we continue to closely monitor elasticities and trends across our business and believe we have the tools, team, and the experience to effectively manage in any environment. Despite near-term uncertainties, we believe the long-term underpinnings of demand for home improvement remain strong.\n\nWe are well positioned to leverage our distinct competitive advantages to capitalize on compelling growth opportunities in our space. We are pleased with the traction we are seeing in our interconnected business as we continue to build on our momentum with both our pro and DIY customers. For example, as we add better functionality and capabilities in our Home Depot app, we see greater engagement. In fact, throughout the year, we have seen strong double-digit growth in monthly active users versus last year.\n\nThe growth is attributable to several enhancements we have made, including an improved online experience for our Pro loyalty program, the seamless connectivity we've provided for our military program, and the launch of our new store mode feature, which makes navigating the store and interacting with products much easier. These enhancements translate to less friction of our customers as they navigate the digital world and connect to the physical world. We also remain focused on driving continuous improvement in productivity within the four walls of our store to enhance both the associates' and customer experience. We are currently launching a new application on our in-store mobile devices called Sidekick, which is an in-aisle tasking tool designed to direct associates to the highest-value tasks in real time.\n\nThe tool direct associates to key bays where on-shelf availability is low or outs exist. By simplifying our operations, we can generate productivity, enhance both the customer and associate experience. For the pro customer, we remain focused on investing in an ecosystem of capabilities, including enhanced fulfillment and more personalized online experience, as well as other business management tools to drive deeper engagement with these customers. While we are focused on removing friction from the shopping experience, we are also onboarding capabilities to help our pros run their businesses more efficiently.\n\nOur pros tell us that finding qualified, skilled labor is a pain point in their business. To that end, we recently announced a Path to Pro platform, connecting skilled tradespeople with hiring trades professionals. This unique and proprietary platform is available at no cost to all Pro Xtra members. It already contains thousands of candidates, and pros have begun posting their open jobs.\n\nOur team remains focused on what is most important: our associates and customers. Our merchants, store and net teams, supplier partners, and supply chain teams did an outstanding job delivering value and service to our customers throughout the quarter. I'd like to close by thanking them for their dedication and hard work. With that, let me turn the call over to Jeff.\n\nJeff Kinnard -- Executive Vice President, Merchandising\n\nThank you, Ted. And good morning, everyone. I want to start by also thanking all of our associates and supplier partners for their ongoing commitment to serving our customers and communities. As you heard from Ted during the third quarter, we continue to see solid demand for home improvement projects and strong execution from our teams and supplier partners.\n\nTurning to our comp performance during the third quarter, 11 of our 14 merchandising departments posted positive comps. Build materials, plumbing, lumber, millwork, paint, and hardware had comps above the company average. All other departments, with the exception of appliances, flooring, and indoor garden, were positive but below the company average. During the third quarter, our comp average ticket increased 8.8%, and comp transactions decreased 4.4%.\n\nThe growth in our comp average ticket was driven primarily by inflation across our product categories, as well as demand for new and innovative products. Inflation from core commodity categories positively impacted our average ticket growth by approximately 200 basis points during the third quarter, driven by inflation in build materials, lumber, and copper. Big-ticket comp transactions or those over $1,000 were up 10.1% compared to the third quarter of last year. We saw big-ticket strength across many pro-heavy categories like fasteners, pipe and fittings, and gypsum.\n\nDuring the third quarter, both pro and DIY sales growth were positive with pro outpacing DIY. We're encouraged by the continued momentum we were seeing with both our pro and DIY customers. In addition, our pros tell us their backlogs remain strong. During the quarter, our project business remained healthy.\n\nThis can be seen in the double-digit comp performance of our building materials, plumbing, lumber, and millwork departments, as well as in other categories like fencing, siding, conduit boxes and fittings, tubs and showers, and cabinets. We're also encouraged by the momentum we continue to see with our larger pro customers. The medium to large repair or model pros continue to post strong double-digit comps. We believe we are building a unique, interconnected pro ecosystem that will increase our ability to grow share in a $450 billion addressable pro space.\n\nTo serve the pro, it's about removing friction through a multitude of enhanced product offerings and capabilities. We feel confident that the investments across our pro ecosystem are resonating and that we continue to gain share with this important customer. As you know, we've been on a journey to remove friction from our interconnected shopping experience. The great example of this was our announcement in December of 2017 to own more of the appliance delivery end to end.\n\nAnd in the third quarter, we achieved an important milestone. We now have 100% of our appliance delivery volume managed through our market delivery operations. This has significantly improved the customer experience. On-time and complete deliveries have increased meaningfully.\n\nAnd customer satisfaction metrics have increased by approximately six percentage points compared to the third quarter of last year. Turning to total company online sales. We were very pleased with the performance of our digital assets. Sales leveraging our digital platforms increased nearly 10% compared to the third quarter of last year.\n\nThis was driven by our continued investments which are resonating with our customers. For example, during the quarter, lead times improved across different fulfillment capabilities, which drove greater conversion. For those customers that chose to transact with us online during the third quarter, approximately 50% of our online orders were fulfilled through our stores, a testament to the power of our interconnected retail strategy. We're excited about the holiday season.\n\nDuring the third quarter, we hosted our Halloween event and could not be happier with the result. 2022 was a record sales year for Halloween programs, both in-store and online as our customers continue to add to their collection with our unique and exclusive assortment. As we turn our attention to the fourth quarter, we intend to continue this momentum with our annual holiday Black Friday and Gift Center events. Our teams have sourced the most compelling artificial tree assortment we have ever had, which makes it easier for our customers to find the perfect tree for their holiday.\n\nIn terms of our decorative holiday program, we couldn't be happier with our industry-leading assortment with extraordinary features and functionality that looks great and also reflects exceptional value. In our Gift Center, we continue to lean into brands that matter most for our customers. With our assortment of Milwaukee, Ryobi, Makita, Dewalt, Rigid, Husky, and more. Earlier this fall, we launched the next generation of the Milwaukee Drill and Drive M18 Fuel lineup, offering more power, run time, and increased safety for our customers.\n\nIn our Gift Center, we are featuring this innovation [Inaudible] with four-tool and two-tool. And we have our exclusive Rigid four-tool, 80-volt brushless combination kit with two free tool, all backed by our lifetime service agreement. And in appliances, we have exciting offers on LG, Samsung, Bosch, Whirlpool, GE, and Frigidaire. We have multiple exclusive offers, including the LG side-by-side refrigerator with Craft Ice, a great innovation in ice making.\n\nAs with prior years, we've extended these events over several weeks, and we believe we are well positioned with the right brands, the right inventory, and a great customer experience. With that, I'd like to turn the call over to Richard.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nThank you, Jeff. And good morning, everyone. In the third quarter, total sales were $38.9 billion, an increase of $2.1 billion, or 5.6%, from last year. During the third quarter, our total company costs were positive 4.3% with positive comps of 7.1% in August, 4.4% in September, and 2.1% in October.\n\nComps in the U.S. were positive 4.5% for the quarter with positive comps of 7.2% in August, 4.2% in September, and 2.5% in October. On a three-year basis, monthly costs were consistent across the quarter. In the third quarter, our gross margin was approximately 34%, a decrease of approximately 10 basis points from last year, primarily driven by supply chain investments.\n\nWe continue to successfully offset significant transportation and product cost pressures while maintaining our position as a customers' advocate for value. During the third quarter, operating expense as a percent of sales decreased 18 basis points to 18.2%. Our operating expense performance was in line with our expectations, which reflected continued wage investments as well as planned investments designed to drive efficiency in our store environment. Our operating margin for the third quarter was 15.8%, compared to 15.7% in the third quarter of 2021.\n\nInterest and other expense for the third quarter increased by $80 million to $406 million due primarily to higher long-term debt levels than one year ago. In the third quarter, our effective tax rate was 24.4%, down from 24.5% in the third quarter of fiscal 2021. Our diluted earnings per share for the third quarter were $4.24, an increase of 8.2% compared to the third quarter of 2021. During the third quarter, we opened three new stores, one in the U.S.\n\nand two in Mexico, bringing our total store count to 2,319. Retail selling square footage was approximately 241 million square feet. At the end of the third quarter, inventories were $25.7 billion, up $5.1 billion compared to the third quarter of 2021. Inventory turns were 4.3 times, down from 5.4 times last year.\n\nAnd our inventory growth primarily reflects product cost inflation and strategic decisions in response to continued global supply chain disruption. Turning to capital allocation. After investing in our business and paying our dividend, it is our intent to return excess cash to shareholders in the form of share repurchases. During the third quarter, we invested $770 million back into our business in the form of capital expenditures.\n\nAnd during the quarter, we paid approximately $1.9 billion in dividends to our shareholders, and we returned approximately $1.2 billion to shareholders in the form of share repurchases. Computed on the average of beginning and ending long-term debt and equity for the trailing 12 months, return on invested capital was approximately 43.3%, down from 43.9% in the third quarter of fiscal 2021. Now, I will comment on our guidance for fiscal 2022. As you heard from Ted, we are very pleased with the solid performance we saw during the third quarter.\n\nToday, we are reaffirming our guidance for 2022. We expect comp sales growth of approximately 3% for fiscal 2022. We expect comp sales to be positive for the fourth quarter. We expect our fiscal 2022 operating margin to be approximately 15.4% for the year.\n\nAnd we expect mid-single-digit percentage growth in diluted earnings per share compared to fiscal 2021. As we've said throughout the year, we find ourselves in a unique environment with many crosscurrents. We are operating in a broad-based inflationary environment not seen in four decades while managing through constrained global supply chain conditions all against the backdrop of monetary policy shifts intended to moderate demand. To date, our customer has proven resilient.\n\nWe feel confident that we will continue to manage with flexibility through a dynamic environment while growing faster than our market and delivering exceptional shareholder value. Before opening the call for questions. We are pleased to announce that we will be holding an investor conference on June 13th, 2023, in New York City. We will share more details in the near future.\n\nBut for now, please hold the date. Thank you for your participation in today's call. And, Christine, we are now ready for questions.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for questions. Thank you.\n\nOur first question comes from the line of Michael Lasser with UBS. Please proceed with your question.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. The sentiment and narrative around your stock is so heavily focused right now on factors that are out of Home Depot's control, like the state of the housing market and its ultimate impact on home improvement demand. So, can you help frame what is in your control? If home improvement demand, for example, was down 5% next year, is the state of your initiatives such that Home Depot could gain a couple hundred basis points of market share, and in that environment, you'd only be down, call it, 3%? And if your comps were only down 3%, given the flexibility that you have with your cost structure, coupled with your current capitalization that affords you to buy back a lot of stock, you could actually grow earnings in that sort of scenario.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nHey, good morning, Michael. Thanks for the question. A lot of detail there that I won't get into specifics, but -- but assure you that, you know, we look forward to taking share in any environment. There is a lot of noise around housing and home improvement, and -- and you've heard some of this before.\n\nBut if I can just step back a minute and lay out the environment the way we see it. I mean, we still feel very good, Michael, about our business. We just reported another strong quarter and reaffirmed our guidance for the year. And remember, we've grown this business $47 billion in the last two and three quarters a year.\n\nFrom our core customer, we think our customer is still healthy. I mean, our customer tends to have a good job, growing wages, strong balance sheets. They own their home and have seen increased home equity. However, as Richard said in his prepared notes, I mean, it is -- it is a unique environment with lots of crosscurrents of inflation, rising interest rates, etc.\n\nBut given all that, our customer has remained resilient and engaged. As we said, both our pro and DIY customers grew again in this past quarter. Project demand in particular is very strong. Our pro sales are strong, and our pro intercepts with our customers indicate that the backlogs are still very healthy.\n\nCustomers are still spending lots of time at home. We're not all back at work five days a week. These homes continue to age, and they're worth 40% more than they were pre-pandemic. Now, I'm sure we'll get into some housing questions.\n\nIn housing, values may go down a bit, but we're still going to be up meaningfully on a two-year basis. We did see some deceleration in certain products and categories. And again, that's -- that's difficult to get at the root cause. Is it -- is that consumer pulling back in general? Is there a reaction to price inflation? Do we have some pull forward in certain categories that people bought so much in certain categories during the pandemic, or are they moving on to other projects? Our transactions have been stronger than initially thought with this inflation.\n\nI mean, that's why we have -- we have raised guidance throughout the year is that the price sensitivity wasn't as strong as we thought it would be. However, our guidance implies that fourth-quarter comps will be the lowest for the year, albeit positive. And we have tougher comps from Q4 last year. So, with all that as a backdrop, I mean, as I said in my comments, we believe we have the team, the strategy, the initiatives with each of our consumer and pro, and we'll continue to take share in any operating environment.\n\nAnd while there -- there may be some -- some of these crosscurrents in these next X quarters in housing, we still feel the backdrop of housing, the fundamental shortage of housing in this country and the aging of homes is incredibly strong for our space in the medium to long term.\n\nMichael Lasser -- UBS -- Analyst\n\nThat's very helpful framework. But in light of some of the deceleration that you're seeing, one might assume that that might be a prelude to what -- what could be a -- a more pronounced deceleration into '23, especially as some of the material benefit from inflation that the Home Depot has experienced this year fades. So, is it best to recalibrate our expectations and -- and think and model more about a negative comp in 2023 for the Home Depot even if it's just slightly negative?\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nWell, we'll talk about '23 after our fourth-quarter earnings call in February. You know, again, we -- we remain incredibly bullish. There are certainly factors outside of our control. Are the Fed actions going to ultimately, you know, take us to a recession? If so, how deep that might be? Those are things that, you know, we're all wrestling with and everyone has an opinion.\n\nBut we're focused on what we can control, rolling out our strategies, delighting our customers, and taking share in any environment.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much and have a great holiday.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Simeon Gutman with Morgan Stanley. Please proceed with your question.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood morning, everyone. Focusing on housing. So, housing metrics are decelerating much quicker than your comps or your comp stack. Is this just a lag effect? I don't know if this -- this lag is longer than other lags or -- and, Ted, you just made the case that -- that maybe sales decouple from these metrics.\n\nI assume it's temporary because of home equity and we're spending more time in our home. Or are you suggesting that maybe it's not temporary because we're spending more time on our home?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nSo, Simeon, it's Richard. Good morning. Just to maybe sort of put some further points on -- on Ted's backdrop, you know, a lot is made of -- of home prices. And, you know, home price appreciation, the change in home price appreciation, we think, has always driven home improvement demand.\n\nAnd we've held that view for a long time. But what we also really ran into even, I'd call it, the middle part of the last decade, was that as -- as -- as home prices began to, call it, become more steady, price discovery, in our view, became a little bit harder. And so, the question has always been, number one, is there a lag to spending? Are you going to spend in that specific period when you know your home price is appreciated? Or is there a halo effect that lags over multiple periods? And my hypothesis is, yes, that's what we saw in the last decade. And I think that that just sort of holds true from an intuitive perspective.\n\nBut I think there's another -- there's so many points that are important. Yeah, I think we are all somewhat anchored to what we observed in 2008 and '09. And many of the folks on this call -- in fact, almost all of us were here during 2008 and 2009. You had a situation where 25% of homeowners were underwater on their mortgages.\n\nYou had really a relationship that we saw in our comp sales driven by acceleration in foreclosures. So, it wasn't -- we were not in the period of home price depreciation that you're talking about, single digits. We had a massive price correction in 2006 to 2008. There was price discovery every single day on the front of the newspaper and millions of forced sellers that were creating that price discovery.\n\nWhen I look at the situation now, as Ted said, we have home price appreciation of essentially 40% year-over-year -- sorry, over the last three years. In fact, year over year, home prices are up 13%. Since December, home prices are up 8%. It is decelerating.\n\nBut I think if you ask or you listen to most observers, I think most people are calling for if there is a correction, a modest one. So, my question is, how will the price discovery occur? And then, second is -- is that price depreciation actually meaningful enough to change folks' spending behavior? Because, as Ted said, if you're a homeowner, you've done quite well from a balance sheet perspective, you likely have a job, you likely have cash in the bank. And then, we're seeing another just interesting dynamic where, with mortgage rates increasing, our customer is becoming more and more likely to stay in place and begin a project. So, improve in place.\n\nAnd so, just sort of going back to the health of the homeowner back in over a decade ago, 25% of mortgages were underwater back then. Let's look at the credit standing of the housing stock in the U.S. now. Of owner-occupied households, 40% are owned outright, no mortgage.\n\nOf the 60%, they do have a mortgage, 90% of those mortgages are fixed rate, 73% of those mortgages are fixed rate below 4%. So, we are now seeing a dynamic of stay in place and improve your home. And that's what our customers are telling us, and that's what the pros are telling us their customers are telling them.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThat's helpful. A follow-up on another very easy-to-forecast variable: inflation. Can you -- can you frame maybe what percentage of your sales could be at risk from disinflation? Is it 100? Or it shouldn't be 100 because some parts of your -- of your product mix aren't going to be vulnerable.\n\nJeff Kinnard -- Executive Vice President, Merchandising\n\nHi. Good morning. It's Jeff Kinnard. We are watching inflation very carefully.\n\nWe have seen some deceleration in inflation in the recent months, which is -- which is good for our consumers. But broadly, we are still experiencing some inflation in some specific categories. I'll call it the lumber market. We have seen a deflationary market in lumber over the recent weeks.\n\nIn fact, we've seen a lot of stabilization in that industry versus the prior two years. I did call it an impact from inflation in lumber for the quarter. That was more representative of the early days -- the early days in the quarter. But we're looking at it carefully.\n\nWe're managing category by category. We're working closely with our suppliers in terms of managing cost and cost components. We have a very good and deep understanding of virtually all cost components of all products that we sell. And again, we're managing it very closely.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThanks very much.\n\nOperator\n\nOur next question comes from the line of Chris Horvers with J.P. Morgan. Please proceed with your question.\n\nChris Horvers -- J.P. Morgan -- Analyst\n\nThanks. Good morning, everybody. So, maybe to summarize your comments today, I guess, it's that you're -- you are incrementally more cautious because you're seeing certain categories maybe become slowing or more volatile. But it's not dramatic and it's more the uncertainty of what the Fed, you know -- the Fed's rate raising is going to affect the business in the future potentially.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nThat's -- yeah, I think that's a fair representation, Chris.\n\nChris Horvers -- J.P. Morgan -- Analyst\n\nOK. And then, you know, so, can you talk about some of the KPIs you're watching? You know, I guess, what categories specifically are concerning you? Are you seeing DIY trade down? Are you seeing maybe unit trends in the project business slowing? It seems like, you know, the commodity inflation is driving some of -- some of your best project categories. And are you seeing any more sort of volatility from the consumer, I guess, over the past couple of months that -- that is adding that element of caution?\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nWell, I would say that the healthiest thing we're seeing -- as you can imagine, we look at every -- every data set and by geography and category, etc.. The -- the healthiest thing about the business is the project nature of the demand. Now we are a project-oriented business. And, you know, all the categories that Jeff called out that is -- that is driving that project demand remains incredibly strong.\n\nAnd we look at it with both our pro customers and with household pros versus consumers. And that project demand remains strong with each of the pro and the consumer. You know, some of the -- the caution is in, again, you know, was it pull forward, is that finally some price sensitivity on some of these, you know, whole good items. You know, we talked about certain appliance categories or grills.\n\nYou know, those -- those definitely have -- have come off the boil. And, you know, again, is it -- is everyone has purchased in the last three years a lot of those categories, and they've -- they've moved into more project and home improvement, or is there, you know, a reaction to -- to inflation. That -- that's what's a little harder to tease out. Here's a case in point.\n\nLook at our indoor garden business. Two -- two big categories, you might say, are more discretionary: grills and patio. Grills was down. But patio, we had one of the strongest patio quarters that I can remember.\n\nSo, there are definitely some mixed signals. It's -- it's definitely caught our attention, and that's why we're cautious.\n\nChris Horvers -- J.P. Morgan -- Analyst\n\nThen, I guess just following up, you talked about consistent three-year trends over the month. You know, obviously, October was an incredibly strong month last year. I guess, you know, is that -- was that just, you know -- we've heard a lot about the consumer shopping early last year and the holiday season is normalizing. To what extent do you think that maybe the election has had an impact on the business in November? And -- and just overall, how are you thinking about, you know, the positioning today and then into the holiday season?\n\nJeff Kinnard -- Executive Vice President, Merchandising\n\nHi. Jeff -- Jeff Kinnard. What -- you know, we see some normalization back to 2019 in terms of the consumer trend. In the last couple of years, we've seen a pull forward and concerns of supply chain-driven shortages across retail.\n\nSo, we do see -- we do see, potentially, just a return back to kind of more normal holiday spend by the consumer. As I commented in our prepared remarks, we feel very good about our Black Friday, our Gift Center, our -- our -- our decorative holiday assortments. And we're excited about the overall Black Friday season.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nAnd just in case you don't have the numbers in front of you -- you know, Chris, you called monthly cadence. So, really our comps were consistent across the month, so not just the three-year, but also the two-year basis. Just keeping in mind that last year's comps in August, September, and October were 31, 45, and 99 sequentially So, you know, if you look at a two- or three-year basis, maybe smoothing some of that out, you know, that one year mostly don't tell you quite as much.\n\nChris Horvers -- J.P. Morgan -- Analyst\n\nGot it. That's very helpful. Thanks very much.\n\nOperator\n\nOur next question comes from the line of Steven Zaccone with Citi. Please proceed with your question.\n\nSteven Zaccone -- Citi -- Analyst\n\nGood morning. Thanks for taking my questions, guys. Congrats on the strong results. To follow up on Chris' commentary about the recent performance, has there been any impact from the hurricane recovery spend to call out maybe at the end of the third quarter and, thus far, 4Q?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nIt was -- it was relatively minimal. So, we think we had about $120 million impact from -- from hurricanes this quarter. But keep in mind, we're overlapping a similar amount from last year. So, these hurricanes and storm impacts extend across quarters.\n\nYou know, what we're more concerned about is the health and safety of our customers and our associates. And our -- our minds and hearts are serving with them right now.\n\nSteven Zaccone -- Citi -- Analyst\n\nOK. Thanks. A lot of discussion around the top-line outlook given the housing uncertainty, but I wanted to focus on margin. You know, I know there's not a target in place on a multiyear basis, but can you help us think through the levers to protect margin rate if sales growth were to weaken in the future? I guess specific to gross margin, is there an opportunity for gross margin rate improvement as supply chain costs ease?\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nWell, we're managing margin closely, Steven. We look at it quarter on quarter. There's a lot of ins and outs when it comes to -- when it comes to margin as we look forward.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nYou know, we look-- I'll just add that we -- we think we have the tools and the experience and the people to manage price and cost as well as anyone else here. We've proven that over the last three years. There's been immense disruption right in our value chain. And I think the proof is in the pudding when you look back at our history.\n\nSteven Zaccone -- Citi -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from the line of Scot Ciccarelli with Truist. Please proceed with your question.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGood morning, everyone. So, I think everyone here kind of understands there's some uncertainty around the broader home improvement environment given what's happened with interest rates. But how are you guys thinking about the growth potential prospects of the large pro business as we roll into '23? You guys will obviously have a lot more infrastructure and more relationships built at that stage.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nThanks for the question, Scot. We couldn't be more excited as we've identified a $450 billion addressable market and an understanding of what capabilities we need to deliver to get a larger share of wallet with that large pro repair remodeler. I've been here, as you may know, over 22 years, and we've always known what we needed to do to capture or share a wallet with that pro. And what's so exciting is that Hector and his team right now are actually building out the capability set to get more share of wallet with that large pro.\n\nAnd as we build out these capabilities and introduce them to the customers, we're seeing the engagement and the incrementality of sales growth take off. And, Hector, if you give us a little more insight of what you're building, that would be great.\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nYes. Just we continue to be super excited about the response from our pros as we continue to enable capabilities to remove friction from our ecosystem. I'm very excited about the expansion of our outside sales resources and the growth that those customers are driving. We're seeing those customers grow, not just with direct sales, with our outsize -- outside sales associates, but they're also engaging more on our digital platform and engaging more in our stores for that online purchase.\n\nAnd as we continue to grow around other capabilities, whether it's in the B2B, digital platform, or in-store platform, we just continue to be super excited about the response of our pros. And we are just removing friction where we were in friction from all the different channels, and our customers continue to engage with us more and more.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nIs there a way to potentially size or at least for us to, you know, contextually think about kind of what those potential revenue ramp is as these capabilities get built out?\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nYou know, the -- as Ted said, we're excited. One of the reasons we're so excited because it's such a fragmented market -- such a fragmented market of suppliers. And so, we just think the opportunity is, is exciting and tremendous. And part of the excitement is it's hard to size.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nBut -- but I can say, I mean, we don't break out these numbers. But, you know, each of pro and consumer grew again this quarter. And, you know, the pro yet again grew meaningfully faster than the consumer. In our large pro, the ones who are engaging with -- with Hector and team, are developing, are growing the fastest yet.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nVery helpful. OK. Thanks, guys.\n\nOperator\n\nOur next question comes from the line of Chuck Grom with Gordon Haskett. Please proceed with your question.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey. Thanks. Good morning. Great quarter.\n\nOverall transactions down a little over 4%. I was wondering if you could pack that for us across the pro and DIY customer base.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nI don't know if we -- we break that out, but the -- the strongest, again, was the large pro.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. All right. No problem.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nYou know, what I'd say -- I mean, the way to put it, too, is our pros shop across our assortment. So, you're going to sort of see similar dynamics in our ticket transaction across the business, generally speaking. But as Ted said, the -- the strength --the strength is with pro.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Makes sense. And then, on -- on the cost pressure front, as costs start to ease, how do you think about the pricing environment? Do you think you and peers are likely to hold on to prices as costs start to moderate and you retain that margin as a result? Or are you likely to lower prices and try to maintain the same gross margin -- gross profit margin dollars?\n\nJeff Kinnard -- Executive Vice President, Merchandising\n\nChuck, we -- we watch this very closely. You know, we are the customers' advocate for value, and we watch the market and our competitors very closely. I will say that there has been an enormous shift to trading up to more innovation and more innovative products. We see that in our tool category.\n\nWe see that in the outdoor gardening business. We could see it across multiple categories. We still see that willingness to trade up for great value and great innovation.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nBut -- and on the cost side, Chuck, it's definitely easing. So, you look at commodities in particular, commodities have been down six, seven months in a row. You know, lumber is obviously way down, peaking at nearly 1,500 dollars to now under 500 from peak to current during these last three years. However, we still see inflation across the store.\n\nSo, while some will be coming down in certain categories with costs and retails, our forecast at this point is that net inflationary cost pressures continue into 2023.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from the line of Brian Nagel with Oppenheimer. Please proceed with your question.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHey, good morning. Nice quarter. Congrats.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nThank you.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nSo, my first question, I think -- I just want to ask Chuck's question maybe a little differently. Well, with regard to inflation, what we've seen now for a while was Home Depot has done a remarkable job of kind of strategically passing along inflation. So, Ted, you mentioned a few times now you're starting to see some inflationary pressures ease. The question I have is, are you seeing -- or would you expect that, as inflationary pressures ease even if price doesn't necessarily go down, you see some type of elasticity in demand, means that unit demand would pick up in that type of environment?\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nWell, you know, it's a -- it's a great question. And you could say, hey, if elasticities weren't as sensitive on the up, would they also likely not be on the moderation, if you will. You know, it's -- it's to be determined. I think, you know, broadly, the price sensitivity wasn't as sharp as we expected the last two years.\n\nThat's why, you know, we started each year with more or less a flat forecast expectation and beaten that each of the past two years. On certain commodities lumber, copper wire, where we're pricing to market weekly, you see a much more classic reaction to price and unit productivity. With other categories -- and I -- I hate to bring up grills again, but, you know, there are some classic price points on sort of classic grills. And when we saw those -- those grills get up over $600, you know, we saw a more dramatic drop-off in engagement.\n\nAnd Jeff and the team worked those prices down, you know, even -- even to the low 400s -- or high 400s, well, 500s, you saw a response with -- with unit productivity. Across the board, though, there has been, you know -- Jeff mentioned this. There has been so much innovation across our categories. You think of the dramatic shift of outdoor power equipment and power tools and appliances and what the features and benefits of these products are, the technology embedded in these products.\n\nYou know, I'm not sure it's quite an iPhone, but, you know, we're -- we're getting close to -- to power tools being, you know, in that -- in that genre. And people love the newness and the innovation there, albeit higher prices. But people are responding and buying. So, I think it's -- it's a mix, Brian, across the -- the categories.\n\nAnd that's what Jeff and our merchant teams do such a great job managing every day.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nGot it. That's very helpful. Then my follow-up and a quick one just for Richard. You gave us the cadence of comps through the quarter.\n\nSo [Inaudible] guidance, but any commentary, more specifically, on just the trend in business here into Q4?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nYou know, nothing in the first two weeks of Q4 changes our view on 2022 guidance. And as we said, we expect comps to be positive in the quarter.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nGot it. Appreciate it. Thank you.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nOur next question comes from the line of Zach Fadem with Wells Fargo. Please proceed with your question.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nHi. Good morning. As you think about your DIY customer specifically and the well-documented challenges in the first half of the year, is it fair to say that your DIY customer improved on a one- and three-year basis this quarter? And as you think about consumer behavior in tighter economic and housing conditions ahead, is there a scenario where the DIY category outperforms pro, as customers trade down or maybe pull back on bigger projects?\n\nJeff Kinnard -- Executive Vice President, Merchandising\n\nZach, I may have to get you to repeat the second part of the question. On the first part of the question, look, we're really pleased with our consumer business through the year in Q1. We had what we always refer to as bathtub effect in some respects. And so, we had a seasonal impact to consumer in Q1 of this year.\n\nQ2 and Q3 have both been positive. And we're very happy with that business. Could you could you -- would you mind repeating the second part of your question?\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nYeah. Is there a scenario where DIY outperforms pro as -- as customers trade down or pull back on bigger projects?\n\nJeff Kinnard -- Executive Vice President, Merchandising\n\nWell, you know, I don't think there's any way to conjecture that. I, I do think that what we love about this business is it's all -- it's all in customer demand regardless of the channel it appears through. But, you know, we are -- we don't have a target for pro penetration for the business. And what we've seen through cycles is that, number one, we do very well with both.\n\nAnd you can see some fluctuation between the two. But really, what we have going on right now is what we're observing, which is the pro business is leading the company that shows us that the demand for large projects is very healthy right now.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nAnd we -- you know, someone asked this question before, I'm not sure we answered it. We are not seeing trade down. You know, if you take my -- my grill or appliance example, it's not that people ultimately bought and they traded down. I think it's that people have already purchased, you know, in the past few years.\n\nAnd when people, you know, do purchase, again, they're -- they're buying innovation. Our trader business, for example, is incredibly strong. And as they bring out innovation, customers respond.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nGot it. And when you think about your sixth straight quarter of transaction declines and the fact that there is a more stable repair and maintenance component of your business, to what extent do you believe we fully cycled away from all the pull forward and excess discretionary category demand in 2020 and 2021? And when would you expect this to translate to a more normalized, positive transaction cadence?\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nWell, you know, that's such a great question, and it's something we observe in and build our theories of the case. When you go back now, what are we, we're 11 quarters of of this pandemic. And, you know, the first five, six, we had tremendous transaction growth rate. We all know the story of what happened, not necessarily a lot of cost inflation at that point.\n\nAnd then, the last six quarters, you know, we start to lap that tremendous activity but also saw -- for all the reasons we know, supply chain commodities, you know, global cost pressures, we saw significant cost in our business. And comps were driven, as they were this past quarter, with -- with ticket over transactions. What we've seen now, as you step back approaching three years, is our transaction run rate, our sort of three-year CAGR this point is more or less pre-pandemic rates. And you could look at that at one hand and say, wow, here's the slowdown.\n\nOn the other hand, you know -- Richard used the term holding serve. You can look and say, oh, my gosh, this industry erupted with demand for a year and a half. Then you had cycled significant cost increases. The customer hung in there and was resilient.\n\nAnd your net over this three year period, up in transactions, in units, despite what we believe you'll hold on to these price levels. I think that all goes back to my, you know -- my opening comments of what is the dynamic of this overall industry and the health and the engagement level of this customer. And if we normalize from here, you know, gosh, more than great. You know, there's obviously all these questions about, you know, recession that -- that we can't answer any better than you all can.\n\nBut when you digest and look back at what's happened in the last three years, you'd say, wow, that's a pretty incredible market segment.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nAppreciate the thoughts. Best of luck.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Mike Baker with D.A. Davidson. Please proceed with your question.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nOK. Hi, thanks. Appreciate the color you gave on the fourth-quarter outlook. But the -- you've done such -- such a great job improving your holiday business.\n\nIn fact, in 10 of the last 13 years, your fourth-quarter comp has been better than your third-quarter comp. And by definition, that's occurring on tougher comparisons. Can you talk about, you know, what you've done to make the fourth quarter such a bigger quarter for you and why that might be different this year?\n\nJeff Kinnard -- Executive Vice President, Merchandising\n\nMike, it's Jeff. Yeah, we had an exceptional fourth quarter. In past years, we've built the business on the backs of a decorative holiday. And, you know, we are the customers' advocate for value in that category.\n\nAnd we have great innovation and great -- again, great value for our customers. Second, we've built the business of gifting in our gift centers. And you look at the innovation that we're delivering to our pro and to our consumer, it's exceptional. I spoke earlier about the M18 Milwaukee drill and driver combo kit.\n\nThe innovation is just exceptional, as Ted -- as Ted spoke to earlier. And then appliances, you know, appliances is a enormous category for the Home Depot. It's been a category that we've built at an incredible rate. We're investing in capabilities, like I spoke earlier, in terms of delivery.\n\nWe're investing in dot com capabilities in terms of our -- our-- our customers' willingness to -- to review and purchase online. Then I'd also say we're building a great project and business in the fourth quarter. The fourth quarter is a great time for a project. We see a lot of consumers taking, doing smaller projects around their home and getting ready for the holidays.\n\nAnd then, finally, I'd say, you know, storage, storage organization, we have incredible storage events. We, again, are customers' advocate for value when it comes to storage across the business. And then, finally, we built an incredible dot-com business. And, you know, this is -- we called the performance in Q3.\n\nWe're expecting a great Q4 with Cyber Monday. And a big part of that is our digital performance, our app performance. And Hector will be here, our president of online. Hector, you want to make comments around the app?\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nYeah, sure. Yeah. Thanks, Jeff. I mean, Ted had called out the -- the experience is where -- what it's all about.\n\nWe love the experience, improvements we've made. A lot of it's around in-store connectivity. We talked about store mode. We talked about military.\n\nWe talked about loyalty. We've got some features coming out on pro for in-store checkout experience, and our customers really respond. I mean, we love the ratings in the App Store, 4.8 for the Apple, 4.7 with Google. But we see it in our numbers as well, strong double-digit performance and growth in downloads and the use -- monthly average users in our traffic.\n\nIt's our fastest-growing online property. We're doing billions of dollars of sales through the app. We couldn't be more excited.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nGreat. If I could ask one more follow-up. Your buyback did slow a little bit this quarter. Is that maybe a function of of higher borrowing costs? Or how should we think about buybacks going forward? Thanks.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nNow, you know, we -- we don't ascribe to necessarily a smooth cadence of buybacks. And that will typically reflect just sort of how we think about working capital investment through the year and the cash buffer throughout the year. So, there's really nothing to read into there.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nOK. Thank you.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWelcome.\n\nOperator\n\nOur next question comes from the line of David Bellinger with MKM Partners. Please proceed with your question.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nHey, thanks for the question. So, going back to some of the category comments, are you seeing some evidence that the, call it, more discretionary items are turning lower and at a faster pace? I know, last quarter, you mentioned some of those higher-ticket, the $300 to $400 Halloween items, being pretty much as discretionary as it gets and performing pretty well. We saw some discounts on those items in the weeks preceding Halloween. So, any indications that those, you know, splurge items are starting to cool off and more quickly than the rest of the business?\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nDavid, you know, we had -- we have commented earlier we had record sales both in-store and online in Halloween that included the infamous Skelly, which has been one of our best sellers in terms of the innovation and value we offer our customers. It's really unmatched in the marketplace. And we couldn't be happier with our Halloween performance. If I turn to the fourth quarter, we're really excited about our decorative holiday assortment.\n\nWe've got great innovation and great value for our customers across the assortment of trees, of its lights, of its decorations. We feel very good about the category, and our consumers are reacting exceptionally well to it.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nGot it. I have a Skelly, so, I know exactly what you're talking about. My -- my follow-up, just on the inventory levels, how much of that growth is aimed at pro customers? So, is there a piece of that inventory that's not sitting in the stores? Maybe it's at facilities like in Dallas or the number looks to be a bit more elevated to us at the store level? Just help us unpack the 25% inventory growth number and just get us comfortable that you aren't sitting on too much at this point, especially with some of the deceleration you're now seeing.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWell, so, what's investment in inventory and our one supply chain facility is certainly one of the factors in inventory growth year over year. But the primary factor is really just inflation as part of the inventory value. And then, we made strategic decisions to land inventory earlier in the year than we have prior. And really, just to give you some -- some numbers around that and to reflect the fact we feel fantastic about our inventory position, in Q2, we grew our inventory 38% year over year.\n\nIn Q3, that number dropped to 27% year over year. And actually, if you look throughout our history, we actually typically build inventory from Q2 to Q3. In this case, our inventory actually came down by $400 million from Q2 to Q3. Our inventory is healthy, and we're happy with our position.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nThanks, Richard. Appreciate it.\n\nIsabel Janci -- Vice President, Investor Relations\n\nChristine, we have time for one more question.\n\nOperator\n\nThank you. Our final question will come from the line of Steven Forbes with Guggenheim. Please proceed with your question.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nGood morning. Maybe just to follow up or focus on the quarterly performance. If I look at the press release, the selected sales data obviously excludes HD supply. So, curious, Ted, if you can expand on the performance of that asset in today's backdrop as it looks like it may be driving some upside to the overall performance of the business.\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nYes. Steven, thanks. Yeah, another great quarter for HD supply. We mentioned this last quarter.\n\nAnd they are -- they are just doing a terrific job. Shane O'Kelly and his team are running the largest and the best-focused MRO business for multifamily housing and hospitality, extended living, etc. We are well -- we remain well ahead of all our financial projections when we made the acquisition. The integration is -- is tracking.\n\nThey're integrating sales forces, customer records, and now starting to work or -- on their way in the work of integrating the supply chain. So, that one is -- has just been a terrific acquisition that we're super happy about.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nAnd then, if I may, just a quick follow-up for Richard or Ted. Given the performance, can you -- can you remind us on what percentage of sales that business is today? And then, as we -- as we look at the sort of spread between comp and net sales growth, any reason to think that the current sort of year-to-date spread doesn't hold into the fourth quarter?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWell, we don't break HD supply out. As Ted said, we're so happy with it. On the difference between sales and comps, we've always seen a gap there. It just -- comp reflects sales for the POS.\n\nSales reflects sales as they're actually delivered or installed. You're going to see that number there. Well, probably through the year, sales will be a little higher than comp. But the important guide here is comp because that's our activity-based metric around sales. \n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nThank you.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nMs. Janci, I would now like to turn the floor back over to you for closing comments.\n\nIsabel Janci -- Vice President, Investor Relations\n\nThank you, Christine. And thank you for joining us today. We look forward to speaking with you on our fourth-quarter earnings call in February.\n\nOperator\n\nLadies and gentlemen, this does conclude today's teleconference. You may disconnect your lines at this time. Thank you for your participation and have a wonderful day.\n\nDuration: 0 minutes\n\nIsabel Janci -- Vice President, Investor Relations\n\nTed Decker -- Chair, President, and Chief Executive Officer\n\nJeff Kinnard -- Executive Vice President, Merchandising\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nMichael Lasser -- UBS -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nChris Horvers -- J.P. Morgan -- Analyst\n\nSteven Zaccone -- Citi -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nMike Baker -- D.A. Davidson -- Analyst\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nMore HD analysis\n\nAll earnings call transcripts"
}