{
  "companyName": "REV Group, Inc.",
  "companyTicker": "REVG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/rev-group-inc-revg-q3-2022-earnings-call-transcrip/",
  "content": "REV Group, Inc. (REVG -0.86%)\nQ3 2022 Earnings Call\nSep 07, 2022, 10:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the REV Group, Inc.'s third quarter 2022 earnings conference call.  [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host Drew Konop, vice president of investor relations and corporate development. Thank you. You may begin.\n\nDrew Konop -- Investor Relations\n\nAll right. Thank you, Doug. Good morning, and thanks for joining us. Earlier today, we issued our third quarter fiscal 2022 results.\n\nA copy of the release is available on our website at investors.revgroup.com. Today's call is being webcast, and a slide presentation which includes a reconciliation of non-GAAP to GAAP financial measures is available on our website. Please refer now to Slide 2 of that presentation. Our remarks and answers will include forward-looking statements, which are subject to risks that could cause actual results to differ from those expressed or implied by such forward-looking statements.\n\nThese risks include, among others, matters that we've described in our Form 8-K filed with the SEC earlier today, and other filings that we make with the SEC. We disclaim any obligation to update these forward-looking statements which may not be updated until our next quarterly earnings conference call, if at all. All references on this call to a quarter or a year are our fiscal quarter or fiscal year, unless otherwise stated. Joining me on the call today are president and CEO, Rod Rushing, as well as our CFO, Mark Skonieczny.\n\nPlease turn now to Slide 3 and I'll turn the call over to Rod.\n\nRod Rushing -- Chief Executive Officer\n\nThank you, Drew, and good morning to everyone joining us on today's call. Today, I'll provide an overview of the quarter's consolidated performance and then move to commercial, operating and financial highlights achieved within the quarter before turning it over to Mark for our detailed segment financials. First, I'd like to provide a few comments on what we are experiencing in the supply chain and labor markets. Like other industrial companies, we have been managing through an inconsistent and challenged supply chain over the past year.\n\nWhile we have seen improvements, these improvements have proven to be temporary and material shortages have subsequently reemerged impacting our flow and throughput. We have listed the components that have had the most frequent impact on production. Wiring harnesses, HVAC, axles, radiators and electronics have consistently been short and supplied and remain disruptive to both our starts and completions. We continue our efforts to secure volume commitments and are running processes to qualify and dual source apparent suppliers, but a consistent predictable flow of materials has not yet returned.\n\nDelivery of OEM chassis have improved in recent months. From one OEM, we received an average of 70 chassis per week toward the end of the third quarter. This was up from just 10 per week in the second quarter. The improvement in deliveries was primarily the result of an inventory lot clearing process.\n\nThese chassis receipts were not aligned to our production plan to our scheduled component delivery or to our staffing levels, which created a secondary challenge in managing our production. Receipts of chassis that manage our plant productions have not yet improved. This combined with the potential OEM chassis model year delays creates a lack of uncertainty, instability and the predictability of future chassis deliveries. Our current view of supply chain recovery remains consistent with what we provided on our second quarter call.\n\nWe do not expect to see broad based improvement until calendar year 2023. As a result, we have maintained our current line rates that are supported by our chassis supply, our parts availability and our current staffing levels. Now, turning to third quarter results. Consolidated net sales of $595 million increased $2 million versus the third quarter of last year.\n\nThe increase was driven by higher sales within the recreation segment, partially offset by a decrease in sales in fire and emergency segment. Recreation segment sales continued to reflect strong demand for our RVs across categories, as well as favorable mix within the businesses. Over 80% of our year-to-date recreation sales and 90% of our EBITDA are within the motorized categories. Our businesses continue to benefit from favorable trends and low dealer inventory.\n\nOur Midwest brand that serves the Class B sprinter luxury van market, which grew at 16% of the trailing period 12 months ending June 30. In the same period, our Renegade Class C diesel business gained 1.4 points of market share outpacing the market by 12 percentage points. The combined unit output of these two plants improved 29% versus the third quarter of last year, demonstrating REV Drive's ability to impact our business and deliver bottom-line results. Partially offsetting the increase in recreation sales was a decline in our fire and emergency segment sales.\n\nThe chassis supply chain challenges we broadly have had the greatest impact in our fire and emergency segment. Fire apparatus is a specified to a component level and is a highly engineered requiring a great deal of planning and execution to deliver with continuous flow. The supply chain serving this industry is the least mature, most localized has been more greatly impacted. This directly affects our production throughput.\n\nWe have expanded the placement of our purchasing resources and our black belts at our suppliers' locations to assist in improving their throughput. Engineering has been another area that has constrained our throughput. We have supplemented our engineering resources with outsourced offshore engineering to mitigate these issues. There has been significant progress and success in the last two quarters coming from this effort.\n\nAdditionally, our internal team of lean black belts are aligned and focused on improving our flow. We've tapped our sub-assembly specialists from centers of excellence to deploy best practice across our plants. On a parallel basis, we continue to work the platforming efforts in our fire division to eliminate unnecessary complexity while maintaining the identity and differentiation of our brands. We've expanded the S180 quick delivery pumper program.\n\nThis will allow us to utilize open production slots at sister plants while providing an alternative for fire departments that require or desire a faster delivery. Within the quarter, we had a transition of leadership in our fire division that resulted in my taking on a greater role of the data activity to these businesses. I traveled extensively at the close of the past quarter, visiting our plants meeting with our management, our engineers, our purchasing, the materials handlers and our production workers. I will continue to focus my daily efforts on improving our fire business while balancing my broader leadership responsibilities until such time that the division president was named.\n\nConsolidated EBITDA of $29.5 million was down $12.1 million from prior year. The decline was primarily the results of lower EBITDA contribution from our fire and emergency segment and commercial segments, partially offset by an increase in the recreation segment. Sequentially, consolidated EBITDA improved by $6 million at a 31% incremental margin. We expect this bottom-line improvement to continue in the fourth quarter.\n\nPlease turn to Slide four for highlights of the third quarter. We continue to experience strong end market demand. Book-to-bill for the fire and emergency segment was 2.6x in the quarter which strengthened orders in both our fire apparatus and ambulance units. Demand remains robust for terminal trucks that are needed to support the country's logistics infrastructure.\n\nWe continue to see strong demand for Class B and Class C RVs, which are highest margin categories. Consolidated backlog of $3.9 billion is the 11th consecutive record and an increase of 46% versus the prior year. Interest in our electric fire apparatus has been increased since we launched the Vector, the first all electric North American-style fire apparatus at this year's FDIC show. Over the past several months, this interest has converted into firm orders for three additional units.\n\nIn July, our E-ONE business announced an order for the Vector Rescue Decon apparatus for the City of Varennes, Quebec. In August, our Spartan business announced an order for two Vector pumper trucks. We have sold a total of four units in various configurations from two brands, demonstrating Vector's customization and flexibility to suit fire department needs. Yesterday, we were pleased to announce that our ENC municipal transit business has released its next generation battery electric and fuel cell electric buses that are branded Axess EVO.\n\nThis is the first major platforming and design for manufacturing announcements since we detailed the REV Drive during our 2021 investor day. Past generations of ENC fuel cell electric and battery electric buses were built on completely different platforms. The Axess EVO leverages a common structural platform, a common propulsion system and technologies with over 90% commonality. Not only do we expect lower manufacturing costs, but it provides a simpler solution of aftermarket support, employee training and maintenance for our customers that operate a next fleet.\n\nThe new designs will allow ENC the flexibility to offer multiple access variations with different power platforms at various lengths of range from 32 to 40 feet. Next generation Axess EVO battery electric will have more advanced technology options that we expect will allow longer range than the current generation. The battery system and energy storage for this bus is supplied by Proterra the manufacturer of industry leading battery packs for zero emissions electric vehicles. The next generation Axess EVO fuel cell electric bus will be built on ENC's legacy hydrogen fuel cell electric bus.\n\nENC was the first bus manufacturer to complete the 12 year 500,000 mile FCA Altoona test for hydrogen fuel cell powered bus in 2018. BAE is providing their new gen three electric powertrain, which is designed to extend the range of the bus to 400 miles, currently the highest range in the industry. We expect significant interest as the FCA announced $1.7 billion of grants for low and no emission buses on August 16th. These are the first rewards related to the bipartisan infrastructure, which provide a total of $5.5 billion over five years to help state and local government authorities buy or lease zero emission or low emission transit buses.\n\nENC's home State of California received a total of $236 million of grants, including Los Angeles receiving $104 million. The technology and flexibility of these next generation buses opens the door to increase market share as we transition to an electric transportation. I will now turn over to Mark for details on our third quarter financial performance. Mark?\n\nMark Sconieczny -- Chief Financial Officer\n\nThanks, Rod, and good morning, everyone. Please turn to Page 5 of the slide deck as I move to review of our segment level performance. Fire and emergency third quarter segment sales were $230 million, a decrease of $40 million compared to the prior-year's quarter. The decrease in that sales was primarily the result of fewer shipments of fire apparatus and ambulance units related to supply chain disruption and labor constraints, partially offset by price realization.\n\nUnit shipments of fire apparatus declined 19% versus last year's third quarter and 8% versus this year's second quarter. The decrease was primarily related to shortages of wiring harnesses, axles and radiators, as well as labor constraints and certain businesses. Shortages of key components have slowed unit completions resulting in an increase in work-in-process versus the exit to fiscal 2021. As we mentioned, our last quarterly call entering the third quarter, we lack chassis to run a normal production schedule and executed furloughs within the ambulance division.\n\nThese furloughs were extended past the original 30 days as visibility into chassis deliveries remained uncertain. As Rod mentioned, chassis delivery did improved late in the quarter, but the units we received did not meet our demand plan and therefore our production schedules had to be altered to match the mix of chassis received. In addition to the chassis supply variability, the rates of component part stock-outs increased versus second quarter and were comparable to rates experienced in the second half of 2021. Then that result is that ambulance unit volume decreased 11% versus the prior year.\n\nAny decision to add labor and ramp production will need to be proceeded by lasting stability in both chassis and components supply, which we have not yet experienced. F&E segment adjusted EBITDA was $1 million in the third quarter 2022 compared to $15.8 million in the third quarter 2021. The decrease was primarily result of lower volume and inefficiencies related to supply chain disruptions and inflationary pressures partially offset by price realization. Unadjusted third quarter results include $2.3 million of restructuring charges associated with the transition of KME production.\n\nAs of July 31, this restructuring activity was substantially complete. Total F&E backlog was a record at $2.2 billion, an increase of 76% year over year. The increase in backlog was a result of strong orders for both fire apparatus and ambulance units, pricing actions and lower throughput. We continue to expect conversion of these orders to sales to remain challenging near term.\n\nThe midpoint of updated guidance anticipates fourth quarter F&E segment revenue to be approximately flat with our third quarter run rate, which is $45 million to $50 million lower than the prior year. We do expect sequential improvement in operating efficiencies resulting in a 15% year-over-year detrimental margin and lower segment sales. Turning to Slide 6. Commercial segment sales were $111 million, a small decline versus the prior year.\n\nThe decrease was primarily related to lower shipment of school buses and municipal transit buses partially offset by increased shipments of terminal trucks, street sweepers and price realization. Lower school bus shipments were primarily due to supply chain disruptions and labor constraints. Municipal transit bus shipments declined 43% versus last year, largely the result of shortages of key components and increased absenteeism related to COVID variants. Within specialty group production of terminal trucks and street sweepers increased 26% quarter over quarter.\n\nThis is the fourth consecutive quarter of improved unit velocity resulting from REV Drive improvement initiatives designed to increase throughput. Combined production at this plant increased 61% versus the prior-year quarter. Commercial segment adjusted EBITDA of $6.8 million decreased $2.9 million versus the prior year. The decrease in EBITDA was primarily result to lower shipments and mix in the transit bus business, inefficiencies related to supply chain disruptions and inflationary pressures partially offset by increased shipments of terminal trucks, street sweepers and price realization.\n\nLower municipal transit bus mix is primarily due the completion of a large municipal order that carried higher content and production of buses sold in a highly competitive bidding environment during the trough in demand during COVID. Increased inflationary pressures have inflated the anticipated build cost and lower to margin opportunity of these units. We continue to work with our customers to achieve price adjustments to reduce the margin impact of cost increases for these units. Our current bids reflect increased pricing to mitigate inflationary pressures and we are optimistic that our backlog will benefit from increased EV penetration over the next several quarters.\n\nCommercial segment backlog at the end of the third quarter was $531 million, an increase of 70% versus the third quarter of last year. The increase in backlog results in strong orders of school buses, terminal trucks and street sweepers partially offset by the timing of orders from municipal transit buses. The midpoint of updated guidance anticipates production of transit buses currently within backlog to continue to weigh on segment profitability, offset by sales and profit momentum in our specialty business. School bus production is expected to continue at the current line rates due to chassis uncertainty related to OEM model year changes.\n\nTurning to Slide 7. Recreation segment sales of $254 million increased 20% versus last year's quarter. Increased sales were primarily result of increased Class B and Class C unit shipments and price realization partially offset by fewer shipments of Class A, campers and towable products. Higher shipments of Class B and Class C units were primarily related to increased unit velocity related to REV Drive improvement initiative designed to increase throughput.\n\nLower shipments of Class A units were primarily related to supply chain constraints, rework and absenteeism. COVID related absenteeism and similar supply chain constraints also result in lower shipments of campers and towable units out of our California plant. Recreation segment adjusted EBITDA was $29.8 million, up $6 million versus the prior year. Segment margin of 11.7% increased 40 basis points versus the prior year with improved margins in all motorized categories.\n\nThe increase in adjusted EBITDA was primarily result of increased shipments of higher margin Class B units, favorable mix of Class A and Class C units and price realization partially offset by inflationary pressures and inefficiencies related to supply chain disruption and labor constraints. Segment backlog of $1.2 billion increased 7% versus the prior year. Orders continue to be strong in our higher margin Class B and Class C categories and dealer inventory for all categories remains low. We did experience some order cancellations within the quarter for our Class A products, which impacted our reported backlog in implied segment orders.\n\nHowever, backlog for each of our categories remains greater than one year production. At midpoint of updated guidance, we expect fourth quarter net sales, product mix and adjusted EBITDA within the recreation segment to continue at the third quarter run rate. Turning to Slide 8. Net debt as of July 31 was $235 million, including $14.8 million of cash on hand versus $237 million net debt at the end of fiscal -- our fiscal second quarter.\n\nThe decrease in net debt was a result of free cash flow generation within the quarter of $24.7 million partially offset by share repurchases of $24.1 million. Within the quarter, we repurchased 2.1 million shares at an average price of $11.16. We have now purchased a total of 6 million shares for nearly $74 million under the current $150 million authorization. We also declared a quarterly cash dividend of $0.05 per share payable October 14th through shareholders of record on September 30.\n\nYear-to-date cash return to shareholders totaled $79.4 million. We plan to remain disciplined and opportunistic with all capital allocation priorities, including shareholder returns of capital. At quarter end, the company maintained ample liquidity with approximately $287 million available under the ABL revolving credit facility. Trade working capital on July 31 was $353.4 million compared to $368.2 million at the end of fiscal 2021.\n\nThe decrease was primarily the result of increased customer advances and accounts payable partially offset by increased inventory and accounts receivable. Year-over-year third party chassis inventory including both on the balance sheet and within OEM pools increased $23 million. Year-to-date cash provided by operating activities was $59.5 million compared to $100.6 million cash provided in the prior-year period. The decrease was primarily due to lower net income in a lower trade working capital inflow, primarily due to the increase in inventory levels I previously discussed.\n\nWe spent the total of $7.4 million in capital expenditures within the quarter. Today, we update full year guidance to reflect the continuation of supply chain challenges previously discussed. We now expect sales in a range of $2.25 billion to $2.35 billion, a decrease of $25 million at the midpoint. Adjusted EBITDA is expected to be in the range of $100 million to $110 million, a decrease of $5 million at the midpoint.\n\nWe expect net income in the range of $14 million to $25 million and adjusted net income in the range of $44 million to $54 million. Free cash flow remains in the range of $58 million to $70 million. With that operator, we'd like now open the call up for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Mike Shlisky with D.A. Davidson. Please proceed with your question.\n\nMike Shlisky -- D.A. Davidson -- Analyst\n\nHello. Good morning. Can you hear me OK?\n\nRod Rushing -- Chief Executive Officer\n\nYeah. Good morning, Mike.\n\nMike Shlisky -- D.A. Davidson -- Analyst\n\nGreat. Thank you so much for having me. So let's just quickly start on recreation. Could you maybe talk a little bit about the order cadence throughout the quarter? Some of the broader macro indicated that -- indicate the broader market of -- and recreation had churn rate of the last few months.\n\nI am just kind of curious whether the orders for all your products have also taken that same churn or has things been pretty steady throughout the entire quarter?\n\nMark Sconieczny -- Chief Financial Officer\n\nYeah, as I said in prepared remarks, the order rate was steady, but we did have the cancellation that sort of impacts our -- when you look at overall what the order intake was. So as I said, in our Class A business we had -- and it was really concentrated on one retailer that actually canceled a significant part of their orders or put those on hold within our order book. But we saw consistent flow within our motorized units. And then we did see a slow down as you referred to in the towable -- our campers and towables, which again are only about 10% of our exposure.\n\nSo we don't have the exposure that some of our competitors do as you know we're more like 90:10, as 80:20, 90:10 on EBITDA like Rod quoted within our mix. So we're a lot more heavily motorized.\n\nMike Shlisky -- D.A. Davidson -- Analyst\n\nGot it. And then Rod, you said you started to take a little bit of a greater role in the fire and emergency business at least temporarily. And you said you did have some -- you took a more personal up close and personal look at that division over the last few months. I'm curious if you provide more detail as to what you may have found that you didn't know before over the last month or two about that business.\n\nRod Rushing -- Chief Executive Officer\n\nYeah, I think that I was pretty much aware of what was going on before. But now, as you mentioned, I've stepped in maybe quite a bit deeper than I was. I think strategically, our direction is pretty solid. We talked about the longer term things in our investor day that we wanted to accomplish in terms of simplification and getting at some of the complexity evolve.\n\nAnd looking at operational excellence centers where we could maybe take the duplicative efforts that we have in our plants and figure out better ways within our network to execute. So all that kind of, what I would call, mid to longer-term thinking is still on course. Shorter-term, as I mentioned in my comments and Mark also reinforced the material challenges we faced have really hit us well most difficultly in our fire and emergency business and Fire in particular. So operationally, we just need to step up the intensity and continue to drive improvement, despite a pretty difficult environment to drive change.\n\nOur people are focused keenly on getting materials available so we can complete builds. And when you are trying to transform businesses through those same resources, it impacts your -- it has impacted our ability to execute the transformational operational change. We're making progress. Operatation is very good because of our flow and our inefficiency we're seeing tied back to the material shortages that we have.\n\nSo I mean, the issues are just pretty clear. We got to maintain real focus on improving operations. As we see these supply chains improve, we expect that we'll see those improvements come through and continue on our path on the longer path around the design changes and network changes that we talked about during our investor day.\n\nMike Shlisky -- D.A. Davidson -- Analyst\n\nOK. If I can just close it up with a quick model question, I guess I'm curious why reduced capex this quarter for the full year? have you changed any of your investment plans or should we be shifting $5 million into next year's capex just because of timing or what have you?\n\nMark Sconieczny -- Chief Financial Officer\n\nYeah, it's more of timing as we started completing the supply chain challenges hit us as well as lead times. So lead times for some of the equipment that we were looking to purchase got pushed out as well. So it's more of a timing than anything, Mike, from that respect or we're still investing in our businesses and in the equipment that's required to increase our driver throughput improvements.\n\nMike Shlisky -- D.A. Davidson -- Analyst\n\nOK, great. I appreciate it. Thanks for the time guys.\n\nRod Rushing -- Chief Executive Officer\n\nYes, thank you. \n\nMark Sconieczny -- Chief Financial Officer\n\nThanks, Mike.\n\nOperator\n\nOur next question comes from the line of Mig Dobre with Robert W. Baird. Please proceed with your question.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nGood morning, guys. Thanks for taking the question\n\nRod Rushing -- Chief Executive Officer\n\nGood morning, Mig.\n\nMark Sconieczny -- Chief Financial Officer\n\nGood morning, Mig.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nMaybe I'd like to start with fire and emergency, as well. And look based on the way you kind of talked about the fourth quarter, it looks like you're going to be doing something like $950 million of revenue this year. You've got, better than $2 billion of backlog. So obviously deliveries here are stretched quite a ways into the future.\n\nSo I guess my question is first, how are your discussions with customers progressing as far as your ability to actually convert and deliver these units? Are they comfortable with the idea that you might be delivering into fiscal 2025 here? And the second question is how do you manage your own price cost dynamic because with this level of backlog and with old disruptions that we've seen here, I'm sort of curious if you have any mechanisms that are embedded within your contract to allow for some degree of flexibility, given all the uncertainty that you're experiencing.\n\nRod Rushing -- Chief Executive Officer\n\nThanks, Mig. This is Rod. I guess for the first standpoint, we're very transparent with our customers as we pursue work with them around delivery timeframe. The only way you can do this is be complete transparent.\n\nAnd we found -- because we have multiple facilities serving, we have different lead -- we have variational lead times, by brand. But we found that our -- when we have communications and when we go-to-market in these competitive bid environments, that our lead times remain very competitive to our competitive peer set. And I think in the last quarter, I'm going back on the notes here that I made a quote. I think we were on a book-to-bill basis.\n\nNow a lot of this goes back to our bill being depressed, but we were still, like, it was two and a half times book-to-bill. So we're still seeing pretty solid demand despite the fact that because of all the inflationary pressures we've seen, we have had to take price considerably in the last year. And that goes to your second question. I mean, most of the contracts that we work on are municipal contracts, we're on other people's paper through a dealer network.\n\nMany of those contracts do offer escalation clauses that we take full advantage of. And when they don't, we've had conversations with, through our dealers and with municipalities about equitable adjustment to price, that's a contract by contract thing, but we continue to see on a price cost basis. In the short term, we continue to be pretty balanced on that to positive. And we look at this on a forward basis going forward, and trying to speculate the range of anticipated inflation.\n\nAnd we still feel we're in a pretty decent position because of the prices we've been able to take. Different timing in your backlog, different tranches and price levels could be challenged depending on when they flow relative to inflation. But overall, broadly in the backlog, we can get back to a normalized inflationary period here. Soon, we feel pretty good about where Rev will being able to deliver on price cost on a go-forward basis.\n\nBut it's something we're aggressively looking at on the backlog to price standpoint, where we have the opportunities to talk to our customers. And also we continue to monitor on a forward price base, what we need to do with forward pricing to make sure that we're protecting our margins.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nI appreciate that. I guess, as we're starting to contemplate fiscal '23 here, I'm curious what your level of visibility or comfort is at this point that indeed in calendar '23, there is some improvement in your supply chain. You mentioned that in your prepared remarks, but I'm curious as to what gives you any level of confidence that that's the case. And then as it pertains to this segment specifically, the backlog that will get converted in calendar '23 in fiscal '23, is that in a position to be at least neutral on a price cost basis? Should we expect some margin normalization as we look at fiscal '23, or is that more of a fiscal '24 and beyond phenomena?\n\nRod Rushing -- Chief Executive Officer\n\nSo I'll answer the first part of the question. I do think that -- Mark, what was the...\n\nMark Sconieczny -- Chief Financial Officer\n\nSupply chain.\n\nRod Rushing -- Chief Executive Officer\n\nThe supply chain issues, when we look at where we're at this year, looking into the market versus last year, we don't have a crystal ball here, but we do look at things what the Fed is doing and it will probably aid us in slowing the economy. And that should normalize demand a bit more and put less pressure on the supply chain. So I do think at some point that that realization will come through. And when that happens, we should see a move in our supply chain to be able to be more consistent with where it was prior to maybe the third quarter of '21 or at the third quarter '21.\n\nSo we don't have hard cut. We obviously talk to our suppliers, we're doing a ton of activities trying to help them. We think everybody is going to emerge from this better than they were going into it, just because of how we've had to improve our performance, to continue the line rates even more where they're at today. But there is a bit of speculative piece of thinking about some of the activity that is going on with interest rates, what that might do to broader demand, us building out of a backlog our demand is pretty set obviously, but some of the markets that are more hand-to-mouth will benefit us, I think, our supply chain.\n\nSo we might be a little bit opportunistic belief there, but I do think that the supply chain will normalize as quickly as it eroded and we'll benefit from that is already. When exactly that happens and the timing. I still believe that it's probably a back half of next year, but it's, I would bet it's a 2023 based on the interest rates that we're seeing and what we think. Relating to demand, Mark you could comment on that.\n\nMark Sconieczny -- Chief Financial Officer\n\nYeah, I think as well, I'll carry on the supply chain, all the work that we're doing, that we've talked about previous around supplier development and also expanding our supply base. So those are coming to fruition here. So as you know, it takes a cycle here in order to get people up, to get the engineering drawings and whatnot. So we will be in a better position internally with our supply base, expanding as well as we progress through '23.\n\nBut when you get to product validation and whatnot, and some of the resourcing we've talked about before, around radiators and wire harnesses, those are in motion here. It just a matter getting the supplier qualified PPAPed and approved. And then we will have an expanded supply base as well, entering into '23. So we feel good about our resourcing activities.\n\nAnd then from price cost, obviously, we highlighted some things on the transit bus business, but as Rod said, as we move through this backlog, we are price cost positive right now. And all the work we're doing on some of the resourcing activities, we still believe that we will be cost price positive next year in these businesses and will improve as we eat through the backlog and work through some of the orders that we were not able to, in some cases, not able to adjust the pricing. So the faster we get the through point out and eat through our backlog the quicker, we'll see the price realization, which will be upside to what we're currently experiencing.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nUnderstood. And if I may squeeze one final one, demand in this segment has been incredibly good and some of your peers have reported pretty similar order trends. And I'm just sort of curious as to what you are ascribing or what we've seen here, is it fair to think that there is a bit of a budget flush that is happening with some of your customers? I'm also wondering if you have any sense that there's the potential for sort of double ordering, placing orders with several OEMs and sort of trying to wait and see who can deliver first. Do you think that there's any risk of potential order cancellations as the supply chain starts to loosen up either next year or beyond? Thank you.\n\nRod Rushing -- Chief Executive Officer\n\nYeah, so I don't think that -- I mean, I think first off with what's driving the market, I think that they're coming into the COVID, there's no question whether it was much demand was pin up or how much demand was delayed, that once we kind of exited, think of the fact that tax receipts did not get muted during the COVID period that actually municipal tax receipts went up that combined with healthy levels of subsidies from the federal government on top of that, the local municipalities probably had money to spend. I think that's part of it. And I think that what you might call surge might have been contributed by the fact that there was a period of time when orders really dipped in 2020. So that probably delayed those orders come through on and then get tied back to regular cycle, plus budgets being pretty healthy for a period of time.\n\nI think those are the things that are most likely driving, plus maybe some non-cyclical things around the EV side. Some of that stuff is still somewhat immature. The volumes are really, really low, but I also think that's the next way, because there's lots of monies laying out there now available and some of these markets to fund electrification as well. The second question you had was...\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nCancellations.\n\nRod Rushing -- Chief Executive Officer\n\nYes, regarding cancellations in double orders, in my experience in municipal contracts, I don't think municipalities are in a position to double order. I've never seen that before. Certainly, when we procure these things, we're working so closely to the municipalities in terms of finishing out the designs that they'd have to be doing good effort there in the F&E side. And I just don't think that that's possible for them to be doing that.\n\nSo I don't think that's obviously, Mark hit on, we've had some small cancellations in our Class A on RV, some of that's seasonal, some of it's happens on a regular basis, some of this related to downturn, but again, our mix in RV and the fact that we didn't significantly ramp up our volumes and our production rates until last year, our Class B. We're not in a position where they're ramping down and is probably something that concerns and relative to order cancellation. So there's always the possibility that we're getting no words of -- or no hints of that becoming something we could deal with. Everybody wants their vehicles.\n\nAnd then on the F&E side, many times there's cash advances deposits on these things as well that support the order staying as well. Did I answer your question?\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nThanks for the color. It did. I appreciate it. Thank you.\n\nRod Rushing -- Chief Executive Officer\n\nThanks Mig.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of John Joyner with BMO Capital Markets. Please proceed with your question.\n\nJohn Joyner -- BMO Capital Markets -- Analyst\n\nGood morning, and thank you for taking my questions.\n\nRod Rushing -- Chief Executive Officer\n\nGood morning, John.\n\nJohn Joyner -- BMO Capital Markets -- Analyst\n\nGood morning. So regarding the -- and this is mainly on F&E again, but regarding the labor situation. So you touched on the previously furloughed employees at your ambulance factories, and then you also talked a bit about engineers, but just looking at, say your job openings right now. And there's still several ones that need filling, particularly at your Holden fire apparatus plan.\n\nSo are you seeing things loosen up a bit in terms of hiring and I guess, how would you describe your overall efficiencies today at Holden since the KME production was added.\n\nRod Rushing -- Chief Executive Officer\n\nOur efficiency -- I mean, I just -- in general, our efficiencies at Holden and actually network wide fire a lot more broadly are well below last year. And part of that goes -- but even though we have furloughed and exited reduced workforce because of not being able to ramp in the back half, we're still carrying more labor than we need, because everything's getting touched multiple times as it goes down the line. So we have more inefficiencies this year than we had last year at this time, for sure. The Holden -- specific to Holden, it's arguably more impacted largely because bringing two plants together, brings challenges of its own that we've talked about opening these calls that the relocation was -- the products were not documented.\n\nWe knew that was going to present challenges that combined with the material issues we've had if put us behind schedule there without question, but we've got an awful lot of focus there from resources, not only in Holden and staffing that plan from a leadership standpoint and also from a direct labor standpoint, but we're also focused on that from an enterprise standpoint with our black belt and myself, I'm going down there twice a month now to participate and support that team in their transition. So it's been a challenge for sure. I believe the economics of looking at those two businesses separately versus combined, still leads quickly to the conclusion that once we get through this trend and those brands into planning and get the plant moving and materials, right. And are designs and documented, we'll be in a much better position than we were coming into.\n\nIt's still the right business decision. It's just been delayed because of our own execution and then the challenges we've had with the supply chain.\n\nJohn Joyner -- BMO Capital Markets -- Analyst\n\nOK, that makes sense. Thank you very much. And maybe just one more and then pivoting to recreation, if you look at our RVIA, which recently forecast that expects industry RV shipments will be down 16% in calendar '23. And I realize this is obviously not your outlook, but how would you expect your business to perform against this type of backdrop and given the amount of heavy lifting that you've done on restructuring side with -- I mean, across your businesses, but within the recreation segment, I guess what levers are available to pull in a potentially softening environment?\n\nRod Rushing -- Chief Executive Officer\n\nYeah, so recreation, like all our business, are hardly variable. So from the variable side, we're able to flex labor. With that said, we still have over years backlog in all categories. And we consistently have said, especially in our Class A that we have been operating at tough volumes in that business.\n\nSo we've managed that business for the long-term and we didn't get ahead of ourselves from a cost perspective and adding costs into those operations. So we feel very good that, and if you look -- you really need to break out the tables, when you're looking at John at those RBI data, because as we say our California plants is really our trailer and camper business. And that's we're mostly motorized in the Bs and Cs, which have held up very well. The Bs, especially in this period and the As, which never saw an upturn during this COVID we've been managing that business well into profitability.\n\nSo I think that's really, to your point is we're able to flex that down. And the flexing has happened. There is probably less than others that have actually ramped up during this upturn in the market.\n\nJohn Joyner -- BMO Capital Markets -- Analyst\n\nOK, excellent. That's all I have. Thanks for the time.\n\nRod Rushing -- Chief Executive Officer\n\nThank you. Thank you, John.\n\nOperator\n\nIt appears there are no further questions in the queue. I'd like to hand the call back over to Rod Rushing for closing remarks.\n\nRod Rushing -- Chief Executive Officer\n\nThank you, Doug. The last year certainly has presented some challenge to all -- everyone in the industrial manufacturing space and despite the supply chain labor and inflationary pressures, I and the leadership team remain really confident and positive on what's ahead of our business in the REV Group overall. We have seen impacts through our throughput throughout this period but we've been able to improve our engineering capabilities, our production planning, materials management, and we continue to invest in our people to solve our manufacturing readiness and our problem solving capabilities. We've been able to maintain positive price costs in this inflationary period.\n\nAs we emerge from the supply chain challenges, we believe where we are in a solid position to achieve our long-term goals. Our team has worked tirelessly for our customers and then certainly myself and our leadership team greatly appreciate everything they've done in support of that and also embracing the changes that we've put forward. With that, I'd like to thank everyone for joining our call today. And we look forward to speaking with you again in December.\n\nThank you for joining. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDrew Konop -- Investor Relations\n\nRod Rushing -- Chief Executive Officer\n\nMark Sconieczny -- Chief Financial Officer\n\nMike Shlisky -- D.A. Davidson -- Analyst\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nJohn Joyner -- BMO Capital Markets -- Analyst\n\nMore REVG analysis\n\nAll earnings call transcripts"
}