{
  "companyName": "ASGN Incorporated",
  "companyTicker": "ASGN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/asgn-incorporated-asgn-q2-2022-earnings-call-trans/",
  "content": "ASGN Inc. (ASGN -1.53%)\nQ2 2022 Earnings Call\nJul 27, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to ASGN Inc. second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Kimberly Esterkin, investor relations.\n\nThank you. You may begin.\n\nKimberly Esterkin -- Investor Relations\n\nThank you, operator. Good afternoon, and thank you for joining us today for ASGN's second quarter 2022 conference call. With me are Ted Hanson, chief executive officer; Rand Blazer, president; Ed Pierce, chief financial officer; and Marie Perry, executive vice president. Before we get started, I would like to remind everyone that our commentary contains forward-looking statements.\n\nAlthough we believe these statements are reasonable, they are subject to risks and uncertainties, and as such, our actual results could differ materially from those statements. Certain of these risks and uncertainties are described in today's press release and in our SEC filings. We do not assume any obligation to update statements made on this call. For your convenience, our prepared remarks and supplemental materials can be found in the investor relations section of our website at investors.asgn.com.\n\nPlease also note that on this call, we will be referencing certain non-GAAP measures, such as adjusted EBITDA, adjusted net income and free cash flow. These non-GAAP measures are intended to supplement the comparable GAAP measures. Reconciliations between GAAP and non-GAAP measures are included in today's press release. I will now turn the call over to Ted Hanson, chief executive officer.\n\nTed Hanson -- President and Chief Executive Officer\n\nThank you, Kimberly, and thank you for joining ASGN's second quarter 2022 earnings call. As is evident from our second quarter results, we had a strong first half to the calendar year. Revenues for the second quarter surpassed the high end of our guidance range and totaled $1.1 billion, up 17.1% year over year and up 4.7% sequentially, driven by the continued strength of our commercial segment as well as growth in our federal government segment despite a difficult year-over-year comparable. Our commercial segment accounted for 74.5% of consolidated revenues, while our federal government segment accounted for the remaining 25.5% of revenues.\n\nAdjusted EBITDA also surpassed our estimates for the quarter and was up 20.7% year over year and up 6.8% sequentially to total $144 million. With these strong results, we continue to trend ahead of our three-year targets we laid out at our investor and analyst day conference this past September. This performance brings us closer to our goal of $6 billion in revenues by 2024. An important component to our success and in achieving our three-year revenue goal is our unique deployment model, and it's a leading provider of IT services and solutions to the commercial and government end markets, our business is U.S.\n\nfocused and has a very steady and predictable trends. These trends include not just our history of achieving above-industry revenue growth but also our continued margin expansion and free cash flow growth. For the quarter, adjusted EBITDA margins improved 40 basis points year over year to total 12.6%. Our free cash flow from continuing operations was $79.6 million, an improvement of 10.1% over the prior-year period.\n\nGiven our strong free cash flow and the market conditions, we have been actively buying back our shares. During the quarter, we purchased $91.2 million in shares. And in today's earnings release, we announced our board of directors approved a new, two-year $400 million share repurchase plan which replaces the $350 million plan approved in December 2021. The increased pace of repurchases in the second quarter and new expanded program, just approved, allows us to take advantage of market conditions while maintaining our view that thoughtful M&A yields the best long-term value for stakeholders.\n\nAs we discuss our second quarter performance today, three key themes will remain top of mind. These include: one, our consistently strong execution, which is evidenced by the growth of our two business segments; second, the stability and resiliency of our unique deployment model, which positions us to successfully navigate across market cycles; and third, our strong free cash flow generation and balance the flexible capital deployment strategy, which enables us to act in the best interest of all our stakeholders. So let's review these things and start by discussing our largest segment, commercial, which services large enterprises and Fortune 1000 companies. Our commercial segment had another very strong quarter with revenues of $850.6 million, an increase of 19.4% over Q2 of last year, with strong growth in both IT staffing and consulting services.\n\nApex Systems, our largest division, accounted for 83.1% of this segment's revenues for the quarter with top end retail accounts both achieving double-digit growth rates. From an industry perspective, all five of our commercial segment industry verticals achieved double-digit growth for the quarter. Within Apex System specifically, financial services, our largest industry vertical, had strong performance in banking and insurance, with even greater year-over-year increases amid our fintech and wealth management accounts. Growth in our Technology, Media and Telecommunications, or TMT accounts, was again led by technology and telecommunications work.\n\nProgress in our commercial and Industrial accounts reflected strength across all sectors with the exception of material, in particular, we achieved double-digit growth in energy, utilities, consumer discretionary and consumer staples. Improvement in our healthcare vertical revenues continued to be driven by the provider and payer accounts. Finally, growth in our business and government protocol was led by our business services accounts, while aerospace and defense accounts were up mid-single digits versus the prior year. Gross margin for the commercial segment was 33.1%, up 110 basis points from the prior year driven by our growing contribution of high margin commercial consulting, creative digital marketing and permanent placement businesses.\n\nAdjusted EBITDA margins were relatively consistent with Q1. ASGN IT consulting offerings remain an important source of value we provide our clients. For the quarter, commercial consulting revenues totaled $222.2 million, an increase of 53.9% year over year. Revenues derived from our work in web, mobile and application development, data analysis and migration and cloud architecture engagement led our commercial consulting's quarterly performance.\n\nWe had a particularly strong quarter for commercial consulting new bookings, which totaled $340.6 million up 56.5% year over year. This translates into a book-to-bill of 1.5 to 1 for the quarter, consistent with Q1. As a reminder, we calculate commercial consulting's book-to-bill as the ratio of our bookings, the amount of new work won during any given quarter that will be executed over the ensuing quarters to our commercial consulting revenues for that quarter. Our pipeline of business remains strong, improving double digits sequentially, and we are actively growing our capabilities.\n\nSpeaking of expanding our capabilities, at the beginning of July, we officially closed our acquisition of GlideFast, an elite ServiceNow provider. And within their first week as part of ASGN, the GlideFast team participated in more than a dozen client pitches, with Apex Consulting Services. We are not surprised by this new business momentum due to the high demand for ServiceNow. In fact, even prior to acquiring GlideFast, our commercial consulting customers who are asking for ServiceNow implementations.\n\nFor those not yet familiar, ServiceNow is a cloud-based workflow platform that has quickly become the go-to operating system of enterprises worldwide. In essence, ServiceNow provides a new digital layer throughout the enterprise operations, automating its workflows and streamlining its business processes quickly and at scale. By aligning our current IT consulting offerings with our GlideFast expertise, we are jump-starting our ServiceNow business and immediately offering GlideFast access to Apex Systems account base. The acquisition of GlideFast ideally fits with our M&A strategy of acquiring in-demand digital solution capabilities that can be strategically pulled across our large account portfolio.\n\nLike that of Apex Systems, GlideFast's client base spans multiple industries from TMT and financials, to consumer and business services among other verticals. We see significant revenue synergies with GlideFast above its stand-alone anticipated 30% revenue growth in 2023. Ed Pierce will provide further detail on GlideFast's revenue contributions later in this call. Let's now turn to the federal government segment, which provides mission-critical solutions to the Department of Defense, the intelligence community and civilian agencies.\n\nRevenues for the quarter totaled $291.2 million, an increase of 11% year over year, driven by a combination of organic growth and the impact of businesses we acquired in 2021. We also experienced better-than-expected spending on a cost reimbursable AIML contract, which was a pull forward from the second half of this year. Ed will speak more on that shortly. Gross and adjusted EBITDA margins were also up for the quarter related to improvements in the federal government segment's business mix including a smaller contribution of cost reimbursable contracts, which carry lower margin than other contract types as compared to the prior year, and the contribution from the higher-margin businesses we acquired in 2021.\n\nNew contract awards for the quarter were approximately $263.4 million, which translates to a book-to-bill ratio of 0.9 times to 1 on a trailing 12 months basis. Awards are speeding up, and we are already seeing contracts come through under the new government budget, a positive sign that government continues to drive spending in each of the areas in which ASGN is focused, including cybersecurity, AIML and digital transformation. At quarter end, contract backlog totaled $2.9 billion, a healthy coverage ratio of 2.5 times the segment's trailing 12-month revenues. During the quarter, some of our contract awards included a contract to support the U.S.\n\nArmy cybersecurity efforts by modernizing and strengthening their tactical networks, a recompete contract supporting NOAA's Office of Marine and Aviation Operations in which we help optimize their fleet capabilities, a new task order to support FCC application development, and lastly, a contract for building new and improved capabilities within training and readiness for the United States Marine Corps. In addition, justice, homeland and law enforcement businesses saw solid organic growth during the quarter. This growth was fueled by contracts in cybersecurity, systems engineering and digital transformation solutions work, including a recompete contract with the DOJ along with growth in other existing contracts. We also won new work with DHS and state law enforcement agencies.\n\nWith that, I will turn the call over to Ed Pierce, our CFO, to discuss the second quarter financial results and our third quarter 2022 guidance. Ed?\n\nEd Pierce -- Chief Financial Officer\n\nThanks, Ted. Good afternoon, everyone. As Ted mentioned earlier, our financial performance for the second quarter exceeded the high end of our guidance estimates. This performance reflected solid double-digit growth in our commercial segment, low double-digit growth of our federal government segment and expansion in our gross and adjusted EBITDA margins.\n\nFor the quarter, revenues were $1.1 billion, up 17.1% year over year on a reported basis and 13.4% organically, which adjusts for the $36.3 million contribution from acquired businesses. Gross profit, operating income and adjusted EBITDA were all up year over year and grew at higher rates and revenues. Revenues from our commercial segment were $850.6 million, up 19.4% year over year. All of commercial divisions grew double digits, with the highest growth coming from our commercial consulting, creative digital marketing and permanent placement services, which carry higher gross margins in our IT staffing services.\n\nRevenues from commercial consulting, the largest of the high margin revenue streams were $222.2 million, up 53.9% year over year. Revenues from our federal government segment were $291.2 million, up 11% year over year. Revenues for the quarter were higher than expected, mainly because of $16 billion in third-party software license purchases under a cost reimbursable contract that were expected to occur in the second half of the year. Revenues for the quarter included $27.5 million from acquired businesses.\n\nAnd revenues for the second quarter of last year included $11.8 million from the low margin web services resale program that the segment chose not to renew in Q3 of last year. Gross margin was 30.1%, up 180 basis points over Q2 of last year. Both business units reported year-over-year expansion in gross margin, driven by improvements in business mix. Gross margin for the commercial segment was 33.1%, up 110 basis points year over year.\n\nThe expansion was the result of double-digit growth of our high margin commercial consulting, creative digital marketing and permanent placement services. Gross margin for the federal government segment was 21.4%, up 3.1 percentage points year over year as a result of changes in business mix. This improvement resulted from: One, the contribution of high margin businesses acquired in 2021; two, the lower level of revenues from certain cost reimbursable contracts, including a low margin web service as a resell program; and three, higher profitability under certain firm fixed price contracts. SG&A expenses were $220.4 million, up 24.9% year over year.\n\nSG&A expenses included $3.1 million in acquisition and integration expenses that we do not include in our guidance estimates. Excluding these expenses, SG&A expenses were slightly above our guidance estimates primarily as a result of higher-than-expected growth in revenues and gross profit. Income from continuing operations was $72.6 million, up 26.7% year over year. Adjusted EBITDA was up 20.7% year over year, reflecting a 40 basis point improvement in our adjusted EBITDA margin to 12.6%.\n\nAt quarter end, cash and cash equivalents were $490.6 million and there were no outstanding borrowings under our $250 million revolving credit facility. Our senior secured debt leverage ratio was 0.91:1. During the quarter, we spent $91.2 million on the repurchase of approximately 912,000 shares of the company's common stock. Subsequent to the end of the quarter, we spent $350 million on the acquisition of GlideFast.\n\nOur financial estimates for the third quarter are set forth in our earnings release and supplemental earnings materials. These estimates are based on current production trends, assume 64 billable days in the quarter, and include an estimated revenue contribution of $35.1 million from the recent acquisition of GlideFast in the two federal consulting acquisitions made in the second half of last year. For the third quarter, we're estimating revenues of $1.183 billion to $1.203 billion, and implied revenue growth rate of 10.2% to 12%. We're estimating net income of $70.5 million to $74.1 million and adjusted EBITDA of $145 million to $150 million.\n\nWe're estimating year-over-year expansion in gross margin and a slight sequential decline as we're projecting a half point drop in the mix of permanent placement revenues. With respect to the full year 2022, we're updating our high-level comments made on our last earnings call. We're currently projecting revenue growth in excess of 13.5% and an adjusted EBITDA margin above 12.25% compared with 12% for 2021. The expansion of the margin is driven by a higher mix of commercial consulting, creative digital marketing and permanent placement revenues, partially offset by investments in our operating platform to support high sustainable growth in the business.\n\nThank you for your time. I'll turn the call back over to Ted for some closing remarks. Ted?\n\nTed Hanson -- President and Chief Executive Officer\n\nThanks, Ed. Following a record-setting first half, ASGN enters the second half of 2022 on solid footing and ready to support our clients' most critical business needs. While we are not necessarily recession-immune, we continue to execute strongly the first message of today's call. Our business model has several automatic stabilizers that support our recession resilience, the second of today's focus areas.\n\nLast but certainly not least, we have managed this business through numerous down cycles each time performing better than the market in revenues, while also maintaining very solid EBITDA margins and cash flow due to our variable cost structure. This is the third area we highlighted throughout today's prepared remarks. ASGN's scale and unique deployment model provides us with the stability throughout market cycles. The ASGN of today is better positioned for faster sustained growth in IT services and solutions and maintains more diverse revenue streams than ever before.\n\nOur U.S.-focused, high-end IT service offerings to a large and industry-diverse commercial client base, combined with our countercyclical federal government work, provides stable sources of revenue and strength during an economic downturn. These aspects of our operating model enable us to quickly accelerate our business to support each of our clients who are quick adopters of new technologies and actively looking to pursue their IT modernization and digital transformation initiatives. Importantly, customer IT spend is showing no signs of slowing. While in past economic cycles, you may have seen some pullback in IT spend, the pandemic has taught us that a sustainable business is one that is technologically savvy, that has systems in place to protect and secure its networks across multiple locations and that has agile platforms with automated processes in place.\n\nIn other words, the pandemic accelerated digital transformation and we do not see that trend changing. In fact, CTOs and other technology leaders now see investments in technology as business drivers and not cost centers, and we are focusing their company's IT spend on cloud computing, machine learning, artificial intelligence and automation, all areas in which ASGN excels. Bill rates are naturally increasing as we move up the technology pyramid into higher-value work. Case in point is the strength of our consulting business.\n\nConsulting contracts have stable revenue streams that often extend 12 to 18 months, providing great visibility into the outer months and years. Our commercial consulting customers are confident in their digital road maps and actively bidding out new work. Our government customers who also deploy us on long-term, mission-critical solutions contracts are seeing the benefit of the flow-through of the new federal budget. These favorable dynamics for both the commercial and Government end markets creates consistent demand for the IT services and solutions that ASGN provides.\n\nBefore closing, I'd like to note that today's earnings conference call officially marks Ed Pierce's last quarterly call as our chief financial officer. After nearly a decade as our CFO, Ed will be retiring from his role this August, and he will take on a strategic advisory role with ASGN through the end of this year. Marie Perry, who has had a great opportunity to work side by side with Ed over the past several months, is ready and excited to assume the CFO position. Ed, you have been a wonderful partner, a resourceful guy and a great friend.\n\nI cannot thank you enough for all that you have contributed to ASGN, not only as our CFO for a decade, but also previously as a member of our board of directors. On behalf of the board and our entire company, I wish you the best in your well-deserved retirement. With that, let's open up the call to questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Tim Maloney with William Blair. Please proceed with your question.\n\nSam Kusswurm -- William Blair -- Analyst\n\nHey. This is Sam Kusswurm on for Tim. Just first off, just wanted to wish you a happy retirement, Ed. I know I speak for both Tim and I here, but we've all appreciate your help on the years and wish you well.\n\nEd Pierce -- Chief Financial Officer\n\nThank you. I appreciate that.\n\nSam Kusswurm -- William Blair -- Analyst\n\nOur first question, I think this would be a good one for Ted, actually. You've spoken in the past about ASGN being less of an employment story and more about IT spending by your clients. So I was hoping if you could just comment on what you're currently seeing with respect to IT spending relative to a couple of months ago.\n\nTed Hanson -- President and Chief Executive Officer\n\nYeah. Well, I would say that it's -- it was strong a couple of months ago, and it remains strong. I mean I don't think there's too much change right now in terms of IT spending. You're right.\n\nWe've said many times that the better barometer for our business is less about general employment statistics and more about our customers' need for IT services. Obviously, digital transformation is driving that, both in commercial and in Fed. And so we see a pretty steady landscape there, and I think it's reflected in our performance for the second quarter but also our guidance for the third.\n\nSam Kusswurm -- William Blair -- Analyst\n\nGreat. I appreciate that. Maybe pivoting on the commercial side of the business, if I think about your services in the three big areas, those being workforce management, digital transformation and modern enterprise. If you were to see a slowdown in IT spending, which one of these areas would you expect to see them first? And then can you also comment about what you're seeing in that particular area right now?\n\nTed Hanson -- President and Chief Executive Officer\n\nRand, do you want to talk about that?\n\nRand Blazer -- President\n\nWell, I think the answer is, I wouldn't see it in workforce management because they tend to be more infrastructure-oriented and would continue on even in good times and bad times because you have to keep your lights on. Digital transformation has taken -- those services have taken the biggest leap over the past year and certainly the last few quarters. It might slow down a bit, but I would be surprised. Modern enterprise, there are certain apps and other things you could delay in putting in.\n\nI mean, I'm conjecturing that. I'm not saying we're seeing that necessarily. But that's probably the one that I would think would slow down. But so far, we haven't seen that.\n\nSam Kusswurm -- William Blair -- Analyst\n\nAppreciate the context, guys.\n\nOperator\n\nOur next question is from Tobey Sommer with Truist Securities. Please proceed with your question.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nThanks. If we look at the complexion of the business now and the kind of mix changes, I guess the most notable one is probably the increased exposure in the consulting area. From a high level, do you think that the collection of businesses and portfolio would perform in a materially different fashion if we sort of replicated the economic arc of the 2020 downturn?\n\nTed Hanson -- President and Chief Executive Officer\n\nWell, that's a good question, Tobey. I mean, my sense would be -- it would be the same or slightly better because of the mix. Obviously, commercial consulting services has been growing much faster than the rest of the business and the latest reported...\n\nOperator\n\nThis is the operator. Did you accidentally mute yourself?\n\nRand Blazer -- President\n\nYeah. Ted, did you cut off? OK, Tobey, let me -- well, let me take that one on just for a minute. And then Ted, maybe can hear us when he's on. That -- I think that arc was influenced more by certain segments of the economy.\n\nSo airline, hospitality, energy were all really down in that 2020 COVID period. And I think it affected their IT spend, which is our thesis right at the beginning of this call. So I think that was what happened there. It wasn't the need for more digital transformation or the need to continue to digitize your business, I think it was just certain industries.\n\nAnd if you remember, we didn't really get hurt that much in those periods, certainly not our consulting unit did not. And so I think that was more industry segment-specific than what we would see. What industry-specific segments today are affected? Obviously, energy a little bit, but gas prices actually help them in their spend. We see -- we've reported again, we've double-digit-ed everything, right, in the commercial side.\n\nIndustry sectors, retail accounts, top accounts, consulting and staffing also grew double digits in the quarter as we reported in Ed's background information. So that give you some sense?\n\nTed Hanson -- President and Chief Executive Officer\n\nYes. And Tobey, the only thing I would add to that and just to kind of echo what Rand said, you don't see industries go to a full stop like you did, right? I think that was the essence of what Rand was saying. And so we need to get into a recession, you see some industries pull back, but continue to do what they need to do. I mean he had a full stop there for a little while.\n\nAnd I think that was a unique event, if you will.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nRight. And from your own internal playbook, is there anything that you would do differently in terms of the levers at your disposal and the degree and sort of sequence at which you would pull them?\n\nTed Hanson -- President and Chief Executive Officer\n\nNo, I think -- look, I mean, we -- the business was really well managed. And even though we had a pullback in certain parts of our business for the year, we were pretty much flat in revenues, and our adjusted EBITDA was actually up in that period of the Q2, Q3. We continue to invest in our federal, which obviously we'll do if the opportunity is there. We've got automatic stabilizers in the commercial part of our business, and we can react pretty quickly to that.\n\nI think like we've said in our remarks, this is not the first time we've been through this. And so we understand what to do if we need to. And so I think that -- I think we managed that well unit. And I think that we know what the playbook is, if something else were to happen here in the near future.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK, if I can sneak one last one. I think you mentioned as part of guidance that perm is assumed to be lower. I'm not sure I'm right about that. But if I am, can you give us a little bit more color about that assumption? Does it reflect client behavior what you're hearing or is that just a conservative assumption based on macro?\n\nTed Hanson -- President and Chief Executive Officer\n\nYeah, I think it's a conservative assumption just based on growth rates, what we expect in growth rates. But Ed, do you want to talk about that?\n\nEd Pierce -- Chief Financial Officer\n\nYeah. I mean, look, we anticipated that perm would step down in Q2. Q1 was a high watermark for us in the perm placement mix. And it did step down, but not to the degree that we originally thought and we put out our guidance estimates.\n\nAnd so we're anticipating that it's going to step down, about a half point in Q3 and probably another quarter of a  point, Tobey, in Q4. So that will put us back to probably more historical levels in terms of the mix.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK, thank you very much.\n\nOperator\n\nOur next question is from Jeff Silber with BMO Capital Markets. Please proceed with your question.\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nThank you so much and Ed, let me again just express my thanks and wish you best of luck in your retirement. I was curious if you could just talk about trends intra-quarter, specifically in your commercial business. And the reason I asked is when I think when you announced the GlideFast acquisition, you came out with expectations for the quarter, quite thinking revenue to be in line and I think adjusted EBITDA was going to be ahead of the high end of guidance. Yet, the numbers you just reported were much better.\n\nDid things really pick up in June?\n\nTed Hanson -- President and Chief Executive Officer\n\nI think the -- well, first of all, our commercial segment, Jeff, is just performing great. The market is good. We're capturing it, and their acceleration continued right through the end of the quarter. So I think that certainly was one contributor.\n\nEd mentioned what was going on in the federal piece of the business and that we got some revenues there that we thought may fall into the third or the fourth quarter. It's really the sum of those two things. But I'd principally say across the board, we performed better here than we thought in the last few weeks of the quarter. So I don't know if I would call it a -- I don't know if I would call it a surprise.\n\nI think we gave you our best look when we announced the GlideFast piece. But I think the business continued to progress on both sides of the house through the last three weeks of the quarter.\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nOK, that's really helpful. And my follow-up question is just about your own internal hiring, either from recruiters, account managers, etc. If you can just talk about how that's been trending? Have you slowed down at all? Is it picking up? Any color would be great.\n\nTed Hanson -- President and Chief Executive Officer\n\nYes. Rand, do you want to take that one?\n\nRand Blazer -- President\n\nYeah, we added headcount in the second quarter, both on the account management and consulting and recruiter side. So we believe, as Ted said, that we're looking at still strong demand as we go through the year, and we have obligations with our clients, certainly through our bookings and other things. And so we needed to continue to add to our headcount and we did.\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nAnd do you expect that to continue in the second half of the year?\n\nRand Blazer -- President\n\nYeah, but -- well, the answer is yes. But I would say, remember what Ted said, we have what we call automatic stabilizers. I mean we can stop on a dime if we have to. I mean we have a just-in-time recruiting workforce second to none, right? So that applies to our own internal workforce.\n\nSo yes, we're nimble, but yes, we're sharing. We're expecting that in our guidance numbers, we're going to continue to go and we're going to have to add headcount.\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nOK, great. Thank you so much.\n\nOperator\n\nOur next question is from Heather Balsky with Bank of America. Please proceed with your question.\n\nHeather Balsky -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thank you. I guess, my first question and first of all, congratulations on the retirement Ed, and congratulations to Marie on the new role. So my question was with regards to the permanent staffing and the step down.\n\nSort of, do you think this is a function of some of the macro concerns people have? Do you think this is a natural normalization? And kind of how does that -- how do you think that business could perform in a downturn? What's sort of the downside risk on that permanent piece of the business?\n\nTed Hanson -- President and Chief Executive Officer\n\nWell, let me take the first part of that. I mean, our permanent placement revenues, although they're a very small part of the business are steady. The reason they're down as a percentage of the total is the rest of the business is -- the biggest part of the business is growing faster. So that's principally while there was a step down in just the mix of revenues of permanent versus the total.\n\nIn historic recessionary periods, you've seen that permanent placement be one of the first to come off. And so that would be an early indicator. We're not seeing that. Again, it's -- for us, this is more of a mix of revenue than anything else.\n\nBut you traditionally would see that. And that's why we've always -- obviously, we want -- our clients need this service. We want to be able to respond to it. But we also want to manage it as a piece of our total portfolio because it comes with certain cyclicality to it.\n\nSo we're aware of that and think about that as we manage the various pieces of where we invest.\n\nHeather Balsky -- Bank of America Merrill Lynch -- Analyst\n\nThank you. And a question on the ServiceNow acquisition -- or sorry, the GlideFast acquisition and the relationship with the ServiceNow product. I guess, how should we or how are you thinking about demand for ServiceNow over the longer term and the fact that it's a kind of specific brand? Just -- it sounds like your customers are asking for the product, but just for comfort in the durability of the ServiceNow product.\n\nTed Hanson -- President and Chief Executive Officer\n\nRight. Rand, do you want to take that?\n\nRand Blazer -- President\n\nHeather, listen, I think if our client base before the acquisition is, like even ourselves, are looking at ServiceNow technology and seeing how it fits, we have a vision and a view similar to what ServiceNow has as it provides a digital layer that can sit across your ERP systems and can provide for smoother and simpler integration of information and data sharing across that. So it's a part of the digital transformation companies will go through. And I think our client base is looking at it and trying to determine where to apply it, more than just IT project management, which is its roots, it's early starts. So if you take the vision of ServiceNow and you take what we hear from our clients, it made sense to go out and acquire more capability here.\n\nGlideFast was one of the best of the non-global integrators around their technology. We are fortunate enough to approach them and get them to join in with us. So we believe it's going to have a nice run life. Bill McDermott from ServiceNow and I think his quote is that we're in the second inning here or something like that.\n\nHe thinks we're 20% into the application of that technology in Corporate America. So whether he's right or wrong, don't know. I think it's clear, it's in its early phases and the products are going through additional development and usage. So we're hearing it from our clients.\n\nWe hear it from ServiceNow. We see it in the marketplace, and so we made the step. And I think Ted outlined in his comments that even in the first couple of weeks. Look, we knew we had some potential pipeline here and opportunities.\n\nAnd when we bought it, not to mention their clients and their client base, so it seemed like a really smart decision to move forward with that. Did I answer your question, Heather?\n\nHeather Balsky -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Yes, thank you for the color. It's very helpful.\n\nOperator\n\nOur next question is from Mark Marcon with Baird. Please proceed with your question.\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nHey, good afternoon. And let me start with congratulating Ed again. It's been a pleasure over the decades working with you. So I wish you all the best.\n\nWith regards to Apex Systems, can you talk a little bit about what you're seeing in terms of bill rates and pay rates within core IT staffing? And then, any sort of color that you could give us on the bill rate side, on the consulting side, just in terms of an apples-for-apples basis if that's possible?\n\nTed Hanson -- President and Chief Executive Officer\n\nWell, Mark, we don't release specific information on bill and pay rates. Just maybe to get some color and Ed can add to this as well, I mean, obviously, our bill rate is going up. But we're doing a lot more high-value work as compared to where we were, as we're on this journey in consulting services. On the staffing side, there's been wage inflation, but we've also been able to manage that back to the customer and their bill rate.\n\nAnd so in that way, kind of inflation has been our friend here as supply for IT workforce is tight. And as we've had to deal with wage inflation, we've been able to go back and deal with that with the customer. So I don't think the dynamics there have changed any from the prior quarter or the quarter before that. But I think those trends are what we've seen and we've been able to kind of manage that and maintain or even expand our gross margins around that work.\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nGreat. And then can -- I mean, could you just give us a sense in terms of whether the bill rates, just on core IT staffing are going up at a level that's consistent with inflation or even higher than the published kind of CPI numbers? Anything around that?\n\nTed Hanson -- President and Chief Executive Officer\n\nWell, look, I think you can look at our gross margins, which would imply that they are going up at least at the same rate, if not more, right? And I think that it's both because remember, in the consulting part of our business, we get a higher gross margin because the value proposition of the work is higher. But obviously, we wouldn't be able to fight decrement in the IT staffing part, which is a large -- still the larger part if we were having eroding gross margins. So I think that some of those things would tell you that we're able to at least get wage inflation and then higher margins on our consulting business.\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nAbsolutely. How did that create a circle view?\n\nTed Hanson -- President and Chief Executive Officer\n\nRand, do you want to talk about Creative Circle for the quarter? I mean, Mark, they were -- they accelerated through the quarter. I mean growth was there. I think that's a marketplace that obviously, we're watching. I mean, there are headlines out there about what's going on with the tech companies.\n\nBy and large, the big tech companies are not a big part of our portfolio in Creative Circle. So some of the things that you're seeing specific to them around digital advertising and marketing are not a direct hit, if you will, on us. But it is a data point in the marketplace and something we have to continue to watch.\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nGreat. And then -- I mean it did accelerate through the quarter, so you're definitely not seeing it. And on the commercial side, just by industry vertical, obviously, strong growth across the board, with TMT facing. On the financial services, with rates going up, that should be a positive for a lot of banks.\n\nBut then, of course, there's been some headlines by some CEOs in that space that have basically said watch out for hurricanes and stuff like that. What are you seeing on the financial services vertical? So I would expect that that would continue to grow nicely, but -- yeah.\n\nTed Hanson -- President and Chief Executive Officer\n\nRand?\n\nRand Blazer -- President\n\nTed. Well, first, Mark, can I comment on Creative Circle? I mean, it's performed very well in the second quarter. And I'll remind you that the comps for Creative Circle, both in the second quarter, third and fourth quarter of last year are very strong. So they're performing very well on top of strong quarters a year ago.\n\nSo that's one thing I would comment. In terms of financial services, you can see, again as an industry vertical, it grew. We featured this time, not just fintech and wealth management, but also the banks. We've had good growth in the, what we call the regional bank segment, but the big banks are also growing for us.\n\nAnd so -- can I route that back to their earnings are better and their opportunities are better and their IPs are still there? I guess so. But it has performed well for us in the second quarter and I expect it will continue.\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nGreat. And then GlideFast, how much can you accelerate the growth there? How much cross-selling capabilities do you have? How big could that be?\n\nTed Hanson -- President and Chief Executive Officer\n\nWell, Mark, we haven't sized it numerically, but obviously, that's an enormous market. And I'll let Rand comment as he thinks about the number. But ServiceNow have commented on how big that marketplace is that they believe. And while GlideFast has a nice base of revenues coming into our business, the one thing we always say, and I would say about GlideFast, too, is revenue synergy opportunity is bigger for us together going forward because of Apex's large account portfolio than GlideFast revenue that they bring in alone.\n\nRight, Rand?\n\nRand Blazer -- President\n\nYeah, I think Ted said it all, Mark. And if you listen to Bill McDermott and GlideFast and ServiceNow script, you hear all the things he says. And I think we, obviously, our thesis is with our cap base, we can grow GlideFast faster than they can grow themselves.\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nAbsolutely. I mean we've monitored ServiceNow for a long period of time as part of our normal coverage. And it's obviously a huge opportunity, as far as wondering -- does GlideFast have higher margins than your core consulting business or can it have higher margins?\n\nRand Blazer -- President\n\nYeah. Yes and yes.\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nAnd then lastly, just on the government side, it's great to see that the budget has been resolved. Would you expect that during the second half of the year, the book-to-bill will start inflecting more toward 1 or 1:1, or 1.1 or higher?\n\nTed Hanson -- President and Chief Executive Officer\n\nYes. I think, Mark, that's a good point here. The first thing you're going to see, obviously, is larger new booking numbers and then book-to-bill numbers that are at one and above, and that's our expectation. Most of the benefit of all that will come in 2023.\n\nThere will be some benefit we hope here later in the last part of 2022, but most of the benefit will be in 2023. But to your point, yeah, look for increased new bookings and book-to-bill ratio that's at 1.1 and above.\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I would like to turn the call back to Ted Hanson for closing comments.\n\nTed Hanson -- President and Chief Executive Officer\n\nGreat. Well, that's the end of our call today. We appreciate everyone's interest in ASGN and we look forward to talking to you at the end of our third quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKimberly Esterkin -- Investor Relations\n\nTed Hanson -- President and Chief Executive Officer\n\nEd Pierce -- Chief Financial Officer\n\nSam Kusswurm -- William Blair -- Analyst\n\nRand Blazer -- President\n\nTobey Sommer -- Truist Securities -- Analyst\n\nJeff Silber -- BMO Capital Markets -- Analyst\n\nHeather Balsky -- Bank of America Merrill Lynch -- Analyst\n\nMark Marcon -- Robert W. Baird -- Analyst\n\nMore ASGN analysis\n\nAll earnings call transcripts"
}