{
  "companyName": "FIGS, Inc.",
  "companyTicker": "FIGS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/11/figs-inc-figs-q3-2022-earnings-call-transcript/",
  "content": "FIGS, Inc. (FIGS -1.18%)\nQ3 2022 Earnings Call\nNov 10, 2022, 5:00 p.m. ET\n\nOperator\n\nGood evening, everyone, and thank you for joining today's FIGS third quarter fiscal 2022 earnings conference call. My name is Don Penn. I'll be your operator for today's call. All lines will be muted during the presentation portion of today's call with an opportunity for questions and answers at the end.\n\n[Operator instructions] I would now like to pass the conference over to our host, Ms. Jean Fontana, head of investor relations. Ma'am, the floor is now [Audio gap]\n\nJean Fontana -- Head of Investor Relations\n\nThank you. Good afternoon, and thank you for joining today's call to discuss FIGS' third quarter 2022 results, which we released this afternoon and can be found in our earnings press release and in the stockholder slide deck on our investor relations website at ir.wearfigs.com. Presenting on today's call are Trina Spear, our co-founder and chief executive officer; and Daniella Turenshine, our chief financial officer. As a reminder, remarks on this call that do not concern past events are forward-looking statements.\n\nThese may include predictions, expectations, or estimates, including about future financial performance, market opportunity, or business plans. Forward-looking statements involve risks and uncertainties, and actual results could differ materially. These and other risks are discussed in our SEC filings, including in the 10-Q we filed today, which we encourage you to review. Do not place undue reliance on forward-looking statements, which speak only as of today and which we undertake no obligation to update.\n\nFinally, we will discuss certain non-GAAP metrics, which we believe are useful supplemental measures for understanding our business. Reconciliations of these non-GAAP measures to their most comparable GAAP measures are included in the earnings release and shareholder deck we issued today. Now, I'd like to turn the call over to Trina Spear, chief executive officer of FIGS.\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nThank you, Jean. Good afternoon, everyone. Thank you for joining us for our third quarter 2022 conference call. I want to thank the entire FIGS team for their hard work and devotion to the healthcare community.\n\nWe delivered strong financial performance for the third quarter with net revenue growth of 25% year over year, gross margin over 70%, and adjusted EBITDA margin of 16.4%. Our performance was led by a focused effort to expand our community, which grew our active customers by 24% to $2.2 million on an LTM basis. This is the second highest number of new customers of any quarter in FIGS' history. We also delivered a record level of customer reactivation, defined as customers who have lapsed for 12 months and have since returned to FIGS.\n\nLooking at average order value, or AOV, we delivered 10% growth year over year as we continue to emphasize our complete layering system with the expansion of our lifestyle offerings. Lifestyle generated sales growth of 65% in the quarter and reached 17% of net revenue. Net revenues per active customer also increased, up $8 from last year. And finally, our international business delivered strong performance with a 49% increase in net revenue.\n\nWhile many of our key operating metrics showed strong performance, our frequency rates continued to slow. These softer trends became more pronounced toward the end of September and quarter to date. We attribute this to two factors: First, we believe the macro trends, including the sustained level of inflation, began to weigh more heavily on our healthcare professionals. Our own customer surveys tell us that FIGS remains their favorite brand, but they are pulling back on purchases due to their tighter budget.\n\nSecondly, recent color launches did not generate the same sales lift we have typically seen in the past. We expect these trends to continue through the remainder of the quarter, and therefore, we are reducing our outlook. While we can't control the macro headwinds, we can control how we drive our business forward. We're adjusting to the macro conditions, listening to our healthcare professionals, and focusing on product innovation to meet their needs.\n\nOur deep connection with healthcare professionals fuels our drive to continuously evolve our business and bring excellence to our community. We will continue to make strategic investments to advance our leadership position in the healthcare apparel industry while carefully managing costs through the challenging period. Turning to our strategic priorities. Starting with product innovation.\n\nAs we've discussed in the past, our product innovation strategy is focused on both our scrubs business and our lifestyle offerings, which together, make up our layering system. By leveraging the insights and data we receive from the healthcare community, we continue to improve at creating products with the feature and design solutions our customers want most. We will continue to lean into our solutions-based approach as we develop even more new products that are technical, comfortable, and functional, while continuing to incorporate new colors, which drive both loyalty and new customer acquisition. We believe this more holistic approach to style and color launches will amplify excitement around newness.\n\nThis approach has already demonstrated tremendous success in launching our cargo collection, where we highlighted the functionality and comfort of products and new colors. In our scrubs business, we continue to expand our selection with the innovation and product enhancements our customers are looking for. For example, our Rafaela scrub jumpsuit in quartz sold out within hours during our breast cancer awareness campaign. As a result of the strong demand, we expect to add this jumpsuit to our core offering.\n\nOur lifestyle offerings have continued to drive growth in net revenue per active customer, mainly through lift in UPT as customers look to purchase the layering system. This has helped fuel the growth in AOV, which has increased 18% from $95 in 2019 to an LTM average of $112. This purchasing dynamic continued into the third quarter, with orders including lifestyle offerings reflecting a more than 30% higher UPT on average than purchases without. The strength of our lifestyle offerings also illustrates our ability to grow our TAM.\n\nWe were encouraged to see the double-digit lift in first orders that contain lifestyle offerings as we continue to deliver innovation that addresses the broader needs of healthcare professionals. A great example of how lifestyle attracts new customers is FIGS PRO. This polished and performance-driven, office-ready collection launched earlier this year with excellent results. Our expanded collection is resonating with physicians and dentists, entering the FIGS community and driving a positive response from our loyal customers.\n\nAs we look ahead, we expect to introduce an even greater flow of new products as we continue to identify gaps and pain points in our customers' uniforms. We are also expanding our scrubwear fabric portfolio and developing new techniques within our existing fabrications to solve more use cases and style options. Within lifestyle, we will continue to expand our offerings across categories. For example, we are building on the success of our outerwear business, where we have seen strong demand for our on-shift styles.\n\nPreviously, healthcare professionals bought leases from traditional brands, which were not constructed with the healthcare professional needs in mind. We delivered an alternative with outstanding quality and functionality that meets their needs. We recently launched our new lightweight Packable Puffer, perfect for cold shifts requiring warmth, lightness, and mobility. Our puffer can be worn on and off shift, giving our customers greater versatility.\n\nWe are also excited to be soft launching extended sizes, ranging from 3XL to 6XL later this year. This is great news for our community. We are responding to a large and underserved segment of the healthcare community that has shared their desire to wear FIGS. It is a critical component in the success of our brand, and we have been working diligently to optimize our fit for extended sizes to ensure the best possible experience for our healthcare professionals.\n\nMoving next to building brand awareness. With just over 2 million active customers in the U.S. at the end of Q3, we have penetrated approximately 10% of U.S. healthcare professionals and continue to see a significant growth opportunity.\n\nAs I mentioned, we added the second highest number of new customers of any quarter in FIGS history despite the challenging macro environment. We invested in digital marketing during the quarter to drive new customer acquisition, particularly within our social media channels. We continue to leverage multiple digital and out-of-home outlets to share brand moments and educate healthcare professionals about our mission and our purpose. We plan to lean further into YouTube, TikTok, and OTT, where we will be tailoring our creative to align with varying audiences and channels.\n\nLooking at out-of-home. We launched our Philadelphia activation in August. This included a three-day in-person event near Thomas Jefferson University and other hospitals. We were excited to see the strong turnout as healthcare professionals took the opportunity to see our new offerings in person and touch and feel our products.\n\nThis quarter, we also continued to deliver brand moments on topics we know are very important to our healthcare community. For breast cancer awareness month, we launched our piece out breast cancer campaign, highlighting our limited-edition quartz color. As part of our commitment to the healthcare community, we donated $50,000 to Memorial Sloan Kettering Cancer Center to support their young women with breast cancer program. For the holidays, we plan to launch our integrated gift-giving campaign across multiple social channels, allowing everyone to get FIGS to express their gratitude to the healthcare professionals in their lives.\n\nWe expect #getfigs to be the biggest gifting movement in our history with influencers and celebrities sharing inspiring stories with a call to action as they give back to their Awesome Humans. We also plan to incorporate this campaign into our Chicago activation at the significant mile in Millennium Park, which is happening right now. To lead our marketing efforts. I'm pleased to share that we appointed Sunil Kaki as chief marketing officer.\n\nWith his proven track record in building brands and communities and deep digital marketing knowledge, we are excited to have him lead our marketing strategy. Let's turn now to customer engagement, where we continue to look for ways to elevate the experience for our loyal community. We recently launched a new customized mobile app that we developed to drive more meaningful engagement with our healthcare community. As features of our new mobile app extend well beyond enhancing the purchase experience, enabling us to connect more deeply with our healthcare community through more relevant educational content, personalization, and wellness support.\n\nThis launch is another way to raise the bar on how we serve our Awesome Humans. At FIGS, we remain committed to supporting this incredible community through advocacy. As part of this effort, we took nine leading healthcare professionals to Washington, D.C. in September to advocate for comprehensive legislation, which we call the Awesome Humans Bell to reduce the burden and strain on our community.\n\nThere are many issues to address, including pay, mental health, safety, and training. We met with 17 congressional offices on Capitol Hill and the White House to move this conversation forward. In addition to our many other philanthropy efforts, advocacy at FIGS will continue to be an important way that we deliver for our healthcare professionals. Finally, let me talk about international, and I'll start by saying that we are very pleased with our progress in growing our nascent international presence.\n\nAs we discussed on our last call, we took steps to improve the customer experience and lower barriers to conversion in international markets. These efforts supported revenue growth of 49% with particularly strong performance in Canada, the U.K., and the European markets we've entered. As we focus on driving brand awareness internationally, we expect to enhance the customer experience through language translations and dedicated marketing support. In addition, we plan to launch localized marketing campaigns to engage with the community and elevate the customer experience through tailored messaging.\n\nWe're highly encouraged by the growing demand for the FIGS brand globally. As a capital-light, DTC business, we can enter markets relatively quickly. Thus far, in the fourth quarter, we have entered New Zealand, Israel, and the U.A.E. We plan to opportunistically expand as we seek to gain the first-mover advantage, focusing on the countries where we see demand for FIGS.\n\nWhile we expect the macro environment to remain challenging in the near term, we intend to invest strategically in our long-term growth while carefully managing our costs. We believe this will best position us to deliver consistent and profitable growth over the long term, especially once the macro dynamics improve. With that, let me turn it over to Daniella.\n\nDaniella Turenshine -- Chief Financial Officer\n\nThanks, Trina, and good afternoon, everyone. I will begin with a review of our third quarter performance and discuss our revised outlook. For the third quarter, net revenues grew 25% to $129 million compared to $103 million in Q3 last year, primarily due to an increase in orders from existing and new customers and, to a lesser degree, higher AOV. We were pleased to deliver a 24% increase in active customers, fueled by ongoing initiatives to drive brand awareness globally and strong reactivation among lapsed customers.\n\nAOV grew 10%, led by higher units per transaction, or UPT, and an increase in average unit retail, or AUR. Both UPT and AUR benefited from the continued strong response to our lifestyle offerings, reflecting the power of our layering system. Orders containing a lifestyle product reflected a 30% higher UPT than those without. To a lesser degree, promotional events in the quarter also drove higher UPT.\n\nThe higher AOV on an LTM basis drove net revenue per active customer to 227, up $8 from Q3 last year. While we delivered strong performance across key operating metrics in Q3, based on more recent trends in purchase frequency, we believe the impact of the macro environment on our customer base is increasing. In addition, as Trina stated, revenue from color launches did not meet our expectations. As a result, we are taking steps to increase the velocity of our product innovation strategy and take a more holistic approach to new styles and colors.\n\nGross margin for Q3 was 70.6% compared to 72.7% in Q3 2021. The 70.6% was above our expectations due to lower-than-expected freight costs. The 210-basis-point decline compared to Q3 last year was primarily due to increased freight costs resulting from higher air freight usage and an increase in ocean freight rates. To a lesser extent, we also saw an impact from the higher mix of promotions and product mix.\n\nMoving to operating expenses. Selling expense for Q3 was $31.9 million, representing 24.8% of net revenues compared to 19.4% in Q3 2021. This was primarily due to higher costs within fulfillment, including warehouse storage necessary to house inventory we pulled forward. To a lesser degree, selling expense was also impacted by higher shipping rates.\n\nMarketing expense for Q3 was $20 million, representing 15.6% of net revenues compared to 15.4% in Q3 2021. As Trina mentioned, we made investments in digital, where we saw opportunities to drive new customer acquisition. We also increased our out-of-home marketing spend as we tested ways to expand brand awareness. Consistent with what we have shared in the past, we are able to maintain healthy customer acquisition costs due to the effectiveness of word of mouth, which continues to be the No.\n\n1 driver of new customers. We are highly focused on positive first-order contribution margin, and that discipline has not changed. At 2.2 million active customers, we have significant untapped potential in the U.S. alone, and we are on a mission to be the largest provider of scrubs and lifestyle apparel to the healthcare community.\n\nWith that as our North Star, we believe that balancing investments in top-of-funnel marketing and maintaining a first-order profitable discipline is the right approach to growing our brand in a healthy way. G&A expense for Q3 was $27.7 million, representing 21.5% of net revenues compared to 27.7% in Q3 2021. Of the 620-basis-point decrease, 190 basis points is due to a change in our accrual methodology for charitable donations. Additionally, G&A benefited from reimbursement of legal fees totaling $5 million.\n\nHowever, this was partially offset by increased public company costs associated with implementing Sarbanes-Oxley 404. Taking this to the bottom line, our net income was $4 million or $0.02 in diluted EPS for the quarter. Adjusted net income was $4.1 million. And diluted EPS, as adjusted, was $0.02 in Q3.\n\nThis compares to adjusted net income and diluted EPS as adjusted of $9.4 million and $0.05 per share in Q3 2021, respectively. Finally, our adjusted EBITDA for Q3 remained strong at $21 million for an adjusted EBITDA margin of 16.4% compared to 21.6% in Q3 2021. Touching on our balance sheet. We finished the quarter with cash and cash equivalents of $155.6 million.\n\nInventory totaled $168.1 million at the end of the third quarter. As we discussed on our second quarter call, given the supply chain challenges we experienced in the first half of the year, we decided to increase weeks of supply on our core styles to ensure we could adequately fulfill customer demand. Furthermore, we decided to bring in limited edition colors and styles earlier to support the planned launches. As a result, we saw inventory build through the quarter as shipments came in even earlier than planned.\n\nAs a result, in-transit made up 24% of inventory, down from approximately 30% at the end of Q2. Breaking down inventory on hand. The composition looks similar to Q2. Over 50% is in core styles and colors, which carries lessened obsolescence risk due to our uniform products' seasonless, always-in-stock nature.\n\nApproximately 20% is in future colors and styles that we pulled in early, as I mentioned above. We will work diligently to get inventory back in line. We have updated our future core purchase orders in order to bring down our weeks of supply over time. In addition, we are taking action through promotional strategies to move through inventory from prior launches.\n\nWe believe these measures will enable us to get inventory growth more aligned with sales growth by mid-2023. The key priority is to maintain healthy inventory levels to optimally manage our working capital and maintain our strong debt-free balance sheet. Moving to our outlook, I'd like to provide more context on what we expect for the fourth quarter and touch on some expectations for next year based on recent trends and initiatives we have in place. Starting with the top line.\n\nWe expect fourth quarter net revenue growth to be in the mid-single-digit range. This assumes that strong growth in active customers will be partially offset by a continuation of lower frequency rates and a slightly lower-than-previously expected AOV versus last year. With respect to frequency rate, we expect customer demand will continue to be impacted by the challenging macro environment. In addition, we expect the sales lift from color launches to remain in line with more recent trends, especially as we lap record-breaking color launches last year.\n\nTurning to average order value. While we had anticipated a deceleration in growth due to the tougher AOV comparison of 113 in Q4 last year, we now expect to see further pressure due to deeper promotions as we work through inventory from past color launches. While we expect more sales to come from promotions given the current macro environment, we are committed to maintaining discipline in our promotional activity, even if that means lower growth in the short term. We recognize that the holiday period will be highly promotional which is what customers are gravitating to.\n\nHowever, we are managing our business for long-term success and prioritizing maintaining brand integrity. Moving to gross margin. As mentioned earlier, freight rates have sequentially improved. However, we expect this to be offset by deeper promotions versus last year.\n\nTherefore, our outlook for gross margin remains unchanged for the fourth quarter. Looking at operating expenses. Starting with selling expense. We expect greater deleverage than we saw in Q3 due to a full quarter of expenses related to the storage of additional inventory and the continuation of higher shipping costs.\n\nThese elevated costs are expected to extend into the first half of 2023, while we take action to reduce inventory levels. Additionally, starting in Q1 2023, as we scale our business for future growth, we plan to make enhancements to our fulfillment capabilities to increase reliability and flexibility and shorten fulfillment times to elevate the customer experience. We expect marketing expense as a percentage of sales to be similar to Q3 as we continue to drive brand awareness initiatives, which have a longer ROI time horizon than performance marketing. For the full year, we now expect marketing to be slightly above 15% as we opportunistically accelerated spending in new customer acquisition where we saw an attractive return.\n\nAs we look ahead to 2023, we remain committed to maintaining a positive first-order contribution margin and expect marketing to remain around 15% of net revenues. On G&A, we expect cost to increase as a percentage of sales for the fourth quarter due to an increase in our accrual for future donations of inventory and additional costs for a soft implementation. In 2023, we plan to make strategic investments in international expansion and product innovation as we continue to drive growth in the business. Turning to our revised 2022 guidance.\n\nAs a result of these factors, we now expect net revenues to be approximately $495 million, representing growth of 18% compared to 2021. And our 2022 full year adjusted EBITDA margin is now expected to be approximately 16%. In conclusion, we remain committed to delivering both the product innovation and deep engagement that our healthcare community has come to rely on. We plan to manage our business prudently through the macro environment while continuing to advance our growth strategies across product innovation, international expansion, and fulfillment capabilities.\n\nWe believe the investments we are making today set us up to be an even stronger company as we emerge from this challenging period. And we have a healthy balance sheet to support these initiatives as we scale our business for sustainable and long-term profitable growth. With that, I will turn it over to the operator to kick off our Q&A session, first, with our analyst community addressing their questions. We will then answer questions received from our shareholders through the Say platform.\n\nOperator?\n\nOperator\n\nThank you, ma'am. [Operator instructions] Our first line of questions comes from the line of one Brian Nagel with Oppenheimer. Your line is now open.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi, good evening. Thanks for taking my questions. So, I guess my first question, I mean, maybe a simple one, just with respect to the updated guidance and particularly Q4. So, what you laid out for Q4, that mid-single-digit growth, is that consistent with what you're seeing in the business right now?\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo looking at Q4, approximately half of that deceleration is coming from a decrease in frequency. Our forecast for the fourth quarter reflects the trends that we're seeing at the end of September and also quarter to date. And as we look at our data, we do believe that healthcare professionals are still grappling with inflation and looking for ways to stretch their dollar further. The remainder is related to AOV, which we initially expected would be up slightly year over year as we're lapping an AOV of $113 in the fourth quarter of last year, which we do believe was partially fueled by stimulus spending.\n\nSo, our outlook now for Q4 reflects slightly lower AOV year over year. While we are anticipating higher UPT, we do expect that to be offset by lower AUR given higher discount rates that we're planning to do at Black Friday, Cyber Monday. As a reminder, 2021, Black Friday, Cyber Monday reflected a record low discount rate due to strong consumer demand, as well as lower inventory. But that's what we're seeing today, and that's what we've built into our fourth quarter forecast.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nGot it. That's helpful. Then my second question, just with regard to the comments you made around the color launches and maybe a more muted response to those launches on the part of your consumers. So, [Inaudible] few questions together.\n\nBut I mean one, have you seen this before? Is there a difference between how your newer -- or as I say, your existing customers and new customers are reacting? And then as you -- and assuming you all actually have played around with some price promotions, are you seeing a response when you put price promotions in place?\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, on our color launches, to be clear, we're still seeing a strong lift in both our color and our product launches, and our customer surveys are telling us that our healthcare professionals love new colors and that it's a big purchase driver for them. That being said, we're learning fast and we're leveraging our insights to evolve our strategy there. Color is still and is going to continue to be a very big driver of the business, but we have a lot of new innovation coming, and we're going to take a more holistic approach to style and color launches and really integrating the stories together. I would also say, as a reminder, that color is more geared to repeat customers.\n\nAnd so that's where we're seeing kind of that bigger impact on repeat frequency. But I'll kick it over to Trina to talk a little more about our color and product launch strategy.\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nThanks, Daniella. Yeah, I think if you think about our launches, right, there's really two things that we're adjusting for. First thing is we're really aligning our launch frequency with the demand trends that we're seeing and how frequency rates have come down a bit as healthcare professionals are spreading out their purchases over a longer period of time. The second thing that we're doing is we're evolving our launch strategy to really be more holistic and focused on product innovation.\n\nAnd you saw that even with our launch of our cargo collection, with our launch of our Rafaela scrub jumpsuit, which is a huge hit and sold out very quickly, our Packable Puffer. And so, these are some examples where we're really leaning into innovation where our healthcare professionals are coming to us because we're bringing true functionality and really helping them in so many aspects of their jobs.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nOK. I appreciate it. Thank you.\n\nOperator\n\nThank you for your questions, sir. Our next line of questioning comes from the line of one Ed Yruma with Piper Sandler. Your line is now open.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nHey, good afternoon, guys. Thanks for taking the questions. I guess, first, just to click down a little bit on the change in accounting for the charitable contributions. Could you just make us maybe understand a little bit more of how that changed and kind of the impact to the P&L? And then maybe there's an impact going forward? And then as a bigger picture question, you guys put out a $1 billion bogey by 2025.\n\nI guess in context of the current environment, how do you -- how do you feel about that target? Thank you.\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, in relation to the change in our accrual methodology, this is an update that we made to our methodology to be more consistent for charitable contributions over time. It's about 190 basis points of impact, and it's something that we don't expect to repeat in the future. And Trina will take your second question.\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nSo, as it relates to the $1 billion target, we're still incredibly focused working toward our goal of $1 billion but recognize that there is a lot of volatility in the macro. And therefore, the timing of this goal is a bit more uncertain. But we do see an incredible amount of opportunity in front of us, including product innovation, like what I just talked about; international, you saw the growth for the quarter; and developing our teams business. From a product innovation standpoint, we have a number of newer categories in outerwear, as it relates to FIGS PRO, our underscrubs category, we believe these can be incredibly large businesses in and of themselves.\n\nWe also are actually launching completely new categories that our customers or healthcare professionals are asking for, and we're incredibly excited about that. Separately, we talked about it on the call, but we're soft launching extended sizes, 3XL to 6XL. That's incredibly important as we're positioning ourselves to address an underserved segment of our community. Another area of growth, international.\n\nYou saw it in the third quarter. We're still in the very early innings of what this will become. We're serving healthcare professionals in 13 countries, and we're learning so much about their behavior and how they want to interact with FIGS. Our teams business.\n\nWe haven't really talked much about this. This is our B2B business. It's completely untapped at this stage as we've been very focused on our DTC business. But now with our extended sizes, we're really able to build out our platform around growth for our teams business.\n\nAnd lastly, we're continuing to evolve not only our launch strategy, as I discussed, but also our marketing strategy, as we're really looking to be more impactful, develop deeper connections, and really customize our messaging across channel. So, we're working toward the $1 billion. We're doing what's right for this brand over the long run, focusing on the development, the growth, and the health of the company. We're making moves to continue to create significant and sustainable competitive advantage and continue to deliver industry-leading value creation.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nThanks so much. \n\nOperator\n\nThank you for your question, sir. Our next line of questioning comes from the line of one Adrienne Yih with Barclays. Your line is now open.\n\nAdrienne Yih -- Barclays -- Analyst\n\nThank you very much. Good afternoon, everybody. Trina, I want to get back to the color. You've historically done very well with the color launches, and I'm sure that you'll continue to innovate with color being the primary driver.\n\nSo, I guess the question really is how do you use your data to do testing on what colors are going to uptrend and then to do more of a test and reorder, reading that demand such that in the future, you'll be creating the product that the demand warrants? So that's my first question. And then for Daniella, it's going to be on the inventory. Half the business is in that core styles. On the other half of it, what portion of that is to accommodate extended sizing? And how many weeks of supply -- I think you said that mid-next year, you think you'll have this inventory more in line with sales.\n\nAre you canceling orders? Are you reducing your open divide? What are the actions that are being taken to get that in line? Thank you very much.\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nThank you. So, in terms of color drops, we continue to see a lift in sales from our color drops. And to your point, the data tells us that our customers love our color launches. But as we look forward, it's really being more strategic and thoughtful about our drops.\n\nWe saw it with the cargo collection. The cargo collection came in new colors, right? But what we did there was we really leaned into innovation of the style, the innovation around the silhouette, the innovation around our functionality, and the utility that those products brought to bear. And so, as we look forward, we believe there's an opportunity to more effectively, in line with what I'm saying, more effectively merchandise the colors through taking a more holistic approach across style, color, and overall product innovation, creating more aspirational messaging around our launches to drive improved sell-through, and buy more shallow -- really buying more shallow in terms of our launches to drive that sell-through and drive that flywheel going forward.\n\nDaniella Turenshine -- Chief Financial Officer\n\nAnd Adrienne, as it relates to inventory, I think it's helpful to just remind everyone that as a uniform business, our product is largely replenishment driven. Additionally, 50% is in our core offering. So, it's seasonless, always in stock, and really limits our risk of obsolescence. As you can recall, we intentionally increased our weeks of supply on our core product.\n\nAnd we brought in color and product launches earlier due to lingering supply chain issues that we were experiencing. And additionally, a portion of our inventory did come in sooner than expected. We -- looking at kind of the noncore product, this is still a uniform. Historically, we have been able to move through this inventory without taking deep discounts, and we do expect our discount rate to remain roughly in line with 2019, 2020 levels.\n\nWe plan to move through some of this inventory during our Black Friday, Cyber Monday event, and we're expecting that event to look similar to 2020 in terms of discount rate. So overall, we expect to be in a better inventory position by mid-2023. Going forward, we plan to make more shallow buys for our product launches. We've reduced our POS for our core product to lower our weeks of supply in the future.\n\nAnd we're also making enhancements to our supply chain like diversification, which we believe will make us even more nimble and enable us to improve flow in the future. We have a strong balance sheet to support our business from a working capital perspective as we navigate these challenges in the near term, and we think we'll be able to move through this inventory balance.\n\nAdrienne Yih -- Barclays -- Analyst\n\nThank you. That's very helpful. Best of luck.\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nThanks, Adrienne.\n\nOperator\n\nThank you for your questions, ma'am. Our next line of questioning comes from the line of one Brooke Roach with Goldman Sachs. Your line is now open.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nGood afternoon and thank you so much for taking the question. Trina, Daniella, I wanted to talk about your holistic thoughts around the cost structure of the business today versus where it was a few years ago and some of the investments that you're looking to make over the course of the next year. Specifically in corporate G&A and maybe excluding stock-based compensation expense, you talked a little bit about investments for product innovation and international expansion. We also have an inflationary cost environment, and many companies are taking a tighter look at corporate costs.\n\nThere's been a lot of noise here, but can you talk to us about how you're thinking about the run rate G&A level of the business as you emerge from some of this near-term noise, maybe second half of '23 or into 2024, what that might run rate look like?\n\nDaniella Turenshine -- Chief Financial Officer\n\nThanks, Brooke. So, we've always been focused on balancing growth and profitability. So, this is a mindset that will continue for us. I think in a more uncertain macro environment, we will likely look to prioritize investments where we feel more certain about the return, where we can maximize ROI, and really incorporate impacts from the macro into our near-term assessments.\n\nSpecifically, on the G&A side, we are investing in product innovation, in technology, and automation. But looking over the long term, we do believe this is a line item where we can drive efficiencies. But making these investments at an earlier stage will set us up for more profitable growth in the future, and that's how we're really thinking about it.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nThat's really helpful. And maybe just as a follow-up for Trina. Can you provide a little bit more information on the growth opportunity that you see in your teams business? How important is that to near-term growth as you enter 2023? And how should we be thinking about that as a contributor as you seek to get back to your long-term algorithm of 30% growth?\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nYeah. I mean I think our teams business is something that is incredibly exciting. We build a first-of-its-kind platform so that administrators could order for their entire department, their entire clinics, their entire office. And we make it really seamless to do that, to order hundreds, thousands of sets of scrubs for your entire team.\n\nAnd so that experience has become more and more seamless. With extended sizes, it makes it even a bigger opportunity because I don't know another business out there where if one or two or 10 people can't fit into your -- their uniform, the entire team won't be part of the brand. And so, we're really excited about the future of teams. To -- in the shorter term, we're still building out.\n\nWe're really encouraged over the long run. This is going to be big.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you for your questions, ma'am. Our next line of questioning comes from the line of one Michael Binetti with Credit Suisse. Your line is now open.\n\nMichael Binetti -- Credit Suisse -- Analyst\n\nHey, guys, Thanks for taking our question here. So, I don't think I heard you speak about this earlier, but -- so you mentioned that the consumer survey showed the healthcare professionals pulling back a little bit on discretionary. Within your consumer insights, have you witnessed any changes in conversion or shifting between price points on the site and can help you inform you as to how you approach planning the assortment and how to be agile with what the consumer is asking for with forward inventory buys for next spring? And then I guess as a follow-up, I understand the demand line change in fourth quarter to date, but can you help us think a little bit more about the EBITDA margin guide? I think it's implied a little bit below 10. I understand a lot of the deleverage is tied to a lower sales expectation.\n\nWhat are some of the building blocks that are less tied to sales that you have line of sight to today that you can recapture for next year, be it freight or temporary warehousing costs?\n\nDaniella Turenshine -- Chief Financial Officer\n\nMichael, so looking at our consumer surveys, we mentioned that they are potentially stretching their purchases a little bit longer, but they're still really loyal to the brand. They're still really excited about FIGS. What we're seeing on the site is, as we've discussed, AOV is higher. And so, we are driving that through both higher UPT and higher AUR.\n\nThat's really driven by our lifestyle. And so, we are seeing customers that when they come, they're really excited to build out their car and spend even more with us in a transaction. Looking at adjusted EBITDA and the fourth quarter and kind of what we're expecting to continue into 2023, I think that was your second question, right? \n\nMichael Binetti -- Credit Suisse -- Analyst\n\nYeah. Yeah. \n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, looking at the fourth quarter, what we're seeing with gross margin is that our outlook is unchanged. We're seeing better-than-expected ocean and air freight rates, and that's being offset by higher promotions. Turning to selling expense. We are expecting to see higher fulfillment expense than in the third quarter because we're going to be having an entire quarter of these additional storage costs for inventory.\n\nThe fact that inventory was shipped earlier than we expected and also that storage vacancy rates were at 1%, this wasn't a cost that we had fully anticipated. Looking at marketing. We're expecting that to be just modestly above the 15%. And G&A, we are expecting to see an increase as a percent of sales due to an increase for our accrual for inventory donations and for some SOX implementation costs.\n\nWhat that looks like in 2023, on gross margin, we do expect the first half to be impacted by higher promotions year over year. We're seeing some additional margin pressure also from the product that we sell that was air freighted in 2022. And this should be partially offset by easing freight rates, and we are expecting gross margin to normalize more as we get into the back half of the year and see better promotions year over year and also an easing of freight rates. With selling, we are expecting to see higher costs related to additional storage in the first half and a continuation of the higher shipping rates.\n\nWe also expect to see some increase in our ongoing fulfillment expenses throughout the year related to initiatives that we discussed to improve flexibility and scale. We plan to maintain marketing at approximately 15% of net revenue as we really continue to focus on being first-order profitable. G&A. We will see some modest deleverage related to investments in product innovation, particularly as it relates to new categories, as well as costs related to tech enhancements and automation.\n\nSo, while we're increasing investments in our business, we're also looking to continue to find ways to drive efficiency, and we do expect there to be some offsets as well. So, like always, really continued on focusing on both growth and profitability as we continue to scale.\n\nMichael Binetti -- Credit Suisse -- Analyst\n\nThanks a lot, guys.\n\nOperator\n\nThank you for your questions, Michael. Our next line of questions comes from the line of one Rick Patel with Raymond James. Your line is now open.\n\nRick Patel -- Raymond James -- Analyst\n\nThank you. Good afternoon, everyone. I was hoping you could talk about lifestyle products. Maybe dig deeper there on what's working, what's not, and where you have the most conviction to drive scale.\n\nAnd just given the slowdown in replenishment of scrubs, what do you see is the right penetration for that segment of the business going forward?\n\nDaniella Turenshine -- Chief Financial Officer\n\nThanks, Rick. So, approximately 35% of our active customers have purchased our lifestyle products. We're incredibly pleased with the growth of 65% year over year. It's almost 17%.\n\nIt was about 17% of our sales. So, we're really excited about how we're going to continue to build this out. The three categories that are really driving that is our outerwear business. Our Packable Puffer is pretty amazing.\n\nSo, I would check that out, if I were you. Our footwear with New Balance, our New Balance collaboration continues to be an incredible growth driver as it relates to lifestyle. And finally, our underscrub. And underscrubs isn't just the long sleeve, underscrub, underneath your scrub top and pant.\n\nIt's kind of everything that you're wearing underneath your scrubs from our sports bras, our leggings. And so, really looking to build that out over time. So, those are kind of the areas of focus. There's a lot of other categories that we haven't even launched that will become part of our layering system.\n\nAnd so, we're incredibly excited about the future of not only our scrubs business but also our lifestyle offering.\n\nRick Patel -- Raymond James -- Analyst\n\nAnd can you also tell us what the mix of ocean freight versus airfreight will be in the fourth quarter and how that compares to the year-to-date trend? I'm just curious also when you can get back to a more normalized cadence of leaning into ocean freight as we think about 2023.\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, as we have seen an easing in the supply chain, we are forecasting that we will see some benefit in gross margin in the fourth quarter as it relates to better-than-forecasted ocean and air freight rates. We also expect to see a year-over-year benefit in air freight from lower utilization and a decrease in rates year over year. So, we're forecasting air freight expense for the fourth quarter to be around $2 million. So, we are seeing some benefits there.\n\nSo, yeah, I think looking now, we are getting into a more normalized place, and we expect that normalization to continue into next year. As a reminder, we will be incurring some air freight as we sell through the products that we brought in, in 2022 into 2023. But we are really minimizing the amount of air freight that we're using for receipts going forward. \n\nRick Patel -- Raymond James -- Analyst\n\nThank you. All the best this holiday.\n\nDaniella Turenshine -- Chief Financial Officer\n\nThank you.\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you for your question, sir. Our next line of questioning comes from the line of one Lorraine Hutchinson with Bank of America. Your line is now open.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good afternoon. You spoke a lot about rightsizing the inventory by the middle of 2023. As part of that forecasting process, can you shed some light on how you're planning first half sales? Will they -- would you expect it to be in line with current trends? Or are there levers you can pull to reaccelerate that growth a little bit earlier?\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, in light of the current macro environment, it's a little too soon for us to be providing 2023 guidance, but we will talk a little about what we're seeing and what we're thinking about for next year. We do expect trends to improve from the fourth quarter. But as you might assume, we are expecting a challenging first half, particularly in the first quarter due to macro, as well as efforts to move through our inventory. Going into the back of the year, we would expect to see more strength in the fourth quarter of next year as we're lapping easier comps.\n\nI would say while the macro is more of a headwind, we're continuing to drive our business forward. We're executing on building out our nonscrubwear, continuing to dive deeper international, and also continuing to build just really deep connections with our communities. So, we'll provide more detailed information on 2023 on our next call, but that's what we're seeing today.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you for your question. Our next line of questioning comes from the line of one Lauren Schenk with Morgan Stanley. Your line is now open.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Maybe a few quick modeling ones, if I can. Are you seeing any increased churn of existing customers? Or is it really just the frequency in AOV? Second, is there any way that you could help parse out sort of the freight versus promotional and product mix shifts in the 210 basis points in the third quarter? And then I just want to clarify that October is similar to the second half of October and then October has not gotten worse.\n\nThank you.\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, looking at your first question, which I think was about churn and what we're seeing in our cohorts, we have seen a modest increase in churn among newer cohorts, while our older cohorts have remained stable. Some of that is customers are showing up in reactivation. We saw a record number of reactivations in the third quarter. So, a portion of that churn is healthcare professionals buying less frequency, but not leaving the brand.\n\nThey're coming back in month 13, 14, 15, and continuing also to spend more with us as we deliver newness in our layering system. So, as we look at these numbers, we're really focused on driving engagement with our customers through the expansion of our lifestyle offering, improved sizing and fit, through increased personalization. And so there's a lot that we're doing as we look at churn for the future. For your second question, I think it was around -- can you actually just repeat it really quickly?\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nYeah. Just on the third quarter, the 210 basis points of gross margin, just how much is freight versus promotional versus product mix?\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, year over year, freight rate had a negative 220 basis points impact on gross margin. The other components of the deleverage was unfavorable sales mix shift to promotions and product mix. And we saw a little bit of an offset there from better returns, driving gross margin up. And then looking at October, we're not really speaking to quarter-to-date trends, but given the supply chain environment overall, we are seeing customers waiting to purchase as opposed to last year.\n\nAnd so, our forecast does reflect the trends that we saw in October kind of continuing through the balance of the year, but we're not speaking specifically to what we're seeing month over month.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThank you for your questions, ma'am. Our next line of questioning comes from the line of one Bob Drbul with Guggenheim. Your line is now open.\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nHi. Good evening. Can you talk a little bit about the competitive landscape, if you're seeing consumers really on the market or the healthcare apparel segment, like what you're seeing competitively? And then can you expand a little bit more on -- I know it's early on the international, but any color on which markets have performed better for you or worse than expected? Thanks.\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nSure. So, from the competitive standpoint, we're not really seeing much from a change perspective. We continue to -- we're continuing to gain market share. And our next closest competitor from a DTC perspective is still about one-tenth our size.\n\nMost try to compete on lower price, but the quality of their product is just not the same, right? And so, customers remember quality. They don't remember the price. And I think we've set ourselves apart, and we're continuing to set ourselves apart from everyone else as it relates to every single thing we bring to deliver and serve this community. As it relates to international, we've really just been super encouraged by the growth, 49% year over year.\n\nAnd we've seen a lot of healthcare professionals really coming to the brand. Canada and U.K. are a huge focus of ours. We've seen that those two countries really drive that growth in a bigger way as we were building up the other newer countries we've entered.\n\nAnd so, I couldn't be more excited about international and what we'll continue to do there. We're localizing the experience. We're bringing translations. We're really targeting each country with localized marketing efforts.\n\nAnd so, as we become a truly global brand, we're excited to serve the entire global healthcare community.\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you for your question, sir. Our next line of questioning comes from the line of one Dana Telsey with Telsey Advisory Group. Your line is now open. \n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Good afternoon, everyone. As you seek to adjust the inventory levels, what channels are you going to reduce inventory through? I know you've done some things like in L.A. sometimes and you have an event to get rid of the inventory.\n\nHow do you see that? How do you see -- how you see disposing of the inventory? And second, on the fulfillment enhancements that you're making, what should we see on over what time period? And is there a specific cost allocated to that? And then I just have a follow-up. Thank you.\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo looking at our inventory, we really don't expect discount rate to be meaningfully different than 2019, 2020 levels. We do think we can move through this inventory at a discount rate that looks like our historical levels. We have multiple channels and events through which to move inventory. So, we have our Black Friday, Cyber Monday event that's coming up.\n\nWe also are planning to launch an evergreen sales section to our website to drive just more consistent performance between launch and nonlaunch days. And this feature will also enable customers to come back and purchase their favorite prior colors on our sales tab at any time. We can move through inventory similarly through Amazon or our B2B business. So, we're evaluating all of our channels and determining the best way to approach it and meet the customer where they are with the colors that they're really excited to see.\n\nCan you -- I'm sorry, can you repeat your second question? \n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nFulfillment. You talked about making enhancements to fulfillment. What are you doing? And what's the time frame to complete what you want? And is there a cost to that, that's either permanent that's part of your margin -- as part of the margin structure or some transitory that goes away after you implement it?\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, on fulfillment, we're really kind of in the process of evaluating this right now. So, we will be giving a more fulsome update on our next call. But we're looking to continue to build to drive more flexibility, to improve efficiency, and to ensure that we can really provide the best experience to our customers. We are expecting this to come at a higher rate, but we do think that it's the best thing for the business over time.\n\nWe don't have the specifics today, but we are planning to do an update on our next call.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nOK. And then just lastly, you've added some new talent, whether it's in merchandising or in marketing. Any updates to the processes that they are bringing or that the opportunity that they foresee, and Trina, how you look at working with them in order to move the ball forward?\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nYeah. I mean, this is really exciting. We recently brought on Sunil Kaki as our chief marketing officer. He comes from an extensive background from Amazon, Intuit, Beachbody and really brings, not only digital knowledge and know-how, but also really has a lot of deep background in brand building and community engagement.\n\nAnd so, we couldn't be more excited about him joining us. And I think what you're going to see over time is really us capitalize on a larger opportunity to align our creative, align our messaging with the appropriate channel and the appropriate audience. And this is something that we are actively implementing today, and we couldn't be more excited about in the future.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThank you for your questions, ma'am. Our last question comes from the line of one John Kernan with Cowen. Your line is now open. \n\nJohn Kernan -- Cowen and Company -- Analyst\n\nGreat. Thanks. Just wanted to go back to some of the points on fulfillment and distribution. It looked like selling expenses per order were -- was up pretty significantly in the third quarter.\n\nAny specific dynamics related to that? And how should we think about selling expense as we get through into Q4 and next year?\n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, fulfillment expense was higher in the third quarter because of these additional storage costs for our inventory. As we said, inventory shift earlier than planned, and storage vacancy rates were at less than 1%. So, it was more costly than anticipated to store this inventory. Looking into the fourth quarter, we're expecting to have a full quarter of these additional costs.\n\nAnd so, we would expect that to continue to remain pressured. And probably looking into the first half of 2023, we'll see some pressure from this additional storage line item.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nUnderstood. Thanks. Just one more question. On the inventory, it's up about $100 million on a cost basis on the balance sheet, about 142% year over year.\n\nIf we back into the inventory turn, it's a little over one times. How do we think about DSOs and inventory turn as we get into next year? \n\nDaniella Turenshine -- Chief Financial Officer\n\nSo, we are expecting to be in a better inventory position by mid-2023 on a turn and a day's perspective. As a reminder, our product is largely replenishment-driven. It's a uniform. So, we would expect to have higher inventory days than a traditional apparel company.\n\nWe want to make sure that we have this product. It's always in stock, always in style, and we can serve our healthcare community. So, we're looking -- we're actively making updates to bring that down, and we are expecting it to be in a better position by mid-2023, but we would expect to be higher than a traditional apparel company.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nUnderstood. Thank you. Best of luck.\n\nDaniella Turenshine -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you for your questions, sir.\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nOK. So, I think we got -- OK. So, I think we got a few questions from our shareholder community through the Say platform. I really just wanted to address a key topic that came up through the platform around the integrity of FIGS and how we are addressing that.\n\nAnd I think a lot of the noise around this really stems from a recent litigation with a company called SPI. SPI has spent the last four years spreading lies and falses about our company and myself personally, my co-founder, Heather Hasson, personally. And I think over the last -- over the last few years, four years, we've really done a good job about putting blinders on and just focusing on growing our business, focusing on serving our community. But I'm really proud to say that after four years, it's been -- it's a profound feeling to finally have our day in court.\n\nAnd we were in federal court over the last three weeks, where finally the truth came out. After three weeks of trial, the jury unanimously found in our favor on every single issue. They found that we did nothing wrong. And as painful as this experience was, I'm glad that justice was served, but I'm also -- what it showed us is that it's just -- it showed us how much FIGS has revolutionized this industry.\n\nAnd we're not stopping here. We are going to continue to revolutionize the industry and change the game for healthcare professionals. That is why we wake up every single day: to show up and serve. And so that's what we're going to continue to do.\n\nThank you all for joining us. Thank you all for joining our third quarter call, and we look forward to speaking with you again soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJean Fontana -- Head of Investor Relations\n\nTrina Spear -- Co-Founder and Chief Executive Officer\n\nDaniella Turenshine -- Chief Financial Officer\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nEd Yruma -- Piper Sandler -- Analyst\n\nAdrienne Yih -- Barclays -- Analyst\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nMichael Binetti -- Credit Suisse -- Analyst\n\nRick Patel -- Raymond James -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nBob Drbul -- Guggenheim Securities -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nMore FIGS analysis\n\nAll earnings call transcripts"
}