{
  "companyName": "ONEOK",
  "companyTicker": "OKE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/oneok-oke-q2-2022-earnings-call-transcript/",
  "content": "ONEOK (OKE -0.38%)\nQ2 2022 Earnings Call\nAug 09, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the second quarter 2022 ONEOK Earnings Call. Today's conference is being recorded. At this time, I would like to turn the conference over to Mr. Andrew Ziola, vice president, investor relations.\n\nPlease go ahead, sir.\n\nAndrew Ziola -- Vice President, Investor Relations and Corporate Affairs\n\nThank you, Nash, and welcome to ONEOK's second quarter 2022 earnings call. We issued our earnings release and presentation after the markets closed yesterday, and those materials are on our website. After our prepared remarks, management will be available to take your questions. Statements made during this call that might include ONEOK's expectations or predictions should be considered forward-looking statements and are covered by the safe harbor provision of the Securities Acts of 1933 and 1934.\n\nActual results could differ materially from those projected in forward-looking statements. For a discussion of factors that could cause actual results to differ, please refer to our SEC filings. [Operator instructions] With that, I'll turn the call over to Pierce Norton, president and chief executive officer. Pierce?\n\nPierce Norton -- President and Chief Executive Officer\n\nThanks, Andrew. Good morning, everyone, and thank you for joining us today. We appreciate your interest and investment in our company. On today's call is Walt Hulse, chief financial officer and executive vice president, investor relations and corporate development; and Kevin Burdick, executive vice president and chief commercial officer.\n\nAlso available to answer your questions are Sheridan Swords, our senior vice president of Natural Gas Liquids and Natural Gas Gathering and Processing; and Chuck Kelley, our senior vice president of Natural Gas Pipelines. Yesterday, we announced strong second quarter 2022 earnings, provided an update on the Medford incident and affirmed our 2022 financial guidance expectations. As we sit today, we still expect to achieve the midpoints of our 2022 net income and adjusted EBITDA guidance, which Walt will provide additional details shortly. Our second quarter financials were achieved despite unseasonable weather in the Rocky Mountain region during the quarter.\n\nTwo separate April weather events caused widespread outages and power, disrupting midstream and producer operations across the region. Our employees were well-prepared and quickly responded to the challenge. They remain focused on the safe operation of our assets and the safety of the communities where we operate. And they work with local agencies, customers, utility providers to resume normal operations as quickly as possible.\n\nAcross our operations, we continue to see strength in producer activity, with commodity prices and demand supporting a strong second half of the year. While it is still too early to provide our outlook for 2023, we are well-positioned across our integrated footprint to help transport and process central natural gas and natural gas liquids. Before I turn the call over, I'd like to make and provide an update on the Medford, Oklahoma fractionation facility. On Saturday, July 9, mid-afternoon, there was a fire at the facility.\n\nFirst and foremost, all of our personnel were safe and accounted for. The safety of our employees and communities is always the main concern and initial focus during a situation like this. I would like to thank the many employees, first responders and local agencies who worked together to quickly respond to the incident. We cannot say enough about the corporation and the coordination efforts of those teams who work to put a safety of our personnel and the surrounding community first.\n\nWe are cooperating with government agencies as we work to determine the cause of the incident, but expect the facility to remain out of service for an extended period of time. In yesterday's earnings release, we provided details of our property and business interruption insurance coverage. Because of this coverage, we do not currently anticipate that the incident will have a material effect on our financial condition, results of operations or cash flows. However, the timing of insurance proceeds may impact financial results in a given quarter or year.\n\nFrom an operational perspective, we continue utilizing our system of integrated NGL pipeline, fractionation and storage assets. We're also working with industry peers on additional fractionation and storage arrangements. I want to thank those companies for working with us to keep these essential products flowing since the incident. Our industry has a long history of stepping up to help each other when disruptions happen, and this incident has once again proven that relationships and corporation are critical to this industry's long-term success, and we want to thank them once again.\n\nWith that, I will turn over the call to Walt for discussion on our second quarter financial performance.\n\nWalter Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nThank you, Pierce.ONEOK's second quarter 2022 net income totaled $414 million or $0.92 per share, a 21% increase compared with the second quarter of 2021 and a 6% increase compared with the prior quarter. Second quarter adjusted EBITDA was $886 million, an 11% increase year over year. Compared with the first quarter of 2022, higher second quarter results were driven by increased NGL volumes across our operations and higher realized commodity prices primarily benefiting our natural gas gathering and processing segment. Operating costs increased in each of our business segments, which is typical for the second quarter, as improved weather allows for more routine maintenance projects to take place.\n\nAs of June 30, our net debt-to-EBITDA on an annualized run rate basis was 3.8 times, and we continue to view 3.5 times or lower as our long-term aspirational leverage goal. In June, we redeemed nearly $900 million of senior notes due in October 22, with cash and short-term borrowings. We currently have no long-term debt maturities due until September of 2023. Yesterday, we reaffirmed our 2022 financial guidance expectations.\n\nAnd to expand on Pierce's comments earlier, as we sit today, we still expect to achieve the midpoint of our guidance ranges, which remain at $1.69 billion for net income and $3.62 billion for adjusted EBITDA. We expect total 2022 capital expenditures to trend toward the upper end of the range of our guidance range of $900 million to $1.05 billion driven by higher producer activity levels and expansion opportunities in our natural gas pipeline business. Positive drilling activity across our operations and expectations for higher natural gas and NGL volumes in the second half of 2022 support our financial guidance and continue to point to a strong volume exit rate this year. I'll now turn the call over to Kevin for a commercial update.\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nThank you, Walt.During the second quarter, we saw NGL volume growth across all our operating regions compared with the first quarter 2022. NGL volume expectations remain strong through the remainder of the year, providing confidence in achieving the midpoint of our raw feed throughput guidance for 2022. Natural gas processed volumes and well completions during the quarter were significantly impacted by the April weather events and we now expect process volumes to be toward the lower end of our 2022 volume guidance range. Let's take a closer look at our natural gas liquids segment.\n\nTotal NGL raw feed throughput volumes increased 5% year over year and 4% compared with the first quarter 2022. Rocky Mountain region NGL volumes increased 10% year over year and 5% compared with the first quarter 2022. Activity in the region has rebounded following the April storms as July volumes averaged more than 360,000 barrels per day, 9% higher than the second quarter average. Mid-Continent NGL volumes increased 4% compared with the first quarter 2022 driven by increased C3+ volumes as producers continued to add rigs in the basin with a large majority of the region's NGLs dedicated to ONEOK system.\n\nIn the Permian Basin, NGL volumes increased 10% year over year and 4% compared with the first quarter of 2022. We recently completed a 25,000 barrel per day expansion on a portion of our West Texas NGL pipeline in the basin to support continued expected volume growth. We saw increased ethane volumes on our system in the second quarter of 2022 and expect continued opportunities for ethane to be recovered through the remainder of the year. We anticipate high levels of recovery in the Permian Basin, periodic recovery in the Mid-Continent and continued opportunities to incentivize ethane recovery in the Rocky Mountain region as in-basin natural gas prices fluctuate.\n\nOur fractionation capacity is fully utilized following the incident at our Medford facility. And as Pierce mentioned earlier, we have worked with industry peers to secure additional fractionation and storage capacity. Medford's capacity was approximately 210,000 barrels per day of our total systemwide nameplate capacity of more than 980,000 barrels per day. Construction continues on our 125,000 barrel per day MB-5 fractionator in Mont Belvieu, which we now expect to be complete early in the second quarter of 2023.\n\nMoving on to the natural gas gathering and processing segment. In the Rocky Mountain region, second quarter processed volumes averaged more than 1.2 billion cubic feet per day, a slight decrease compared with the first quarter 2022 due to the April weather. We've seen recent volumes return to pre-storm levels, and in July, volumes reached approximately 1.4 billion cubic feet per day. Through the first 6 months of the year, we've connected 157 wells in the region and we continue to expect approximately 375 to 425 well connections in the region this year.\n\nThere are currently approximately 45 rigs and 18 completion crews operating in the basin, with 21 rigs and approximately half the completion crews on our dedicated acreage. Basinwide, rigs have more than doubled in the last 12 months from only 20 rigs total in July 2021. As we've said before, approximately 15 rigs on our acreage can maintain natural gas production at current levels. But with more than 20 currently on our acreage, we expect to see higher well connections in 2023 compared with 2022 if these activity levels remain.\n\nThe basinwide DUC inventory remains at approximately 500, with half of those on our dedicated acreage. This compares with approximately 650 DUCs in a basin a year ago. Recent producer M&A in the Williston Basin continues to show the value and long-term viability of the play. We see these recent announcements as positive for ONEOK as we expect increased activity from the acquirers to drive NGL and natural gas volumes to our system.\n\nIn the mid-continent region, we continue to see increased activity with four rigs now operating on our acreage and 46 rigs basinwide. We expect steady to increasing activity through the remainder of the year with the majority of rigs basinwide driving additional NGLs to our system. In the Natural Gas Pipelines segment, strong second quarter results benefited from the continued increasing demand for natural gas storage and transportation services. Last quarter, we discussed a recently completed 1.1 billion cubic feet expansion of our Texas storage facility, which is now fully subscribed through 2032.\n\nAdditionally, we are expanding our storage capabilities in Oklahoma, enabling an additional four billion cubic feet of storage capacity to be contracted. This project is expected to be complete in early 2023, and is nearly 90% subscribed through 2029. We also recently completed two open seasons for additional pipeline capacity to address increased demand: one on our West Texas pipeline system in the Permian Basin and one on our Viking pipeline in the upper Midwest. Both open seasons were successful, and we plan to move forward with low capital expansions on both systems.\n\nThe value of our natural gas pipelines and storage assets continue to be highlighted in the outperformance we've seen from this segment so far this year. Pierce, that concludes my remarks.\n\nPierce Norton -- President and Chief Executive Officer\n\nThank you, Walt and Kevin. As we enter the second half of 2022, we see producer activity and attractive commodity prices providing tailwinds to our business. We've affirmed our financial guidance for the year underscoring the resiliency of our operations, earnings and employees who are always ready and willing to respond to changing market and operational dynamics. Challenges happen in our business and weather is unpredictable.\n\nBut how we respond to the -- is the real difference maker. Operating safely, sustainably and environmentally responsibly remains an important focus and is key to our success as a midstream operator. How we operate is important, but also how we engage with our employees, communities and other stakeholders is also important. To learn more about our commitments in these areas, I encourage you to review our most recent corporate sustainability report, which was just published to our website last week.\n\nThe report details our most recent environmental, social and governance-related performance and programs and highlights key initiatives underway across the company. Our ESG efforts are a source of pride for ONEOK, and we are committed to continuing to make progress in these important areas. With that, operator, we're now ready for questions.\n\nOperator\n\n[Operator instructions] We will take the first question from Jeremy Tonet from JPMorgan. Your line is open. Please go ahead.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning. Just want to dig into Medford a little bit more, if possible. And as we think about everything there, you talked about not being material, but maybe you could help us to understand better what the threshold is for financial materiality there.\n\nAnd then just as far as kind of the parameters of what's happened with regards to volume uploads, where are those volumes going now? Can you tell us? And you said about the time line being extended, if this slips deeper into '23, would this impact -- might it impact your ability to offload volumes if volumes continue to grow?\n\nPierce Norton -- President and Chief Executive Officer\n\nSo Jeremy, I think I'll let Walt take the materiality question for us, and then we'll flip it over to Kevin and Sheridan on the offloads.\n\nWalter Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nWell, Jeremy, I think that we're very comfortable with that comment, I'm not going to give you our level of materiality. But I will say that -- remember that our insurance coverage provides for a 45-day period, which we have as a stand-alone and then we have business interruption insurance from that point forward. So we're very, very comfortable with the view of where we've come out from a materiality standpoint.\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nYes, Jeremy, it's Kevin. On the volumes and where they're going right now, I mean, clearly, a lot of them are going down to Belvieu. We talked in our remarks about our industry peers that have been very helpful in securing spots for those barrels. We feel good about being able to move the volume, especially as we get to MB-5, and keep in mind, that's going to be another 125,000 barrels a day of new capacity that will come online early in the second quarter.\n\nSo that's the things we've got lined up there. And again, we feel good about being able to move the volumes.\n\nSheridan Swords -- President, Gathering and Fractionation\n\nOne thing I would add is we've been able -- talking with our peers, we have -- very much comfortable with our growth plans through '23, depending on how long this lasts and we'll be able to handle all of the volume coming on our system.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful. And just want to pivot over toward IROs, if you could, and realize it's hot off the press, and it seems like the shape keeps changing a bit here and what the bill looks like. But just wondering thoughts you can provide as far as how as it currently stands, this might impact your tax profile in 2023 or going forward? And as the bill is written right now separately, would this increase or change your appetite to pursue CCS, renewables or other items like that?\n\nWalter Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nWell, I'll handle the tax portion of that. Jeremy, you're right, it's still off the presses and we're getting a lot of the details. But I do think the late in the game addition of using tax depreciation versus book depreciation was a positive development for us. And we don't see a real meaningful increase in our tax over the long-term.\n\nWe may have a little bit higher tax in the earlier years. But if we get into that alternative minimum tax of that 15%, that would be for an extended period of time where we would have otherwise gone to a statutory rate. So while we expect some higher level of taxes, that addition to the tax depreciation was a big positive.\n\nPierce Norton -- President and Chief Executive Officer\n\nAnd so I'll take the question about CCUS. I'd like to remind everybody on the call that 36% of the natural gas demand in this country is devoted to electricity. You add to that 33% in the industrial sector. So that's a total of almost 70% of the natural gas demand goes to those two forms of consumption.\n\nAnything that is done that would enhance the ability to capture carbon from natural gas being consumed is a good thing for our industry. And so these incentives, it's left to be seen exactly how effective they're going to be because we need to know the details, but it does encourage us as an industry and as a producer of natural gas and actually the liquids that are coming off the oil production in the natural gas production in these rich basins that this will help to curb the CO2 emissions in the future. And we do think that will open up some opportunities that we will look both at CCUS and hydrogen. So I think it's a positive for the industry, what's happening.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful over there. Thanks.\n\nOperator\n\nWe will take the next question from Brian Reynolds from UBS. Your line is open. Please go ahead.\n\nBrian Reynolds -- UBS -- Analyst\n\nHi. Good morning. Maybe touch a little bit on the '22 reaffirmed guide. As it relates to the base business, ONEOK appears to expect to complete roughly 60% of its wells for the year-end in the back half of '22 and Mid-Con volumes look to be on track to surpass 4Q '19 levels by year-end.\n\nSo I was just kind of curious if you could just talk about, given the year-to-date impact from weather in the Medford frac fire, I was curious if you could talk about how the base business is performing relative to initial year expectations in terms of activity.\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nThanks. I mean I'll start, Brian, it's Kevin. I think the base business is performing very well. If you think about where we were going into the storms, we were right on track with everything that we had kind of outlined and laid out.\n\nThe storms up in the Bakken did kind of set the basin back a couple of months, not just with the volumes flowing, but also -- it was kind of a couple of months pause on -- or lower completions that we saw. So it kind of delayed things and that's the reason that we're going to be at the lower end of the guidance from a volumetric perspective there. But on the flip side, when you look at the NGL business and what they've done both from an earnings perspective as well as a volumes perspective and then the outperformance of the gas pipeline business, I think those two segments are performing at or better than we anticipated coming into the year. So I think it sets us up nice going into '23.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. I appreciate that color. And follow-up on the Medford frac. I know while it's probably a little bit too early, has there been any initial thoughts on potential replacement of the Medford frac and whether we could see it be built in Mont Belvieu or Conway at this time?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nBrian, you hit it on the head. We're still really early in that process. And again, not ready to talk about timing or anything like that. We've got capacity secured, we believe, to move our volumes, and we'll keep working that until we get more information.\n\nBrian Reynolds -- UBS -- Analyst\n\nFair enough. Enjoy the rest of your day, everyone. Thank you.\n\nOperator\n\nNext question from Michael Blum, Wells Fargo. Your line is open. Please go ahead.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nThanks. Good morning, everyone. So apologies for maybe a technical question, but just so I understand it, are you going to be accruing insurance proceeds in your EBITDA results in Q3 and Q4? So that's how guidance is basically unchanged? Or is that not the case and you're just able to make it up in other areas?\n\nWalter Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nMichael, we expect to get timely recovery of our business interruption in insurance. We will actually book that as we receive those proceeds. But that's why we said that we may have, from time to time, a little bit of a timing difference if we get right at quarter end. But we expect timely ongoing payments that would flow through our income statement in a normal way.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nOK. Great. I also just wanted to ask about AECO gas prices, which are trading at a pretty big discount to Henry Hub. Can you just remind us how your ethane recovery economics in the Bakken work? Will you benefit in any way from the decline in AECO gas prices?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nMichael, this is Sheridan. The way we buy gas at the alternative at the gas plant. So we go and look at what we could sell gas at the gas plant versus what we could sell ethane in Mont Belvieu. And so whatever the gas plant is receiving, that's what we can get.\n\nSo an AECO price is a factor in what the gas price we're receiving at the gas plant.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nNext question from Colton Bean, Tudor, Pickering, Holt & Co. Your line is open. Please go ahead.\n\nColton Bean -- Tudor, Pickering, Holt and Company -- Analyst\n\nGood morning. So the NGL segment had a fairly significant step-up in costs. Of the three drivers you mentioned, I think fuel, power and then third-party services, do you expect an improvement in the back half of the year for any of those? Or is Q2 level a pretty good run rate moving forward?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nWell, I think there are a couple of dynamics going on, Colton. The $30 million you referenced, really you got power costs were just higher, but we also had more volume, so you had more power just moving it there. And then we also had a turnaround in the second quarter, which caused us to go get some outside frac capacity during the quarter, and that's in there as well. So some of those costs will just be -- will float as power cost moves around, but some of the other costs were more onetime.\n\nSo that's as we think going forward, we typically do more work like turnarounds and integrity work and other expense project type work. We'll do more of that in the summer when the weather is better. So historically, you might see a little stronger in the summer from a cost perspective on those types of activities.\n\nColton Bean -- Tudor, Pickering, Holt and Company -- Analyst\n\nUnderstood. And then just following up on the Bakken ethane discussion. I mean it sounds like with the wider gap between AECO and Mont Belvieu pricing this quarter, would you expect any upside to that bundled rate, just if you -- if the incentive rate that you have to offer is now less of a discount than it would have been previously?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nColton, there's a lot of factors that go into that. Sometimes it impact it, sometimes it doesn't. And I think we are -- we think we have a good opportunity to incentivize more ethane in the second half of the year. So we're very bullish on that, but -- due to the regional gas prices.\n\nBut how it affects the overall average rate kind of depends on where it's come in volume and the escalators that we have on our base business.\n\nColton Bean -- Tudor, Pickering, Holt and Company -- Analyst\n\nGot it. Appreciate that.\n\nOperator\n\nNext question from Theresa Chen from Barclays. Your line is open. Please go ahead.\n\nTheresa Chen -- Barclays -- Analyst\n\nHi. I just wanted to ask first on the $16.4 million increase in the NGL segment related to higher average fee rates. Can you tell us what that was related to precisely? And is that expected to carry forward?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nYes, that was mainly related to inflationary escalators for both fuel and power and inflation, and we do have those inflationary escalators coming on throughout the year. So we do anticipate it will increase.\n\nTheresa Chen -- Barclays -- Analyst\n\nOK. And in your G&P segment, the $5.3 million increase due to the contract settlement during the quarter, should we expect some sort of offset in base earnings going forward as a result?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nNo, I don't believe you'll see any offset. It's just normal course of business on our large portfolio mix. So you won't see any offset.\n\nTheresa Chen -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nNext question from Michael Lapides, Your line is open. Just go ahead, from Goldman Sachs.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nHey, guys. Thank you for taking my question and congrats on a really good quarter. Just curious, as you think about infrastructure needs going forward, given kind of some of the volume commentary about July volumes. How are you thinking over the next year or so about the need for either new processing or even a sixth frac at Belvieu?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nMichael, this is Kevin. I mean I think we're in really good shape as we've talked for the last several months. And when you think about with Demicks Lake III coming up, that gets us a nice headroom of capacity in the Bakken. We've talked about the available capacity that currently exists on Elk Creek, and then we've got low-cost expansion opportunities if we need to expand that pipe.\n\nWe just demonstrated we've got some expansion opportunities on West Texas as our volumes continue to grow out there that we can expand that pipe in tranches. Plenty of capacity in the mid-continent Obviously, with what's going on at Medford, frac capacity is tight and it's going to remain that way until we get clarity on what's going on with Medford. But other than that, we're in excellent shape as we think about our capacities and where we're at.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nSo then if there's not really a need potentially -- I mean volumes could always surprise to the upside. But if there's not really any need for any material new asset development in 2023, that implies that the capital budget kind of declines a ton which not a surprise. How are you and how are the board -- how is the Board kind of thinking about capital allocation and uses of some of that significant free cash flow that you might be generating next year?\n\nPierce Norton -- President and Chief Executive Officer\n\nSo this is Pierce. The way we look at that is that we look at all the levers that's available to us. So we're going to be looking at as we get closer and closer to what Walt had mentioned about the 3.5x on the debt-to-EBITDA ratio as we continue to go below 100% on our payout ratio, then that's going to actually open up some of those other elements to us that we've had in the past. Of course, our first focus is going to be on these organic opportunities because they give us the best chance to deploy capital that gives us really, really good rates of return.\n\nWe are proud of our ROIC that we've been able to achieve, and we are predicting that is going to continue to go up. So I think what it's going to do is just give us more flexibility to use whatever levers that we feel like bring the most value to our shareholders.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. Thanks, guys. Much appreciated.\n\nOperator\n\nNext question from Chase Mulvehill from Bank of America. Your line is open. Please go ahead.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning. I wanted to come back to the G&P side of the business and I guess a few questions. I guess just correct me if I'm wrong.\n\nAnd I think your commodity or POP exposure is 15% to 20% this year. And then maybe just remind us again the gas versus NGL exposure on those POPs and how much you have hedged versus open today? And then just maybe tie into their kind of what you're thinking about realized G&P rates in the back half of the year?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nChase, this is Kevin. You're right. We provide the hedging information that will come out in our queue and we've provided that in the past. So we are pretty well hedged, but prices have run up significantly, and we've been able to benefit for that for the part of those contracts that aren't hedged.\n\nSo that's what you're seeing that. And also, the other thing that's driving the price improvement is just what volumes are on what contracts. So we've been fortunate to have some volumes come in on higher -- in this case, higher POP-type contracts and been able to benefit from that.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nIs it fair to assume in 3Q that a lot of your open volumes for natural gas as opposed to NGLs?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nTypically, from an open perspective, we've got -- we hedge most of our commodities in a similar way. So you're not going to have a higher percentage hedge necessarily of natural gas versus crude versus NGLs.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. Right. If we go up to the NGL section and look at volumes and kind of where they are today, I think you said 360,000 barrels a day. If we go back and look back in April, you were doing 385,000 a day.\n\nSo we're not back to kind of April peakest levels. But yet G&P volumes in the Rockies are actually back to peak levels. So kind of help me connect the dots there. Is that method related? Or is there something else? And should we kind of ramp pretty quickly back to that 385,000?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nI think in the first quarter announcement -- this is Sheridan, we came out and said we had reached 385,000, but we had an average 385,000. Actually, July at 360,000 will be our highest monthly average that we've had off the Bakken pipeline. And we continue to trend higher in -- as we get into August, we are trending even higher than that. So from an NGL perspective on the Elk Creek pipeline, we are back further than we were in the first quarter or even in the fourth quarter of 2021.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. Last one, just to squeeze one more in. I apologize. I just want to confirm this.\n\nIt sounds like obviously, you're seeing -- looking at Medford and trying to figure out when you can bring it back online, but I just want to confirm that it is not a total loss. You do not see it as a total loss at this point, correct?\n\nPierce Norton -- President and Chief Executive Officer\n\nWell, I mean, the way I would say that in is we are looking at all the pieces and parts to that facility right now. So we'll be assessing that over the coming weeks as to exactly what pieces of equipment are still usable or not. So we can't say emphatically right now that it's either a total loss or not a total loss. We're doing the assessments of that.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. Got it. Makes sense. I'll turn it back.\n\nOperator\n\nNext question from Craig Shere from Tuohy Brothers. Your line is open. Please go ahead.\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nGood morning. Congrats on the quarter. One clarification on Medford. So as far as new expense for third-party fractionation or things that were contracted, you ultimately get insurance recoveries, but doesn't this kind of at least limit optimization margin opportunities until some things resolved?\n\nWalter Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nCraig, I think that we are -- we believe that we've got business interruption insurance for our entire business under that coverage and really don't see a meaningful difference from how our earnings would be sorted out in our normal guidance.\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nOK. And maybe this is expressing my own ignorance, and I apologize. Given the increased gas storage and storage pricing, I'm kind of assuming storage is more of a steady year-round product versus gas pipes that have more seasonality since the storage has to fill. So if that's the case, does the improving storage position in terms of capacity and pricing reduce your gas pipe seasonality?\n\nCharles Kelley -- Senior Vice President, Natural Gas\n\nCraig, this is Chuck. No, see, the way we contract with our customers, frankly, these are firm fee-based contracts. What the customer tends to do is place seasonal spreads and utilize their transport and combined storage for optionality. From a pipe standpoint, we've got a levelized fee earnings throughout the year.\n\nSo the optionality actually comes from the customer, but not the pipeline or variability from the customer, not the pipeline.\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nGot you. So the increasing contribution of the storage really doesn't impact seasonality?\n\nCharles Kelley -- Senior Vice President, Natural Gas\n\nCould you repeat that?\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nSo the fact that you're increasing the amount of storage and the pricing is looking more attractive, that doesn't have any impact on the seasonality question.\n\nCharles Kelley -- Senior Vice President, Natural Gas\n\nCorrect. We're seeing a step up in our storage revenues based on higher rates and the expansion that came online in April, and we'll have an additional expansion come online in April of 2023 where you'll see another step up in our storage revenues.\n\nPierce Norton -- President and Chief Executive Officer\n\nSo Craig, the only thing I'd add to that, this is Pierce, is post winter storm Uri, the value of storage has increased. And so we do have customers that play that seasonal spread and that benefit goes to them. But we also have utilities that are putting gas into storage every single month during the summer is getting ready for that winter pull that they have during their peak demand from basically December through March.\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nGot you. Thank you.\n\nOperator\n\nNext question from Jean Ann from Salisbury -- sorry, Jean Ann Salisbury from Bernstein. Your name is open. Please go ahead.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nHey. Good morning. It looks like there's been some movement on the open season for gas takeaway options out of the Bakken, but it seems like they're targeting 2026, just kind of a long time from now. Do you think that, that will be soon enough to not constrain gas growth out of the Bakken?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nJean Ann, this is Kevin. Yes, I think we feel good about the timing of that. There's some other smaller scale things that have gone on up there that have created a little more capacity. So we think that timing lines up pretty well with kind of our outlook of where gas volumes go.\n\nI would remind you, there's still, we believe, $300 million, $400 million a day of Canadian gas that can be displaced coming out of the Bakken. And so that's -- there's capacity there that just may not on the surface, look like it's there. In addition, we can always, if you get tight and we're -- I'd say we were wrong or we're a little bit late, you can always recover ethane to reduce the MMBtus that go into the pipe. So we -- all in all, we feel good about where we're at.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nThat makes sense. And there's been a trend of NGL integrated midstream companies buying GMP companies, which ONEOK has not really participated in. If this trend continues, do you see it potentially impacting your rates or your flows in the Gulf Coast negatively?\n\nPierce Norton -- President and Chief Executive Officer\n\nWell, I think I'll let Kevin get into the details of this, but we believe that the positions that we have in the other basins are the right thing for us to pursue based on our positions with our assets and the things that we see in the future. I mean, could it have a downward pressure on some of the volumes, yes. But I'd remind everybody that the rates that we get as far as margins in the Permian and the Mid-Continent are some of our lowest ones. So as far as having a really material impact, we don't see that in the future.\n\nKevin, do you have anything to add to that?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nNo, I'd just say that with some of those transactions, obviously, we take a look at a lot of things, but they just haven't been a fit for us. One of the things I would put out there is that many that we have continued to grow volumes on our West Texas LPG system, many of those contracts have quite a bit of term left, and many of them are with producers who have taken kind rights. So regardless who the processor is, we believe those volumes will stay with us. So that's some of the other dynamics at play.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nGreat. That's very helpful. That's all for me. Thank you.\n\nOperator\n\nThe next question is from Sunil Sibal from Seaport Global Securities. Your line is open. Please go ahead.\n\nSunil Sibal -- Seaport Global Securities -- Analyst\n\nYes. Hi. Good morning. Thanks for the clarity on the volume trends.\n\nSo one question for me on the capex side of things. Could you talk a bit about what kind of inflation trends you're seeing in terms of building costs versus what you had budgeted at the start of the year?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nYes. From a cost perspective, we've probably seen more pressure on outside services more than anything as we think about our projects. In many cases, for the projects we are working on, especially MB-5 and Demicks III, that equipment had been purchased years ago before the projects were paused. So we had a lot of that taken care of.\n\nOn the new equipment that we're ordering and the new materials we're ordering, probably as much impact from a supply chain perspective just on a timeliness or schedule perspective than cost. So those are some of the things we're obviously watching closely and staying on top of. It hasn't impacted any of our scheduled dates or our dollar amounts that we've got these projects approved for. So we still feel very good that we're right on top of -- on budget and on schedule.\n\nSunil Sibal -- Seaport Global Securities -- Analyst\n\nOK. And then one housekeeping question for me. It seems like in your reconciliation, you had called out a $10 million sequential decrease in the NGL segment from commodity price differentials. I thought the commodity price differentials kind of widened out a little bit in Q2 versus Q1.\n\nAm I just looking at that correctly? And I was just curious about that line item.\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nSunil, this is Kevin. Yes, that's just with our assets and with -- we've got assets in Conway and Belvieu and storage. That's just the delta between sometimes we have an opportunity to make money in a different prices per -- by commodity. So how different prices compare of the different commodities and how we move barrels around and how we sell barrels.\n\nAnd so that $10 million was just lower than the -- sequentially lower in the first -- than the first quarter in that part of our business. But it's all -- it's part of that kind of how we're optimizing our system.\n\nSunil Sibal -- Seaport Global Securities -- Analyst\n\nOK. And anything to read into that from the second half of this year?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nNo. That bounces -- that will bounce around quarter to quarter just in the sequential comparison.\n\nSunil Sibal -- Seaport Global Securities -- Analyst\n\nGot it. Thanks. Thanks for the color.\n\nOperator\n\nNext question from James Carreker from U.S. Capital Advisors. Please go ahead.\n\nJames Carreker -- U.S. Capital Advisors -- Analyst\n\nHey, thanks for the question. Just thinking about the Medford outage some more. Were those NGLs fractionated they're largely sold into Conway or they sold down in Mont Belvieu and just making sure that there's -- with that outage, there's sufficient pipe capacity to move incremental barrels down to Mont Belvieu to get fracked.\n\nSheridan Swords -- President, Gathering and Fractionation\n\nJames, this is Sheridan. We don't designate by frac where we sell barrels. We can -- with our integrated system, we can deliver barrels from any of our frac into the Mont Belvieu complex. And with that frac being down, we can get these barrels into the Mont Belvieu complex, mainly because of our Arbuckle II asset that we had just brought online that we know had significant extra capacity on it for upside.\n\nSo we're able to deliver through the raw feed system down to Mont Belvieu. And if we need to, we can use the purity system to do that as well. Since we don't have as much purity is coming off -- we don't have any purity coming off the Medford frac, we have a little bit extra capacity on that. So from a pipeline perspective, we feel very good about getting the product into mobility.\n\nJames Carreker -- U.S. Capital Advisors -- Analyst\n\nAnd I guess -- maybe one follow-up, maybe it's minor, but just noticed on this earnings presentation, you're now saying greater than $0.06 bundled rate on your Gulf Coast Permian volumes versus prior approximately $0.06. Is that maybe a trend that continues? Or any other color on what's going on there?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nYes. A lot of it. I think we'll see our rates tick up a little bit, and you're seeing that because of the inflationary escalators that we have on our system.\n\nJames Carreker -- U.S. Capital Advisors -- Analyst\n\nOK. Thank you.\n\nOperator\n\nIt appears that there is no further question at this time. Mr. Andrew, I'd like to turn the conference back to you for any additional or closing remarks.\n\nAndrew Ziola -- Vice President, Investor Relations and Corporate Affairs\n\nOur quiet period for the third quarter starts when we close our books in October and will extend until we release earnings in early November. We'll provide details for that conference call at a later date. Thank you all for joining us, and have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAndrew Ziola -- Vice President, Investor Relations and Corporate Affairs\n\nPierce Norton -- President and Chief Executive Officer\n\nWalter Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nSheridan Swords -- President, Gathering and Fractionation\n\nBrian Reynolds -- UBS -- Analyst\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nColton Bean -- Tudor, Pickering, Holt and Company -- Analyst\n\nTheresa Chen -- Barclays -- Analyst\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nCraig Shere -- Tuohy Brothers -- Analyst\n\nCharles Kelley -- Senior Vice President, Natural Gas\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nSunil Sibal -- Seaport Global Securities -- Analyst\n\nJames Carreker -- U.S. Capital Advisors -- Analyst\n\nMore OKE analysis\n\nAll earnings call transcripts"
}