{
  "companyName": "SelectQuote, Inc.",
  "companyTicker": "SLQT",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/selectquote-inc-slqt-q1-2023-earnings-call-transcr/",
  "content": "SelectQuote, Inc. (SLQT 1.45%)\nQ1 2023 Earnings Call\nNov 03, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to SelectQuote's first quarter earnings conference call. [Operator instructions] It is now my pleasure to introduce Matt Gunter, SelectQuote investor relations. Mr. Gunter, you may begin the conference.\n\nMatt Gunter -- Investor Relations\n\nThank you, and good morning, everyone. Welcome to SelectQuote's fiscal first quarter earnings call. Before we begin our call, I would like to mention that on our website, we have provided a slide presentation to help guide our discussion. After today's call, a replay will also be available on our website.\n\nJoining me from the company, I have our chief executive officer, Tim Danker; and interim chief financial officer, Ryan Clement. Following Tim and Ryan's comments today, we will have a question-and answer session. In order to allow everyone the opportunity to participate, we do ask that you limit yourself to one question and one follow-up at a time. and then fall back into the queue for any additional questions.\n\nAs referenced on Slide 2, during this call, we will be discussing some non-GAAP financial measures. The most directly comparable GAAP financial measures and a reconciliation of the differences between the GAAP and non-GAAP financial measures are available in our earnings release and investor presentation on our website. And finally, a reminder that certain statements made today may be forward-looking statements. These statements are made based upon management's current expectations and beliefs concerning future events impacting the company, and therefore, involve a number of uncertainties and risks, including, but not limited to, those described in our earnings release, annual report on Form 10-K, quarterly report on Form 10-Q for the period ended September 30, 2022, and other filings with the SEC.\n\nTherefore, the actual results of operations or financial condition of the company could differ materially from those expressed or implied in our forward-looking statements. And with that, I'd like to turn the call over to our chief executive officer, Tim Danker. Tim?\n\nTim Danker -- Chief Executive Officer\n\nGood morning, everyone, and thanks for joining us. SelectQuote produced strong results for the first quarter of fiscal 2023, and we're very pleased with the output and metrics being delivered by the strategic redesign we announced last year. Across the board, our results were ahead of internal expectations, including strong growth in our SelectRx business. Similarly, our core senior business has never been better prepared with the Medicare Advantage season than it is this year, and we saw very positive trends in each of the key drivers of our core senior economics, including better persistency and marketing efficiency.\n\nLastly, the strategic approach being applied to our core senior distribution business are also benefiting our Life and Office Home segments, which also had strong quarters. Overall, I'm very proud of what the team has done to rise to the challenge, and the organization is excited to deliver our strategic goals and the season and year 3 consecutive quarters of positive momentum in the key performance metrics that drive our major business lines. In core senior, we saw agent close rates increased 14% year over year, which has been driven by our return focused decision to heavily await our agent population to more tenured core agents. That strategy, in combination with enhanced customer targeting and segmentation also benefit the efficiency of our marketing, where cost per approved policy declined 38% compared to a year ago.\n\nIn the face of a lower LTV reality, which we discussed for the past year, these operating improvements are clearly critical. That said, the progress we've made to date is ahead of plan, and we have a lot of conviction and excitement in our strategy for this year's AEP. Better yet, we continue to see improved customer persistency, which is encouraging for LTV in the future. We'll speak more about that in a minute.\n\nAll in all, a lot of good things happening with our strategy for our core senior business. Moving down the page. Let me touch on this year's AEP and SelectQuote has never been better prepared. First, as mentioned, our agent workforce was hired, licensed and on-boarded by the end of July, which you'll recall compares to last season when best agents were on-boarded much later in the season.\n\nMore important, this year's mix of tenured core agents is about 70%, which compares to roughly 20% last year. Similar to our selective approach to best agents, we've also resegmented how we approach our marketing and customer acquisition. And we've armed our agents with enhanced tools to better serve customers. The bottom line here, of course, is to drive better return and cash flow for policy.\n\nAs we've said before, shareholders and analysts will have to judge us based upon what we produce and the seasons ahead, but from our vantage point, the strategy is indeed working. Lastly, while not part of the strategy, we believe the headwind presented to our business by planned feature uniformity and Medicare Advantage policies last year has been addressed aggressively by the insurance carriers this season. We believe the ongoing AEP season has a number of benefits to our business compared to last season. First, we believe enhanced plan options and benefits for policyholders will drive better customer engagement.\n\nAdditionally, as you've heard from our carrier partners, there is an increasing focus on retention and quality. As a result, we've partnered even more closely with our carrier partners in areas such as healthcare services, as well as targeted Medicare distribution and value-based on-boarding for our Medicare clients. This certainly aligns to the needs of our carrier partners while strengthening our overall cash position. Again, a lot of positive trends, and we're eager to execute this year.\n\nTurning to our summary financials. Ryan will provide more detail, but the key takeaways here are: One, that our core senior life and auto and home divisions performed ahead of plan and with improving economics and cash flow; two, our healthcare services segment which at this time is predominantly SelectRx, continues to grow rapidly, which again is outstanding. As promised, we've added disclosure for our healthcare services segment this quarter as the business scales and becomes a bigger to this EBITDA relative to revenue for healthcare services later in the presentation. In summary, our EBITDA was dampened in the quarter given the stronger-than-expected growth of members and the upfront costs associated with on-boarding those SelectRx customers.\n\nPut more directly, we're happy about the spend because of the return in cash flow, we believe those members will drive in a relatively short period of time. To that point, we're reaffirming our full year fiscal 2023 guidance range and negative $20 million to positive $10 million in adjusted EBITDA and feel very good about the start of fiscal 2023. We are ahead of plan, and thus far, in AEP, we feel very good about the progress we can continue to make against our strategic goals. With that, let's turn to Slide 4, where I will briefly update the strategic approach we've deployed over the past year.\n\nFirst, at left. SelectQuote remains committed to driving improved returns and cash flow for Medicare Advantage policy and believe there are a number of early signs that we are doing just that. First, we now have seen two consecutive quarters of improved early life policyholder retention and believe our targeted approach to growth should continue that trend. Second, with a heavier mix of tenured agents pursuing more selective and higher quality leads.\n\nWe expect to drive improving operating metrics like close rates and cost per policy, which I'll detail in a minute. Moving to the green column. The team deserves thanks for simultaneously rightsizing our business yielding over $250 million in cost efficiency while also preparing us very well for the upcoming season. In sum, we believe SelectQuote has significantly de-risked the operating leverage and season-to-season risk in our business.\n\nIf we move to the right, there's no change to our LTV methodologies, and we believe we remain appropriately conservative with the new reality of Medicare Advantage LTVs. To that point, we're pleased to note that our 2022 cohort is performing in line with expectations. Additionally, as I alluded to, the carriers are taking a similar approach to policyholder persistency, which we believe is well aligned with our strategy. Specifically, we continue to drive revenue from existing services that we've been providing for years through enhancements to our sales, customer care and Medicare customer on-boarding that support the joint strategy.\n\nIn addition, we continue to work with our carrier partners to find synergistic ways to drive incremental revenue through our healthcare services business. Put simply, SelectQuote can generate cash flow faster and can be rewarded for our differentiated service quality. Lastly, at right, we'll talk more here as well, but our healthcare services strategy continues to succeed. SelectRx has more than 32,000 members at the end of the quarter, and we continue to expect revenues of $275 million for 2023.\n\nWe anticipate that healthcare services division will turn adjusted EBITDA positive by the end of 2023. Again, a lot to be optimistic about in the strategy. If we turn to Slide 5, I'd like to take a second to detail some of the key operating metrics that we use to manage and evaluate the business. As I noted at the top, each of these four metrics are trending positively, which is very encouraging given each as a building block to the ultimate return and cash flow produced by our senior distribution business.\n\nIf we start at top left, marketing expense per policy improved by 38% in the first quarter, which marks three consecutive quarters of improvement. The driver here is our effort to optimize the best and highest return lead channels, which on a lower level of volume is performing exceptionally well. Moving right, our efficiency per lead has also improved significantly with agent close rates improving 14% year over year this quarter. The strategy to overweight our core tenured agent force is the driver here, and we expect the trend to continue in the ongoing AEP season.\n\nAt the lower left, maybe the most encouraging metric is the improvement we've seen in our 90-day persistency, which has recovered meaningfully compared to the challenges from a year ago. While we expect season-to-season factors like plan design, to impact persistency at the margin. We believe the actions we have taken in our tighter agent and marketing focus have driven the lion's share of the improvement. Lastly, at lower right, our cost actions, combined with more efficient agents and targeted marketing spend that's driven a significant improvement in our cost per policy, which is down more than 35% compared to a year ago.\n\nAgain, very encouraging and we're looking forward to running this playbook throughout AEP. As we turn to Slide 6, let me emphasize the improvements we have made in cost structure, margins and cash flow. As we've said, we took significant action not just to rightsize our senior business, but to also reduce operating leverage through measured policy production, better marketing efficiency and fixed cost optimization. Since undergoing our cost and operational improvement efforts earlier this calendar year, we've seen significant year-over-year improvements in each of the last three consecutive quarters, with Q1 per unit operating cost per approved policy down 36%.\n\nAs I indicated earlier, the carrier rate plan environment seems favorable to this AEP compared to last improving returns. For AEP, let's flip to Slide 7, where I'll provide brief color on SelectQuote's positioning heading into the season. As I noted a few times before, we're in excellent shape and have already seen tangible benefits in the early weeks of this roughly 70% and has been hugely beneficial and better yet, these agents are more advantaged than prior years across a number of factors. First, we're giving them higher quality leads to pursue.\n\nSecond, we've armed them with the best set of desktop tools to deliver the most efficient and best level of customer service in our business. We are especially excited here as we feel we have met the market extremely well given the wide range of planned features offered by carriers this year. Third, SelectQuote benefits from the breadth of our services with over 32,000 active Sex numbers. I'll speak more to it in a few minutes, but we believe SelectQuote is not only best prepared for the ongoing AEP, but we've also had the competitive advantage as a uniquely capable connector across healthcare.\n\nLet's now turn to my last page on Slide 8. We've given a lot of airtime in these calls to SelectRx and rightfully so, given the success of the business. While it remains the major driver of our healthcare services segment, we think it's on how SelectQuote is so well positioned to add value in the healthcare ecosystem. The simple answer on why we're in the SelectRx business is that the recurring revenue and margin profile is highly attractive, which Ryan will speak to more in a minute.\n\nThat said, as the business scales over 2023, we want to make sure that our broader approach to healthcare services through Population Health is at loss. As you all know, healthcare as an industry is in the midst of a shift toward outcome-based care with a significant focus on best and most cost-efficient service for patients. The themes you've heard us speak to, including value-based care, at home versus at clinic, custom and individual focused health profiling are all part of how each participant in the industry is moving. healthcare providers working with managed care insurance carriers, working for the needs of the patient.\n\nSelectQuote sits at the middle of all of this. we've long-held conviction that we're best positioned to add value to a wide number of contact points and steps in the spectrum. I'm reiterating the point here because while we're intensely focused on repositioning our core senior business, we believe the case study that is playing out in SelectRx has broader application across many points in the right-hand column on this page. In certain cases, these patient needs present a revenue opportunity for SelectQuote.\n\nAnd more cases, our information advantage offers tremendous value to our carrier partners and healthcare providers, which in turn makes us stickier and more important partner to them. Best of all, the opportunities I'm speaking about leverage existing infrastructure and spend. The punchline here is states in. But similar to our confidence in the strategy for Medicare Advantage, we're seeing a lot of good things happen here as well.\n\nAnd with that, let me turn the call over to Ryan to detail our financial results. Ryan?\n\nRyan Clement -- Interim Chief Financial Officer\n\nThanks, Tim. Let me begin with a quick review of our results, where I can give some context on our senior KPIs. We can then review the results for our growing healthcare services segment, including SelectRx, and then I will conclude with an update on our Life and auto and home segments. First, on consolidated results, as Tim noted, the $162 million and consolidated adjusted EBITDA was negative $27 million.\n\nAs Tim noted, we are pleased with our results, which were ahead of expectations across each of our segments. One point of detail, though, as it relates to our consolidated EBITDA is that approximately $12 million of the total EBITDA loss for the quarter can be attributed to the growing and ongoing scale of our SelectRx and healthcare services business. As noted, we have provided additional disclosure in this segment, and we welcome feedback from our analysts and investors. As Tim mentioned, we are pleased to invest in strong growth within our healthcare services segment, given the tremendous value and recurring cash flows we will generate from the SelectRx customers.\n\nOverall, I'll echo Tim's comment that we are very pleased with our results and are tracking ahead of our internal plan. If we turn to Slide 9, let me give an update on what we saw in our senior segment in first quarter. As we noted, in our strategic redesign, our goal is to reduce operating leverage in our business and pull back on policy production to improve our operational and financial performance, particularly cash flow. In the quarter, we delivered over 83,000 total Medicare Advantage approved policies down 1% year over year.\n\nAs previously indicated, we saw a significant improvement in close rates and marketing cost per from policy. When we look at our operating metrics, we have growing confidence in our strategy as operating costs declined more than 35% year over year, which matches the impact of lower LTV and positions us well for broadening economics as the business continues to stabilize. One note, on LTV, first quarter is typically the lowest of the four quarters within a given fiscal year. Our MA LTV for the quarter was in line with our original outlook.\n\nWe continue to forecast MA LTV for the full year in the $875 range per our comments last quarter. As a reminder, we maintain our 15% constraint for MA LTV even as we make lower persistency assumptions from recent quarters. That said, as Tim highlighted, we are beginning to see encouraging trends in persistency, and we are optimistic about the upcoming season. Again, we are focused on driving positive operating leverage in our core senior business and believe the early signs of our strategy are starting to show up in our results.\n\nIf we turn to Slide 10, I'd like to expand on the revenue and profit timing for our SelectRx business as we haven't spoken in detail in previous quarters. First, to level set, our SelectRx business is a subscription revenue model, serving a nondiscretionary need for our members. The margins and cash flow at scale are strong and recurring. That said, there is a timing gap between investments in on-boarding and revenue generation.\n\nThe diagram here on Slide 10 depicts the ramp of the SelectRx member, which will help contextualize the timing impacts on our financials. First, in the enrollment stage, a new SelectRx customer is enrolled through agents within our Population Health organization. Next, the on-boarding process employs pharmacy coordinators who engage with our member physicians to align medications, dosages and frequency for delivery. Given our target average member takes upwards of 8 to 10 different drugs, the process to coordinate that full set of prescriptions can take place while partial shipments have already begun delivery.\n\nIt is this transition between on-boarding and ramping, which generates revenue and scales margin. Patients are most profitable once we obtained all prescriptions and are shipping full boxes. Said another way, SelectRx members that are fully on-boarding and hit the fourth part of this diagram drive margin accretion and are doing so with a sticky recurring subscription model. So to Tim's point before, with our rapid growth, we have a significant portion of our SelectRx patients in the earlier stages of the customer life cycle.\n\nWe believe the customer base will mature over time, driving improved margins. This is a trade will gladly make as the economics and cash flow maturity for these members are highly attractive. Now, if we turn to Slide 11. Let me provide an update on our healthcare services segment.\n\nSelectRx members grew to over 32,000 in the quarter, which represents a year-over-year growth of around 550% and 28% growth over the past quarter. Our Q1 revenue from healthcare services of $43 million with seven times growth was largely on the back of the strong SelectRx membership. As discussed on the previous slide, the growth in on-boarding of these members requires modest upfront investment. As a result, we expect the healthcare services business to inflect a positive EBITDA by the end of fiscal 2023.\n\nAgain, to be clear, this is welcome to spend on our part as we are thrilled with the uptake and popularity of our growing SelectRx service. We will share more detail in the coming quarters, especially on the near-term cash flow benefits from this business. Lastly, if we flip to Slide 12, let me briefly update you on our Life and auto and home segments. Admittedly, these businesses have been less featured in our commentary given their relative size in the organization.\n\nThat said, they remain an important piece of SelectQuote, and we are seeing many of the same benefits here that we are in our senior segment. As expected, revenues declined in our life insurance business, given the lingering impacts from COVID and the shift of agent population we have spoken about in previous quarters. Revenues for our auto and home business were roughly flat year over year. Despite consolidated revenue for both segments declined 18% year over year.\n\nEBITDA more than tripled resulting in a margin of approximately 17% for the quarter. The key driver here, similar to our senior business, with cost management and improved efficiency. Within the final expense business, we pulled back somewhat on policy production to focus on optimizing our marketing spend and improved agent rate conversion, leading to improved margins. Overall, as Tim mentioned, the strategy being applied in senior is being applied elsewhere at SelectQuote, and it is great to see the plan executed and evident in our financials.\n\nWith that, let's get to your questions. Operator?\n\nOperator\n\n[Operator instructions] The first question comes from the line of Daniel Grosslight with Citigroup. You may proceed.\n\nDaniel Grosslight -- Citi -- Analyst\n\nHi. Thanks for taking the questions. You mentioned that this AEP, you have worked through some of the uniformity headwinds that you spoke about previously. Can you go into a little more detail around how plan design this AEP has differed from previous years and what gives you the confidence that you'll see an improvement in this AP.\n\nAnd then coupled with that, all of the carriers have been investing in their internal sales forces as well. I'm just curious how competition with the carriers themselves has shaped up as AEP.\n\nTim Danker -- Chief Executive Officer\n\nHi. Good morning, Daniel. Great question. And I might ask Bob, if you want to kind of talk about what you're seeing in planned design this year and attractiveness of it.\n\nBob Grant -- President, Senior Segment\n\nYeah, absolutely. Thanks, Daniel, for the question. As far as uniformity and plant design, I think we've talked about before, one of the challenges previously is that in 2019, the carriers started to introduce ancillary benefits as those were improved -- approved in the plans and then COVID kind of changed a lot of the way people receive their healthcare, so there was a lot of learnings through that. And I think there were some misses in plan design last year.\n\nThis year, it feels like the carriers are taking the learnings from the last few years and applying them really correctly. So where they have environment with good plan design that seems to be very meaningful to clients. So that's what gives us a lot of confidence in that plan design discussion.\n\nTim Danker -- Chief Executive Officer\n\nAnd Daniel, I think your second question is related to -- yeah, go ahead.\n\nDaniel Grosslight -- Citi -- Analyst\n\nNo, no. I was just going to follow up on that second question. Go ahead, Tim.\n\nTim Danker -- Chief Executive Officer\n\nYeah, so I think the second question regarding kind of what we're hearing for some of the MCOs and the strength of their internal channels. Certainly, which is good to hear for them. But certainly, for us, as we alluded to, early days of AEP, we're feeling very good about. I think the groundwork that we laid over the last three quarters combined with the topic you just mentioned differentiated enrich planned benefit design is setting up for good AEP.\n\nWe continue to work with the carriers and are seeing very strong results. I think we're extending beyond just our MA distribution platform into healthcare services and more broadly, value-added services. So I think that's very much aligned with the overall needs of the managed care organizations. And certainly, their commitment to us is not weighing even in the year -- this year, where we're pulling back volume of that, there continues to be very strong interest and demand from the carriers for our high-quality distribution and what we can do more broadly across healthcare.\n\nDaniel Grosslight -- Citi -- Analyst\n\nGot it. OK. And then a follow-up on the healthcare services segment. I appreciate all the color you've given us this quarter on that.\n\nI'm just curious how you intend to kind of get that to EBITDA breakeven or positive by the end of the fiscal year. Can you just put a finer point on how you intend to scale that profitably? Should we think about next quarter also being pressured on EBITDA because you're going to have a lot of seniors during AEP and perhaps you invest in SelectRx ahead of that. So just curious on the key to get to breakeven or positive.\n\nTim Danker -- Chief Executive Officer\n\nYeah, certainly. Great question, Daniel. I would say broadly. Nothing has materially changed with respect to our long-term EBITDA outlook for Rx.\n\nWe're certainly very pleased with the continued strong growth, as we indicated on the call, 32,000 members, up 30% sequentially. The team is doing an excellent job. We wanted to provide additional disclosure and visibility given the rapid growth in this particular line of business. And so as we've shared before, there's not a lot of significant incremental marketing spend, right? We're leveraging the spend from our MA distribution business, but there are some non-marketing costs related to enrolling and on-boarding.\n\nAnd we've certainly seen a lot of significant growth in the stage of the funnel. And as those customers mature to full shipments most -- on average, most of those will be contribution margin positive. So as that book matures, a higher mix of those will be fully on-boarded and EBITDA will trend higher. So we certainly think that this -- we're building a very valuable recurring margin business, and we do expect it to turn profitable by the end of the year.\n\nDaniel Grosslight -- Citi -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. The next question comes from the line of Jonathan Yong with Credit Suisse. You may proceed.\n\nJonathan Y. -- Credit Suisse -- Analyst\n\nHi. Thanks for taking my question. I guess on SelectRx, I appreciate all the comments there. Just to get a better sense here, but is there a time frame to which a member generally hits breakeven and then the time frame to, let's call it, mature EBITDA on a per member basis? And then similarly, is there a specific amount of revenue or orders needed on a per member basis for the member to be profitable? Just any color would be appreciated.\n\nRyan Clement -- Interim Chief Financial Officer\n\nYeah. So I think you're alluding to the customer life cycle. Obviously, we're in rapid growth and accumulating a lot of new members. Many of them sitting in kind of stage three of that diagram we discussed.\n\nThat said, as we move toward full boxes, like the incremental value of each incremental drug -- the margins at the drug level are 25% to 27%. So getting those final drugs into the box is dramatic to expect over time that the book will mature. Certainly, the growth of 30% over the past quarter and doubling over the past two quarters. Really, I'd love to say that something we can sustain, but that's probably unreasonable to assume.\n\nSo we do expect that the overall book will mature. And as time progresses toward the back half of the year, we'll move to EBITDA positive in the total healthcare services division level.\n\nJonathan Y. -- Credit Suisse -- Analyst\n\nOK, great. And then going back to senior and some of the benefit design changes in the marketplace. It does sound like some of the MCOs are providing much richer benefits than others. Does this create a possible churn issue if basically those MCOs are pulling members that from, say, some of your other carrier partners that are offering perhaps less rich benefits.\n\nDoes that have any form of impact on you in terms of member retention?\n\nTim Danker -- Chief Executive Officer\n\nYeah. Great question, Jonathan. This is Tim. We do think more competitive, differentiated plants, it can create some incentive for consumers to shop, including our customer base.\n\nBut -- we certainly believe we've de-risked the back book over the past several quarters, and we've been writing new business with higher constraints and lower LTVs. As we highlighted today, we've made a focused on riding even higher quality, higher LTV business. And we think that, that minimally helps continue to build a stronger customer base. We've also not let up on our efforts to drive proactive and reactive retention efforts related to any of those customers who may decide that they may be in market, so in the event that they want to shop, they shop with us, and they remain with SelectQuote.\n\nSo we feel well positioned there.\n\nJonathan Y. -- Credit Suisse -- Analyst\n\nGreat. Thanks.\n\nTim Danker -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. The next question comes from the line of Meyer Shields with KBW. You may proceed.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. Good morning all. And I appreciate the very positive commentary. One question, if I can.\n\nCan you walk us through what a normal year as LTV progression looks like?\n\nRyan Clement -- Interim Chief Financial Officer\n\nYeah. It sounds like -- I think we -- in the Q4 time frame outlined $875 million is our full year expectation for the year. That's that. As we alluded to on the call, there is a seasonality component to that, right? Like we're looking at policies that were written in the July to September time frame.\n\nCertainly, right behind that, you have an AEP in an open enrollment season where people have an opportunity. So there is seasonality. As the year progresses, you would typically expect our second quarter to yield a higher LTV than what we've booked today and the OEP season to be even play higher than that and then it would begin to come down a little bit. But I would say the $780 million actually was very much in line with our expectations, maybe fractionally better.\n\nAnd we're reiterating $875 million is our expectation for the full year.\n\nTim Danker -- Chief Executive Officer\n\nI just add to that, Meyer. I mean... \n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nYeah. I'm sorry, go ahead.\n\nTim Danker -- Chief Executive Officer\n\nYeah, I'd just add that, Meyer. Great question. I mean I think if you look at the underlying operating metrics and what we shared on Slide 5, a lot of reason to believe that those items will help us continue to improve. LTVs over time and certainly improve the margins and unit economics in the business.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Perfect. This is a smaller question, I guess, but a lot of personal P&C brokers have noted that contingent commissions are going to be under pressure because both auto and home are doing fairly poorly. And I was hoping you could outline or maybe frame how we should think about that in the context of the auto and home segment.\n\nTim Danker -- Chief Executive Officer\n\nBill, do you want to provide any comment on auto and home. I know we've been -- actually, the business is performing quite well, but any commentary on that be appreciated.\n\nBill Grant -- Chief Operating Officer\n\nYeah, absolutely. It's a great question. We've kind of overlaid the risk of where these particular carriers are seeing more pressures than others based on where they've written. We're keeping a close eye on them.\n\nAbsolutely what you mentioned is spot on. Luckily, we believe that the bulk of the pressure in carriers -- some of the carriers that we don't write and in areas that predominantly, we haven't written as much, but we'll certainly be keeping a close eye on it as we move forward here.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nUnderstood. Thank you so much.\n\nBill Grant -- Chief Operating Officer\n\nIn a rising rate environment, right, those are all retroactive for us. So there's also a benefit to that as we move forward in terms of those being kind of those one year contracts, so we get the benefit of the premium moves as we move forward. \n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nRight. No, absolutely. That make sense. Are your contracts typically January to December?\n\nBill Grant -- Chief Operating Officer\n\nYes, typically, they are.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Excellent. Thank you very much.\n\nOperator\n\nThank you. There are no questions waiting at this time. So I would now like to pass the conference over to Tim Danker for any closing remarks.\n\nTim Danker -- Chief Executive Officer\n\nYes. Thank you, Nikita. I want to thank everyone again for joining us on the call this morning. As we noted last quarter, SelectQuote team firmly understands the need to deliver results to shareholders, and we continue to work very hard to optimize each of our businesses.\n\nThat said, the out-performance versus our plan in the first quarter is very encouraging. And we look forward to sharing more progress in the quarters ahead. I want to thank you again for your time. We look forward to speaking to you again next quarter.\n\nDuration: 0 minutes\n\nMatt Gunter -- Investor Relations\n\nTim Danker -- Chief Executive Officer\n\nRyan Clement -- Interim Chief Financial Officer\n\nDaniel Grosslight -- Citi -- Analyst\n\nBob Grant -- President, Senior Segment\n\nJonathan Y. -- Credit Suisse -- Analyst\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nBill Grant -- Chief Operating Officer\n\nMore SLQT analysis\n\nAll earnings call transcripts"
}