{
  "companyName": "SunPower",
  "companyTicker": "SPWR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/sunpower-spwr-q3-2022-earnings-call-transcript/",
  "content": "SunPower (SPWR -0.83%)\nQ3 2022 Earnings Call\nNov 08, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the SunPower Corporation third quarter 2022 earnings conference call. [Operator instructions] As a reminder, today's conference call is being recorded. I would now like to turn the conference over your host Mr. Mike Weinstein, vice president of investor relations at SunPower Corporation.\n\nThank you, sir. You may begin.\n\nMike Weinstein -- Vice President, Investor Relations\n\nGood afternoon. I would like to welcome everyone to our third quarter 2022 earnings conference call. On the call today, we'll begin with comments from Peter Faricy, CEO of SunPower, who will provide an update with third quarter announcements and business highlights, followed by our expectations for the remainder of 2022. Following Peter's comments, Guthrie Dundas, SunPower's interim CFO, will then review our financial results and guidance for the year.\n\nAs a reminder, a replay of the call will be available later today on the investor relations page of our website. During today's call, we will make forward-looking statements that are subject to various risks and uncertainties that are described in the safe harbor slide of today's presentation, today's press release, our 2021 10-K and our quarterly reports on Form 10-Q. Please see those documents for additional information regarding those factors that may affect these forward-looking statements. Also, we will reference certain non-GAAP metrics during today's call.\n\nPlease refer to the appendix of our presentation, as well as today's earnings press release for the appropriate GAAP to non-GAAP reconciliations. Finally, to enhance the call, we have posted a set of PowerPoint slides, which we will reference during this call on the Events and Presentations page of our investor relations website. In the same location, we have posted a supplemental data sheet detailing additional historical metrics. With that, I'd like to turn the call over to Peter Faricy, CEO of SunPower.\n\nPeter?\n\nPeter Faricy -- Chief Executive Officer\n\nThanks, Mike, and good morning, everybody. In the third quarter, we continue to break records for customer growth and revenue, putting us on track toward the high end of our 2022 guidance for those metrics. The value of our solar and storage systems continues to grow as utility rates rise, and costs are offset by tax incentives from the Inflation Reduction Act. With a balanced approach to pricing, growth and profitability, we continue to build a growing market share against peers.\n\nWe reported $33 million of adjusted EBITDA this quarter, more than the entire first half and 24% higher year over year. We also turned positive on business unit cash generation this quarter and now hold $397 million cash and equivalents on an underlevered balance sheet. SunPower's momentum is building, and we feel like we have the wind in our backs. We are very excited to share with you our accomplishments this past quarter as we look forward to building the world's best residential solar company for both our customers and our investors.\n\nPlease turn to Slide No. 4. I'm pleased to report that customer demand continues to be strong, and we added 23,100 new customers in the quarter, a 63% increase year over year, that shows a persistent level of strong customer demand for residential solar and for SunPower specifically. Revenue also grew at 67% year over year as price increases are offsetting the higher impact of product and installation costs.\n\nWe continue to see strength across all of our sales channels and note the 113% year over year customer growth from the SunPower direct channel. Our backlog set a new high versus recent quarters at 20,300 Retrofit customers. Importantly, adjusted EBITDA per customer has grown to $2,100 before Platform Investment, and we believe we'll be able to achieve our analyst day guidance for $2,000 to $2,400 for the full year. SunVault energy storage system sales continue to benefit from higher pricing in the third quarter, partially offset by a slightly lower 17% bookings attach rate in the SunPower Direct channel.\n\nSunPower Financial also benefited this quarter as we raised pricing. SunPower Financial reached a 49% bookings attach rate in September, and we note that lease offerings have begun to attract renewed customer interest in recent weeks since the passage of the Inflation Reduction Act. Many of you have expressed concern about the impact that higher mortgage rates are having on new homebuilder partners and the New Homes segment. In the third quarter, New Home installations were up 22% year over year and backlog stretches out to 33,600 homes.\n\nWe continue to see important long-term strategic value here, and we are working to extend our presence beyond California and in the multifamily, which is showing strength under the current economic conditions. We are also pleased to have reached a finalized agreement with Dream Finders Homes to build nearly 400 solar standard homes across five communities in Colorado. Please turn to Slide No. 5.\n\nI want to highlight the steady acceleration of growth that we've seen both in new customers and revenues year over year. Even considering the higher cost of borrowing and other price increases, the value of residential solar continues to increase versus steeply rising conventional utility bills. The Inflation Reduction Act also helps propel this widening value proposition well through the next decade. Please turn to Slide No.\n\n6. Progress has not been limited to top line growth as we illustrate here with improving both EBITDA and EBITDA per customer throughout this year. With $59 million of EBITDA booked this year, we are reiterating our guidance for $90 million to $110 million of adjusted EBITDA for the full year. Please turn to Slide 7.\n\nAs the cost of conventional electric fuels remains elevated, utility bill inflation continued to accelerate in recent months to 14.3% year over year. And 11 states saw increases greater than 20% year over year in August. As I noted earlier, the steep raises continue to elevate the value proposition of residential solar, which remains one of the most powerful ways to stabilize and reduce home power bills, despite the rising costs of solar industry supply chain and labor. Please turn to Slide No.\n\n8. We were very proud to announce a new collaborative agreement with General Motors this quarter. Under the agreement, SunPower will be the preferred installation partner for Level 2 and Bi-directional EV charging equipment. Most importantly, SunPower will be the exclusive solar provider to all GM customers, and we view this as an important new sales channel that capitalizes on the growing interest in rooftop solar that naturally arises from EV ownership.\n\nNearly 80% of electric vehicle charging occurs at home, typically adding 40% or more home electric usage per vehicle. So it's not surprising that some reports have cited nearly 30% to 60% of global EV owners going on to purchase a rooftop solar system. Residential solar is the best way to help reduce this extra demand with clean energy at a preset cost that can reduce and stabilize an electric bill for decades. GM is targeting to reach more than 1 million units of annual EV capacity in North America in 2025, and SunPower expects to be there to help this new audience obtain affordable clean energy.\n\nPlease turn to Slide 9. In order to serve EV customers, SunPower will build a new, more efficient customer experience. This includes conducting home assessments remotely, allowing everything from pricing, scheduling and payment, as well as self-service tracking to occur quickly with minimal customer effort. Please turn to Slide No.\n\n10. Finally, I'll share with you the progress we have made executing against the five pillars of our strategy. For customer experience, SunPower continues to receive public recognition and media accolades. You may have seen that we are recently ranked the No.\n\n1 home solar installer by CNET and SunPower continues to be the highest-rated solar company in the United States. For products, we launched new versions of our SunVault storage system and win a Good Housekeeping Award this quarter as well. We also began installing the first U-Series panels targeting the mass market in Q3. U-Series panels are an important part of being able to serve this growing consumer demand.\n\nWe continue to work closely with First Solar on a panel production agreement. As you know, the Inflation Reduction Act includes benefits to encourage domestic panel sourcing and production. Accordingly, our discussions with First Solar have been evolving to best align the supply chain side of the agreement with those incentives. I also want to share with you that we are working to beef up our supplies for 2023 and beyond significantly.\n\nSunPower is also in advanced talks with multiple additional suppliers, including Maxeon, to procure a materially large and diverse portfolio of DC and AC solar modules for 2023 and 2024. These modules will meet the well-known SunPower quality and reliability standards and carry the industry-leading SunPower complete confidence warranty to serve our residential customers across the U.S. For growth, we made new investments in the master dealerships of Renova and EmPower through our Dealer Accelerator program. We solidified a four-year nationwide exclusive agreement with Dream Finders Homes to be its exclusive provider of solar and storage solutions.\n\nFor digital, our engineering teams launched a new real-time data visualization tool for dealers that will significantly enhance both the dealer and customer experience. We've also completed the initial build of software that will allow our systems to communicate with interconnected utilities in preparation for future virtual power plants and demand response participation. And finally, SunPower Financial continues to increase customer attachments with 94% higher year over year net bookings, even faster than our overall customer growth. We are seeing lease and PPA bookings growing materially faster at 120% year over year since the passage of the inflation Reduction Act.\n\nIn summary, our strategy is working. With our focus on providing a world-class customer experience and industry-leading products, coupled with attractive financing options, we are driving market share gains and a large backlog that will benefit us well into 2023. I'll now turn it over to Guthrie for more details on our Q3 results. Guthrie?\n\nGuthrie Dundas -- Interim Chief Financial Officer\n\nThank you, Peter. Please turn to Slide 12. I'm pleased to be on my first earnings call as Interim CFO, and I look forward to speaking with all of you in the coming weeks. As Peter mentioned earlier, strong demand and improving EBITDA per customer remains the key theme for SunPower in the third quarter.\n\nWith the month into the fourth quarter under our belt and a healthy looking backlogs heading in, we continue to feel good about our ability to achieve full year guidance. For the third quarter, we are reporting $33 million of adjusted EBITDA and $470 million of non-GAAP revenue, an increase of 67% year over year, which continued to accelerate over the 63% year-over-year growth we saw in Q2 and the 41% from Q1. We added 23,100 new customers in Q3, a 63% increase year over year that keeps us on track to achieve our 2022 full year guidance. Adjusted non-GAAP gross margin remained above 20% as the higher cost of equipment, labor and shipping were passed along in pricing.\n\nAdjusted EBITDA per Customer before Platform Investments increased to $2,100 for the quarter as we benefited from the operational leverage gained from rapidly increasing sales. As we highlighted at the analyst day, Platform Investment of $17 million is primarily products, digital and corporate opex. Our balance sheet strengthened considerably in Q3 with the sale of another 1 million shares of ENPH Enphase stock at around $290 per share. Our cash and equivalent on hand increased to $397 million, leaving us with only $28 million of net recourse debt, providing us with a healthy level of flexibility to invest in the business.\n\nWe also have 0.5 million unsold Enphase shares remaining at the end of the third quarter. We are now valuing our ownership of lease renewal Net Retained Value in SunStrong using a 6% discount rate, given the rising cost of debt capital used to support these contracts. With growth in the portfolio and a sensitivity of approximately $15 million per 25 basis points of discount rate, we now estimate the value of our stake at around $250 million. Please turn to Slide 13.\n\nWe are affirming our guidance for 2022 and our target model for 2025 that we most recently discussed at the analyst day. Continued strong customer growth, operating leverage and discretionary platform investments, all contribute to our confidence in meeting full year EBITDA guidance. We've previously said that our results this year are weighted toward the second half. And I'll note that we entered the fourth quarter with $59 million of EBITDA year-to-date versus our guidance range of $90 million to $110 million for the full year.\n\nNext, I will walk you through an update to the bridge between year-to-date results and full year guidance for $2,000 to $2,400 of EBITDA per customer. Please turn to Slide 14. On this slide, we highlight updated factors that lead to our 2022 full year guidance for $2,000 to $2,400 EBITDA per Customer for Platform Investment, starting from a base of $1,950 year-to-date. These numbers are rounded for presentation.\n\nFirst, we expect to see continued improvement in gross margin from higher customer pricing to offset cost inflation that will result in a net incremental improvement of $25 to $300 EBITDA per customer for the full year metric. Second, recall that our target model from the analyst day also assumes SunPower Financial attach rates grow to a 45% run rate by the end of 2022. The target model also assumes a storage attach rate for installed systems that grows modestly through 2022. Assuming up to $1,000 to $3,000 of incremental margin for each attached customer, we ultimately expect a modest incremental improvement of $25 to $100 EBITDA per customer for the full year.\n\nThird, we expect continued improvement in sales and marketing opex on a per customer basis, largely as a result of strong customer demand that contributes to operating leverage. Altogether, that nets out to an expected improvement of roughly $50 to $450 EBITDA per customer for the full year metric, bridging the gap between the $1,950 we are reporting for the year-to-date and our annualized guidance for 2022 of $2,000 to $2,400. As customer acquisitions build into Q4, you should continue to think about our total EBITDA as seasonally weighted toward Q4. I want to emphasize that this value per customer has the virtue of being cash upfront with no discount required.\n\nIt also excludes the value of an ITC extension that may accrue to us through either increased leasing or cash sales pricing in future years. It excludes lease renewal value that we own through SunStrong. Any future upsells in battery systems and other equipment and services to prior customers are also excluded. The point here is that this is a starting point, and we are building a base of profitability that we expect to grow for years.\n\nWe entered the fourth quarter with continued strong residential demand, driven by the tailwinds of higher conventional utility bills and the strong support of federal and state incentive programs. We are laser-focused on growing our residential market share and now possess a cash and balance sheet position that is the best we've seen in years. We look forward to building on these successes and to creating the world's best residential solar company together with all of you. With that, operator, I would like to turn the call over for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Kashy Harrison of Piper Sandler. Your line is open.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nHi. Good morning, all, and thank you for taking the questions. So first one, macro policy question. The CPUC last week indicated that there's some oral arguments next week revolving around M3.\n\nAnd so, just curious what your policy department is telling you on the timing of a revised proposal.\n\nPeter Faricy -- Chief Executive Officer\n\nYes. Kashy, nice to hear from you. So on California NEM, a couple of pieces of context. One is, we do believe that oral arguments will take place at this meeting on the 16th.\n\nIt sounds likely that there'll be some initial revised guidance provided sometime post-election day pre-16th. And then, I think, as you know, there's a period for comment and discussion and there's an opportunity for further revisions. And so, we'll see how that plays out over time. I think our best understanding, I guess I would continue to describe us as cautiously optimistic that the new guidance will be an improvement for California solar customers compared to the guidance that was issued last December.\n\nAnd then, probably the biggest context that's important to keep in mind is there's been two major changes since that initial guidance. One is California utility prices have risen a great deal since then. And I think on Page 7 of our earnings deck, you saw California up 17% year over year through August. That's really hitting consumers hard and it makes the value proposition of solar really attractive.\n\nAnd then, No. 2 is the IRA and the fact that the incentives increased and got extended. And so, we'll see what the revised guidance is. We'll see where the process goes, but it's our belief today that the impact is likely to be much more minimal than the impact would have been from the guidance that was issued last December.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nAnd then, maybe as my follow-up question. So you reiterated full year '22 customer guidance, which implies a sequential decline into 4Q and a meaningful deceleration in year-over-year growth relative to the last quarter. It doesn't really reconcile to the demand commentary you've made or the year-to-date results, which suggest that demand is running well ahead of your expectations. And so, should we just think about that full year customer guidance as being extremely conservative? Just curious what's going on with the 4Q customer.\n\nPeter Faricy -- Chief Executive Officer\n\nWell, listen, I think it's fair for you to call me out on that. But yes, I think the customer guidance, it will be fair to say it's extremely conservative. I think the -- I think in my comments, I said that this will put us toward the high end of the range. But I think it's fair to point out that we're on track to be at the high end or above the range on customers and on revenue for the full year.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Colin Rusch for Oppenheimer. Your line is open.\n\nOne moment. Our next question comes from the line of Sean Morgan of Evercore. Your line is open.\n\nSean Morgan -- Evercore ISI -- Analyst\n\nHey, thanks, operator. So Peter, I think one of the interesting aspects of your tenure at SunPower is sort of this goal toward digital customer acquisition and being able to sort of drive out some of the costs. So just curious, I know we've talked about this kind of off-line a little bit, but maybe just some more updates on kind of some tangible steps you guys have been able to sort of achieve over the last three quarters of the year so far toward that goal of kind of driving out those customer acquisition costs?\n\nPeter Faricy -- Chief Executive Officer\n\nYes. Sean, happy to talk about that. So I think as someone new to the industry a couple of years ago, I think it was surprising, I guess, would be the best way to say how high customer acquisition costs are in solar. And to some extent, it really doesn't make sense to me because the value proposition is so strong.\n\nWe're saving people money and we're helping them make a big positive impact on the planet. So it really felt to me like there was a disconnect and if we can get that message out, we should have people -- this is more hypothetical, lined up at our offices to get solar power. So some of the things that we're trying to do -- we talked about two things at analyst day that I think you're beginning to see evidence of. One is we're excited to explore partnerships that make the customer acquisition process much more efficient.\n\nSo if you think about someone like IKEA, which is a special brand. It attracts customers that are more environmentally conscious and we've built a specific process and an exclusive set of products for them. We're pleased so far with that partnership. Then the big partnership that we announced this quarter with General Motors is really an efficient way to reach people who, as we talked about, are very, very likely to want not just an EV charger but they're very likely to want to add solar and storage, and we hope many other products come beyond over time.\n\nSo partnerships is part one of this. And then, the part two is, I still do think that there's an opportunity for us to improve the ROI of our digital marketing spend. And from my experience at Amazon, I can tell you that this is a combination of software and mathematics. And it's really about getting more and more intelligence built into your bidding algorithms over time.\n\nSo that you can begin to make smarter choices about where you invest your money. I think there's still a good amount of opportunity for us to improve there, and I'm looking forward to continuing to invest to improve that as we go forward.\n\nSean Morgan -- Evercore ISI -- Analyst\n\nOK. And then, I think the IRA, a lot of people have been sort of focused on the production side benefits. But I think there's going to be probably an opportunity for adders for the ITC for the resi side. And so, now that you guys have had your finance team and your lawyers sort of tax people digging in to this for a couple of months now.\n\nDo you -- what are you sort of thinking about for sort of best case cost -- sort of recovery for an install in terms of ITC benefits with the adders for like, I guess, a best case customer scenario.\n\nPeter Faricy -- Chief Executive Officer\n\nYes. So I think, Sean, the -- it's a little bit premature to come out with a point of view on that yet for one reason, which is the U.S. government is still very much defining what qualifies for those adders. And so, if I just give you one that's a really good fit for our company, which is the 10% adder for serving underprivileged communities.\n\nThat's one where they're still working on definition, and it's our understanding that we'll get more definition sometime in the first quarter. So we're staying close. We've provided our comments to the U.S. Treasury Department.\n\nWe've provided our comments to the Department of Energy and we're really trying to work with them closely to help them define what we think is the appropriate ways to qualify for those adders. But look for us sometime at the beginning of next year to provide more color on how we're thinking about the impact to our business.\n\nGuthrie Dundas -- Interim Chief Financial Officer\n\nYes, I would just add -- Thanks, Sean. I would just add, we are amid working through this, obviously, getting clarity. We feel we're very well positioned to be able to monetize and maximize those benefits to the extent that they're applicable.\n\nPeter Faricy -- Chief Executive Officer\n\nYes. I think one thing to mention, Sean, that we've talked about on previous calls, we're really the only residential solar company that's indifferent across financial vehicles. So we offer customers cash, lease and loan. We want them to choose the vehicle that's best for them.\n\nIf this becomes a more lease-heavy business in the U.S. because of the domestic content adder, we really believe we're well positioned to be able to grow our lease business and we've got a very strong loan business, as you know. So we feel like we're in a very good position to take advantage of all of the components of the IRA as we go forward.\n\nSean Morgan -- Evercore ISI -- Analyst\n\nOK. Thanks, Peter and Guthrie. Appreciate it.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Colin Rusch of Oppenheimer & Company. Your line is open.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThanks so much, guys. Can you talk a little bit about the trajectory on energy storage attach rates within the sales process for you guys?\n\nPeter Faricy -- Chief Executive Officer\n\nYes. Yes. So as we talked about in our opening comments, I think we're pleased with our ability to continue to price in our supply chain cost increases on battery storage. But that has had the impact of slowing the growth of battery sales.\n\nSo we're still growing SunVault each quarter. We're selling more and more units every quarter, but our attach rate has sort of flattened out, I would say, a bit from the beginning of the year. And one of the reasons that I think we're not concerned about it is that we have this philosophy of -- we have a desire to have a lifetime relationship with our customers. And battery storage is something that can be added on at any point during the life cycle of a home owning clean energy.\n\nSo if you think about panels, which typically people think about in a 25-year increment. And maybe they think about adding a few, but basically, once they do the first installation of panels, many customers are done. We think battery storage will work very differently. We think increasingly, we'll be able to come back to our existing customer base and be able to offer them incentives to add battery storage over time.\n\nSo I think the attach rate is kind of a good early signal on how attractive batteries are at the time of purchase. But we really believe that we'll still have an opportunity to sell more batteries as we go.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nI appreciate that. And then, if you look at the impact of the IRA on new economics in new geographies. Can you talk a little bit about where you're at in terms of evaluating entrance into new geographies either organically or inorganically?\n\nPeter Faricy -- Chief Executive Officer\n\nAnd when you say new geographies, tell me more about what you mean there?\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nJust in different locations, you're not in the 50 states right now fully, right? I mean, what you're going to be entering into new large markets or expanding presence in particular markets.\n\nPeter Faricy -- Chief Executive Officer\n\nYes. Well, what I would say is we have the highest coverage rate of any residential solar company in the U.S. across the U.S. So we really are in most major markets and most cities and most APIs across the U.S.\n\nI think the IRA will probably allow us to deepen our relationship with new dealers and new customers and some of these underrepresented communities across the U.S. That's where I think it's a really interesting value proposition because the people who probably would benefit the most from the savings of solar, are the people on these underrepresented communities. And I think the Department of Energy and SunPower are both very passionate about how do we help get solar in the hands of those lower income and underprivileged communities faster. So those are areas that I think the IRA will allow us to expand it faster.\n\nGuthrie, do you want to add anything?\n\nGuthrie Dundas -- Interim Chief Financial Officer\n\nYes. I would just say further commentary around ITC adders, obviously, the higher ITC as that becomes clarified, should allow more attractive pricing on a dollar per kilowatt hour basis, which should open up some markets. So that's certainly something that we continue to monitor and expect to increase our aperture going forward.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nAll right. Appreciate it. Thanks.\n\nPeter Faricy -- Chief Executive Officer\n\nThanks, Colin.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Brian Lee of Goldman Sachs. Your line is open.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nHey, guys. Good morning. Thanks for taking the questions. I just wanted to follow up on one of the earlier questions around the growth guidance.\n\nI know, Peter, from hearing all your commentary and the way you're characterizing it, the customer additions guidance, you're keeping it intact, but it sounds fairly conservative, you're going to be at the high end or even beat it. But I just wanted to maybe dig into that a little bit just because when I look at -- even you upsiding your customer adds guidance for the full year, it would imply that things are slowing relative to some of your peers. I mean, your publicly traded peers have both reported and sequential growth, as well as year-on-year growth into 4Q for both those peers seem to be well ahead of what you're implying, even if I assume you beat your guidance. So just wondering, is there anything in the mix or your seasonality or what have you that might be putting you in a different position here into year-end versus some of your peers?\n\nPeter Faricy -- Chief Executive Officer\n\nNo. I think the quick answer is no. I think we were conservative. It's not meant to imply any particular slowdown.\n\nWe gained -- we've gained quite a bit of market share this year. We've outgrown our peers. If I take a look at this quarter, we've outgrown our peers by quite a large margin. And I don't anticipate -- from our point of view, I don't know what our peers will be doing.\n\nBut in Q4, I think our growth will remain healthy. And I think we didn't take up the number, but I think, as I said in the script, we're going to be at the high end or above that customer guidance for the year.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nOK. Yes. No, that's a fair point. You guys have been exceeding peer growth throughout the year.\n\nAnd so, I just thought it was interesting to note that maybe it's not going to be as robust or reverse in 4Q, but I'll take that offline.\n\nPeter Faricy -- Chief Executive Officer\n\nBrian, to give you some more color. If you take a look at the inputs of growth, it comes down to supply and installation capacity. We continue to invest heavily in both. And from an installation capacity standpoint, we're in a position to continue to grow the business pretty strongly in Q4.\n\nAnd so, I think the inputs are there in place and we anticipate having a good quarter from a customer growth point of view.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nOK. That's helpful. And then, I guess from an input perspective, I mean, you guys have done well throughout the year on supply chain. It sounds like you're continuing to do well.\n\nI appreciate the data point around the lease PPA bookings, how much robust growth you saw there. I guess one of the inputs there that all the companies in the space need is obviously capital. So can you give us a little bit more sense of where you stand with respect to tax equity capacity, whether it's in dollars or megawatts? And then, I think historically, you worked with Hannon Armstrong, are you expanding the pool of tax equity players that you're working with now that maybe you're going to see some shift to more PPA and leased product?\n\nPeter Faricy -- Chief Executive Officer\n\nYes. Guthrie, do you want to take that one?\n\nGuthrie Dundas -- Interim Chief Financial Officer\n\nYes, thanks. So we feel very good about our supply of tax equity and other elements in the capital stack of the lease business. We have capacity well into next year and are in discussions to increase that and feel very strong about our ability to fulfill our customer needs through financing. And on the other elements, Hannon Armstrong is obviously a very solid partner.\n\nWe continue to work with them. And see now major changes there, although, obviously, we can explore all avenues as well.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nAll right. Thanks a lot.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Philip Shen of ROTH. Mr.\n\nShen, your line is open.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nHi, everyone. Thanks for taking my questions. Peter, I know you haven't given any guidance for '23. That said, you guys have a relatively long lead business.\n\nSo I was wondering if you could share how you are seeing '23 shape up. Maybe you can talk a little bit about Q1 and 2. And also as it relates to our loan and lease versus cash business. Can you talk about how you expect those segments to shift? Historically, you've made -- or recently, you've made some nice investments in the loan segment.\n\nOur work suggests that for the industry, the loan segment might be slowing down given the rising rate environment. So I was wondering, and you highlighted that your lease growth is nice here. But if you could talk about how you think the '23 overall cash lease versus loan mix evolves, that would be great.\n\nPeter Faricy -- Chief Executive Officer\n\nYes. Thanks, Philip. So on '23, I think it's early to provide any detailed guidance. I'll try to give you a little bit of color.\n\nObviously, at the beginning of next year, we'll give you our guidance for the full year '23. But in this business, we do have a pretty good look at the future as we take a look at the upper part of our purchase fuel. So I'm constantly taking a look at raw leads, appointments and customers who signed contracts with us. And those are leading indicators of how many installations are we going to have as we go forward.\n\nThe other leading indicator, of course, is backlog. And we come into the fourth quarter with another record in backlog, both on Retrofit Homes and New Homes. And I would describe our upper funnel activity is still remaining pretty strong and robust given that the fourth quarter is usually a time where things slow down a little bit. The peak season for customers considering solar is kind of end of Q1 through Q2, beginning of summer.\n\nBut usually by the fall, things begin to slow down, but we actually have had pretty strong bookings demand this quarter. And I think those are the best leading indicators of how things are going to look for Q1 and Q2 of next year. So I read a lot of reports, I understand the logic of why people are worried about slowing growth. But that's why we continue to harp upon this issue of customers are really making rational decisions here because their energy prices are going up so much, they're really interested in getting solar because it's going to save them money.\n\nAnytime you can save somebody money and help them make a big difference in the world, I think you've got a powerful value proposition that has a chance to continue to thrive, and that's kind of how we're thinking about them going forward about it. And then, from a cash lease and loan standpoint, I think we're sort of in line with the industry. It's 80% financed and 20% cash. Our metrics are similar to that.\n\nOf the 80% that's financed this year up until the recent trend on leases, it had really been a loan business. And I think that's seem rational because many customers realize it's a better value for them doing a loan than it is a lease. However, with the IRA and with the increasing likelihood that there'll be incentives tied to leases and PPAs, we do expect that part of the business to become much more attractive for consumers. I think it's probably the area that will allow us to serve some of these underprivileged and underrepresented communities effectively.\n\nAnd so, it's our expectation that we'll probably see more balanced growth between lease and loan with probably lease is growing faster in the short- and medium-term and loans slowing down a little bit during that time. But we still think it's really important. I think this IRA is a really good example of why it's important for our company to be able to be really good at all three. We have a lifetime relationship with consumers.\n\nWe're not trying to gouge them on some lease or loan. We really want to help them afford solar and make the experience so wonderful that they continue to want to purchase products from us over the lifetime relationship that they have with us. So our lease and loan products are competitive in the marketplace, but they're also very consumer friendly and we want to continue to become the world-class leasing loan provider we are through SunPower Financial.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nGreat. You also talked about in your prepared remarks about the U-Series gaining momentum. I was wondering if you could give us some color for next year. What kind of mix do you think your module supply is between Maxeon and then your non-Maxeon modules? I think our work suggests maybe it was -- maybe you have relationships with Aptos and MORI right now.\n\nAnd so, I was wondering if you could help us understand what that mix might look like? And if you have other module vendors that you're working with as well?\n\nPeter Faricy -- Chief Executive Officer\n\nYes. Thank you, Phil. So let me give you a little bit of context, I would love to talk about your question in more detail. So if we go back to earlier this year when we changed our contract with Maxeon, one of the important parts of that change was the one-way exclusivity.\n\nSo Maxeon panels are still exclusive for SunPower, but it gave SunPower the ability to seek other panel suppliers. And the reason that was so important is that we were already worried about getting enough panel production to serve consumer demand and then consumer demand has continued to expand, as you guys know and you can see from our slides, throughout the year. So us having that ability to source from other panel suppliers has been a game changer this year. And to give you some color, in the fourth quarter, 25%-ish of our installations will be panels that are not Maxeon panels.\n\nAnd I will also comment that Maxeon this year has done a terrific job of giving us more supply than was in our contracts. So they have been doing their best to give us as much supply as they can, but it's a panel constrained environment all across the globe. So our ability to source from other panel makers has made a very big difference this year. As you look forward, I think the IRA is going to be a game changer.\n\nIt really is going to encourage global panel makers to invest in the U.S. As you know, we've had these discussions going on with First Solar. I know, Mark, mentioned on his call that they're still really interested in working with us, and we feel the same way. We'd love to expand our relationship with Maxeon.\n\nAnd then, we have negotiations going on with two other large panel makers for a very large supply of high-quality panels that we think are in line with the SunPower brand and our ability to serve both the premium and mass market. But if you take a look at our business for 2023, we'll probably be in a position where 50% plus of our panels are coming from panel manufacturers in addition to Maxeon. And we're very pleased with our Maxeon partnership. But in order to serve consumers, we need supply beyond what Maxeon can provide us, and we're excited to work with a number of other panel makers across the world.\n\nYou may have seen last week, there was this interesting announcement I saw late last week from LONGi about by the end of '22, they're going to have a 22.8% efficiency panel. We're beginning to see more announcements like that across the globe. And so, I think in the position we're in now, we feel like we're going to be in a really positive position to select a couple of good partners to our mix and put ourselves in a great position from the panel point of view.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nGreat. Thanks for the color.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Pavel Molchanov of Raymond James. You line is open.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nThanks for taking the question. You mentioned just a minute ago that there was a tight supply of modules around the world. But when we look at PVinsights weekly price data, it actually shows a pretty sharp decline in selling prices, maybe down 10% over the last eight weeks or so. And I'm curious what you make of that and if perhaps you're seeing some loosening in the supply chain.\n\nPeter Faricy -- Chief Executive Officer\n\nSo I think the -- yes, the important context is you might remember earlier this year when there was the Department of Commerce investigation. That basically stopped from our perspective, all new supply of panels from anywhere around the world. I think it kind of put the panel industry in freeze mode for a number of months. So once that was resolved with this two-year delay, plus the fact that the IRA now is really giving panel makers strong incentives for domestic content.\n\nAnd I think panel makers are beginning to see how strong the residential market is growing across the world, especially here in the U.S. I really think that you're going to see a number of announcements that are going to bring more supply if it was a buyer's -- if it was a seller's market, I guess, earlier this year, it is certainly becoming a little bit more of a buyer's market. I think there's more options available and I think that may also lead to some more attractive pricing.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nOK. And a follow-up supply chain question. In terms of labor availability on the part of your installation partners, are there any parts of the United States where you're experiencing labor shortage or anything along those lines?\n\nPeter Faricy -- Chief Executive Officer\n\nIt's not -- we have not really seen necessarily a regional issue as much as we've seen two things happening. One is the more senior and more experienced installers are always more difficult to find and hire because this is an industry that's growing its capacity rapidly. So there just aren't a lot of people who have experience who are ready to be a crew lead, for example. So that's an issue that we're constantly working on, how do we hire and develop and build a strong team of people who we can promote into crew lead roles all across the U.S.\n\nAnd then, I think like many other industries, we're constantly working on labor costs. And so, those costs continue to rise. And I think we've been able to successfully pass along those costs as part of our prices. But those are the two challenges that I think we're really focused on today.\n\nThey're not necessarily regional challenges. They're more job level challenges and then cost challenges.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nUnderstood. Thanks.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Maheep Mandloi of Credit Suisse. Your line is open.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nHey, guys. Good morning. It's Maheep here from Credit Suisse. One question just on the leasing business.\n\nI appreciate the comments on the growth in that business with IRA. But just curious on the profitability per customer. I think one of the things you talked about was investments in loan origination getting you to that analyst day EBITDA profitability. How does that change with a higher mix of leases versus loans for you?\n\nPeter Faricy -- Chief Executive Officer\n\nSo Maheep, the way we thought about our financial products is pricing the products in a way that we are able to make a similar return between a lease and a loan. And the reason that's important to do is that if you really want to provide the best customer experience, you want to be indifferent between the financial vehicles. You want to let the customer choose the one that's best for them. And we really believe strongly as a tenant of our company that we don't force people into contracts for leases or loans that are unfavorable for them.\n\nWe don't force them into one or the other. We really offer them a choice. And by offering them a choice, you really -- you permit them to figure out for their own financial situation and the ownership of their home and all the other factors they consider, what's the best vehicle. So we will continue to be able to price our leases and loans in a way we believe going forward where we make a very good return on both, but the return on both is meant to be similar over time.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nThat's fair. And then, just a second question on me -- from me is the mix of residential products grew slightly in the quarter versus the last two quarters? Just -- and it's definitely a higher-margin product, but just trying to see how we should think about that mix in '23.\n\nPeter Faricy -- Chief Executive Officer\n\nSorry, can you just clarify that because all of our products right now are residential products. Tell me more about what you're asking.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nNo, the mix of residential products versus systems. So I think residential products with 42% of the total shipments -- residential shipments in the quarter versus 38% in the last two quarters?\n\nPeter Faricy -- Chief Executive Officer\n\nI see. I see. Yes. I think the -- we had talked about it at the beginning of this year, and we had a goal to increase our finance attach rate from 35% of our bookings to 45%.\n\nAs we mentioned, this quarter we achieved 48% or 49% bookings attach rate. So we actually met that goal one quarter earlier than we had planned for. And I think as we go forward, we really believe that we're going to continue to be on a ramp of increasing that attach rate each and every quarter and every year as we go forward until either all or nearly all of all the finance business from our customers uses SunPower Financial. So we're continuing to build a strong product that our dealers like and our customers like.\n\nWe're continuing to offer more and more options for leases and loans across all states. And the path we're on is consistent with what we talked about at the analyst day where we expect to have a very high SunPower Financial attach rate by 2025.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nGot it. Got it. So the systems business should grow product, which is to say cash sales should shrink, that's fair, right?\n\nPeter Faricy -- Chief Executive Officer\n\nI think --\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\n[Inaudible]\n\nPeter Faricy -- Chief Executive Officer\n\nYes, sorry, the cash -- yes, on cash sales, I would say it all depends on what should really -- the growth of that should really be driven by customer demand over time. As you look forward, as we begin to get more mass adoption of solar in the U.S. I don't think the percent that are financed, that 80%, will go lower. If anything, I think it's possible it will go higher because it's still a big ticket item for most people in the United States -- so very big financial decisions.\n\nAnd I think most people feel more comfortable taking it as a lease alone as we go forward.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nAppreciate that. Thank you.\n\nPeter Faricy -- Chief Executive Officer\n\nThank you. We've got time for one more question. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Blum of Wells Fargo. Your line is open.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nGood morning and thanks for squeezing me in here. Just have those few quick questions. I wanted to just go back to the battery attach rate discussion. You mentioned you're kind of flattening out here at least for now.\n\nJust want to understand that better. Would you say that's more of a supply chain issue or is the main bottleneck really installation times, which seems to be one of the main sticking points for the industry right now?\n\nPeter Faricy -- Chief Executive Officer\n\nSo on batteries, two perspectives. First of all, I think the product itself of which I'm a proud owner of, it's a terrific product. It's competitive with the other battery storage solutions that are in the marketplace. But I think the two pieces of the feedback we get are from the consumer side, it is a pretty large adder to an already expensive solar system.\n\nSo our battery costs for consumers are $10,000, $15,000, $20,000. If you buy these whole home batteries, you can get yourself up to $30,000 or $40,000. So it's a pretty big adder on top of your solar system right at the purchase time. So I think that the cost of the batteries today has slowed the attach rate, even though we're still growing our unit sales quarter over quarter.\n\nAs we look forward, I think one of the things we're looking forward to is we believe the next generation of batteries will actually be able to improve our price points quite a bit for consumers. We'll talk to you guys more about that in 2023, and we're looking forward to launching our next-generation battery sometime at the end of next year and the beginning of '24. And then, on the dealer side, I think it is fair feedback that our installation times today are not as good as they could be and not as good as they should be. And that's something that we're continuing to work on.\n\nI think as we architect the next-generation battery, we're very much keeping installation efficiency at the very top of our list of things. We're trying to make sure that we get right as we were with all this new battery.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nGreat. That's really in color. I really appreciate it. Thanks.\n\nThat's all I have.\n\nPeter Faricy -- Chief Executive Officer\n\nOK. Thanks. I want to thank everyone today for their questions and for their time. We're quite excited to try to finish out this year strong.\n\nWe go back, I guess, to our analyst day at the beginning of the year where we pledged to you that we would work hard on delivering consistent results and continuing to improve the financial outlook of the company. We've made some solid progress there, and we're looking forward to sharing our Q4 results with you at the beginning of next year. Thanks, again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Weinstein -- Vice President, Investor Relations\n\nPeter Faricy -- Chief Executive Officer\n\nGuthrie Dundas -- Interim Chief Financial Officer\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nSean Morgan -- Evercore ISI -- Analyst\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nPavel Molchanov -- Raymond James -- Analyst\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nMore SPWR analysis\n\nAll earnings call transcripts"
}