{
  "companyName": "Axsome Therapeutics",
  "companyTicker": "AXSM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/axsome-therapeutics-axsm-q2-2022-earnings-call-tra/",
  "content": "Axsome Therapeutics (AXSM 0.82%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Axsome Therapeutics conference call. I would now like to turn the conference over to your host, Mark Jacobson, chief operating officer at Axsome Therapeutics. Mark, please go ahead.\n\nMark Jacobson -- Chief Operating Officer\n\nThank you, operator. Good morning, and thank you all for joining us on today's conference call. This morning, we issued our earnings press release, providing a corporate update and details of the company's financial results for the second quarter of 2022. And the release crossed the wire a short time ago and is available on our website at axsome.com.\n\nDuring today's call, we will be making certain forward-looking statements. These statements may include statements regarding, among other things, the efficacy, safety and intended utilization of our investigational agents, our clinical and non-clinical plans, our plans to present or report additional data, the anticipated conduct and the source of future clinical trials, regulatory plans, future research and development plans, commercial plans and possible intended use of cash and investments. These forward-looking statements are based on current information, assumptions and expectations that are subject to change and involve risks and uncertainties that may cause actual results to differ materially from those contained in the forward-looking statements. These and other risks are described in our periodic filings made with the Securities and Exchange Commission, including our quarterly and annual reports.\n\nYou are cautioned not to place undue reliance on these forward-looking statements, which are only made as of today's date, and the company disclaims any obligation to update such statements. Joining me on the call today are Dr. Herriot Tabuteau, chief executive officer; Nick Pizzie, chief financial officer; and Lori Englebert, senior vice president of commercial and business development. Herriot will first provide an overview of the company and then review recent developments and upcoming milestones.\n\nFollowing Herriot, Lori will provide a commercial update, and then Nick will review our financial results. We will then open the line for questions. Questions will be taken in the order they are received. And with that, I will turn the call over to Herriot.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThank you, Mark. Good morning, everyone, and thank you all for joining Axsome Therapeutics second quarter 2022 financial results and business update conference call. We are proud to report our first commercial sales following the closing of the Sunosi acquisition in the second quarter. This transition to commercial status is a milestone that few developmental stage companies reach.\n\nAnd we are positioned to potentially rapidly grow our commercial portfolio in the near to intermediate term. This should happen with two NDA stage product candidates that we have as well as five additional Phase 3 stage clinical programs. I will provide an update on our commercial and developmental portfolio before turning it to Lori for a commercial update and to Nick for the financial update. Starting with Sunosi.\n\nWe generated U.S. net sales of $8.8 million for the roughly two months from the close of the acquisition on May 9 to the end of the second quarter. We continue to be excited by the growth potential for this product. Moving on to our NDA stage products, AXS-05 for MDD and AXS-07 for migraines.\n\nWith regards to our NDA for AXS-05 in major depressive disorder, or MDD, we announced that we have entered into labeling discussions with the FDA in late June. We have been pleased with the progress of these discussions. And based on the interactions, we anticipate potential FDA action on the NDA in the third quarter and potentially as early as this month. With regards to AXS-07, following the complete response letter, we recently submitted for Type A meeting with the FDA to discuss our potential approach -- our planned approach to the resubmission of the NDA.\n\nAnd we anticipate that this meeting will occur in the third quarter. The rest of our developmental pipeline continues to progress. With regards to our Alzheimer's disease agitation program, we have amended the relapse criteria for the ACCORD Phase 3 randomized withdrawal study of AXS-05 in Alzheimer's disease agitation. The change was informed by results of an analysis requested by the FDA of data from the previously completed positive ADVANCE-1 trial.\n\nIn order to generate additional data to support the efficacy of AXS-05 in this indication, we're also initiating a new randomized, placebo-controlled parallel group trial, the ADVANCE-2 trial, this quarter. Concurrent with the initiation of ADVANCE-2, we are conducting -- we are concluding the ACCORD randomized withdrawal trial, and we expect top-line results from this study in the fourth quarter of 2022. For AXS-12, our product candidate being developed for the treatment of narcolepsy, enrollment in the SYMPHONY Phase 3 trial is progressing, and top-line results were anticipated in the first half of 2023. For AXS-14, our product candidate for the treatment of fibromyalgia, manufacturing and other activities related to the planned resubmission -- to the planned submission of the NDA are ongoing, and we expect to submit the ND for this product in 2023.\n\nWith regards to a new indication for Sunosi, we recently announced our plans to develop solriamfetol for the treatment of ADHD. We anticipate initiating a pivotal trial of solriamfetol in adults with ADHD in the fourth quarter. I will now turn the call over to Lori, who will provide a commercial update.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nThank you, Herriot, and good morning. The U.S. portion of the Sunosi acquisition from Jazz Pharmaceuticals was completed on May 9, and as previously reported, the transition was seamless with no disruption to patients. We are extremely proud of the efforts made by the team in such a short amount of time to achieve this significant milestone for Axsome.\n\nAt the time of completing the acquisition, Axsome conveyed approximately 75 employees from Jazz of which the majority were sales rep. Axsome's digital-centric commercialization platform plays a significant role in our commercial strategy for Sunosi and is already enabling a highly productive sales force. The Sunosi deal was announced on March 28, and the U.S. portion was completed on May 9.\n\nAs such, Q2 had the potential to be a highly disruptive quarter. However, new prescription volume during this period was maintained, and total prescription volume grew 7% quarter over quarter, reflecting effective execution and underlying strength of the Sunosi business. The EU portion of the close is scheduled to occur in the second half of the year. As a reminder, Sunosi is the first and only FDA-approved, dual-acting DNRI to treat excessive daytime sleepiness, or EDS, in adults with narcolepsy or OSA.\n\nWe believe that the clinical benefits of Sunosi provide meaningful differentiation in the marketplace for both OSA and narcolepsy patients who are suffering for EDS. Currently, Sunosi has a 2% patient share in drug-treated OSA patients and a 7% patient share in drug-treated narcolepsy patients. The opportunity for growth remains substantial, and I look forward to communicating the results of Axsome's first full quarter with Sunosi during our Q3 earnings call. Regarding AXS-05 launch preparations, the team remains focused in anticipation of a potential launch.\n\nWe have incorporated learnings from commercializing Sunosi, including utilizing our DCC platform, and are prepared and ready to commercialize, if approved. I will now turn it over to Nick, who will review the financials.\n\nNick Pizzie -- Chief Financial Officer\n\nThank you, Lori, and good morning, everyone. Today, I will discuss our second quarter results and provide some financial guidance. We ended the quarter with approximately $73.4 million in cash compared to roughly $86.4 million at the end of the previous quarter. During and subsequent to Q2, we accessed our existing ATM facility, receiving net proceeds of approximately $41.8 million, resulting in a pro forma cash balance of $102 million.\n\nMoving to the P&L. Sunosi net sales for the quarter in the United States was $8.8 million. As a reminder, the completion of the acquisition of Sunosi for the U.S. territory was completed on May 9, and the $8.8 million in net sales relates to the time period of May 9 through June 30.\n\nR&D expenses were $15.8 million for the three months ended June 30, 2022, and $14.5 million for the comparable period in 2021. The increase was driven by personnel expense and costs associated with ongoing clinical trials. SG&A expenses were $31.2 million for the three months ended June 30, 2022, and $16.3 million for the comparable period in 2021. The increase was primarily related to commercial activities for Sunosi, pre-commercial activities for our late-stage pipeline assets and personnel expense, along with an increase in non-cash stock compensation expense.\n\nNet loss was $41.4 million, or $1.06 per share, for the three months ended June 30, 2022, compared to a net loss of $32.3 million, or $0.86 per share, for the comparable period in 2021. The net loss for the current period included $10.2 million of non-cash stock compensation expense compared to $5.5 million in the comparable period. Regarding the Sunosi acquisition, the preliminary accounting of the acquisition of Sunosi is included in our Q2 2022 financial statements. To date, we have performed a preliminary fair value analysis of the business combination.\n\nThe final determination of these fair values will be completed as soon as possible, but no later than one year from the acquisition date. We believe that our current cash balance, along with the remaining committed capital from the $300 million term loan facility with Hercules Capital, is sufficient to fund anticipated operations into 2024 based on our current operating plan, which includes the commercialization of Sunosi and the potential launch of AXS-05 in MDD, if approved, along with continued development of our pipeline. That concludes our second quarter 2022 financial review. I will now turn the call back to Mark to lead the Q&A discussion.\n\nMark Jacobson -- Chief Operating Officer\n\nThank you, Nick. Operator, may we please have our first question?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Charles Duncan with Cantor Fitzgerald. Your line is now open.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nGood morning, Herriot and team. Congrats on the progress with Sunosi this quarter, and thanks for taking our question. I wanted to ask you about Sunosi, but I need to ask you about AXS-05, because I'm kind of wondering what's taking so long. But first of all, before I get to that, regarding AXS-05, I guess I wonder if there are any terms within the Hercules facility that you can talk about and suggest that, that is negotiable should the, call it, black swan happen and there's a CRL that is granted or given for AXS-05.\n\nCan you renegotiate that term loan and therefore, access to capital?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nHey, Charles. Thanks for the question. With regards to the term loan facility for Hercules, as you know, it's a $300 million facility. And what's interesting with the Sunosi acquisition is that some of those tranches are actually your sales base, company sales-based.\n\nSo we'd still potentially have access to some of the additional tranches. And in addition, there is a significant proportion of the loan facility which is at the discretion of Hercules. Now, our financial guidance does incorporate all those scenarios. And I'll turn it to Nick to provide more color, but in the black swan event that you're referring to -- and I will say that with regards to that characterization, I think it is accurate.\n\nWe would be -- we're very confident in the package that we put together for AXS-05 in terms of the efficacy and safety. However, we do plan for all scenarios, and we would be ready for that. But in the case that, that happens, then a lot of the spend, which currently we've modeled for the launch of AXS-05, that would naturally go away and, therefore, reduce our operating cash needs. But I'll turn it over to Nick to comment.\n\nNick Pizzie -- Chief Financial Officer\n\nYeah. I think, Herriot, you commented on the majority of it. Just to give baseline to everybody, there's $100 million is available upon -- or $100 million is tied to the AXS-05 approval. Additionally, there's another tranche, a $50 million tranche that is tied to the sales-based performance tranche as Herriot stated, and it's a measure of debt to trailing three months.\n\nSo that would still be available to us in the black swan event that you're referring to, Charles. And just to restate what Herriot mentioned as well. In the event of a CRL, obviously our spend will decrease. As you're aware, there's significant launch spend that would be required for AXS-05.\n\nThat spend would go away, and obviously we would not have access to the $100 million tranche right away. However, we still believe our cash runway will take us into 2024.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nOK. And I'm generally not a black swan guy. So forgetting about that, even considering the alternative, which is AXS-05 is approved here in the near term, would you be able to launch it within a reasonable period of time, let's say, by the end of this year or early next year? And then could you give us a sense of how many of the reps that are currently marketing Sunosi would have overlap and be able to market AXS-05 as well?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYeah, I think those are questions for Lori.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nHey, Charles. Thanks for the questions. So we will provide guidance upon potential approval that we'll launch within a quarter of approval. And regarding the reps, so right now, we currently have and are aligned to 75 territories for Sunosi.\n\nThose 75 reps are covering about 12,000 HCPs who are high potential prescribers for both OSA and narcolepsy in patients who are suffering with EDS due to those conditions. I'm pretty adamant about keeping our sales force separate at launch so that AXS-05 sales force can focus and really drive the adoption of the product at launch, but there is high overlap and a lot of synergy, as we've mentioned before and as you're alluding to. So when the time is right, we will start overlapping, consider overlapping the two sales forces in terms of call points. But I really want to keep everyone focused, really want to turn -- continue to drive Sunosi sales up with a focused sales force and the same for AXS-05.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nLast quick question on Alzheimer's agitation, regarding potential data yet this year. Can you give us a sense of the number of patients that might be included in that? And will it be a milestone analysis, say, a look at data at a certain time point? Or what would really drive that additional data that you could present later on this year? Thanks.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo with regards to the milestone analysis, remember, this is a randomized withdrawal study. So it's not -- it would not be milestone-driven from the perspective of a time point. So we will actually look at the difference in relapse rates or the time to relapse between the two groups, AXS-05 and placebo. For the number of patients who will be in that analysis, we will disclose that at the time that we announce the results.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nThanks for the reminder, Herriot. But would -- can you give us a sense of what percentage of patients you'd like to include in that? I mean, without actual numbers once you launching it?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nAll the patients [Inaudible]\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nOK, thanks for taking the questions. We'll follow-up.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSure.\n\nOperator\n\nOur next question is from Marc Goodman with SVB Securities. Your line is open.\n\nUnknown speaker\n\nHi. Thanks for taking my questions. This is Rudy on the line for Marc. I have couple questions for X-05.\n\nSo first, I want to ask about the NDA in depression. Just wondering how much back and forth has there been on the proposed label, since labeling on the post-marketing proposal discussions have been ongoing for six weeks and more than three months, respectively? I mean, all this typically takes two to four weeks. So specifically, what are the FDA's continued issues and pushback now with the application and the label?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo the guideline of four to six weeks that you provided for labeling discussions, I think maybe that's an average. And I know that that's typically what folks state, however, we don't have any control over the FDA's process. The part of it that we can control, which is to make sure that we're responsive and collaborative, that we have done. As I said, we're very pleased with the way that the negotiations have been ongoing, have been going thus far and we look forward to an FDA action in the near term.\n\nMark Jacobson -- Chief Operating Officer\n\nCan I have one follow-up here? Rudy, you had asked about the post-marketing commitments and requirements and those ongoing for three months. Those are not ongoing. As we previously mentioned, we reached agreement on the PMCs and PMRs with FDA. So just to separate those two, I just wanted to clarify that.\n\nAnd this is Mark, by the way.\n\nUnknown speaker\n\nYup. Got it. Thanks for clarifying. And I have a follow-up for Alzheimer's agitation.\n\nIt sounds like we're starting another pivotal trial, ADVANCE-2. Did the FDA ask for that study? Is that trial required for filing? And can you provide more color on the time line for that trial? Thank you.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo starting that trial, it reflects our desire to make sure that we have as strong as possible of a data package when we submit the NDA for Alzheimer's disease agitation. As you know, no product has been approved yet for this indication. So what we can do is make sure that we incorporate learnings where we can get them. As you know, there's been recent FDA action on a competitor product in another neurobehavioral symptom, Alzheimer's disease with psychosis.\n\nSo we watch that very carefully and try to incorporate any learnings there into our clinical program. So we want to make sure that -- so while this new study technically would not be required for an NDA filing in Alzheimer's disease agitation, assuming that the randomized withdrawal study, let's say, is positive, we think that it's prudent to have more than one shot on goal and to have two studies, both of which are parallel group that would replicate each other.\n\nUnknown speaker\n\nSo let's say the ACCORD study is positive, too, then we're going to file. We won't wait for ADVANCE-2, right?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo assuming that we have a data package that we think is adequate, what we would then do is have a pre-NDA meeting with the FDA. And after that meeting, we'd be able to tell you whether or not the FDA believes that we should go ahead and file.\n\nUnknown speaker\n\nGot it. It's very helpful. Thank you.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question is from Joon Lee with Truist Securities. Your line is now open.\n\nUnknown speaker\n\nGood morning. This is Olson on for Joon. Thanks for taking the questions. Our first question is, given known drug-drug interaction with bupropion, do you think patients currently on antidepressants will need to be washed out of existing drug before they can be on AXS-05? And how do you envision patients on standard antidepressants could be transitioned to AXS-05? And I have a follow-up.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThank you for the question. Drug interactions are not unique to AXS-05. It's just that we are leveraging a particular drug-drug interaction to improve the pharmacokinetics of the NMDA receptor antagonism of AXS-05. However, a lot of drugs do have drug-drug interactions, and there are sections in every package insert with regards to those drug-drug interactions, advising clinicians how to navigate that.\n\nAnd it's something that clinicians are able to do. Other antidepressants also have drug-drug interactions. And it is typical to make sure that the patients are washed out of one treatment before putting them on another treatment. This is something that clinicians, psychiatrists in particular, are very familiar with.\n\nUnknown speaker\n\nOK, thank you for that. And then just on the labeling discussions for 05, have you had any more interaction with the FDA since you first disclosed labeling discussions? And if so, were items such as REMS part of that discussion?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nWe have had additional interactions. As we mentioned, we've been in labeling discussions with the FDA. And with regards to other aspects of what has been discussed as part of those negotiations, we will not comment on that. As you can imagine, it would be inappropriate at this stage.\n\nUnknown speaker\n\nOK, thank you.\n\nOperator\n\nOur next question comes from Yatin Suneja with Guggenheim Partners. Your line is now open.\n\nYatin Suneja -- Guggenheim Partners -- Analyst\n\nHey, guys. Thank you for taking my question. Two for me. Could you give a little bit more color on a Sunosi launch in terms of how should we think about the performance in Q3? Are you in a position to provide some sort of guidance going forward and at what point you might be able to provide that? So that's one.\n\nAnd then the other question I have is on the abuse liability for 05. Could you just talk about the -- is FDA comfortable with your -- with the lack of abuse liability data? Because if you read the guidance for CNS drug, they definitely require some sort of abuse liability work. So just trying to get some sense there. Thanks.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYeah, so I'll answer the abuse liability question. You are correct that all CNS active drugs are required to assess the potential of those drugs for abuse liability. However, how that's done really depends on the compound and if any signals had been seen in clinical trials. So as part of our NDA, we did have to do that assessment.\n\nAnd as we've said in the past, that has been done. And I'll turn it over to Nick and Lori to answer your questions regarding Sunosi.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nSo I'll quickly just kind of give you some data points that help give some color around performance so far from the Sunosi acquisition, and then I'll toss it over to Nick in terms of guidance. So we're still very much learning and assessing the market post the transition. And as I mentioned earlier, we've aligned the 75 territories, and the reps that are currently out promoting now are really incredibly high-caliber sales force. And they are generating productivity levels of sales forces 1.5x to 2x the size that they are right now.\n\nWe believe that a lot of that has to do with the underlying momentum from Sunosi as well as being able to effectively execute through DCC. So really proud of what the team was able to do in terms of potentially facing a very disruptive quarter. And as I mentioned in the prepared remarks, quarter-over-quarter growth was 7%, which really is impressive given what could have happened during a highly disruptive quarter. I'll toss it over to Nick for guidance.\n\nNick Pizzie -- Chief Financial Officer\n\nYes. Thanks, Lori. The quarter, as Lori mentioned earlier, could have been extremely disruptive. As I stated in the opening remarks, we had $8.8 million in net sales.\n\nThat was actually 22% year-over-year growth in scripts. So highly satisfied with how the transition's taken place so far. As a reminder, on our Sunosi webcast that we had just a couple of months ago, we believe the EDS market in OSA and narcolepsy has the potential to have peak sales in the $300 million to $500 million range. At this point, we're not -- we won't be able to give guidance for the rest of the year as we're still learning, but obviously a very positive transition thus far.\n\nOperator\n\nThank you. Our next question comes from Jason Gerberry with Bank of America. Your line is now open.\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my question. I just wanted to come back to the cash question. I'm a little confused.\n\nSo it seems like you're unlikely at a point where some sort of Sunosi sales threshold maybe triggered more access to the Hercules facility. So just trying to understand, I think you -- you're burning like $40 million a quarter. With the Sunosi fully kind of in the numbers going forward, that would seem like that's going up. So can you just -- absent the AXS-05 approval, just trying to understand how you kind of work through the end of the year on the existing cash dynamics.\n\nAnd then on the AD agitation update, I'm just curious, why not start the new trial sometime in fourth quarter after the randomized withdrawal update, presuming if that randomized withdrawal study update could facilitate approval and the cash is dire, or dear, for you guys? Why not wait to see if that could facilitate approval before starting another study? Thanks.\n\nNick Pizzie -- Chief Financial Officer\n\nYeah, so related to the Sunosi comment, so I guess maybe a little bit of background on Sunosi. The guidance that we previously stated and feel comfortable to state is that we do expect a small loss in the sub period this year, Jason, and then for Sunosi to actually be accretive next year. And based on the sub performance for Q2, we're pretty excited about that. Additionally, as it relates to Hercules and the tranche, with the debt that we've taken down and our trailing three months sales, or anticipated trailing three-month sales, we're actually approaching where we would be able to utilize the tranche for a $50 million.\n\nSo access to the Hercules facility would be available potentially next year. I'll turn it over to Herriot to answer the other question. And actually, yes, one last -- one other comment that you made related to burn. Burn, I think you had mentioned somewhere around $40 million.\n\nOur average four months cash burn has actually been closer to $30 million. So I just wanted to clarify that.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nAnd then with regards to the question around the start of the Alzheimer's disease agitation trial. So we -- what we want to make sure that we do is continue our history the way that we do things of rapidly developing our product candidates. So it makes sense for us to start that study sooner rather than later. So we made the determination, and guess what? We're on track to start that study actually this quarter.\n\nSo we're very proud of that. And in terms of waiting until the fourth quarter, remember, the study that we are launching, which is a parallel-group trial, we have a lot of information to guide us to the design of that study. And this will be essentially a repeat of our positive ADVANCE-1 trial. So we'll take the learnings from that, and that will allow us to make sure that we tweak where needed the design of the current study -- of the new study.\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nGot it. OK, thanks, guys.\n\nOperator\n\nOur next question comes from Ram Selvaraju with H.C. Wainwright. Your line is now open.\n\nUnknown speaker\n\nThis is Boobalan dialing in for Ram Selvaraju, and thanks for taking my question. So we have a couple of questions. So firstly, is there anything that you could provide with respect to AXS-05 with a sustainable competitive advantage versus other antidepressants in the later clinical stages of development?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nWell, I think, first of all, it's important to compare AXS-05, our data in AXS-05 to -- it's important to compare that to actual Phase 3 data with other product candidates. So to the extent that other product candidates have not generated that data, it's hard for us to comment. What we can speak about is the clinical profile of AXS-05 that we've demonstrated now in four different clinical trials, at least, and also with long-term data that goes out to one year. What have we seen? What we've seen is that there's a rapid antidepressant effect, which remember was highly statistically significant in week 1 with the GEMINI trial.\n\nThat was accompanied not just by symptom improvement, but also by an improvement in quality of life, which was statistically significant at week 1. So the drug is making patients feel better, but it's also helping them to function better very rapidly. And that's not been seen before with an oral antidepressant. Secondly, the magnitude of effect is very large with AXS-05, and it's -- so the treatment difference increases over time with AXS-05.\n\nIt's also important to look at our remission data where there was more than a 2-fold increase in remission at week six as compared to placebo in that study. So you have a drug that works incredibly well, objectively, with regards to magnitude of effect that has a rapid onset and also which is durable. And then lastly, the drug was incredibly well tolerated from our perspective. And remember, this is a novel mechanism of action.\n\nSo it's nice to have a novel mechanism of action. But when that new mechanism of action actually translates to clinical benefit, then it really tells clinicians, hey, there's something new that should be considered in trying to treat patients who are not responding to current treatments. And as a reminder, the percentage of patients who don't respond well to current treatments is nearly 70%.\n\nUnknown speaker\n\nThanks for the detailed color. So with respect to ex-U.S. commercialization activities, what are your updated thoughts on this? And how do you plan to optimize the value of your assets?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo it's always been our stated corporate objective to out license our product candidates for ex-U.S. markets while we focus on the U.S. With the Sunosi acquisition, though, we have now become a global biopharmaceutical company, and there are sales of Sunosi ex-U.S. which are growing.\n\nWe did not comment on that portion of the business this quarter because we have not yet closed on the ex-U.S. portion of the acquisition. That may inform our strategy going forward, whether that we use more robust business development ex-U.S. or another tack now that we actually do have some infrastructure ex-U.S.\n\nUnknown speaker\n\nGreat. One final question from me. So you're stepping into ADHD. As you may know, this is a decently crowded indication.\n\nSo just would like to hear your thoughts, what's your value proposition here? And what are some of the unmet needs that you're planning to address with Sunosi?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo we're very excited by the clinical profile of Sunosi as it relates to a potential -- potentially -- or potential effect in ADHD. However, we want to make sure that we don't jump the gun here. We want to run the clinical trial and to see what the results are. In terms of what the value proposition is, there is a lot of unmet need in ADHD.\n\nAs you know, most of the drugs that are currently available are highly scheduled drugs. And the ones that are not highly scheduled do not have a large treatment effect. So I think there is value here potentially with Sunosi, should the results in ADHD match the results in EDS. And what I mean by that is if you look at the results for Sunosi in EDS, the treatment effect is very large.\n\nIn fact, it's larger than other wake-promoting agents. And so you have this large effect size. So hoping that we might see that in the ADHD trial, and we're looking forward to initiating that study in the fourth quarter.\n\nUnknown speaker\n\nThanks. Thanks for taking our questions.\n\nOperator\n\nOur next question is from Joseph Thome with Cowen. Your line is now open.\n\nJoseph Thome -- Cowen and Company -- Analyst\n\nHi, there. Thank you forr taking my question. First one on the depression review, and then I'll have a follow-up on Alzheimer's agitation. But on the current review, I know you mentioned that you're encouraged with the progress of the labeling discussions.\n\nMaybe can you provide just a little bit of context on kind of what's inspiring that encouragement? Are you currently waiting for the FDA, or are they waiting for analysis or any data from you? And then last part on this. What would constitute sort of a disclosable release to investors from the review? Is the next thing we're going to hear a decision, or is there any potential kind of intermediate steps before that point?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo we said that we've been pleased with the progress of those negotiations. And I think one, we're pleased that we did enter into labeling negotiations. And we're pleased because there has been interactions with the FDA with regards to the label, and that is progressing. The next disclosable event that we anticipate would be an FDA action.\n\nJoseph Thome -- Cowen and Company -- Analyst\n\nOK, perfect. And then on the Alzheimer's disease agitation, in the PR it does mention that you amended the relapse criteria for the ACCORD study. Are you able to give a little bit of context as to how that changed? And then with the parallel control group trial, was this something that the FDA suggested or something that you and the team thought would be helpful to round out the profile?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYes. It's something that we thought would be helpful in the context of looking at the experience with the development of drugs in neighboring indications in Alzheimer's disease. And with regards to the relapse criteria question, what we were able to do, at the suggestion of the FDA, was to look at the results from the ADVANCE trial, which were positive, and there was a lot of data to be mined there, and particularly looking at the how one would look at clinical meaningfulness with the various scales. And so that informed the change in the relaxed criteria so that they're consistent with the results of the ADVANCE-1 trial.\n\nJoseph Thome -- Cowen and Company -- Analyst\n\nOK, thank you very much.\n\nOperator\n\nOur next question is from Graig Suvannavejh with Mizuho Securities. Please proceed with your question.\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nThank you very much and good morning. Thank you for taking my question. As I'm relatively new to the name, just on AXS-12 for narcolepsy, could you just remind me what the TPP is and how you expect to position that relative to Sunosi? And then separate on Sunosi and ADHD, could you just remind me what the dosing is especially relative to that in EDS and OSA and narcolepsy? And if it's different, is there a potential for an alternative prescription branding strategy?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThanks for those questions. With regards to AXS-12, in our CONCERT trial, we demonstrated that AXS-12 had a profound effect on cataplexy, but not just that, but also excessive daytime sleepiness. And the other measure that was interesting in that study was cognition. We showed that there was a rapid improvement in cognition.\n\nSo for those reasons, AXS-12 has a very interesting TPP. With regards to comparing it to the Sunosi, as a reminder, Sunosi -- while Sunosi is approved to treat patients who have narcolepsy, it's approved for patients -- for the treatment of EDS in patients with narcolepsy. So there is no -- it does not have an effect on cataplexy. So that's the difference between the 2.\n\nAnd with regards to the dosing of Sunosi in ADHD, we have not disclosed the dose that we are going to be studying in the Phase 3 trial, but we look forward to disclosing that once we announce the initiation of that study.\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Chris Howerton with Jefferies. Your line is now open.\n\nChris Howerton -- Jefferies -- Analyst\n\nGreat. Lots of great question so far. Thanks for taking some for me. Two for me.\n\nOne, first on 05. With respect to the potential label and approval, what are the company's thoughts around the likelihood of a REMS? And if you think about the potential drug-drug interactions that were already mentioned previously, would there be an anticipation of any sort of warning label or restriction or contraindication of those medications, like beta blockers or antihypertensive, for example? The second question I have is, again, related to the Alzheimer's disease relapse. One of the concerns that was brought up in the neighboring indication was the autocorrelation with respect to within-subjects designs. So curious if you could comment around the clinical meaningfulness of the view of the FDA from your perspective of the randomized withdrawal data as opposed to the parallel design that you just announced.\n\nThank you.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThank you for the questions. I think all those questions around the label are reasonable questions to ask. And we will refrain from answering those questions given where we are in the stages -- given where we are in the labeling discussions with the FDA. And with regards to -- could you repeat the question as it relates to the neighboring indication?\n\nChris Howerton -- Jefferies -- Analyst\n\nAbsolutely, yeah. Thank you. So one of the concerns was the interpretation of the clinical meaningfulness of the within-subjects design for the randomized withdrawal. And so I'm curious if that was a driver of the clinical meaningful discussion.\n\nAnd if you could comment on the robustness of that type of design relative to the parallel design. Thank you.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYeah, that's a really good question, and that is one of the limitations of a randomized withdrawal design. So the randomized withdrawal design does a very good job of demonstrating that the drug works, and so it is a control design. But with regards to answering that particular question, you -- that particular question is best answered with a parallel-group design. Now we demonstrate -- now we have parallel group data with the ADVANCE-1 trial.\n\nThe FDA does typically like to see two studies. We -- again, we're not initiating this new trial because we think that it is absolutely needed. But we want to make sure that we approach the NDA filing in a position of strength, especially given that this is an indication for which no product has been approved.\n\nChris Howerton -- Jefferies -- Analyst\n\nOK. Thanks so much for taking the question.\n\nOperator\n\nOur next question comes from Matt Kaplan with Ladenburg Thalmann. Your line is now open.\n\nMatt Kaplan -- Ladenburg Thalmann and Company -- Analyst\n\nHi. Good morning, and thanks for taking the questions. I just wanted to dig into AXS-07 a little bit. Where are you with respect to addressing the CMC questions detailed in the CRL? And when do you think you could resubmit the NDA?\n\nMark Jacobson -- Chief Operating Officer\n\nHey, Matt. It's Mark. So as you can imagine, the team is doing its work in the background. The CMC team is doing its work following the CRL.\n\nAnd this morning, we did announce that we've requested and submitted a request for a Type A meeting with FDA. And what we plan to do is once that meeting is held, which we would expect this quarter -- we'd expect it to be held this quarter. Once it's held, then we'll be able to -- we'll be in a position to provide a clear update for our expectations around timing of the resubmission and if there are any nuances about the package or anything like that. But right now, it's status quo in terms of the last update where we think everything is addressable, and that we either have the information on hand or are able to -- in a position to provide it prior to our, or in connection with, our resubmission.\n\nSo we'll hopefully have more for you in the not-too-distant future.\n\nMatt Kaplan -- Ladenburg Thalmann and Company -- Analyst\n\nOK, great. That's very helpful. And then just a quick follow-up on your plans in ADHD for Sunosi. Is it your expectation that a single Phase 3 pivotal study in that indication could suffice for filing a supplemental NDA?\n\nMark Jacobson -- Chief Operating Officer\n\nWe anticipate that two studies will be needed. So the first study is in adults. And assuming that, that study is positive, we will then conduct a pediatric study.\n\nMatt Kaplan -- Ladenburg Thalmann and Company -- Analyst\n\nOK. Great. Well, congrats on the progress during the quarter.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThanks. \n\nOperator\n\nOur next question comes from Vikram Purohit with Morgan Stanley. Your line is now open. At this time, there is no response. We will move on to the next question.\n\nOur next question comes from the line of Myles Minter with William Blair. Your line is now open.\n\nMyles Minter -- Morgan Stanley -- Analyst\n\nHey, everyone. Thanks for taking the question. Just the first one on 05. I know when you announced agreement to the post-marketing commitments you guided, you'd expect a decision in the second quarter on the filing.\n\nYou then announced you received a proposed label and didn't state anything about that timing guidance. And now you're coming on the call saying that it could be this month. So my question is, what -- or was there an aha moment or something that gets you back on a regulatory time line that's happened in between your first initial disclosure that you'd received a proposed labeling and the discussions that you've had since then? Or is it more just you're pleased and, therefore, you think it's coming maybe this month? Thank you.\n\nMark Jacobson -- Chief Operating Officer\n\nHey, Myles. It's Mark. So we did comment we're pleased on the overall status. And related to that, providing the guidance here or estimate of potential action is our sense of the current status of the process and where we think we are.\n\nJust to be clear, though, FDA has not told us they plan to take action on a certain date. So we don't have that. It's based on our read of the information that's available to us in totality and that's what we're providing to you.\n\nMyles Minter -- Morgan Stanley -- Analyst\n\nOK. So just to clarify, it sounds like it wasn't like a specific event in your back and forth discussions. It's more the totality of how those discussions are going that kind of gives you the confidence to give this timing guidance.\n\nMark Jacobson -- Chief Operating Officer\n\nYeah, so there is, of course, a choreography where there's back and forth and things like that. And it's our read of -- it's our holistic read of where we are.\n\nMyles Minter -- Morgan Stanley -- Analyst\n\nOK. OK. That's helpful. And then just on the ADVANCE-1 additional analysis that was requested by the FDA, they gave you breakthrough therapy designation for that product in the indication way back in 2020.\n\nAnd that was after they reviewed the ADVANCE-1 trial, and I think in your words, you'd be able to use that as a pivotal study. So what additional information did they request from that trial after they'd given you all these designations and looked at the trial initially. Thanks.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYeah, because there is no product that's been approved to treat Alzheimer's disease agitation, there isn't also a ton of data on a lot of the scales that are being used in the assessment of the disease. So from that perspective, the data from the ADVANCE-1 trial are pretty special, and there's a lot of information that can be mined from those data. And I think that's the source of the suggested analyses, and we found those useful. And you're right; the ADVANCE-1 trial was the basis for the breakthrough therapy designation.\n\nAnd it's been great, because with the breakthrough therapy designation, that does allow us to have a lot of contact with the FDA and get their thoughts, which is especially valuable in a situation where we are doing pioneering work, and so guidance from them is welcome.\n\nMyles Minter -- Morgan Stanley -- Analyst\n\nOK. Final one for me is just, I guess, we're having this clinically meaningful discussion about endpoints here. Is ADVANCE-2 going to have the CMAI as the endpoint, the Cohen Mansfield?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYes, it will.\n\nMyles Minter -- Morgan Stanley -- Analyst\n\nCool. Thanks for the questions.\n\nOperator\n\nThank you. We'll take our final question from David Hoang with SMBC. Your line is now open.\n\nDavid Hoang -- SMBC Nikko Securities -- Analyst\n\nHey. Good morning, everyone. Thanks for fitting me in and taking some questions. So I just had a couple.\n\nI think first one for me on 05. This may have been a while ago, but based on the study populations enrolled in the 05 trials, I think there was -- your thinking was that the base case for a label would be major depressive disorder, MDD pretty broadly. Any reason to think differently now? Would there be any thought that the population could be narrower, or any qualifiers or such specified in the label?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYeah. Thanks for the question. What we've disclosed is that the NDA that we filed was for major depressive disorder. And with regards to what will be in the label, as we stated before, it'd be inappropriate for us to discuss anything about the label at this stage.\n\nDavid Hoang -- SMBC Nikko Securities -- Analyst\n\nOK. Understood. And then I had one just around the different tranches from your term loan. If I heard correctly, one is obviously based on 05 approval.\n\nThere's another based on some sales milestones. And then I think there's one more that is sort of at the lender's discretion. Can you comment as just to the -- that last tranche, if I have it correctly, what stipulations or covenants are attached to that? Anything you can share? And what is the amount there?\n\nNick Pizzie -- Chief Financial Officer\n\nYes, that's just actually a general tranche that -- I'm sorry, this is Nick speaking. It's a general tranche that is at the lender's option that we would have the ability to request based on business needs.\n\nDavid Hoang -- SMBC Nikko Securities -- Analyst\n\nOK, great. Well, thanks for taking the question.\n\nOperator\n\nThank you. That ends our question-and-answer session. I would now like to pass the conference back to management for closing remarks.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nWell, thank you again for joining us on the call today. This is an exciting time for Axsome as we have transitioned to commercial stage and are looking forward to continuing this momentum with our two NDA stage product candidates and five Phase 3 stage clinical programs. We are committed to bringing potentially life-changing medicines to people living with serious CNS conditions. We look forward to updating you over the coming months on our continued pipeline and commercial progress.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Jacobson -- Chief Operating Officer\n\nHerriot Tabuteau -- Chief Executive Officer\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nNick Pizzie -- Chief Financial Officer\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nUnknown speaker\n\nYatin Suneja -- Guggenheim Partners -- Analyst\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nJoseph Thome -- Cowen and Company -- Analyst\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nChris Howerton -- Jefferies -- Analyst\n\nMatt Kaplan -- Ladenburg Thalmann and Company -- Analyst\n\nMyles Minter -- Morgan Stanley -- Analyst\n\nDavid Hoang -- SMBC Nikko Securities -- Analyst\n\nMore AXSM analysis\n\nAll earnings call transcripts"
}