{
  "companyName": "Toast, Inc.",
  "companyTicker": "TOST",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/toast-inc-tost-q3-2022-earnings-call-transcript/",
  "content": "Toast, Inc. (TOST 0.45%)\nQ3 2022 Earnings Call\nNov 10, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Daniel, and I will be your conference operator today. At this time, I would like to welcome everyone to the Toast earnings conference call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions] Thank you. I'll now turn the call over to Michael Senno, vice president of investor relations and strategic finance. You may begin your conference.\n\nMichael Senno -- Vice President of Investor Relations and Treasury\n\nThanks, Daniel. Welcome to Toast's earnings conference call for the third quarter ended September 30, 2022. On today's call are CEO, Chris Comparato; and CFO, Elena Gomez, will open with prepared remarks. They will then be joined by our COO, Aman Narang, for our Q&A session.\n\nBefore we start, I'd like to draw your attention to the safe harbor statement included in today's press release. During this call, we'll make statements related to our business that may be considered forward-looking within the meaning of the Securities and the Exchange Act. All statements, other than the statements of historical facts are forward-looking statements, including those regarding management's expectations of future financial and operational performance and operational expenditures, expected growth rates of certain metrics estimated timeline for future profitability, future profit and margin outlook, and our financial guidance for the fourth quarter and full year 2022. Forward-looking statements reflect our views only as of today, and except as required by law, we undertake no obligation to update or revise these forward-looking statements.\n\nPlease refer to the cautionary language in today's press release and our SEC filings for a discussion of the risks and uncertainties that could cause actual results to differ materially from our expectations. During this call, we will discuss certain non-GAAP financial measures. These non-GAAP measures are not intended to be a substitute for our GAAP results. Please refer to our earnings release, the accompanying Investor Presentation and SEC filings for detailed reconciliations of these non-GAAP measures to the most comparable GAAP measures.\n\nUnless otherwise stated, all references on this call to cost of revenue, gross profit, and gross margin, selling and marketing expense, research and development expense, and general and administrative expense are on a non-GAAP basis. Finally, both the press releases and a replay of this call, including the accompanying investor presentation, will be available on our Investor Relations website at investors.toasttab.com. With that, let me turn the call over to Chris.\n\nChris Comparato -- Chief Executive Officer\n\nThank you, Michael, and good afternoon, everyone. Before I jump in, I'm going to apologize up-front for any coughing outburst or sips of hot tea as I'm recovering from a nasty cold. So, let's jump in. This past quarter marked the first anniversary of Toast IPO.\n\nI want to thank all of our employees for their focus and dedication, as well as our partners, customers, and investors. We look forward to our ongoing partnership. And while we've accomplished a lot over the past year, we're even more excited about the opportunity in the years to come. Toast delivered a strong Q3, delivering continued efficient time growth and improved profitability.\n\nIn addition to topping our revenue and EBITDA expectations, we surpassed $100 billion in annualized GPV for the first time. These results are a testament to the consistent execution of our core strategy, driving location growth, deepening our ability to serve all segments of the restaurant industry, and delivering product innovation. On the product front, last month, we hosted Spark, our annual innovation event, where we announced the new product updates to help restaurants grow and expand their business and overcome key challenges. A key highlight is Toast invoicing, a new product to help restaurants seamlessly manage catering and wholesale orders alongside their in-store takeout and delivery businesses.\n\na great example of our continued product innovation and how we're leveraging new products to better serve different restaurant types. While the fundamentals in our business remain strong, we continue to closely monitor the uncertain macroeconomic environment that both we and our customers are operating in. Toast customers continue to see solid consumer demand, and the restaurant industry remains healthy. We're focused on partnering with both new and existing customers to ensure they are able to adapt and thrive in this dynamic environment.\n\nIn addition, we are equally prepared to adapt our business to any macro changes in the restaurant industry. In the third quarter, we grew revenue 55% year over year to $752 million, and ARR was up 60% to $868 million. GPV remains healthy, increasing 53% year over year in Q3. We also continue to drive strong location growth, adding approximately 5,500 net new locations and ending the quarter with approximately 74,000 total locations, sustaining over 40% growth in total locations even as our scale grows is indicative of our powerful go-to-market strategy and industry-leading platform.\n\nAs a result of this consistent execution, we are raising our full-year revenue guidance by 3% at the midpoint of the range which implies 59% year-over-year growth. We're also increasing our adjusted EBITDA guidance by nearly $30 million at the midpoint. The continued margin improvement in Q3 is further evidence of our focus on cost discipline and efficiency efforts and our progress toward profitability. We remain committed to balancing investments in our most important areas to go after the massive market opportunity in front of us with disciplined cost management and healthy unit economics to sustain that efficient growth as we scale.\n\nOur ability to scale our proven go-to-market strategy gives us confidence that our unit economics will continue to improve over time. We've discussed the flywheel effect that drives increasing referrals and inbounds as we increase penetration in a local market. That results in higher and more efficient productivity. That higher productivity leads to more ARR and better profit contribution as these markets scale.\n\nOver the past year, the percentage of total SMB restaurant locations in markets to have over 20% penetration has increased by more than five times, and we continue to gain share in these markets, proof that we still have significant room to keep increasing share even in our more established markets. A large majority of our markets are still below that 20% penetration, and we're investing to replicate that flywheel effect in more markets. When you combine the significant untapped SMB opportunity with our nascent share in the enterprise and international segments, we still have a long runway of growth ahead, and we're well-positioned to capitalize on the digital transformation in the restaurant industry. Demand for Toast across the full spectrum of the restaurant types remains strong, and our new customers continue to take advantage of more products across our platform to operate more efficiently and grow their business.\n\nI'll highlight a few examples from the past quarter. Antoine's, one of New Orleans' storied French Quarter restaurants, selected Toast as its technology partner, known for its classic fine dining experience Antoine's wanted a new partner who could modernize its back-of-house while also preserving its special front-of-house experience. In addition to our robust all-in-one platform, Antoine was attracted to our payroll and Toast's manager solution to help eliminate the inefficiency of making multiple back-office trips each night to aggregate tips with their legacy POS. They're also using 13 of Toast's kitchen display systems in their spans kitchen, along with several of our guest modules.\n\nAntoine came to us via a strong referral from another New Orleans Toast customer. A great example of the relationships our local go-to-market team builds and how that flywheel effect works as we gain traction in these local markets. Walk On's is excited to leverage Toast across its growing footprint of nearly 100 existing and planned locations across the South and Midwest, co-owned by NFL star Drew Brees and named the No. 1 Best Sports Bar in America by ESPN and the No.\n\n1 sports bar franchise two years running by entrepreneur Walk On's has started to Toast's at some of their locations. Seem to enhance their technology, Walk On's is adopting our POS for its ease of use, our Toast Go handhelds to help navigate seas of sports fans, and our API integrations to provide superior service through all of our ordering channels. Taco Maya is a fast-casual QSR with six existing and four planned locations throughout Chicago and Illinois. Taco Maya will be implementing 10 Toast's module assets footprint, including xtraCHEF for better visibility into costs, multi-location management for easier menu updating and online ordering, and Mobile Order & Pay, among others, to provide an efficient, seamless customer experience.\n\nEvery location also includes a patio, which Taco Maya will equip servers with our Toast Go handhelds to service. It's a great use case for our Toast Gos, which have proven to benefit staff productivity. Taco Maya is just one example of the momentum we're building in the QSR segment. Earlier this year, we announced Toast for QSR.\n\nAnd in Q3, QSRs represented nearly half of our bookings, its highest level in recent years. One important benefit of our vertical focus on the restaurant industry is the ability to leverage the Toast platform to develop offerings tailored to the needs of specific restaurant types, enabling us to deepen our penetration across restaurant segments. With restaurants operating in an increasingly dynamic environment, it's critical that we constantly speak to and stay connected with our customers. We recently conducted our annual Voice of the Restaurant Industry Survey to gain insights into the major challenges facing restaurants and how tech can help them thrive.\n\nSimilar to themes we've seen this year, labor shortages and inflation are the challenges facing our customers. One in three restaurants said they've had a difficult time hiring in 2022 and almost 40% started tracking the prices of key ingredients. The survey also highlighted employee scheduling as one of our customers' biggest technology pain points, reinforcing the importance of adding Sling to our team management product suite. In addition, our customers are also diversifying their businesses to meet the evolving needs of guests and to develop new revenue streams.\n\nOn average, restaurant surveyed employed seven different service models such as on-premise, takeout, delivery, catering, wholesale, curbside, and drive-thru. Our recent product innovations highlight how Toast is uniquely positioned to help restaurants navigate these challenges and take advantage of new opportunities to transform and grow. At Spark, we announced Toast invoicing, which enables restaurants to efficiently manage wholesale and catering orders along with their core restaurant business in one integrated system. Our customers can save time on managing paperwork and multiple systems while getting paid faster and seamlessly capitalizing on the opportunity to grow their business with more service models.\n\nToast invoicing showcases our ability to deeply serve hybrid locations and provide a seamless billing and payment solution for both B2B and B2C. We estimate over 70% of restaurants already offer catering in addition to their on-premise business, and catering is one of the top three focus areas for restaurant owners and operators as we head into 2023. A great example of how customers are leveraging our new invoicing offering is founders table, which operates two QSR Dos Toros Taqueria and Chopt Creative Salad and is a great strategic partner of ours. They went live with invoicing in June at 19 of their Dos Toros locations in order to streamline their operations and payments for catering into one platform after previously using a separate point solution.\n\nIn addition to the efficiency of managing this through a single integrated platform over the past three months, Dos Toros monthly invoice and usage with Toast's more than doubled. And in September alone, invoicing drove a 17% uplift in their payments volume on Toast. At Spark, we also featured our xtraCHEF Price Tracker. As I mentioned earlier, this is a major pain point for restaurants due to the inflationary environment.\n\nOur customers can access the price tracker directly from our newly designed xtraCHEF dashboard to stay on top of fluctuating ingredient prices and costs. Restaurants like Plaza Pizza are watching price fluctuations week to week and in response to these insights have engaged in negotiations with food distributors. Plaza Pizza was able to successfully reduce food costs by nearly 10%. Other customers are monitoring key price changes to make strategic decisions about their menus, their recipes, and pricing.\n\nOur ability to help customers navigate this important issue is evident in how quickly the attach rate for xtraCHEF has ramped. After only adding it to our sales motion in Q1 this year, the percentage of locations that went live in Q3 using xtraCHEF is already in the mid-teens, and we continue to see a significant opportunity to reach customers and further develop our product suite to help restaurants manage their suppliers. Finally, I'd like to highlight Toast Capital, where our data on restaurant performance enables us to help offer restaurants seamless, low-friction access to capital. The majority of applicants received an approval decision in one business day, and on average, funds are dispersed to customers just two days after signing their loan agreement.\n\nThat differentiated customer experience is evident in customer retention. Among the 2021 customer cohort, over 70% have taken a second loan and in some cases, multiple additional loans. In Q3, we exceeded our offering, adding a 360-day loan with larger available loan sizes to give customers more choice and meet a wider range of use cases. The strong customer value proposition of Toast Capital and the different offerings we've added over the past year continue to drive healthy growth with SMB businesses underserved by the banking community in an estimated two-thirds of all SMB businesses having financial needs each year.\n\nWe have a clear opportunity to leverage our expanding portfolio of banking products to both add significant value for our customers and drive strong growth going forward. In summary, Toast delivered strong execution and continued momentum in Q3, balancing targeted investments to drive product innovation with focus on healthy unit economics and disciplined cost management. Amid uncertain times, we are more committed than ever to our mission to empower the restaurant community, to delight guests, do what they love, and thrive. We believe that serving as the restaurant industry trusted technology partner and giving restaurants the tools they need to adapt and succeed will benefit our customers while helping Toast deliver durable, efficient growth for many years to come.\n\nNow, I'll turn the call over to Elena.\n\nElena Gomez -- Chief Financial Officer\n\nThanks, Chris, and thank you, everyone, for joining. Before jumping into the results, I want to thank the entire Toast team for another great quarter, the sustained execution, and momentum we've built in the year since our IPO, thanks to the hard work and dedication of our great team. That execution contributed to another strong quarter with revenue and adjusted EBITDA both coming in above the high end of our guidance in Q3. Our integrated software and payments model together with a differentiated go-to-market approach is built to scale efficiently.\n\nAnd our balanced top-line growth and improved profitability is early evidence of that. We're still less than 2% of the $55 billion US market and have a huge opportunity ahead as we lead the restaurant industry's digital transition. We're confident that continuing to invest in innovation scale, our integrated business model will enable us to sustain both strong growth and margin improvement. In Q3, we added approximately 5,500 net new locations, increasing the number of total live location on our platform to approximately 74,000.\n\nThe growth is broad-based with a healthy balance of existing restaurants switching over to Toast, existing customers expanding their footprint and new restaurants partnering with those. As evidenced by the examples Chris just shared, we're gaining traction across different types and segments of restaurants, thanks to the breadth of our industry-leading platform and the ability to deeply serve the entire industry. We expect to sustain our momentum in Q4 with net location adds in a similar range as Q3. Turning to our financial results.\n\nARR, which is our core operational metric ended Q3 at $868 million, up 60% year over year. Total revenue grew 55% year over year to $752 million. Looking at what we operationally view as recurring revenue, subscription revenue and fintech gross profit totaled $224 million, up 82% year over year, driven by our continued location growth and healthy ARPU increases across both SaaS and fintech solutions. Subscription services revenue increased 96% year over year in the third quarter, benefiting from our sustained location growth and increased product adoption.\n\nTotal shop ARPU grew more than 20% year over year, driven by both new and existing customers. As we've discussed, new customers are joining the platform at higher ARPU than in prior years as they leverage the expanding breadth of our platform. Chris alluded to the increasing attach rate of nascent products like xtraCHEF, that's just one example of how our sales team is attaching more products at booking contributing to higher SaaS ARPU for our more recent customer cohorts. Existing customers are leveraging upsell channels to add more products.\n\nThe ARPU for each of our pre-2022 annual customer cohorts is growing at double-digit rates, and we're still only scratching the surface on the potential for upsell. New products like payroll and xtraCHEF are still early on their growth and have much higher penetration with new customers than older cohorts. Plus, we have an exciting pipeline of new products for our customers to benefit from. As we continue to develop our upsell team and refine our sales motion, we believe we can continue to increase SaaS ARPU across our annual customer cohort.\n\nOn the fintech solutions side, revenue grew 55% to $628 million, and gross profit was up 74% year over year to $134 million in the quarter. GPV growth remains healthy and increased 53% to $25 billion in Q3. Average annualized GPV per processing location of $1.4 million was roughly flat with Q2 and up 8% year over year. The growth in GPV per processing location is a result of higher average ticket and the continued rebound in customer transactions, which remains slightly below 2019 levels in Q3.\n\nIn addition to healthy payments volume, we're also benefiting from our growing portfolio of fintech products and services led by Toast Capital. Those products drove $17 million of gross profit in Q3. Toast Capital offers a strong value proposition, and we have a great opportunity to further penetrate the significant restaurant lending, marketing opportunity as we expand the offering. In addition to Toast Capital, our portfolio of non-POS fintech products with nascent offerings like PayCard and payout and other products currently in development highlight the strategic benefit of our fintech capabilities and the opportunity to build products that add value for our customers while differentiating our offering and driving additional monetization.\n\nThe combined -- the combination of continued optimization efforts from our payments platform investments, coupled with the growth in other fintech products resulted in a net take rate increasing to 53 basis points. As a reminder, GPV per processing location is typically higher during peak season in the second and third quarters each year. We expect GPV per processing location to seasonally decline quarter over quarter in Q4 and in Q1 each year. Total gross profit of 8% year over year and 31% quarter over quarter to $164 million, resulting in gross margin of 21.8%.\n\nWe delivered gross margin improvement in each of our reporting lines leading to over 300 basis point gross margin improvement compared to Q2. Turning to customer acquisition costs. Hardware margins improved quarter over quarter due to lower shipping costs. Hardware Harbor revenue decreased year over year mainly due to tough seasonal comp and accounting guidelines that require allocation of revenue across bundled products.\n\nWe've seen upsell to existing customers revert to a typical seasonal pattern with Q2 benefiting from more hardware sales to existing customers in preparation for the outdoor season followed by a drop-off in Q3. Last year with in-person dining still recovering after COVID, hardware upsell sales in Q3 were stronger than usual. On operating expenses, we continue to take a balanced approach to position for sustained top-line momentum as we lead the digitization of the restaurant industry while putting in place a lean, flexible cost structure. Our hiring is focused on key investment areas with the strongest ROI potential, and we're rigorously prioritizing those opportunities as we tightly manage expense growth.\n\nAt the same time, we're closely monitoring the dynamic macro backdrop and maintaining the flexibility in our cost structure to adapt to the changing environment. Moving to our other customer acquisition costs. Sales and marketing expense growth slowed to 54% year over year and further declined as a percentage of recurring revenue in Q3. Our go-to-market engine is well-positioned to scale efficiently.\n\nAs we drive sustained share gains and build flywheel effect an increasing number of markets, we expect rep productivity to increase, driving deeper market penetration and improving unit economics. The recent Spark event and release of our Toast's invoicing products, the latest example of how our investments in research and development are driving innovation to help our customers grow their business and improve their bottom line. We believe our balanced investments across core products, emerging growth products, and our pipeline of new products will continue -- contribute to continued ARPU and location growth. General and admirative expenses were 25% of recurring revenue.\n\nOur G&A expenses include bad debt and credit-related expenses, which were approximately $13 million in Q3. Excluding bad debt and credit-related expenses, G&A grew 66% year over year as we continue to absorb public company costs. With our emphasis on disciplined cost management, we expect growth in the core G&A expenses to moderate in Q4 and anticipate operating leverage on G&A going forward. Bad debt and credit-related expenses include bad debt on outstanding receivables, as well as liabilities related to Toast Capital and other fintech offerings.\n\nOur data advantage allows us to closely monitor the health of the restaurant and its repayment ability to maintain low default rates and manage our risk. And while we expect bad debt and credit expenses related to capital to grow as we expand the program, the overall operating margin is healthy and accretive to the business. Total Q3 adjusted EBITDA was negative $19 million. Our negative 2.6% margin was a 230 basis points improvement quarter over quarter.\n\nQ3 is a great example of our ability to drive healthy top-line growth, continue to invest in key areas that will help sustain growth while operating efficiently to improve profitability. We remain focused on optimizing our cost base and rigorously prioritize investments in order to sustain this trajectory going forward. Now, turning to guidance. For the fourth quarter, we expect revenue to be in the range of $730 million to $760 million, which represents 46% year-over-year growth at the midpoint, with adjusted EBITDA expected to be in the range of negative $30 million to negative $20 million.\n\nWe continue to see healthy GPV trends into Q4 and our guidance reflects a seasonal decline in GPV per location similar to our typical historical trend. Based on strong Q3 performance and Q4 guidance, our full-year 2022 revenue expectations are higher at the midpoint. We now expect full-year revenue to be in the range of $2.69 billion to $2.72 billion, a 59% year-over-year increase at the midpoint. Our updated full-year adjusted EBITDA guidance range is negative $127 million to negative $117 million, a nearly $30 million improvement at the midpoint from our last guidance.\n\nThis implies an adjusted EBITDA margin of negative 4.5% for the year at the midpoint. Our focus on efficiency and disciplined cost management this year has enabled us to both meaningfully improve margins the last few quarters and invest in key areas that we believe will contribute to durable efficient growth. We intend to maintain this balanced approach going forward, investing in areas of product innovation as we go after the big market opportunity in front of us while driving operating leverage. The progress we've made to adopt our cost structure this year, along with our continued focus on efficient growth puts us on a trajectory to deliver a quarterly adjusted EBITDA profit by the end of 2023.\n\nThis assumes the current macro environment remains relatively consistent. We're closely monitoring the key indicators. And if there were a meaningful change to the macro environment that impacts the restaurant industry, we would reassess that timing, but we have a proven ability to navigate changing market conditions and with the improvements in our cost structure, we're prepared to quickly adapt our business to any changes. In closing, we had a great third quarter, posting strong financial results on building on our operating momentum.\n\nI want to reiterate my thanks to our team for their focused execution. In the face of this dynamic operating environment, restaurants need a trusted technology partner more than ever to help them drive efficiency, offer differentiated guest experiences, and enable new service models. Our relentless focus on being that partner to the restaurant industry and solving their biggest pain points is driving the strong growth in our business. And with investments to further strengthen our industry-leading platform, put toss in a great position to lead the digital transition for the restaurant industry.\n\nNow, I'll turn the call back over to the operator to start our Q&A.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Tien-Tsin Huang J.P.Morgan. Please proceed.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nHey, great. Thanks so much. Great results here. I wanted to ask, like Slide 18, if you don't mind going to that.\n\nwas helpful to see. I'm curious how hard or how big a focus is it to narrow this ARPU gap between the '21 cohort and the pre-'21 class, it looks like. What are some of the big products you need to do it with? And I think it sounds like the product upsell team will be tasked to do that. Any detail there would be great.\n\nAman Narang -- Chief Operating Officer\n\nHi, Tien-Tsin. Thanks for the question. This is Aman. Look, I think one of the things we're really proud of is just a great performance by our go-to-market team in Q3.\n\nYou're seeing not only that with new customers are booking, they're booking at a higher ARPU. And you're also seeing that core of customers over time, as you saw on Slide 18, are expanding ARPU over time. And it's really across the board, right? We've got -- on the upsell team, our growth is getting more familiar with these newer products. As Elena mentioned, the attach rates of some of these products like employee cloud and xtraCHEF is lower, and their high ARPU products.\n\nAnd then on to shop, we've got products like our guest products, even capital, as Chris talked about, and also our core products in terms of just adding more hardware and software subscriptions through kiosks and such. And so, across the board, seeing really good momentum, and it's really both on new business bookings, as well as an upsell as well.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nGreat. And just my quick follow-up if you don't mind, just bigger picture question around risk appetite. Going into a less certain macro, just risk appetite in general with underwriting new locations, the capital business, you talked about xtraCHEF. What do you, what signals are you watching there to dial it up or down? Thanks.\n\nElena Gomez -- Chief Financial Officer\n\nYeah. So, our just capital business, first of all, we see a lot of the data with our customers, so we're well positioned to really understand their ability to pay, their sort of their payment volume, and so on. So, the risk is largely managed. We pay careful attention to signals, but we're not seeing anything so far in our loan portfolio that leads us to believe that default rates are out of line.\n\nIn fact, they're very much in line with our expectations, Tin. So, we're not seeing that risk. But of course, we're going to keep monitoring it in light of the backdrop that we're in.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nGotcha. Thank you.\n\nOperator\n\nThank you. The next question comes from the line of DJ Hynes of Canaccord. Please proceed.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, guys. Yeah. Thanks for taking the question. Nice set of results here.\n\nElena, maybe I'll start with you. I wanted to ask about inflationary impacts on GPV per location and how we should think about that going forward that there's kind of a mix of pros and cons, right? On the one hand, high prices are a good thing for payment volume. I presume, at some point, it works against traffic. So, how should we be thinking about that as we factor the data points into our model?\n\nElena Gomez -- Chief Financial Officer\n\nYeah. No, that's a great question. So, inflation is definitely a factor, and we know that in our GPV per location, and we know that we're benefiting from that. And we're also benefiting from higher transaction volumes.\n\nAnd I sort of commented on the fact that our ticket is being up, but also our transaction levels are close but not all the way back to 2019. So, we're going to benefit a bit as that with respect to pre-COVID levels. Then the other interesting data point we look at is the cost of food. At home and the cost of food away from home, and we're seeing that the cost of food at home is growing faster than the cost of food away from home.\n\nSo, as diners have become more comfortable, and we're seeing that trend of consumer demand shifting to food away from home. We expect to continue to benefit from that as well.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYeah. Interesting. OK. And then maybe a more strategic follow-up.\n\nJust around like the importance of building out the self-serve product-led motion to the long-term margin profile of the business. And I'm just thinking like as you scale refilling the natural customer attrition do you see with kind of lower and lower cost of acquisition channels is obviously going to be important. But would love to get your thoughts, A, on progress there; and, B, just how important that is.\n\nChris Comparato -- Chief Executive Officer\n\nYes. DJ, this is Chris. I think you want to put yourself in a position to support the restaurants demands whether it's a net new customer upfront, as Aman mentioned, bundling more of the platform up-front in efficient motion to win that customer. But then over time, given existing customers the flexibility either through self-service, product-led growth, or the upsell motion to have really clear accessibility to our platform and all of its modules.\n\nSo, we spend a lot of time looking at that customer journey for restaurant segments of all types to identify what is the right channel for which they can get exposed to the right products, and then we capitalize on those efforts. And we're seeing that those teams are becoming more and more productive over time. So, that's what we look at. But then we complement that with making sure that the platform has all the needs that address the restaurant's pain points, and we continue to select and build the right products to address those pain points.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nThat's helpful color. Thank you, guys. Keep it up.\n\nOperator\n\nThank you. The next question comes from Will Nance of Goldman Sachs. Please proceed.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys. Good afternoon. Appreciate you taking my questions. Nice results today.\n\nIt's great to see the strength on the top line and particularly in the subscription revenues. And I guess I wanted to follow up on, I think, Tien-Tsin's question on the subscription ARPUs. I thought Slide 18 was great as well. Wondering if you could maybe dig into the step function change in ARPUs in the 2021 cohort.\n\nI mean, is that primarily a result of payroll and maybe a little bit of extra shafts? Or is there something specific you would kind of point us to that drove that step function? And then the follow-on is, what does the sales motion look like, the upsell motion for the back book to get some of these higher ARPU products kind of penetrated in the base? Thank you.\n\nElena Gomez -- Chief Financial Officer\n\nSure. I'll take that, and Aman, feel free to chime in as well. So, that step-function is really broad-based as we started testing different bundles that resonate with our customers. We started understanding that customers are actually, our sales team is getting really good at positioning the breadth of the platform.\n\nThat's really the important part. They're getting used to solution selling. And in that, they're selling all elements of the platform, whether it's the guest products, online ordering, things like that, as well as hardware, so it's really the breadth of products, payroll on xtraCHEF, payroll more obviously played a role, but we still have a continued opportunity with payroll. And xtraCHEF is too early to have that big of an impact.\n\nIn fact, in 2021 was really nascent. So, I would -- I don't even know it shows so early in 2021. So, it's really a payroll and the broad breadth of the platform versus any one product.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nGot it. That's super helpful. You know, the take rate came in a bit ahead of where we were looking for, it sounds like there may have been some contribution from Toast Capital in there. Just wondering if you could talk through the trajectory of to capital over the last couple of quarters.\n\nIt sounded like it was a little bit bigger than maybe we thought it was running. So, any color you could provide on what the cadence of adoption of those capital has been over the last several quarters would be great. Thank you.\n\nElena Gomez -- Chief Financial Officer\n\nYeah. No, we're really encouraged by Toast Capital, and we commented on it because we wanted to give you guys more transparency. But we launched a 360-day product in Q3, and the take rate benefited from that. Our take rate, though, is a combination of two factors.\n\nIt's not just to capital, but also the improving the focus we have on improving our payment operations and infrastructure. So, there's always going to be that focus. We have a whole team focused on that all the time. But in Q3, the primary -- the two primary drivers for both of those things, not just to use capital.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nMakes a lot of sense. Appreciate taking my questions.\n\nElena Gomez -- Chief Financial Officer\n\nSure.\n\nOperator\n\nThank you. The next question comes from Mayank Tandon of Needham. Please proceed.\n\nMayank Tandon -- Needham and Company -- Analyst\n\nThank you. Good evening. Congrats on the quarter. Elena, you commented I think that you expect to be EBITDA profitable exiting 2023.\n\nCould you just maybe walk through the different levers, specifically in terms of what you would then have to deliver on gross margins on the recurring revenue? Any kind of framework around that? And then what are some of the levers on the opex line that would need to come through to get to that level?\n\nElena Gomez -- Chief Financial Officer\n\nYeah. I mean, I'll start by saying we're very early in our -- or we're in the middle and not early, but we're in the middle of our 2023 planning. So, I'll have more specifics at our next earnings call. But at the highest level, we're going to continue to focus on cost discipline that we've -- and we've shown you guys for the last several quarters.\n\nSo, that's number one. We're going to continue to gain leverage in the obvious places like G&A. But I want to remind you, we have a massive opportunity ahead. So, we're going to continue to invest in areas that are going to drive long-term sustainable growth.\n\nAnd that's how I would think about it as a very balanced approach to 2023 in light of the macro.\n\nMayank Tandon -- Needham and Company -- Analyst\n\nRight. It's still encouraging to hear also definitely should be viewed positively by investors. But just as a follow-up, Chris, I think a few months ago, you had identified the hospitality opportunity, I believe, in the press release, you had 40,000-plus locations as a target market. I guess my question there would be, typically, when we think of hospitality, those terminals are usually integrated into the property management systems, where I think a company like Micro is the incumbent.\n\nSo, any progress around that? How do you go about displacing someone that has been an incumbent for so long? I would just love to hear any color around your progress on the hospitality side and how do you see the opportunity playing out.\n\nChris Comparato -- Chief Executive Officer\n\nSure. So, we're very excited about the hotel opportunity. We continue to build out our PMS integrations and they're well beyond Oracle's PMS. There's a span of PMS integrations that we are now capable of interfacing with at hotel properties, but the team continues to build out that foundation.\n\nWe're very confident that we can support the restaurants within those hotels. We've got a number of opportunities in our pipeline that are exciting. But I'll caution you that it's still early days. We're winning hotels.\n\nBut again, we're building that muscle as we speak. And over the course of the next few quarters, you'll see us continue to execute within that segment, and we're excited about it.\n\nMayank Tandon -- Needham and Company -- Analyst\n\nGot it. Thank you so much.\n\nOperator\n\nThank you. The next question comes from Josh Baer of Morgan Stanley. Please proceed.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nThanks for the question, and congrats on the quarter. I wanted to ask about locations, the 5,500, better than expected, given I think we were looking for the lower seasonality in Q3. Just wondering about the linearity of location adds. Was there any deterioration going month to month from September to October or even into November?\n\nElena Gomez -- Chief Financial Officer\n\nYeah. So, I'll talk about Q3. And you're right, Q3 net location adds came in better than we expected, and that's really a testament to the onboarding team. They were converting existing restaurants that were switching to Toast and converting them faster.\n\nSo, we saw a great performance from that team. That pulled some locations into Q3. Based on the current pipeline, you know, I commented in my prepared remarks, we expect Q4 net location to be in a similar range to Q3, and we're still on track for strong growth in the full year.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. And then one on guidance. Just wanted to make sure I heard right. You were saying that guidance reflects a decline in GPV per location that was similar to historical trends.\n\nElena Gomez -- Chief Financial Officer\n\nYeah. Typically, GPV per location, and in my prepared remarks, I mentioned that it's seasonally higher in Q2 and Q3 and dips down into Q4. So, that's not unusual. It's typical of historical patterns and our revenue guidance reflects that.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nOK. I guess the question is on macro and consumer spending. I guess, is there any like level of prudence around macro and potential shift in consumer spending that's incorporated in that guidance? Thank you.\n\nChris Comparato -- Chief Executive Officer\n\nWell, Josh, I'll jump in. We're not seeing any signs of changes in consumer demand or spending across our business. Restaurants continue to see healthy demand in line with what we think are historical seasonality trends. And that said, we're mindful of the macro environment.\n\nWe believe consumer spend on dining has proven resilient during past recessions. And then the last thing I'll leave you with is for restaurants, we fundamentally believe that our platform becomes even more valuable in a tough market. Restaurants are turning to us for driving efficiency, growing their business, as we mentioned, things like invoicing and new service models, maintaining their teams, and then driving operational costs across the board. So, we think we're in a good spot when it comes to looking at the macro and the situations that have been looming.\n\nElena Gomez -- Chief Financial Officer\n\nAnd just to comment on your guidance comments, in October, we're seeing the same seasonal pattern we've seen historically.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. The next question comes from Timothy Chiodo of Credit Suisse. Please proceed.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nGreat. Thanks for taking the question. First one is a simple one just around the subscription services. The gross margins were up nicely quarter over quarter.\n\nMaybe just dig into a little bit of that was there pricing, with some cost leverage? And what were some of the drivers that helped that? And then in terms of the follow-up, just in terms of the credit losses on capital, maybe you could just recap again the mechanics around when you take the lawsuits versus your partner, what the sharing is, what the thresholds are there in terms of that working its way into your P&L?\n\nElena Gomez -- Chief Financial Officer\n\nYeah, sure. So, on SaaS gross margin, it's really scaling the business. And of course, you saw a healthy beat on the top line in both in the subscription side, and that's really our dress positioning the platform and our ARPU being strong, etc., that we've talked about. So, that's really what's the story on SaaS gross margin.\n\nOn your other question was bad debt related. Is that right?\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nYeah, the mechanics.\n\nElena Gomez -- Chief Financial Officer\n\nOK. Yeah. So, basically, as we expand our Toast's loan program, we have to add and accrue for related future potential default rates. And our default rates have not been out of line with what we're expecting, and we should expect that to continue to grow.\n\nBut overall, the Toast capital program is a healthy business and actually accretive to the business, Tim.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nExcellent. Thank you for taking the questions.\n\nOperator\n\nThank you. The next question comes from the line of Stephen Sheldon of William Blair. Please proceed.\n\nStephen Sheldon -- William Blair and Company -- Analyst\n\nHey, thanks for taking my questions. First one here, just another really strong quarter location growth. And so, I'm just curious if you're seeing any changes in the types of wins that you're getting. Are these still mostly greenfield wins and situations where you're replacing legacy vendors? Or are you starting to also see wins where locations or previously on competitive SaaS solutions? Just curious if that's changed at all this quarter or this year relative to what you've seen historically.\n\nAman Narang -- Chief Operating Officer\n\nSure, Stephen. Great question. Look, I think we, as Chris and Elena mentioned, are really proud of the results in Q3. The sales team is really efficient in terms of driving growth.\n\nAnd it's really the story of Q3 is really consistency across the board. We saw really healthy win rates across legacy and cloud providers. We saw -- when we go into a buying decision, we tend to win more than 50% of the time as we've shared in the past. We've talked about, in previous calls, we talked about our focus on with our QSR launch, and that start to make an impact, and the balance in QSR, it's starting to improve.\n\nWe've seen -- as Chris mentioned, we saw some good momentum in mid-market with things like the Walk On's win. We also had expansion of enterprise customers, Nothing Bundt Cakes and Jamba Juice. And even in terms of trends like new and existing, you know, we -- just coming out of COVID, we've seen some small tailwind on new restaurants opening up and are seeing a good healthy balance in new and opening, existing restaurants as well.\n\nStephen Sheldon -- William Blair and Company -- Analyst\n\nGreat. That's really helpful. And then just as a follow-up, I know it's very small. You're really talking, I think, about placing seed investments on the international side this year.\n\nBut love an update on the progress you're seeing there, how you're thinking about investing behind international next year? And any thoughts on when international could be a revenue contributor? Or are we still kind of a ways away from that?\n\nElena Gomez -- Chief Financial Officer\n\nYeah. No, I'll start by saying we're super early in the international opportunities but very encouraged already by what we're seeing, but I would view -- we view 2022 is really a building year and into 2023, frankly. We talked earlier in the year about our investment level. It hasn't changed.\n\nWe're kind of on the low end of the range of $10 million to $20 million that we talked about. And I would tell you, as the year has gone on, the investment has been increasing, obviously, as we're building the team out. But it's still early. We're evaluating all the things that you would expect the go-to-market motion, making sure we understand the product that we want to put out there in international.\n\nWe've got a few early customers in Canada, Dublin, and U.K. So, we're learning from our early customers. And so, far, the feedback has been really encouraging. So, we're going to continue to make that investment into 2023.\n\nStephen Sheldon -- William Blair and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. The next question comes from Harshita Rawat of Bernstein. Please proceed.\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nHi. Good afternoon. So, I have a question on churn. So, Elena, how would you think about the kind of industry-level restaurant churn you've seen in the past year or so? Is that much lower versus history? And more importantly, how can you kind of let your net location as can change if the churn kind of, I guess, becomes big in a downturn? And I fully appreciate that, you know, restaurants in Toast do better versus an average restaurant.\n\nThank you.\n\nElena Gomez -- Chief Financial Officer\n\nYeah. No, we haven't seen any change in our churn. And even during COVID, which was a pretty difficult time for restaurants, our churn was relatively low and consistent. So, I wouldn't expect that we would see a change in pattern.\n\nWe have and we'll keep watching it, of course, but we haven't seen a change in our pattern. And also, when we double-click on the churn, most of the churn historically has been for restaurants that go out of business versus restaurants that are leading to us to another platform. But it continues to be low single digits -- I mean, in the single digits. So, we're encouraged by that.\n\nChris Comparato -- Chief Executive Officer\n\nThe one thing I'll add -- this is Chris. The one thing I'll add is some of these questions related to churn are oriented toward the short term. And I just want to remind the audience that we're still only at 9% of our total addressable market for U.S. locations alone, and we're less than 2% of our total addressable market when you look at ARR as a potential.\n\nSo, we want to be mindful that the restaurant industry is going through a transformation to digital, and it's happening across the back of house to the front of house, and we believe we're still in the early days of leading this transformation. So, just a reminder, because as we talk about recession warnings, we believe these are short-term considerations, but on the long term, we are increasingly excited about the opportunity ahead.\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nAnd just to follow up on capital allocation, so roll-up of scale smaller restaurant software providers kind of like very good sense in this valuation environment, but at the same time, a good balance sheet is also guidance has done going into a downturn. So, how do you -- how are you kind of like thinking about the balance between these two? Thank you.\n\nElena Gomez -- Chief Financial Officer\n\nSorry, can you clarify your question? Are you asking the balance between a strong balance sheet and investing?\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nAnd acquiring some of the smaller -- you know, continuing to acquire some of the smaller providers, especially in this environment?\n\nElena Gomez -- Chief Financial Officer\n\nYes. Yeah, fair. I understand the question. Yes, look, our M&A strategy hasn't really changed.\n\nI think, obviously, the backdrop has changed. So, we're going to continue to canvass the market like we always do. And our guiding principles around acquiring assets to the platform would be consistent with they've always done, which is, is it going to get us to market faster, is it going to be something that is an adjacency to our platform that really solves a pain point for the customer? So that's not changing. Of course, the valuations are different now, and so we're paying attention to that.\n\nSo, we'll be opportunistic if there's a fit.\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question comes from Rayna Kumar of UBS. Please proceed.\n\nRayna Kumar -- UBS -- Analyst\n\nGood evening. Thanks for taking my question. You had a very strong net take rate in the quarter, 53 basis points. Just wondering what the key drivers are there.\n\nAnd if there's anything unusual to call out as in one-time items?\n\nElena Gomez -- Chief Financial Officer\n\nYeah. So, I'll repeat what I said earlier, which is there's really two factors driving the take rate benefit. One is our continued focus on just payment optimization, and we have a whole team focused on that. And then, of course, we had healthy demand from our Toast Capital product, and we benefited from launching the 360-day loan, which was encouraging.\n\nSo, it's a combination of those. And really, when you zoom out and think about our take rate and monetization opportunity, you want to think beyond take rate and really think about the power of the platform and the fact that we have an opportunity to monetize on the SaaS side. And then over the long term, we're going to continue to drive product innovation that will drive more payment volume to our platform and continue to drive more digital digitization of our platform. And as we do that, we'll have more opportunity to drive more volume through the platform and more monetization.\n\nBut I would zoom out and think of it broader than just the in-quarter take rate.\n\nRayna Kumar -- UBS -- Analyst\n\nThank you. That's very helpful. And just one follow-up. If you can just comment on your progress moving upmarket to more enterprise larger restaurants, please? Thank you.\n\nAman Narang -- Chief Operating Officer\n\nSure. So, look, I think that this is a spectrum, right? We started the business in SMB and have gradually gone into bigger and bigger groups. And, you know, as I just mentioned, we -- in mid-market and enterprise, we saw some good expansion in wins this year. So, things like Nothing Bundt Cakes, which has been a customer for us for a while, expanded test about 400 units out of Texas.\n\nJamba Juice expanded with Toast as well. Chris called out, walk on out of Louisiana. And I think there's a lot of interest in our enterprise offering. So, the amount of inbound we're seeing continues to grow as well.\n\nAnd when I think about like just for some context, the four walls of a restaurant, right? The value proposition we offer to an SMB or a larger chain in many ways is similar. Things like handhelds improve operational efficiency, digital tools to improve automation, self-service. It's certainly outside the four walls, where things like config management, menu management, security, and compliance, right through. And we continue to work on a lot of those capabilities, and we're confident over time that we're going to grow into that time gradually.\n\nRayna Kumar -- UBS -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We will now take our final question from the line of Josh Beck of KeyBanc. Please proceed.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThank you for squeezing me in. I also was a big fan of Slide 20. Certainly, has had really good progress in the flywheel markets, but they're still less than 10% of the total. So, I guess my question is, in future years, is this trajectory likely to continue? Or is there some element of the emerging markets that you're just investing in that could maybe limit the slope of the flywheel markets? Just curious about how this trend progress over time.\n\nAman Narang -- Chief Operating Officer\n\nYeah. Look, great question. Look, we are really proud of the performance of our sales team and what we accomplished in Q3. And as you correctly pointed out, you know, just for context, audience-level markets where we have about 20% or more penetration, and that's less than 10% of our overall market.\n\nAnd we continue to see the same trend we've seen for a while now, where, as we see rep tenure because end market tend to improve, we tend to see productivity continue to improve. And there's nothing that's telling us that that trend should not continue.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nExcellent. And then maybe a follow-up, just to close on the invoicing products, certainly seem like an exciting launch at the Spark event. When you look across your existing base of customers, I'm curious how applicable the product is. I'm also curious, does it help you get into new segments? Just curious where the strongest product-market fit may lie for that product.\n\nChris Comparato -- Chief Executive Officer\n\nYeah, Josh, it's extremely applicable. In my script, I talked about the different service models that restaurants are deploying to attract and deliver demand. Catering and invoice is one of those key service models. We believe that roughly 70% of our customer base and the industry has a need to drive catering, whether it's events, whether it's different types of meals, whether it's certain types of opportunities off of the kitchen, we believe the majority of restaurants have this need.\n\nIt's in the early days for us. So, on top of invoicing, you'll see this evolve to a broader catering platform. Restaurants today tend to use either manual processes or point solutions to deliver those engagements but doing it on an all-in-one integrated platform makes it a lot easier for the restaurant operator. And then they could drive more invoicing.\n\nAs I mentioned, Dos Toros tripled the amount of their invoicing usage over the course of the past three months, and the payments volume for the restaurants increased 17% and, so we think it's a unique opportunity. It's still early days, but we'll continue to tell stories on how that evolves over the next few quarters.\n\nOperator\n\nThank you. I would like to turn the call back over to the presenters.\n\nChris Comparato -- Chief Executive Officer\n\nOK. Thank you, all. Have a great evening, and thank you for your time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Senno -- Vice President of Investor Relations and Treasury\n\nChris Comparato -- Chief Executive Officer\n\nElena Gomez -- Chief Financial Officer\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nAman Narang -- Chief Operating Officer\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nWill Nance -- Goldman Sachs -- Analyst\n\nMayank Tandon -- Needham and Company -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nStephen Sheldon -- William Blair and Company -- Analyst\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nRayna Kumar -- UBS -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nMore TOST analysis\n\nAll earnings call transcripts"
}