{
  "companyName": "Algonquin Power & Utilities Corp.",
  "companyTicker": "AQN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/11/algonquin-power-utilities-corp-aqn-q3-2022-earning/",
  "content": "Algonquin Power & Utilities Corp. (AQN -0.76%)\nQ3 2022 Earnings Call\nNov 11, 2022, 8:00 a.m. ET\n\nOperator\n\nPlease stand by, your meeting is about to begin. Good morning, ladies and gentlemen, and welcome to the Algonquin Power & Utilities Corporation third quarter 2022 earnings webcast and conference call. Following the presentation, there will be a question-and-answer session. I would like to turn the meeting over to Ms.\n\nAmelia Tsang, vice president of investor relations. Please go ahead.\n\nAmelia Tsang -- Vice President, Investor Relations\n\nGood morning, everyone. Thanks for joining us this morning for our third quarter 2022 earnings conference call. Presenting on the call today are Arun Banskota, our president and chief executive officer; and Darren Myers, our chief financial officer. Also joining us this morning for the question-and-answer part of the call will be Jeff Norman, our chief development officer; and Johnny Johnston, our chief operating officer.\n\nTo accompany our earnings call today, we have a supplemental webcast presentation available on our website, algonquinpowerandutilities.com. Our financial statements and management's discussion and analysis are also available on our website, as well as on SEDAR. Before continuing the call, we would like to remind you that our discussion during the call will include certain forward-looking information, including but not limited to our expectations regarding earnings, capital expenditures, pending acquisitions, asset recycling transactions, and growth. At the end of the call, I will read a notice regarding both forward-looking information and non-GAAP measures.\n\nPlease also refer to our most recent MD&A filed on SEDAR and EDGAR and available on our website for additional information on these items. On our call this morning, Arun will provide an overview of Q3 performance. Darren will follow with the financial results, and then Arun will conclude with an update on the strategic plan for the business. We will then open the lines for questions.\n\nI ask that you restrict your questions to two and then requeue if you have any additional questions to allow others the opportunity to participate. And with that, I'll turn it over to Arun.\n\nArun Banskota -- President and Chief Executive Officer\n\nThank you, Amelia, and a very good morning to those who have been able to join us on the call and online. Let me start by taking the opportunity to extend a warm welcome to Darren, who has now been with Algonquin for almost three months. Darren has a very strong background and brings deep experience in finance and capital markets as he was previously the CFO at two public corporations in Canada. Over the coming months, I hope you all have the opportunity to meet and build a relationship with Darren.\n\nMoving to the update for the quarter. Overall, I would describe our third quarter financial results as challenged. We made progress on our growth initiatives, with a year-over-year increase in adjusted EBITDA. But at the same time, we experienced pressure from factors such as renewable energy project delays and higher interest rates.\n\nDarren will discuss the results in more detail. Over Algonquin's history, we have driven significant growth at our regulated and renewables businesses. Looking ahead over the next several decades, as the industry continues to see an energy transition, we are well-positioned to benefit from a decarbonization transformation. That said, we are currently seeing rapid changes in capital and credit markets, most notably a sharp increase in interest rates.\n\nWhile increasing interest rates is a marketwide phenomenon, the impacts are different by company. As a capital-intensive, growth-oriented company, Algonquin faces headwinds from higher interest rates and capital market volatility. We recognize these challenges and are committed to identifying and implementing adjustments to reduce our reliance on raising equity and to moderate the impact of rising interest rates. Let me now provide you an update on our three strategic pillars of growth, operational excellence, and sustainability.\n\nBy now, many of you are familiar with the growth levers we have in our organization. One growth lever on the regulated side is from our acquisitions, and I wanted to provide an update on the pending acquisition of Kentucky Power Company and AEP Kentucky Transmission Company. On September 29th, Liberty Utilities and AEP reached an agreement that provides a path toward closing the transaction pending the approval of the transaction by FERC. The terms of the agreement include a reduction in the purchase price by $200 million, from approximately $2.8 billion to approximately 2.6 billion.\n\nThe transaction is currently expected to close in January 2023. We remain firmly committed to completing this acquisition and look forward to bringing the benefits of our local operating model to the customers and communities of Eastern Kentucky. Turning to the growth levers for our renewable business. One lever is our C&I strategy of partnering and collaborating with other companies to help them achieve their environmental, social, governance, ESG, commitments.\n\nDuring the quarter, we started construction on our first two solar projects with Chevron under our framework agreement, which was announced about two years prior to co-develop renewable projects and help Chevron reduce its carbon intensity. We continued to be active on the renewables front and construction continues to progress well at our Deerfield II and Sandy Ridge II wind projects, which are expected to add a combined total of approximately 200 megawatts of capacity. All foundations and road works are now complete on both projects. Turbine parts are onsite at Deerfield II, with eight of 21 turbines now topped out.\n\nSandy Ridge II has four of 15 turbines onsite and is expected to start topping out units in November. Approximately 2% of our previously disclosed five-year capital plan includes solar projects, including the Chevron project and New Market Solar. While we have confirmed deliveries of panels for the Chevron projects, the New Market Solar project continues to be impacted by solar module delivery delays due to U.S.-government import restrictions, which is an industrywide issue. The project already has 24 of 100 megawatts in service, with construction on the remaining 76 megawatts substantially complete, except for module installation.\n\nModule deliveries for the remaining 76 megawatts are expected to restart in late Q4 2022 or in Q1 2023. I also want to provide a comment on the passage of the Inflation Reduction Act in August, which has reinforced our strategy of investing in renewable assets. Not only has it increased PTC and ITC tax credit levels associated with wind, solar, storage, and renewable gas projects, but it has also increased those incentives' transferability and self-monetization options. In short, the IRA has delivered a greater degree of long-term certainty required for us to continue to invest in developing a pipeline of greenfield opportunities.\n\nMoving on now to operational excellence. In a mission-critical industry, safety and reliability are always key areas of focus. We strive to keep our customers and communities safe while maintaining our system reliability and resiliency. I want to thank all of our employees for their ongoing focus on safety and preparedness for weather events.\n\nI want to particularly recognize and thank the electric team in Bermuda as the crew was able to restore power back to 97% of customers within 48 hours following Hurricane Fiona in late September. In Q3, our enterprisewide customer J.D. Power scores came in at 702, representing a seven-point increase from the prior quarter. In a challenging environment of increasing commodity prices, we have seen industry scores decline substantially while our score is only down one point from last year.\n\nWe were able to move against the trend and improve our customer experience versus other utility companies as measured by J.D. Power. We continue to monitor rising costs and the consequent cost of living challenges. These costs are largely a pass-through.\n\nBut at the same time, we are acutely aware of the potential impact on customer affordability. So, we track that very closely. We are helping our customers through educating on options for financial assistance and providing energy efficiency and water conservation programs. And finally, we remain firmly committed to sustainability through the inclusion of environmental, social, and governance values in our corporate strategy and operations.\n\nEarlier this week, we released our 2022 ESG report, which is also available on our corporate website. The report is organized to meet our ESG disclosures as aligned with widely recognized sustainability frameworks. Highlights of the newly released report include an enhanced diversity, equity, and inclusion section, as well as enhanced data-driven content, with the inclusion of more relevant key performance indicators. Focusing on the company's ESG progress.\n\nAlso included is third-party verification of Scope 1 and 2 emissions data, which is the third year in a row we've had the data successfully verified. With that, I'll pass it over to Darren, who will speak to our third quarter 2022 financial results. Darren.\n\nDarren Myers -- Chief Financial Officer\n\nThank you, Arun, and good morning, everybody. Very pleased to be here today and excited to be part of Algonquin, a company that is creating sustainable energy and water solutions for the future. My focus since joining the organization has been to meet with as many of our colleagues as possible and come up to speed on financial, operations, and corporate matters across the company. I look forward to meeting with all of you in person in the months ahead.\n\nBefore I turn to our third quarter performance, I did want to spend a moment sharing my philosophy with respect to capital and financing. Building on the company's record of strategically investing in growth, I believe in a disciplined approach to capital allocation with accountability to ensure we are delivering returns commensurate with the investments we make. Maintaining an investment grade rating with a strong balance sheet is critical, as is ensuring we continue to have a diverse set of funding levers. I also believe continuous improvement and operational excellence are critical foundations for profitable growth.\n\nI will be focused on ensuring we have the tools and financial discipline in place to drive profitable, accretive growth and investment projects that further enhance Algonquin's core business. Now, turning to the quarter. Our third quarter 2022 consolidated revenue was $666.7 million, compared to $528.6 million for the third quarter last year. Adjusted EBITDA was $276.1 million, which is up approximately 10% from the $252 million for the same period last year, primarily from growth in the regulated services group.\n\nThird quarter adjusted net earnings was $73.5 million, compared to 97.6 million reported last year. Adjusted net earnings was negatively impacted by an increase in interest expense of $23.3 million as a result of funding to support our growth and an increase in the underlying interest rate. Corporate administrative expenses increased year over year by $8.2 million in the third quarter, primarily from cost to support our growth, as well as the timing of certain expenses. The company recorded increased tax expense year over year of $15 million, driven by lower year-over-year recognition of tax credits, which was mainly a result of revised estimates associated with renewable projects that are now expected to be placed in service in 2023, including New Market Solar.\n\nIn total, our Q3 adjusted net earnings per share came in at $0.11, which compared to $0.15 in the prior year. In addition to the drivers discussed, results were negatively impacted by the increase in the weighted average number of shares outstanding at the end of the quarter due to our earlier equity raise for the Kentucky Power transaction. Looking at results on a segmented basis. The regulated services group delivered $229.3 million in operating profit in the current quarter, which compares to $195.7 million in the same quarter last year, an increase of $33.6 million or 17%.\n\nThis increase reflects the contribution of Liberty New York Water, which was acquired in January. As a reminder, this utility is impacted by seasonality and is expected to earn over 65% of its operating profit during the peak summer months. The implementation of new rates across certain utility systems, including Empire Electric and Granite State, added approximately $12 million as compared to the prior year. The renewable energy group reported third quarter individual operating profit of $71.5 million, which was relatively flat compared to the same quarter last year.\n\nExisting facilities added approximately $4 million to operating profit, which was offset by results from the Texas coastal wind facilities due to higher basis costs and the general transmission constraint imposed by ERCOT. Now, moving on to our capital plan for the year. With the Kentucky Power acquisition now expected to close in 2023, we expect to spend approximately $1.6 billion in capital in 2022. Year to date, we've invested approximately $1.3 billion, including approximately $609 million in connection with the closing of Liberty New York Water.\n\nDuring the third quarter, we invested over $200 million of capital into organic investments intended to improve safety, reliability, and resilience of our network. The company has access to multiple funding sources included asset -- including asset recycling, as evidenced by the recent signing of our inaugural asset recycling transaction. Total cash proceeds from this transaction are expected to be approximately $278 million for the U.S. facilities and approximately $107 million Canadian for the Blue Hill wind facility in Saskatchewan.\n\nWe expect the book a gain in the anticipated range of approximately $55 million to $60 million in the fourth quarter when the deal is scheduled to close. We are pleased with the progress on our inaugural asset recycling transaction. This transaction helps demonstrate the strength of our development platform and the potential value created by our ability to increase the size of our greenfield pipeline and develop and construct projects. Further, with the successful signing of this inaugural asset recycling transaction, the company is currently evaluating further asset recycling opportunity as part of the capital plan for 2023 and beyond.\n\nWe look forward to providing more details in the months to come. Our DRIP program continues to see strong uptake, and we reactivated our at-the-market offering program in the third quarter, which raised approximately $40 million. With the asset recycling transaction projected to close by the end of the year and the delay in the closing of the Kentucky Power transaction, the company does not expect to issue any further equity under its ATM program in 2022. Our liquidity position remains strong, ending the quarter with approximately $2.1 billion of available liquidity.\n\nAt the end of Q3, approximately 22% of our consolidated debt outstanding was subject to variable interest rates. A 100-basis-point increase in the variable interest rate would impact interest expense by approximately $16 million annually, of which, an estimated 70% would be related to our regulated business. For our regulated business, interest rate increases are expected to be recovered in the context of future filings, late filings. From a refinancing perspective, we have several-term facilities and approximately $100 million of long-term debt maturing throughout 2023.\n\nGiven our sufficient liquidity position, we will look to access the capital markets at opportune times, continue to access alternative sources of financing, and make use of our strong banking relationships to extend term facilities as required. Moving to outlook, as a result of factors such as higher interest rates, the pushout to 2023 of the New Market Solar project, and the recent order from the California Commission revising the CalPeco rate case decision to 2023, we are now seeing pressure on 2022 adjusted net earnings per share. As such, we now expect our 2022 adjusted net earnings per share to be within the range of $0.66 to $0.69. Looking ahead into 2023, broadly speaking, we expect pressure from increasing interest rates and broader macroeconomic conditions to impact our earnings.\n\nAlthough we are not providing 2023 guidance, our current view is that we will continue to drive growth in our regulated operating profit, albeit with some regulatory lag, while our renewables business is expected to be relatively flat as new program growth is tempered by lumpiness in our development pipeline. In light of the changing environment, we are reviewing our plans and targets for 2023 and beyond. We expect to provide further details at our upcoming Investor Day in early 2023. With that, I will now hand it back to Arun to outline our strategic plans.\n\nArun Banskota -- President and Chief Executive Officer\n\nThanks, Darren. Before we close out our prepared comments this morning, I want to give an update on our strategic initiatives. The company has continued to execute on strategic priorities, which are positioning us well for the future. Firstly, we see a path toward closing the Kentucky Power acquisition as we now expect to close in January 2023 pending FERC approval.\n\nThe acquisition fits within our three strategic pillars, add scale to our electric modality, and was priced at an attractive valuation level. Secondly, we successfully signed an agreement on our inaugural asset recycling transaction. We are pleased to be partnering with Infrared Capital Partners by setting up 49% ownership interest in three operating wind facilities in the United States, totaling 551 megawatts, and an 80% ownership interest in our 175-megawatt Blue Hill wind facility in Saskatchewan. We are pleased with the transaction multiples.\n\nThe company will continue to oversee day-to-day operations and earn a recurring management fee. At the same time, this transaction provides us with value-accretive capital that will help finance our greenfield pipeline of solar, wind, and storage projects. Thirdly, we are focused on operational discipline while profitably growing. But we also recognize potential pressure from increasing interest rates and a more challenging overall capital markets environment to support our growth given the capital intensity of our business.\n\nConsistent with sound practices and taking into account this changing environment, we continue to evaluate and refine our growth plans. I'm excited about the prospects for Algonquin's regulated and renewables businesses, which are both well-positioned to contribute to and benefit from the decarbonization transformation that is currently underway and which will only accelerate over the coming years. We expect that there are some near-term macro headwinds, but the team is taking a proactive approach to navigate these challenges and position the company to enhance shareholder value over the long term. We look forward to discussing this in more detail at our upcoming Analyst and Investor Day, which is scheduled for early 2023, where we will be providing the investment community the opportunity to hear from key members of the leadership team for an update on our operations, strategic direction, and future growth plans for Algonquin.\n\nWith that, I'll turn the call over to the operator for any questions from those on the line.\n\nOperator\n\nThank you. We'll now take questions from the telephone lines. [Operator instructions] And the first question is from Nelson Ng from RBC Capital Markets. Please go ahead.\n\nNelson Ng -- RBC Capital Markets -- Analyst\n\nGreat. Thanks and good morning, everyone. The first question is just a quick clarification. In terms of your new EPS guidance range, does that include the $55 million to $60 million gain on the asset sales?\n\nDarren Myers -- Chief Financial Officer\n\nHi, Nelson. Yes, it does.\n\nNelson Ng -- RBC Capital Markets -- Analyst\n\nOK. Thanks. And then second question, in terms of your liquidity position, you flagged that you have about 2.1 billion of available liquidity. Is most -- like will most of that be allocated toward the closing of the Kentucky Power acquisition? I think that's like about 1.4 billion, is that right?\n\nDarren Myers -- Chief Financial Officer\n\nYes. So, we would expect with the proceeds of our sell downs to have liquidity probably in the range of 2.5 billion as we exit this year. And yes, we would look to use the credit facilities to fund the transaction as we close it.\n\nNelson Ng -- RBC Capital Markets -- Analyst\n\nAnd then just a follow-up on that, in terms of your interest rate exposure, you flagged that 22% is subject to floating. But obviously, when you draw on the -- when you draw to close the Kentucky Power deal, I guess all of that would be subject to floating as well.\n\nDarren Myers -- Chief Financial Officer\n\nYes, at the outset and until we do other things through next year. So, yes, and that's part of the reason -- obviously, interest rates have changed dramatically over the last 90 days, which is part of the reason that we've given the color on next year with the pressure that the interest rate is causing.\n\nNelson Ng -- RBC Capital Markets -- Analyst\n\nOK. Thanks, Darren. I'll leave it there and get back in the queue.\n\nOperator\n\nThank you. The next question is from Sean Steuart from TD Securities. Please go ahead.\n\nSean Steuart -- TD Securities -- Analyst\n\nThanks. Good morning. Follow-up question on the funding plan, and you referenced lower reliance and raising equity, at least in the near to mid-term, and mitigating rate pressure. Can you talk about is there any willingness or is equity on the table at all at these valuation levels for the company? And can you reference appetite for accelerated capital recycling going forward after this inaugural asset sell down?\n\nArun Banskota -- President and Chief Executive Officer\n\nHey, Sean. Yeah, great question. Look, you know, for the first year, we call it inaugural asset recycling because, obviously, it is the first time we've ever done it, and we liked what we saw. There was a very strong market interest for long-term renewable assets out there.\n\nAnd we are certainly pleased with the level of values that we got. And so, given that experience, it does increase our confidence in being able to continue to do asset recycling much more so than in our past history to fund -- to maximize the equity contribution for our growth needs.\n\nDarren Myers -- Chief Financial Officer\n\nAnd I may just add, as Arun mentioned, I think, in his prepared remarks, I mean, we would like to have less reliance on the equity markets. So, accelerating, you know, the sell downs is one of the, you know, the tools that we have at our disposal to do that.\n\nSean Steuart -- TD Securities -- Analyst\n\nOK. Thanks for that. And can you give us any more context on valuation parameters for this initial sell down given that we don't have asset-level contribution detail? Any multiples you can provide on that initiative?\n\nArun Banskota -- President and Chief Executive Officer\n\nWe talked about a gain of -- in the range of $55 million to $60 million. So, that should certainly provide you some color. And when you look at other multiples, you're probably looking at something in the range of $1,200 per megawatt when you talk about from EV to megawatt ratio.\n\nSean Steuart -- TD Securities -- Analyst\n\nOK. OK. That's all I have for now. Thanks.\n\nArun Banskota -- President and Chief Executive Officer\n\nThank you.\n\nDarren Myers -- Chief Financial Officer\n\nThanks, Sean.\n\nOperator\n\nThank you. The next question is from Rupert Merer from National Bank Financial. Please go ahead.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nHi. Good morning, everyone.\n\nDarren Myers -- Chief Financial Officer\n\nGood morning, Rupert.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nOn the asset recycling strategy, you mentioned there's strong interest in the assets. Are you seeing any pressure on the prices with the rise in rates or are you still seeing attractive prices for assets and maybe would identify that as your lowest cost to capital?\n\nArun Banskota -- President and Chief Executive Officer\n\nWe certainly continue to see that robust level of interest through the process. Obviously, as interest rates were increasing and despite the rising interest rate environment, we believe that there is enough interest from long-term financial and strategic investors for these very prized renewable assets for the long term. So, again, despite the rising interest rates, we continue to see robust interest.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nAnd the mix of buyers that you've encountered, would you say there's more interest in a partial acquisition than a full acquisition of the assets? And is the pricing the same between those two groups, the ones who may want the partial ownership interest versus full ownership?\n\nArun Banskota -- President and Chief Executive Officer\n\nTo -- Rupert, our strategic plan around the renewable asset is really to create that flywheel impact that we've talked about before, right? As you know, we have the ability to do totally greenfield projects on solar or wind or storage. And as we de-risk these projects through the development cycle, as well as the construction cycle, and bring them into operations, we do see that ability to monetize through a partial sell down. At the same time, we do want to continue to grow our development platform and our operations platform. And the added advantage of this strategy is to get recurring management fees through the operating agreement as well.\n\nSo, we do see that on the renewable side as the most attractive options we have, and we'll continue with that strategy.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nOK, very good. And then maybe just finally on the dividend. So, we do have a soft year this year, a payout on an earnings basis. Anyway, it looks it's going to be a bit stretched.\n\nMaybe I need to wait for the Investor Day, but just wondering if you can give us some comments about the payout here and the strategy going forward.\n\nDarren Myers -- Chief Financial Officer\n\nYeah, Rupert, it's Darren here. So, you know, first of all, you know, what I would say is, obviously, the dividend is a very important part of shareholder value for the company. We've previously stated a target of 80% to 90% payout. And you know, there's always going to be, and I think the company's done a nice job of talking about this in the past, is there can be dislocation from year to year on where that target comes in or where it comes in relative to that target.\n\nRupert Merer -- National Bank Financial -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. [Operator instructions] And the next question is from Naji Baydoun and from IA Capital Markets. Please go ahead.\n\nNaji Baydoun -- iA Capital Markets -- Analyst\n\nHi, good morning. Just wanted to go back to the topic of capital recycling. I'm wondering if you can give us a bit more detail about what assets you're thinking of potentially for next year. And is it only on the renewable side, or is it also maybe include some of the smaller noncore utility operations that you have?\n\nArun Banskota -- President and Chief Executive Officer\n\nNaji, we are not prepared to answer that question currently. We are deep in the planning stages right now, and we will certainly give you much more color at our Investor Day.\n\nNaji Baydoun -- iA Capital Markets -- Analyst\n\nOK. What about maybe just sticking to the renewable platform? Should we expect more asset sales on the operating side or are you also looking at maybe development sales?\n\nArun Banskota -- President and Chief Executive Officer\n\nOn the renewable side, just like I talked about earlier, Naji, I think, you know, we have a great development platform, and we've done a great job of even de-risking all of these projects through the development and construction cycle and bringing them into operations. And we believe that we can maximize value by asset sell downs at that stage, at its early stages of operations. And so, that's where we'll probably continue to go.\n\nNaji Baydoun -- iA Capital Markets -- Analyst\n\nOK. OK. Got it. And just then, maybe a question on Kentucky.\n\nI'm wondering if you can talk about some of your plans for the business next year. Any key priorities for 2023? And then maybe longer term, what would need to happen to maybe try to accelerate the greening initiatives within Kentucky?\n\nArun Banskota -- President and Chief Executive Officer\n\nWell, one of the key things for us is to -- and then to work on the IRP that we plan to file in front of the commission in early 2023. And that will certainly give you a lot more visibility into how we plan to serve the customers and communities of Kentucky. Obviously, with the IRA, we believe that the potential to green the fleet is an even more compelling value proposition. So, we were very excited about the benefits we can, in fact, bring to our customers and communities in Kentucky.\n\nNaji Baydoun -- iA Capital Markets -- Analyst\n\nSo, do you think the IRA maybe helps to accelerate some of those plans?\n\nArun Banskota -- President and Chief Executive Officer\n\nAbsolutely, both accelerate and increase the size of the benefits to our customers.\n\nNaji Baydoun -- iA Capital Markets -- Analyst\n\nOK. Got it. Thank you for those details. Look forward to the Investor Day.\n\nArun Banskota -- President and Chief Executive Officer\n\nThanks, Naji.\n\nOperator\n\nThank you. The next question is from Rob Hope from Scotiabank. Please go ahead.\n\nRob Hope -- Scotiabank -- Analyst\n\nGood morning, everyone. Just a question on the guidance. Can you maybe give a walk to the new range from your old range and maybe kind of comment on what kind of the headwinds could persist into 2023, and I guess, also, what the original expectation of the asset sale gains was in there.\n\nDarren Myers -- Chief Financial Officer\n\nHi, Rob. I'm not sure if we're going to be able to give you all that transparency. You know, what I will tell you is that the large factors that change the sharp increase in the interest rates, the push out of the tax credits, those were the large items that changes, obviously, lots of moving parts within our plan, and they change as the year goes on. And we're always juggling those things.\n\nBut those are the two things that led to changing the guidance. And then when we reflect on next year, you know, I think consistent really with the internal plan, we expect the renewables business to be somewhat flat based on this lumpiness of the developments. And then we have that continued pressure from the increased interest rates, I'd say, is the main driver for next year. And, you know, we're just attempting to be as transparent as we can and just to be helpful, and we will get more color on that at our Investor Day.\n\nArun Banskota -- President and Chief Executive Officer\n\nFor 2020, I would just add one more thing to what Darren said, which was also the push out of the order from the California Commission, which we had expected this month, in fact, in November. And that has been pushed out to 2023. And so, that was the one additional item to what Darren just explained.\n\nRob Hope -- Scotiabank -- Analyst\n\nAll right. Appreciate the color. Thank you. And then as a follow-up, just you mentioned commercial and industrial discussions on the renewable power side.\n\nCan you maybe comment on how rising rates, you know, inflationary pressures are being reflected in those conversations? I guess also with the IRA, you know, are we seeing a wider kind of bid-ask spread between where, you know, you're expecting pricing should be and where they are or, you know, are the -- is the new environment being reflected in these discussions?\n\nArun Banskota -- President and Chief Executive Officer\n\nYeah, Rob. Interestingly, we have not seen any slowdown in the C&I off-taker's plans and strategies in terms of growing their renewables plans and commitments. In fact, given some of the challenges, just like what we're seeing in PJM with interconnection, there is an even greater demand from C&I off-takers. And look, we have seen the implications of inflation certainly on our, you know, supply agreement, as well as our in EPC contract.\n\nBut that has definitely been more than balanced by the increased prices we are seeing on the off-take contracts as well. And again, that has always been a consistent part of our development tenet, which is to try and sign those three agreements, the two on the cost side, the supply agreement and the EPC contract, and the one on the revenue side of the contract as concurrently as possible so that we are able to preserve our margins.\n\nRob Hope -- Scotiabank -- Analyst\n\nAppreciate that. Thank you.\n\nArun Banskota -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nThank you. The next question is from Nelson Ng from RBC Capital Markets. Please go ahead.\n\nNelson Ng -- RBC Capital Markets -- Analyst\n\nGreat. Thanks. I just want to touch on your, I guess, your capital plan in terms of 2023. So, can you just give a bit of color in terms of the flexibility in your capital plan? I'm just looking at last year's Investor Day presentation and you had about like 1.2 billion of utility capex forecasts for 2023.\n\nSo, big picture, like how much of that is discretionary? And is it fair to say that inflation will be obviously impacting the capital plan?\n\nArun Banskota -- President and Chief Executive Officer\n\nSo, Nelson, look, I mean, again, we wanted to be very transparent and tell our investors and analysts about the headwinds we are seeing. We obviously are working and have a lot of levers at our disposal. You know, one of the -- as context, we have always been a fairly capital-intensive company. And on -- for example, you know, our capital intensity has been anywhere from three to seven times our dividend.\n\nSo, your question, is there a room? Absolutely, yes.\n\nNelson Ng -- RBC Capital Markets -- Analyst\n\nOK. And then just one other quick question. In terms of your, I guess, discussions with the regulators, are you generally seeing some pushback on affordability and pushback on rate increases? I know there's been news in Nova Scotia about that, but I'm just wondering, given that you have a number of utilities in many regions, what's the general sense you're getting? Like, are regulators telling you to defer any discretionary capital, or what's the color?\n\nArun Banskota -- President and Chief Executive Officer\n\nLook, you know, customer affordability is always a topic of conversation, whether it's through rising interest rate environment or a rising inflationary environment or not. And we're always focusing on, you know, how do we value the best and lowest prices, you know, for our customers through whether energy efficiency programs, you know, different financial assistance programs, and all those kind of things. Is that conversation going to continue? Absolutely. Have we seen any lots of pushbacks from regulators about, you know, the amount of capital that goes into the regulated entities? We've tried to make sure that we find the capital and the amount to make sure that it's fulfilling the requirements of our customers, whether for safety or reliability or those other requirements.\n\nSo, you know, we're comfortable that we can continue to manage the capital needs while making -- ensuring the safety and reliability and customer and affordability for our customers.\n\nNelson Ng -- RBC Capital Markets -- Analyst\n\nGreat. Thanks, everyone. I'll leave it there.\n\nArun Banskota -- President and Chief Executive Officer\n\nThanks, Nelson.\n\nOperator\n\nThank you. There are no further questions registered at this time. I'd like to turn the meeting back over to Arun Banskota.\n\nArun Banskota -- President and Chief Executive Officer\n\nThank you for everyone who's been able to join us this morning on the call. And with that, please stay on the line for our disclaimer.\n\nAmelia Tsang -- Vice President, Investor Relations\n\nOur discussion during this call contains certain forward-looking information, including but not limited to our expectations regarding earnings, capital expenditures, pending acquisitions, asset recycling transactions, and growth. That forward-looking information is based on certain assumptions, including those described in the most recent MD&A filed on SEDAR and EDGAR and available on our website and is subject to risks and uncertainties that could cause actual results to differ materially from historical results or results anticipated by the forward-looking information. Forward-looking information provided during this call speaks only as of the date of this call and is based on the plans, beliefs, estimates, projections, expectations, opinions, and assumptions of management as of today's date. There can be no assurance that forward-looking information will prove to be accurate, and you should not place undue reliance on forward-looking information.\n\nWe disclaim any obligation to update any forward-looking information or to explain any material difference between subsequent actual events and such forward-looking information, except as required by applicable law. In addition, during the course of this call, we may have referred to certain non-GAAP measures and ratios, including but not limited to adjusted net earnings, adjusted earnings per share or adjusted net EPS, adjusted EBITDA, adjusted funds from operations, and divisional operating profit. There is no standardized measure of such non-GAAP measures, and consequently, our method of calculating these measures may differ from methods used by other companies, and therefore, they may not be comparable to similar measures presented by other companies. For more information about both forward-looking information and non-GAAP measures, including a reconciliation of non-GAAP financial measures to the corresponding GAAP measures, please refer to our most recent MD&A filed on SEDAR in Canada and EDGAR in the United States and available on our website.\n\nAnd that concludes our conference call.\n\nOperator\n\nThank you. [Operator signoff]\n\nDuration: 0 minutes\n\nAmelia Tsang -- Vice President, Investor Relations\n\nArun Banskota -- President and Chief Executive Officer\n\nDarren Myers -- Chief Financial Officer\n\nNelson Ng -- RBC Capital Markets -- Analyst\n\nSean Steuart -- TD Securities -- Analyst\n\nRupert Merer -- National Bank Financial -- Analyst\n\nNaji Baydoun -- iA Capital Markets -- Analyst\n\nRob Hope -- Scotiabank -- Analyst\n\nMore AQN analysis\n\nAll earnings call transcripts"
}