{
  "companyName": "DraftKings Inc.",
  "companyTicker": "DKNG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/draftkings-inc-dkng-q3-2022-earnings-call-transcri/",
  "content": "DraftKings Inc. (DKNG 1.06%)\nQ3 2022 Earnings Call\nNov 04, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the DraftKings Q3 2022 earnings call. [Operator instructions] I would now like to turn the call over to your host, Stanton Dodge, chief legal officer. You may begin. \n\nStanton Dodge -- Chief Legal Officer\n\nGood morning, everyone, and thanks for joining us today. Certain statements we make during this call may constitute forward-looking statements that are subject to risks, uncertainties, and other factors as discussed further in our SEC filings that could cause our actual results to differ materially from our historical results or from our forecast. We assume no responsibility to update forward-looking statements other than as required by law. During this call, management will also discuss certain non-GAAP financial measures we believe may be useful in evaluating DraftKings' operating performance.\n\nThese measures should not be considered in isolation or as a substitute for DraftKings' financial results prepared in accordance with GAAP. Reconciliation of these non-GAAP measures to the most directly comparable GAAP measures are available in our earnings presentation, which can be found on our website and in our quarterly report on Form 10-Q filed with the SEC. Hosting the call today, we have Jason Robins, co-founder, chief executive officer, and chairman of DraftKings, who will share some opening remarks and an update on our business; and Jason Park, chief financial officer of DraftKings, who will provide a review of our financials. We will then open the line to questions.\n\nI will now turn the call over to Jason Robins. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nGood morning, everyone. I hope you've all enjoyed the first 2 months of NFL and college football as much as I have and are excited about all of the other sporting events going on, including the MLB playoffs in the first few weeks season for the NBA and NHL. We're also getting ready for the start of college basketball in the World Cup later this month. As you know, the fall is always a very exciting time of the year for DraftKings for the past sports calendar featuring the 4 major North American sports active at the same time as well as many other exciting events.\n\nI want to discuss a few topics today, starting off with our very strong third quarter. In short, our product and technology, trading, customer service, and marketing teams all executed extremely well, which resulted in the best multistate NFL kickoff in our history based on our September handle and gross revenue share. We are very well prepared, and I'm very proud of the team for executing so effectively. Customers have enjoyed the new features that we rolled out around the start of NFL season such as quick parlay, Quick same-game parlays, and the ability to combine most of the same-game parlays.\n\nOur parlay handle mix increased 500 basis points year over year in Q3, and our parlay bet mix increased 1,500 basis points. And our innovative early payout capability, otherwise known as seven up or 10 app, engage both new and existing customers. We had an excellent launch in Kansas on September 1 with more rapid customer acquisition on a population-adjusted basis than we have with any other state launch, resulting in very attractive cash. For the month of September, we led the state and handle share with more than twice that of the second largest operator.\n\nAnd based on the states that reported operator-level handle and GGR data through September, we are capturing GGR share that is at or above our long-term target as industry activity continues to coalesce toward a very limited number of operators. We announced in September that Amazon selected DraftKings as a sponsor in an exclusive pregame provider for Thursday night Football on Prime Video. This is a unique opportunity to engage with customers in a true digital environment. Our multiyear collaboration with Amazon will deliver fans engaging pregame content and unique betting offers on Thursday throughout the NFL season.\n\nAs part of our agreement with Amazon, Thursday Night Football features DraftKings' integrations in its live pregame show, including odds and additional sports betting insights. DraftKings and Amazon will also collaborate on TNF team offerings, including same-game parlays, which are available on the DraftKings' sports book app. Our content will be featured in all 15 Thursday Night football games on Prime Video during the 2022 NFL season. In terms of financials, our third quarter revenue was $502 million, much higher than expected, supported by favorable sport outcomes as well as the aforementioned excellent execution across product, technology, trading, customer service, and marketing.\n\nAdjusted EBITDA was negative $264 million, also much better than anticipated due to flow-through from higher revenue and expenses shifting out of Q3 into Q4, despite marketing investments into our Kansas launch that had not been included in the expectations that we provided in early August. 2022 has been a transformative year for DraftKings. We have shifted more attention toward cost controls and our path to profitability. We identified over $100 million of annual cost savings and has significantly slowed year-over-year fixed cost growth as evidenced by our Q3 results.\n\nWhat I am most proud of, though, is that we've been able to do all of this while continuing to focus heavily on top-line growth, winning competitively, and most importantly, on retaining and growing engagement with our customers. We are also seeing a benefit to our marketing efficiency from shifting toward national advertising and away from local spending, considering we're now live with mobile sports betting in 18 states that collectively represents 37% of the U.S. population. In the third quarter, we acquired more new customers at a 10% lower average CAC relative to the third quarter of 2021.\n\nAnd looking ahead, we'd expect cash to decline as our state footprint continues to expand. The progress we have made over the past year on our product, customer service, and internal operations has been tremendous, and our Q3 results demonstrate all of these points with both revenue and adjusted EBITDA significantly exceeding our expectations. It is evident that the hard work of our team this year is paying off, and we believe we are striking a great balance between maintaining an aggressive and customer-focused growth plan while simultaneously working to manage expenses. This combination of revenue growth and expense management creates a clear path to profitability that is consistent with the long-term gross margins and adjusted EBITDA margins that we have consistently articulated.\n\nNow I'd like to move on to our financial outlook. For 2022, we are excited to be raising the midpoint of our revenue guidance by $45 million. We are also increasing the midpoint of our 2022 adjusted EBITDA guidance by $10 million. Our guidance now includes our launch in Kansas as well as our expected launch in Maryland in Q4 and prelaunch marketing investment for Ohio that we expect to launch on January 1, 2023, with both Maryland and Ohio pending licensure and regulatory approval.\n\nThese three states were not included in our prior adjusted EBITDA guidance. Therefore, we are improving our guidance despite the addition of these additional marketing investments. We are also excited to share our initial 2023 outlook today, which reflects our core principles of maintaining strong growth and customer engagement while also continuing on our path to profitability as well as having a cost structure that supports our long-term market goals. For 2023, we are introducing revenue guidance of $2.8 billion to $3 billion and adjusted EBITDA guidance of negative $575 million to $475 million.\n\nUnlike our prior guidance, our outlook now reflects our existing state footprint, including Kansas, as well as expected launches subject to lifecare regulatory approvals in Maryland, Ohio, and Massachusetts, as well as Puerto Rico. As we've stated previously, we expect that the fourth quarter of 2023 only one year away from now will be our first quarter with positive adjusted EBITDA. Additionally, as previously stated, we are well-positioned from a balance sheet standpoint to reach profitability under most reasonable legalization scenarios without needing to raise any additional capital. We expect to end 2022 with a cash balance that is roughly double the high end of our guidance for our adjusted EBITDA loss in 2023.\n\nAnd while it's too early to guide full year 2024, our current multiyear plan suggests that we'll be approximately breakeven on a full-year adjusted EBITDA basis in 2024, assuming legalization and launch trends remain consistent with prior years. Looking ahead, the outlook for state launches continue to be positive. We anticipate launching OSB in Maryland in the fourth quarter of 2022; in Ohio, Massachusetts, and Puerto Rico in 2023. which would bring our penetration of the U.S.\n\npopulation to 45%. Californians will vote on whether to legalize OSB on November 8. We are still deploying grassroots efforts, but the most recent polling suggests a likely unfavorable outcome for our coalition. The DraftKings has discontinued additional cash investment in the campaign.\n\nPlease note that DraftKings 2022 investment in California was approximately $17 million. And lastly, while it's still too early to know which states may pass OSB and iGaming legislation in 2023, we expect that several states will actively consider legislation. So there's a lot to be excited about on the regulatory front. We remain confident in our long-term outlook that states comprising 65% of the U.S.\n\npopulation will ultimately permit legalized OSB, and states comprising 30% of the U.S. population will ultimately permit legalized iGaming. Now I'd like to spend a few more minutes providing additional detail on our recent product enhancements. We have continued to expand the content and functionality of our Sportsbook product, which drives efficient customer acquisition as well as long-term engagement retention.\n\nThe wagering content we launched for the 2022 NFL season included head-to-head match-ups, several new multiplayer props, and flash player market, and full-time and anytime square. Head-to-head matchups include spreads, moneylines, and totals on all our player subcategories to improve the depth of our derivative player offering. Multiplayer props include game and highest total from a list of options to increase the variety of player prop bet types. Player flash props include player-specific next drive and next play markets to increase the depth of our player performance offering.\n\nIn full-time and anytime squares is our model-driven squares product, which we've now extended to every day in the season. DraftKings also added new functionality such as early payout for moneyline wagers, quick parlay, and quick click same-game parlay as well as the ability for users to combine multiple same-game parlays. Early payout is a newly introduced mechanic to settle moneyline best once the team reaches a certain point lead. Quick parlay is a new interface for customers to build larger parlays with more cross-sport play as well.\n\nQuick SGP features dozens of prepackaged same-game parlay best per game for all same-game parlay sport. And SGPx allows customers parlay same-game parlays with other same-game parlays and singles from different games, which increases the size and average leg count at parlays. It has been an exciting 12 months of product and technology innovation enabled by our vertical integration with much more to come. For iGaming, we recently introduced player contributed jackpot in response to customer demand and are only operator in the U.S.\n\nwith its in-house capability. Players can opt in for an additional modest wager for a chance to win potentially hundreds of thousands of dollars. We believe this product functionality will increase customer engagement and demonstrates our continued differentiation from competition. And now I'll turn the call over to DraftKings' CFO, Jason Park, who will discuss our third quarter results and refreshed outlook. \n\nJason Park -- Chief Financial Officer\n\nThanks, Jason. And hello, everyone. I'll start off by providing more granularity pertaining to Q3, and then I'll shift to the outlook for Q4 and 2023. Please note that all income statement measures discussed except for revenue are on a non-GAAP adjusted EBITDA basis.\n\nWe executed very well in Q3. Customer activity was robust supported by new product functionality that we rolled out around the start of the NFL season. We have continued to look at detailed cohort data and are not seeing any discernible indication that the macroeconomic environment is impacting our overall customer engagement. In Q3, we generated $502 million of revenue and negative $264 million of adjusted EBITDA, both significantly outperformed the expectations that we provided on our Q2 call in August.\n\nOur B2C segment revenue increased 161% versus Q3 of 2021 as compared to Q2 2022's year-over-year growth rate of 68%. Sport outcomes certainly were favorable to operators this quarter, lapping unfavorable outcomes last year. Our strong execution across acquisition, retention, and monetization initiatives for our core product offerings was also a driver of our outperformance. In Q3, favorable sport outcomes contributed approximately $70 million of revenue.\n\nOn our call in August, we provided a rule of thumb for you to understand potential revenue volatility in Q3. As most of you are well aware, it was an operator-friendly quarter. NFL underdogs generally did well in September. For example, three of the biggest underdogs one in week one, including Seahawk, Steelers and Bears.\n\nIn addition, several Sunday Night, Monday Night and Thursday Night Football games fell in our favor. These games tend to attract higher handle per game relative to other NFL games. And isolating just these 11 primetime games in the third quarter, our hold rate was greater than 10%. It's important to note we launched Kansas on September 1, and we have not included that in our prior guidance due to significant uncertainty about that launch date.\n\nKansas generated negative $8 million of net revenue in the quarter, consistent with our standard new state launch playbook. Kansas is off to a fantastic start. Net revenue growth also benefited from a less promotional environment than in Q3 of 2021. For the industry as a whole, we saw more rational behavior, which we expect to persist.\n\nAnd within the DraftKings business, we deployed more surgical promotions based on player-specific gross profit profile and, as we have consistently reiterated, are reinvesting less as cohorts mature. We had 1.6 million monthly unique payers in Q3, which is 22% higher than the prior year period. It's important to remember that Q3 2021 included the conclusion of the NBA playoffs, while the NBA playoffs were completed before Q3 in 2022. Notably, in September alone, MUPS increased 27% year over year to 2.7 million, which is typically our seasonally strongest month of the year for MUPS DUE to the kickoff of the NFL season.\n\nAverage revenue per monthly unique payer or ARPMUP, more than doubled on a year-over-year basis to $100 with solid gross margin flow-through. This balance of player growth and revenue per player growth is very healthy as promotional intensity naturally declines as states mature. Adjusted EBITDA in Q3 was negative $264 million, which is $50 million better than the negative $314 million of adjusted EBITDA in the prior year period, and significantly outperformed the expectations for Q3 that we provided on our August call, primarily due to the higher-than-anticipated revenue. Our Q3 performance was especially impressive, given that it included investment in our Kansas launch, which was not included in our previous guidance.\n\nAdditionally, certain expenses, principally within our marketing and G&A line items, shifted out of Q3 and into Q4. As a reminder, revenue upside driven by favorable outcomes and revenue downside driven by unfavorable outcomes typically flows through to our adjusted EBITDA at a high incremental margin, given certain expenses within our cost of revenues are tied to deposits and handles rather than gross or net revenue. Gross margin rate for Q3 was 34% and increased 100 basis points compared to the third quarter of last year. On a year-over-year basis, the inclusion of New York and our continued mix shift out of our DFS product into our growing Sportsbook and iGaming products significantly limited our gross margin rate improvement.\n\nHowever, I was pleased that the OSB and iGaming states, where we were live prior to Q3 2021, saw an increase in gross profit of over $110 million, primarily due to revenue growth as well as a meaningful reduction in promotional intensity. We continue to expect our gross margin rate to be approximately 40% for full year 2022 and to improve in 2023 into the low to mid-40% range as our promotional intensity naturally declines across our portfolio of states. Sales and marketing expense was up 8% versus Q3 of 2021. For our states that have been live for more than a year, external marketing spend was down 20% on a year-over-year basis, and we generated significant contribution profit from these seats in Q3 2022 compared to a deep loss in Q3 2021, which was largely driven by unfavorable outcomes.\n\nWe continue to be pleased with our LTV to CAC ratios and continue to be on track for a 3-year gross profit payback. As we mentioned on our Q2 call, our fixed expense growth began to moderate meaningfully in the third quarter, with products and technology and general and administrative expenses up 37% and 28%, respectively, compared to the prior year period. The growth in P&T expenses is primarily the result of the additional engineering and product management resources we've added over the past year to help build the best product in the industry and to continuously strengthen our data science capabilities. For G&A expense, the growth is largely a reflection of the increased investment in our customer experience capabilities, which we expect will continue to grow as we add new customers but at a slower pace than previous quarters as we reach scale and lap the significant investments we made late in the second half of 2021 and early in 2022.\n\nMoving into guidance. Please note that unlike the guidance that we have provided in the past, we are now guiding 2022 and 2023, inclusive of states that have legalized and in which it is reasonably foreseeable that we will launch during the guided period. Specifically, our 2022 guidance now includes Kansas, which launched in September; as well as Maryland, which we expect to launch in the fourth quarter; and prelaunch marketing spend related to Ohio, which we expect to launch on January 1, 2023, both pending licensure and regulatory approvals. Looking at 2022, we are pleased to be raising our full-year revenue outlook to a range of $2.16 billion to $2.19 billion from a range of $2.08 billion to $2.18 billion, which increases the midpoint of our guidance to $2.175 billion from $2.13 billion.\n\nThe midpoint of our increased revenue guidance implies 68% growth compared to the full year 2021. We are increasing our revenue guidance due to the strength we saw in our online gaming verticals in Q3. For newly included states, we expect Maryland to contribute negative revenue as we invest in the state in the early weeks following its launch. In Q4, we expect to generate about $790 million in revenue based on the midpoint of our 2022 revenue guidance, which represents substantial year-over-year growth and planned reinvestment in customers who have significant unlucky outcomes early in the football season.\n\nOur Q4 expectations also reflect continued softness in the broader NFT market, which has impacted our new Reignmakers vertical. Looking at MUPS and ARPMUP, we expect ARPMUP growth to be higher than MUPS growth for the full year. Moving on to our adjusted EBITDA guidance. We are improving the midpoint of our full year 2022 guidance by $10 million to negative $790 million despite now including Kansas, which launched in September, as well as investments in expected state launches for Maryland and Ohio.\n\nThe significant improvement in our 2022 adjusted EBITDA guidance on a comparable basis was primarily driven by higher revenue, combined with cost discipline, particularly in the marketing and G&A expense lines. I'm proud that we expect to land materially better than where we thought at the beginning of the year despite launching in new states. There has been an ongoing effort throughout the year to drive and capture efficiencies, which has resulted in more than $100 million of in-year cost savings in 2022. We will continue to focus diligently on this area of the business for the remainder of this year and beyond.\n\nFinally, I want to reiterate that we continue to expect at least 10 states to be contribution-profit positive for full year 2022. Today, we are also introducing 2023 guidance for revenue and adjusted EBITDA. We expect revenue for full year 2023 to be between $2.8 billion and $3.0 billion and adjusted EBITDA for full year 2023 to be negative $575 million to negative $475 million. For our full year 2023 guidance, we are assuming that Maryland launches in Q4 2022, Ohio and Massachusetts launch in Q1 2023, and Puerto Rico launches in Q3 2023.\n\nWe expect launches in new jurisdictions on a combined basis to generate less than 5% of full-year 2023 revenue and to account for approximately 25% of our full-year 2023 negative adjusted EBITDA. In 2023, we expect gross margin to improve slightly relative to 2022 as we reduce promotional intensity in more mature states, partially offset by new state launches and continued mix shift out of DFS. Our population weighted average state age will be 2.6 years exiting 2023 versus 1.8 years exiting 2022. And as that number appreciates, the gross margin rate is expected to improve dramatically.\n\nWe expect fixed cost growth to slow meaningfully, while variable marketing will largely depend upon how many new users we acquire. Last, I'll touch on our liquidity position. With close to $1.4 billion in cash as of September 30 and our guided adjusted EBITDA range for the fourth quarter, combined with expected other usages, we are poised to exit the year with between $1.1 billion and $1.2 billion of cash. Based on our 2023 adjusted EBITDA guidance and other expected cash usages next year, we expect to end 2023 with more than $500 million in cash on the balance sheet.\n\nIt's important to note that a significant amount of our 2022 cash outflows, such as $97 million in net cash paid for GNOG are not expected to recur in 2023. Looking out to 2024, we would expect adjusted EBITDA to be roughly breakeven on a full year basis under most reasonable legalization and launch scenarios. So in summary, we believe we are well capitalized to become free cash flow positive with existing resources, and the business is on a clear path to achieve our long-term gross margin and EBITDA margin targets. That concludes our remarks, and we will now open the line for questions. \n\nOperator\n\n[Operator instructions] Our first question comes from Dave Katz with Jefferies. Your line is open.\n\nDave Katz -- Jefferies -- Analyst\n\nHi. Good morning, everyone. I wanted to just touch on Golden Nugget for a minute, and I realize it's not right down the middle and probably why it isn't necessarily core of the discussion. But iGaming becomes discussed more and more, its profit potential, its long-term growth, etc.\n\nHow are you doing with that? What are you doing with that? What can you share with us? And how should we look at its prospects, please? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nThank you. Great question. So everything is going really well with the integration. We started to realize some synergies, particularly on the marketing side.\n\nReally, the biggest synergies will come next year when we migrate the entire Golden Nugget operation onto our platform. So very excited about that. That should hopefully be in the back half of the year, we'll complete that migration. So everything is on track.\n\nTeams are gelling really nicely and really excited about the future of Golden Nugget as a way to penetrate deeper into the iGaming market. \n\nDave Katz -- Jefferies -- Analyst\n\nCan I follow up please on that? Is it in and of itself? And are we able to tell, is it profitable today? Is it offsetting some of the investments that you're making on the OSB side? And is it large enough to do that? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nWe haven't broken out Golden Nugget separately, but I believe we said that we expect any impact to the bottom line to be de minimis. \n\nDave Katz -- Jefferies -- Analyst\n\nUnderstood.\n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\n2022.\n\nDave Katz -- Jefferies -- Analyst\n\nYeah, understood. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Shaun Kelley with Bank of America. Your line is open.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning, everyone, and thank you for taking my question. Jason or Jason, just wanted to ask a little bit more about kind of hold versus product mix. Obviously, Jason Robins, you outlined a bunch of new product initiatives, and your parlay mix being materially higher in the quarter.\n\nI imagine a lot of those changes are here to stay. So we're sort of trying to wrap our minds around go-forward hold rates as some of these new product initiatives take hold. And sort of what's the ability to push that percentage higher relative to what we saw in the quarter, which is obviously a lot of luck based outcomes as well? So if you could just talk about some of those trade-offs and how you thought about it or what's baked into 2023. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. Great question. I think that a lot of progress has been made on the whole front, primarily driven by our improvement in vet mix year over year. That's largely been product, as well as merchandising and marketing.\n\nSo as mentioned, we launched a whole host of parlay, same-game parlay, as well as combinations of multiple same-game parlays, launch prepack, many other features. And I think the team has done a great job merchandising and marketing those 2, including through our NFL Thursday Night Football, relationship with Amazon. So lots of, I think, parts of the company executing to drive that mix, and it's definitely improved hold rate, and I think we should continue to see improvement. We feel like there's a lot of tailwind there.\n\nAs far as what's baked in, we've been pretty cautious about baking in improvement. I think as usually is the case with our guidance, we typically only include things that we have clear line of sight to. I think 2022 has been a great example of that. In February, we guided to minus $875 million in EBITDA.\n\nNow we're guiding to minus $790 million, and that's with the inclusion of Ontario, Maryland, Ohio, and Kansas, which were not in the $875 million. So almost $100 million better on the bottom line with the absorption of four state flash province launches. And that was because at the time, that's what we had line of sight to. But we rallied the team around a number of different cost initiatives throughout the year.\n\nWe're able to over -- save over $100 million in year savings. So that's typically how we approach guidance, and I think it's the same thing here, where we're guiding to what we feel like we currently have line of sight to and can make a commitment to. We very much view our credibility as the most important thing, and I wanna make sure we're never signing up to a number that we don't think we can achieve. But we always go out there and try to do better, too.\n\nAnd I think 2022 is a great example of that, where we continually, throughout the year, we're able to improve guidance despite the launch of new states each and every quarter. And so that's our goal every year, and that's what we're gonna try to do again in '23.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. And then maybe as my follow-up, could you just talk a little bit about how you're thinking about sort of some of these fixed marketing investments relative or in sponsorship deals relative to variable going forward? Obviously, the big Amazon partnership you outlined for Thursday Night Football. ESPN is another one, where you have a relationship, but there could potentially be more.\n\nSo just maybe strategically, how are you thinking about investing in these types of deals where maybe there's more committed spend relative to things that could be more variable and more directly tied to top-line outcomes?\n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nThe majority of our marketing spend is not committed. It's completely controllable. We're pretty selective with deals, but we feel really good about the Amazon deal. I think it's one the better deals that we've had in recent years and very excited about the results we've seen through the first several weeks of Thursday Night Football with that one.\n\nBut no, most of our marketing spend is not committed. We like to keep flexibility so that we can optimize in and out of things. \n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much. \n\nOperator\n\nOne moment for our next question. Our next question comes from Ed Young with Morgan Stanley. Your line is open.\n\nEd Young -- Morgan Stanley -- Analyst\n\nHi. My first question is just a clarification really. You touched on it, Jason Park, in comments, but I wonder if you could quantify the EBITDA impact from Kansas and the Q4 investments in Maryland and Ohio just to give us a sense of your underlying assumptions you're making in this year's guidance. And then my broader question, again, any sort of quantification would be useful about how you think about operating leverage into next year? So could you give some color on the moving parts, particularly around promotions of your sort of GGR, NGR conversion around the marketing ratio and your kind of opex growth versus cost out for next year? Thanks.\n\nJason Park -- Chief Financial Officer\n\nYeah. Hey, great to hear from you. Yes, absolutely. Our full year 2022 and the 2023 guide that we provided today includes Kansas, which has obviously already launched, as well as the expected imminent launch in Maryland, Ohio, and we've also included Massachusetts and Puerto Rico.\n\nIn terms of Q4, what you're seeing there is a little bit of flow-through from the slightly lower revenue outlook in Q4, and that slightly revenue -- lower revenue outlook is due to the planned reinvestment in a very surgical way for players who had unlucky hold in Q3, as well as some headwinds from the Reignmaker product. So that's impacting the Q4 EBITDA. But the major change in the Q4 EBITDA is the inclusion of Maryland and Ohio, which we are now including in the Q4 EBITDA guide. And then in terms of 2023, again, we are including Massachusetts, Maryland, Ohio, Puerto Rico.\n\nAnd as I mentioned on the call, about 5% of the revenue guide comes from those new states, and 25% of the EBITDA loss comes from those new states. So if you think about the implied flow-through with and without new states, I think you're well north of a 60% implied flow-through on the incremental revenue in 2023 on a no new state basis. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. I think that's an important takeaway. One of the things, I think, that is very different this year and this quarter, I should say, is that we guided with new states, and we've never done that before. We realize that's a shift, and it's a response to investors saying, \"Listen, if you have line of sight with relative certainty to state launch dates,\" and we do in that we received our license Maryland.\n\nIt's not a certainty, but it's a pretty narrow window. We expect to launch there. Same pending. Of course, additional approvals that we require.\n\nSame thing in Ohio pending approvals. They've set Jan 1 as they launched Dayton, Massachusetts, the Gaming Commission voted to launch in March. So felt like those were sufficiently close enough around the quarter and had sufficient certainty around, at least, a narrow range of timing. Obviously, if something changes, we'll come back and update.\n\nBut that is a change, and I think may have muddied the waters a little bit on some of the comparisons that did not include those states. And as Jason Park noted, if you take out those states, we're guiding to under $400 million loss in 2023. So I think that or at least some of the analyst numbers out there, that might be a more apples-to-apples comparison versus the guide we just provided, which was for the first time including several new states.\n\nJason Park -- Chief Financial Officer\n\nAnd then, Ed, on your question, just broadly on cost going into 2023, the -- I think the right way to think about it as you look at the 2023 guide, the commentary on gross margin rate. If you look at the implied total operating expense growth, I think you're looking at single-digit growth rate going into 2023. We've talked about on the last few quarters a meaningfully slower fixed cost growth next year. So on a total opex, you're looking at single digits.\n\nAnd we're not breaking out how much of that is variable marketing versus fixed marketing, but certainly a meaningful slowdown in cost, and I've also mentioned that we're continuing to look for more and more opportunities on that front. \n\nEd Young -- Morgan Stanley -- Analyst\n\nThank you, and I appreciate all the detail there. And I think the 525 split for the new launches next year is particularly useful to give us the like-for-like comparison. But just on the Q4, are you able to or are you not able to give us a quantification of the investment for Maryland and Ohio, the cost shift Reignmaker, to give us just an idea? You've obviously beaten quite decently in Q3 and not much has been passed on to the full year guide in terms of EBITDA. So just trying to think about what the underlying looks like there? \n\nJason Park -- Chief Financial Officer\n\nYeah. I mean what I do is I think you can flow through the revenue decline and that the revenue -- sort of a slightly lower revenue outlook in Q4 to the Q4 EBITDA, and you can basically say the rest due to the new states. \n\nEd Young -- Morgan Stanley -- Analyst\n\nPerfect. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Jason Bazinet with Citi. Your line is open.\n\nJason Bazinet -- Citi -- Analyst\n\nI just had a quick question on I think, are pretty significant share gains that you've had across a number of states, and I was just wondering if you can confirm that that's true. And then b, is that sort of tethered to the lower promotional activity that's going on? Or would you pin that on some of the enhancements that you've made? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nThank you. Yeah, we did see a nice share increase to start NFL. We typically do very well in NFL relative to other sports. So there's a little bit of seasonality in there.\n\nBut if I had to point to it, I would say the two things you touched on are the biggest drivers, the product enhancements, which have been substantial. We shipped a lot of stuff right before NFL, and I think that created some real interesting points of differentiation as well as closed all-material competitive gaps. And then secondly is the lower sort of promotion, which is a larger story, really is a subset of the more rational competitive environment we're seeing this year versus last year was truly night and day as far as the competitive environment and the rationality behind it. There was still certainly some aggressive investments by some of our competitors, but nothing that was, I think, out of the ordinary.\n\nAnd I think certainly, the change in that promotion environment as well as in the external marketing spend of some of the competitors helped us gain some share as well. But if I had to, like I said, point to anything, I'd say it's the product enhancements that we made, probably No. 1. And No.\n\n2 would be the more rationalizing competitive environment. And then No. 3 would be that this is seasonally typically a better time a year for us, given our strength in NFL. \n\nJason Bazinet -- Citi -- Analyst\n\nThat's great. I like the ranking. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Jed Kelly with Oppenheimer. Your line is open.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nHey. Great. Thanks for taking my question. Just circling back on MUPS.\n\nGiven your, I guess, the higher hold, did you see elevated churn in September and October? And I think, Jason, you mentioned MUPS grew 27% in September. Can you give us the October growth rate? And then just a follow-up question. Just on Amazon, Jason, you mentioned strong customer engagement. Can you sort of speak to some of the metrics you're seeing around engagement with the Amazon Thursday Night football deal? Thank you. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nSure. I'll start on the second one. So really, there's 2 things that have been, I think, the primary kind of benefits of that relationship. One, just the new customers that we've acquired; and two is by really pushing same-game parlay on Thursday Night Football, which is a perfect setup for it.\n\nIt's the one game on, so it's a great time to do that. We've seen real material movement in that mix, so those have been two real positive stories from that partnership. And as far as MUPS, I think the key thing with MUPS has been that last year, if you're looking at the -- this is why we broke out September because it is a little bit neater of a cleaner of a comparison. But if you look at 2021, July had -- I think it was a few games of MBA.\n\nSo that drove up that July up number quite substantially. Whereas this year, MBA ended in Q2, so we didn't get any Q3 MBA. July, obviously, given the way the MUPS calculation is doing, is done is one-third of the calculation. So that definitely was, I think, the biggest kind of story in why the Q3 MUPS growth was less than the September MUPS growth.\n\nAnd then on the flip side of that, the really significant growth in ARPMUP, part of that was the same thing because the denominator for last year included only some players that only participated in a handful of days in July. They were primarily MBA players that didn't come back until September for NFL. That revenue number per player as a numerator/denominator thing looked a little bit better this year, I think. So always hard to tell, given that the sport calendar changes year over year, so it's a bit of a complex thing.\n\nIt's always hard to kind of tell, which is why we don't guide to MUPS and APRMUP. It's a nice KPI and a good measure of the health of the business, but you add into things like predicting as the MBA playoffs going to go into July when you start thinking about guiding to MUPS or ARPMUP. So we've just sort of stayed away from it because it's a little volatile given the sport calendar changes. \n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nGot it. But is churn has sort of been in line with what we thought it would be given the above-average holds?\n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. I mean, I think that when we look at churn, we look at it on a player-by-player basis. So there have certainly been some optimizations we've made year over year to pair back bonus hunters and other sorts of things that, I think, is good churn. But as far as the underlying health of the cohorts, we're seeing the same thing that we've seen in previous quarters and continue to see no real impact from anything micro like higher hold nor -- in terms of churn, nor are we seeing any impacts on the macroeconomic environment either.\n\nSo we continue to keep an eye on that. That's something we monitor very closely, but the cohorts from all respects look very healthy to us. \n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nThank you. \n\nOperator\n\nOne moment for our next question. Our next question comes from Carlo Santarelli with Deutsche Bank. Your line is open.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nHey, guys. Thank you. Just back on that point, Jason Park, you mentioned earlier that the 3Q unfavorable loss kind of led to some tactical reinvestment in the 4Q or that you're programming for the 4Q. I'm assuming most of that was in October.\n\nBut as you think about your experience to date with players whose accounts have basically gone to zero, what does the retention look like on that customer once they've already kind of gone through their funding? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. I mean it's a good question. I think that's probably a little granular for what we'd like to cover on an earnings call. But what I will say is that we have quite a few model-based trigger campaign setup to try to reach players before their balances go down to zero.\n\nAnd I think that also reinvestment, and you noted that's part of why you're seeing the Q3 to Q4 -- or excuse me, Q4 into Q3 revenue shift. We actually, last quarter, did it the other way around. But then given the outcomes came in, we flipped it this time. That's a result of us trying to make sure that our players are staying active that when there are negative sport outcomes, we're giving them good promotions to get them to reactivate.\n\nAnd that there's an overall sort of amount of return to player that we're still -- I mean it's the ultimate question. But every day, we get a little smarter in understanding what that should look like to maximize long-term lifetime value. So that's really how we look at it, is there's a number of different levers between some that are uncontrollable, like sport outcomes, some that are controllable like promotional intensity. And there's probably an optimal total return to player that needs to be reached, and it's probably different for different segments of players, and we're constantly trying to optimize that equation. \n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. Thank you And then if I could, just one follow-up as it pertains to the balance sheet. The cash used in the period was about, I think, about $132 million. You guys spent, I think, somewhere in kind of software costs, etc., $22 million or so in the period and had the $264 million EBITDA loss.\n\nSo that $150 million gap, so it looks like a source of cash. Could you kind of bridge that for me? Is there something that I'm missing in there? \n\nJason Park -- Chief Financial Officer\n\nYeah, Carlos. So basically, the major part of the bridge is the working capital a source of cash in Q3. So if you recall back in Q1, Q2, we had slight uses of cash, in Q3 as a source of cash. And I would just comment that on a full year basis, we don't -- I don't anticipate working capital being a meaningful source or use of cash, consistent with businesses of our type. \n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. Thanks, Jason. Appreciate it. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Michael Graham with Canaccord Genuity. Your line is open. \n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nThe first question is just you mentioned the national advertising mix, and I just wonder if you could give us an update on where you are in the arc of transforming that mix. And what do you expect kind of the terminal mix between national and local to be? And then I just wanted to ask Jason, about how you're thinking about the probability, I guess, that the U.S. economy will go into a recession next year. How would you expect that to impact your business? And how is it affecting your planning? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\n[:p id=\"667743992\" name=\"Jason Robins\" type=\"E\" :]Yeah. Good question. So on the first one, We've, over the last few years, said that as we get to north of around 35% of the population having legal online sports betting, that would be a turning point where national advertising would start to become, in many cases, more efficient than local advertising. We're just crossing that threshold now.\n\nWe are in states that represent about 37% of the population, so just starting to see some small impacts and favorability from that. As I think we noted on the call, we had CAC that were 10% better than we expected, and we actually beat our total forecast for new customers acquired. So we were able to get scale and efficiency, and I think part of that is starting to get a little bit of benefit from this national advertising shift. That should only continue to increase.\n\nWe have states right now that represent 8% of the population that are in the next 5 months or so projected to launch the ones that we mentioned, Maryland, Ohio, and Massachusetts. Pending licensure and regulatory approvals, of course. That will really start to add additional tailwind, and then it really just continues to go from there because as each new state comes on, you're reaching customers that already are seeing those national ads. You don't have to advertise locally as much anymore.\n\nSo really, I think, a big tailwind behind our back now, and you're starting to see that in some of the Q3 results. And then I'm sorry, what was the second question? \n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nJust how you're thinking about a recession, a possible recession. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. So we've definitely looked at different scenarios where if there were some kind of recession and if it were impactful to consumer behavior of our segment of customers that what could that look like, what would that mean for revenue next year, what would that mean for how we have to manage costs. So we're well prepared for that. And right now, we're not seeing any sign of that.\n\nSo we're managing to the environment that we are seeing, but we are prepared to shift pretty quickly if we do start to see anything that concerns us. And fortunately, right now, we're not seeing that, but always good to be prepared. \n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nThank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Bernie McTernan with Needham. Your line is open.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thanks for taking my question. Since you last struck the partnership deal with ESPN, even though it's just a short time ago, the landscape of U.S. sports betting has changed a lot.\n\nSo thinking about key priorities with any media partnership now as we sit here versus a couple of years ago, are there any major changes that you would look for now that maybe weren't a key priority a couple of years ago? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nI think with anything we're doing, we're looking at it the same way, which is what is the impact of any partnership we might establish on our financials over the course of the partnership and, if relevant, beyond. And does that check out against what we view as the expense of the partnership? So really, that's how we evaluate everything. If you look at it kind of down to some of the more specific KPIs, as noted in the past, we look at gross profit payback of 3 years or less for new customers, and I think that's something that always comes into play because many partnerships with media companies are mostly about customer acquisition. So that's really how we've always looked at it.\n\nNothing has changed too much there. I will say that the environment has improved dramatically year over year and that some of the deals that really at that time, I think last year, we had to pass on. I think in today's environment, would be more rationally priced. So we're always keeping an eye out for opportunities.\n\nBut also, as I noted earlier, we have more than half of our marketing spend and actually substantial -- excuse me, more than two-thirds of our marketing spend as variable, and we like to keep flexibility around being able to optimize in and out of things. So always very careful before doing any partnership that we have historical data from testing on those channels and feel very good about the commitments we're making in light of the benefits that we expect to receive. \n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. That's really helpful. And then as a follow-up, you spoke about the same profitability framework for 4Q '23 irrespective of California passing. Now that it doesn't seem like California is gonna pass, and you're not gonna have those customer acquisition costs in the quarter.\n\nAre those gonna be redeployed into anywhere else that maybe now you have the luxury you're spending on that you didn't -- that there's a chance you wouldn't have prior? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nThat's a great question. The answer is yes. So we had a California plan and a non-California plan. Obviously, anything can happen if we all wake up on Tuesday and Wednesday, I guess, and find out it passed, and we'll pivot back to the California plan.\n\nBut it wasn't the same plan, it wasn't as simple as saying we tack on California to what we just guided to now. There are definitely trade-offs that would have needed to be made and that we are prepared to make if California was to launch. So great question. And I think really, what we've continuously said is that we are absolutely committed to controlling our own destiny that we have a clear path to profitability with cushion on the cash balance that we have today, and that was irrespective of whether California launched or not.\n\nAnd so we had two different plans, one with and one without California. Right now, we're planning on executing the without since that looks like where it's going, but we're ready to pivot on a dime if we get a pleasant surprise, although that's certainly not what I'm expecting next week. \n\nBernie McTernan -- Needham and Company -- Analyst\n\nOK. Thanks, Jason.\n\nOperator\n\nOne moment for our next question. Our next question comes from Ryan Sigdahl with Craig-Hallum. Your line is open.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nGood morning, guys. Two questions for us. The first one, curious, parlay is a big focus, obviously, for everybody and you guys. But what about in-game betting? How has that trended as a percent of sales last few quarters and then expectations going forward? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nSo in-game betting is definitely also an area of focus. We've seen since we've launched continued improvement in mix of live betting. I think one of the really interesting things about the early win promo that we ran this year is that part of the design behind it was you're paying out in game and can we use that to then merchandise and drive more live betting, and we've seen really good, I think, impact from when we've had those early payouts on driving up live betting. So it definitely continues to be a focus.\n\nI know we've talked about parlay a lot, but that's just because we felt like that was where the biggest gap was competitively on the bet mix side and why we are holding below at least FanDuel. So I think that that's really why we talked a lot about that, but it doesn't mean internally that live betting hasn't been a big focus, and it continues to be -- it's a great way of keeping the customer engaged throughout the game. \n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nAnd then just as I think about DraftKings relative to FanDuel, it seems like you guys are a bit more aggressive relatively speaking on, you mentioned early, win and some of those other creative promotions and reinvestment in some temporary short-term unlucky players, etc., outcomes, but a little bit less on the national advertising. How do you think about balancing new player bonuses versus existing player retention loyalty versus national and kind of brand-building marketing? Thanks. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. It's a very important question. It's one of those along with the kind of return to player question and I mentioned earlier that really important for us to continue to optimize what's the right balance of -- if you think of all of it as sort of this broad category of marketing, what's the right balance of advertising spend versus promotional spend. And I think we're still along our journey of figuring that out, but definitely get smarter every day.\n\nAnd I think this year, we were able to improve how we've optimized against both such that the overall rate of promotion was lower for us this year. Our advertising spend on a per customer basis, or CAC I should say, has improved. We mentioned 10% better than expected in Q3 this year, and we've been able to do all that while still hitting or exceeding our new customer targets. So feel like we've made great progress there, but there's still a lot of work to be done to figure out the right balance of where those investments are made. \n\nOperator\n\nThank you. One moment for next question. Our next question comes from Joe Stauff of Susquehanna. Your line is open.\n\nJoe Stauff -- Susquehanna International Group -- Analyst\n\nThanks. Good morning. First question, I just wanted maybe to follow up on kind of users. I think you said for the full year, Jason Park, that the relationship between MUPS and monetization, there'll be more monetization.\n\nBut I was wondering to what degree? I mean obviously, in the third quarter, you had 22% MUPS growth and significant monetization. Just wondering if you can, say, tighten up sort of expectations in terms of that relationship in the fourth quarter and really how you think about it based on your 2023 guide. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. So great question. I think some of it is controllable. Most of it's not.\n\nSo a big reason why you saw substantially more ARPMUP and MUP growth in this quarter or in Q3, I should say, was the MBA bleed into July last year. And this year, you didn't. So that obviously drove the denominator up last year, drove it down this year. But then in turn, also increased the ARPMUP.\n\nSo I think some of that is sort of just sport calendar-dependent. For us, we're trying to maximize total long-term player LTV regardless of what form that comes in. So we don't really look at it as one is better than the other, it's more how do we maximize the LTV that we're generating from the players that we acquire. So that's really what guides us.\n\nAnd I think in the short term, we look at maximizing revenue, but also making sure that we're not doing that at the expense of future revenue either. So really, we look at it more holistically, and I think those KPIs are more just a measure for us to understand underlying what's going on in the business. \n\nJoe Stauff -- Susquehanna International Group -- Analyst\n\nMakes sense. And then as a follow-up, I was wondering what your expectations were for World Cup relative to your 4Q guide. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. World Cup will be interesting. We haven't really talked too much about it. We're not breaking it out separately as we do with any other sports.\n\nSo it will be interesting to see what kind of engagement we get, and I think that's probably one of the examples of something that if it significantly outperforms our expectations could be a positive catalyst for the quarter. But we don't have a ton of data on World Cup, so it's really tough to say what to expect from it. \n\nJason Park -- Chief Financial Officer\n\nAnd certainly, Joe, not a lot of data of World Cup in Q4. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYes, exactly. Makes a big difference. \n\nJoe Stauff -- Susquehanna International Group -- Analyst\n\nAnd could I just squeeze a last one and just in terms of your DFS is, how did DFS, I guess, perform in the third quarter? Is it kind of still like low single-digit type grower? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah, that's about right. DFS continues to be a slow grower for us but one that's very important because in addition to providing revenue that flows through at a very high margin, it also is really a huge source of new customers for us every time we enter a new state for OSB or iGaming. \n\nJoe Stauff -- Susquehanna International Group -- Analyst\n\nThanks, guys.\n\nOperator\n\nOne moment for our next question. Our last question comes from Jordan Bender with JMP Securities. your line is open.\n\nJordan Bender\n\nThanks for taking my question. On the iGaming side, can you talk about the pace of new content coming on to your platform? And then maybe any improvements you've made on that end? \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. The biggest thing that we just launched, and this was a big one that was a lot of work in the making, very proud of the product team, was our jackpot functionality. It's totally unique to the market. No one else -- no other operators have it.\n\nbasically allows players to opt in to a separate jackpot pool, which then once it hits gets paid out, usually very high sums. So really appealing interesting, attractive product that I think gets at a lot of what players are looking for, which is the opportunity to put a small amount of money to work and potentially get a big payday. So very excited about that. That's the most significant thing we've launched.\n\nThroughout the year, though, we've been launching tons of new content lots of games. Some of which are homegrown and unique, some of which are through third-party integrations. But always looking to build out the content and make sure that we have both the best and most popular titles out there, but also unique and differentiated offerings like our rocket game or like this jackpot functionality that we just recently launched. \n\nJordan Bender\n\nGreat. Thanks, Jason.\n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nI'd now like to turn the call back over to Jason Robins, CEO, for any closing remarks. \n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nThank you for all joining us today on the call. We had an excellent third quarter. Really excited about performance there, and we feel we're really well-positioned. Very, very strong finish to 2022 and really well setup for 2023 going into 2024, which we expect to be roughly breakeven, potentially our first full profitable year.\n\nAnd then, of course, Q4 of 2023, which we expect to be our first quarter of positive adjusted EBITDA. So very excited about the future, only one year away, we think, from our first positive adjusted EBITDA quarter. I look forward to speaking with you all over the next few weeks and hope everybody stays safe and well and enjoys a very exciting time on the sports calendar through the remainder of the year. Thank you. \n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStanton Dodge -- Chief Legal Officer\n\nJason Robins -- Co-Founder, Chairman, and Chief Executive Officer\n\nJason Park -- Chief Financial Officer\n\nDave Katz -- Jefferies -- Analyst\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nEd Young -- Morgan Stanley -- Analyst\n\nJason Bazinet -- Citi -- Analyst\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nBernie McTernan -- Needham and Company -- Analyst\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nJoe Stauff -- Susquehanna International Group -- Analyst\n\nJordan Bender\n\nMore DKNG analysis\n\nAll earnings call transcripts"
}