{
  "companyName": "Lemonade, Inc.",
  "companyTicker": "LMND",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/lemonade-inc-lmnd-q2-2022-earnings-call-transcript/",
  "content": "Lemonade, Inc. (LMND -1.16%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, everyone, and a warm welcome to the Lemonade Inc. Q2 2022 earnings call. My name is Melissa, and I'll be your operator. [Operator instructions].\n\nI now have the pleasure of handing over to our host today, Yael Wissner-Levy to begin. Yael, over to you.\n\nYael Wissner-Levy -- Vice President, Communications\n\nGood morning, and welcome to Lemonade's second quarter 2022 earnings call. My name is Yael Wissner-Levy, and I am the VP communications at Lemonade. Joining me today to discuss our results are Daniel Schreiber, co-CEO and co-founder; Shai Wininger, co-CEO and co-founder; and Tim Bixby, chief financial officer. A letter to shareholders covering the company's second quarter 2022 financial results is available on our investor relations website, investor.lemonade.com.\n\nBefore we begin, I would like to remind you that management's remarks on this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the risk factors section of our Form 10-K filed with the SEC on March 1, 2022, and our other filings with the SEC. Any forward-looking statements made on this call represent our views only as of today, and we undertake no obligation to update them. We will be referring to certain non-GAAP financial measures on today's call, such as adjusted EBITDA and adjusted gross profit, which we believe may be important to investors to assess our operating performance.\n\nReconciliations of these non-GAAP financial measures to the most directly comparable GAAP financial measures are included in our letter to shareholders. Our letter to shareholders also includes information about our key operating metrics, including a definition of each metric, why each is useful to investors and how we use each to monitor and manage our business. With that, I'll turn the call over to Daniel, who will begin with a few opening remarks. Daniel?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nGood morning, and thanks for joining us to review our Q2 results and our outlook for the second half of 2022. We'll touch on a few important themes this morning. Some of these are laid out in more detail and with accompanying graphs in our shareholder letter. So if you haven't read it this quarter, I do encourage you to.\n\nLet me start by saying that our second quarter was strong with both bottom and top lines beating our expectations. In Force Premium or IFP was $458 million and our adjusted EBITDA came in at negative $50 million. Overall, we feel that our business is beginning to hit its stride with improving loss ratios, increasing cross-sells and upsells and the seasoning book. All three lead us to believe we will see peak losses this quarter with losses declining in Q4, and even as we continue to grow, an expectation of shrinking losses year-on-year thereafter as we progress on our path to profitability.\n\nLet me expand briefly on each of the three drivers I mentioned, loss ratios, cross-sells and seasoning. Beginning with loss ratio. At 86% in Q2, our loss ratio is still showing the strains of inflation though a favorable trend line has emerged as we've shed 10 percentage points of loss ratio over the past two quarters. In our shareholder letter, for the first time, we provided an overview of our machine learning models and the projected lifetime loss ratios these generate.\n\nThese are hugely powerful tools for managing our business and may be unique in our industry. A letter expands on why it is these leading indicators rather than the guided variety loss ratios that we use in our day-to-day management at Lemonade. The upcharge is that our leading indicators strongly suggest that the business we are writing today will prove profitable even if lagging indicators take a few years to fully reflect this. Indeed, an analysis of our new cohorts gives us confidence to reiterate our expectation that our business will operate on a multiyear average loss ratio below 75%.\n\nAs we explained in the letter in a deep sense, it already is. Notwithstanding this positive trend, we do expect some bumps along the way. For one, we expect the acquisition of Metromile, about which Shai will expand shortly to add something like 3 to 5 percentage points to our loss ratios for the next few quarters. For another every now and then a cat event will put an unforeseen dent in our loss ratios.\n\nAnd thirdly, while inflation persists, regulatory approval cycles can create a lag between us identifying the need for price change and our ability to implement it. We're being very proactive in managing this risk. But thinking with regulatory cycles in an inflationary environment is an imperfect science and short-term mismatches of risk and rate are liable to recur. If they do, these two will present as a bump in our loss ratios.\n\nTo state the obvious, expecting occasional reversals is entirely consistent with our expectation that on a multiyear average, our loss ratios will be sub-75%. And as a reminder, we have a robust reinsurance program that shields our EBITDA from the worst effect of short-term spikes in loss ratios. Shifting to cross sells and upsells. In Q2, almost one quarter of our sales were cross-sells or upsells.\n\nThat's an all-time record for us, and it's part of a steady up into the right progression that we've been tracking for some quarters. In a few markets, where Lemonade car has launched, the numbers are better yet, and about a third of our business in those states is from cross-sells and upsells, sales that typically have zero  marketing costs associated with them. In this end, too, the acquisition of Metromile and our continued draw-out of Lemonade car bode well. While accounting for a quarter or even a third of new sales, only about 4% of our approximately 1.7 million customers have more than one Lemonade product today.\n\nI say this to highlight that while we're making solid strides, we've barely begun to unlock the potential of growing with our customers. This has long been a core plank in our strategy, and it's gratifying to see the impact it's having in recent quarters, let alone to extrapolate to where this can go over time. The third trend I wanted to highlight is that we are fast approaching the tipping point where the return on our earlier investments outstripped the costs of new investments. It's not just that more and more of our sales are zero cost cross-sells or upsells, it's also that more and more of our book consists of seasoned products and customers.\n\nWe have said all along that while the cost of launching new products, new markets and acquiring new customers are heavily front-loaded, these will prove profitable in the fullness of time. That's what's happening. The passage of time is steadily moving more and more of these undertakings from the investment column to the return on investment column. Here too, it's early days, and that's good news.\n\nTo underline the point, consider that almost three quarters of our premiums in Q2 were from customers who have been with us less than two years, and none of our pet or car customers have been with us that long. So while our book is more seasoned than it was, it remains unseasoned by comparison to what it will be and indeed in comparison to what our competitors enjoy today. The passage of time, in other words, is on our side here, too. The upside is that even as we continue to launch new products in new territories to new customers, we have tender corner.\n\nWe expect our losses to peak this quarter, Q3, and to continue to shrink thereafter, starting a clear path to profitability. And that path to profitability brings me to my final update. Being public with a highly liquid stock means that capital is readily available to us, but the cost of capital have jumped considerably, and with about $1 billion in the tank, we see no need to be dependent on further capital raisers. So we've changed gears with the aim of reaching profitability without having to top up.\n\nThis means we've decelerated our spending on growth and hiring. As Tim will detail in our guidance, this will result in a more rapid improvement in our EBITDA, a slower rate of growth, and we believe no need for further fundraising. To be clear, we will continue to execute on our strategy just at a moderated clip. We're changing pace, we're not changing course.\n\nAnd even as our losses shrink, we will continue to grow, though not at our full potential. We think that's the right trade-off while cost of capital are elevated though it's a trade-off we will revisit as the cost of capital wax and wane. To wrap up my comments, I'd say that our business is doing what it was designed to do. Our past investments in new products, customers and markets are bearing fruit.\n\nWe believe we are nearing the point of peak losses and on a path  to profitability, and we've moderated our pace so that we can reach the end of that path without being forced raises of capital. And on that note, let me hand over to Shai for some updates on our acquisition of Metromile. Shai, over to you.\n\nShai Wininger -- President, Chief Operating Officer, and Co-Founder\n\nThanks, Daniel. We closed the Metromile acquisition just under two weeks ago and are feeling very good about how the deal shaped up. Let me start with some numbers. We issued less than $145 million worth of stock for this acquisition and in return, received over $155 million in cash and equivalents, nearly 100,000 new customers, over $110 million of IFP, a 49-state licensed insurance entity and telematics driving data from about 0.5 billion road trips.\n\nThe number of states where we are live with a car insurance product jumped from three to 10, and this segment lapped from 1% of our IFP to about 20% overnight. Daniel touched on the cross-sell implications of a wider footprint for our car product. And this still is certain to pay dividends in how fast we can grow with our customers. But probably the most exciting part of the transaction is the data, the data science models and the car experience teams that are now part of Lemonade.\n\nTen years ago, Metromile pioneered the use of continuous driving data feeds to predict losses per mile driven. It is this decade-long head thought, now powered by the Lemonade experience and technology that makes this combination so promising. Metromile's car mountain sensors have been driven across billions of miles generating unique and proprietary data sets. These were cross-referenced with hundreds of thousands of claims closing the loop and enabling driving behaviors to be scored for risk with great granularity.\n\nAuto insurance is an extremely competitive market with a steep learning curve that can prove to be unpredictable and costly. The most vulnerable time in the life of an insurance product is during its early years before data accumulates. Incorporating Metromile's decade-long data and knowledge means reducing that risk and spending less cash along the way. In addition to skipping some of the painful learnings of the car business, the deal also delivered some meaningful synergies, having a single tech stack, a single brand, a unified team, and a unified product line, is far cheaper than funding competing brands, competing teams, competing systems and siloed products.\n\nFor all these reasons, we have high expectations from this deal and from the Lemonade car more broadly. But it's important to note that we're not planning to rush it. And for those of you who are looking for hints on how car is doing based on number of policies sold, please note that we deliberately throttle the growth of car and plan to take the next several quarters to ensure we grow with a healthy loss ratio and acquisition economics. And with that, let me turn it over to Tim.\n\nTim?\n\nTim Bixby -- Chief Financial Officer\n\nGreat. Thanks, Shai. I'll give a bit more color on our Q2 results as well as expectations for the third quarter and the full year, and then we'll take your questions. We had another strong quarter of growth, driven by additions of new customers as well as a continued increase in premium per customer.\n\nIn Force Premium grew 54% in Q2, as compared to the prior year to $458 million. We believe that this metric is useful to understand the full scope of our top line growth before the impact of reinsurance and regardless of the timing of customer acquisition during the quarter. Premium per customer increased 18% versus the prior year to $290. This increase was driven by a combination of increased value of policies over time as well as a continuing mix shift toward higher-value homeowner, car,  and pet policies.\n\nAs in the prior quarter, roughly 80% of the growth in premium per customer in Q2 was driven by this product mix shift including cross-sales and the remaining 20% from increased coverage levels and pricing. Gross earned premium in Q2 increased 60%, as compared to the prior year to $107 million, roughly in line with the increase in In Force Premium. Revenue in Q2 increased 77% from the prior year to $50 million. The growth in revenue is driven by both increase in gross earned premium as well as a modest reduction in the proportion of premium ceded to reinsurers, which was 70% in the quarter as compared to 75% in the prior year.\n\nAlso of note, our quota share reinsurance structure changed as of July 1, 2022, as it did a year ago at this time such that we began to seed 55% of our premium to reinsurers for the treaty year that ends June 30, 2023. For the year just ended June 30, 2022, we were seeding 70% as noted. And our guidance does reflect this change. Our gross loss ratio was 86% for Q2, as compared to 96% in Q4 2021 and 90% in Q1 2022.\n\nOperating expenses, excluding loss and loss adjustment expense, increased 28% to $87 million in Q2 as compared to the prior year, and this is primarily driven by increased personnel expense, stock-based compensation expense and legal and professional fees, partially offset by the impact of increased sales and marketing efficiency. We also continued to add new Lemonade team members in all areas of the company in support of customer and premium growth and to support geographic product expansion and thus saw increases in each of the other expense lines as compared to the prior year. Global head count grew 52% versus the prior year to 1,135 with a greater growth rate in product development and underwriting teams. Notably, our head count is essentially flat versus six months ago, up less than 2% as we continue to see efficiency gains in personnel expense.\n\nOur net loss was $67.9 million in Q2 or $1.10 per share as compared to the $55.6 million we reported in the second quarter of 2021 while adjusted EBITDA loss was $50.3 million in Q2 as compared to $40.4 million in the second quarter of 2021. Our total cash, cash equivalents and investments ended the quarter at approximately $1 billion, reflecting primarily a use of cash for operations of $80 million since year-end 2021. And with these goals and metrics in mind, I'll outline our specific financial expectations for the third quarter and an updated view of the full year 2022. For the third quarter of 2022, we expect In Force Premium at September 30 of between $595 million and $600 million; gross earned premium between $127 million and $129 million; revenue between $63 million and $65 million and an adjusted EBITDA loss of between $74 million and $69 million.\n\nWe also expect stock-based compensation expense of approximately $16 million. Capital expenditures, approximately $3 million, and we also note that we expect our share count, which will be weighted for additional shares issued in connection with the Metromile acquisition to total approximately 67 million shares at the end of the third quarter. For the full year of 2022, we expect In Force Premium at December 31 of between $610 million and $615 million; gross earned premium between $476 million and $480 million; revenue between $236 million and $239 million; adjusted EBITDA loss between $245 million and $240 million; and we expect stock-based compensation expense of approximately $60 million, capital expenditures of approximately $10 million, and a share count weighted again for the additional shares issued in connection with the Metromile acquisition, totaling approximately 70 million shares for the fourth quarter. And as Daniel noted, we do continue to expect that Q3 will be our quarter of peak EBITDA losses.\n\nAnd with that, I would like to turn the call over to Shai. Shai?\n\nShai Wininger -- President, Chief Operating Officer, and Co-Founder\n\nThanks, Tim. We'll now turn to the top-voted shareholders' questions submitted through the Say platform. And we'll start with Paper Bag who's asking how we expect Lemonade car to be rolled out in terms of availability and customer account, specifically calling out Texas, California and New York. And some others, including Matthew S also asking about Lemonade car and the impact of Metromile on the mix.\n\nSo I covered much of this in my earlier comments, in our letter [Inaudible]. So I hope you feel you've received answers, but let me add this. We plan to proceed expanding our car business with both excitement and humility. Excitement because the opportunity appears endless.\n\nPeople love the product and we can't wait to see it to use across the nation. But there's also humility because we appreciate the complexity involved in getting a car insurance product growing fast while achieving profitability. Going back to our comments in the shareholders letter, we use machine learning LTV models to decide where we spend every marginal marketing dollar. Our models take many parameters into consideration, including the cost of acquisition, the churn loss ratio and even potential cross-sells.\n\nRight now, our latest model, LTV6, is pointing our growth teams toward more profitable targets such as our pet product. This brings me to another point, which is competitiveness. Beyond having a superior experience, the key to creating a competitive car product and growing it fast is price. Now it's important not to confuse having the best pricing with having the lowest prices.\n\nThese two are not the same. And to be able to compete on price while achieving profitability, you need to be able to separate the good drivers from the risky ones better than the competition does. And that's where telematics comes in. The idea of using telematics for insurance has been around for a long time.\n\nBut for traditional insurers, incorporating telematics is easier said than done. Two decades after progressive introduced telematics, their usage of that technology massively lags our own. In fact, it has been estimated that less than 4% of Americans with car insurance have telematics, and even those 4% almost always turn it off after two weeks. Because two-thirds of drivers drive less than average, most drivers who use telematics could see 30% to 40% savings if they were properly passed on to them.\n\nThat's great news to us, but not really for incumbents with tens of billions of auto insurance dollars on their books. For them, wholesale adoption of telematics and surely matching rate to risk would likely lead to huge losses of revenue as they'll require massive rate cuts for most of their book. It also means they'll likely need to do a major rate hike for the remaining third of the book, which can lead to massive churn. Unlike the 4% telematics adoption in the market, we are seeing a number closer to 90%, and the option of that is that our wholesale adoption of telematics allows us to graduate from pricing, which is mostly based on car, make and model as others have done for generations to a pricing that's based on actual driving behavior.\n\nHaving said all that, we're still looking to be very intentional about how we grow this business. And with Car now being 20% of our book and over $100 million in IFP, we need to improve its loss ratios before we seek to grow it aggressively. Going to the question about availability of Car in Texas, California and New York. As the Metromile deal closed, we're now live in California.\n\nWe're actively working on Texas and New York and expect to be live in both states among others, within one year. The next series of questions were around our cash flow. More specifically, Darin asked if our risk of failure is substantially lower today than it was at the time of our IPO just a bit over two years ago. Jacob Jay asked whether we will need to raise capital again.\n\nSo Daniel's introductory comments in our shareholders' letter detail how we're thinking about the cost of capital and how we believe that we're putting ourselves on a course to be cash flow positive without additional rates. I trust that this answers most of the questions on this topic. But in a more direct answer to Darin, our business has derisked significantly since the IPO. What we described as our expectations and aspirations at the time has, by and large, turned into reality.\n\nFor example, at the time of our IPO, we were a monoline business with a plan to launch additional products and turn into a multiline carrier. In two years since we've launched not one nor two, but three products, pet, life and car, making us the only multiline insurtech in the U.S. At the time of our IPO, we told shareholders that a big part of our strategy was actually growing with our customers and meeting their insurance needs as they go through predictable life cycle events. Two years later, our cross-sells and upsells account for about a quarter of our sales and growing.\n\nAt the time of our IPO, we had under $300 million in the bank. Today, we have approximately $1 billion. So by all measures, pretty much, Lemonade is significantly derisked. At the same time, we don't, for a second, believe that we have delivered on our potential and believe that we have decades of growth potential ahead of us.\n\nDerisking is nice, but it isn't our destination becoming one of the largest, most advanced and definitely most loved insurance brand in the world is. Lastly, we have some questions around our stock price. Jacob Jay asked if Lemonade shares are fairly valued at the value of $20. And if we see a buyback plan at these levels as being a good capital allocation? To be honest, with all that's going on with the world and the markets right now, our share price doesn't really preoccupy us.\n\nOur job is to manage the company and not the stock, which is a good thing because share prices are overwhelmingly driven by factors beyond our control, such as monetary policy and investor sentiment. As for buybacks, those are excellent for companies with access capital rather than access opportunities. That's not us. Our capital is there for growing our business and that's where it will go.\n\nAnd with that, let me hand the call over to the operator so we can take some questions from our friends on The Street.\n\nOperator\n\nThank you. [Operator instructions]. Our first question today comes from Michael Phillips of Morgan Stanley. Michael, over to you.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nThanks. Good morning, everybody. First question, kind of a high-level question. If we go back not too far from kind of the formation of Lemonade, your target customer was those that the incumbents didn't either want to touch or couldn't because of their cost efficiencies.\n\nThese were customers that were -- you described as first time, a lot of them were first-time insurance buyers. And your idea was to please and delight them over time. I think these are some of your words so that they -- as they mature, they would stay with you and get a car, get a house, get a pet and stay with Lemonade. And that led to a certain marketing strategy, I think, on your part of target customers.\n\nSo the question is now that you're not just a monoline company and have done great strides in kind of extended wings, but to what extent does this different kind of company leads to a different marketing strategy and a different customer base that's no longer looking for just that one policy, but the multi-policies that you offer?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nMichael, good morning. Thanks for the question, and I appreciate your memory of the things that we said all those years ago. It's gratifying. At a fundamental level, the strategy is unchanged.\n\nSo we do still see the majority -- even overwhelming majority of our customers arriving not from a competing brand where we've enticed them to switch and save as the whole industry does, but rather picking the fruit off the tree, getting customers coming in for the very first policy. So that core element of our strategy remains very powerful and does account for the majority of our book. Indeed, as best we can tell for the majority of our new sales as well. But a couple of things have changed.\n\nSo one is that we now have multiple entry points. So back in the day, really renters was the only on-ramp that we had. So if you weren't looking to enter the insurance well through renters, we probably weren't able to attract you. Today, maybe before you're renting, you have a car or maybe before but if you have a pet or you need a life policy, you've just had your first child or -- so we are finding that the new products that we are offering are not merely cross-sell opportunities, they are also incremental on-ramps.\n\nAnd depending on the product, we do still see that the majority of those customers as best we can tell, the data on this is not cut in short. But as best we can tell, a still first-time buyers of insurance more often than not. The second thing that's changed, of course, is that an increasing portion of our policies are now not to new onboarded customers but to the existing installed base. So if we're somewhere in the ballpark of 1.7 million customers now post the Metromile deal, we do now have a huge value unlock in selling to them.\n\nSo an increasing portion of our sales aren't new sales at all that to existing customers, but that's very much in accordance with the strategy, as you correctly summarized it. It's just a more mature application of that strategy.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nOK. That's helpful. The second question I have, I want to preface by saying it's my lack of understanding of your machine learning and your AI, clearly much different than yours, but help me here, when you talk a lot of discussion on predicting lifetime loss ratios. And in fact, for each customer that you onboard, you can do that.\n\nAnd so I want to be able to understand how for -- if I had to pick between two companies where the Company A had a mature, been around for a long time, mature stable customers and didn't have a lot of changing of its mix versus a company that did have those things. I think I feel more confident that they could say those things. And so help me understand how -- for a company that's 73% of the premium comes from customers [Inaudible] less than two years. How do you -- how can you -- how do you have confidence that you can predict these lifetime loss ratios with such a changing mix of business? That's just something I want to try to understand.\n\nThank you.\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nSure. Paradoxically, the company like us where, as you say, you had the least history is the place where you need it the most, a business that is unchanging, where this quarter looks very much like the same quarter the year before or 10 years before. Lagging indicators really do a decent job because nothing changes. So the result may come in lagging, but the present looks very much like the past and therefore lagging indicator hop to the task.\n\nIt is because I put it to you that we are fast evolving that we need leading indicators rather than lag indicators. So that is really the -- the value of this is that for us managing the business, if we have to wait many months, let alone many quarters to get a read on the impact of changes that we're taking now in the product, in the flow, in rate changes, in our marketing campaigns. If every time we make a change, and we noted in the letter we've done 12,000 software changes in the last year. If every time we make a change we had to wait such a long time to know whether it was helpful or not, ability to correct course and to move fast would be just overwhelmingly hampered, which is why internally, we do these leading indicators.\n\nIn more direct answer to your question, we now have enough confidence in the fidelity of -- and the predictive power of these machine learning models to rely on them. It doesn't mean that they are flawless. I'm sure they are not. And we definitely see with every generational build out of these machine learning, we see the flows in the prior model and we gain confidence.\n\nBut we do now believe that they have statistical significance, but sufficient precision for them to be far better and guides for how we should take corrective actions than the alternative. A far -- the ability to move at the speed that we have and to iterate quickly based on leading indicators, even if they are imperfect, results in a closer to perfect outcome than if we waited on the lagging indicators.\n\nTim Bixby -- Chief Financial Officer\n\nIt's probably worth throwing in -- adding a comment. Yes, I just thought I would add a comment, if I may, around just an aspect of our unit economics that I think it's helpful to keep in mind in this conversation. It's common that companies think about their current lifetime value, their theoretical future lifetime value and how that can be optimized. And there's moving  parts in those calculations, but there's one thing that's relatively unique, in insurance, No.\n\n1, versus other sectors and at Lemonade especially and it's our price points. And so if you think about our average customer premium or premium per policy, it still starts with a two. And it's about to start with the three with the addition of Metromile. And so in an industry where if we take one theoretical customer of ours who has all of our policies, and we have a few of those, that's a $3,000 premium per year customer versus our average is around 300 or a 10x increase.\n\nAnd that 10x ratio, while it's difficult to get that for every customer, you can certainly get that for, hopefully, a good number of customers over time. That 10x ratio really changes the dynamic of all of this evaluation and consideration of what LTV is and what LTV can be over time. And if you take that $3,000 customer and age them a little bit and make them a little wealthier and maybe they get another car and a bigger house, that $3,000 number can be $10,000 in terms of annual premium per year. And so this is across the technology world.\n\nThis is not a common thing where you're able to get 30 times what your starting customer gets. It's possible, but it's quite rare. And it's more common in insurance. And Lemonade really is, if you look at kind of dig through all the metrics that we shared, that's the one I think that maybe gets missed the most often as we're just getting started, a $300 number and where that can go over the coming years.\n\nSo it really changes that LTV value dynamic for us.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nYes, that makes a lot of sense. Last question. To your comments of not spending any -- or a little to no spend on marketing dollars in the near term on Metromile new customers. And I get your point of -- you talked about a number of points that's going to add in the near term to your loss ratio, but to not spend in the near-term marketing dollars for new customers there.\n\nCan you help us to tell any kind of comments that does that mean something in terms of confidence of kind of customer base, the data or the tech that you acquired there?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nNo, not at all. Not at all. The integration is real work. We have a pretty good sense of what's involved.\n\nIt's well underway. But today, any dollar that we spend on Metromile is not spent on the Lemonade brand for one. So suddenly we'd be investing in another brand. Our goal is to have a single brand.\n\nShai spoke about the efficiencies of having a single brand. And we haven't moved over on to our tech. We are going to have a single tech stack. We're determined to do that, which means we have to port everything over.\n\nWe're always going to have a unified single tech stack. And the policy that we sell would be still on the old technology, etc. So just as you go through each of the elements, we haven't got a lot of filings done where we can do bundling across the Metromile product and Lemonade product. So in each area, there's work to be done.\n\nAnd when that is done, we'll be very happy to spend against this, but we just think it would be suboptimal to spend those dollars today. We're going to wait until the integration is complete.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nOK. Makes sense. Thank you very much for your answers.\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nThanks, Michael.\n\nOperator\n\nThank you for your question. Our next question today comes from Thomas McJoynt of KBW. Thomas, over to you.\n\nThomas McJoynt-Griffith -- Keefe, Bruyette and Woods -- Analyst\n\nHey, good morning, guys. Thanks for taking my questions here. Are there any updated statistics on the graduation phenomenon from renters to homeowners that you could share? I understand the time lines there can be long and somewhat lumpy from quarter-to-quarter. But what are the concrete signs of that graduation playing out as expected? And just to confirm, is the incremental customer acquisition cost truly zero for those graduates?\n\nTim Bixby -- Chief Financial Officer\n\nThomas, the graduation has continued unabated. So we have seen a steady up into the right, if I'm not misremembering every single quarter since -- certainly since prior to our IPO, we've seen the percentage of our homeowners book that has come in through graduation has increased. The latest numbers that I saw this may be very approximately wrong, but it's almost precise, is that 20% today of our 806, which is the condo sales, 20% of that book are people who graduated. They started with us as renters, and they graduated and for homeowners, which is the kind of next leg in people's graduation, it's north of 10%.\n\nSo it is pretty significant and continues to grow in a steady [Inaudible]. The incremental cost is not truly zero but not far off. Sometimes they'll have a question that they want to ask, or they'll need a bit of customer support or things like that. But in terms of the marketing spend, which is where the real spend tends to be, the overwhelming majority of these cross-sells and upsells happen without any CAC expenditure at all, without any marketing spend.\n\nPerhaps some customer support. But I think it would not be far off if you round that down to zero.\n\nThomas McJoynt-Griffith -- Keefe, Bruyette and Woods -- Analyst\n\nThat makes sense. And then just one other area of questions. You mentioned having processed about twice as many claims in the last 12 months as the prior four years combined. What gives you confidence that your fraud detection and appropriate claims handling there has kept pace with the substantial increase in claims volumes and especially as you think about perhaps tightening the belt on the expense side going forward?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nThat's a great question. And perhaps during our investor day we can expand on that because there's been a tremendous amount of work done in this regard. So let me not take too much time out to delve into the depth of the technology there. And in general, when we talk about our fraud detection, we're always a little bit KG just because we don't tip our hands to potential [Inaudible] exactly what it is that we're doing.\n\nAs I'm sure you can understand. Having said all of that, actually, the volumes tend to play to our favor rather than to our detriment. The systems train on volume. So if it was humans that were doing all the fraud detection, then maybe they'd be overwhelmed by volume, and since increasingly, we're getting systems that are smart, smarter in patent recognition driven identification of fraud and using new technology and the volume tends to be a wind in our back rather than a force that we have to fight against.\n\nThomas McJoynt-Griffith -- Keefe, Bruyette and Woods -- Analyst\n\nMakes sense. Thank you.\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nThanks.\n\nOperator\n\nThank you for your question. Our next question today comes from Jason Helfstein of Oppenheimer. Jason, the floor is yours.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nThank you. Just wanted to ask a bit more about car. So just as you think about kind of getting the kind of unit economics up, how much of this is you think you can leverage the kind of the underwriting that Metromile had already figured out? And then as just opposed to leveraging the marketing versus needing to build your own intelligence around underwriting for Metromile. So just, I guess, how fast do you think you can kind of scale that relative to scaling that we've seen in your other historical businesses?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nJason, the data that Metromile have accrued as Shai elaborated on earlier is really stupendous. So no, we think that, that is ready to go. Their data is able to assess risk and claims per mile driven at a level of granularity that is really quite extraordinary. The change, frankly, in terms of applying all our data tends -- or the long pole in the tent, if you like, tends to be on the regulatory front.\n\nSo extracting insights and wisdom and appropriate pricing from the data is something that we're pretty adept at and Metromile brings a lot of strength in terms of both their personnel, their experience and their data, but then it can stand in line for some months, regulators pending approvals. So that's really where we find that we hit speed bumps. Those overcome in the fullness of time, but that is challenging. Now it's compounded, that delay is compounded by particularly stark inflationary pressures within the car space.\n\nSo a lot of the supply chain issues have hit car vendors and  car repair shops, etc., disproportionately. If nationwide, we're seeing inflation in the 8%, 9% area within the cost base, it's been more like 20% or 30% in some areas. So a lot of the loss ratios that all car insurance companies have been facing really to do with that. How do you get regulators to approve the hikes that you know you need within the time frames that inflation dictates, and that's really where the rubber hits the road, no pun intended.\n\nOperator\n\nThank you for your question. The next question today comes from Andrew Kligerman, Credit Suisse. Andrew, your line is now open.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nThanks very much. Just curious, just statistically, what percent of your non-car business is in California? And what percent of Metromile's car business is in California?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nAndrew, so the Lemonade car product was never live in California. The only business we have in California car is Metromile. And the overwhelming majority of that business is in California. They're live in a few states, I think, seven or eight states, but California is the largest state by far.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nAnd the non-car business in California, is that a big proportion?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nFor Lemonade?\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nYes. Yes.\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nCalifornia represents roughly what you would expect just on a prorated basis, population size, maybe it skews slightly disproportionately but not out of whack.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nOK. One thing I was really curious about you had mentioned in the shareholder letter, the sixth-generation lifetime value machine learning model. And you indicated that the fifth-generation model had a disposition toward California and the sixth-generation model indicated that some of that business wouldn't be profitable. And as I thought about it, there's been, over the last few years, a lot of concern in California, whether it's the regulators, not giving adequate rate at times, whether it's the weather conditions, it's been a very tough market.\n\nSo the question is what is the new generation lifetime machine learning pick up that the fifth generation didn't? What was it that, that fifth generation wasn't seen?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nYes. Thank you, Andrew. The fifth generation [Technical Difficulty]\n\nOperator\n\nApologies [Inaudible]. We are just going to draw him back in.\n\nTim Bixby -- Chief Financial Officer\n\nBear with us one moment. Resume [Inaudible]. Thanks. Operator? Operator, can you hear me?\n\nOperator\n\nOK. Daniel is connected into the call again.\n\nTim Bixby -- Chief Financial Officer\n\nHi, operator. Can you hear me?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nApologies there.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nYes. So this is Andrew. And the question was around what changed in the -- you heard the question?\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nAbsolutely. Yes, Andrew, I apologize I was dropped off the line and just I had to dial back in. But I did hear your question and I was mid answer when I suddenly dropped the line. I apologize.\n\nThe LTV5 model absolutely identified the trends that you asked about, which is that California had a lot of places that were not profitable business to write. We were already cognizant of that and quite cautious within California within the homeowners' business for exactly those reasons. So I don't mean to imply and the letter didn't mean to imply that we just discovered that California is a tricky place to do business. That's not the case.\n\nAnd what we do with every generation of the LTV is we get an ever more granular perception. So if prior we had said, OK, here's a pocket that looks like it could be profitable business in California, at LTV5 it was at a certain level of specificity. LTV6 allows you that extra level of magnification because one second this looks like this is monolithic and all good. Let me subdivide that for you and show you that actually have pockets, say, that are good, but you also have pockets, say, that are bad, which is why this metaphor of the telescope or the microscope help that you can get to see stuff at an ever-increasing level of granularity.\n\nAnd that's what we did. So suddenly, it was revealing to us that within the mix of profitable pockets within California, it was really made up of better and worse. There's white blood cells and red blood cells. It's not just one monolithic blob of blood.\n\nAnd that's what we see as a microscope helps us to see with greater specificity. So it was a slew of different data that fed into the model. As we referenced at close to a million parameters that are being used in the neural nets and hundreds of millions of parameters on which it's trained, it's hard for me to pick out one. But I think that perhaps the most influential was a greater granularity around cat modeling.\n\nSo one of the things that we said is that LTV6 has a far greater degree of specificity around predicting cat and cat in California, particularly fire is something that can lead to a great deal of losses. So if I had to guess what was driving the model's greater level of precision, I would put it down to that.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nGot it. Thanks. And maybe we could even get into more on that in the investor day, but that was very helpful. Thank you.\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nThank you, Andrew.\n\nOperator\n\nThank you for your question. We'll be taking our next question today from the line of Katie Sakys of Autonomous Research. Katie, over to you.\n\nKatie Sakys -- Autonomous Research -- Analyst\n\nHi. Thank you. Good morning. My first question, I wanted to touch on the full year In Force Premium guidance that you guys shared because it implies a pretty significant slowdown in IFP added across both legacy Lemonade and Metromile versus the second half of last year? So could you walk us through what you're contemplating for auto IFP over the back half of the year? What's driving the slowdown?\n\nTim Bixby -- Chief Financial Officer\n\nSure. So that really represents our adjusted approach toward deploying capital, and so we talked a little bit about the main drivers of that. One is certainly the pace of our growth spend to acquire new customers. It's the most significant one and the direct driver of IFP growth.\n\nIt's not the only driver. As we noted, we're now getting high 20% range of new sales from projects. We expect that will continue its climb, but the majority do continue to come from growth spend. And we're also seeing a moderated pace of hiring, and that's also enabling us to drive better bottom line, even while we continue to grow.\n\nIn terms of IFP, we don't expect to spend much at all to drive additional IFP at Metromile. So we do expect that to continue to be a strong part of the business. If we look at the first half of the year, the legacy Metromile, IFP was well above $100 million -- well above $110 million. So that will have an inherent churn rate, of course, of the second half of the year, but we think that being very strong will deliver the vast majority of the car IFP and we'll continue to spend in spite  of all of our products, including car.\n\nCar essentially one or so percent of the business, something like nearing 20% of the business in Q3 and Q4 once we pulled together the numbers with Metromile. In terms of the growth rate comparing to the prior year, it's very much driven by the growth spend. And so if you compare the [Technical Difficulty] dollar spent in the second half of the year yet, but it is implied in the guidance. And I think a [Technical Difficulty] marketing efficiency that's in line with the past several quarters.\n\nSo the growth capital, the growth spend we do deploy in Q3 and Q4, we think will be as efficient or more so than it has been over the last several quarters, but we'll simply be deploying fewer, fewer dollars. So as Daniel said, [Technical Difficulty] a double-digit growth rate for a very long time. The growth rate implied in the second half of the [Technical Difficulty] adjust for Metromile is a pretty strong [Technical Difficulty]. And that's something that we'll look at as we kind of -- our overall capital base, we're able to raise capital, we can certainly adjust that pace of growth.\n\nBut balancing act, we're playing now, and we think we'll see a great result in Q3 and Q4.\n\nKatie Sakys -- Autonomous Research -- Analyst\n\nGot it. Thanks. Do you care to give us any anticipation of when you expect to turn growth back on?\n\nTim Bixby -- Chief Financial Officer\n\nWell, we're not turning it off. We're just moderating the pace. So I would not think of it as eliminating growth spend by any means. We'll be at considerable amount, but just not -- we won't see the increase that we saw in the second half of the last couple of years because of this [Technical Difficulty].\n\nSo we will be continuing to spend and we'll continue to sort of track the growth and track our path to profitability and balance those two, if we see efficiency increase, we have tended to spend more because trends are good. And as Daniel mentioned, our opportunities to spend are vast, and we're going to work fully to make sure that we have [Technical Difficulty] forces us to raise capital. But we do look forward to being able to increase that spend rate as soon as we see the data that supports it.\n\nKatie Sakys -- Autonomous Research -- Analyst\n\nAll right. Fair enough. If I could just sneak one more in. I was wondering if you could help us understand the path forward for your reinsurance programs? I believe the letter indicated a gradual reduction down from the 55% session that you've reached today.\n\nBut if I remember correctly, last year, we also discussed a gradual reduction down from the 70% level at the June 2021 renewals. So how much risk are you looking to retain over the next couple of years? And should we expect another 10- to 15-point reduction in your session right next year? And then additionally, do you anticipate any material changes to the way the Metromile business is being reinsured when it's rolled into the Lemonade structure next summer?\n\nTim Bixby -- Chief Financial Officer\n\nSo it's probably a little premature to think more than a year out on reinsurance, although obviously, internally, we do think about it. The [Inaudible] reduction over the past two years has been both strategic and structural. Strategic, meaning we've been comfortable taking additional risk as the book grows and as our loss ratios become a little more predictable and as the mix shifts become a little more visible to us. If we look at our reinsurance structure from two years ago, you could see the tranches that were one-year contracts and the major tranche that was a three-year agreement.\n\nSo the reduction from 75% to 55% is really driven by us not renewing the one-year. We didn't renew one of them a year ago, that took us from 75% to 70%. We didn't renew a couple of the other one-year deals this year, this past July, that took us from 70% to 55% and that will begin in Q3 and forward. So next year, I think we have the opportunity to think more broadly.\n\nAs we've said in the past, and I think it remains true that from a risk perspective, we can have no reinsurance and still be comfortable with the capital we have at hand and [Technical Difficulty] the needs of the business with $1 billion that we would be comfortable. And in fact, in many quarters, we've been off because there have been cases where we've been giving up potential profit. And I think if you combine that with the cohort loss ratio view that Daniel mentioned, where we can see that we're really [Technical Difficulty] business over time with a more attractive loss ratio that becomes even more interesting. I think as we get closer to Q1 and Q2 next year, it will become a little more [Technical Difficulty] what the reinsurance market looks like and what our appetite might -- I think let maybe Daniel jump in [Inaudible] I think it's premature to say we're  going to methodically [Inaudible] percentage point, but I would say the opportunity to certainly consider, and it will be really -- a look at the -- what the terms are that are available to us, and we'll know more about that in the coming quarters.\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nFor us, reinsurance tends not predominantly to be about risk management. Obviously, risk concentration is part of it and taking out on the surprises that just force majeure [Inaudible] stuff like that can introduce into the economics. That is definitely one of the benefits of reinsurance. But perhaps even larger driver for us in recent years has been just capital efficiency.\n\nSo regulatory capital, how much capital we need to set aside and the cost of capital that tends to be very different for us and for reinsurance companies. And we quite aside from the risk concentration issue, which is not -- will never entirely disappear, but it is solving itself or resolving itself and as much as we're becoming multiline, multi-geography and much larger that introduces a fundamental greater modicum of stability to the book kind of just by virtue of that. But the issue that doesn't solve is, I would say, the capital efficiency, and now it's a question of balancing margin stacking because reinsurers clearly wants to make a profit, and that profit is earned by solving a problem for us, but it does involve margin stacking versus cost of capital. So it tends to be much more about financial optimization than it does about risk alone.\n\nOperator\n\nThank you for your question. That was our final question today. So at this time, I'd like to hand back to the management team for any closing remarks.\n\nYael Wissner-Levy -- Vice President, Communications\n\nGreat. Thanks so much. We have no additional remarks. Great to catch up today, and we look forward to seeing you next quarter.\n\nThanks so much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nYael Wissner-Levy -- Vice President, Communications\n\nDaniel Schreiber -- Chief Executive Officer and Co-Founder\n\nShai Wininger -- President, Chief Operating Officer, and Co-Founder\n\nTim Bixby -- Chief Financial Officer\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nThomas McJoynt-Griffith -- Keefe, Bruyette and Woods -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nKatie Sakys -- Autonomous Research -- Analyst\n\nMore LMND analysis\n\nAll earnings call transcripts"
}