{
  "companyName": "Tremor International Ltd",
  "companyTicker": "TRMR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/tremor-international-ltd-trmr-q2-2022-earnings-cal/",
  "content": "Tremor International Ltd (TRMR -1.53%)\nQ2 2022 Earnings Call\nAug 16, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to Tremor International second quarter and six months ended June 30, 2022, conference call. [Operator Instructions] This conference call is being recorded, and a replay of today's call will be made available on the investor relations section of Tremor's website and will remain posted there for the next 30 days. I will now hand over to Billy Eckert, director of investor relations, for introductions and the of the safe harbor statement. Please go ahead.\n\nBill Eckert -- Director, Investor Relations\n\nThank you, operator. Good morning, everyone, and welcome to Tremor International's Second Quarter and six months ended June 30, 2022, earnings call. With us on today's call are Ofer Druker, Tremor's chief executive officer, and Sagi Niri, the company's chief financial officer. This morning, we issued a press release, which you can access on our website at investor.tremorinternational.com.\n\nDuring today's conference call, we will make forward-looking statements. All statements other than statements of historical fact could be deemed as forward-looking. We advise caution and reliance on forward-looking statements. These statements include, without limitation, statements and projections about our future anticipated financial results, including discussions about our revenue, margin, expenses and guidance for full year 2022 and full year 2023 and future business, anticipated benefits of Tremor's current and future potential strategic transactions, product launches and commercial partnerships, management believe that Tremor is well positioned to benefit from future anticipated industry growth trends and company-specific catalysts, anticipated continued and accelerated future growth in both U.S.\n\nand international markets, expected strengthening of Tremor's products and reach, expected ability to continue repurchasing shares, investing in technology, sales and marketing and evaluating strategic opportunities to acquire companies, the potential negative impact of inflationary pressures, rising interest rates, geopolitical macroeconomic uncertainties, recession concerns and widespread global supply chain issues, forward-looking industry and economic statements and outlooks and other statements concerning the expected development, performance and market share or competitive performance relating to our products or services. All forward-looking statements are based on information available to us as of the date of this call. These statements involve known and unknown risks, uncertainties and other factors that may cause our actual results to differ materially from those implied by these forward-looking statements, including unexpected changes in our business. More detailed information about these risk factors and additional risk factors are set forth in our filings with the U.S.\n\nSecurities and Exchange Commission, including, but not limited to, those risks and uncertainties listed in the section entitled risk factors in our most recent annual report on Form 20-F. Tremor does not intend to update or alter its forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. Additionally, the company's press release and management statements during this conference call will include discussions of certain measures and financial information in IFRS and non-IFRS terms. We refer you to the company's press release for additional details, including definitions of non-IFRS items and reconciliations of IFRS to non-IFRS results.\n\nAt this time, it is my pleasure to introduce Ofer Druker, CEO of Tremor International. Ofer, please go ahead.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, Billy, and welcome to everyone joining us today. I will begin by providing an overview of our results and strategy followed by our chief financial officer, Sagi Niri, who will review our Q2 and H1 2022 financials. We will then open the call up for questions. During the second quarter, Tremor experienced increased customer reductions and delivered record profitability alongside achieving an impressive industry-leading adjusted EBITDA margins of 55% as a percentage of net revenues.\n\nOur durable data-driven end-to-end technology and business platform has continued to drive strong and resilient results, fueling our ability to execute on our long-term strategic vision. Looking at the market environment, the advertising industry faced several global headwinds in Q2 that we are continuing to see drive macroeconomic uncertainty and recession concerns in Q3, which could remain for the duration of the year. The challenge associated with inflation, rising interest rates, supply chain constraints in certain sectors such as automotive, due to continued chip shortages and the ongoing war in Ukraine have been well publicized, and are factored into our planning for the remainder of 2022. For the positive note, however, we are seeing additional signs of recovery in sectors that have been so strong for churn such as entertainment and continue to believe we will see benefits from the FIFA World Cup and U.S.\n\nmidterm election cycle later this year. We remain confident that our highly diversified customers and revenue base coupled with our robust operating model position us well to successfully navigate these market challenges while continuing to invest to future scale, depreciate, enhance and expand our platform. Since the beginning of 2022, we achieved several important milestones to drive long-term value for our customers and shareholders and reinforce our acquisition in the market over the coming years. First, we increased our CTV and video reach and significantly strengthened and expanded our platform capabilities through several initiatives, including the completed integration of our CTV ad key observers team.\n\nThrough our strategic investment in VIDAA, we further strengthened our CTV assets by extending our exclusive global ACR data agreements while gaining ad monetization exclusivity in key markets such as the U.S., U.K., Canada and Australia. In addition to deepening our partnership investment team, what we believe to be a rapidly growing global operating system. We also built strong relationship with icons with the parent company. Our pre-existing and recently enhanced strength with CTV teams and strong strategic partnership with VIDAA and Hisense enable powerful additional capabilities and high-quality content opportunities, particularly around exclusive content for our customers.\n\nFor example Hisense is an official sponsor of this year's FIFA World Cup and will also sponsor an exclusive daily show throughout the tournament. It was also recently announced that FIFA+ -- FIFA's digital app we launched on Hisense and Toshiba VIDAA-enabled smart TVs. This is the first major example of how having an exclusive data at monetization and CTV media partnership with an operating system and strong relationships with the major global OEMs can benefit channel, as brands and agencies, we look to leverage and will to exercise on this highly desirable stops contents. Furthermore, we took steps to dramatically scale the business and further diversify our offering and ability to serve customers through our pending acquisition of Amobee.\n\nThe acquisition is expected to significantly grow our global market share, extend our self-service data, technology and performance capabilities and add critical new linear TV capabilities. These new linear capabilities allow us to better serve both the sales, which leads you to be important as we continue to see conversion within the linear and digital world. The acquisition will also enable us to offer our specialized CTV product, such as TV intelligence across a significantly wider customer base, creating additional revenue opportunities. Following the anticipated closing and integration of the proposed acquisition of Amobee, we expect to generate contribution excess of approximately $500 million and adjusted EBITDA of approximately $200 million on a combined pro forma basis for the full year of 2022.\n\nWe believe our proven track record of successfully and efficiently integrated acquisition will enable us to smoothly integrate Amobee and create a strong combined business. Finally, we were also able to repurchase under our previously announced share repurchase program, a sizable number of shares at attractive prices. Our ability to achieve these milestones while generating strong results in a challenging operating environment and solidify the conviction that we have in our long-term prospects stems directly from the benefits derived from operating and so. Our model provides several advantages, including simplicity for customers beneficial positioning for changes in data privacy regulation, better installation against challenging market conditions and the ability to maximize revenue streams and profitability.\n\nOur ability to service across all screens regardless of service level requirements enable us to maximize revenue opportunities and build deep relationships, stickiness and trust with our customers. Our operating model allows us to generate extremely attractive margins and profit while enabling customers to achieve data and return balance sheet, particularly when they leverage our platform intent. Our platform also contained a significant and growing footprint of first and third-party data with minimal exposure to cookies and our DSP and SSP share the same audience up to eliminate data loss during cookies which tether ensure we remain well insulated against privacy changes. Our decision to intentionally and scale end-to-end platform was the correct one as we continue to see competitors attempt to replicate elements of our well establishment.\n\nAs our competitors of newly operating end-to-end platform focus on learning and nuances of engaging with both sides of the ecosystem, Tremor as well-established expertise, as well as relationship with brands, agencies, media partners and data providers, and is focusing on its next leg of growth and differentiation. On July 26, we entered into a definitive agreement to acquire Amobee for a total consideration of $239 million, subject to certain customary adjustments. We intend to satisfy the purchase price using a combination of existing cash resources and new debt facilities, we expect to obtain peer to closing the transaction. The acquisition, which we expect to close later in the third quarter is expected to significantly increase our global market share and create one of the most compelling CTV and video end-to-end platform in the market.\n\nThe acquisition also significantly enhanced our technology and business footprint across self-service DST, performance, CTV and data, while adding new factors and DTV capabilities. The transaction also greatly expands U.S. and international pilot footprint, market presence and customer switch. Amobee's 500-plus global customers in use Fortune 500 brands and multinational as agencies and the company maintained strong relationships with some of the world's leading media partners.\n\nFor the 12 months ended in June 30, 2022, Amobee generated preliminary unaudited contribution exit of approximately $150 million. which will have meaningful impact on channel financial scale. We also expect to benefit post-integration from significant operating cost synergies. We initially expect to achieve annual run rate operating cost synergies of approximately $50 million on a combined pro forma at post-closing, and following the completion of the integration.\n\nFollowing the anticipated closing and integration of the proposed acquisition of Amobee, we expect to generate contribution excess of approximately $500 million and adjusted EBITDA of approximately $200 million for full year 2022 on a combined pro forma basis. Amobee represents our largest acquisition to date and delivered on our commitment to execute meaningful and strategic M&A in a market where valuations have decreased. We remain confident that we have the expertise necessary to quickly integrate the company into our business and generate significant benefits for our customers and shareholders. In June, we also deepened our relationship with VIDAA through a strategic agreement to invest $25 million in VIDAA.\n\nThe investment offers several key advantages to channel. The investment extended for multiple years, the exclusive agreement to share VIDAA's global ACR data for global measurement and targeting purposes across our end-to-end platform. It also allows us to offer additional data sets and advertising opportunities to our customers. As we have leveraged the investment to support its plan to increase distribution across additional OEMs, we also expect the that asset to become even more desirable, and for Tremor to benefit further through this increased reach as well.\n\nAdditionally, after initially being designated as VIDAA's global monetization platform in January, VIDAA is granted Unruly and Spearad exclusivity for monetization in the U.S., U.K., Canada and Australia. This unique combination of exclusivity to share global ACR data and the exclusive ability to enable ad monetization in several key markets would have powerful future growth implications for travel. Hisense, for which we serve as their operating system is an official sponsor of the FIFA World Cup, set to take place in Qatar in November and December this year, in addition to expecting license to achieve a substantial increase in global awareness during the event.  FIFA+ will also launch on Hisense-enabled devices.  Hisense ] is also the lead sponsor for an exclusive daily show throughout the World Cup, featuring highlights for the merchants sales and live reactions.  VIDAA exclusive monetization platform in key markets, brands and agencies, we look to utilize and role to advertise on this desirable and exclusive content, which provides strong potential revenue benefit and leverage for Tremor, as Hisense and VIDAA pursue future sports sponsorships and exclusive content opportunities, Tremor is well positioned to significantly benefit from its recent investments. Outside of our company-specific catalysts, Tremor remains well positioned to capitalize on expected industry tailwinds as well.\n\nCTV and video continue to grow at the fastest rates within digital advertising, and a vast majority of our platform's distribution  ex TAC is derived from these formats. Additionally, we continue to expect meaningful growth within Airport over the next several years as evidenced by several streaming services currently launching ad-supported channels and peers, and others showing interest to do so. This further reinforces the viability and long-term health of the CTV market. And we believe our strong foothold in the fast-employed subsegment of digital advertising position us well for future growth and market share gains.\n\nWe believe the fourth quarter will be further enhanced by the FIFA World Cup, and that Tremor will experience added benefit through ISO-sufficient autonomic sponsorship. We also expect industry tailwinds, less than this year from the U.S. midterm election package, which typically brings heightened levels of CTV and video ad spending from candidates we due to the election. Since our last earnings call, we have continued to generate further business for an alongside increased industry recognition.\n\nOur [Inaudible] added 63 new supply partners during Q2 2022, including 35 in the U.S. and 150 new supply partners, including in the U.S. during H1 2022 across critical broad verticals, in sports, use, entertainment and life science, including OTTFs from leading broadcast businesses. We also continue to generate strong adoption within our self-service platform for publishers Unruly control, which experienced a 560% increase in PEP spend during Q2 2022 versus Q2 2021 and 750% increase in H1 '22 versus H1 2021.\n\nAdditionally, Tremor video added 60 new advertisers clients during Q2 2022, and 135 new advertisers signed during H1 2022 across travel, CPG and retail verticals, as well as others. Truly, our in-house redecide continues to impress and create over 13 times more unique video as in Q2 2022 than in Q2 2021, and over 15 times more unique video in H1 2022 than in H1 2021. We are continuing to see strong customer adoption across our data-driven creative products, robust international growth a significant increase in demand for our creative services across travel and retail verticals. Finally, during the second quarter of 2022, we repurchased 5,716,960 ordinary shares at an average price of 452.6p for a total Q2 repurchase investment of approximately GBP 29.9 million or $32.5 million.\n\nFor March in 2022, when we launched the repurchase program through June 30, 2022, we repurchased 7,401,470 ordinarily shares at an average price of 479.98p, reflecting a total investment of approximately GBP 35.6 million or $45.3 million. Our ability to repurchase shares is what we believe are discounted levels to drive long-term shareholder value in addition to our other ongoing growth initiatives with a statement to our continued balance sheet strength and cash generating abilities. It is now my pleasure to turn the call to Sagi to review the financial results.\n\nSagi Niri -- Chief Financial Officer\n\nThank you, Ofer. We were excited to see another record second quarter in H1 of profitability, expanded margin, resilient revenue and excellent business momentum. Today, I will review highlights of our Q2 and H1 2022 performance, as well as some of key financial and operational drivers for the quarter and first half. For the three months ended June 30, 2022, we generated contribution ex TAC of $70.8 million compared to $73.7 million in Q2 2021, alongside record Q2 adjusted EBITDA of $39.1 million compared to $37.3 million in Q2 2021, which reflected 5% year-over-year growth.\n\nThis performance was particularly impressive given the well-known macro pressure that challenged advertisers spending during the quarter and first half. We believe CTV and video remain core future growth drivers for Tremor, and CTV spend on our platform was $64.7 million during Q2 2022 compared to $49.8 million during Q2 2021, which represented a record for Q2 and strong year-over-year growth of 30%. We believe we are well positioned to achieve future growth in these segments as more business is increasingly being transacted through programmatic platform as we expect performance budgets to continue to move toward CTV and programmatic in the future. We also believe the pending acquisition of Amobee, the agreement to strategically invest in VIDAA and the recent integration of Spearad will help accelerate our growth and footprint within CTV.\n\nDuring Q2 2022 and for H1 2022 as well, video, including CTV, continued to reflect an overwhelming majority of our total contribution ex TAC at approximately 80%. We also generated a record Q2 adjusted EBITDA margin of 52% on a reported revenue basis and 55% on a net revenue basis, which we believe further expanded our margin led within the industry. Our continued ability to achieve that strong profitability highlights the durability efficiency and sustainability of our end-to-end model. We were able to generate this expanded margin while continuing to invest in critical initiatives to drive future growth, scale and differentiation within our platform.\n\nFor the six months ended June 30, 2022, we generated contribution ex TAC of $141.8 million compared to $136.7 million over the same prior year period. Over the same period, CTV spend was $110.9 million compared to $88 million during H1 2021, which reflected an H1 record and a 26% year-over-year increase. During H1 2022, CTV spend reflected 36% of total spend, and 41% of programmatic spend. We also generated record adjusted EBITDA of $72.7 million during H1 2022, which represented 12% growth from the $64.8 million adjusted EBITDA we generated in the same prior year period.\n\nWe generated a record H1 adjusted EBITDA margin of 46% on a reported revenue basis and 51% on a net revenue basis, over the first six months of 2022, which we believe represented best-in-class across tech. Turning to our cash flow. We generated net cash from operating activities of $30.4 million for Q2 2022 versus $57.5 million in Q2 2021. For the six months ended June 30, 2022, we generated net cash from operating activities of $46.5 million versus $76.8 million in the six months ended June 30, 2021.\n\nAs of June 30, we had $361.4 million cash and cash equivalents with no debt. However, we expect to obtain new $150 million debt facilities comprised of a secured term loan and a revolving credit facility to partially fund our acquisition of Amobee and to support future strategic investments and initiatives, alongside our existing surplus cash resources. We also experienced 98% free cash flow conversion during Q2 2022, and 99% free cash flow conversion for H1 2022. Non-IFRS diluted earnings per ordinary share was $0.16 for Q2 2022 versus $0.23 in Q2 2021, and $0.31 for the six months ended June 30, 2022, versus $0.35 for the six months ended June 30, 2021.\n\nFinally, I'll turn now to our outlook. For full year 2022, we expect contribution ex TAC of approximately $290 million and full year 2022 adjusted EBITDA of approximately $155 million, excluding any impact from our pending acquisition of Amobee, which we expect to close later in Q3. This guidance considers challenging market conditions that limited advertiser activity in Q2, including inflationary pressures, rising interest rates, geopolitical and macroeconomic uncertainty, recession concerns and global supply chain issues with the expectation that these challenges could continue to impact the advertising demand environment for the remainder of 2022 and beyond. For Q3, we feel various macroeconomic headwinds will continue to impact our contribution ex TAC.\n\nHowever, we believe our recent achievement such as our pending acquisition of Amobee and our proposed investment in VIDAA, which we expect to achieve further benefits around the upcoming FIFA World Cup, will begin to positively impact the business and our results during the fourth quarter and beyond. Through a more efficient end-to-end operating model enables strong fundamentals and our continued focus and emphasis on generating strong profitability gives us confidence that we can continue to generate high profitability and adjusted EBITDA margin for the remainder of the year, even amid a challenged growth environment. We believe this critical emphasis on generating strong profitability is even more important in the current market environment as it drives our ability to continue innovating and growing the business organically while having the necessary capital to evaluate value-added future potential acquisition and investment opportunities. Looking ahead, we will also be working hard to quickly integrate Amobee upon the close of the acquisition to enhance and expand our platform's capabilities for customers and expand our reach and scale while seeking to achieve meaningful operating cost synergies for Tremor and its shareholders.\n\nWe initially expect to achieve annual run rate operating cost synergies of approximately $50 million on a combined pro forma basis, both closing and following completion of the integration. Following the anticipated closing and integration of the proposed acquisition of Amobee, we expect to generate contribution ex TAC of approximately $500 million and adjusted EBITDA of approximately $200 million on a combined pro forma basis for full year 2023. We believe the strength and efficiency of our model, the recent investment we've made to enhance, differentiate and scale the business, our focus on CTV, video and data, and our continued and consistent ability to generate high levels of cash and profitability positions us well to both take advantage of future growth catalysts and succeed in current market conditions. With my remarks completed, I'll turn the call back to Ofer.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, Sagi. Our team has done an exceptional job managing the business through current position while continuing to execute on our long-term strategic vision. Since the beginning of 2022, we took several important steps to enhance and expand the reach and capabilities of our platform to position ourselves strongly for the future. Our end-to-end model continue to allow us to best serve our customers' holistic needs.\n\nIt has also provided the necessary capital to drive significant scale in our business through our pending acquisition of Amobee, and significantly differentiates our offering through our strategic investment in VIDAA. We believe the increased sales and added capabilities that Amobee will provide position us well to continue increasing our global market share and presence in the digital advertising space and open the doors to access new customers, as well as cross-selling and partnership opportunities. Our strategic investment in VIDAA and relationship with Hisense is a potential game changer that could be significantly impactful for our business. They usually aligned with a rapidly growing global partners, expanding its industry operating system and smart TV OEMs ecosystem is a powerful differentiator in itself.\n\nHowever, when you couple that with our exclusive global access to VIDAA ACR data to share across our platform, exclusivity in key markets to monetize advertising on its content, including sports content and strong dealerships with major global OEMs, we feel that this is a very special potential growth opportunity. Tremor company-specific and industry-related catalyst, end-to-end technology and business model, robust profitability, best-in-class margins and strong liquidity position the company well to succeed in the current environment and for future growth and market share expansion. We continue to remain excited about our growth prospects and positioning within the industry and to drive continuous value for our customers and shareholders. Operator, we will now open the call to investors for questions.\n\nOperator\n\n[Operator instructions] Your first question is from the line of Laura Martin with Needham.\n\nLaura Martin -- Needham and Company -- Analyst\n\nGood morning. Yeah. I have a couple of questions. The first one I'm very interested in is -- so your results in Q2 were pretty much in line with other DSPs, other than, of course, Trade Desk, which was much higher.\n\nMy question is, excluding acquisitions -- what do you think the long-term secular growth rate is of your top line, excluding acquisitions?\n\nOfer Druker -- Chief Executive Officer\n\nSagi, you want to take this one?\n\nSagi Niri -- Chief Financial Officer\n\nLaura, thanks for the question. Yes, I will take it. So I think that it really depends on when the macroeconomics and the environment will go. We've proven in the past that we know how to grow our business very fast.\n\nAnd in large scale, while macroeconomic parameters are in place. Having said that, I should say not anticipating anything going forward with all the macroeconomic parameters. I think that it will be double figure and it will be somewhere between, I don't know, 12% to 16%. This is what we are anticipating on a regular macroeconomic environment.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. So 12% to 16% top line growth, excluding acquisitions, and in a normalized environment. And that 50% EBITDA rate is your normalized -- OK, that's super helpful for trying to value this company. The other thing is, one of the things that you said is that you added a lot of sell-side capacity in this particular period.\n\nAnd so, -- and I'm just curious as to if demand is soft right now, how is adding sell-side capacity, doesn't that just hurt the price in the auction if we're adding a lot of sell-side capacity, but demand is soft, doesn't that actually put more pressure downward on your average price?\n\nOfer Druker -- Chief Executive Officer\n\nI didn't understand what you asked for. What we added? Can you repeat it? Maybe the line wasn't good.\n\nLaura Martin -- Needham and Company -- Analyst\n\nYeah. I thought you said you added a lot of sell-side capacity in the quarter.\n\nOfer Druker -- Chief Executive Officer\n\nYes. Yes. Yes.\n\nLaura Martin -- Needham and Company -- Analyst\n\nSo doesn't that hurt your auctions more because you have soft demand because of macro, so if you add a lot of sell side, that adds a lot of units available for sale, so doesn't that put even more pressure downwards on your average price or no.\n\nOfer Druker -- Chief Executive Officer\n\nNo. No, because I will explain. First of all, what we are usually doing, we're enhancing and growing our media side all the time in order to -- because people are -- the advertisers, our partners are looking every time for different audiences, that's the capability that we can offer them through the data and the usage of our platform. So -- and we are not offering any commitment to publish.\n\nIt's connected to our platform, and we are enabling our clients to basically reach bigger audiences and more diverse audiences through this growth of our sell-side partners, basically, that are connected to our platform. But it's not putting pressure on pricing, and it's not putting more pressure on ourselves, of course. I hope that was clear.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. yeah. Perfectly. OK Thanks very much, guys.\n\nThank you.\n\nOfer Druker -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question is from the line of Matt Swanson with RBC Capital Markets.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYeah. Thanks. Good morning, guys. Sagi, maybe picking up where you left off on your prepared remarks and thinking about guidance.\n\nYou noted all the headwinds that we see pretty much in the news on a daily basis. We also have the company-specific tailwinds in the second half with VIDAA and Spearad, World Cup, political. Could you just give us a little more color on maybe how you're thinking about balancing the tailwinds and headwinds? And then where you may be building some conservatism into that guidance for the second half?\n\nSagi Niri -- Chief Financial Officer\n\nI think it's a great question. Ofer, do you want to take it?\n\nOfer Druker -- Chief Executive Officer\n\nAgain, I didn't understand the question. So I will ask you do it again.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYeah. I was just saying that there's obviously a lot of macro headwinds, right, in the second half of the year. But there's company-specific tailwinds that we've been talking about for a while with VIDAA and Spearad, World Cup, political. Just kind of how you're thinking about balancing those two things? And then maybe just give us a sense for the level of conservatism that you guys are building in given that macro uncertainty.\n\nOfer Druker -- Chief Executive Officer\n\nOf course. Thank you for repeating the question. We worked very hard in the past -- even close to year now on all these initiatives, like the Vida, which is the ACR data that's supposed to be effective in the second half of the year. And we took it even further and we enhanced the capabilities that we are offering to the market by cooperating deeply with VIDAA and Hisense about content that is unique and high quality like the FIFA+ that is going to be distributed in exclusivity on VIDAA and Hisense TVs, basically.\n\nAnd we feel -- and also, the VIDAA showed that they basically created that will give like more color on the games and so on. And as we know, FIFA and the World Cup is a major thing in the sport event, and people really -- of course, there are billions of fans that are waiting for these games to start. And that's why basically we believe that with all these ad streams that are in the market. We have also very strong tailwinds, which is the ACR data, the FIFA and basically the content opportunities that we built.\n\nAnd we are also encouraged by the fact that with the first proof-of-concept that we got, we got basically a partnership -- and around the partnership with VIDAA, around FIFA+ and the World Cup, which is, of course, a very major event, and will give us like a very strong utility to generate additional revenues in the fourth quarter. But we are trying to -- and we also didn't include Amobee that we have high confidence that this deal will be closed in the third quarter. We didn't -- we try to give like a full picture about the area as a stand-alone to the market in order to remove uncertainty and to give more clarity about it. And we are conservative in this -- in general because we feel that there is a lot of uncertainty and headwinds in the market, and we need to be aware of them, and we take them into consideration.\n\nAnd as we mentioned also in our PR, we believe that these headwinds and these macroeconomics will not end in the end of the third quarter, but well and probably the end of the year or even will move to 2023, basically. So we are -- I hope that I answer your question, but I think that in general, we see a lot of tailwinds that can be supported by our hard work that we've done. And I think that basically we are trying to balance it with the headwinds that we are seeing in the market, and we gave like a forecast for the full year for this reason, in order to be transparent and to show what we feel is the status of the business until the end of the year.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYeah. No, that's really helpful. And then, flipping to maybe a more positive macro. And Ofer, you mentioned all the companies that are switching to AVOD right now.\n\nAnd maybe thinking about what your expectations are in the next year or two as this kind of flood of premium content comes to CTV? And what you think the impact is on the market, advertisers, publishers when all of a sudden, we see a two, three times the amount of content come to streaming.\n\nOfer Druker -- Chief Executive Officer\n\nOK. I think that it just shows that the CTV is here to stay and is growing and it's becoming like a main channel for online advertisers and forever as in response to which your audience no matter -- on each platform right now. But I think that it just shows that the center that this CTV is taking in the market. And we are -- as you can see also on our results, we are growing our capabilities.\n\nWe have very quality products that we are basically pushing in the market, we are offering in the market. And we add to that also this content that we are now testing. And as I mentioned, we are glad that the first test and the POCs with FIFA+ as basically our ability to work together with VIDAA Hisense in order to monetize this opportunity. I believe that it will -- all these opportunities that are open in the ever will create more curiosity and more activity among advertisers to test the TV to run the campaign on CTV also in order to reach their clients and potential clients.\n\nAnd I think that it will grow the market and we'll make it more advanced and more efficient in the future. So I look at that in a positive manner. In the short term, when you have like so much supply coming to the market, it's also connected to what we see in the market is, of course, it can affect pricing and it can affect the ability of publishers to sell all their media and so on. But I think that what we see in the market right now is just the beginning of more and more companies choosing to work with AVOD and believe in this model, which is great for a company like us.\n\nOf course, that's what we are selling, and that's what we are offering in the market.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAll right. Thank you. I appreciate the time.\n\nOperator\n\nYour next question is from the line of Mark Kelley with Stifel.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nHey, great. Thanks very much. I want to ask you about the '23 guide that you put out there, should we assume that Amobee revenue is roughly $150 million? I know you -- in the past had said that that was flattish year over year. Is that the right way to think about it for '23? And if so, that would imply the core Tremor business, excluding Amobee, would be growing a little over 20%.\n\nIs that the right way to think about it? Or is the right way to think about it, basically using that 12% to 16% growth that you talked about. Yeah, what's the right way to think about Amobee's impact in '23?\n\nOfer Druker -- Chief Executive Officer\n\nI will take this question. So first of all, when we are acquiring a company, we are moving very in order to integrate the company to our business. We are not keeping silos, and we are keeping these different business units. We are creating one company.\n\nAnd I think that we also -- this is part of our promise and the way that we are working basically is to create one company with the acquisition that we are making, and that's what we did in the past, and that's what we are planning to do, of course, with Amobee. So after we will make -- after the closing, we will basically mix and connect the things, and we will not keep it as a silos. But in general, when you look at that, we said approximately $500 million because we -- as we mentioned, we said that we will grow between 12% to 16%. We said that Amobee last year was about $150 million.\n\nAnd I tell you that we kept it conservative basically when we get these numbers, which are very impressive as they are because to reach $500 million in net revenues and $200 million in EBITDA. It's a major event, and it's a very big statement in this industry of ad tech right now.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nOK. And then, structurally, should that the Amobee business also grow in line with that, call it, low teens -- low to mid-teens that you suggested for the core Tremor business?\n\nOfer Druker -- Chief Executive Officer\n\nWe are not talking about different units. And again, what we are going to do after closing is to connect the businesses. So basically, we will create like business units that are part of the full company, but they are connected. So we will not be able to measure it.\n\nWe did it in the past with Unruly, we did it with [Inaudible], we are planning to do with basically with Amobee.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nOK, great. Thank you.\n\nSagi Niri -- Chief Financial Officer\n\nAnd just to add to that, Mark, I think that Amobee is a less profitable company than Tremor. So first of all, as Ofer mentioned, we are moving fast. It will take us some time in the first 12 months in order to get them to the right place. Secondly, they are only one-sided.\n\nSo we will do our best in order to make them like part of our ecosystem and enjoy the end-to-end solution. And as Ofer mentioned, we are not -- we will not measure anymore Amobee solo and Tremor solo. It will be one ecosystem and one reporting.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nOK. Makes sense. And then, maybe just one quick one on where you're seeing the softness. You did a nice job talking about the macro stuff.\n\nBut, I guess, in terms of your products, in particular, like are you seeing more softness on the supply side versus the demand side? I guess when people are using your tech, is any one type of customer softer than the others?\n\nOfer Druker -- Chief Executive Officer\n\nSo of course, everything starts with the demand. So I think that in general, the demand, if you're looking at sale and buy -- we're looking at the demand side that is weakened and it's weakening the ecosystem, but it's across the system, meaning that when the demand is low, of course, it's affecting the all the revenues that the business is generating.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nOK. Makes sense. Thank you very much.\n\nOperator\n\nYour next question is from the line of Andrew Marok with Raymond James.\n\nAndrew Marok -- Raymond James -- Analyst\n\nThanks for taking my questions. I wanted to drill down a little bit more quantitatively on that second half guidance and try to get a sense on the scale of your assumptions for contributions from the inorganic events like the World Cup and political advertising in the back half of the year, and then I have a follow-up after.\n\nSagi Niri -- Chief Financial Officer\n\nSo I'm not sure. We will do exactly what will be the FIFA -- or the World Cup revenue generating because we are not measuring it is that, and you are calling it like nonorganic, but it will become organic. For every -- almost every year, there's a major tournament. And Hisense and VIDAA are very heavily invested in exclusive sport content, which we will monetize in the future as well.\n\nI think that's the answer. Unless Ofer, you want to add something.\n\nOfer Druker -- Chief Executive Officer\n\nI think that it's part of the business that we are doing. And this is -- of course, it's an organic growth. We worked on that so in order to build it with the investment and partnership that we created with VIDAA and Hisense, and we are proud of that. And it's the first time that we are launching an event like that or able to sell and monetize this type of content in the market, and we are waiting to see.\n\nBut we, of course, believe that it will be very meaningful because we believe that the opportunity is really interesting for advertising -- advertisers, and we see the first impression -- first response of advertisers is very positive. So we are now continuing to build the offering and to go out to the advertisers and basically start to get this fine.\n\nAndrew Marok -- Raymond James -- Analyst\n\nOK. And then, in the second quarter, can you point to anything specific as to why EBITDA margins were higher than kind of trend, higher than expected? Was there anything in any of the specific expense lines that was worth calling out?\n\nOfer Druker -- Chief Executive Officer\n\nI think that -- sorry. Take it -- you will take it. Sorry.\n\nSagi Niri -- Chief Financial Officer\n\nYeah. I think it's a combination of different initiatives that we took during -- at the end of Q1 already when we saw the headwinds and the macroeconomic situation. So of course, we closed some open position, some indirect port that are revenue related, of course, went down. We went and make extra efficiency on our data and hosting cost line.\n\nWe did some renegotiation with some of our vendors. And of course, we put like hold on T&E and professional services and other. So I think all of that contributed to this, like extraordinary EBITDA margin in Q2.\n\nAndrew Marok -- Raymond James -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour final question comes from the line of Andrew Boone from JMP Securities.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nGood morning and thank you for taking my questions. Can we start with just helping to better understand 3Q? Is there a way that you can help us understand kind of the first half of what you've seen, so July and August to date, as we think about kind of this quarter?\n\nOfer Druker -- Chief Executive Officer\n\nWhen we are giving like -- we are assessing and we are providing like numbers that are below consensus. Of course, it's not according to our plans. If it was according to our plans, we didn't give this assessment and we didn't get these numbers. So we feel the weakness in the market that is coming from across the board from a lot of advertisers and partners that we have.\n\nAnd that's why we basically adjusted our forecast.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nOK. And then, kind of playing off of the last question you just got asked. Can you talk about the impact of FX on the model? Were there any top line kind of headwinds that you guys can call out there? Understood, it's mostly a U.S. business.\n\nBut then additionally, on the cost side, is there also a benefit from FX you guys are seeing on the cost side of the business?\n\nSagi Niri -- Chief Financial Officer\n\nYeah. The vast majority of our revenues are coming from the U.S., so we don't see any FX effect over there, no benefit and no loss. On the cost side, yeah, as the dollar went up and strengthened through the last month worldwide, we see some cost savings due to FX. It's not like material or changing the needle, but we did see some cost savings regarding FX effects.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nOK. And then, just my last question is one of the key differentiation pieces in our view is certainly the creative side of the business with Truly. Can you just talk about the drivers of increased use of Truly for video ads? And then just help us understand what that brings to the rest of the model, right? I understood more engagement is just good, but kind of put that help us understand that as we relate this back to excel.\n\nOfer Druker -- Chief Executive Officer\n\nThank you. I will take it, Sagi. So I think that -- when we are talking about creative, we have to understand that there is a few elements to the importance of the creative. First of all, as we indicated to increase the engagement.\n\nBut apart from that is to increase the efficiency when you are connecting between creative and data. And this is something that we were able to grow a lot the efficiency and the engagement in the last year and a half or close to two years since we basically started that because Truly, it's basically after we acquired, and Unruly, we released this product. And it did a very good job, and we see the growth about that. And I think that advertisers like it because it's basically serving two of their goals.\n\nFirst of all is to reach the right audience with the right message. And the second one is to basically increase the engagement with that. So we see that as a catalyst also to sell when we are offering these capabilities to advertisers when compared to other companies that are less is doing that. I think that we are gaining more attention.\n\nWe are getting more budget and we are getting more response from advertisers. And it's a tool that we really enjoy using in the market, and it's bringing a lot of great results to us and, of course, to our clients that are using them.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. I'll now hand today's call back over to Ofer for any closing remarks.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, everyone. I think that as we said, we are we built a very strong foundation for the company, and we look at that and we see that we have a lot coming in, in the months to come, but also in years to come through the deals that -- and the investment and the acquisition that we are -- that is still pending, but we are fairly confident that it will be closed in the third quarter. And I think that when we are looking at the future, we are still excited. We know that there is headwinds in the market, but you are not building a company for the next quarter, you're building a company for the years to come.\n\nAnd we feel that we build the right foundations with the right power and we have the talent that is needed in order to grow our business and to move to -- forward in full power. So I'm really excited about it. And I think that we proved in the past year that we are able to fulfill our strategy, meaning increase our CTV hold through the agreement with Visa getting exclusivity in major markets like U.S., U.K., Canada and Australia and on the CTV data, which is to get like a global multi agreement with one of the biggest and most powerful operating system and OEMs in the market. The second thing is also to move through this agreement to drive also quality content that can be an interesting business model.\n\nAn interesting thing for our clients to be associated with events like FIFA and others that will come, which is really powerful. And the acquisition that we've done that is fulfilling our strategy that we basically indicated after the dual listing that we've done last June that we are going to keep using our profits and our cash in order to make acquisitions that will grow our demand side. And we looked at Amobee as a great opportunity for that with their size -- with the right size, capability, talent, expose capability, more than 500 clients and technology capabilities that are in line with what we are doing, including linear TV that we look at it as a great opportunity in the future because we see that the linear TV and the CTV getting closer together through that usage of data. So we are excited, we are confident about our moves and our strategy, and we are working out in order to accelerate our capabilities in the coming years and so on.\n\nSo thank you very much for joining us today and thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBill Eckert -- Director, Investor Relations\n\nOfer Druker -- Chief Executive Officer\n\nSagi Niri -- Chief Financial Officer\n\nLaura Martin -- Needham and Company -- Analyst\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nAndrew Marok -- Raymond James -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nMore TRMR analysis\n\nAll earnings call transcripts"
}