{
  "companyName": "Dutch Bros Inc.",
  "companyTicker": "BROS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/dutch-bros-inc-bros-q3-2022-earnings-call-transcri/",
  "content": "Dutch Bros Inc. (BROS 0.36%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Dutch Bros Inc. third quarter 2022 conference call [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Paddy Warren. Thank you and you may begin.\n\nPaddy Warren -- Director of Investor Relations and Corporate Development\n\nGood afternoon, and welcome. I'm joined by Joth Ricci, president and CEO; and Charlie Jemley, CFO. We issued our earnings press release for the quarter ended September 30th, 2022, after the market closed today and we'll file our 10-Q in the upcoming days. The earnings press release, along with the supplemental information deck, have also now been posted to our investor relations website at investors.dutchbros.com, and we will post our 10-Q there as well when it is available.\n\nPlease be aware that all statements in our prepared remarks and in response to your questions other than those of historical facts, including statements regarding our future results or financial condition, strategies, plans, and objectives, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All such forward-looking statements are inherently subject to risks, uncertainties, and assumptions. They are not guarantees of performance and are expressly qualified in their entirety by cautionary statements. These forward-looking statements are made as of today's date.\n\nExcept as otherwise required by law, we are under no obligation to update these forward-looking statements to reflect subsequent events, circumstances, new information, actual results, revised expectations or the occurrence of unanticipated events. We may not actually achieve any plans, intentions or expectations disclosed in our forward-looking statements, and therefore, no one should place undue reliance upon them. For more details, please refer to our earnings press release and to the risk factors in our annual report on Form 10-K for the year ending December 31st, 2021, filed with the SEC on March 11th, 2022, and our upcoming quarterly report on Form 10-Q for the period ending September 30th, 2022, which will be similarly filed with the SEC. We will also reference non-GAAP financial measures on today's call to enhance investors' overall understanding of our financial performance.\n\nThese non-GAAP financial measures may be different than the non-GAAP financial measures used by other companies. As a reminder, non-GAAP financial measures are neither substitutes for, nor superior to, measures that are prepared under GAAP. When evaluating our business, please do not rely on any single measure. You can also review the reconciliation of non-GAAP financial measures to comparable GAAP results in our earnings press release.\n\nAnd with that, I'd like to turn the call over the Joth.\n\nJoth Ricci -- President and Chief Executive Officer\n\nThank you, Paddy, and also thank you for starting this on time. Good afternoon, everyone. We appreciate your continued interest in Dutch Bros. We continue to execute our growth strategy, leveraging our strong team to open new shops and our proven operational playbook and loyalty programs to engage and connect with new and existing customers.\n\nIn the third quarter, we opened a record number of shops, 38, grew our revenue by more than 50%, and expanded our shop-level contribution margins both year over year and quarter over quarter. Our real estate pipeline and our team's ability to execute new shop openings remain strong. For perspective, we opened almost as many shops in Q3 2022 than we did in the entire year of 2019. We have now opened at least 30 shops in five consecutive quarters, and we fully expect to cap off our first full year as a public company by reaching our 2022 development target of at least 130 new shops.\n\nWhile I am proud of these headline numbers, I'm equally proud of our new shops' quality. Brand continues to demonstrate strength as we travel east into new geographies and as we further penetrate our existing markets. Revenue in Q3 grew 53% to $198.6 million compared to Q3 last year and has actually doubled in just 18 months. Same shop sales grew 1.7% in Q3, sequentially improving each month of the quarter.\n\nAs we mentioned in last quarter's remarks, traffic trends began to stabilize in July and which continued into August. Our same store sales performance was driven by our cold beverage business, which drove over 90% of sales in the last 90 days, and were headlined by the strength in our Rebel and Dutch Freeze categories. Additionally, we saw greater consistency across dayparts with positive sales from the morning through the afternoon and into the evening. Same store sales in Q3 benefited modestly from 4.4% additional menu pricing taking at the beginning of September, bringing our year-over-year pricing to 10.3%.\n\nEffective pricing during the quarter itself was closer to 9.1% based on the timing of our Q3 pricing action. Separately, we increased prices for Rebel and coffee being sold through our franchisees effective September 1. We try to keep a long-term perspective when we choose to take price. Our pricing philosophy centers on: One, to maintain a consistently strong value proposition; two, to keep the opportunity to customize top of mind for customers; and three, present a clear path toward upsizing.\n\nIn Q3, company operated shop contribution grew 62% year-over-year to $44.3 million, outpacing our top line growth and generating margin expansion. Importantly, in Q3, we saw sequential 100 bps of company operated shop margin improvement from Q2 2022 and 730 bps of improvement from Q1 2022 as the impact of pricing and operational improvements, such as better labor scheduling flowed through our P&L. In Q3, we incurred $4.5 million in pre-opening expenses, which were elevated due to our record 34 company operated shop openings in the quarter. Third quarter adjusted EBITDA reached $27.8 million, meeting our expectations and remaining in sync with our full year guidance of at least $90 million.\n\nRecall that at the beginning of our public company journey, we shared five key objectives; continue to attract and develop people on growth capital, open new shops wherever people want great beverages with an eye 4,000 plus shop in the next 10 to 15 years, increase brand awareness and encourage deeper customer engagement, invest in and use technology to improve the customer experience and expand consolidated margins through operating leverage. It's now been just over a year since our IPO and we have remained focused on these priorities. In Q3, our shop level and management turnover remained below industry averages, and our shops remained fully staffed. Trailing 12-month shop turnover remained below industry average at 78% but was up from just 66% in Q2.\n\nThis was not entirely unexpected as turnover is often higher when we enter new markets and have to staff from scratch and start building our internal employee brand. Importantly, shop manager turnover remains in the low double digits far below the industry average. And for operators, whom we view as the linchpins of our field organization, turnover was once again virtually nonexistent. The combination of fully staffed shops, a deep bench of qualified operator candidates, and a 20:1 ratio of frontline applications to new hires, which we believe positions us as an employer of choice and gives us confidence that we have the right pieces in place to fuel our growth.\n\nWe are committed to growing our field organization organically, working in partnership with our franchisees to identify and promote outstanding crew members, and providing realistic growth ladder from being a broista to an operator with multi-unit responsibilities. In Q3, we promoted nine new operators and over the last past 12 months, we have promoted 45 new operators. In combination with our people-first culture, we believe our outstanding career opportunities drive our comparatively low turnover. People capability and availability are fundamental to realize in our growth potential.\n\nWe've recently made several key hires and appointments. In September, we welcome Victoria Tullett as our first-ever chief legal officer. Victoria joins us from Papa Murphy's where she served for more than 20 years. In August, we welcomed Ann Miller, who joined the Dutch Bros board as our third independent director and brings deep governance experience, and currently serves as executive vice president and chief legal officer of Nike.\n\nAcross geographies, our new shops continue to perform. For example, our Oceanside California shop, our first in San Diego County, generated 123,000 in sales over four days. Even more encouraging, the shop demonstrated staying power and the strength of operations by generating $629,000 in its first month. We're obviously thrilled by such a warm reception in San Diego County, but we must also quickly open additional shops to satisfy consumer demand and maintain this goodwill.\n\nSince 2017, we have developed a strategy successfully in several markets, including Tucson in Las Vegas, resulting in significant brand awareness and market share gains, improved customer experiences, and increased operational efficiencies. Our new shop pipeline is fully populated for 2023. New additions to the pipeline are slated for opening in '24 and in 2025. Through proactive bulk purchasing of key materials, we've been able to sidestep many supply chain disruptions and keep our construction timelines stable.\n\nWhile we have seen cost escalations and several inputs, including site work and skilled labor, we remain focused on the long game and are encouraged by the resilience of our strong cash-on-cash returns, which remain in the range of 30% to 40% for ground leases. In 2018, we publicly announced our five-year goal of operating 800 total shops by the end of 2023, and we expect to meet this goal right on schedule. Given the strength of our people development and new unit pipelines, we can now commit to 150 new shop openings next year. Since 2020, we've entered seven new states reaching Tennessee earlier this year.\n\nAs we have moved across the country, we've seen strong reception, including 1.8 million annualized AUV in the greater Nashville market, 2 million in the greater Kansas City market, and 1.8 million in the greater Oklahoma City market. Our 2020 and 2021 classes produced trailing 12-month average unit volumes of 2.1 million, which is approximately 10% higher than our system average. Our success across these diverse markets gave us confidence in our decision to accelerate openings in 2022 and increase the pace into 2023. And as we grow, we are committed to being good steward of our planet's resources.\n\nSince 2020, Dutch Bros has purchased renewable energy credits to outsource our energy use. The first year, those credits covered nearly all of the electricity at our headquarters buildings. In 2021, the program expanded to include all of our shops. In 2019, we installed solar panels on our roasting facility, and this summer we began taking water saving measures that are now integrated into every new shop bill.\n\nMoving forward, all new shops will have an improved instrument cleaning process that will reduce the number of water consuming dipper wells. Together, these moves help us conserve energy and water, but we know these steps alone aren't enough. We're in the process of identifying and executing other sustainability measures to ensure we're doing our part for the environment. Dutch Rewards has continued to grow along with shop count, increasing brand awareness and creating a stickiness to customer engagement that we believe comes with the feeling of inclusion and membership.\n\nAs of September 30th, Dutch Bros app had 2.9 million 90-day active users. This is up from 2.6 million as of the end of June. On average, we now have approximately 4,600 active members for each shop. In Q3, approximately 63% of our transactions came from Dutch Rewards members.\n\nWe believe there's a runway to expand this program, especially in our newer markets. When our members preload funds and pay with Dutch Pass, their average spending is 23% higher than non-members when we achieve additional operational benefit from faster payment times. Yes, that's the power of membership. We believe there is an opportunity to enhance our members experience and earn price through personalization within the Dutch Rewards program, specifically employing one-to-one targeting to encourage users to explore, customize and create their own everyday perfect drink for you, drink or treat in the perfect window of the day.\n\nFor example, we have the opportunity to target offers to encourage coffee users to try cold brew and encourage Rebel drinkers to try Soft Top. We're well-positioned to provide customers with high levels of customization. Cold beverages, which are inherently more customizable, made up over 90% of our menu mix in the last 90 days and over 80% in the last 12 months. Our POS and op systems are designed to accommodate high levels of flexibility in the order taking and drink bill process.\n\nIn Q3, Soft Top was added to 16% of our drinks, up from 10% last year. We also saw success with the launch of the Real Fruit modifier, which customers loved adding to Rebel, Teas, Lemonades and Dutch sodas, to create customized and fun beverages, unique to them and only from Dutch Bros. We are investing in technology to improve both brewster and customer experiences. In Q3, we innovated by giving Dutch Rewards members the capability to share the good vibes by sending their redeemed rewards to other members in forms of free drinks.\n\nIn Q3, tens of thousands of free drinks were shared among our customers, a powerful extension of the word of mouth engagement the brand is so good at creating. In the near future, we plan to further expand this capability by allowing users to buy, send, and utilize digital gift cards through the app. Finally, we are committed to expand margins over time through operating leverage. We remained agile in responding to input cost headwinds, utilizing both pricing and productivity measures to navigate macroeconomic uncertainty.\n\nIn September, we completed a 4.4% price increase. Since November 2021, we have taken approximately 10.3% in total price. We believe our measured strategic approach to pricing remains a competitive advantage for us, as we believe we offer our customers a strong value, especially with modified beverages. Our efforts to bring repair and maintenance into line and refinement of our labor metrics and staffing standards begin to show results in Q2 and continued throughout Q3.\n\nAdditionally, in Q3, we begin adding resources to our procurement function to help achieve greater purchasing efficiency that will come with our growing scale optimizing as we move eastward. These efforts have yielded 730 bps of company operated shop contribution margin expansion in the last two quarters. We have continued to see leverage in our newest shops, which are demonstrating predictable margin progression, typically maturing in three to four quarters, then reliably generating profits thereafter, the class of 2020 approaching our target of 30 plus percent near two contribution margin on a trailing 12 month basis in Q3. Reflecting over our first 12 months as a public company, we have witnessed many changes in the macroeconomic environment and within our industry.\n\nBut we are resolute in our core strategy to grow the Dutch Bros brand and remain focused on delivering great experiences to our customers. Earlier this year, inflation for some of our key inputs, including dairy reached record levels and hampered our profitability. When it was evident that price increases were necessary, we chose to take a measured small move. Always top of mind has been allowing our customers to adjust to the changes.\n\nKeeping the long-term interests of our customers remains a guiding light for us, allowing us to better manage periods of uncertainty. Last quarter, we began to see margins rebound. This trend continued into Q3. Cost escalation and commodity inflation stabilized and our measured approach to menu pricing begin to pay benefits.\n\nMeanwhile, we sharpened our pencils on key controllables. We've made moves to invest in labor more wisely by limiting overtime, and we built schedules more efficiently. Balance is important too because at times our lines along, and when we're careful not to reduce labor in a manner that would constrain revenue growth. In short, we double down on being resourceful.\n\nAs a 30-year-old company, we have the good fortune of our operating teams executing through many economic cycles. Throughout all the uncertainty of the past year, the fundamental strength of the Dutch Bros four wall operating model has held firm. I couldn't be more proud of this team and what we've accomplished together. I couldn't be more excited for the next phase of growth on our path to 4,000 shops in the next 10 to 15 years.\n\nAnd as we like to say, we, at Dutch Bros, are here to make a massive difference. We are here for the long run and we are just getting started. Now I'd like to turn the call over to Charlie to review our financials.\n\nCharlie Jemley -- Chief Financial Officer\n\nThanks, Joth. Joth's comments provide perspective on the massive change this business has experienced over the past 12 months, and indeed over a period of several years. I will take a moment and build upon that perspective with some facts. The brand surpassed 1 billion in annual systemwide sales in Q2.\n\nWe've achieved four successive quarters of strong revenue growth, three of which were 50% or greater. We're approaching 400 company operated shops. Our 370 company operated shops at the end of Q3 are 54% more than just a year ago. Fast growth does not come at the expense of our high operating standards, because we're always focused on the experiences of our people and our customers.\n\nWe're executing our sales transfer fortressing strategy, delivering on our commitments to infill underpenetrated existing markets, rapidly expand new markets and evenly space demand for the convenience our customers deserve, and new shop AUV performance remained strong. Openings from the first half of this year are on track to deliver $1.9 million and Q3 openings are trending similarly. As a reminder, we are targeting new shops to perform at or above our company operated shop AUV. At present, that's approximately $1.85 million.\n\nNew shops are ramping toward cash flow efficiency, in line with our expectations. Typically, it takes new shop margin three to four quarters to reach average efficiency and this trend continued in Q3. We target 30% plus year two contribution margins for our new shops. And this metric removes depreciation and strips out the impact of pre-opening expenses, which are typically borne in the first year of operations.\n\nSee page 10 of the supplemental earning slides posted on our investor relations website with this release, where our classes of '20 and '21 are delivering gross margins of 24% inclusive of 5% depreciation expense. Remember, this also includes depressed margins from the first half of this year as commodity costs escalated ahead of our menu pricing actions. Comparable shop sales increased 1.7% in Q3 after declining 3.3% in Q2. As Joth mentioned, we saw recovery in the afternoon and strength in our cold differentiated beverage categories, for example, Rebel and Freeze.\n\nFor context, our 1.7% Q3 same store sales result is lapping a 7.3% same store sales increase in Q3 of 2021. Q3 same store sales are 11.4% higher than 2019's pre-pandemic levels. Our planned sales transfer fortressing infill strategy created a 150 basis points drag for the system and 240 drag for company operated shops in Q3. This remains in line with our expectations.\n\nOverall, company operated shop profitability is recovering. Since Q1, we have seen 730 basis points of margin recovery now at 25.6% in Q3. This is 100 basis points higher than last quarter despite moving to a period of lower average unit volume seasonality. Despite cost pressures, company operated shop contribution in Q3 is now essentially level at last year, 40 points ahead of Q3 2021.\n\nPage 11 of the supplemental slides provides a detailed look at year-over-year margins in quarter three. Key takeaways are; ingredient and packaging costs increased year-over-year 400 basis points; dairy, which is the most significant single item in our ingredient and packaging cost basket, has increased over 25% this year; shop operating expenses increased by 120 basis points; labor expenses increased by 70 basis points. In total, that is 590 basis points of cost pressure. Pricing actions have now relieved 570 basis points of this total cost pressure.\n\nWe have been very careful not to be excessive or to profit from inflation. Our objective has been to recover costs and preserve what we see as a top-tier four wall model. That four wall model is the economic engine behind the thousands of shops we intend to open over the next decade plus. We are taking a long view as we serve many existing customers and are quickly introducing Dutch Bros to many new ones through rapid shop growth.\n\nIt is important we maintain a strong value proposition with all our customers relative to the competitive set, service quality and speed at a good value. In our franchising and other segments, we instituted a price increase September 1st on the Coffee and Blue Rebel products we provide to our franchisees. Similar to our approach on menu pricing, we chose to wait until we had a more clear view of the operating environment before passing along cost increases to our franchisees. Gross profit for the franchise and other segment held flat at $15.8 million, compared to $15.9 million in the same period last year.\n\nThis was after declining in the first half of 2022. The full impact of the price increase will be realized in Q4 and onward. Shifting now to SG&A. For the quarter, SG&A was $45.4 million and includes $10.6 million in stock based compensation.\n\nAdjusted SG&A was $34.7 million, falling to 17.5% of total revenue in Q3 2022, as compared to 18.6% in Q3 of last year. Annually, we expect adjusted SG&A leverage as anticipated revenue growth outpaces the growth in the costs associated with people and infrastructure investments. Refer to Page 13 of the supplemental slides for a reconciliation between SG&A and adjusted SG&A. This is an additional page added this quarter for clarity.\n\nMoving to overall profitability. Q3's adjusted EBITDA results strengthened to $27.8 million, 33% higher than prior year. Importantly, this is 16% higher than Q2. A few comments on liquidity.\n\nOur balance sheet is strong and well capitalized. As of September 30th, we had $35 million in cash and equivalents and $312 million of undrawn liquidity on our $500 million credit facility. Our net debt was $152 million and this remained consistent with Q2. I'll shift now to guidance.\n\nFor the full year 2022, we are raising our revenue guidance and affirmed our shop openings, same shop sales, adjusted EBITDA, and capex guidance. Total system shop openings in 2022 are expected to be at least 130, of which at least 110 shops will be company operated. In 2023, total system shop openings are expected to be at least 150. Total revenues are now projected to be at least $725 million.\n\nSame shop sales growth is estimated to be approximately flat. Adjusted EBITDA's estimated to be at least $90 million. Capital expenditures are estimated to be in the range of $175 million to $200 million, which includes approximately $15 million to $20 million for our new roasting facility that we project will open in late '23, early '24. With that, I'll turn it back over to Joth for closing remarks.\n\nJoth Ricci -- President and Chief Executive Officer\n\nThank you, Charlie. For 30 years, Dutch Bros has been in the business of building and nurturing relationships: and we have all the building blocks to remain a successful and enduring company, including a powerful authentic brand strong people; systems that drive company culture and fuel our shop growth; a highly engaged customer following; customizable and uniquely curated beverages; highly consistent and highly attractive unit level economics; a portable model that is successful across geographies; a strong and well-capitalized balance sheet that provides ample liquidity; and an engaged co-founder and an experienced leadership team. We have been there and we will continue to be there for our people and our customers as we execute through a difficult operating environment. Keeping our eyes keenly focused on our long-term opportunity to expand our footprint and create real value for our shareholders.\n\nThank you again for your interest in Dutch Bros, and we now would be happy to take your questions. Operator, please open the lines.\n\nOperator\n\nThank you, sir. [Operator instructions] The first question comes from Andrew Charles from Cowen. Please proceed with your question, Andrew.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nGreat. Thanks. Charlie, I wanted to talk about the pricing dynamic, and I know that you guys look at three-year trends on an added basis. But if we look at it more on a geometric three-year basis, but it's the way I think investors look at it a little bit more from 2Q to 3Q, we can see that same store sales sequentially by about 260 basis points, but there's about 380 base points of increased pricing from 2Q.\n\nSo perhaps you can just talk about the traffic in September and what you observed in October, and the ability for consumers to digest this? I know you're trying to be measured with it. But just from the outside, these numbers do seem a bit high while recognizing that sales transfer has been pretty similar between 2Q and 3Q.\n\nCharlie Jemley -- Chief Financial Officer\n\nSo sales transfer of 240 basis points, we definitely have negative traffic, both sequentially and year over year as you're pointing out.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nWhat -- can you just talk a little bit more -- I know that you guys are being measured with this. But can you talk about the efforts in place just to make sure, especially just in the afternoon SKUs to a more discretionary occasion that the pricing is being layered in, in a way that is trying to be as gentle on traffic as possible?\n\nCharlie Jemley -- Chief Financial Officer\n\nWell, if you isolate that negative traffic, there is a geographic element, and we referred to this last time. So definitely in the California market where disposable income is more constrained, that's the driver of the traffic drag that we're seeing. In the non-California markets, we aren't seeing that sort of decline. So I think if it were a broad decline, we'd have a different response than we have with an acute specific decline.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nAnd just my last question, on Page 10 of supplemental, looks like gross profits from most recently open stores improved to 15.8% from 8.4% a quarter ago. What's driving that improvement as the new store volumes remain kind of similar around $2 million?\n\nCharlie Jemley -- Chief Financial Officer\n\nAs we continue to move east, the economics are accretive. We've opened a lot of shops in Texas. So if you look at that on a portfolio basis, that's the driver of the margins moving upward.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nVery good. Thanks, Charlie.\n\nCharlie Jemley -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nThank you. The next question comes from Sara Senatore from Bank of America. Please proceed with your question, Sara.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nThank you. I have a quick follow-up and then a separate question. Just to clarify the traffic versus ticket question. I think you had probably 400 basis points more price on the menu in 3Q than 2Q, so I just wanted to make sure I was getting the sort of sequential change in pricing right.\n\nAnd also to ask if there's anything besides negative traffic, if there's any mix or anything like that going on in the composition of the comps. And then I'll have a separate question, please.\n\nCharlie Jemley -- Chief Financial Officer\n\nSo Sara, we took just over 4% menu price in September, September 1. So the effect on the quarter is actually quite small, right? So it's much less than that, just over one 1%. So I want to make sure you make note of that. It's really going to be the fourth quarter that builds the uptick from that.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nSo you've had roughly similar pricing between 2Q and 3Q?\n\nCharlie Jemley -- Chief Financial Officer\n\nLet me consider that. Well, we took just -- we took under 4% in May, June, so late in the quarter. And then we took 4% late in the quarter in Q3, so roughly the same effect in each quarter.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nAnd then I did want to just ask about the -- to your point, you know, California continues to see a drag, but you saw some more normalization across dayparts. Can you talk about what that reflects, is there -- are there things that you're doing with the loyalty program? Is it just sort of more people kind of getting used to this idea of gas prices being high? So it tends to be more of a discretionary daypart. And a related question to that, on the new units, is there anything about geography, 1.9 versus 185, you've historically had very high new volumes. I'm just trying to understand if you're seeing anything different as you enter these new markets versus what you saw in the first couple of stores you opened up as you went farther east.\n\nSo just trying to understand kind of the complexion of the top-line growth.\n\nJoth Ricci -- President and Chief Executive Officer\n\nOK. The components of menu, I think, a couple real positive things. We saw growth across all dayparts except what we call late night in Q3. So we did see a recovery across the board in dayparts.\n\nWe saw strong growth in our Freeze and Rebel business. Those are our two fast growing businesses. Those are big categories for us. And the movement by the team to continue to attract people into those categories was strong and we like those categories.\n\nAnother element of growth that we didn't touch on is that 38 of the 39 markets that we track grew in Q3. The one market that didn't grow was that Sacramento area. We've cut the decline in that market about in half from where it was in Q2. But real strong growth across the board, just still isolated down on that one market that we're still working through.\n\nAs it relates to comps and things of that nature, I think that we're opening up a lot of trade zones and we're opening up a lot of new shops that may also contribute to some sales transfer that we're seeing in the market. So it's in the way that we're modeling things out that not every store we're going to open is going to be a tough one because in many cases, we might drop store one into a market but other shops are coming into a trade zone to knock those things down, and it won't open up as strong as that two one number. So that's why we kind of look at that total market growth and make sure that we've got our handle on how that's doing.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Thank you very much.\n\nJoth Ricci -- President and Chief Executive Officer\n\nWelcome.\n\nOperator\n\nThank you. The next question comes from David Tarantino from Baird. Please go ahead with your question, David.\n\nDavid Tarantino -- Baird -- Analyst\n\nHi. Good afternoon. Charlie, I wanted to ask you to clarify a comment. I think you mentioned that traffic was down year over year and sequentially, so I just wanted to understand how to interpret that.\n\nSo I guess, what did you mean by sequentially when you talked about traffic?\n\nCharlie Jemley -- Chief Financial Officer\n\nSo sequentially, from quarter two to quarter three, now we have seasonality in there as well, but we've seen some decline in traffic counts from quarter two, quarter three, and then certainly year over year, we have seen a decline excluding sales transfer. These are small declines though. They're not significant.\n\nDavid Tarantino -- Baird -- Analyst\n\nSo is that adjusted for seasonality, or I mean, I guess -- or if you think about the year-over-year change or however you typically think about it. Was it a little softer in Q3 than in Q2, is that what you're trying to say?\n\nCharlie Jemley -- Chief Financial Officer\n\nSo seasonality wouldn't be a year-over-year effect, to your point. It can be an effect as you move from quarter to quarter, quarter two is typically our highest seasonality. I think the best way to characterize quarter two to quarter three outside the price advance is pretty much, I'll call it, running in place not a lot of change in traffic, slightly --\n\nDavid Tarantino -- Baird -- Analyst\n\nAnd then I guess I just wanted to understand how you are thinking about the fourth quarter, because the full year guidance implies a pretty decent range of outcomes, but I guess taken literally it would imply a step back to negative comps in the fourth quarter. So I wanted to understand that a little bit better. So is that -- one, is that, is that how you're thinking about it? And then why are the comps, if that's the case, turning back negative with more pricing in the equation?\n\nCharlie Jemley -- Chief Financial Officer\n\nSo we are positive through three quarters. We're projecting flat. So yes, you are correct that we are expecting a small decline in the fourth quarter and reported comps. There is sales transfer to consider through that.\n\nAnd then in terms of the lap, the lap in Q4 is pretty aggressive versus Q3. So make note of that when you look at comp stacking data that we provide in the supplemental. So moving parts are that we are going to add stores, we are going to go into a lower period of seasonality, we have a full quarter of pricing, we are expecting a little softer, a little tougher lap in traffic year over year and that's how we kind of end up guiding where we guided.\n\nDavid Tarantino -- Baird -- Analyst\n\nAnd then Joth, I was interested in hearing more about the one-to-one marketing that you mentioned. You have that capability now, it sounds like, and I was hoping you could elaborate on what your plans are in the near term, and whether you are planning to use that vehicle more aggressively to try to protect the traffic?\n\nJoth Ricci -- President and Chief Executive Officer\n\nWe have done several different programs. I think the team has created a nice playbook of how to look at the varying degrees of what the customer is going through. So literally you can create a customer engagement and see, is it a daypart issue, is it a trade-down issue, is it a promotional opportunity to convert them into another beverage category, what's the behavior that we are seeing through the Dutch Rewards program that would maybe give us the opportunity to communicate with that particular customer in a certain way. So we are driving frequency.\n\nIt's introducing them to other parts of the menus so that they come back on different dayparts. We are still mining through the data to figure out what that looks like. So you could almost pick any scenario, David, and say that that's one that we are using because the way that we can promote utilizing the app. But I think the ability to drive, to utilize the sharing of points program that we put in place, we also, in Q4, we have a big digital card that we are going to be launching through the app and that's a big gift item for the holidays, which we like that.\n\nThe other thing I want to speak on just quickly related to Charlie's comments is that Q4 last year was really that last run of COVID challenges, I think that we saw in the marketplace. And we had a very strong fourth quarter of last year, because we were open, we were running and we were doing very well at that time. And so I think there's still some settling down happening in year-over-year numbers related to who was open, who wasn't, what was going on in the market and what's happening now. So I think that some of our hesitancy to be more positive about the fourth quarter is we know what we're up against versus last year --\n\nCharlie Jemley -- Chief Financial Officer\n\nIt's the highest two-year stack we face.\n\nDavid Tarantino -- Baird -- Analyst\n\nMakes sense. Thank you very much.\n\nOperator\n\nThank you. The next question comes from John Ivankoe from J.P. Morgan. Please proceed with your question, John.\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nHi. Hi. Thank you very much. The question was on what you're seeing with taps and film.\n\nCertainly, I think about this as speed of consistency, certainly it fits with some of the environmental goals that you have. Could you give us an update you of what you're seeing new stores, any opportunities that you have to retrofit some of the existing stores? And have a follow-up.\n\nJoth Ricci -- President and Chief Executive Officer\n\nWe have -- our colder tap system, John, is in old taps right now and we're in a plan right now to kind of roll that out. We actually just launched a new tap design in a stand here in Grants Pass, looking at a Rebel on tap, and we're testing that program and really look to probably the back half of 2023 as we begin to scale up on that. We've kind of picked -- we've picked the shop for a new shop. And kind as we look at new design and new programming, we're working on that right now to roll that into, let's say, July through the back half of the year as we launch the new tap systems.\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nAnd anything that you can share operationally? I mean, is it, in terms of its significance, why you're doing it? I mean, certainly, again, we see the ways aspect but anything from a customer and employee perspective?\n\nJoth Ricci -- President and Chief Executive Officer\n\nWell, I think, the feedback has been tremendous. I think the -- it's simple, it's easy, we're removing the can and really just now we're hitting a button in the ability to pour the perfect drink. In many cases, it's so much faster so that we can deliver to that customer on time and approve efficiency there. Not to mention the back-end benefit of not shipping cases of full product.\n\nSo cases of cold brew, cases of Rebel, cases of even our sparkling water business, and we'll continue to reduce the finished good line and we'll do more of a concentrate business as we get to the back half of the year. But we haven't -- we tested it, we've got it kind of model. But until we actually see it in person, I'm not -- haven't been committing to really putting any numbers out.\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nSecond question on turnover. I think I wrote down hourly turnover went from 66 to 78. Not unexpected but that's not a small increase, especially for you. So kind of go through why I guess employees are leaving at an accelerated rate relative to the second quarter versus last year? I know new markets might be a part of it.\n\nBut are we seeing a similar phenomenon in existing markets? And I'm curious, I don't know this to be the reason. A lot of hourly workers have opportunities to earn tips where they didn't before. And I think quite frankly, you've led the industry and shown some others the way of how good that can be from both, I guess, profitability but also more importantly an employee perspective. So just wanted to get some more color in terms of that increase and turnover, and if you see it as an issue that you guys need to, I guess, make sure it doesn't get any worse?\n\nJoth Ricci -- President and Chief Executive Officer\n\nAnd just the case study that is the labor market right now is fascinating. So a couple of comments. One is that our turnover in the third quarter is always going to be higher. Just the nature of summer ending, back to school, the type of employee base that we have, we always see higher turnover in the third quarter.\n\nThe reason why the trailing 12-month number is higher is actually more driven by the phenomenon of the first quarter and the second quarter, which were higher than the first quarter and second quarter of 2021. In the first and second quarter of 2021, we had the lowest turnover we've probably ever seen just because we were open, people had a job and they were staying. But we did see increased turnover in the third quarter of last year. And what will happen is we'll see that drop off in the fourth quarter, it'll kind of bounce around for the first and second quarter, and then it'll increase again in the third quarter.\n\nThe tipping question is a great one. I think that we've all seen an increase in the opportunity to tip across all segments of business in the last six months, and we've seen a reduction in that number. At the same time, I think that, I think it's an interesting phenomenon as well that I'll stay away from my opinion on that. But I do think that we need to make sure that we're tipping great service and we're acknowledging people that are doing amazing work.\n\nAnd I hope that everybody in every job does amazing work so they get a great tip.\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question comes from Nicole Miller on Piper Sandler. Please proceed with your question, Nicole.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. On comp last quarter, if I have this down properly, you talked a lot about California. And I think it was something like if you could exclude, I think, it was both California and sales transfer comps would've been down very, very modestly.\n\nSo can you give some context for the third quarter comp around the impact of California, and if California was a driving force to the positive? You know, there was an earlier question about that consumer absorbing inflation, which is a great one. Or is it the fact that, you know, they had a stimulus that I guess was technically really in October, not in 3Q. But if you just had any line of sight into like maybe they knew that was coming so they started to feel better, and if that is a lasting event or phenomenon or sentiment kind of --\n\nJoth Ricci -- President and Chief Executive Officer\n\nAnd you're right, the stimulus was in October, so we didn't see any value of that so far. But back to the California question and I want to isolate the California situation actually into the Sacramento area, and what we would just call a Sacramento DMA. If you remove that DMA from our entire system, our total system would -- same source sales would be up 4.1%, that's how much of an impact that market has on our same source sales related to the system. So 4.1% would be the growth number if you take that out.\n\nIn the second quarter, that market was down 9.7%. In the third quarter, that market was down 4.8%. So we've seen an improvement there. But we still have work to do, and it's kind of back to that 38 of the 39 markets that we talked about being up.\n\nAgain, we're isolating that, we're looking at that, figuring out ways that we can kind of work in that market but also being focused on everywhere else that that is going what we would consider to be very well.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nAnd the recovery was -- you know cold drinks and the recovery was the afternoon. I think mix shift was a drag in the first half of the year. Has mix shift turned back positive?\n\nCharlie Jemley -- Chief Financial Officer\n\nNot necessarily.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nSo really is traffic then, traffic and price. Is it negative, is it still a drag?\n\nCharlie Jemley -- Chief Financial Officer\n\nMix or traffic?\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nMix.\n\nCharlie Jemley -- Chief Financial Officer\n\nMix is a drag, slight drag, probably some trade down going on there, which is logical.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nAnd then 4Q like was asked earlier, so for the whole year being flat and you kind of said, if I have this down negative comp. So with price, again, just the same kind of level, a little bit more price, so a little bit more negative traffic. Is that the way to think about that given those reasons that you kind of cited? And I don't know if it was one question or three questions ago, but is that right?\n\nCharlie Jemley -- Chief Financial Officer\n\nYes. On a year-over-year basis. But again, I'd encourage you to look at that Slide 8, because you can see the two year stack for Q4 is really big. It's 15.8%.\n\nAnd so, you all know that comp is a two-part equation, what you deliver in the current frame and what you're comparing it to. So that's why we're not concerned about reporting a negative traffic number with that big a lap.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nAnd then a real question -- and then just put me on mute, but a real question, the roasting facility. Does that alleviate any pressures anywhere, does that make things happen faster, cheaper? What benefits do you have from the roasting facility ultimately?\n\nJoth Ricci -- President and Chief Executive Officer\n\nWhen you think about our supply chain, we are shipping almost everything that we make out of the most expensive markets in the country on the West Coast. And so we are currently using a third party in the Dallas market to offload some of the pressure that we have from our roasting facility in Grants Pass. And right now we produced probably 97% of our roasted bean volume coming out of the Grants Pass market. As we move those things to Texas, we'll start a supply chain that comes up through Houston and directly goes into the Dallas market that allows us to ship throughout that Midwest market and then to the East Coast.\n\nSo one is we'll get out of a third-party situation, which is absolutely more expensive to make. And we'll get into our own situation and then we'll be able to offload and also take some risk out of the equation with having one roasting facility on the grid in one location. And with what's happening in the summers with fires and the other things that we're facing on the West coast, we want to make sure that we're able to supply regardless of any situation.\n\nCharlie Jemley -- Chief Financial Officer\n\nUltimately, out of our original roasting node, we'll lose -- we're going to run out of capacity. And we don't want to add capacity in a single risk environment like that.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question comes from Jeffrey Bernstein from Barclays. Please proceed with your question, Jeffrey.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nGreat. Thank you. Just following up on the menu pricing, the 9% I guess that we're talking about in the third quarter, which seemly would go up a little bit in the fourth quarter. Just wondering how do you go about arriving at the price increases? I know you said you prefer more smaller increases.\n\nBut is that just the price increase determined based on your needs to hold margins at a certain level? Or I mean, how do you test it to make sure that there is not going to be outsized pushback from a lower-income consumer in this environment?\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. So every price move that we've made in the last year. The three that we've made have really been measured to that degree. One is that we're going to go slow.\n\nWe want to continue to create a value position for our menu across just about most of the categories that we're in. We want to be careful about how we do it. So we basically, what we say is we want to earn price as we put that on our menu, there's a taking price. So we've been careful about the impact of the consumer during this time, and we've also been careful about where we put price.\n\nSo we've done things on a lot of our products that you premiumize an item with. We've done that so that the customer is choosing an item that would actually -- that you would take price on. We also look at other places in our menu that we feel like that there's a price opportunity there. We've also protected other parts of our menu against the customer base that may not be able to take price.\n\nSo, so far, we're very pleased with the way that, that's worth. We've seen just about all of it flow through in the last year and will continue to be measured as we get out of the end of this year and then look again kind of at the first half of next year.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nAnd obviously, the pricing is in place to mitigate inflationary pressures. I'm just wondering if you can quantify the basket of commodity and labor inflation for the third quarter and maybe what your outlook is for the fourth quarter or more importantly, directionally into '23. Hopefully, we're expecting these things to ease in '23, but any kind of color on the current quarter and the near-term outlook would be helpful.\n\nCharlie Jemley -- Chief Financial Officer\n\nOur overall year-over-year cost of goods basket inflation in the third quarter was just shy of 11%. Our wage inflation is just below 1% right now. We don't anticipate a lot of change right now. We don't think it's wise to bank on that.\n\nBut dairy is the -- as we've stated, is a huge driver of that. Over 25% escalation in dairy. Coffee is up or was up in the third quarter, high single digit.\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. We're not -- and Jeff, we're not hearing anything that gives us a high degree of hope that things are going to shift any differently anytime soon. I think dairy is projected to stay where it's at until the spring of next year. The sea price, we're all watching, is starting to come down.\n\nAnd usually, that's helpful. But if you play in the futures game on that, you're out a little bit more on that. So we're watching that. And then I think we'll watch labor.\n\nI think labor is the one that we're watching closely. Obviously, we've had a good run with our hiring and one out of every 21 applicants we hire, and that's feeling pretty good. But we're going to have to watch wage inflation as we kind of get through this and get into the first part of the year.\n\nOperator\n\nThe next question comes from Sharon Zackfia from William Blair. Please proceed with your question, Sharon.\n\nSharon Zackfia -- William Blair -- Analyst\n\nHi. Good afternoon. I was pretty impressed by the labor leverage that you saw in the quarter. And I know you mentioned labor scheduling and I think less over time.\n\nIs there anything else that went into that metric because there's really good leverage, particularly for the comps you put up in the quarter? And then secondarily, I was curious if you could talk about what new markets you might be looking at opening in 2023.\n\nCharlie Jemley -- Chief Financial Officer\n\nOn the labor side, the team has done a really good job of making sure that we forecast sales as accurately as we can. We write a schedule, we're close to that sales level and get the dayparts right and then work the schedule that we write. And given that we have still relatively low turnover, and we have a reliable staffing model. We're able to just fine-tune that and set our schedules more effectively, remove overtime, limit the training expenses that we had.\n\nSo we just got better at our craft in the third quarter because the environment was less disruptive.\n\nJoth Ricci -- President and Chief Executive Officer\n\nAnd Sharon, if you look at the markets for next year, a couple of pieces of color on that. One is about 60% of the shops that we plan for next year will open in California and Texas as we continue to build out that. So it's about -- right now we've got 92 locations planned for those two areas, and we'll be doing a lot of infill into existing markets. Main new markets are in Alabama, Tennessee, and then also in Kentucky.\n\nSo places like Huntsville, places like Knoxville, places like Lexington will be core places where we'll grow. And we'll use a similar approach that we took really in Texas, where we opened in places like Lubbock and College Station and Fort Hood in markets that maybe would consider to be secondary, but that's how we'll go into a market like that and build some good presence. So we're excited about next year. And that $150 million, the team is just honestly chomping at the bit to get started.\n\nSharon Zackfia -- William Blair -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question comes from Chris O'Cull from Stifel. Please proceed with your question, Chris.\n\nPatrick Johnson -- Stifel Financial Corp. -- Analyst\n\nThank you. Hey, guys. This is Patrick on for Chris. I wanted to quickly follow up on -- I know California, you mentioned was a key driver of the traffic declines, but I was curious if you could clarify if you've seen an impact from the stimulus payments that rolled out in California at the beginning of the fourth quarter? And then I have a follow-up.\n\nJoth Ricci -- President and Chief Executive Officer\n\nYes. I don't know that we have anything to point to right now related to Q4 numbers. We just haven't really -- we haven't seen that or nor have really spent a bunch of time kind of analyzing what kind of effect that's had so far. So I wish we could say more, but I don't have really much to speak on, on that topic.\n\nPatrick Johnson -- Stifel Financial Corp. -- Analyst\n\nAnd then also, Joth, does the company have a higher level of promotional activity during the third quarter than maybe it did last year? And then as we think about the fourth and I appreciate the comments on the lab, but I'm curious if you could provide some color on just what the level of promotional activity might be around the holiday season compared to last year as well.\n\nJoth Ricci -- President and Chief Executive Officer\n\nWe're pretty -- the thing about our promotion strategy is that we're we are not a big promotional company. And part of that is that we -- with the lines that we have and the traffic that we manage, we're not in the business of driving honestly driving more big volume into a store because we're kind of managing our operating efficiency. And in many cases, if we drive our lines to be too long, we lose people because people don't want to wait in those lines. So that's why we think our one-to-one promotion strategy is so important.\n\nI can tell you that our discount rate in promo has stayed pretty even all year in the way that we've managed it, and we've kind of managed our -- how we drive promotions kind of specifically within that discount percentage and not doing any sort of large promotions that can -- honestly, it can really trip us up operationally if we're not careful. So nothing out of the ordinary income last year, I would say, and we've been pretty disciplined in the way that our team has run that.\n\nPatrick Johnson -- Stifel Financial Corp. -- Analyst\n\nGot it. And then lastly, I mean I know you mentioned, or you highlighted, modifiers and customization like Soft Top as a driver of incremental revenue opportunities in your prepared remarks. And I was just curious if you have any product innovations in the pipeline or additional beverage enhancements that you think you could roll out that would provide additional options for customers to sort of self-select and add on those high-margin beverage modifiers?\n\nJoth Ricci -- President and Chief Executive Officer\n\nSo we have done some -- a variety of work, which is how Soft Tops kind of gotten to that 16% number here over the summer. I think when we launched Soft Top, I don't think we had any idea that basically two plus years later, it would be on 16% of our beverages and growing as we're starting to see consumers and really our baristas doing a nice job of offering that product on -- you can put it on cold brew, you can put it on Rebel, you can put it on a lemonade, you can put it on a hot drink. You can do it so many different ways. And then real fruit has been a great way to flavor up your drink without maybe putting a syrup in there, you actually put a real scoop of real fruit in there.\n\nThat's also kind of expanded beyond the original idea. And now we're seeing it and it used to be just for teas and lemonades when we launched it, and now we're seeing it in Rebel's, and soda and a variety of different beverages that we run. We're careful about too much innovation, again, because of the nature of the way the inside of our shops work and the operational efficiency that we need in order to get the volume through. So we did launch a Mangonada.\n\nWe tested a product with Tajin on it in the third quarter that did very well and got great feedback not just from our consumers, but also from our stands and our baristas. We'll look at a few products like that in the next year. But -- and then to finish -- our menu is loaded with innovation currently. Our secret menu, insider menu, is loaded with hundreds of amazing drinks that really aren't offered by other people.\n\nAnd so I think what we'll continue to do is try to showcase those beverages to our customers, especially in our new markets that are still learning how to shop, interact and have the Dutch Bros experience.\n\nPatrick Johnson -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks, guys.\n\nOperator\n\nThank you. There are no further questions at this time. I'd now like to turn the call back to Joth Ricci for closing remarks. Thank you, sir.\n\nJoth Ricci -- President and Chief Executive Officer\n\nSo once again, I want to thank everyone on the call. I also want to thank our thousands of baristas and our teams in the shops and our hundreds of people here that support our HQ that makes such a great experience for our customers and our employees out of the marketplaces. This has been an amazing year. 2022 is again thrown to us challenges that we've taken on and developed and worked on, but we've created record numbers along the way.\n\nSo I want to thank everybody for joining on the call. I wish everyone a very happy, safe, and great holiday season, and we look forward to speaking to you again at our Q4 call in the first quarter of next year. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaddy Warren -- Director of Investor Relations and Corporate Development\n\nJoth Ricci -- President and Chief Executive Officer\n\nCharlie Jemley -- Chief Financial Officer\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nDavid Tarantino -- Baird -- Analyst\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nSharon Zackfia -- William Blair -- Analyst\n\nPatrick Johnson -- Stifel Financial Corp. -- Analyst\n\nMore BROS analysis\n\nAll earnings call transcripts"
}