{
  "companyName": "Paymentus Holdings, Inc.",
  "companyTicker": "PAY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/paymentus-holdings-inc-pay-q3-2022-earnings-call-t/",
  "content": "Paymentus Holdings, Inc. (PAY 1.65%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to Paymentus' third quarter 2022 earnings call. This call is being recorded. [Operator Instructions]  At this time, I would like to hand the call over to Paul Seamon, Interim chief financial officer for some mandatory comments. Please go ahead.\n\nPaul Seamon -- Vice President, Finance and Strategy\n\nThank you. Good afternoon, and welcome to Paymentus' Third Quarter 2022 Earnings Call. Joining me on the call today is Dushyant Sharma, our Founder and CEO. Following our prepared remarks, we'll take questions.\n\nOur press release was issued after the close of market today and is posted on our website, where this call is being simultaneously webcast. The webcast replay of this call and the supplemental slides accompanying this presentation will be available on our company's website under the investor relations link at ir.paymentus.com. Statements made on this webcast include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements use words such as will, believe, expect, anticipate and similar phrases that denote future expectation or intent regarding our financial results and guidance.\n\nThe impact of and our ability to address, continued economic uncertainty and inflation, our market opportunities, business strategies, implementation timing, product enhancements, impacts from acquisitions and other matters. These forward-looking statements speak as of today and we take no obligation to update them. These statements are subject to risks, uncertainties and assumptions that may cause actual results to differ materially from those set forth in such statements, including the risks and uncertainties set forth under the captions, special note regarding forward-looking statements, and risk factors in our annual report on Form 10-K for the year ended December 31, 2021, which we filed with the SEC on March 3, 2022. Our quarterly report on Form 10-Q for the quarter ended September 30, 2022, which we expect to file with the SEC shortly and elsewhere in our other filings with the SEC.\n\nWe encourage you to review these detailed safe harbor and risk factor disclosures. In addition, during today's call, we will discuss certain non-GAAP financial measures, specifically contribution profit, adjusted gross profit, adjusted EBITDA and adjusted EBITDA margin are non-GAAP financial measures. These non-GAAP financial measures, which we believe are useful in measuring our performance and liquidity, should be considered in addition to, and not as a substitute for or in isolation from GAAP results. We encourage you to review additional disclosures regarding these non-GAAP measures, including reconciliations with the most directly comparable GAAP measures in our earnings press release issued today and supplemental slides for the webcast, each available on the investor relations page of our website.\n\nWith that, I'd like to turn the call over to Dushyant Sharma, our founder and CEO.\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nThank you, Paul. We are pleased to have a solid performance in the third quarter. In the quarter, we booked over $30 million of new annualized recurring revenue and expect total new bookings for the year to exceed $100 million, which is about 30% higher than the previous year. Based on our current pipeline, we also expect our bookings momentum to continue well into 2023 and beyond.\n\nAs a reminder, our contract terms generally average four to five years, and assuming the continuation of our historically high retention rates, we expect this revenue to grow organically for a long time. Our contribution profit increased over 25% to $51.1 million, driven by a 31% increase in transactions compared to the same year -- same period last year. Our adjusted EBITDA margin grew over 5 percentage points from 10.3% in Q2 to 15.7% in Q3, notwithstanding our continued investments in the emerging areas of our business, namely IPN and other related products, which includes our bank bill payment -- base bill payment as well. During the quarter, we completed the implementations of several significant clients, including a large municipal utility, a time share vacation club and a real estate company, which continue to show the breadth of our platform functionality and vertical reach and an expanding addressable market.\n\nWe also launched a citywide deployment with the City of Baltimore as publicly announced. This implementation was completed within a couple of quarters, which shows that our large client enterprisewide deployments can be completed and implemented relatively quickly with a strong client engagement. We continue to work to motivate clients to accelerate timelines to match our pace. Additionally, in the quarter, we expanded the payment acceptance capability of large utility that joined our IPN for expanded coverage of newer payment methods and channels.\n\nWe are seeing more and more demand for these newer payment methods and channels enabled by IPN, which is bringing additional consumer adoption and accompanying transactions. One of the most important aspects of our IPN is our ever-increasing reach. I'm happy to report that our IPN has crossed over 1 million payees, including SMB businesses, which we believe sets a great foundation for Paymentus to continue to offer innovative services to these payees who are receiving payments but not fully utilizing our platform yet. During the quarter, we completed the implementation of a credit union with $3 billion in assets on our new flagship product, Bill Center, which we believe is attracting interest from other companies and generating larger opportunities.\n\nAs a result, our IPN Bill Center bank bookings are up significantly over last year, and we expect that trend to continue into 2023. As a reminder, there is currently no interchange associated with any IPN and Bill Center originated transactions. I am proud of our results for the quarter and continue to be excited about our ability to deliver long-term profitable growth. Just over two years ago, for context, in 2020, we were a $300 million revenue run rate company prior to us going public.\n\nIn spite of COVID, the economic downturn, higher interest rates and the inflationary challenges we have faced during the last two years, since 2020, we have added about $200 million of revenue, and we have now crossed a run rate of $500 million of revenue. And as I said earlier, we expect to close out 2022 with over $100 million in new sales, which once fully implemented, as anticipated, is expected to bring our revenue run rate to over $600 million, doubling our business in a relatively short period of time. We are working to build a significantly larger business and will share more details about our strategy in 2023. With that, let me pass on to Paul.\n\nPaul Seamon -- Vice President, Finance and Strategy\n\nThanks, Dushyant. As a reminder, today's discussion includes non-GAAP financial measures. Please refer to the tables in our press release and supplemental slides for a reconciliation of non-GAAP items to the most directly comparable GAAP financial measure. In the third quarter, we processed 92.2 million transactions, a 30.6% increase over the same period last year.\n\nRevenue was $128.2 million, an increase of 26% in the quarter. Contribution profit increased 25.8% over Q3 of last year to $51.1 million, which was a little stronger than we anticipated. Contribution profit per transaction was $0.55, which was consistent with the past three quarters and our expectations. We continue to experience inflation in our average purchase amounts but are starting to see some of the benefit of the pricing actions and other expense management measures we've implemented in the quarter.\n\nAdjusted gross profit increased $8.5 million or 26% in the quarter to $41.0 million. Adjusted EBITDA was $8.0 million for the third quarter, which represented a 15.7% adjusted EBITDA margin. Our EBITDA from our biller direct business is materially higher than reported here. Due to our focus on the longer-term growth, we continue to invest in IPN and related initiatives, which puts pressure on current margins.\n\nWe believe this is a worthwhile trade-off to fuel growth for the long-term as we expand our ecosystem and total addressable market. Operating expenses rose $8.7 million to $38.8 million for Q3 of 2022 from the same period last year. Overall, the increase in operating expenses from last year was driven by investments in staffing, as well as additional operating expenses associated with our 2021 acquisitions, the amortization of identified intangible assets from the acquisitions and stock-based compensation. Specifically, R&D expense increased $1.5 million from the third quarter in 2021 to $10.3 million.\n\nSales and marketing increased $7.7 million, driven by the Payveris acquisition, continued expansion of the sales team, adding partnerships to capture our sizable market opportunity and an increase in stock-based compensation. We experienced a decrease in G&A expense of $0.5 million due to continued efforts to control costs related to corporate insurance and employee hiring. Our GAAP net loss was $700,000 and EPS for Q3 was a negative $0.01. Non-GAAP net income was $1.8 million and non-GAAP EPS was $0.01 for the quarter.\n\nAs of September 30, 2022, we had $148.3 million in cash and cash equivalents on our balance sheet. Cash decreased primarily due to the timing of certain customer payments, as well as increased operating expenses due to the acquisitions. At quarter end, we had approximately 123 million shares of common stock outstanding. Now turning to our 2022 full year outlook.\n\nWe are reiterating our 2022 revenue outlook with the range of $485 million to $492 million. Our contribution profit guidance was maintained between $200 million and $204 million for the year, which is approximately 26% to 29% growth. Our adjusted EBITDA outlook continues to be in the range of $25 million to $28.5 million with an adjusted EBITDA margin of 13% to 14%. Our current guidance reflects our assumptions around continued inflation, as well as ongoing wage pressure.\n\nFinally, as we said last quarter, we would anticipate our full year effective tax rate to be around 30%. However, due to the amortization of intangibles associated with the acquisitions, the closer we are to breakeven on a pre-tax book income, the more variation we could see in our tax rate. In addition, the permanent tax benefit from stock-based compensation continues to impact the rate. I'll now turn the call over to Dushyant for closing comments.\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nThanks, Paul. To close, we are very excited about the continued acceleration of demand for our product and services exemplified by our expectation of over $100 million of bookings in 2022 and accelerating growth in IPN and also the fact that outside of IPN and related investments, our EBITDA is already materially higher. I hope this provides you the context of why this gives us confidence in our growth and profitability for years to come, especially when you consider the fact that we have almost doubled our business on a fully implemented run rate basis in just two years. It is very exciting, and we are just getting started.\n\nWith that, I would like to thank our team who tirelessly work very hard to serve all of our clients. And I'll now turn the call over to the operator for questions.\n\nOperator\n\nThank you. [Operator instructions] The first question is from the line of John Davis with Raymond James. Your line is open.\n\nJohn Davis -- Raymond James -- Analyst\n\nHey, good morning. Just, Dushyant, impressive margins this quarter, you kind of called out expense control and really focusing on profitability. Maybe just help us kind of understand how you think about the longer-term margin ramp? And how you think about getting back or getting to that 25% to 30% longer-term margins that you guys have talked about?\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nThanks, John. I think, look, our focus remains that. And first of all, the reason we wanted to highlight the fact that our core business is already more profitable than -- or in some ways, the EBITDA is subdued because of the investments we are making into IPN and other products and frankly, it's materially higher than that than what we are reporting here. So we feel very confident that as our investments start to deliver more results -- financial results, we will be able to get back to the type of margins that we have talked about.\n\nAdditionally, we are making -- we are very focused on expense control and making sure that we are -- in this tough market, we are being very judicious about all our investments, all new expenses we are making. So we plan to get there, I think, over a period of time, and we'll talk more about that in our next quarter as well.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. And then, nice to see the upside this quarter, just reiterate the guide. Any kind of timing shift stuff that fell in this quarter? Or should we just view the fourth quarter guide as conservative?\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nI think, look, our range for the fourth quarter is still broader, as you can see and primary views are, we got -- there are three factors, implementation, the pricing adjustment based on inflation and the inflation itself. So if things fall in our favor, we could be in the mid to high end of the range. And if some of them don't, it will be in the low to mid-part of our range. So I wouldn't consider that guide to be a conservative guide.\n\nI think that's the range we are pursuing based on these factors.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. And then, last one for me quickly. Any help in size --  in helping size IPN or maybe if you can't talk about when you think it could be material to the top and bottom line? I know it's growing nicely, but just curious if you can help us with sizing there, that would be helpful.\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nLook, we'll provide our guidance next year, but it is growing. We're expecting 2023 IPN to be growing much faster than our overall growth rate as stipulated here. And it is IPN and some of the related products, I mean, are -- have a headwind toward our EBITDA margin, so as you've talked about. So that also start to -- as I shared earlier, I think we'll be able to overcome that as those investments start to pay off even more so than they are already doing right now.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. Appreciate the color. Thanks, guys.\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from the line of Dave Koning with Baird. Your line is open.\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nYeah. Good quarter, too. And, I guess, my first question, I guess it's a little like John's in terms of like gross revenue guidance, even the top end implies a sequential falloff a little bit in Q4. And is there something seasonal about Q4 that would cause that or I -- because I would normally think that the billers just keep adding on to each other and naturally just get sequential progression through the year.\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nWell, I mean, in our -- first of all, there are different factors. I think Q4 on its own it has -- believe it or not, a lot of bills are still paid during the working hours and the weekdays. And Q4 tends to have a lot more holidays than some of the other quarters of the year. That plays a role in this, but the other factors are in -- based on how the implementations are going and how we will be able to -- how many of them are able to produce for us during the quarter.\n\nAnd a couple of the other points I talked about, the inflation itself and the pricing related to the inflation.\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nYeah. OK. And then, one nice trend. I mean your contribution profit all through the year has grown at least as fast as your gross revenue, even with the inflation kind of in the market.\n\nDo you see going forward if inflation continues, can you continue to have that pattern, especially as the IPN comes on that, I guess, network fees get leveraged basically?\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nYeah. I mean, look, IPN has a pretty interesting factor, which is neither it is affected by -- because there's no interchange associated with this. So there's no inflation impact that way. So if anything, we do have the ability to adjust our pricing based on inflation, and we do that on the IPN side already.\n\nBut that is just a net benefit, but there's no additional cost due to interchange rising. So we see that as IPN starts to become a material contributor to our business. And IPN, I think, we will talk, Paul and I will -- as I mentioned in our prepared remarks, we'll talk more about that in 2023 because we want to talk a little bit about, give you the color behind how we see IPN growing, not just the way the dimension it is understood to be in. But if you reflect back on what I said earlier that we now have access to 1 million payees and a lot of them are SMB businesses.\n\nSo for us, we think of IPN truly a network effect where we can take these payees we are sending payments due to now start offering them products and services we otherwise wouldn't be able to because -- and especially given they're receiving money from us, we are able to target those payees more effectively. So said differently, IPN to us is bigger than just the one source of revenue. It's also an ability to monetize more of the products and services than otherwise is visible. But we'll talk more about that.\n\nBut to specifically address your point you're talking about is that absolutely if IPN becomes -- as IPN becomes a bigger part of our business, interchange does get less of the factor.\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nYeah. Got you. Well, great. Thanks, guys.\n\nOperator\n\nThere are currently no further questions registered. [Operator instructions] There are no additional questions waiting at this time. I'll now turn the call back to management team for any closing remarks.\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nWell, thank you for your time. Really appreciate it and look forward to speaking to you later. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaul Seamon -- Vice President, Finance and Strategy\n\nDushyant Sharma -- Founder and Chief Executive Officer\n\nJohn Davis -- Raymond James -- Analyst\n\nDave Koning -- Robert W. Baird and Company -- Analyst\n\nMore PAY analysis\n\nAll earnings call transcripts"
}