{
  "companyName": "Nyxoah S.A.",
  "companyTicker": "NYXH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/nyxoah-sa-nyxh-q2-2022-earnings-call-transcript/",
  "content": "Nyxoah S.A. (NYXH -8.78%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Nyxoah second quarter '22 conference call. [Operator instructions] Please be advised, today's conference is being recorded. I would like to hand the conference call to your speaker today, Jeremy Feffer, vice president of investor relations.\n\nPlease go ahead.\n\nJeremy Feffer -- Vice President, Investor Relations\n\nThank you, James. Good afternoon, everyone, and welcome to our earnings call for the second quarter of 2022. Participating from the company today will be Olivier Taelman, chief executive officer; and Loic Moreau, chief financial officer. During the call, we will discuss our operating activities and review our second quarter financial results released after U.S.\n\nmarkets closed today, after which we will host a question-and-answer session. The press release can be found on the investor relations section of our website, and this call is being recorded and will be archived in the events section of our investor relations website. Before we begin, I would like to remind you that any statements that relate to expectations or predictions of future events, market trends, results or performance are forward-looking statements. All forward-looking statements are based upon our current estimates and various assumptions.\n\nThese statements involve material risks and uncertainties that could cause actual results or events to materially differ from those anticipated or implied by these forward-looking statements. Our forward-looking statements are based upon currently available information, and the company assumes no obligation to update these statements. Accordingly, you should not place undue reliance on these statements. For a list and description of the risks and uncertainties associated with our business, please refer to the risk factors section of our Form 20-F filed with the Securities and Exchange Commission on March 24, 2022.\n\nWith that, I would like to turn the call over to Olivier.\n\nOlivier Taelman -- Chief Executive Officer\n\nThank you, Jeremy. Good afternoon, and good evening, everyone, and thank you for joining us for our second quarter 2022 earning call. We continued to make excellent progress toward our key strategic objectives during the second quarter, and we are extremely well-positioned as we move into the second half of 2022. As a reminder, our three key strategic priorities for this year are: completing the U.S.\n\nDREAM pivotal trial, accelerating commercial execution in Germany and commencing of Access U.S. IDE study for complete concentric collapse, or CCC, patients before year-end. Before I go in details, let's start with a fact-based summary on Q2 achievements. To this end, I'm pleased to report that we have completed enrollment in DREAM, and 91 patients have made it through the funnel to implantation.\n\nThe remaining implants are being scheduled, and we expect to report 12-month clinical data in the fall of 2023 with regulatory approval expected in the first half of 2024. We achieved sales of EUR 935,000, which represents 450% growth year over year and 42% growth quarter over quarter. We also activated 11 new commercial sites in Germany during this quarter, which has begun implanting as of the third quarter, bringing the total to 26 active sites in Germany. From a clinical perspective, we are thrilled that the FDA, after previously granting us breakthrough designation, has approved our IDE to commence the ACCESS study.\n\nWe expect to implant our first patients in the trial before year-end. From an innovative leadership perspective, we are core to have our next-generation Genio 2.1 approved by the FDA for use in the DREAM-ID study and received CE Mark approval in Europe for clinical and commercial use. I would, once again, like to recognize our growing team for their commitment to strong execution as we advance the Nyxoah story on numerous fronts. Let me start with our commercial, focused primarily on Germany.\n\nGermany is the largest and most competitive HGNS, hypoglossal nerve stimulation, market outside of the United States. Nyxoah has dedicated German salespeople and similar DRG and reimbursement level as other hypoglossal nerve stimulation technologies. We have defined our commercial success by achieving significant market share gains each quarter, culminating in market leadership by the end of 2022. For the second quarter, we generated EUR 935,000 in total revenue, representing growth of more than five times versus the second quarter of 2021 and 42% growth versus the first quarter of 2022.\n\nWe estimate, based on our knowledge of the German market, we increased our German market share by 4 to 5 percentage points versus Q1, which brings us close to 30% market share in Germany. During the quarter, we activated 11 new sites in Germany, which have begun implanting as of the third quarter, bringing our total to 26 active implanting accounts in Germany. We expect to be at least in 35 standards by the end of 2022. This rapid growth has been driven by inbound interest from ENT surgeons and sleep specialists eager to work with us.\n\nPhysicians and patients are embracing our unique approach centered around to the patient with a scalable technology platform, a single incision procedure, as well as the only full body 1.5 and 3.0 Tesla MRI compatible hypoglossal nerve stimulation solution. From a reimbursement perspective, we continue to make great progress implanting patients in Switzerland and Finland, and we continue our discussions with local healthcare authorities in Belgium, the Netherlands, Italy and the U.K. We are also pleased to see the growth in complete concentric collapse patients now receiving Genio implants since these patients previously had no suitable treatment option other than major pallet surgery and were contraindicated to commercially available hypoglossal nerve stimulation therapy. The first CCC patients that have been implanted for up to six months are showing extremely strong results.\n\nAs an illustration, one CCC patients who presented with a baseline AHI of 58 suffering from severe OSA had an AHI of understand at six months post-implant. These results encourage more physicians to recommend Genio for their CCC patients. In addition, we are the only company offering solutions for both CCC and noncomplete concentric collapse patients without the need for an extra dice examination. This simplifies and shortens the patient's journey from initial diagnosis to hypoglossal nerve stimulation treatment.\n\nTaking all of these factors together, we reiterate our guidance of achieving market status leader status -- market leadership status in Germany in Q4. Moving now to our DREAM study. I'm pleased to report that we have completed enrollment in the trial, with 91 patients having made it to the Funnel 2 implantation, the remaining implants are being scheduled in our U.S. implant sites.\n\nWe anticipate having 12-month clinical data from the study in the fall of 2023, and we will pursue a model of PMA submission. To that end, we are currently preparing the first modules for submission, which are product technical dossier, including preclinical data, and we are getting ready for manufacturing validation. We anticipate submitting the final DREAM clinical data module in the fourth quarter of 2023 and launching Genio in the second quarter of 2024. The investment in our U.S.\n\nmarket access organization have already begun. As for CCC, our IDE submission for the ACCESS study was approved by the FDA, and we are beginning work to initiate the study with the first patients to be implanted before year-end. We will implant up to 106 patients across 40 clinical sites in the U.S. and file with 12-month data, putting us on course for regulatory approval in early 2025.\n\nOur patient-centric focus on innovation was further illustrated by the regulatory approvals of Genio 2.1 next generation system, which is an upgrade to the external components of Genio for use in our DREAM trial and for clinical and commercial use in Europe. Genio 2.1 improves patients' comfort and compliance with a new smartphone application. Patients receive daily feedback on their therapy usage and has ownership to adjust stimulation amplitude within predefined boundaries by their physician. For patients more sensitive to neuro stimulation, clinicians will now have a solution to fine-tune stimulation amplitude to determine the optimal level of comfort.\n\nGenio 2.1 is also equipped with embedded sensors to allow physicians to further scale of therapy stimulation parameters based on patient position and throughout the night. Importantly, all of these new features are available to Genio patients without the need for a surgical procedure to replace the implantable component, as Genio is the only scalable hypoglossal nerve stimulation implant as it allows patients to always have the most advanced features with their existing implant. As a reminder, Genio is also the only system with both full-body 1.5 Tesla and 3.0 Tesla MRI compatibility to ensure that patients always feel safe and do not have to worry about explanting their device to undergo an MRI. 3.0 Tesla currently represents up to 40% of all MRIs and is expected to become the standard in the near future.\n\nWe also continue to advance our development of a next-generation neuro stimulation technology focused on the ansa cervicalis nerve as part of our exclusive licensing agreement with the Vanderbilt University in the U.S. We are progressing toward the prototype device and expect to commence a feasibility study in 2023. These efforts embody our mission to build a product pipeline that will enable us to offer solutions to current non-responding hypoglossal nerve stimulation patients and non-eligible to treat patients. We look forward to providing more updates as this project progresses.\n\nTo further illustrate Nyxoah's approach of putting patients first, we are thrilled to partner with Acurable to offer AcuPebble home sleep test. Nyxoah is developing a complete obstructive sleep apnea ecosystem in order to best serve and support patients all the way through their OSA journey. AcuPebble is next-generation home sleep test that uses acoustic signals to diagnose OSA. The signals are uploaded to a smartphone application and processed to report an accurate OSA diagnosis, providing high specificity and sensitivity for both the AHI, apnea-hypopnea index, and the oxygen desaturation index, or ODI.\n\nAcuPebble is clinically validated through a randomized study published in the BMJ Open, and AcuPebble us CE Marked and also has FDA clearance. AcuPebble breaks down many of the barriers to receiving an accurate OSA diagnosis in a timely manner. With AcuPebble and Genio, Nyxoah can now offer patients and clinicians the most cutting-edge OSA diagnosis and treatment solutions. We look forward to launching AcuPebble in Germany in the fourth quarter of this year 2022.\n\nWith that, I'm pleased to turn the call over to our CFO, Loic Moreau, who will provide a financial update.\n\nLoic Moreau -- Chief Financial Officer\n\nThank you, Olivier. Good day to everyone, and thank you for joining us today. Revenue for the second quarter ended June 30, 2022 was EUR 935,000, compared to EUR 170,000 for the second quarter of 2021. The increase of 450% was primarily attributable to sales of the Genio system in Germany.\n\nTotal cost of goods sold for the second quarter of 2022 was EUR 334,000, implying a gross margin of 64.2%. This represents a significant increase versus the 56.2% posted in the first quarter of 2022. As a reminder, first quarter gross margin was negatively impacted by a one-off flooding incident in our manufacturing site in Tel Aviv that was remediated in short order. We continue to expect gross margin to expand over time, in line with other neuro stimulation companies as we achieve greater commercial scale.\n\nTotal Q2 operating expenses were in line with our plan as we continue to focus on research and development and our clinical programs. R&D increased to $3.5 million in the second quarter of 2022 from $2.4 million in Q2 2021, mostly due to the development of Genio 2.1 and future generations. Selling, general and administrative expenses rose to EUR 4.5 million for the second quarter of 2022 from EUR 3.9 million in the year-ago quarter due primarily to increased commercial efforts in Germany and other European markets. We also added headcount to our corporate infrastructure and expect to continue investing in human capital as we further scale up our organization, particularly our U.S.\n\ncommercial team. Total operating loss for the second quarter of 2022 was EUR 7.4 million versus EUR 6.3 million in the second quarter of 2021, driven by the acceleration in our R&D spending, as well as our commercial and clinical activities. We realized a net loss of EUR 5 million for the quarter ended June 30, 2022, versus a net loss of EUR 6.7 million for the second quarter of 2021. As of June 30, 2022, cash and financial assets totaled EUR 123.3 million, compared to EUR 135.5 million on December 31, 2021.\n\nTotal cash burn was EUR 2 million per month during the first half, but we note there was a EUR 6 million foreign exchange tailwind, so monthly cash burn was closer to EUR 3 million, excluding FX. We continue to expect monthly cash burn increase slightly in the second half of 2022 as we commence the ACCESS trial in the U.S. and invest in our direct-to-patient marketing efforts in Germany. We continue to have ample liquidity to get through U.S.\n\ncommercialization in the first half of 2024. Finally, I'm extremely proud that Nyxoah has been included in the newly formed Euronext sector leaders initiatives, which is an index composed of 100 of the most innovative tech companies listed on Euronext. With that, I will turn the call back to Olivier.\n\nOlivier Taelman -- Chief Executive Officer\n\nThank you, Loic. With the first half of 2022 complete, we entered the second half with confidence and excitement that we will achieve our key strategic goals for the year. With DREAM enrollment complete, we turn our focus to the 12-month follow-up period. We will continue to accelerate our market share gains in Germany as we attain market leadership status.\n\nAnd we look forward to implanting our first ACCESS patients before year-end as we work to provide a solution for complete concentric collapse patients whose only other treatment option is major pallet surgery. This concludes the formal part of our presentation. Operator, I will turn the call over to you, beginning our Q&A session.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Ross Osborn from Cantor Fitzgerald.\n\nOlivier Taelman -- Chief Executive Officer\n\nHi, Ross.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nHi. Congrats on the quarter and the progress made. I guess, two questions for me. I'll go and ask both upfront.\n\nHow many CCC patients were implanted during the quarter? And then my second question, on AcuPebble, are you able to, I guess, disclose the financial relationship there, and then, how we should think about the impact to your top line? Thank you.\n\nOlivier Taelman -- Chief Executive Officer\n\nYeah, so let me start by answering the first question on how many CCC patients were implanted. As you know, Ross, since we now have in Europe, the label expansion for CCC, we are no longer doing a dice examination. So to that point, we cannot no longer exclude or know precisely how many of are CCC or how many are non-CCC. So we don't know precise how many that we have.\n\nWhat we do see, however, is that we're also getting CCC patients after the dice examination that were identified to be implanted with the unilateral stimulation, and that is definitely also accelerating and helping us further growing our business in Germany. So I'm sorry that I cannot go more into that on this. And when it comes to AcuPebble and the financial combination, so we start collaborating with the distribution agreement with AcuPebble. We have Germany identified as a pilot country.\n\nSo the investment, in fact, it's a minimum investment. But as you can also understand the financial impact of the details, this is something that we would not -- that we also are not -- no further commenting on. But the financial impacts will be immaterial as we will initially be launching and to select centers of excellence in Q4 to gain experience with the system before we do a broader whole load.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nOK. Understood. Thanks for taking my questions, and congrats on the progress.\n\nOlivier Taelman -- Chief Executive Officer\n\nThank you, Ross.\n\nOperator\n\nOur next question comes from Adam Maeder from Piper Sandler.\n\nSimran Kaur -- Piper Sandler -- Analyst\n\nGreat. Hi, everyone. This is Simran, on for Adam. Congrats on the progress this quarter.\n\nI wanted to start on DREAM. It sounds like there are still some patients that need to be implanted about 24 by my math. Maybe just talk a little bit about when we should be pulled through these patients. I mean, it does sound like it is imminent, but just higher level the trends you're seeing in the trial in recent weeks in terms of baseline PSG, securing OR time, staffing shortages, just any of the -- those kind of headwinds that you may be facing.\n\nOlivier Taelman -- Chief Executive Officer\n\nOK. Well, a very interesting question, and thank you for your question. So let me maybe first start by explaining again what the definition of enrolled means. It means that the patient has a signed consent, and they will be entering the screening funnel leading to an implant.\n\nAs a reminder, once a patient provides content and passes the initial screening criteria of age and BMI, the process is to undergo a forked PSG to determine baseline AHI level. If the patient does, indeed, have moderate to severe OSA, the next step will be to undergo advice to exclude or to determine CCC. If non-CCC, the patient undergoes a baseline PSG and will then move into implant. To date, we have already implanted 91 patients, and 38 are already very advanced in the screening process as a significant portion of these have already passed their PSG and dice.\n\nSo in a conservative scenario, 40% of these should make it to implant leading to 150 implants. But if you are more into a realistic scenario, with the patients that we have enrolled today, we would already be good to implant over 125 patients. So that's where we are. Now from a timing perspective, I'm sure that you remember very well during our last earning call that we were at 66 implants.\n\nSo in fact, we implanted 25 patients during the last three months. We still need and implant 24 more. We feel strong and we have strong confidence that we can do it in two months. For the reason I just disclosed, we have identified the patients.\n\nWe have enrolled the patients. We know in every site where they are. And that's why we think it will take another, let's say, six to maximum eight weeks to fully finish all implants.\n\nSimran Kaur -- Piper Sandler -- Analyst\n\nPerfect. Thank you. And just a real quick follow-up there. I think the last time we talked, there was a mention about the sample size having been reduced from 134 to 115.\n\nCan you remind me if this affects the statistical powering of the study? Are there any parameters in the design that need or needed to be adjusted due to the smaller population?\n\nOlivier Taelman -- Chief Executive Officer\n\nNo, it does not affect any statistical program study for the simple reason that we stay with a 65% respond rate on AHI. So nothing has changed on this. The only thing we did based on the better sleep data is we looked at the ODI reduction, and there, we also aligned with the 65% respond rate, which was resulting into the reduction to 115 implants. But there is no change in statistical power.\n\nThere is no change in primary endpoints, no nothing. Everything stays the same.\n\nSimran Kaur -- Piper Sandler -- Analyst\n\nOK. Perfect. And if I could just squeeze one last one. You guys saw great momentum and nice improvement in the commercial business in Q2.\n\nI know you don't have financial guidance, but can you talk about how you think about the business here over the near term and remainder of 2022 in Germany? Any puts and takes there would be helpful.\n\nOlivier Taelman -- Chief Executive Officer\n\nYeah. I will hand this question over to Loic, to our CFO.\n\nLoic Moreau -- Chief Financial Officer\n\nYeah. Thank you, Olivier. So as you know, we're not providing formal revenue guidance, but I can say that we are encouraged by the positive feedback we are receiving on and strong progress we are making in our key markets, particularly in Germany, and we do expect revenue to increase each quarter this year. Given this positive momentum, we are generally comfortable with current analyst consensus for this year.\n\nSimran Kaur -- Piper Sandler -- Analyst\n\nPerfect. Thank you, guys.\n\nOperator\n\nAll right. Our next question comes from Suraj Kalia from OpCo.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nGood afternoon, everyone. Olivier, can you hear me all right?\n\nOlivier Taelman -- Chief Executive Officer\n\nYes, I can. Hello, Suraj.\n\nSimran Kaur -- Piper Sandler -- Analyst\n\nSo Olivier, in Germany, what percent of the patients implanted in the quarter were CCC? And if you could just give us some metrics in terms of the sites where Nyxoah patients were implanted. What was the decision matrix versus Inspire?\n\nOlivier Taelman -- Chief Executive Officer\n\nSo first of all, when it comes to CCC patients, it's very difficult now to put a precise number on what is the percentage CCC versus non-CCC for the simple reason that, in Germany, the businesses are no longer doing a dice examination to define whether the patient is CCC or non-CCC. As I mentioned, we have in our label boat. So this disposure is gone. So I don't know precisely anymore how much is CCC or non-CCC.\n\nThat's one thing. What we do know is that based on literature, it goes up to 30% of patients having or showing CCC. So that's the first question. The second one, when you say how do sites where we implant and we must to be very precise, we had patients implanted in Q2 coming from 15 sites.\n\nIn those sites, the key decision criteria for the physician are, one, the bilateral stimulation. So it seems and also based on recent public article comparing unilateral and bilateral stimulation that a lot of physicians who really prefer the bilateral stimulation talk to their patients. Next, it is the single incision.So that makes the procedure growing fast, that makes the procedure also decreasing the risk for [Inaudible] and that also for payments makes it more acceptable, only having one incision that is very discrete under the skin compared to multiple incisions. Those are the two main components that we are getting from physicians when they are making their criteria to choose for Genio.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nGot it. Two other questions, Olivier. First, just following up on the no dice procedure. Obviously, Inspire is also running down a clinical trial with no dice requirements.\n\nDo you envision a point in time, maybe not in the distant future, where both companies are -- do not require dice, and therefore, the whole notion of CCC or non-CCC gets somewhat muddled up? And a follow-up and my final question, Olivier, if I could just throw it in there. For the U.S. commercial launch, as you'll plan for it, walk us through how your view the right market approach, the type of reps, do they have to have OSC experience or just neuro modulation? And also, any thoughts on the DTC approach, would be greatly appreciated. Folks, thank you for taking my questions.\n\nOlivier Taelman -- Chief Executive Officer\n\nYeah. So let me start with the first one, where I would like to comment on Inspire running a trial to eliminate diagnose CCC. So first of all, let me remind you again that Genio already has the CCC label in Europe, and therefore, there is no need to diagnose CCC any longer when using -- choosing for Nyxoah. Now regardless of the outcome of the Inspire study, and I think it's called predictors.\n\nUnless Inspire gains a CCC label, patients will still need to undergo an evaluation to determine if they have CCC prior to getting an Inspire implant. So I don't really see the difference besides gaining the CCC label expansion like we did already in Europe and like we all know, also building the first clinical evidence in the U.S. using our ACCESS study that was part of the breakthrough designation. The second question on how a business model would look like in the U.S.\n\nI think what we are learning in Germany is that the ENT surgeon will stay crucial to do a high-quality implant also in the U.S. But if you look at the patient journey, the role of the sleep physician is so important because sleep physicians are the ones who are seeing patients that are diagnosing patients and that will also choose what kind of treatment option they will advise to their patients. Now to that extent, the way we have built our team in Germany and what we're also thinking of using as a commercial approach when we will be able to enter the U.S. commercially is that we will make sure that there is the high-quality field clinical engineers supporting the ENT surgeons when doing an implant and when activating patients.\n\nBut next on this that we will also have real sleep experts who speak language of sleep physicians, meaning they can help in the phenotyping and identification of patients. And next, when a patient is implanted, they can also help and guide in a perfect follow-up, so that the patient can benefit from the optimal stimulation settings. So that's where we see it a little bit different compared to what competition is doing. We will focus more on sleep physicians, and we will also work with dedicated people who are really sleep experts in identifying patients and in ensuring that they get the best potential stimulation parameters in the follow-up.\n\nWhen it comes to DTC, of course, I also see the great work that has been done so far on DTC, that is really resulting in an increase of awareness for hypoglossal nerve stimulation in general. But as we will be the second company that will be coming into the U.S. market, it's clear that we do not have the same power to invest the amount in DTC. And again, in line with our commercial approach, we will focus on fleet physicians, and then we will selectively invest in DTC to study further referral parts to those sleep physicians and ENT surgeons that are very expertise with hypoglossal nerve stimulation and an excellent implant device.\n\nI'm sorry that my answer was a little bit longer, but I hope it was clear. And if not, please ask, and I will try to clarify.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nNo, that's great. Thank you.\n\nOperator\n\nAll right. At this time, I'd like to turn it back to Nyxoah for any closing remarks.\n\nOlivier Taelman -- Chief Executive Officer\n\nThank you very much, again, for joining us today. And of course, we look forward to updating you again very soon. Thank you for your time. And thanks for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeremy Feffer -- Vice President, Investor Relations\n\nOlivier Taelman -- Chief Executive Officer\n\nLoic Moreau -- Chief Financial Officer\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nSimran Kaur -- Piper Sandler -- Analyst\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nMore NYXH analysis\n\nAll earnings call transcripts"
}