{
  "companyName": "NeuroPace, Inc.",
  "companyTicker": "NPCE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/neuropace-inc-npce-q2-2022-earnings-call-transcrip/",
  "content": "NeuroPace, Inc. (NPCE -2.93%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to NeuroPace second quarter earnings conference call. At this time, all participants inn a listen-only mode. We will be facilitating the question-and-answer session at the end of today's call. As a reminder, this call is being recorded for replay purposes.\n\nI would now like to turn the call over to Matt Bacso from the Gilman Group for a few introductory comments. Please go ahead.\n\nMatt Bacso -- Investor Relations\n\nThank you, operator. Good afternoon, and thank you for participating in today's call. Joining me from NeuroPace are Mike Favet, CEO; and Rebecca Kuhn, CFO. Earlier today, NeuroPace released financial results for the second quarter ended June 30, 2022.\n\nA copy of the press release is available on the company's website. Before we begin, I'd like to remind you that management will make statements during this call that include forward-looking statements within the meaning of federal securities laws, which are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Any statements made during this call that relate to expectations or predictions of future events, results, or performance are forward-looking statements. All forward-looking statements, including those around NeuroPace's business development opportunities or projections, market conditions, clinical trials, and those relating to our operating trends and future financial performance, the impact of COVID-19 on our business, and prospects for recovery, expense management, market opportunity, revenue outlook, and commercial expansion are based upon our current estimates and various assumptions.\n\nThese statements involve material risks and uncertainties that could cause actual results or events to materially differ from those implied by these forward-looking statements. Accordingly, you should not place undue reliance on these statements. For a more detailed description of the risks and uncertainties associated with our business, please refer to the Risk Factors section of our public filings with the Securities and Exchange Commission or SEC, including our annual report on Form 10-K for the year ended December 31, 2021, filed with the SEC on March 10, 2022, and our quarterly report on Form 10-Q to be filed with the SEC on August 11, 2022, as well as any reports that we may file with the SEC in the future. This conference call contains time-sensitive information, which we believe is accurate only as of the live broadcast on August 11, 2022.\n\nNeuroPace disclaims any intention or obligation, except as required by law, to update or revise any financial projections or forward-looking statements whether because of new information, future events, or otherwise. And with that, I'll turn the call over to Mike.\n\nMike Favet -- Chief Executive Officer\n\nThanks, Matt. Good afternoon, everyone, and thank you for joining us. For today's call, I will provide opening comments and a business update followed by Rebecca, who will provide additional detail regarding our quarterly results and full-year 2022 financial outlook before opening the call to Q&A. Before I cover second-quarter results, I want to share some exciting news.\n\nWe announced today that NeuroPace will become the exclusive U.S. distributor of DIXI Medical's product line. DIXI Medical is a European company that pioneered the development of stereo EEG or SEEG, intracranial electrodes. These electrodes are used in comprehensive epilepsy centers to determine where epileptic seizures originate.\n\nThe SEEG approach to intracranial monitoring was developed in Europe and in recent years has become the predominant approach used for localization in United States. SEEG is a less invasive process compared to the prior approach that required a craniotomy to position the diagnostic electrodes. SEEG has faster patient recovery and increases patient willingness to go through the diagnostic process. This synergistic partnership leverages the NeuroPace field organization that is already calling on the same customers and supports the NeuroPace objective to engage earlier in the diagnostic and therapy selection process.\n\nDIXI Medical has been selling in the United States since 2019 with a small direct sales team. With this small sales team, DIXI generated approximately $5 million of revenue in 2021. We believe that in 2019, the United States market for intracranial monitoring electrodes was approximately $25 million to $40 million, with per procedure revenue of approximately $10,000. Prior to the pandemic, the number of intracranial monitoring studies was increasing as more CECs were created and more drug-resistant epilepsy patients were being treated.\n\nWe believe that the number of SEEG procedures have been growing even faster as more of the intracranial monitoring procedures are being done using SEEG. We expect to leverage our field organization, which is much larger than DIXI's and already calling on the same customers to sell these best-in-class SEEG electrodes. This opens a new growing market to drive incremental revenue through our existing commercial organization. Additionally, we believe that selling SEEG electrodes to CECs provides a significant opportunity for improved visibility into patients moving through the epilepsy monitoring units, or EMUs, many of whom are potential RNS patients.\n\nApproximately two-thirds of patients implanted with our RNS device are admitted to the EMU for intracranial monitoring, as part of the process to identify where seizures originate. Prior to this agreement, we were already working to engage earlier in the diagnostic and therapy selection process in order to provide earlier patient education on the benefits of RNS therapy, as part of the therapy decision process. This partnership improves our access and visibility into the patient pipeline in a way that we believe will increase the rate of adoption of RNS therapy within CECs. Overall, we believe this partnership is highly synergistic and not only provides an additional revenue stream but also strengthens our existing RNS patient funnel.\n\nMoving on to our quarterly revenue results. Total revenue in the second quarter of 2022 was $10.2 million. Initial implant revenue in the second quarter of 2022 was $8 million, compared to $9.2 million in the prior-year period. We estimate that in the first half of 2022, the number of patients coming through EMUs was significantly below 2021 levels.\n\nAs a reminder, we estimated EMU volumes in 2021 were approximately 75% to 80% of pre-pandemic levels. Fewer patients coming through the EMUs means that fewer patients were being evaluated for a potential RNS system implant. We believe that the reason for the decrease in EMU patient volumes in 2022 is a combination of EMU staffing shortages and the impact of COVID-19. During the second quarter, we believe there was a gradual improvement in the EMU operating environment with those positive trends continuing into the third quarter.\n\nWe believe as we continue to build traction, a higher percentage of patients coming through the EMUs are being treated with RNS therapy, and that we will benefit in future quarters from increasing EMU volumes as those patients work through the diagnostic process. Given what we saw in the second quarter of 2022 and the gradual recovery in EMU patient volumes, we believe an adjustment to our full-year outlook is necessary. We now expect full-year 2022 initial implant revenue to be in the range of $34 million to $36 million. In summary, we continue to believe there is a meaningful and growing backlog of epilepsy patients who have been -- who have deferred treatment since the start of the pandemic.\n\nAfter another COVID spike, we expect the number of patients going through the EMU diagnostic process to incrementally improve as the operating environment continues to normalize in the second half of 2022. Turning to our commercial expansion initiative. We completed our goal of expanding the size of our field-based sales team in the first half of the year, ending the second quarter with 52 field-based sales team members in total. For the remainder of the year, we will focus on integration and training to ensure the team is operating at the highest level.\n\nAs a reminder, the larger field team will allow us to increase utilization within CECs by adding more prescribers and implanting centers. This will also provide the resources needed to call an epilepsy specialists who practice outside of CECs in order to increase RNS referrals into implanting centers. Through these referral development efforts, we can make RNS therapy available to a larger number of patients. Additionally, these patients can be followed by epilepsy specialists practicing outside CECs, which provides an attractive option to both the patient and the care team.\n\nThe expanded field team will also support growth of DIXI Medical SEEG electrode sales, which we expect will provide a nice incremental revenue opportunity for our business. Moving to the recent clinical updates and future indication expansion opportunities. We recently began enrollment in our NAUTILUS pivotal trial to support a PMA supplement to expand our indication to include primary generalized epilepsy. We expect to increase enrollment through the remainder of 2022 by bringing additional study sites online.\n\nWhile still early in our pursuit of our generalized epilepsy indication expansion, we remain on track and are excited about what this could mean for our business and for patients. Next, I would like to provide an update on replacement implant revenue. Revenue from replacement implants was $2.2 million in the second quarter of 2022, which came in above our expectations. Because replacement implant timing is primarily determined by when the neurostimulator battery expires, there can be variations quarter to quarter.\n\nTo provide continued transparency as of June 30, 2022, there were 143 patients being actively treated with first-generation devices. We continue to expect quarterly replacement revenue to sequentially decline throughout the year as the remaining first-generation devices are replaced with the longer-lasting second-generation devices. Given the strength of the replacement revenue in the first half of 2022, we now expect approximately $7.5 million of replacement implant revenue for the year. Lastly, I would like to speak to steps we are taking to manage our expenses.\n\nHaving completed our commercial expansion initiative in the first half of 2022, our strategy is to leverage our sales infrastructure and drive productivity to deliver top-line growth. We performed a strategic assessment across the business and have focused spending on our highest priority efforts, including market penetration and the NAUTILUS study to expand indication for use into generalized epilepsy. As a result, we have reduced our forecasted spend and now expect operating expenses to be flat sequentially into Q3 and Q4 for the core RMS business. Lastly, in association with the DIXI Medical partnership, we expect to recognize incremental expenses of approximately $1 million in the fourth quarter.\n\nIn summary, while we faced headwinds from reduced EMU patient volumes, the operating environment improved in the second quarter, with positive trends continuing into the third quarter. We completed our sales force expansion initiative, which will allow us to increase adoption of RNS therapy in CEC and facilitate patient referrals to further increase the size of the market opportunity. We announced a strategic partnership with DIXI Medical, which grants NeuroPace access to a new adjacent market, while also providing better visibility into the diagnostic evaluation pipeline for our core RNS business. We also began enrollment in the NAUTILUS study, which was a key milestone on our path to expand the market opportunity for our RNS system into generalized epilepsy.\n\nAll of these position us well as we move into the second half of the year. With that, I will turn the call over to Rebecca, NeuroPace's chief financial officer.\n\nRebecca Kuhn -- Chief Financial Officer\n\nThanks, Mike. NeuroPace's revenue for the second quarter of 2022 was $10.2 million, compared to $12.6 million for the second quarter of 2021. In the second quarter, revenue from initial implants was $8 million, compared to $9.2 million for the second quarter of 2021. We experienced a decrease in initial implant procedures in the second quarter, primarily due to the reduced number of patients going through the EMU diagnostic process in the first half of the year.\n\nRevenue from replacement implants was $2.2 million, compared to $3.4 million in the second quarter of 2021. We continue to expect replacement implant revenue generally to decrease for the next couple of years due to the transition to the current model of our device, which has a longer-lasting battery. Gross margin for the second quarter of 2022 was 73%, compared to 74% in the second quarter of 2021. The decline in gross margin relative to the prior-year period was primarily due to an increase in indirect labor costs, including stock-based compensation.\n\nTotal operating expenses in the second quarter of 2022 were $18.4 million, compared with $14 million in the same period of the prior year. R&D expense in the second quarter of 2022 was $5.7 million, compared with $4.4 million in the same period of 2021. The increase in R&D expense was primarily driven by an increase in personnel, product development, and clinical study expenses. SG&A expense in the second quarter of 2022 was $12.8 million, compared with $9.5 million in the prior-year period.\n\nThe increase in SG&A was primarily driven by personnel-related expenses, increased costs associated with operating as a public company, and increased sales and marketing costs to support commercial expansion initiatives. Loss from operations was $11 million in the second quarter of 2022, compared to $4.6 million in the prior-year period. We recorded $1.9 million in interest expense in the second quarter, which was flat compared to the prior-year period. Net loss was $12.7 million in the second quarter of 2022, compared to $8.5 million in the second quarter of 2021.\n\nOur cash and short-term investments balance as of June 30, 2022, was $92.4 million, while our long-term borrowings totaled $51 million. Now, turning to our outlook for 2022. We now expect total revenue between 43 and $45 million. This assumes initial implant revenue between 34 and $36 million.\n\nGiven the strength in replacement revenue in the first half of the year, we now expect to generate approximately $7.5 million for the full year. Lastly, we expect to generate approximately $1.5 million of revenue in the fourth quarter from our new partnership with DIXI Medical. Moving down the income statement. We expect gross margin will be in the low 70% range.\n\nOur updated gross margin guidance includes revenue contribution from DIXI Medical, which carries a lower gross margin relative to our core RNS business. We now expect 2022 total operating expenses will be in the range of $74 million to $75 million, of which approximately $8 million to $9 million in noncash stock-based compensation expense. As Mike mentioned previously, we expect operating expenses for the core RNS business will be roughly flat sequentially in the third and fourth quarters, given the steps we are taking to focus on our highest priority efforts and reduced expenses in the second half of 2022. With the DIXI Medical partnership expected to close at the beginning of the fourth quarter, we expect to recognize an incremental $1 million of expenses in the fourth quarter.\n\nLastly, under the distribution agreement, NeuroPace will pay DIXI Medical, a $2 million cash payment in the fourth quarter of 2022 and two additional payments of $1.25 million each in the fourth quarter of 2023 and 2024, respectively. We expect that each cash payment will be recognized as expense over the following 12 months. Given the attractive revenue synergy opportunity, we expect this deal will be accretive to operating income by the first quarter of 2023 and cash flow positive by early 2024. This concludes our prepared remarks.\n\nI would like to turn the call back over to the operator, who will open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] And our first question coming from the line of Lawrence Biegelsen from Wells Fargo.\n\nLawrence Biegelsen -- Wells Fargo Securities -- Analyst\n\nGood afternoon. Thanks for taking the question. Mike, can you hear me OK?\n\nMike Favet -- Chief Executive Officer\n\nYes, I can hear you.\n\nLawrence Biegelsen -- Wells Fargo Securities -- Analyst\n\nGood. And congrats on the DIXI agreement. A couple of questions for me. Well, first, I'll just ask about the business trends and then one on the DIXI agreement.\n\nSo, it sounds like trends are improving, we're improving through the quarter. Any more color you can give on trends -- monthly trends through Q2? Anything you're seeing in July and August and how to think about the Q2 -- Q3, I'm sorry, and Q4 cadence for the underlying business, excluding DIXI? And then I had a follow-up on DIXI.\n\nMike Favet -- Chief Executive Officer\n\nVery good. Thanks. Thanks for the question, Larry. So, a little bit of additional clarity.\n\nGoing back, our customers told us that in the first quarter, the number of patients that were coming through the EMUs dropped off significantly because of Omicron. There was a more significant impact in Q1 than we had seen with the prior waves of the COVID pandemic. That didn't have a large impact for us in the RNS implant numbers in Q1, as most of the patients that had already been through the workup process were implanted by the end of that quarter. But the larger impact for our business was really in the second quarter and the start of Q3, as the new patients needed to be worked up through the EMU diagnostic process before getting scheduled for an implant with the RNS device.\n\nThe customers are telling us more recently that EMU operating environment has been recovering back to 2021 levels. So, we heard that from the customers through Q2 and continuing improvements in the operating environment in the third quarter of this year. Those are patients that ultimately are being considered for interventional therapy, including the RNS device implanted -- implantation. Talking specifically about our trends and our business, I wanted to give you some visibility into one of the ways that we monitor future revenue, and that's through case addition.\n\nSo, when a patient is scheduled for an RNS device and implantation, we have visibility to that. Typically, these patients get scheduled for an RNS implant a couple of weeks to a couple of months in advance of when the actual implant procedure happens. We saw that in the month of May and in the first half of June, there was a significant drop-off in RNS cases being added to the schedule. Reason for this is that patients that would have been scheduled added to the schedule in May and June were the patients that would have been worked up through the diagnostic process in late December and in January.\n\nAnd so, we saw that drop off as a result of Omicron impact in Q1. More recently, starting at the second half of June and through July and into August, we've seen those case adds return back to expected levels, as the flow of patients coming through the EMU is normalized, as I had mentioned. And so, that gives us better visibility and confidence that the trends are improving, not just the EMU trends, but that's translating through -- to implant volume trends as we go through the rest of Q3 and into Q4. So, hopefully, that gives some additional clarity on what's happening.\n\nLawrence Biegelsen -- Wells Fargo Securities -- Analyst\n\nYeah. I mean, I don't know if you want to comment on Q3, Q4, cadence, Mike.\n\nMike Favet -- Chief Executive Officer\n\nSo, generally, the expectation is that there'll be incremental improvements in volumes of initial implants from Q2 to Q3 and from Q3 and Q4. So, as we work through that process, that's the general cadence that we're expecting is sequential increases through the last couple of quarters of the year.\n\nLawrence Biegelsen -- Wells Fargo Securities -- Analyst\n\nAnd maybe before the DIXI question, just one more on the outlook. Any preliminary thoughts on how to think about 2023? Should we think about the growth rate where consensus was before today, but maybe just at a -- of a lower base? Any preliminary thoughts on '23? And I'll ask the DIXI question right now. The $25 million to $40 million opportunity you talked about upfront, Mike. Is that how we should think about the opportunity for DIXI? And over what time do you think you can capture that? And I'm going to throw one more in.\n\nThe margins, I heard it was below the corporate average. But any more color on the, you know, margin. Sorry for all the questions there.\n\nMike Favet -- Chief Executive Officer\n\nAll right. Very efficient. So, I will do my best to go through each of those and then Rebecca can jump in on the margin question. So, talking about the longer-term growth expectations, given the improvements that we're seeing in the operating environment, we feel good about the updated 2022 revenue guidance.\n\nAnd while we're not providing guidance for 2023 at this time, we continue to believe in the fundamental growth prospects for the business overall. Really, that's driven for us by the changes that we've made in our business. So, the expansion of our field team that we completed in the first half of this year, allowing us to call an epilepsy specialists that are practicing outside of the CECs in addition to work that they're doing to increase utilization within the CECs. We're also making good progress toward that earlier patient in education, awareness earlier in the diagnostic process, the partnership with DIXI really helps us with that to be able to have a call point for patients that are going through the diagnostic process in addition to creating a revenue opportunity of its own right.\n\nAnd so, together, we feel very good about the fundamentals of the business and kind of where that takes us coming out of Q2 into the rest of this year and over the longer-term. But again, not providing specific guidance about 2023 at this time. Going to your question around DIXI market opportunity. The $25 million to $40 million of our estimate of -- what was the actual revenue in that market in 2019.\n\nSo, a couple of years ago, the number of patients that were being treated with electrodes, different types of electrodes for intracranial monitoring procedures, and the revenue generated from that. As I mentioned, in 2021, DIXI had about $5 million of revenue. And so, coming out of that, there is a significant market share opportunity, I'm associated with that, and we're looking forward to having that product, the best-in-class SEEG product that we would be able to take through our larger sales organization to be able to incrementally take share within that space. In addition to that, historically, the market has been growing.\n\nThe number of patients being evaluated for diagnostic procedures going through the stereo EEG procedure, going through intracranial monitoring procedures that's grown, as the number of patients being treated at comprehensive epilepsy centers has gone up, the number of comprehensive epilepsy centers has gone up. I mean, so we don't -- we believe that that $25 million to $40 million isn't a static number, but it's a growing market opportunity in which we have opportunity to take additional share over time. And then let me turn it to Rebecca, who can talk about the margin impact.\n\nRebecca Kuhn -- Chief Financial Officer\n\nSure. So, NeuroPace will become the exclusive U.S. distributor of DIXI products, and distributor margins are necessarily going to be lower since they are shared economics. When we combine what we believe will be the DIXI gross margin with our core NeuroPace business gross margin.\n\nFor 2022, we believe that the result will be in the low 70% range. Having said that, the DIXI partnership is new, and we do need to complete a full technical accounting assessment to make sure that we have full alignment on how all of the accounting will be for the deal. But we believe that our margins combined will end up in the low 70% range for this year.\n\nLawrence Biegelsen -- Wells Fargo Securities -- Analyst\n\nOK. Thanks for answering all the questions. Sorry for so many.\n\nOperator\n\nThank you. And our next question coming from the line of Robert Marcus from J.P. Morgan. Your line is open.\n\nRobert Marcus -- J.P. Morgan -- Analyst\n\nHi. Thanks for taking the questions. And, Mike, it looks like plus or minus utilization per implanting account has been pretty steady for the past year, year plus, obviously, COVID has had an impact on this and it's been very difficult, especially with overnight stays and the disruption, the time frames, etc. Maybe just to think about how some of your higher volume accounts are performing.\n\nDo you have any metrics like what your top quartile is doing versus your overall, just so we could get a sense of where maybe some of these centers can go to over time as trends improve?\n\nMike Favet -- Chief Executive Officer\n\nYeah. Thanks for the question, Robbie. You're right. Over the course of the last year, year and a half, the number of implants per active center has been relatively stable.\n\nThe growth that we've seen was coming in significant part by adding additional centers. I would say that the impacts with COVID, in particular, have impacted that utilization per center. So, we've been able to successfully expand number of centers over time. But with the number of patients coming through the epilepsy monitoring units at centers, its impact being down at various times because of COVID, that's impacted the utilization rates within those centers.\n\nAnd we've been able to keep utilization rates where they have been historically in spite of a smaller number of patients coming through the EMUs, so if you will, increasing our share of EMU patients. But net result is about a flat volumes. I don't have specific numbers to give for what the top quartile or top portion of customers represents in terms of volumes. But what I can tell you is that the top centers, the top quarter of centers represent significantly higher volume of patients per year than the median.\n\nSo, the median accounts represents a group of centers that still is operating at a relatively low utilization rate, typically, with just one or two of the epileptologists within those centers prescribing the top performing centers are multiple times more volume than the median center. And we expect with time and more prescribers in these other centers, the median centers that we will be able to get those centers up to the volumes seen at the higher volume centers. But without specific numbers, the top performing centers are a multiple of times volume compared to the median center.\n\nRobert Marcus -- J.P. Morgan -- Analyst\n\nGreat. And appreciate you're cutting opex here to help preserve cash. It looks like you got about $100 million on the balance sheet. How are you thinking about your runway for cash when and if you'll need more in the future? And how should we think about sort of your cadence of cash use going forward?\n\nMike Favet -- Chief Executive Officer\n\nYeah. I think -- thanks, Robbie, for the further question. So, just to comment again about the process that we went through. We did conduct a strategic assessment of our business.\n\nAnd coming out of that are focusing our spending on specifically the key priorities that we believe are the big growth drivers for our business. That includes specifically the expansion that we did in the first half of the year of our field team, allowing us to call on more comprehensive epilepsy centers and call on the epilepsy specialist practicing outside of the Level 4 epilepsy centers, and specifically including as well the NAUTILUS study and enrollments in the NAUTILUS study. Those key drivers, we continue to fund and support those for the business going forward. While we continue to support those drivers, we are reducing spending in a number of other areas across the company to be able to extend the runway, the cash runway for the business, and preserve capital for the organization.\n\nAnd so, we've made a number of changes in other areas to drive down those costs. That also allows us to be able to support expansion to the DIXI business without having -- actually still with the -- even by adding that still decreasing the spending for the organization overall. We haven't provided guidance at this time about what the timing is of additional capital needs. But as you commented, we have a very strong balance sheet as an organization today, the spending changes, spending reductions that we're making allow us to extend the runway for the capital that we have in the business.\n\nAnd so, we don't have any needs for raising capital in the near term over the next year, and we'll continue to monitor spending requirements as we go forward to be able to be prudent financial stewards for the company.\n\nRobert Marcus -- J.P. Morgan -- Analyst\n\nGreat. Appreciate it. Thanks a lot.\n\nOperator\n\nAnd our next question coming from the line of Drew Ranieri with Morgan Stanley. Your line is open.\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nHi, Mike. Thanks for taking the question. Maybe just on guidance for new placement implants or new patient implants. It looks like the cost is about 120 to 130 implants.\n\nAnd as you're kind of thinking to Larry's question earlier about the cadence for the back half of the year and the sequential improvement, are you assuming that those 120, 130 implants come back? Or will these kind of be new patients going through the EMU channel?\n\nMike Favet -- Chief Executive Officer\n\nWe expect that there are new patients that are coming through the EMU channel. The patients that back to the Omicron wave that were worked up and were ready for an RNS implant. When that happened, those were predominantly completed in the first quarter. And so, what we've seen in Q2 and what we're seeing as we move into Q3 are really new patients that are coming through that process, including the intracranial EEG monitoring process, getting worked through that process.\n\nAnd so, we're seeing in Q3, with the recovery in EMU volumes in the second quarter that's now starting to translate, has now started to translate into the case schedules for the RNS device as we move into the second half of Q3. And with that, I expect that that continues as we move into the fourth quarter. And so, as I stated with Larry generally expecting that the volumes of patients that are being treated for initial implants will continue -- will sequentially improve from Q2 to Q3 and from Q3 to Q4, driven by that organic volume of patients coming through the EMU.\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nGot it. Thank you. And then on DIXI for a moment. I know you're not ready necessarily to provide guidance for 2023.\n\nBut as we're kind of thinking about our models and adding this new layer to the business, how should we at least maybe think about 2023 revenue? Is it holding kind of the fourth quarter study? Is there kind of a one-term -- or a one-time bolus of orders in the fourth quarter? Just any help would be appreciated. Thank you.\n\nMike Favet -- Chief Executive Officer\n\nYeah. Thanks for the question, Drew. So, we don't anticipate a bolus of orders in the fourth quarter. DIXI has been selling in the United States since 2019.\n\nThey'll continue to sell products through the third quarter, and then we'll take over that responsibility as we enter into the fourth quarter. So, with that, it's going to be, I would say, a continuation of business, as the way that we're thinking about it for the fourth quarter revenue. We haven't provided guidance, as you stated, for Q4 -- I'm sorry, for 2023 at this point, specifically for DIXI, part of that is -- this is going to be a new agreement for us, a new market for us. And so, we'll continue to evaluate that as we pick up responsibility for selling those products in the United States and be able to provide a lot better clarity for that as we get to the end of the year and move into 2023.\n\nBut specifically to your question, the revenue guidance we provided for Q4 isn't based on any bolus. It's a continuation of what they will continue to sell through Q3 and then us taking over that as we enter the fourth quarter.\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nAll right. Thanks, Mike.\n\nOperator\n\nThank you. And I am showing no further questions at this time. I would now like to turn the call back over to Mr. Mike Favet for any closing remarks.\n\nMike Favet -- Chief Executive Officer\n\nGreat. Thank you for your participation today. I'm looking forward to seeing many of you at the upcoming Wells Fargo and Morgan Stanley conferences. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Bacso -- Investor Relations\n\nMike Favet -- Chief Executive Officer\n\nRebecca Kuhn -- Chief Financial Officer\n\nLawrence Biegelsen -- Wells Fargo Securities -- Analyst\n\nRobert Marcus -- J.P. Morgan -- Analyst\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nMore NPCE analysis\n\nAll earnings call transcripts"
}