{
  "companyName": "Sysco",
  "companyTicker": "SYY",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/sysco-syy-q4-2022-earnings-call-transcript/",
  "content": "Sysco (SYY -0.51%)\nQ4 2022 Earnings Call\nAug 09, 2022, 10:00 a.m. ET\n\nOperator\n\nWelcome to Sysco Corporation quarter fiscal year 2022 conference call. [Operator instructions] I would like to turn the call over to Kevin Kim, vice president of investor relations. Please go ahead.\n\nKevin Kim -- Vice President, Investor Relations\n\nGood morning, everyone, and welcome to Sysco's fourth quarter fiscal year 2022 earnings call. On today's call, we have Kevin Hourican, our president and chief executive officer; Aaron Alt, our chief financial officer; and Neil Russell, our SVP of corporate affairs and chief communications officer. Before we begin, please note that statements made during this presentation, which state the company's or management's intentions, beliefs, expectations or predictions of the future are forward-looking statements within the meaning of the Private Securities Litigation Reform Act and actual results could differ in a material manner. Additional information about factors that could cause results to differ from those in the forward-looking statements is contained in the company's SEC filings.\n\nThis includes, but is not limited to, risk factors contained in our annual report on Form 10-K for the year ended July 3rd, 2021, subsequent SEC filings, and in the news release issued earlier this morning. A copy of these materials can be found in the Investors section at sysco.com. Non-GAAP financial measures are included in our comments today and in our presentation slides. The reconciliation of these non-GAAP measures to the corresponding GAAP measures is included at the end of the presentation slides and can also be found in the Investors section of our website.\n\n[Operator instructions] At this time, I'd like to turn the call over to Kevin Hourican.\n\nKevin Hourican -- President and Chief Executive Officer\n\nGood morning, and thank you for joining our call. Q4 marked another quarter of positive top and bottom line performance at Sysco. The quarter capped off strong financial performance in fiscal 2022 as we grew annual sales by 33.8% to over $68 billion. For the year, Sysco grew our business more than 1.3 times the industry.\n\nThis result exceeded our goal for the year and the second half of the year's performance was even stronger than the first. The outperformance in the U.S. helped drive over $17 billion of total company sales growth for the year. Consistent with our focus on profitable growth, we grew adjusted EPS by 133.8%.\n\nOur team generated these results while advancing our recipe for growth strategy, improving our balance sheet, and delivering compelling shareholder returns. I will highlight two topics during our call today. First, I will share progress we have made as a company over the past year that displays Sysco's unique position of strength in the market. Second, I'll convey why we are confident in our trajectory for profitable growth in fiscal '23.\n\nBefore I get started, let me acknowledge that we are closely monitoring macroeconomic pressures that are impacting consumer confidence across the globe such as spikes in gas prices, food inflation and rising interest rates. Despite these external factors, Sysco is prepared to deliver significant market share gains and profitable growth this coming year. So let's get started with our unique position of strength and a bit more about who we are, displayed on Slides 5 and 6. I am often asked to describe Sysco.\n\nSimply put, Sysco is 50% a food supply chain company and 50% at food sales and marketing company. To be successful as a leader at Sysco and to be successful in this business, you need to be equally capable of leading in both arenas, supply chain, and sales. Over the past two and a half years, we have developed a strategy called our recipe for growth that is advancing our capabilities in supply chain and sales. We are transforming Sysco by building new capabilities that will further enable our position as a global leader in food distribution.\n\nLet me first highlight the 50% of Sysco that is our food supply chain by summarizing some of our biggest accomplishments of the past year. Throughout the year, we have led the industry from an OTIF perspective. For those not in logistics, that stands for on-time and in-full. This past year was the most challenging OTIF year on record in our industry.\n\nDuring those challenging conditions, Sysco was able to be better in stock and better able to shift on time versus those that we compete against. As a result, we won substantial new business and provided stronger-than-industry average service levels to our existing customers. We're deeply committed to returning to and exceeding our historical OTIF levels over the coming quarters and years. We fully converted our supply chain to a full six-day service week.\n\nSimultaneously, we converted the majority of our U.S. frontline associates to a four-day work schedule, enabling improved work-life balance for our associates. The six-day work model for our large network of DCs will enable Sysco to grow profitably for years to come by better leveraging our physical assets. Their transition to the six-day model was a big lift.\n\nAnd I want to thank our associates and our customers for their partnership and the transition. The six-day model will ensure industry-leading OTIF results for years to come. We launched our Sysco Driver Academy, opening our first training location, and began building out a nationwide infrastructure that will be complete by the end of this calendar year. The driver academy is helping Sysco address the shortage of skilled drivers and our Academy will increase the number of skilled drivers at Sysco and will deliver increased lifetime earnings potential for the associates selected to participate.\n\nWe have piloted and are scaling new picking methods at our warehouses that will improve the experience of our delivery drivers. In addition, we're providing our drivers with advanced material handling equipment that reduces the physicality of their day. These actions will improve the experience of our drivers, enabling improved productivity, improved retention, and increased customer service. Lastly, we've built out a distributed order management system, or DOMS for short, that will enable omnichannel fulfillment at Sysco in fiscal '23.\n\nWe have decoupled the front end of our network sales from the back end of our network operations through this project. No longer will a customer need to order just from their local sites inventory assortment. We are opening up our vast network of inventory to our customers through the DOMS implementation, while also improving the productivity of our working capital through this industry-leading project. We will be launching our first [Inaudible] soon with plans to expand and scale in '23 and beyond.\n\nOur supply chain mission at Sysco is clear, enable profitable growth by delivering the industry's leading assortment of products delivered on time and in full at a delivery frequency that meets or exceeds our customers' expectations. Our supply chain greatly enhanced our capabilities to deliver on that mission in fiscal '22. Now I would like to highlight the progress that we have made in the other 50% of our company's key work focus, food sales, and marketing. We live our Foodie credentials every day with over 7,500 sales consultants in hundreds of culinary partners and product specialists across the globe.\n\nI dare say there are a few, if any, that know more about food and food trends than our culinary teams. Our sales associates have the highest customer satisfaction scores in the industry, with NPS overall satisfaction rates, a full point higher than our competitors. Please see Chart 7. Our sales consultants are experts in everything from menus with our customers, identifying and introducing new food trends, and importantly, partnering with our customers to help save them money.\n\nFrom a product perspective, we've the broadest assortment of food in the industry, and we have expanded that assortment strength with the recent acquisitions of Greco, Paragon Foods, and The Coastal Companies. Our product assortment is second to none, and we offer fair and appropriate prices to our customers. Like I summarize with our supply chain, I would like to highlight some of the progress that we have made over the past year with regards to food sales and marketing. We implemented an intelligent data-driven pricing system to improve our ability to be what we call right on price at the customer item level.\n\nWe built and scaled a customer personalization engine, which provides our customers with unique offers that meet their specific needs. We upgraded and improved our digital shopping platform. We improved search navigation, We made it even easier to reorder common essentials, and we introduced product recommendation engines that increase customer basket size. We improved what we call team-based selling, better leveraging our sales teams across broadline and our collection of specialty businesses.\n\nLastly, we can measure success over the past year in several ways. I'd highlight, too. Firstly, during the great resignation, our sales consultant retention in fiscal 2022 exceeded our historical average. Our SCs loved the new tools that we have built, and they have deeply embraced our recipe for growth.\n\nAnd secondly, we successfully grew more than 1.3 times the industry in 2022. This result exceeded our goal for the year and the second half of the year performance was even stronger than the first. Our customers are rewarding us with more of their business because of the relationships they have with our sales teams and because of the new tools and services that we have deployed in food sales and marketing. Defining excellence in food sales and distribution, that is Sysco.\n\nWe are confident that we have the size, scale and expertise to be the leader in these two arenas, bringing innovation to our customers every day. Topic two for today, I'd like to discuss the current economic climate and our view for the upcoming year. We're closely monitoring macroeconomic pressures and data points related to food inflation, gas prices, and consumer confidence. There is no doubt that end consumers have a lot on their minds these days.\n\nWe think it's important to remember the resilience of our industry and how we have adapted over the past few years. We submit respectively that food away from home has proven to be resilient. And quite frankly, essential. Over the last two and a half years, our industry has dealt with challenge after challenge with three major ways of COVID, double-digit inflation, and innovation in Ukraine impacting the food supply.\n\nDespite these challenges, we have delivered profitable growth. We have learned to operate in an abnormal environment and we are prepared to navigate another dynamic year ahead. While we anticipate that recent macroeconomic headwinds make REIT less robust industrywide growth rate in '23 than we had originally planned, we are prepared to generate sales growth of at least 10% in 2023. Aaron will address guidance in more detail in a moment.\n\nThere are several reasons why, we believe, we will deliver on our financial targets. First, as the industry leader, we're fully diversified, covering every corner of the food away from home market. We serve restaurants up and down the price point spectrum and across all restaurant types. We deliver food to healthcare and education facilities that are less prone to recession.\n\nWe deliver to travel and recreation facilities into any office buildings. These last two sectors continue to rebound and will provide a source of growth in the coming years. Additionally, we still have big opportunities to grow in the restaurant space. Even if traffic is more muted than originally forecasted by Technomic, remember that we serve roughly 50% of the total restaurant door locations, and we have roughly 30% share of wallet with existing customers.\n\nSysco can still grow our business even if the market growth is less compelling. And given the strict shutdowns internationally in 2022, we have strong growth potential year-over-year from our International division. Simply put, we intend to win share profitably in fiscal '23. Second, regarding inflation, we continue to work with our customers to pass through the majority of cost inflation.\n\nInterestingly, the relative price of eating out has been less impacted by inflation than the cost of food at the grocery store as seen on Slides 8 to 9. When coupled with people's desire to eat out, we believe that restaurants will once again prove resilient. Third, our investments include sales and marketing capabilities through our recipe for growth strategy will deliver increased value in the coming years. The topics I highlighted on this call today, coupled with new programs like Sysco Your Way and Sysco Perks will drive increased market share growth.\n\nOnce again, we plan to grow faster than the overall industry, with a target in fiscal '23 of growing 1.35 times the industry. This trend will put us on the trajectory needed to deliver our end of fiscal year '24 target of growing 1.5 times the industry. We are increasingly confident in our longer-term guidance provided in May of 2021 at our Investor Day. In addition to ensuring that we drive compelling market share growth, Aaron, our entire leadership team, and I will be focused on productivity improvement and structural cost out.\n\nWe're proud of the progress that we have made in reducing structural costs over the past year and we will be relentlessly focused on improving operations efficiency in fiscal '23. Lastly, we are excited to welcome Paulo Peereboom as the newly appointed leader of our international operations. Paulo has an extensive track record of driving transformation and building high-performing customer-focused teams across multiple geographies. This includes over 30 years of experience across seven countries, all in the food business.\n\nOur international team had a strong year of improvement in '22, and we are increasingly confident in our future. Paulo will take some momentum we are building to the next level. I'd now like to turn it over to Aaron, who will provide additional financial details. Aaron, over to you.\n\nAaron Alt -- Chief Financial Officer\n\nThank you, Kevin, and good morning. The Sysco team delivered strong financial results for the fourth quarter and the full financial year, giving us many reasons to be upbeat about our business. Let's talk about some of the highlights. We achieved an all-time record for quarterly and annual sales of Sysco landing at $19 billion for the quarter and almost $69 million for the year.\n\nFor the fourth quarter, our enterprise sales grew 17.5% with U.S. foodservice growing at 16.4% and international growing at 30%. At the enterprise level, adjusting out the extra week in Q4 of fiscal year '21, our sales growth was even higher at 26.5%. With respect to volume, U.S.\n\nbroadline volume increased 5.4% on a 13- to 13-week comparison basis. We baked $3.5 billion in adjusted gross profit for the quarter and $12.4 billion for the year, up almost 20% versus last year for the fourth quarter and up 32.5% for the year. Adjusted gross margin improved to 18.4% for the fourth quarter with the rate rising from last quarter and up 33 basis points to Q4 fiscal '21, even with the impact of incremental inflation. GP dollars per case grew in all four segments versus prior year, marking the fourth consecutive quarter of such growth.\n\nWe continue to pass along product inflation, which was around 15% in the U.S. in the fourth quarter, while passing along part of our operating cost inflation. Our Snap-back operating costs dropped to $29 million in Q4. Productivity gaps, however, were a continuing factor as, on the one hand, we returned to employment levels higher than fiscal '19, but on the other, we invested to cover over time to address growing demand and lower productivity of the new staff.\n\nWe invested $67 million of operating expenses for the recipe for growth in the quarter, with supply chain investments ramping up significantly. Overall adjusted operating expenses were $2.6 billion for the quarter or 13.8% of our sales. Operating leverage improved by 55 basis points for the quarter and 117 basis points for the year. Adjusted operating income increased by 45% versus last year to $877 million in the quarter, also exceeding our pre-COVID Q4 2019 results, an excellent sign of progress.\n\nOperating income for the year was $2.6 billion. We are particularly pleased with the progress of our U.S. foodservice segment which delivered record operating income for the quarter and with the continued sequential progress of our international operations, which once again made progress in the direction of pre-COVID profitability. At the enterprise level, we continue to have the highest EBITDA margin in the industry.\n\nAdjusted EBITDA surpassed $1 billion for the first time ever in a quarter at Sysco and we delivered $3.3 billion of adjusted EBITDA for the year, notwithstanding COVID, omicron, inflation, the invasion of Ukraine and high fuel prices. Adjusted earnings per share increased to $1.15, which is an all-time high for the fourth quarter or any quarter for that matter at Sysco. In regards to the balance sheet, we paid down $450 million of debt as it came due in Q4. We ended the year at 2.9 times net debt to adjusted EBITDA, and during the fiscal year, we returned $1.5 billion to shareholders through 500 million of share repurchase completed in the fourth quarter and $959 million of dividends.\n\nSince year-end, we have also repurchased additional shares. More on that to come. Cash flow from operations was $1.8 billion, and free cash flow was $1.2 billion for the year. With our focus on driving rising sales and profitability comes rising inventory and a higher balance of healthy accounts receivable, both the use of cash for the year.\n\nOur team continues to manage our receivables balance as well and we also benefited from higher accounts payable. We ended the quarter with approximately $867 million in cash on hand. So let's turn to look forward. In recent months and indeed at the start of my comments today, I observed that Kevin and I are upbeat about our business.\n\nAnd that view carries through to future quarters for Sysco. The upbeat guidance we are providing is reflective of our ongoing investments and our extensive efforts to reposition Sysco as a growth company. As Kevin mentioned earlier, we are well-positioned and prepared to operate through another dynamic year and are assessing whether and to what degree a recession will impact the economy and our business. It's worth repeating that we benefit from the scale at which we're operating, our diversification as the industry leader across customer types, product categories, and geographies, the discipline enabled by our pricing tool, our strong balance sheet, and demonstrated focus on cost takeout.\n\nWe have carefully examined Sysco's results during the '08-'09 recession, and importantly, we benefit from the fact that our company has just operated through and learned from the business interruption of COVID. Here's the real punch line. \"we are better positioned today to address macro events than we have ever been before.\" So with all of that said, during fiscal '23, from a growth algorithm perspective, we expect to grow at least 1.35 times the market regardless of the economic environment. While it is difficult to be precise from the current macro environment, based on initial estimates of market growth and inflation, we expect top-line growth of at least 10% over fiscal year 2022, which will move Sysco above the $75 billion annual sales mark for the first time.\n\nBolt-on acquisitions will also contribute to our growth. We are expecting mid-single-digit inflation for the full year on an enterprise basis across all categories, moderating from high single digits in the first quarter on a year-over-year basis to low single digits in Q4. We are not planning for a deflationary environment, though some categories may be individually inflationary. We do expect elevated operating expenses during the year as we continue to deal with the hiring environment that is still recovering associate tenure driven productivity issues that we expect to improve over the course of this year and continued planned investments for our transformation, all these mitigated in part by cost-out efforts.\n\nSpeaking of cost out, we delivered significant cost out in fiscal 2022, helping offset incremental operating expenses this year. We have now exceeded our cumulative cost-out target of $750 million. And we're going back for more, the achievement of which is already included in our EPS growth expectations. All in, we are growing our adjusted EPS with both volume growth and profit improvements contributing to our substantial increases in earnings per share.\n\nWe are guiding adjusted EPS for fiscal year '23 of $4.09 to $4.39. The midpoint of this range equals a 30% increase in adjusted EPS over fiscal year 2022. It also represents a 20% increase in our adjusted EPS from our previous high point, fiscal '19. Please take note of the fact that even the low end of our adjusted EPS range for fiscal year '23 reflects the highest adjusted EPS achieved at Sysco ever in a year.\n\nWhile I do not intend to debate the definition of recession with economist, the low end of our range reflects a modest recession impacting our year. And the midpoint reflects the current operating environment and the top end reflects a strong economic recovery. The macro environment, our productivity improvement efforts, and the timing of our recipe for growth investments will impact the cadence of our earnings growth with stronger profit growth expected in the second half. For Q1, we expect adjusted EPS to be at or near our prior first quarter high point from back in 2020.\n\nThe stronger earnings growth in the second half reflects continued progress with our recipe for growth, progress on productivity initiatives, lapping last year's omicron-related slowdown, and the fact that Q4 is always our seasonal profit high point. You may recall that in May 2021, we provided long-term guidance for fiscal year '24 to achieve adjusted EPS 30% higher than fiscal '19. The midpoint of our fiscal year '23 guidance, which is 20% above fiscal '19 reflects that we are well on our way to achieving our previous long-term EPS guidance. The midpoint of our guidance also translates to adjusted EBITDA of approximately $4 billion in the year.\n\nWe are forecasting continued strong cash generation and an increase from 2022 levels driven by profit increases, offset by investments in working capital as AR grows with our sales, and we continue to our strategy with tactical investments in inventory. Our capital allocation strategy remains sustained going forward, invest in the business, including through M&A, maintain our strong investment-grade rating, and continue our return of capital to shareholders. With EBITDA growing, we expect to make further progress on our net debt to adjusted EBITDA leverage in service of our target of 2.5 times to 2.75 times. Also, note that we are positioned well in the current rising interest rate environment as approximately 95% of our debt is fixed.\n\nJust last week, Moody's reaffirmed Sysco's strong investment-grade credit rating and stabilized our rating outlook. We are committed to completing up to $500 million of share repurchases in fiscal '23, and indeed have already completed $267 million of that repurchase commitment during Q1 of this year. We will be assessing the operating environment and the cash needs for further M&A opportunities before committing to an incremental share repurchase activity beyond the $500 million during the year. Our status for the dividend aristocrat is important to us and we already announced the effective $0.08 annual dividend increase for our fiscal year '23.\n\nIn summary, we view fiscal '23 as an excellent build upon fiscal '22 as we grow both the top line and the bottom line, while playing the long game and investing for the future at Sysco. All of these efforts are consistent with fulfilling our long-term guidance from Investor Day, which includes exceeding 1.5 times market share growth by the end of fiscal year 2024 and adjusted EPS growth of at least 30% over our record 2019 levels. With that, I will turn the call back over to Kevin for remarks.\n\nKevin Hourican -- President and Chief Executive Officer\n\nThank you, Aaron. As we conclude, I'd like to provide a brief summary on Slide 25. Sysco already is the industry leader from an EBITDA margin perspective. And as you heard from Aaron, we plan to build on that position of strength in fiscal 2023.\n\nOur key takeaways from today's call reflects three points. First, we advanced our recipe for growth strategy and grew more than 1.3 times the market for the year, with the second half even stronger than the first; second, we improved profitability with sequential progress in both gross profit and operating margin rates; and third, recognizing macroeconomic pressures as well as the resiliency of our industry, we're confident in our external guidance for fiscal year 2023. This assumes at least 10% sales growth and 30% EPS growth at the midpoint as we continue to grow with new and existing customers. We will also remain disciplined in expense management with a strong plan to drive increased operating leverage.\n\nTurning to the next slide. We are generating substantial top-line momentum and accelerating market charities. Our recipe for growth transformation is winning in the marketplace and creating capabilities at Sysco that will help us profitably grow for the long term. We are further building upon and enhancing our competitive scale advantages.\n\nSysco's strength of income statement and balance sheet have enabled us to continue advancing our strategy during a difficult operating environment, while also rewarding our long-term shareholders with disciplined dividend growth and share repurchases. Lastly, we are committed to our long-term financial outlook, which includes significant sales and EPS growth and returning value to our shareholders along the way. There are bright days ahead for Sysco, and I'm both excited and proud to be a part of the journey. Operator, you can now open the line for questions.\n\nOperator\n\nThank you, sir. [Operator instructions] Your first question comes from Lauren Silberman of Credit Suisse. Please go ahead.\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nThank you very much. I just wanted to ask first one on local case growth, down seven days for the quarter. Can you give us that number excluding the lapping over the 53rd week, just so we understand the underlying trend? And then on a three-year basis versus '19, it looks like local case growth is down about 1.5%, pretty consistent, I think, each quarter throughout the year. So any color you can provide on what you're seeing as an independent customer.\n\nKevin Hourican -- President and Chief Executive Officer\n\nGood morning and thank you for the question. This is Kevin. I'll just start with math to answer to your question, and I'll talk a little bit about what we're seeing from a volume perspective. So flattish is the answer from a Q4 same number of weeks year-over-year.\n\nAnd just keep in mind, as you look at this past year, when we were comping against recovery, which Q4, we were comping against a pretty strong recovery in '21. So flattish volumes on 13 to 13 against prior year, pretty strong recovery. What we're seeing right now from a volume perspective is when you couple that with inflation that was higher than what we had modeled and expected, really strong sales results for the quarter. And obviously, that strong sales, coupled with the flattish volume for local flowed through to a profit number that was robust for the quarter, exceeded our guide.\n\nAs Aaron mentioned, highest quarter ever for Sysco. As we think about this coming year, I'd point you to Slide 10 that was in our prepared remarks, that chart does include all business. It's not just local, but it speaks for itself, the performance of Sysco over time that we're pulling away from the market. I stated on the call this morning that we grew at 1.3 times the industry for the year.\n\nAnd I also was pretty clear that we grew in the second half even faster than the first. So and the chart shows that, if you look at the lines in the separation that's occurring. So we're building momentum, that moment, answer your question just on trends is carrying through at the national level and also at the local level. We're winning more new national business at profit rates that meet or exceed our expectations, and we're having a lot of success at the local level.as well.\n\nMy comments in regards to macroeconomics do apply to all customer types, including the mom-and-pop local independent. We view cost of fuel as one of the primary drivers of consumer sentiment and that high cost of fuel that was impacting consumers began in the Q4 and is included in the business trends that we're producing, and it was thoughtful in the guide that we provided today. Last but not least, Aaron's comments of at least 10% sales growth this year and 30% EPS growth, and we're confident in our ability to deliver against those mile-markers.\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nGreat. Thank you for that. And if I could just ask a follow-up on gross profit. So gross profit dollar growth per case growth has been very strong.\n\nIt feels like inflation is peaking. What's your confidence in maintaining gross profit dollars? Are you seeing any signs of pushback from consumers on the inflation? And I know you're not expecting deflation in '23, but should we see deflation? I mean how do we think about that ability to maintain gross profit dollars? Thank you very much.\n\nKevin Hourican -- President and Chief Executive Officer\n\nYes. Thank you, Lauren. We're just really pleased with the work that we're doing within our merchant organization to drive to net lowest cost for Sysco. So through strategic sourcing.\n\nJudy Sansone and our merchant team is just doing excellent work to enable Sysco due to our size and scale to provide value to our customers, point one. Point two, Sysco's brand improvement in the quarter because of the value that Sysco brand provides to our customers. We're helping to save them money at high-quality rates and our sales force did a really good job in the most recent quarter of introducing Sysco brand to our customers. Last point, only three, the intelligent data-driven pricing system that we are leveraging is enabling us to be very sophisticated and thoughtful on how we're passing through that inflation.\n\nSo we are confident that we can pass through inflation to our customers. And as I mentioned in my prepared remarks and our sales team then worked with those exact same customers to help them be successful. Think about portion size. Think about ingredients on the menu.\n\nThink about the menu itself and how it can adjust, modify change to help that end restaurant be successful and for them to be profitable during this period of high inflation. So we are confident in our ability to continue to pass through inflation and we are confident in the guide that we provided today. I'm going to toss to Aaron for the second half of your question, Aaron, over to you.\n\nAaron Alt -- Chief Financial Officer\n\nGreat. Good morning. Just to observe that we are assuming and expecting moderating into levels over the course of the year. We're not expecting a deflationary environment, although some categories may be deflationary and we've built that into our own models from a mix perspective.\n\nI want to observe as well that the inflation in our guidance is actually enterprise, not just USPL which we have typically disclosed in prior quarters. And to perhaps reinforce Kevin's point, I am quite pleased with both the opportunity we have to optimize our product portfolio, the cost structure, as Kevin called out for us, but also to work with our customers, utilizing Sysco Brand products to optimize for both of us while also being pleased with our continued ability to pass through increased product inflation costs to our customers and then onto their own customers.\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nThank you very much.\n\nKevin Hourican -- President and Chief Executive Officer\n\nThank you, Lauren.\n\nOperator\n\nYour next question comes from Ed Kelly of Wells Fargo. Please go ahead.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nYeah. Hi. Good morning, guys. Thanks for the color.\n\nI wanted to start with just the trend in underlying case growth in the U.S. Could you maybe talk a little bit about the cadence of the case growth versus sort of '19 as the quarter progressed. And then what you are seeing in July and August? Are you above 2019 at this point? And then you mentioned consumer sort of changing or seeming like, I guess, maybe consumer risk. But are you actually seeing any impact yet?\n\nKevin Hourican -- President and Chief Executive Officer\n\nGood morning, Ed. Appreciate the question. What we talked about on the prepared remarks is just -- and you obviously know this -- and know this well. Our diversification from high to low restaurants from the white table cost all the way down to QSR, we're fully diversified across that spectrum and the broad product range that we carry from good, better, and best pricing strategies, we cover the gamut from restaurant customer perspective.\n\nThere's no notable call-out to report on shift within restaurant sectors other than to say there are winners and losers and top performers and top companies and top brands are doing well and weaker companies are not doing as well relatively. And we're seeing that in each of the restaurant consumer sectors that strong operators are performing well, weaker operators are donating share to the strong performers, but there's not a meaningful trend or news for us to share or talk about. We provided color today relative to our overall performance versus the market accelerating and widening as it relates specifically to July, August. Our recommendation is to focus on the guide that we provided today, which is the 10% sales lift for the year.\n\nAaron just talked about the inflation that's inherent in that sales guide and then the profit guide that we provided. So no meaningful call-outs, we're upbeat and positive on the performance of the company and our business trends and we point you to the full year guide to talk about how we're currently performing.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nOK. Great. And then just a quick follow-up it's really around SG&A, particularly around the U.S. business.\n\nYou've made quite a bit of investment this year. You can kind of see that right in your opex dollars versus '19 or opex per case, for instance, quite a bit. How are you thinking about 2023 from sort of an opex per case standpoint, does that continue to grow? I mean it sounds like it does. But then at some point, it seems like once this settles down, that there's real opportunity to sort of capitalize on a lot of those investments.\n\nSo I'm kind of curious as to when you think we see that period.\n\nKevin Hourican -- President and Chief Executive Officer\n\nEd, this is Kevin. I'm going to start just talking about overall supply chain productivity, and then I'll toss to Aaron, who can comment on overall expense leverage and anything he'd like to share in that regard. Aaron called out in our prepared remarks where we're winning as a company. There are elements where we're doing really well.\n\nWe're winning from a top-line perspective. We're gaining share, both national and local. We're doing an excellent job at GP management passing through inflation, using strategic sourcing to purchase product at a competitive rate, and having that impact positively our margin rates, and we had a disappointment from an expense perspective versus where we expected to be. I want to be clear on what the driver of that is and it's just in general, our overall productivity within our supply chain being behind where we expected it to be.\n\nAnd I want to unpack that a little bit, make some comments about it and then toss to Aaron. I want to be clear, we are properly staffed within our supply chain at this point in time, and that is a dramatic improvement year-over-year. This time last year, with the recovery of the business was occurring and the great resignation was happening, we were understaffed as well as the industry and it created a lot of pain within our supply chain. We are properly staffed at this time.\n\nOur hiring has improved, applicant flow has improved and the training that we are providing to our new associates has simply never been better. In fact, we're heading to one of our sites this afternoon to go spend time with our training academy and celebrate the success that, that team is having on providing literally the industry's best training program to our associates. So we are properly staffed, we are investing in training at a level that we have not before. We have a challenge in overall math, which is the simple following point.\n\nRoughly half of our supply chain associates have been with the company for under a year. And it's that point, that point alone, that results in a productivity rate that is below, therefore, our historical average. These are challenging jobs. They're skilled labor positions, and it takes time for someone to move up the productivity curve.\n\nThe reason for my calling out that data point, that roughly half of our associates were in job under a year, is that is absolutely an addressable topic by Sysco's leadership, myself, our team, and the driver and selector academies that I referenced on today's call. We will improve associate retention in the process of improving that retention and improving our training efforts, we will move people up the productivity curve. And in the process of moving up there the productivity curve, it will lower our logistics cost as a percent of sales and our logistics cost to serve. It's taking a little bit longer than we would have liked, but we will improve retention.\n\nWe will improve productivity, and that has been included in the guidance that we provided today for fiscal '23. Aaron, I'll toss to you for additional comments.\n\nAaron Alt -- Chief Financial Officer\n\nGreat. Let me touch a couple of the elements as apparent on the face of Kevin's remarks, we're going to increase volume over the course of fiscal '23. And of course, with increased incomes, increased cost of service. We would all expect that.\n\nDuring the quarter, we did also have to address increased costs of things like fuel, recruiting, etc., cost to hire, and those are moderating, right? And we have steps in place, hedging or other programs to address those as well. But as we look forward, we expect those to improve in fiscal '23. Kevin has already touched on the impact of productivity. As we called out in our guidance, we expect that to improve over the course of the year.\n\nOur transformation expenses were higher in Q4. And indeed, we will continue to invest heavily in the year as we play the long game against our transformation expense, but those are costs that over time will moderate. And then snap back, they came down in Q4, and we expect them to continue to come down over the course of the year. Now the thing we haven't talked about so far yet is cost out, right? We were pleased that we had surpassed our original cost-out objective of $750 million during the year.\n\nAnd as I said in my prepared remarks, we are going back for more, and there is more opportunity. One of the benefits of operating of a company of the size of Sysco is where we find a good idea and we deploy it, we can recognize what works and that we can deploy to other parts of our enterprise. And so we've actually recently revised our structure of cost leadership to go after more and are confident that we can continue to help to offset some of the costs elsewhere in the network, at least through cost out as we carry forward. The benefits, they're all baked into the guidance that we've provided for fiscal year '23.\n\nThank you.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nThanks, guys.\n\nKevin Hourican -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from Mark Carden of UBS. Please go ahead.\n\nMark Carden -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my questions. So you grew at 1.3 times the market in fiscal '22, which topped your original expectations, there's obviously some macro challenges in place. But is there any reason why you would expect your market share glide path to slow in fiscal '23 before accelerating in '24? Is this just some conservatism built in with the 1.35 times or are there specifics on that front that we should be aware of?\n\nKevin Hourican -- President and Chief Executive Officer\n\nMark, I appreciate the question. Thank you for asking. The step-up is just go back to our original guide from May of '21, our Investor Day was to grow 1.2 times in the year that just ended into grout 1.5 times in fiscal 2024. And essentially, fiscal '23 was going to be a midpoint between those two things as we ramped up our recipe for growth.\n\nWhat happened in fiscal 2022, the year that just ended, is we had two primary contributions to our success. One was our recipe for growth, which I'm going to come back to in a second. The second was our ability to ship on-time and in-full, as I mentioned on today's call, was greater than the industry at large. And we had national customers and local customers coming to Sysco and essentially asking us to take on their business, and we were able to take on that business at above historical profit rates because of the economic macro conditions as they were.\n\nSo that relative supply chain strength was a large contributor to our success and the recipe for growth was a large contributor to success. And what we guided today is a 1.35 times market growth. As Aaron said, regardless of how the market performs, we're going to perform better than that market in total. What will happen in '23 is the relative supply chain strength contribution will be smaller because we expect for the overall marketplace to be more stable in this coming year and the relative impact of the recipe for growth will be greater in '23.\n\nAnd the reason it steps up to 1.5 times in fiscal '20 again, that recipe for growth contribution gets bigger and stronger each year. Why is that? I'll just point to a couple of examples. We're an agile development health from a tech perspective, and we're rolling out new functionality to our website literally every two weeks. And those contributions of increasing the efficiency of placing an order, add value.\n\nThe work we're doing with data and analytics to provide suggested orders to our customers get smarter and better over time, it adds value. I mentioned in my prepared remarks today, two of our newer efforts, which is Sysco Your Way and Sysco Perks, there's still an implementation mode at the current time. Here's the good news. Both programs are exceeding our internal expectations for the neighborhoods and customers that have been enrolled, and we will roll those programs out nationwide over the coming quarters and years.\n\nAnd so that's a relative contribution. So what we see is a sequential increase in the effective power and weight of those programs, and it's why we reiterated today our overall macro confidence in our ability to grow 1.5 times in the market in fiscal '24. And we think given everything that's going on in the overall environment, the 1.35 times guide that we provided today is prudent. Aaron, I'll toss to you for additional comments.\n\nAaron Alt -- Chief Financial Officer\n\nJust one final thought, which is to observe that for a company of our size to still have a 17% market share, 30% penetration and we serve about 50% of the independent that gives -- that just reinforces just how much opportunity there is out there as we deploy the recipe for growth to drive, particularly with the benefit of our balance sheet.\n\nMark Carden -- UBS -- Analyst\n\nMakes sense. And so separately, you noted that you're still able to pass through the majority of inflation. Are competitors acting any less rationally with respect to price the temptation for smaller players grow to get more aggressive, just to stay relevant? And then how does your pricing tool impact your positioning in this environment?\n\nKevin Hourican -- President and Chief Executive Officer\n\nWe're seeing a rational pricing environment. I'd say all distributors understand the cost increases to them and understand the impact to their P&L if they don't pass through the inflation. So we're seeing a rational pricing market out there. They're specific to our pricing tool and what enables one of the data feeds into our pricing tool is market price competitiveness.\n\nAnd it's a new muscle at Sysco. So think about every region within which we operate. We are intelligent about scraping the market to understand price, what's happening in the marketplace. It's one of -- I emphasize that, one of the data feeds.\n\nWe've got other data feeds like what's our pricing strategy for that category, for that cuisine, for that customer type. And it's an algorithm that gets utilized, therefore, to provide a specific item of customer-specific price. So we are better equipped than ever before to understand what's happening in the local environment because pricing is local in this industry than we've ever been before.\n\nMark Carden -- UBS -- Analyst\n\nGreat. Thanks so much and good luck.\n\nKevin Hourican -- President and Chief Executive Officer\n\nThank you, Mark.\n\nOperator\n\nYour next question comes from John Heinbockel of Guggenheim Partners. Please go ahead.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nSo, Kevin, I want to start with -- you said at least 10% growth. So you can grow 10% in a mild recession, right, and, I guess, possibly grow faster than that if the macro is better. So I guess what would happen in a slower environment, your share gains, maybe you can comment -- your share gains relative to the market would increase beyond the 1.35 times right? And where would that come from primarily? Do you think that's wallet share that 30% goes up? and what would be the one or two things that would be most impactful in driving that wallet share this year, the next 12 months?\n\nKevin Hourican -- President and Chief Executive Officer\n\nJohn, good question. Thank you. Yes, mathematically implied in what you just said is if the overall market grows less than what we expected, and we communicated today that we see our ability to deliver at least a 10% sales lift. We will then take more share.\n\nAnd we will do so profitably. I want to be crystal clear, I've said before, many times, I'll say again, we will not use price as a primary lever to try to win business. We think that's irrational. And we want to win through assortment, our service, our capabilities, our programs, etc., etc.\n\nIf you pick just one thing to focus on to improve profitability, it would be increased penetration with existing customers. That's the direct answer to your question. If we could focus on one thing and one thing only, it's increased penetration with existing customers. we are really pleased with what we're seeing, John, with Sysco Your Way and Sysco Perks on penetration by providing customers in Sysco Your Way with late in the evening, caught off increased delivery frequency, no order minimums in a compelling service coverage model, meaning dedicated sales reps, dedicated driver, partner, etc., etc.\n\nThe reward we are experiencing in those neighborhoods is increased penetration with existing customers. And Sysco Perks is a loyalty program tied to our most important customers. Essentially, it's a VIP club, you get invited into. The entire purpose of that club is to increase penetration, increase share of wallet with existing customers.\n\nSo we're bullish on those two strategic arrows in our quiver. But we believe that we can win new business as well. Our sales reps are motivated financially to win new customers. We've got the largest and most qualified sales force in the industry, and they're doing a very good job of new customer prospecting, and we continue to win net new customers at accelerated rates.\n\nSo it's actually the two together is what's causing that separation on Slide 10 of us versus the market. But if you can do one and one only, it's increased penetration with existing customers.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nAnd maybe as a follow-up to that. What's the biggest pushback you get, right, from any restaurant where you have, right, 30% on average, right? So you have plenty that are under 30%. Because it just seems having fewer trucks in the back door, everything on one truck, the economic seems right, overwhelmingly positive. What's the hurdle? And I mean historically, right, we've heard the hurdle on the protein side is just a perception of quality versus specialists.\n\nI imagine that's not the case anymore? Or is that the biggest hurdle?\n\nKevin Hourican -- President and Chief Executive Officer\n\nYeah. I would say that is not the biggest hurdle, especially when you think about our robust specialty platform, where we have the largest specialty business, and with Buckhead in Newport, we have the largest specialty meat business as well. So we call it team-based selling and our ability to deliver that high-end fine protein center of plate along with broadline value is second to none in the industry. And we're doing an even better job than ever before and have been able to bring that specialty price point, that specialty product, along with 50 pounds bags of rice and flour, etc., etc., that broadline is known for.\n\nSo we're doing that very well. John, I'd say in the current economic environment and the reality of COVID the biggest challenge, the biggest barrier has been product availability, believe it or not. The ability to be in stock at all times with key volume items that our customers need, and there have been challenges with long-term outs on product that if you can't deliver, guess what, their customer is going to go somewhere else to get that product. And then if they do go somewhere else, do they get sticky with that source of purchasing on that product, and then you need to win it back over time.\n\nSo that's not a problem that's unique to Sysco. Fill rate from suppliers, inbound distributors has been difficult over the last 18 months because of staffing issues and challenges in the supplier base. And then that has shown up with a customer telling us, \"Hey, listen, I need two or three distributors because if you can't fill my order, I need to be able to have my menu in stock.\" We're making meaningful progress on that topic at Sysco. We are leading the industry from an OTIF perspective, as I mentioned.\n\nSo we don't view that as a point of weakness. We view it as a point of strength, but I'm meaningfully answering your question that, that has been for our industry, the biggest challenge, product availability. Topic two, which is the more historical answer to your question is its price. A competitor comes in on one item and undercuts you on price with that one item and then the customer says, \"Well, hey, wait a minute, I can get this product 10% cheaper somewhere else.\" We don't price -- a business just 1 item.\n\nIt's a book of business. And so there's this that constant, I call it ankle biters, a competitor coming in, trying to undercut you on price on a single item trying to get in the door. And that's not a new topic. People coming in and trying to undercut on a single item.\n\nBut again, our pricing tool gives us the sophistication that we need to make sure that our sales reps are confident in the prices that they're representing in the marketplace are fair and appropriate, and I think we're better equipped to be able to manage that in the future than ever before. John, back to you if you have a follow-up.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nNo. No. That is great. Thank you.\n\nKevin Hourican -- President and Chief Executive Officer\n\nOK. Have a great day, John.\n\nOperator\n\nYour next question comes from John Glass of Morgan Stanley. Please go ahead.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThanks. Good morning, everyone. My question is on international and how international pulls into your top line guidance for '23. Can you maybe frame how -- where case volumes are in absolute versus '19, for example, I don't think we've got the good sense of what inflation -- what the role of inflation has been there.\n\nAnd are there particular initiatives that you've rolled out in the U.S. that roll out maybe to those international markets that help drive sales? Any color there, please?\n\nKevin Hourican -- President and Chief Executive Officer\n\nYeah, John. Thank you for the question. We appreciate it. We're bullish on our international business.\n\nStrong quarter for the quarter that disclosed, wrapped up a strong year versus where we expected that business to be and we're building momentum. As we think about this upcoming year, omicron impacted the United States, and we had some softening in the business in Q2 and Q3. Well, that softening was even greater internationally. Europe was in complete lockdown.\n\nThe country of France, in particular, like shut all restaurants down again during omicron. I mean it's really different how Europe handled COVID. And in Canada, while the lockdowns weren't as robust as Europe, consumer psyche and consumer risk tolerance was much lower than the U.S. and just overall food away-from-home volumes were down.\n\nSo we're bullish about the year ahead. Paulo joining our company, as I announced today on the call, is going to be just a great addition to our team, and we have confidence that this coming year will be a sequential increase in both the top line and the bottom line contribution from international. Specific to your question about initiatives, I love that question. It's exactly what we are doing.\n\nWe are taking the recipe for growth, which is meaningfully working in the U.S., and we are bringing the best practices from now these programs to our international domain, starting with Canada. So we're deploying a new modern website this year in Canada. We are deploying a new pricing tool in Canada this year, and we will be bringing programs like Sysco Your Way and Sysco Perks to Canada as well. The same goes to Ireland and GB and France to round out our larger international sectors.\n\nWe are bringing to each of those countries the main elements of our strength portfolio, including advancing Sysco brand as a represented product offering in each of those countries. So we're thoughtful about it. We are pragmatic about it. We can't do everything overnight, but we are meaningfully rigorously prioritizing, which initiatives are taken to which country when.\n\nAnd obviously, that's been built into our guidance for this coming year. Aaron, I'll toss to you for any additional comments.\n\nAaron Alt -- Chief Financial Officer\n\nGreat. Thank you. Just a couple of observations. We've been pleased with the contribution of the international business to our fiscal '22 delivery, as Kevin called out.\n\nAnd indeed, we have baked continued progress into the core or midpoint of our guidance for fiscal '23 as well. We don't separately disclose the volume numbers for the international business, so I'm not prepared to do that today other than to observe that one of the nice things about the international business, as they continue to make progress, is we're upbeat on the opportunity that, that part of the business continues to present to us to improve as we carry forward. And whether it's leadership on cost out or driving maybe the recipe for growth initiatives that Kevin called out. We have the opportunity to do more in that part of the business.\n\nAnd with the new leadership we have, we're upbeat there.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nAnd Aaron, just a quick follow-up. You talked about snapback and transformation costs pertaining to '23. And in fact, that's one of the -- maybe it's pressuring the first half. Can you give an order of magnitude? Are those bigger, smaller, or similar in '23 than they were in '22?\n\nAaron Alt -- Chief Financial Officer\n\nI'm not going to comment directly on that other than I'm referring you back to my prepared remarks and in particular, the color we tried to give around the cadence of earnings given where they were. The practical reality is if you look at what we said with Q1 being at or near our high point previously and then you do the math from the absolute guide, it's apparent that the profit increases are across the year, and that's the best I can give you.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from Alex Slagle of Jefferies. Please go ahead.\n\nAlex Slagle -- Jefferies -- Analyst\n\nThank you. Good morning. A question on the guidance and what's embedded there kind of what your high-level assumptions are around what kind of recovery you expect in some of the categories that lagged here in the U.S. like business industry and business travel, hospitality.\n\nJust your thoughts there.\n\nAaron Alt -- Chief Financial Officer\n\nSure. Let me offer a couple of thoughts. First, as part of going through our planning cycle for fiscal '23, we were quite detailed in looking at the what-if scenario is around not just the enterprise as a whole, but the individual constituent pieces of our portfolio. And while we don't disclose that as part of our guide, you can have some confidence in the fact that we've looked at what might be the same or different around the European business, the parts of the business in the U.S., the Canadian business, etc., both as it relates to the possibility of recession risk or impact to the consumer, but also on variable rates of inflation and how the pieces fit together.\n\nAnd so what we came out with from a guidance perspective with our $0.30 range was a balanced view, we believe, of if things continue as they are down the midpoint relative to our ability to deliver the profitability. Of course, if there is a modest impact from a recession perspective, again, looking at it across the portfolio as we do the math, you see the lower end of our guide. And indeed, if that doesn't materialize, some are saying it won't, not going to comment on that. We wanted to also reflect the fact that there is some further upside in the opportunity as well.\n\nAnd so we believe our guidance is a balanced approach, having done some detailed work on the individual constituent pieces of the portfolio.\n\nKevin Hourican -- President and Chief Executive Officer\n\nThis is Kevin. I'm just going to add one point. Our total business growth in health, we are seeing positive trends in travel, hospitality, and business and industry sectors that historically Sysco performs very well in. We've also won market share in those sectors over the last two years.\n\nAnd then, therefore, as those two sectors are on their natural recovery curve. That's a tailwind for Sysco because of the market share that we have won over the last two and a half years in those sectors. And then education and the healthcare sector. We've also won market share in those two sectors as well.\n\nAnd those are two very recession-proof sectors for Sysco. So we're pleased with our national sales team. They've done an excellent job of winning new business over the last couple of years, profitably. And in several sectors, you called out 2 of them, Alex.\n\nWe see tailwinds in this coming year, and that was built into and factored into our guide today.\n\nAaron Alt -- Chief Financial Officer\n\nMaybe one final thought point, which is given the number of different opportunities we have across our diverse portfolio, I just want to emphasize that the low end of our range is still the highest EPS at Sysco ever.\n\nAlex Slagle -- Jefferies -- Analyst\n\nAppreciate that. And then just on SYGMA and the opportunity to drive a recovery in the operating profit there, it looks like you're looking for improvements in '23. Could you talk about the actions taken and how much recovery you see coming in '23? Or does this take a couple of years to get back to historical profitability levels?\n\nKevin Hourican -- President and Chief Executive Officer\n\nSo this is Kevin. I'll start just kind of what's happening with SYGMA and then I'll toss to Aaron to answer your question about the numbers in whatever manner he would like. So just a reminder for those that are new covering our company -- just a little bit about our SYGMA business. It's very different.\n\nIt's very unique in relation to everything else we do. It is a cost-per-case business on a multiyear contract basis. So let's just be honest and clear. It was a very difficult year for SYGMA as fuel costs rose significantly, as labor costs because of retention challenges, and productivity challenges tied to that rose significantly.\n\nSYGMA got pinched and pinched hard on rising expenses, essentially the inability to pass through rising costs because of the way that business is run on a fee-per-case basis, challenging year. Last point is it's a stretch miles business, where the route distances are substantially longer than what I call the pedal runs or broadline where we started in D.C., do a little run come back home. SYGMA is long-distance driving in what we call stretch miles. So the rising cost of fuel was a real particular pain point.\n\nIf I look at this upcoming year, I'll just give color commentary on where we have confidence the improvement will come from, and then I'll toss to Aaron. The higher turnover and the negative impact of that higher turnover had on our productivity and overtime rates that we were incurring because of the open jobs was a major pain point, and that is meaningfully addressable through the work that we're doing with hiring stability, which is meaningfully improving. Training effectiveness, which I've already spoken to on this call, and our ability to reduce over time, reduce the use of third-party labor and just frankly, run the model more efficiently. So we can get back to more historical standards of cost to serve and improve the profitability of SYGMA, and that is our intention this year.\n\nAaron, I'll toss to you for additional comment.\n\nAaron Alt -- Chief Financial Officer\n\nJust two quick thoughts. First is we're assuming continued progress on profitability for SYGMA within our guidance, although we don't separately guide by segment in that way. And then just to repeat the observation I made in previous quarters that our expense recovery or some of our expense recovery within the SYGMA segment actually trails. And so we'll have an expensive one quarter and we'll pick it we'll cover at the following quarter, and that's part of what's going on.\n\nAlex Slagle -- Jefferies -- Analyst\n\nHelpful. Thank you.\n\nKevin Hourican -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from Jeffrey Bernstein of Barclays. Please go ahead.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nGreat. Thank you very much. Two questions. The first one, just a follow-up.\n\nKevin, I know the topic earlier was brought up about the broader restaurant industry, whether it be chains versus independents or QSR versus casual dining. Was there a message to be that you're really not seeing a change in trend between the different segments? I know you service all restaurants. So seemingly, you'd be pretty well insulated if that was trade more likely to trade down. But just trying to understand what you're seeing across the restaurant industry over the past few months or whether perhaps you're not seeing any change at all? And then I had a follow-up.\n\nKevin Hourican -- President and Chief Executive Officer\n\nYes, Jeff. We prefer not to get into the too detailed color on individual names. Of course, that's not our place. They report their own results.\n\nWhat we are commenting is that within each of our sectors, from white table cost all the way down to QSR, we see winners and losers within each of those sectors. And I think you see that in the coverage that you do across that sector. There are winners and there are losers within each segment. We are not seeing meaningful shift from the top end of the spectrum to QSR are within the sectors.\n\nWhat we are seeing, point number two, for some additional color is that customers within each of the sectors wanting to partner with Sysco to provide value to their customers to help offset the cost of inflation. So because of that would be Sysco brand penetration is increasing, which is a good thing for us. and we will be sticky on that. I want to be clear about that.\n\nWhen we make progress in Sysco brand, when customers give it a try and we do product quality cuttings, they love the product quality. They obviously enjoy the savings from a cost perspective and then we can be very sticky in that regard. So that's a key point. And then I think you've heard from some of the manufacturers, some shift from the beef category into poultry that was publicly communicated yesterday.\n\nAnd I would say, yes, beef has been highly inflationary. It was the most inflationary category over the last couple of years and customers of ours are looking at portion size. They're looking at alternative protein options. And that's what our sales results -- excuse me, sales consultants do.\n\nThey help our customers with that. The good news on the protein side specific to beef, beef prices have normalized, and I know you're aware of that as well. So the overall rate of inflation in beef has stabilized meaningfully and we do expect for inflation in aggregate to moderate this coming year as Aaron has called out in our guidance.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nGot it. And then the follow-up, you mentioned the cost outs I know you're already above the $750 million target and you're going for more. Are there big buckets of opportunity that maybe you haven't touched before? Or is it primarily areas you've already hit, but there just -- is incremental opportunity there. Just try to figure out whether there's totally new channels that you're pursuing or just more of the existing.\n\nAaron Alt -- Chief Financial Officer\n\nI would say there's opportunity everywhere we look, whether it's new opportunity or indeed scaling opportunities we've already identified, whether it's indirect purchase or whether it's the structure we deploy, how we resource particular parts of the business. And while it's not part of our cost out per se, I want to emphasize the point that we have further opportunity to optimize our cost of goods serve as well. It's outside of the -- what I call cost out going forward. But there is goodness in the portfolio that we're going to use to help offset cost increases in the short term relative to our investments.\n\nKevin Hourican -- President and Chief Executive Officer\n\nAnd this is Kevin. I'll just add one example, which is our omnichannel project, which I talked about briefly on today's call, I haven't really mentioned it too much in prior calls. The technology for the distributed order management system goes live this quarter and what it will enable us to do is decouple the front-end sales from the back-end operations. And by doing that, we can ensure that we decrease miles driven, meaning serve the customer from the closest possible warehouse.\n\nThat sounds basic and obvious, but it is a meaningful unlock technologically, but it also is going to help us with our strategic stocking of product, what product is where. Think about slow-moving SKUs and fewer warehouses that then get cross-docked through the last mile delivery location and really being strategic and optimized of increasing the ability of our inventory but actually doing it with overall over time, less inventory, less working capital. Those are examples of that project, which is multiyear in its build, creating cost structure take out into the future. And again, built into our guide for this coming year, but that project, in particular, is one that we're excited about.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nGot it. And just Aaron, to clarify or I guess, to level set for everyone on the call, I think you mentioned -- we understand the full year earnings guidance, but you said the fiscal first quarter earnings guidance would be at levels similar to the first quarter of fiscal '20. So is that the $0.98 if I'm getting that right, that you're thinking the first quarter will be in that $0.98 range?\n\nAaron Alt -- Chief Financial Officer\n\nI said we'd be at or near that $0.98, yes. Just given the transformation investments and the productivity we're working through.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nUnderstood. Thank you.\n\nKevin Hourican -- President and Chief Executive Officer\n\nThank you, Jeff.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Kim -- Vice President, Investor Relations\n\nKevin Hourican -- President and Chief Executive Officer\n\nAaron Alt -- Chief Financial Officer\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nMark Carden -- UBS -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nAlex Slagle -- Jefferies -- Analyst\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nMore SYY analysis\n\nAll earnings call transcripts"
}