{
  "companyName": "The Honest Company, Inc.",
  "companyTicker": "HNST",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/13/the-honest-company-inc-hnst-q2-2022-earnings-call/",
  "content": "The Honest Company, Inc. (HNST -0.66%)\nQ2 2022 Earnings Call\nAug 12, 2022, 12:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to The Honest Company's second quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to Mr. Steve Austenfeld, vice president, investor relations at The Honest Company.\n\nPlease go ahead, sir.\n\nSteve Austenfeld -- Vice President, Investor Relations\n\nGood morning, everyone. Thank you for joining our second quarter 2022 conference call. Joining me today are Nick Vlahos, chief executive officer, and Kelly Kennedy, our chief financial officer. Before we start, I'd like to remind you that we will make certain statements today that are forward-looking within the meaning of the federal securities laws, including statements about the outlook of our business and other matters referenced in our earnings release issued today.\n\nThese forward-looking statements involve a number of risks and uncertainties that could cause actual results to differ materially. Please refer to our earnings release issued today as well as our SEC filings for a more detailed description of the risk factors that may affect our results. Please also note that these forward-looking statements reflect our opinions only as of the date of this call, and we undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements in light of new information or future events, except as required by law. Also, during this call, we will discuss non-GAAP financial measures, which adjust our GAAP results to eliminate the impact of certain items.\n\nYou will find additional information regarding these non-GAAP financial measures and a reconciliation of these non-GAAP to GAAP measures in the financial results section of today's earnings release. A live broadcast of this call is also available on the investor relations section of our website at investors.honest.com. With that, I'll turn the call over to Nick.\n\nNick Vlahos -- Chief Executive Officer\n\nThanks, Steve. Good morning, everyone, and thanks for joining us today. As noted in today's earnings release, we delivered strong top line growth, up 5% in the quarter versus a year ago, in line with our expectations. We saw positive growth across both our digital and retail channels as we continue to expand our omnichannel presence.\n\nConsistent with our prior guidance, as we look to the second half of the year, we anticipate delivering mid-single-digit revenue growth as we will see the full benefit of 2 rounds of price increases taken in the first half, combined with the impact of product innovation and expanded retail distribution. Based on consumption trends in the quarter, I feel confident that the Honest brand continues to resonate with the conscious consumer. Looking at 12-week tracked channel data ending June 12, Honest continues to gain market share as our growth continues to outpace the category. Second, our unit velocities remain healthy, following recent pricing.\n\nAs we see solid growth in both volume and sales, this indicates the brand has pricing power even in this challenging economic environment. The overall category growth for diapers and wipes was 9% and 10%, respectively, coming almost exclusively from pricing. Honest diapers grew 12% and wipes 20%, respectively, predominantly from volume. The overall personal care category declined, while Honest grew 15%.\n\nIn the highly competitive categories in which we compete, Honest growth outpaced the category, in some cases, quite significantly. And the growth was of high quality, balance between volume and pricing. As we execute against our key growth strategies, I wanted to provide an update on progress to date, starting with marketing, which is the lever we pull to drive brand awareness, trial and share of wallet. We continue to invest at a high level in support of our brand with marketing spend at approximately 15% of sales in the second quarter.\n\nRecognizing the rising cost of digital marketing, which we touched on last quarter as well as our meaningful retail expansion in the second half of the year, we are shifting a portion of our marketing investment from digital to shopper marketing to drive awareness and support retail distribution. A great example is our quarterly beauty edit with a key strategic partner, Target, which recently had a co-marketing campaign with our founder on a segment titled Spring Clean Your Beauty Bag with Jessica Alba, which highlighted 9 of our best-selling Clean Beauty products. This shopper marketing investment is driving awareness and consumption as demonstrated by 13% consumption growth in beauty at this customer. For our total Honest business at Target, we delivered our 70th consecutive week of positive year-over-year sales growth.\n\nTurning to innovation. Our initiatives are on track. So far this year, we launched our new Fresh Flex Concealer at a variety of retailers, our new acne skin clearing line exclusively at Ulta and Honest.com and expanded our wellness supplements line with a launch at GNC. In the back half, we're on track to deliver additional beauty, diaper and personal care innovation, both online and with strategic partners.\n\nOn the distribution side, we are well underway on our retail expansion plan. Specifically, you can now find Honest products at Walmart.com, over 630 Ulta stores and roughly 1,400 GNC stores nationwide. The Ulta expansion solidifies our position in Clean Beauty with the largest beauty retailer in the U.S. Our new supplements line focuses on wellness-oriented sleep, stress, immunity and hair health, all of which are now available in store and online at GNC and at Honest.com.\n\nNew this quarter, we're announcing distribution with Publix, a strategic grocery retailer in the Southeast, and BJ's, a club retailer with a strong presence on the East Coast. As a result of these distribution wins, we achieved a brand ACV of over 50% for the first time in the company's history, which demonstrates the strength of the Honest brand proposition. We expect further ACV expansion with the upcoming distribution launch into Walmart stores. In July, we launched on Walmart.com.\n\nAnd in Q4, we will be expanding into over 2,000 Walmart stores across the country. This will include an assortment of Honest diapers, wipes and personal care items. As we continue to grow market share, the opportunity with Walmart to expand Honest penetration into the South and Southeast regions as well as across the country will make Honest products more accessible as we reach consumers with the leading diaper retailer in the U.S. On the international side, we're expanding our skin and personal care business with the largest beauty retailer in Canada, Shoppers Drug Mart.\n\nThis past week, we launched Honest beauty products in China through our partnership with SuperOrdinary with a flagship store on Tmall. We are pleased to be partnering with SuperOrdinary, who has a proven track record of launching premier U.S. beauty brands in Asia. This new partnership will set the foundation for future global expansion.\n\nWe also remain focused on driving growth in a responsible manner. Honest was founded nearly 10 years ago with ESG principles at heart, and we remain committed to diversity and inclusion, environmental sustainability of our products and strong governance practices. We plan to publish a summary on the progress of our ESG program in early 2023. Overall, we continue to focus on executing against our key growth initiatives in marketing, innovation and distribution that will drive growth for the remainder of 2022 and beyond.\n\nAs we continue to see positive top line trends and reaffirm our full year revenue outlook, we need to recognize the headwinds we face in today's input cost and inflationary environment. We've continued to experience rising costs across the supply chain and expect these pressures to continue across the balance of 2022. This cost inflation is putting additional downward pressure on gross margin, requiring us to update our outlook for the year. In response, we plan to take additional pricing, execute incremental cost savings and focus on key initiatives to improve margins.\n\nI feel confident in our ability to sequentially improve our margins as we continue to execute these plans. In closing, the Honest brand remains strong, delivering on its commitment to the clean and natural consumer. We've significantly grown our brand awareness and household penetration over the last 2 years while our market share continues to increase. We maintain our conviction that Honest could be the new modern CPG brand while driving our mission to inspire everyone to love living consciously.\n\nNow, I will turn it over to our CFO, Kelly Kennedy.\n\nKelly Kennedy -- Chief Financial Officer\n\nThank you, Nick, and welcome, everyone. I'll start by saying I'm very pleased with our strong top line performance in the quarter as well as our ability to reiterate our revenue outlook for the year, which reflects mid-single-digit growth in the second half. Input costs have accelerated further, leading us to update our gross margin and adjusted EBITDA outlook. But we believe through pricing and other cost saving measures, we'll be able to offset these headwinds over time.\n\nNow, turning to the financials. Revenue increased 5% to $78 million for the second quarter of 2022 compared to the second quarter of 2021. Growth was broad-based across both digital and retail channels, although we did see stronger-than-anticipated growth in the digital channel this quarter due to strong shipments ahead of Prime Day. Diving into key drivers by product categories.\n\nFirst, diapers wipes. Our diapers and wipes business, representing over 65% of the portfolio, was up 9% as we continue to see acceleration after the 2021 launch of our Clean Conscious Diaper and benefit from improved inventory levels on wipes. Both diapers and wipes grew consumption at double-digit rates in the quarter, outpacing category growth. Skin and personal care, representing over 30% of total revenue, declined 2%.\n\nThe decline was driven by 2 things. First, we had a timing shift on our shampoo and body wash shipments ahead of our annual promotion at a key club retailer. We were also negatively impacted by a key item out-of-stock, which were most pronounced in the beauty business. Excluding these impacts, the skin and personal care business would have grown double digits.\n\nWe were particularly pleased that both our personal care and beauty business, color and skin, outpaced category growth. Our Household and Wellness business, although a small part of the portfolio, had a rebound in the second quarter, up 15%, due in part to strong sales of our sanitizing wipes and the expansion of our wellness supplements line. Growth in this category was also driven by increased royalty sales on our Honest baby clothing line, which has seen strong demand in the marketplace. Now, turning to results by channel.\n\nOur revenue was balanced between channels, with digital at 48% of sales and retail 52% of sales in the quarter. Digital saw a rebound of growth this quarter, up 9%, behind stronger performance in orders ahead of Prime Day as compared to last year. As a reminder, at times, we've experienced our key digital partner optimizing their weeks of supply, which can result in shipments outpacing or underpacing demand, and our revenue can shift from 1 quarter to the next despite positive consumption trends. Separately, we are actively investing in our digital platform, which has driven improved site speed at Honest.com, enables frictionless ordering and provided customers more options and customization for subscription.\n\nThese investments will support our digital business in 2023 and beyond. In the near term, however, we expect headwinds in our digital business as we face the continued rising cost of paid advertising and the industrywide shift of consumers back into stores. Retail revenue increased 2%, reflecting consumption growth across our key customers. Revenue growth this quarter reflects the shift in timing of shipments for a promotional event for a key club customer that negatively impacted overall revenue growth in the channel by 5%.\n\nWith sales nearly equally split across digital and retail, we continue to believe our omnichannel model is a competitive advantage, especially given volatility in consumer shopping behavior. Given our balanced digital and retail business and upcoming distribution expansion, we are well positioned to support the consumer wherever they choose to shop. Now, turning to gross margin. Gross margin was 30% in the second quarter of 2022 compared to 36% in the second quarter of 2021.\n\nThis reflects approximately 875 basis points of additional costs versus the prior year, offset by roughly 275 basis points from pricing and other actions taken to date to offset the impact. The biggest impact came from higher product costs, including inbound freight, which increased approximately 500 basis points versus a year ago. In the second quarter, we saw an acceleration in input cost deflation above our original forecast, particularly as we strove to get back in stock and build up our inventory position on baby wipes and key components in our beauty business that face longer lead times and supply challenges. In addition, fulfillment costs increased approximately 150 basis points versus a year ago.\n\nWe now expect these input cost headwinds, product costs, inbound freight and labor rates to remain elevated versus our prior forecast. In order to support new retail distribution and offset headwinds in digital due to declining traffic and higher marketing costs, we invested at a higher trade promotion rate to drive sales in store. This had roughly a 225 basis point impact to gross margin versus last year. To offset input cost inflation, we've executed mid- to high single-digit price increases across approximately two-thirds of the portfolio in the first half.\n\nPricing and cost savings benefited second quarter margins by approximately 275 basis points. Since our second pricing action just went into a place in early June of this year, the full benefit of those price increases will impact the second half of the year. So far, we've been very pleased with the execution at retail as our price gaps versus conventional products remain in line. As Nick noted, we continued to grow both volume and sales.\n\nGiven the favorable elasticity impact so far, competitive actions we're seeing in the market and the continuing inflationary environment, we plan to take additional pricing that will benefit 2023. We're also being as aggressive as possible to drive cost savings. For example, in Q2, we consolidated distribution centers on the West Coast, which provides savings of roughly $2 million annually. We're also optimizing our operating expenses, prioritizing areas with higher return, reducing discretionary spend and looking to offset some of the cost headwinds with SG&A savings.\n\nTurning to operating costs and profitability. As anticipated, operating expenses were down materially, primarily due to year ago costs associated with our IPO. As we move into Q3, we've now caught this onetime cost, and going forward, will be a light comparison. Of note this quarter, marketing expense was at 15% of sales, in line with our planned support for the Honest brand and reflected a higher level of retail marketing support versus a year ago.\n\nAdjusted EBITDA for the second quarter of 2022 was negative $5 million, which reflects a $5 million improvement versus the first quarter of 2022. We ended the second quarter with $67 million in cash, cash equivalents and short-term investments with no debt. The cash balance reflects an increase in our inventory position due to longer supply chain lead times and in anticipation of the new distribution gains coming in the back half. Turning to our fiscal year 2022 outlook.\n\nAs Nick highlighted, we are reaffirming our full year revenue outlook, reflecting mid-single-digit growth in the back half of the year with high single-digit growth in the fourth quarter as we roll out new store retail distribution. From a channel standpoint, we anticipate the consumer shift to retail to continue in testing our digital business, offset by acceleration in our retail business. Recognizing the current cost pressure, we expect gross margins for the second half of the year to be in the range of 31% to 32% versus 33% a year ago. This reflects approximately 700 basis points of additional cost versus the prior year, offset by roughly 550 basis points in actions taken to date to offset the impact.\n\nThe 700 basis points includes 550 basis points of higher input costs, 50 basis points of higher fulfillment costs, and 100 basis points of higher trade spend to support new retail distribution. Pricing will benefit the second half approximately 375 basis points, and cost savings mix and other items are expected to provide about 175 basis points of benefit. We expect the gross margin headwind to be partially offset by optimization of operating expenses. Taking these factors into account, adjusted EBITDA is now expected to be in the range of negative $10 million to negative $20 million, with sequential improvement over the back half achieving positive adjusted EBITDA for the fourth quarter.\n\nThe fourth quarter will benefit from the highest revenue in the year, additional pricing actions, reductions in low-return marketing and prudent management of SG&A. Overall, I'm pleased with the momentum on the business as we expand our omnichannel footprint and make Honest products more accessible to consumers in the U.S. and abroad. With that, I'll turn the call over to the operator.\n\nWe look forward to answering any questions.\n\nOperator\n\n[Operator instructions] And our first question comes from the line of Dana Telsey with Telsey Advisory Group.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood afternoon, everyone. As you unpack these fulfillment costs and the price increases, along with the positive reception with expanded distribution, what -- how are you envisioning fulfillment costs and price increases going forward? And with the mid-single to high single-digit price increases that have been taken already, what percentage of the portfolio gets additional price increases and by what range? And how do you envision fulfillment costs? And lastly, with digital and retail, with the expanded distribution, what do you see as the penetration rates that you're ultimately looking at with the Publix announcement that just happened, how do you see that scaling?\n\nKelly Kennedy -- Chief Financial Officer\n\nDana, this is Kelly. I'll start first with your question about what we see in the input cost environment. And I think you heard us mention that the biggest headwind that we are seeing are in the inbound costs with ocean and trucking as well as within labor rates in our fulfillment center. And so, we did kind of outline the outlook for the balance of the year.\n\nWe anticipate that the current rates, which are kind of at historic highs, we are assuming that those will continue through the balance of the year. So that's really when you think about the change in the margin and the headwind now forecast to be 31% to 32% in the back half, that's really reflecting about 700 basis points predominantly from input costs, some from fulfillment and then some additional spend as we look at supporting the new distribution with trade. We will offset that. We mentioned that pricing is the biggest component to offset those headwinds at 375 basis points, but we also will be benefiting from cost savings, sub mix and certainly just other cost impacts to the tune of about 175 basis points.\n\nSo headwinds, we're seeing about, on a year-over-year basis, roughly 200 basis points of additional pressure versus where we were a year ago.\n\nNick Vlahos -- Chief Executive Officer\n\nDana, it's Nick. I can take the second question as it pertains to kind of the distribution and how this all plays out for us. What we're really -- we feel really good about is we've always had this opportunity kind of within that Southeast corridor to really make Honest more accessible to consumers in that area. And what's really important there is in the Southeast region, about 42% of all new births happen in the Southeast.\n\nSo having this Walmart partnership as well as Publix, obviously, gives us that accessibility to consumers, both in the digital and in retail store standpoint in that area. So if you look at that 2,000-plus kind of Walmart store piece that we have announced around distribution, roughly half those stores, around approximately 1,000 of those are in the Southeast and the rest are across the country. So that gives you context. And then, concerning Publix.\n\nDisproportionate amount of the business will be focused on personal care there initially, so it will be against our skin and personal care business. Then we'll be giving greater detail on this next quarter around kind of what that footprint -- what that mix is going to look like, but that gives us really an opportunity to kind of build out the overall distribution in that Southeast. We currently see about 50% ACV, so there's still a lot of opportunity for us across the country as we drive this accessibility strategy.\n\nKelly Kennedy -- Chief Financial Officer\n\nAnd I think you had a last question on pricing, Dana. You'll recall that our January price increase was on about one-third of our portfolio. It was primarily diapers. The second price increase that we took was not on the same products.\n\nIt was on wipes and personal care. And so, as we think about taking pricing out of -- roughly two-thirds additional pricing action, we still have about one-third of our portfolio that we have not taken pricing on. In addition, unlike competition, we've come back and taken the expected price increase on the same product, and that is something that we've chosen not to do. But we do think we have some ability kind of as we look into later in the year to 2023, we still feel when we look at elasticities or what the impact is and the fact that we continue to be able to outpace category growth and a nice balance between price and volume, we feel really confident kind of our pricing action ability and that the timing was right to kind of be a follower behind everyone else's pricing.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of Laura Champine with Loop Capital.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nThanks for taking my question. In Q4, what -- can you be more specific about the sales benefit that you would expect from the initial shelf stocking at Walmart?\n\nKelly Kennedy -- Chief Financial Officer\n\nYes. When we talk about and think about top line revenue for the back half, I think it's pretty important to point out that we're talking about sequential improvement from where we are in Q2 to Q3, but being much more heavily weighted in terms of where we're going to see the new distribution shift in Q4. So the way to think about the mid-single-digit growth that we've given for our outlook for the second half basically, it's high single digits in Q4 and predominantly focused on growth in Q4 versus Q3. And one highlight I'll just mention is last year, Q2 was our largest quarter.\n\nSo we had some big shipments coming -- going out, particularly around the rotational program in personal care. And so, when we think this year, Q4 will be our largest revenue quarter. When you think about the new distribution in Walmart, but also continued consumption trends, which we're seeing extremely good consumption trends, particularly in volume and balance with price with growth in babies up in the quarter 12% and really strong trends as well within beauty, skin and color with double-digit growth kind of across mass, Amazon, RDTC. We do anticipate continued kind of consumption trends balanced between pricing volume in the back half.\n\nNick Vlahos -- Chief Executive Officer\n\nAnd the only thing that I would add, Laura, just a kind of finer point on it is, as you look at Q3 and then you look at Q4, as we talk about mid-single-digit growth, one thing that existed in Q3 a year ago was our largest quarter. We also had a significant program at a club customer, which really was roughly about $6 million of revenue that will not be repeated. So that has about a mid-single-digit impact in Q3. But you'll see Q4 really kind of high single digit, as Kelly referenced, from a growth perspective as we start to see some of the pipe come in from a Walmart perspective as well as the new distribution.\n\nBut relative to consumption, we continue to see kind of the trends. This is the latest IRI data through July 10. And we continue to see the trends in diapers, wipes as well as personal care. Our growth kind of outweigh the category growth across those businesses.\n\nSo to give you some context around the balance between shipments as well as consumption.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nRight. As I'm trying to get a better sense of what's happening with volumes and move back up a little bit, half of the year is over, you're expecting revenues to be flat. What's the expected change for the full year in volumes?\n\nKelly Kennedy -- Chief Financial Officer\n\nYes. And in Q2 specifically, if you break down our 5% growth, it was roughly half from pricing and half from volume. So we would expect in the second half as we move into that to be relatively consistently balanced between pricing and volume.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nThank you.And our next question comes from the line of Steph Wissink with Jefferies.\n\nSteph Wissink -- Jefferies -- Analyst\n\nThank you. We have a follow-up question on Walmart and Publix. If you could share a little bit about the merchandise strategy. I think, Nick, you mentioned diapers and wipes, maybe even a little bit of personal care into Walmart and then more personal care focused at Publix.\n\nAre those curated assortments, special makeup items? Or did they come from your existing line and just more of a curated selective assortment?\n\nNick Vlahos -- Chief Executive Officer\n\nExcellent question, Steph. No. 1, when it pertains to at least to Walmart, we're making sure that we've got an offering that makes sense for that Walmart consumer across the country. So diapers, you're going to see us have different counts within that to offer more value to the Walmart consumer.\n\nYou're going to also see larger count size across the wipes business, again, additional value on a price per item basis when it comes to price per diaper, price to like -- and then the third is on personal care and skin, you'll see a curated collection of skin care products that are going to be unique to Walmart again. So that's going to be the offering. So it's going to be holistic as it pertains to diapers, wipes as well as in personal care. And then, as it pertains to Publix, and we'll give more context at the next call, it'll be a subset of our personal care items that are going to be stock within Publix as we kind of enter that Southeast corridor from a personal care and skin standpoint.\n\nSo that gives you some context on both of those.\n\nSteph Wissink -- Jefferies -- Analyst\n\nOK. That's great. And Kelly, just really quickly to help us bridge the adjusted EBITDA step function from Q3 to Q4. If you could help us think how much of that is related to the high single-digit revenue growth in the Q4 and the leverage versus something else within the body of the P&L that might be improving to get you to that positive EBITDA inflection in the fourth quarter.\n\nKelly Kennedy -- Chief Financial Officer\n\nThank you, Steph. Yes. The inflection point, I would point to 3 impacts. The first is revenue as we ship additional distribution.\n\nWe will, of course, benefit from that, having the highest revenue in the fourth quarter. So that's the first impact. The second is we mentioned sequential improvement, not just in revenue between Q3 and Q4, but also margin. And part of that is pricing.\n\nWe talked about additional pricing actions we're taking as well as cost savings. So we'll get some additional benefit in Q4 versus Q3. And the last thing I'll highlight, which you probably have noted from last year as we think about how we spend our marketing in Q4. Unlike other retailers and kind of brands that are very seasonal in nature, we're not -- we tend to see a little bit of a shift up in the overall cost of media.\n\nWe really focus our marketing on shopper marketing, and we tend to kind of temper our spend. We see that shopper marketing for us is much more efficient. So generally, as you think about marketing, it tends to be our marketing percentage in particular tends to be better in Q4 than it would be in Q3 and often on a dollars basis. It tends to be a lower quarter for us in terms of marketing spend.\n\nI think what's really important is that all 3 of these benefits together will shift us and be able to take us into this positive adjusted EBITDA territory, which we're pretty excited about.\n\nSteph Wissink -- Jefferies -- Analyst\n\nThank you. That's very clear. Much appreciated.\n\nOperator\n\nThank you. And our next question comes from the line of Andrea Teixeira with J.P. Morgan.\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nThank you, operator. Good morning there. I just want to go back to the channel and marketing and merchandising, shopper marketing commentary you gave, vis-a-vis the digital spend reduction you called out in your prepared remarks. So a question to Nick and then a question to Kelly.\n\nSo start with Nick more broadly on the strategy there. So the comment on the volatility for digital sales, and of course, I understand you're getting into Walmart and several other more in-store level customer. So wondering what's happening with your key dot-com partner. And you highlighted that the shipments to them may be a bit volatile, and consumption may diverge even more.\n\nSo is that a function of your Walmart.com move? Or is that them kind of reducing inventory or seeing that it's basically a similar overlap kind of consumer that is switching from Prime into Walmart.com? And then I'll have a question to Kelly.\n\nKelly Kennedy -- Chief Financial Officer\n\nYes. I'll start just by talking -- reminding you that in the quarter a year ago, we did have this disconnect between -- at this key digital partner between shipments and the consumption that we saw. And that was predominantly around them reducing weeks of supply ahead of their big national events. This year, we actually saw consumption in shipped, and that was predominantly around them reducing weeks of supply ahead of their big national event.\n\nThis year, we actually saw consumption and shipments in line. And so, we didn't have that impact this year. As we think about kind of results coming out of that big national event, we were highlighted as one of the brands that was really driving and featured within their growth and their -- kind of their amazing results for that event, which we are pretty excited about. And as we think about just our performance add back that retail around consumption, I know it's a little masked between personal care and beauty, but we're pretty excited about the consumption trends that we're seeing in beauty right now.\n\nFor example, Nick highlighted the quarterly beauty edit, which is really the surround sound around shopper marketing that we do and are able to do with our largest kind of customer and our largest partner around Clean Beauty. And we did see, in addition to kind of having the 70th consecutive week, positive year-over-year growth within beauty at Target, we had 13% growth and we had 25% growth on Amazon. And Honest.com was also double digits. So we're seeing really -- in addition to just outpacing the category, both in skin and color, we're seeing really good traction overall, which we're excited as we layer in Ulta and being in over 600 stores and one of the premier retailers in the country, Clean Beauty with the launch of the acne line.\n\nI think as we think and invest behind retail and shopper marketing, we're seeing good results. We're able to measure it. And as we mentioned for that shift, we'll -- as we go into new retailers such as Walmart, we'll continue to make investments there. And we are seeing them more efficient than some of our digital spend at this time at -- across the retailers.\n\nNick Vlahos -- Chief Executive Officer\n\nYes. And the way I would think of it, Andrea, just to give some additional context on this is if you think of Target.com in the retail stores, you think of Ulta.com in the retail stores, Walmart.com, retail, we're driving content, leveraging their digital footprint, No. 1. So that's when we say shopper marketing, that's where you're gaining the eyeballs, the awareness.\n\nAnd then, we're fulfilling also within the store. When you look at -- you go to the shelf, the off-shelf display leveraging our shopper marketing investment, to really get the surround sound going around kind of the desire within the marketplace to drive the attraction via digital all the way through to the point of the side, whether it's the digital shelf or the physical shelf in store. And that's the commentary around things like the beauty edit that we did at Target to the other programs. So you're going to see more of that as we go into the back half because you're seeing in the marketplace the investment right now when it comes to marketing kind of from a traditional perspective in digital is really from an increased perspective and reach.\n\nEnclosure is really continuing to go up, and we're seeing more efficiency and effectiveness, leveraging the shopper marketing component of this. And it plays well with the added distribution that we're now building upon as we go into Q3, Q4 and then really the impact when you start looking at next year.\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nSo that's helpful. So just to kind of, like, go back to the beauty reset, and I appreciate, Kelly, you clarified that -- the commentary about that key digital customer is on the base period, right? So we're going back to the numbers you gave for the beauty -- sort of the Clean Beauty numbers, I think your site Target up 13% and then 25% at Amazon.com. Is that also going to be reflected? And that type of inventory, that type of initiative that you had with the beauty edit, is that something you're looking to do as well as at Ulta? Or are they sort of similar? In other words, like the same kind of success you're hoping to achieve in the other channels.\n\nKelly Kennedy -- Chief Financial Officer\n\nAbsolutely. We're launching, of course, with the acne line who is focused on skin at Ulta. But absolutely, one of the things we're excited about, too, as we go into the back half is we have been challenged like everyone else's supply chain. That's been a drag on both the personal care and the beauty business as we're out of stock on some key items.\n\nAnd we are getting back in inventory in Q3 on the majority of those items. So that will certainly help. We've also seen some of our key retailers struggle with labor and getting the labor in the store to reset the shelf. So we haven't have the best execution.\n\nSo kind of as that labor market softens, and we don't see that half of the year, we feel like we'll be better positioned with our personal care and beauty. But we -- what we've done at both Target and Amazon, as it relates to both SKU count and breadth of SKUs and power on the shelves as well as with the support that Nick mentioned in shopper marketing, in particular, we plan to replicate as well as the retail distribution comes on board.\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nAnd all that that was my second question on the numbers on the promo spend in the second half. I think the puts and takes, correct me if I'm wrong, you had a lot of promo spend. And I understand part of it is above the line, so it's part of the impact that you had in the reduction in the gross margin. But I was wondering what happens below the line, so in other words, in the SG&A line, as you shift more from digital into merchandising and store promo?\n\nKelly Kennedy -- Chief Financial Officer\n\nYes. I think in Q2, when you think below the line, marketing spend for the back half is going to be kind of in the range that we've highlighted kind of in that mid-teen. And the way we think about R&D and certainly SG&A, we continue to take a very cautious approach. Overall, we've always had caution as it relates to headcount and growth, but we feel we have the right kind of level of SG&A support and team to support what are some really ambitious growth initiatives as we go into 2023.\n\nWe think of R&D and SG&A on a dollar basis, and they're relatively flat. So certainly, as the top line comes on, we can really leverage overall our SG&A. But we did highlight that we are going to offset a small portion of the headwinds that we're seeing in margin with some SG&A savings. And those are predominantly around things where we are -- that are in support of growth, things that we can just be more cautious in terms of how quickly we ramp up and grow our internal kind of team here as well as our overall expenses.\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. And I'm showing no further questions at this time. So with that, I'll hand the call back over to CEO, Nick Vlahos, for any closing remarks.\n\nNick Vlahos -- Chief Executive Officer\n\nGreat. Well, thanks, everybody, for participating. As you've heard, we have a lot of conviction as it pertains to the plan that we've put into place as we embark on kind of the second half of the year. On behalf of the team, I want to thank you for your participation today.\n\nAnd we look forward to sharing our progress with you on our next quarterly earnings call. Take care, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Austenfeld -- Vice President, Investor Relations\n\nNick Vlahos -- Chief Executive Officer\n\nKelly Kennedy -- Chief Financial Officer\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nSteph Wissink -- Jefferies -- Analyst\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nMore HNST analysis\n\nAll earnings call transcripts"
}