{
  "companyName": "The Wendy's Company",
  "companyTicker": "WEN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/the-wendys-company-wen-q3-2022-earnings-call-trans/",
  "content": "The Wendy's Company (WEN -0.66%)\nQ3 2022 Earnings Call\nNov 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. Welcome to The Wendy's Company earnings results conference call. [Operator instructions] Thank you. Kelsey Freed, director of investor relations, you may begin your conference.\n\nKelsey Freed -- Director, Investor Relations\n\nThank you, and good morning, everyone. Today's conference call and webcast includes a PowerPoint presentation, which is available on our investor relations website, irwendys.com. Before we begin, please take note of the safe harbor statement that appears at the end of our earnings release. This disclosure reminds investors that certain information we may discuss today is forward-looking.\n\nVarious factors could affect our results and cause those results to differ materially from the projections set forth in our forward-looking statements. Also, some of today's comments will reference non-GAAP financial measures. Investors should refer to our reconciliations of non-GAAP financial measures to the most directly comparable GAAP measure at the end of this presentation or in our earnings release. On our conference call today, our president and chief executive officer, Todd Penegor, will give a business update; and our chief financial officer, Gunther Plosch, will review our 2022 third quarter results and provide an update on our outlook for the year.\n\nFrom there, we will open up the line for questions. With that, I will hand things over to Todd.\n\nTodd Penegor -- President and Chief Executive Officer\n\nThanks, Kelsey, and good morning, everyone. I am proud of the Wendy's system for delivering a significant same-restaurant sales acceleration on a one-year basis. Our consistent sales growth underscores our brand's ability to resonate with our customers and resulted in our fourth consecutive quarter of double-digit global same-restaurant sales on a two-year basis. These results highlight how our high-quality food compelling value and convenience continue to deliver against their fans expectations, making the Wendy's brand more relevant than ever.\n\nDuring the third quarter, our dollar and traffic growth ranked among the top performers in our competitive set, and we maintained our total day dollar and traffic share of the QSR burger category in the U.S. On the breakfast front, we launched French Toast Sticks, our first major menu innovation in the U.S. which drove a meaningful acceleration in the U.S. breakfast sales over the course of the quarter.\n\nWe have received an overwhelmingly positive reception from our customers, proving just how much growth is ahead of us at the breakfast daypart. Our digital business momentum held strong as we delivered global digital sales mix of approximately 10%, and we expect to grow this even further with a heightened focus on digital and delivery marketing to close out the year. We remain fully committed to driving the restaurant economic model through our three long-term growth initiatives: to build our breakfast daypart, accelerate our digital business and expand our global footprint. We are united with our franchisees as one system to continue delivering growth for years to come.\n\nWe delivered significant global same-restaurant sales acceleration on a one-year basis in the third quarter as both our international and U.S. business continued to compete well. Our international business achieved another outstanding quarter with widespread success, marking a sixth consecutive quarter of double-digit one- and two-year same-restaurant sales growth with two-year growth reaching over 25%. We continue to see strong results across our Latin America and Caribbean region with markets like the Bahamas and the Dominican Republic, showcasing remarkable year-over-year acceleration.\n\nThis growth was compounded by ongoing strength in Canada, where we are growing dollar and traffic share faster than any of our QSR burger competitors due in part to our breakfast launch. Our U.S. business delivered same-restaurant sales of 6.4% on a one-year basis accelerating over 4 percentage points versus the prior quarter as we held our strong dollar and traffic care position within the QSR burger category. Our consistent track record of strong results is a testament to our balanced marketing calendar which drove a sequential improvement in customer counts in Q2 and Q3 in addition to a strong average check supported by our system's strategic pricing actions.\n\nThroughout the quarter, we continued to promote craveable products across a variety of price points and occasions, including the continuation of Strawberry Frosty, our compelling and ownable $5 Biggie Bag and the relaunch of the much loved Pretzel Bacon Pub delighting our customers with a fan favorite for fall. We plan to further build on the sales momentum with the launch of our fresh Italian mozzarella sandwiches and Peppermint Frosty positioning us for a strong close to the year. Now, let's turn to our breakfast business. We continue to be pleased with our breakfast performance in Canada and are working hard to ingrain the breakfast habit and give our Canadian customers the high-quality offering they deserve.\n\nWe're still early in our breakfast journey, but we remain confident that the addition of this daypart will drive significant sales and profits for our Canadian franchisees. Turning to the U.S. We are incredibly proud of the success of our French Toast Sticks launch. This sweet, craveable morning treat has quickly become our No.\n\n1 selling breakfast item. The launch helped us maintain our morning meal dollar share in the QSR burger category and drove a meaningful acceleration in U.S. breakfast sales over the course of the quarter with average weekly sales approaching $3,000 as we exited Q3. This success, alongside our recently launched $3 croissant promotion, gives us confidence in reaching our goal of $3,000 average weekly breakfast sales by year-end.\n\nWe remain committed to our $16 million global investment in breakfast advertising this year just as we remain committed to fighting for our fair share of the QSR breakfast business. We held our digital momentum in the third quarter with global digital sales mix holding strong at approximately 10%. Our international digital sales mix was approximately 15%, bolstered by exceptional results across all of our regions. We expect these results to accelerate even further in the coming quarters as we launched our loyalty program in Canada just days ago, which we are incredibly excited about.\n\nIn the U.S., digital sales mix accelerated throughout the quarter, exiting at almost 9.5% of our overall sales. Our momentum was driven by several successful delivery promotions, which we are continuing to lean into throughout the fourth quarter when delivery demand seasonality typically peaks. We also drove a sequential increase in total rewards members of approximately 10% to a new record high. We are committed to expanding delivery and mobile order access and efficiency, fine-tuning our user experience and further developing our one-to-one marketing program to accelerate our digital business even further across the globe.\n\nWe continue to make progress against our global unit expansion in the third quarter. having now opened approximately 200 new restaurants during the year. I couldn't be prouder of the team and our franchisees for once again achieving growth in this difficult environment. As we approach year-end, we have increased visibility into a few factors that are impacting our plans for the fourth quarter.\n\nWe now expect a shift of approximately 30 new dark kitchens in India into 2023. This timing adjustment was agreed upon with Rebel Foods one of our franchisees in the India market, who successfully operates approximately 90 dark kitchens to date. They are leaning into an omnichannel strategy by developing more traditional restaurants near term, which will then be supplemented with additional dark kitchens. Additionally, we continue to experience development delays that are impacting the entire industry, contributing to a slight reduction in REEF delivery kitchen openings and in the U.S.\n\ntraditional development in 2022. Due to these changes, we now expect 2022 unit growth of 2% to 2.5%, primarily stemming from the reduction in nontraditional restaurants. We still believe that nontraditional concepts will be part of our growth story moving forward and will continue to be targeted and strategic in how we bring these concepts to life. Our 2022 unit outlook continues to represent an increase in our net unit growth versus our historical rate of 1% to 2%.\n\nWe expect our net new growth will continue to accelerate through 2025, and our team continued to make progress against fortifying our long-term development pipeline throughout the third quarter. We continued our U.K. expansion with nine traditional company-operated restaurants and a total of 25 restaurants in the market at quarter end. Additionally, we expect our first traditional franchisees will begin opening restaurants, including our first drive-thru location in the coming months.\n\nWe are garnering excitement from the system on our global next-gen restaurant design, which we believe will improve unit economics and increase returns. Our potential franchisee pipeline remains strong at over 250 candidates, and we expect this to continue to increase with ever-expanding response to our Own Your Opportunity campaign. We have seen an uptick in our build-to-suit pipeline and are actively recruiting more franchisees into the program. And finally, the percentage of our long-term goal that is under a development commitment remains at approximately 65%, giving us confidence in our expansion plans.\n\nOur playbook of investing to drive accelerated growth behind our three long-term pillars to build our breakfast daypart, drive our digital business and expand our footprint across the globe remains the same. Our continued growth and success would not be possible without the partnership we have with our franchisees. We recently received the results of the 2022 Franchise Business Review survey, reflecting another year of Wendy's exceeding industry benchmarks. I am particularly pleased with our rating on overall satisfaction, which paces more than 10 percentage points ahead of the industry in both the U.S.\n\nand internationally. These results once again highlight how our strong franchise relationships have been a differentiator for the Wendy's brand. And I have the opportunity to experience this firsthand at our annual franchise convention in September where the system was able to come together in person to celebrate our wins over the year and look forward toward all the growth that's still ahead. Through this partnership and the dedication of our restaurant crews and support center teams, we will continue to march toward achieving our vision of becoming the world's most thriving and beloved restaurant brand.\n\nI will now hand things over to GP to talk through our third quarter financial results.\n\nGunther Plosch -- Chief Financial Officer\n\nThanks, Todd. our third quarter results highlight the consistency of our financial formula as we achieved significant quarter-over-quarter acceleration in global same-restaurant sales and maintained year over year company-operated restaurant margin. Our global systemwide sales grew almost 9%, supported by strong global same-restaurant sales growth across both our U.S. and international segments and continued net unit growth.\n\nOur total company restaurant margin held flat year over year despite persistent commodity and labor inflation of almost 15% and over 6%, respectively, customer count declines and ongoing investments to support our U.K. expansion. These decreases were almost entirely offset by the benefit of a higher average check driven by cumulative pricing of almost 10%. In the U.S., company restaurant margin approached pre-COVID levels in the quarter, reaching 14.8%.\n\nThe slight decrease in G&A was primarily driven by a lower compensation accrual as a result of our overdelivery versus plan in the prior year. This was partially offset by higher salaries and benefits as a result of investments in resources to support our development and digital organizations, increased travel expenses and technology costs primarily related to our ERP implementation. Adjusted EBITDA increased almost 20% to approximately $135 million primarily driven by higher other operating income due to a gain from insurance recoveries, higher franchise royalty revenue and the favorable impact of our acquisition of 93 restaurants in Florida in the prior year. These increases were partially offset by lower franchise fees due to decreased franchise transaction activity.\n\nPlease note that beginning with our third quarter results, we are breaking out the amortization of cloud computing arrangements separately from G&A expense to improve clarity of disclosure in this area and subsequently, backing it out of adjusted EBITDA. This change is immaterial to our third quarter results. The increase in adjusted earnings per share was driven by an increase in adjusted EBITDA, fewer shares outstanding from our share repurchase program and higher interest income. This was partially offset by higher interest expense as a result of our debt raise transaction in the first quarter of 2022 and a higher tax rate.\n\nThe decrease in free cash flow resulted primarily from an increase in payments for incentive compensation for the 2021 fiscal year paid in 2022, the timing of receipt of franchisee rental royalty and other payments, cash paid for cloud computing arrangements primarily related to the company's ERP implementation and an increase in capital expenditures. We expect that all timing-related impacts will resolve in the fourth quarter and have no impact to the full year. Now, let's turn to our outlook for 2022. As we close in on the year, we are tightening several of our outlook ranges.\n\nWe now expect global system sales growth of 6% to 7% with approximately 75% driven by same-restaurant sales and the remainder driven by our 2% to 2.5% unit growth. We do not expect the change in our unit outlook to drive a material impact to our 2022 financial results due to the lower AUV expectations for nontraditional restaurants and timing in the year. Our updated sales expectation flows into adjusted EBITDA outlook range, which has narrowed to $490 million to $500 million. Our adjusted EBITDA outlook is also impacted by our company-operated restaurant margin, which we now expect to be approximately 13.5% to 14%.\n\nThe impact from our revised margin outlook is largely offset by higher other operating income as the result of the gain from insurance recoveries recognized in the third quarter. Our adjusted EPS outlook of $0.84 to $0.88 remains unchanged. And our narrowed adjusted EBITDA outlook is offset by higher interest income earned on our elevated cash balance. Finally, our free cash flow outlook of $215 million to $225 million remains unchanged as the impact of our tighter adjusted EBITDA outlook is offset by a reduction in our capex outlook to $90 million to $95 million.\n\nTo close, I would like to highlight our capital allocation policy, which remains unchanged. Our first priority remains investing in profitable growth, and we are continuing to showcase this. Today, we announced the declaration of our fourth quarter dividend of $0.125 per share, which aligns with our capital allocation policy to sustain an attractive dividend payout ratio of more than 50%. Lastly, our capital allocation policy gives us the flexibility to utilize excess cash to repurchase shares and reduce debt.\n\nWe continued to pause our share repurchases during the third quarter and have approximately $198 million remaining of our $250 million share repurchase authorization that expires in February of 2023. At the end of the third quarter, we had a cash balance of over $750 million, which provides us with flexibility to manage through headwinds in the broader environment and drive shareholder returns in accordance with our capital allocation policy. We are fully committed to continue delivering our simple yet powerful formula. We are an accelerated, efficient growth company that is investing in our strategic pillars and driving strong systemwide sales growth on the backdrop of positive same-restaurant store sales and expanding our global footprint, which is translating into significant free cash flows.\n\nWith that, I will hand things back over to Kelsey to walk through our upcoming IR calendar.\n\nKelsey Freed -- Director, Investor Relations\n\nThanks, GP. To start things off in November, we have a virtual NDR focused on the Chicago region with Cowen on the 14th, followed by the Northcoast Virtual Conference on the 15th and a virtual headquarter visit with Wedbush on the 16th. On the 30th, we will attend the Barclays Conference in New York followed by an NDR in Boston with Evercore on December 1. Across the rest of December, we will have an investor call with Gordon Haskett on the 6th before returning to New York on the 7th for the Morgan Stanley Conference.\n\nOur final event of the quarter will be a virtual NDR focused on the West Coast with BMO on the 15th. If you're interested in joining us at any of these events, please contact the respective sell-side analyst or equity sales contacts at the host firm. Lastly, we plan to report our fourth quarter and full year earnings and host a conference call that same day on March 1. As we transition into our Q&A section, please note that we have no further comment on Trian Partners amended 13D filing and would refer you to the statement made in our May 24 press release.\n\nPlease keep any questions focused on our quarterly results. Due to the high number of covering analysts, we will be limiting everyone to one question only. With that, we are ready to take your questions.\n\nOperator\n\n[Operator instructions] Our first question today comes from the line of Dennis Geiger with UBS. Dennis, your line is now open.\n\nDennis Geiger -- UBS -- Analyst\n\nGreat. Thanks for the question. I appreciate all the color on the development side of things, Todd and GP. Wondering if you could speak a little bit more to the current sentiment among the operators, the franchisees right now, given cost pressures, rising rates and if there's any additional thought from their end, impacting the demand side of things.\n\nIt sounds largely like the changes to guidance for the year are sort of timing-related. Just wondering if you could speak at all to kind of the demand and the current environment and kind of where heads are at from that perspective.\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes, Dennis. Thanks for the question. As you think about the development outlook for the brand and the confidence in the positioning of our franchise community continue to be able to invest to grow, they are cautiously optimistic as they think about the future. Clearly, we've seen headwinds out there with rates moving up.\n\nWe've seen trailing 12-month EBITDA a little more challenged in a lot of cases with all the headwinds that we faced on the commodities and the labor front. But the good news is we continue to innovate with our next-gen global design. We continue to partner with the franchise community to make sure that they're pacing and sequencing all of their investments not just new development, but the reimaging that they need to do, the continued investment in technology and in our double-sided grills. And that'd put us in a pretty good spot where we feel confident that we're going to position with the strong financial position that we generated for our franchise community over the last couple of years.\n\nthat we're in a healthier position than most in the industry. So we'll continue to lean in into investment. Yes, supply chain is challenged. There's some shifts from this year into next year.\n\nBut the biggest impact on our development front has really been on the nontraditional. We're going to continue to lean in to test and learn, dark kitchens in India, delivery kitchens with REEF. Some of the things will work, some won't, but we'll continue to lean in and learn on that. But our traditional development pipeline is pretty strong with 65% of our commitments for development into 2023 under development agreement for new builds.\n\nOperator\n\nThank you, Mr. Geiger. The next question is from the line of David Palmer with Evercore ISI. David, your line is now open.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThanks. And as a follow-up to that, if you could make a comment about unit growth into '23. I think you have targets that imply unit growth will be 4% to 5% after this year to get to your 25 unit targets. So I wonder how you're thinking about the step in '23 in that direction.\n\nAnd separately, I'm wondering if you could speak for the industry to some degree on traffic. It's been somewhat strangely negative in spite of the fact that you would think that mobility would be increasing. To what do you attribute that, if you had to step back and think about the forces at work here that are making the negative traffic more than norm in fast food?\n\nGunther Plosch -- Chief Financial Officer\n\nDavid, this is Gunther. We're not ready to give guidance for 2023. But you're right. Obviously, unit growth is accelerating into 2025, as we are obviously maintaining our 8,000 to 8,500 restaurants goal.\n\nAnd there are several factors where we are really confident. I think we're making great progress in the U.K. We have 25 restaurants there, 10 of which are company restaurants, really high hopes on next-gen restaurants design, right? Previously, you would get a cash-on-cash return of 10% to 15%. With the new next-gen design, you're actually getting a step-up of 15% to 20% cash-on-cash return.\n\nSo that's positive. We have a lot of interest from franchisees that want to become franchisees. The pipeline is 250 franchisees globally. They will all come with development movement.\n\nOnly opportunity campaign is very positive, lots of interest to also enable restaurant growth with smaller outfits. We have a build-to-suit program, fund program, as you know. We have not spent a lot of money on this year-to-date. So there's a lot of restaurant growth to be had, 80 to 90 for the years to come.\n\nAnd overall, with our development pipeline, we are about committed about 65% out into 2025. I think that's the answer to your first question. Todd, I think you take the second?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes. No. So David, on the industry traffic question, why it seems to be a little bit sticky on the negative side over the last several quarters, I think it really has to do with the state of the consumer. We've seen the consumer be a little more strapped.\n\nYou start to continue to see food, at-home meals being about 85% of the consumer's basket when it comes to meals. That's up from 82% pre-pandemic. It shifted to more meals at home during the pandemic. It's kind of stuck there as the consumers have been a little bit more strapped.\n\nSo what you're seeing is a little less frequency across the industry at the moment, which is putting a little bit of pressure on traffic. For us, for -- we've seen some nice sequential increases in customer traffic quarter-to-quarter, as we commented in our prepared remarks. And importantly, the under 75,000 consumer, which is more than 50% of our business, and it's a little more strapped and is an important customer for us, we continue to win with that consumer. So that -- those are probably some of the big highlights.\n\nYou're also seeing on the positive front, there are some trade-downs. So if you look at total industry, seeing some trade down from mid-scale casual, fast casual into QSR, which is a positive.\n\nGunther Plosch -- Chief Financial Officer\n\nSo just one small correction, so I slightly misspoke. Our customer count is not -- the traffic did not increase. It sequentially improved versus prior quarters. We are still slightly down.\n\nI just want to make sure this is understood.\n\nOperator\n\nThank you, Mr. Palmer. The next question is from John Glass with Morgan Stanley. John, your line is open.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nGood morning and thank you. GP, on capital allocation, and I understand there's some things you can't comment about. But when you think about the alternatives between buying -- given your cash balance, buying back stock and delevering, have you changed your view on that just given the rate scenario? It looks like your debt's termed out well, but at the same time, maybe there's now a view that rates in the future won't be as advantageous as they once were. So do you think differently about, conceptually about buybacks versus reducing debt leverage?\n\nGunther Plosch -- Chief Financial Officer\n\nJohn, interesting question. No, not really. I think at large, our capital allocation policy, we are happy with, investing growth, do an attractive dividend and then do share repurchases. At the moment, our debt levels are extremely favorable, right? Our average cost of servicing our debt is 3.5%, 3.6%.\n\nThe first time we have to refinance again it is in 2026. So we'll see how rates are developing from there. So at the moment, with the fixed rate nature of our debt, we are not in the rush to actually really think about that.\n\nOperator\n\nThank you, Mr. Glass. The next question is from Jon Tower with Citi. Jon, your line is open.\n\nJon Tower -- Citi -- Analyst\n\nGreat. Thanks for taking the question. Just curious if you could give us your expectations for some of the inflationary measures in the fourth quarter and perhaps into early 2023 on the food cost side, in particular but also what you're thinking on the labor piece of the equation. And then, how this all kind of factors into your pricing plans for the year ahead?\n\nGunther Plosch -- Chief Financial Officer\n\nJon, yes, we definitely are expecting inflation to slightly come down in the fourth quarter, right? We started to see that trend in the third quarter already, right? We had 15% commodity inflation that was following about a 19% commodity inflation in quarter two. On the labor side, we also got a slight improvement. We were -- labor inflation was a little bit north of 6%. Last quarter, we were sitting in the 11% to 12% range.\n\nFor the year, we are kind of guiding 15% to 16% on commodities and about 8% to 9% on labor. So it's going to come down slightly. It's too early to make specific comments on 2023. We definitely expect that commodity inflation will be less than what we are seeing -- what we have experienced in 2022.\n\nAs a result of it, we would also expect that our pricing increases we are going to take in 2023 will be less than what we have done this year. Obviously, the objective is to strive for profitability in our company restaurants that are marching toward pre-COVID levels.\n\nOperator\n\nThank you, Mr. Tower. The next question is from Chris O'Cull with Stifel. Chris, your line is open.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nThanks. Good morning, guys. Todd, I believe you indicated that weekly breakfast sales accelerated in the quarter with the launch of the French Toast Sticks. Do you think product innovation is going to be necessary to build breakfast sales going forward? And if so, does that change your thinking in terms of the need for additional breakfast advertising investment in the U.S.\n\nnext year?\n\nTodd Penegor -- President and Chief Executive Officer\n\nI'll start with the second part of the question, Chris. I do believe that we've now built our breakfast business up to a significant size where it can sustain its own advertising investment moving forward. We can always make choices across the portfolio, rest of the day and breakfast. But I do think we're in a good spot on having enough dollars to compete across all dayparts moving forward.\n\nAs you think about the role of innovation, I do think it is an important role. We started with a calendar that was really around driving awareness, driving frequency, ingraining the habit, and it was driven more by promotional offers. And this is the first time we brought some innovation news. Clearly, French Toast Sticks has resonated with the consumer.\n\nAs we said on the prepared remarks, it's our highest performing SKU in the restaurant on the breakfast daypart right now. And the good news is we saw that significant uptick toward $3,000 by the end of the quarter. So some nice growth on that front. And we're happy that that momentum will continue into Q3.\n\nWe've got the $3 croissant deal out into the marketplace. That news continues to bring in more customers more often. As we move forward, and we've talked about this on prior calls, more innovation could be an important play in the category and in the breakfast daypart for our brand. And we talked about the opportunity to innovate into the morning beverage area.\n\nWe think that's an opportunity for some growth into the future.\n\nGunther Plosch -- Chief Financial Officer\n\nChris, I wanted to add that everything that Todd said, it makes obviously sense. I want to point out, we will continue to invest in Canada, right? That's in two years of the growth. So the $11 million investment we have in the base will go to zero in 2023. The $5 million we have in 2022, we are definitely making investments in 2023 as well.\n\nOperator\n\nThank you, Mr. O'Cull. The next question is from the line of Lauren Silberman with Credit Suisse. Lauren, your line is open.\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nThanks for the question. Can you talk about changes that you're seeing or if there are any with respect to consumer behavior, so trade-down tech management? And then, what are you seeing across different cohorts just relative share among the higher and lower income cohort?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes. So on the general trade down question in the industry, we are seeing some trade down from mid-scale casual, fast casual into QSR. So that's a good benefit. When you think about income cohort, you are seeing the under $75,000 consumer, which is over 50% of our business, a little more strapped.\n\nYou're seeing them impacted in the industry on the frequency front, but the good news is we continue to gain traffic share with that under $75,000 income cohort. That means over $75,000 we're losing a little bit, but that over $75,000 consumers got a lot of other choices across all restaurant businesses. So we continue to compete well, although down a little bit with that consumer. We have a calendar that fits really well and can compete really well with where we stand today.\n\nWe still have four for $4 on the menu. We've got a $5 Biggie Bag that's super compelling. We brought some cool things like Strawberry Frosty at a great price point to the calendar. We've got $3 croissant meal out there for breakfast right now, and we continue to leverage our digital presence with continued gains in the loyalty program and great offers to make sure that we connect with a good balanced high-low calendar.\n\nBut the key for us would be ultimately and for everybody in the industry is get some folks from eating all those meals at home to start coming back out to the restaurant a little more often to drive frequency.\n\nOperator\n\nThank you, Ms. Silberman. The next question is from Brian Bittner with Oppenheimer. Brian, your line is open.\n\nBrian Bittner -- Oppenheimer and Company -- Analyst\n\nThanks. Good morning. Just wanted to go back to breakfast a little bit. As we dive into the accelerating sales results in the third quarter, just hoping you can talk a little bit more about the breakfast strength.\n\nMaybe you can unpack what the breakfast comp was versus the rest of the day, just so we can better understand that daypart's momentum. You seem very committed to accelerating that daypart. And can you also help us understand where your national awareness is on breakfast now relative to maybe what it was a year ago? And what can you really do to elevate it from here?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes. If you look at where our breakfast business has been performing, the last couple of quarters, we've been approximately $2,700 per week in Q2 and Q3. The great news is it really accelerated nicely as the back half of Q3 with the innovation of French Toast Sticks. And we're confident that momentum will continue with the great success on French Toast Sticks and now the $3 croissant offer that's out there in the restaurants.\n\nFrom an awareness, we're still north of that 50, on par with our competitors, hasn't moved a whole lot, but I think it's in a really healthy spot from an awareness perspective. So it's really about ingraining the habit, bringing some news, ensuring that our customers come in a little more often along the way. Innovation will play a role. Promotional price points will play a role.\n\nAnd executing great at the restaurant day in and day out with fast, accurate service is critical to success, and we'll continue to drive all of those things moving forward.\n\nGunther Plosch -- Chief Financial Officer\n\nIt's also worth noting that our legacy breakfast restaurants actually improved performance. They are now actually posted in the third quarter about $4,500. That's well north of a 10% mix. So again, it's a great sign that the growth potential for this business is great.\n\nIt's just a matter of time to get to it.\n\nOperator\n\nThank you, Mr. Bittner. The next question is from the line of Jeffrey Bernstein with Barclays. Jeffrey, your line is open.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nGreat. Thank you very much. A question on the U.S. sales front -- well, two parts.\n\nMaybe if you could just clarify the components within that 6.4% comp. I think you said you're running roughly 10% price but some negative traffic. Any color you can give in terms of the sequential through the quarter and maybe what the specific components were? And as you think about that, has there been any change from a competitive landscape perspective? There are thoughts that you might see an uptick in discounting as maybe inflation starts to roll over and some competitors are less rational than others. So any thoughts in terms of the broader competitive landscape as we close '22 and into '23 would be great.\n\nGunther Plosch -- Chief Financial Officer\n\nJeff, so the 6.4% growth in the U.S. system, the U.S. system priced a little bit less than 10%, about -- think about 9%. That means basically that our traffic was slightly negative, about 2%.\n\nMix was roughly unchanged. So that's the component of it. We had steady growth within the third quarter. The only callout that we are making is that our breakfast business accelerated toward the end of the quarter as we launched our innovation.\n\nAs far as competitive pressure is concerned, as I look at NPD CREST data, the deal levels that are happening in the category are not elevated versus what we have seen previously. So we're not seeing any strong signs that there are kind of big value wars to come would be my perspective. Todd, do you want to add anything on top of that?\n\nTodd Penegor -- President and Chief Executive Officer\n\nI think you said it all, GP. I think the only piece is as we roll into the fourth quarter, right? Clearly, we've got some momentum on the breakfast business, as we talked about. And with the guidance that we provided and the strong promotional calendar that we have in the fourth quarter, you think about Biggie Bag continue to be ownable and compelling. You think about the launch of fresh Italian Mozzarella sandwiches coming, Peppermint Frosty continuing to bring news.\n\nAnd an ongoing focus on digital and delivery, those are all important elements to keep the momentum, and we expect to have across the U.S., international and in total, double-digit same-restaurant sales growth again in the fourth quarter.\n\nOperator\n\nThank you, Mr. Bernstein. The next question is from Gregory Francfort with Guggenheim Securities. Gregory, your line is now open.\n\nGregory Francfort -- Guggenheim Partners -- Analyst\n\nHey, thanks for the question. GP, in response to the earlier question, you made a comment about getting store-level margins ahead of pre-COVID -- back to pre-COVID levels. I guess as you look out to '23 and '24 and '25, does pricing need to run ahead of cost inflation at some point? I mean, this year, clearly, there was just a big delay in terms of when the industry took pricing versus when inflationary pressures pressured the cost environment. I'm curious, are there things you can do on the P&L outside of pricing that kind of can move the needle in a big way? Or does pricing need to step ahead of cost inflation at some point?\n\nGunther Plosch -- Chief Financial Officer\n\nGreg, yes, we're definitely very focused to get back to pre-COVID levels since, at the end of the day, from a margin point of view, since this gets us better financial returns for new builds and better confidence within the franchise system. With the rest -- with the company restaurants in the U.S. posting 14.8% in the quarter, we're getting there, right? Pre COVID, we are hovering between 15% and 15.5% depending on what year you pick. So we are not far off.\n\nI would say pricing is an important lever. Inflation is here to stay, especially on the labor front. Commodity, we'll have to see how that plays out. But pricing is not the only lever we play.\n\nThere's obviously more sophistication we deploy now with our third-party pricing specialists that we've hired. And we think with improved analytics and better reach into the system, that should improve or could improve flow-through rates of price increases. And we, as a brand, do a lot of stuff from a marketing point of view to drive actually positive sales mix benefits like a $5 Biggie Bag that entices consumers to trade up from the four for $4 into that offering as an example. And we are working very closely with our supply chain and supply partners to take unnecessary cost out of our supply chain without impacting consumer perceptions.\n\nA great example is our new clear cups that we are rolling out. That's the triple benefit, right? There's an ESG benefit. There is a consumer perception value benefit and these cups are less costly than the previous ones. So these are the kind of things in concert that we are deploying against our restaurant margin to make sure we stay highly profitable.\n\nOperator\n\nThank you, Mr. Francfort.  The next question is from John Ivankoe with J.P. Morgan. John, your line is now open.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you very much. The question is on the $750 million of cash. Some years ago, when you refranchised sold units to franchisees and kept the land in the building and have them pay rent for you, part of that agreement is that they would be responsible for basically 100%, or at least from what I remember, 100% of the repair and maintenance on that building.\n\nI wanted to see if there's any kind of shift that you're thinking about, especially as it relates around accelerating a variety of initiatives that you may want to get done on a systemwide basis where some of that company's capital, some of Wendy's capital could potentially be reinvested or used in the franchise community to strengthen the brand overall? Or if we should expect the previous franchisees invest on their own to largely remain the case?\n\nGunther Plosch -- Chief Financial Officer\n\nJohn, yes, we're going to stay in line with our capital allocation strategy. So we're going to continue to invest in growth. So we are making investments. Examples for you are royalty abatement, advertising fund abatements to stimulate new growth.\n\nWe have set aside $100 million build-to-suit for program to help actually unit development, and we are taking some of the capital burden, specifically on the leaseholds and then stepping India and putting our balance sheet and helping franchisees out on that aspect of the business, there is no current plans and no intentions to do so.\n\nOperator\n\nThank you, Mr. Ivankoe. The next question is from Brian Mullan with Deutsche Bank. Brian.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nThank you. Just a question on development specific to international. After the U.K., I think Spain is a market you're focused on for further expansion in Western Europe. Maybe could you update us on your efforts where they stand in that market or any other market you want to call attention to? And related, is 2023 a year in which you'd expect meaningful, new development agreements to be signed in Western Europe? Or could it take a bit longer than that just given the macro backdrop over there?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes, clearly, in the U.K., the macro backdrop is a little bit more challenged, but we're still committed to building out that market. We've got now nine company restaurants open. We continued to invest in company restaurants. We've got REEF units open.\n\nWe've got six new franchisees signed up and would expect those franchisees start opening restaurants in the coming months. So our big opportunity in Europe is to build out the U.K. first. We continue to then think about how do we get into Ireland, leveraging the supply chain that we have into -- built up in the U.K.\n\nand then over time into Spain. We continue to prospect for good partners on all of those markets to continue to grow alongside of us. But it's one we're going to have to watch and see. With the consumer economic backdrop and the macroeconomic backdrop, does that take a little bit longer than what we had originally thought? Time will tell, and we'll provide more updates as we get into longer-term guidance in the future.\n\nOperator\n\nThank you, Mr. Mullan. The next question is from Jared Garber with Goldman Sachs. Jared.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nGreat. Thanks. I actually wanted to follow up on the previous question related to the U.K. market.\n\nIt seems like the stores there continue to be quite a bit of a drag on profitability related to some of the commentary you made on the U.S. margins. Can you talk about what you're seeing in that market as it relates to cost pressures as we head into '23 and how we should be thinking about maybe the impact of increasing the number of stores with the penetration in that market and then relatedly getting back toward pre-COVID margin levels in the company restaurant side given that dynamic?\n\nGunther Plosch -- Chief Financial Officer\n\nJared, yes. There's several cost pressures in the U.K. Some of them are unique to Europe, right? We have definitely seen a pretty hefty headwind on energy cost. Energy costs are up 50% to 60%.\n\nThat obviously puts margin under pressure. Would also say that sales are slightly lower than what we had expected. As a result of it, obviously, you're not getting as much leverage into that P&L as we thought. So overall, that is translating into about 50 basis points of headwind into our margin as we are consolidating up.\n\nHaving said all of that, I think -- we think this is temporary, the growth potential for the U.K. market. The structural economics around this are compelling. It's evidenced by U.K.\n\nentrepreneurs, signing up as franchisees since they believe in the potential of those markets. So it's a speed bump and not more.\n\nTodd Penegor -- President and Chief Executive Officer\n\nI think that's key, GP. We're playing a long-term game. We do have start-up costs that go with opening the restaurants, but it's a key pillar to really driving the growth across the region.\n\nOperator\n\nThank you, Mr. Garber. The next question is from the line of Wendy Miller with Piper Sandler. Wendy.\n\nNicole Regan -- Piper Sandler -- Analyst\n\nHi, it's Nicole. Good morning. Wendy is the new one. Can you hear me, OK?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes.\n\nNicole Regan -- Piper Sandler -- Analyst\n\nOK. Great. It's Nicole at Piper. Good morning.\n\nI want to ask about the supply chain, just two parts. No. 1, on the tactical side, how are items getting out to your partners? Like are they getting everything they need? Is it on time? And then second, just in terms of higher level strategy, like how are they aiding in any cuisine, culinary inspirations, innovations? Or is that kind of all housed at your brand level?\n\nGunther Plosch -- Chief Financial Officer\n\nA couple of things. From a supply chain point of view, on the food and paper side, it is tight. We have no noticeable out-of-stock. So we're really proud about what our supply chain is delivering to our franchisees.\n\nOn the supply chain related to new builds, I would say, it's extra tight. And I would definitely say that lead time for specific items are definitely much longer than -- and more uncertainty than what we had seen in the past. That's probably the picture on that in terms of our vendor partners, helping us with food innovation and so on. First of all, we are proud of our own R&D organization.\n\nWe have it here in Columbus, Ohio. They are turning out a lot of good food. And we are constantly working with third-party providers on potential new food items. We actually are having a supplier summit in the, I think, second quarter of next year to actually talk strategy, how can we work better together and drive even more acceleration in our business.\n\nTodd Penegor -- President and Chief Executive Officer\n\nAnd at the end of the day, Nicole, we do look at our suppliers as key partners. We just had them at our national convention out in Las Vegas. They see our plans. They partner with us, both teams, our R&D team, their R&D teams as we really try to leverage the collective expertise on both fronts, really leaning together to think about what the opportunities could be ahead.\n\nOperator\n\nThank you, Nicole. The next question is from the line of Danilo Gargiulo with Bernstein. Your line is now open.\n\nDanilo Gargiulo -- AllianceBernstein -- Analyst\n\nThank you. Good morning. I was wondering if you can provide your early expectations for the next-gen global design store. I know you mentioned they have higher cash-on-cash returns compared to the traditional stores, but can you provide more details on the comp uplift and even more on the digital mix that these stores can generate? And then, what proportion are you -- of new stores are you expecting to come in the form of the new next-gen global design? And if I may slot in one more on that, like, what's your development? And what's your progress on the owner opportunity initiative? To what extent have you been able to attract new franchisees into the system?\n\nGunther Plosch -- Chief Financial Officer\n\nOK. There were a lot of questions in one question. Let me see whether I can answer them all. So in terms of -- really excited on next gen, right? It actually reduces our build cost by about 10%.\n\nAnd what it also does is -- a more compact building, still offers good-sized dining rooms. It actually is more friendly for delivery drivers in our digital business that drives actually operational effectiveness. So you need less labor to staff these restaurants, and you also have less energy cost. As a result of it, you can maintain the same business.\n\nSo there is no like constraint in the kitchen that, because the building is smaller, you cannot get too compelling AUV levels. And then as a result, the combination of capital down, operating costs down due to labor and energy, we are getting a cash-on-cash return of 15% to 20%, which is a decent lift versus what we have seen previously. It also reduces our payout from seven years plus to about six years. How fast is that going to spread? I can tell you only one thing.\n\nOur franchisees are super excited about that footprint because it's just a great restaurant to operate and better financial returns. The first one will open in the early part of 2023. It is the new global standard on a go-forward basis. So in the future, all the new restaurants will be built on that standard.\n\nTodd Penegor -- President and Chief Executive Officer\n\nI think that was the key point. That is the new global standard for all new restaurants. Anything that's out there in flight, it's already working through the -- in process of new development, probably won't be able to flip to that. But anything new that's getting built out into the future will be that global next-gen design.\n\nAnd we're really excited about it as the franchise community is.\n\nOperator\n\nThank you, Mr. Gargiulo. The next question is from Eric Gonzalez with KeyBanc Capital Markets. Eric.\n\nEric Gonzalez -- KeyBanc Capital Markets -- Analyst\n\nHey, thanks and good morning. Thanks for the comments about the U.K. Clearly, outside that market, you have some very strong one-year and multiyear trends. So with regards to the international business, I'm wondering, are there any other regional differences worth calling out? And you mentioned the strength in the Latin America and Caribbean markets.\n\nWere there other wide variations in performance across the business segment? Perhaps you can call out a few markets where it might make sense to accelerate development given those strong trends.\n\nTodd Penegor -- President and Chief Executive Officer\n\nAs you heard in the prepared remarks, Latin America, Caribbean continue to perform very nicely for us. But importantly, Canada is our biggest international market. You start to look at how it's performed on a one- and a three-year basis on traffic and dollar a share. It's growing faster than any other QSR burger category.\n\nSo those are opportunities to continue to grow. If you think about international fronts where we have our big development agreements in place, we talked a little bit about the shifts on the dark kitchens with Rebel in India, but they're also building out traditional freestanding restaurants now too, moving forward to make sure we got a complete omnichannel strategy. And the Philippines is another market that's got a lot of momentum with a big development agreement that we feel really confident in.\n\nOperator\n\nThank you, Mr. Gonzalez. The next question is from the line of Nick Setyan with Wedbush Securities. Nick.\n\nNick Setyan -- Wedbush Securities -- Analyst\n\nThank you. Aside from the U.K. drag on company margins, relative to your guidance last quarter, it still seems like there were some incremental headwinds. But at the same time, the company-owned comp was pretty strong.\n\nSounds like inflationary headwinds still ease. So is it mix? I mean, what else is there that's going on that resulted in the incremental headwinds relative to your expectations three months ago?\n\nGunther Plosch -- Chief Financial Officer\n\nNick, yes, what forced us to take the guidance down a little bit was basically two factors. First of all, we are growing a little bit less in our company and in restaurants than what we expected. Hurricanes like Ian didn't help in the third quarter. That actually was an impact on our company sales of about 70 basis points.\n\nSo we lost leverage there. The first reason and second one is labor market is tough. So we have to spend a little bit more money on overtime to keep the restaurants fully staffed to serve our consumers, as well as we can. So these are the two factors where we slightly reduced guidance.\n\nOperator\n\nThank you, Nick. The next question is from the line of Jeff Farmer with Gordon Haskett. Jeff.\n\nJeff Farmer -- Gordon Haskett Research Advisors -- Analyst\n\nGreat. Thank you. Just following up quickly on labor inflation. I appreciate that inflation jumped last summer pretty meaningfully, and you're lapping that.\n\nBut question is, what drove the big quarter-over-quarter deceleration that you saw in the Q3 on labor inflation? I think it fell from 12% in the Q2 to something like 6% in Q3. What's driving that?\n\nGunther Plosch -- Chief Financial Officer\n\nYes, it's a function of the comparison base, right? So in the -- if you look back in -- labor inflation in 2021 was about 6%. That then stepped up to about 12% in 2022. And then in 2021, third quarter labor inflation started to get more difficult, right? So we had kind of a 9% inflation in the third quarter of 2021. That stepped up to slightly north of 6%.\n\nSo if you actually look at inflation on a two-year basis, it's kind of sequentially slightly down.\n\nOperator\n\nThank you, Mr. Farmer. The next question is from Jim Sanderson with Northcoast Research. Jim.\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nHey, thanks for the question. Just wanted to ask a general question about pricing. Do you believe you have pricing power on a net realized basis or flow-through basis in the U.S. to keep pace with constant inflation without having to rely more on discounting here in the United States?\n\nGunther Plosch -- Chief Financial Officer\n\nYes, we definitely believe we have pricing power. We have now taken significant pricing the last couple of quarters. We are up to 10% in the company restaurants. As we said in the prepared remarks or I think it was even in Q&A, our traffic is sequentially improving.\n\nIt's still slightly down. So we don't see kind of less flow-through. We're still seeing a flow-through of about 80%. So we have not yet reached a breaking point, and we think there is, therefore, more pricing power there.\n\nAs we also said, we are getting even more sophisticated and were to take price with a third-party consultant that we have hired not just for the company but also for our franchisees. And at the end of the day, the proof is in the pudding, right? We have yet again in this quarter held our dollar and traffic share in the category. So we are competing well with the pricing levels we're at.\n\nTodd Penegor -- President and Chief Executive Officer\n\nI think the optimistic side of the consumer moving forward is wage rates are up, as we just talked about, but inflation is still strong. So as inflation starts to subside on the commodity front and there's more disposable personal income for the consumer, that bodes well for the industry. As you start to fast forward into the future, that healthier consumer will continue to come out. We'll start to see those frequency gains and get folks from food at home to food away from home.\n\nSo the future is very bright.\n\nOperator\n\nThank you, Mr. Sanderson. Our last question today comes from the line of Sara Senatore with Bank of America. Sara.\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you for fitting me in. I just have two questions that are sort of follow-ups on what we heard. The first is on breakfast.\n\nI know you said sort of running -- had been running 2,700 a week from previous quarters. I think the Q said 2,600 year-to-date. So it sounds like you had a nice lift in the second half of the quarter but maybe a bit softer in the first half. I'm just trying to understand how sticky you think the business is versus getting a lift when you do have a really appealing launch? And then, maybe it settles back in.\n\nSo that's the first follow-up. And then, the second one is, can you just talk about whether you're seeing any changes in order sizes? You mentioned sort of no real mix shift. What we have been seeing is customer counts seem to be improving sequentially but it's being eaten up a little bit in terms of mix because you're seeing mostly just the effect of order disaggregation. So is there anything going on there as you see more normalization, whether it's less of the drive-thru or less delivery.\n\nAnything you can speak to on that front?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes. So Sara, on the breakfast front, you were right. It did sequentially increase throughout the quarter with the launch of French Toast Sticks. But you also have to remember, we are lapping a very strong $1.99 croissant promotion a year ago.\n\nSo we're happy that we were able to build growth on top of growth. And any time you're putting news out there, any time you got a promotion, any time you're advertising, you start to build some more awareness but, more importantly, build trial. And we continue to see our breakfast daypart is our highest overall satisfaction daypart. So our opportunity is to get folks to continue to get in, try us, get us into the routine and then earn their frequency over time.\n\nOn order size, when you look at average items per transaction, it has come down a little bit over time. And some of those great big orders that we were seeing back in the height of COVID, it's shifted down a little bit. But when you look at overall mix, as GP said earlier, we've been hanging in there pretty well on overall mix. What that's been interesting to see is delivery continues to hang in there quite well even with all the pressures.\n\nSo we'll continue to lean in as we go into the fourth quarter with messaging around delivery. And one thing that you try to create is some value within delivery, and we now get the $5 Biggie Bag in with DoorDash and that promotion started in Q4 is resonating very well with the consumer. So we feel good about that, too.\n\nKelsey Freed -- Director, Investor Relations\n\nThanks, Sara. That was our last question of the call. Thank you, Todd and GP, and thank you, everyone, for participating this morning. We look forward to speaking with you again on our fourth quarter call in March.\n\nHave a great day. You may now disconnect.\n\nDuration: 0 minutes\n\nKelsey Freed -- Director, Investor Relations\n\nTodd Penegor -- President and Chief Executive Officer\n\nGunther Plosch -- Chief Financial Officer\n\nDennis Geiger -- UBS -- Analyst\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nJon Tower -- Citi -- Analyst\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nBrian Bittner -- Oppenheimer and Company -- Analyst\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nGregory Francfort -- Guggenheim Partners -- Analyst\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nJared Garber -- Goldman Sachs -- Analyst\n\nNicole Regan -- Piper Sandler -- Analyst\n\nDanilo Gargiulo -- AllianceBernstein -- Analyst\n\nEric Gonzalez -- KeyBanc Capital Markets -- Analyst\n\nNick Setyan -- Wedbush Securities -- Analyst\n\nJeff Farmer -- Gordon Haskett Research Advisors -- Analyst\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nSara Senatore -- Bank of America Merrill Lynch -- Analyst\n\nMore WEN analysis\n\nAll earnings call transcripts"
}