{
  "companyName": "TELA Bio, Inc.",
  "companyTicker": "TELA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/tela-bio-inc-tela-q2-2022-earnings-call-transcript/",
  "content": "TELA Bio, Inc. (TELA 3.79%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the TELA Bio second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to Louisa Smith from the Gilmartin Group. Please go ahead.\n\nLouisa Smith -- Investor Relations\n\nThank you, Louay, and good afternoon, everyone. Earlier today, TELA Bio released financial results for the second quarter of 2022. A copy of the press release is available on the company's website. Joining me on today's call are Tony Koblish, president and chief executive officer; and Roberto Cuca, chief operating officer and chief financial officer.\n\nBefore we begin, I'd like to remind you that during this conference call, the company may make projections and forward-looking statements regarding future events. We encourage you to review the company's past and future filings with the SEC, including, without limitation, the company's 2021 Form 10-K and Form 10-Qs, which identify the specific factors that may cause actual results or events to differ materially from those described in these forward-looking statements. These factors may include, without limitation, statements regarding product development, product potential, the impact of COVID-19, the regulatory environment, sales and marketing strategies, capital resources or operating performance. With that, I'll now turn the call over to Tony.\n\nTony Koblish -- President and Chief Executive Officer\n\nThank you, Louisa. Good afternoon, and thanks for joining us today on our second quarter 2022 earnings call. I am very pleased to report that TELA Bio achieved its first double-digit revenue quarter with net sales of $10.4 million, growing 38% year over year and 26% sequentially from the first quarter. On today's call, I'll describe how we plan to continue growing revenue and taking market share, update you on the progress of our sales force expansion, discuss the signing of the Premier contract and what that means for our business and review our latest clinical news.\n\nThen Roberto will provide a financial review of the quarter, and I will make some closing comments before we take your questions. As I've described before, TELA's revenue and market share capture can be thought of as the product of five factors: one, the size of our sales force; two, per sales rep productivity; three, the number of products in our portfolio; four, GPO and supply chain access; and five, clinical data. Throughout the past year and certainly within the second quarter, we've improved each of these dimensions, resulting in continued financial and operational performance. As we disclosed previously, we ended 2021 with just under 45 sales reps.\n\nOur goal was to grow to 55 reps by midyear and 60 by the end of 2022. I am pleased to report that we had 57 sales reps at the end of June and remain on track to reach our target for the end of 2022. More important than the number of reps, though, is their quality. We are continuing to see that strong reps with prior experience within the medtech industry are eager to join TELA, having seen our success over the past few quarters and hearing about the culture and compensation potential from current sales reps within their professional networks who have already found success here.\n\nWe've had two training sessions in the first half of the year, yielding reps who are thoroughly knowledgeable in Playbook90 and who have hit the ground running in generating sales. Our most recent metrics on new reps continue to show that, on average, they have covered their costs within the three -- first three to six months of hiring, quickly contributing to the top line without negatively affecting profitability. We are in the process of planning the pace of sales force expansion in 2023 and evaluating whether it makes sense to accelerate any of that into 2022. We'll update you on that later in the year.\n\nCOVID-19 still seems to be affecting the market, presenting both challenges and opportunities. Although our second quarter got off to a strong start, we saw some softness in June, such that the last typically strongest revenue month of the quarter was only slightly above May. That said, we continue to believe there is considerable backlog in hernia repair due to COVID-19. Based on market growth rates before and after the March 2020 initial COVID-19 lockdown and more recently, we estimate there may be as many as 100,000 hernia repair procedures that have been deferred due to COVID-19 that need to be treated in the coming quarters.\n\nThis represents potential for the use of OviTex products and is the reason we remain confident about performance over the full year. Roberto will have more on that shortly. Towards the end of July, we announced our entry into a group purchasing organization agreement with Premier for our OviTex hernia and PRS products. The contract becomes effective on October 1.\n\nPremier is the second largest GPO in the U.S. covering over 4,400 hospitals and 225,000 providers. This is a meaningful achievement for TELA. We've already seen the impact of GPO contract can have on our business with HealthTrust now comprising approximately one-third of our revenue.\n\nPremier is an even larger organization and offers us an excellent opportunity to grow our business even faster. Additionally, Premier gives us access to many West Coast markets we have not fully penetrated to date. We believe the potential downstream impact of this agreement is substantial and will serve as an important driver of our future growth. We were pleased to announce recently that 24-month results from BRAVO and ReBAR studies were accepted for presentation at the American Hernia Society Meeting in September.\n\nIn our BRAVO study, the recurrence rate for eventual hernias repaired with OviTex was only 2.6% at 24 months, which we believe compares favorably to reported recurrence rates from competitive products in these types of procedures. A separate retrospective study examined the recurrence rates of patients who underwent inguinal hernia repair utilizing OviTex in a minimally invasive technique known as the ReBAR technique. After two years, only three recurrences were identified from the 157 inguinal hernias repaired using the ReBAR technique, a rate of 1.9%. High-quality outcomes data is one of the factors contributing directly to OviTex' revenue and market share capture.\n\nWe will continue to develop further supportive data with one area of focus being outcomes from OviTex using robotic repairs, as in BRAVO 2. Today, approximately 60% of OviTex repairs employ minimally invasive procedures, and we expect this to grow. Developing additional products compatible with surgical robots and laparoscopy and the data supporting their outcomes is therefore a high priority for TELA. On that note, the final important factor for revenue growth is portfolio expansion.\n\nWe continue to advance projects in both R&D and business development and expect to be able to discuss some details of this more fully by the end of the year. Our sales force is excited to get additional high-quality products to discuss with their customers, and we take seriously the goal of being a broader tissue preservation and restoration company. We look forward to providing updates in the future. With that, I'll turn the call over to Roberto for a more detail -- for more details on our second quarter financial results.\n\nRoberto Cuca -- Chief Operating Officer and Chief Financial Officer\n\nThanks, Tony. Revenue for the second quarter of 2022 increased 38% year over year to $10.4 million. Gross profit percentage was 63% in the second quarter of 2022, compared to 67% in the same period last year. Cost of revenues included a onetime cumulative amortization charge of approximately $462,000.\n\nThis charge related to the final $1 million milestone payment to our contract manufacturer for the attainment of $5 million in cumulative sales in Europe, which we expect to occur next year. Sales and marketing expenses were $11.1 million in the second quarter of 2022, compared to $7.5 million in the same period of 2021. This increase was mainly due to higher salaries, benefits and commission costs as a result of the expansion of our commercialization activities, higher travel and consulting expenses and additional employee-related costs due to increased head count, particularly in our consumer-facing roles. G&A expenses were $3.6 million in the second quarter of 2022, compared to $3 million in the same period of 2021.\n\nThis increase was primarily due to higher salaries and benefits and increased professional consulting and legal expenses. R&D expenses were $2.1 million in the second quarter of 2022, compared to $1.9 million in the same period last year. The increase was primarily due to higher salaries and benefits. Loss from operations was $10.2 million in the second quarter of 2022, compared to $7.3 million in the prior period -- prior-year period.\n\nNet loss was $12.7 million in the second quarter of 2022, compared to $8.3 million in the same period in 2021. We ended the second quarter of 2022 with $27.2 million in cash and cash equivalents. For the full year 2022, we expect revenue to range from $42 million to $45 million, representing growth of 43% to 53% over the prior year. As Tony said, this assumes that the potential impacts of COVID-19 will be no more disruptive in 2022 than in 2021.\n\nHowever, a significant increase in COVID-19 infections beyond our estimates could negatively affect this projection. I'll now turn the call back to Tony for closing remarks.\n\nTony Koblish -- President and Chief Executive Officer\n\nThank you, Roberto. As you've heard today, our momentum is strong, and we expect it to continue despite any COVID-19 headwinds. Everything is in place to drive significant multiyear revenue growth. We deliver both market-leading innovation and value to payers and providers.\n\nOur products are supported by an outstanding sales and service organization and the performance data on OviTex is extremely compelling. Finally, the importance of the Premier agreement should not be underestimated. This is a huge win for TELA, and our sales and business teams will be laser-focused on maximizing the potential of this opportunity. With that said, I'll now ask Louay to open the line for your questions.\n\nLouay, take it away.\n\nOperator\n\nThank you so much, Tony. All right. So your first question comes from the line of Frank Takkinen from Lake Street Capital Markets. Please go ahead and ask your question.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nHey, Tony, Roberto, Congrats on the results and guidance and all of the above Premier and new data. I wanted to start with a question on Premier and just digging a little bit deeper. So maybe a two-parter. First, starting with positioning? How is OviTex positioned within the Premier contract? And why is that important? And then, two, just curious if there's any volume-based incentives built into the contract yet or if that's potentially a negotiation at a later date?\n\nTony Koblish -- President and Chief Executive Officer\n\nYeah. So Premier is an important agreement for us. But it's not just the size of the GPO, the footprint and the opportunity, it's the nature of what the agreement says, right? So the category that we've been placed in is called the biosynthetic category. So in the HealthTrust agreement, we were definitely placed in the biologic category.\n\nNow biologics over the years have been used in more and more complicated, complex abdominal wall procedures, which means you're sort of in that smaller segment of the market. this segment that we're in now, this bioabsorbable segment is really sort of in the middle. It's in that sort of simple ventral, moderate ventral area but the potential of these natural repair products that reside in this sort of middle zone means that we can go upstream into the complicated and then downstream into the simple. So in many ways, I think, this is a clear signal that OviTex has sort of gotten beyond that niche complex opportunity, which is high price, low volume, and now, we're being viewed as a more complete provider, capable of doing everything from the most simple, inguinals, robotically to the most complicated open ab walls, which puts us very much on a level playing field with our competitors.\n\nSo we like being in the zone that we're in. It allows us to take advantage of the breadth of the opportunity within the footprint of those hospitals. And the second part of the question, Frank, sorry?\n\nRoberto Cuca -- Chief Operating Officer and Chief Financial Officer\n\nVolume-based incentives.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nYeah, just if there was any, yeah, volume-based incentives?\n\nTony Koblish -- President and Chief Executive Officer\n\nYeah, I mean, there's some tiers there. We are not going to really be able to talk about that. The contract is proprietary, I would say. But there's some pricing tiers and volume issues that are at play.\n\nI think, we're sort of new to the game on that, structuring those kinds of deals. So we've walked into that fairly carefully. But we're very satisfied with the way that works. And our ability, again, to reach across all the hernia types is just excellent.\n\nSo the big news is that we won the contract the bigger news is that we're in that bioabsorbable category. That's just absolutely huge news. It takes us from a niche player to a broad provider.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nOK. Really helpful. And then, maybe just shifting over to competitive landscape, and I hope I don't put you in an uncomfortable position asking this, but just curious if you had any recent thinking or comments to provide on the synthetic lawsuits that are ongoing, specifically in the Providence, Rhode Island case that's developing in real time?\n\nTony Koblish -- President and Chief Executive Officer\n\nYeah, yeah. I mean, so there's a -- that we're early, I think, in the process right now with this class action litigation. I'm not sure how many cases have gone -- have started in the early phases, maybe two or three, but there's certainly a new case going on right now. I assume if you're talking about Providence, you're referring to the Trevino versus Davol and C.R.\n\nBard Case. I can't really get into any details. We don't know any details. All I can do is talk about what we've read in the press.\n\nSpecifically, there was an article that came out a little while ago in Bloomberg, which I think cracked open some of the internal issues, which I'm not going to discuss here, but that's free for anybody to take a look at that may be in play here. So whatever has been reported in the press is what we know. We can't comment on anything specific. What I can comment on is what we think the overall trends are that this is starting to kick off, right? And we do believe that this will increase this case specifically, perhaps and maybe that article that has come out already on it may increase the negative attention that gets focused on permanent synthetic meshes.\n\nSo this should accelerate the ongoing market trends toward natural repair products, which, at this point, really are resorbable plastic meshes, biologic meshes and then products like OviTex that are a combination of all of those things, right? So I think, this pushes things more toward natural repair, which dovetails beautifully with the fact that our premier contract puts us in the high usage category. We also know that just from Street intelligent sales force kind of reading the tea leaves, that Bard, they understand exactly what's happening in this market. They're in the middle of all this, right? So we know that they're reducing commissions or maybe even eliminating commissions, they're certainly creating incentives, we believe, to move their customers away from permanent synthetic meshes and more toward their resorbable mesh platform, their bioabsorbable, their natural repair product called Phasix. So this may take the form of incentivizing on multiple fronts.\n\nThis is good news for us as well. I think, the more players, credible players, big players, strong players that validate the need for this natural repair, the better for us. And the reason is simple, we offer a tremendous comparison, right? So our product has superb clinical data in comparison to any permanent or resorbable plastic mesh. Our recurrence rates are superb.\n\nAnd we also have a great cost advantage when it comes to these resorbable products as well, could be as high as 20% to 25% from what we're seeing. We need to let that shake out a little bit and see where that goes. But we certainly offer a cost advantage in comparison to these resorbable plastics. We cost a bit more than permanent mesh depending on the technology level, whether it's coated or not coated.\n\nBut if the market is moving toward natural repair, this is good for us. So the extent that this litigation creates any kind of awareness in physicians and patients to move toward natural repair, we are just situated exceptionally well with our OviTex platform, our data set and our recurrence rates to perform very well in this market. So we like where we are. And like I said, we're in the early stages of this litigation unfolding there's many sort of bellwether early cases that will decide how this goes.\n\nSo that's about all I can say.\n\nRoberto Cuca -- Chief Operating Officer and Chief Financial Officer\n\nYeah, I'd just add one sentence, which is that that move from permanent synthetic to resorbable synthetic was already happening, and it's probably just being accelerated by the additional life that's being shown by the litigation.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nOK. That's helpful. Maybe if I could just test my luck with one more question on the same topic. And it's a peer speculation ask on my part, but understanding the case and how it's unfolding, do you think that there could be a case where Bard thinks that their best strategy is to elect to pull their synthetic products from the market to try and protect some downside? Or is that maybe going a little bit too extreme into the situation?\n\nTony Koblish -- President and Chief Executive Officer\n\nI think, we're way out over our skis. We have no idea. I mean, we don't even know how these cases are going to turn out yet.\n\nRoberto Cuca -- Chief Operating Officer and Chief Financial Officer\n\nYeah, if you were to compare it to the pelvic meshes, it took a lot of cases before companies started pulling products and many years. So given that I think this is only the fourth case, it's probably a ways off before Bard will be faced with a decision like that, if at all.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nOK. That's great. Congrats, again, on all the progress and really appreciate all the color. Thanks for taking my question.\n\nTony Koblish -- President and Chief Executive Officer\n\nThank you so much, Frank.\n\nOperator\n\nAnd your next question comes from the line of Caitlin Collins from Canaccord. Please go ahead and ask your question.\n\nUnknown speaker\n\nHi, good afternoon. Thanks for taking the questions. This is Caitlin on for Kyle Rose. So just a couple of questions.\n\nOn SiteGuard, how is the launch going? Has it helped drive pull-through into accounts for your other products? And then, how is the market environment trending into Q3? Have COVID pressures eased? Or are you guys still seeing a buildup of backlog? Thank you.\n\nTony Koblish -- President and Chief Executive Officer\n\nYeah. I'll start with the second part first. So it looks like there's hotspots or flare-ups, right, at least that's our Q2 experience, right? We started Q2 exceptionally strong as our opening comments reflected. The first two months were excellent, and we thought we were going to knock the cover off the ball even more than what we did.\n\nAnd we just had a little bit of a two-week sort of turbulent patch, right, in late June, mid to late June. And it felt like it was a little bit of nursing shortages, hospital staffing. And then, it sort of cleared up and we had a strong finish to the month. So the good news is that these patches seem to be getting shorter and smaller.\n\nThe bad news is they still rear their head, and they're maybe a little bit unpredictable for some reason. It could be these B, A, four, five Omicron variants are highly contagious. They don't do too much damage relative to the older variants perhaps. And there's such good home testing now that maybe everybody is not reporting that they get it.\n\nBut when they do get it, they fall out of the system, right? The patients fall out, the doctors fall out, etc. So I think, it's just going to be patchy here, and our job is to figure out how to navigate through that patch. Regarding SiteGuard, I think we're in an evaluation period with this product. We are still learning.\n\nSo we'll keep you posted as that unfolds. It's a very minor contributor right now. Most of the business is not -- the bulk of the business is still within the hernia and the PRS platform. But we're learning a lot with that market.\n\nAnd I think, we're -- it's guiding us on how to position products in the antimicrobial space, I think that's going to pay great dividends for us in the future. So we're in learning mode right now.\n\nUnknown speaker\n\nGreat. Thanks.\n\nTony Koblish -- President and Chief Executive Officer\n\nThanks, Caitlin.\n\nOperator\n\nThank you, Caitlin. And your next question comes from the line of Matthew O'Brien from Piper Sandler. Please go ahead and ask your question.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nClarification one. Roberto, did you say there was a onetime purchase in the quarter? I don't think I caught that.\n\nRoberto Cuca -- Chief Operating Officer and Chief Financial Officer\n\nNo. So there was a onetime GAAP accounting-based charge in the quarter. So under our contract with our contract manufacturer, when we achieved $5 million in cumulative sales in Europe, we owe them a $1 million milestone payment. We expect to hit that milestone and paid them the $1 million sometime next year, probably in the first quarter.\n\nFor GAAP accounting purposes, though, we needed to take -- and that $1 million gets amortized from the launch of the European business through the expected lifetime of the business. Because we launched a couple of years ago, we had to make a catch-up charge to the tune of $462,000 in the second quarter, even though it was a non-cash charge. So if you were to figure out the cash basis or cash gross profit percentage, you just add that $462,000 back to our gross profit.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nOK. Perfect. Thank you. And then, the -- obviously, OviTex did well in the quarter, but the standout was clearly PRS.\n\nI know you probably don't have as much COVID pressure there, but -- so that's certainly helping. What is going on with PRS specifically? I know it's an area that you expect to be a big contributor in the coming years, what have you seen kind of underneath the hood as far as new accounts and new clinicians and share taking within that category? And then, I do have one more on Premier.\n\nTony Koblish -- President and Chief Executive Officer\n\nYeah, so Matt, so PRS did well. It may be a bit more insulated given that it's related to cancer compared to hernia. That has certainly been our experience up until now. But really, we're just seeing the maturity of the launch start to take shape, right? So we have a process.\n\nIt's very methodical. It involves training, learning, feedback loops, iterative-type approach. And the same approach we did with hernia, right? Hernia started off in end of 2016 or so. PRS started off in 2019 or so.\n\nSo we're two to three years behind the launch with PRS. But what you have to understand is PRS is being rolled out with the same process but into a much more mature organization, right? When we rolled out hernia initially, we might have had five, eight, nine, 10 reps, something like that. Now we have 57 reps. We have our processes in place.\n\nWe have our ecosystem, our Playbook90, and we're just slowly but surely systematically work in the process, and it's paying dividends. And you're just seeing the overlay of how we did hernia how we're doing hernia is the same way how we're doing PRS, and you're seeing the benefits of just being into a bigger footprint, more mature, just a more maturing company and process. And our commercialization process particularly is getting quite sophisticated with the ecosystem. And we're also benefiting from the contracting also and the rep talent.\n\nIt's all including. It's a virtuous cycle of improvement, which is going to uplift everything.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nGot it. OK. OK. And then, just one more.\n\nI could ask a bunch more, but just sticking with one more. On Premier, it's great that you've got this broader number of cases that you can address. I think, you said HealthTrust is a third of revenue, so call it, $10 million to $12 million on an annual basis. Do you get a buy-in right away in Q4 of note? And then, how quickly can you get to a HealthTrust kind of level revenue and surpass that? I mean, how big could this be, could it be two times HealthTrust or even more?\n\nTony Koblish -- President and Chief Executive Officer\n\nWell, yeah, those are great questions, Matt. Thanks. So look, I think, HealthTrust is underperforming for us right now, right? Because 18 months of the three-year contract has been in COVID where we've had no access to install into HealthTrust for the bulk of the contract, right? So that hopefully will not be the case with Premier. Now all the hospitals within HealthTrust and Premier don't do PRS and hernia procedures, right? But if you just look at a proxy, right, 1,600 hospitals for HealthTrust and 4,400 for Premier, that's a pretty good ratio proxy for what the ultimate potential could be for this market.\n\nAnd then, again, like I said before, we're a healthier, more mature organization. Our clinical data is now more mature. Our sales force is improving that virtuous cycle of uplift is in place when we start Premier, right? So our expectation is that we're going to grow like crazy within both HealthTrust now that things are clearing out in terms of COVID and Premier, is going to be sort of that ratio that mimics the ratio in hospitals. So yes, it's a big deal.\n\nAnd we invested heavily early in our commercialization process in building the talent and the experience to master contracting, and I think it's paying off. We are going to get every major contract in time. They only come due every three years, but we offer a compelling value proposition, compelling innovation, compelling cost savings and compelling clinical performance delivered by a first rate selling organization. So yeah, I expect everything to be explosive once we gain traction.\n\nDoes it happen overnight? No, right? Nothing goes from zero to 100 in medtech, right? You've got to work your way into it. You got to be patient, diligent. And when we start the contract in October, that's the way we're going to approach it. But I like our chances with a third of our revenue in HealthTrust in the middle of COVID, I like our chances with Premier given all those factors.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nGreat. Thanks so much.\n\nTony Koblish -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of Zachary Weiner from Jefferies. Please go ahead and ask your question.\n\nChris Howerton -- Jefferies -- Analyst\n\nHi, it's Chris filling in for Zach. Thanks for taking the question. You guys talked a little bit about how net excess has trended through the quarter. Has excess returned to pre-COVID? And kind of as a result of this, how has your utilization of reliance on TELA LIVE shifted?\n\nTony Koblish -- President and Chief Executive Officer\n\nWell, TELA LIVE is a permanent part of the landscape now for us, right? I mean, we're doing TELA LIVE as part of our normal course of business. We can reach more surgeons. We can offer that service to our sales force. They can get a touch -- a high touch with senior leadership.\n\nBut we're also doing in-person VIPs. Those have started up again, and those are picking up quite nicely. So it's going to be a permanent part of the landscape. The VIPs are coming back in person.\n\nI think, we're sort of way beyond where we were in a post-COVID era in terms of those activities, high touches with surgeons. In terms of our reps and their access, I can't even remember what pre-COVID like, to be honest with you, given we were pretty underdeveloped back then, right? We -- this was pre-IPO for us, and we didn't have the capital, didn't have a big sales force. So all we know is what we're in now. I don't feel like we have a big problem with access right now.\n\nI think, our reps are getting to where they have to go. I think, these patches that erupt are coming from the surgeons the nurses and the patients either getting these later variants of COVID or just shortages, right, on the labor side. So that's more the issue for us. I don't think our reps are having any kind of problem making contact with customers and presenting.\n\nThat is really strong for us right now. It's really this up and down flow that we're seeing these patches that are up every now and then.\n\nChris Howerton -- Jefferies -- Analyst\n\nAwesome. Thank you. And kind of going off that last point you made, how have you guys been affected by the broader supply chain pressures that we've been seeing across the industry?\n\nRoberto Cuca -- Chief Operating Officer and Chief Financial Officer\n\nSo we haven't had too much pressure on supply chain. So as you know, we get most of our products from New Zealand. The ECM materials sourced from slaughterhouses there, and the cost of that manufacturing are borne by that contract manufacturer, we compensate them with a revenue share. So the cost for us of our primary products have not been increasing.\n\nThere's -- we do pay for shipping, and there's, obviously, been some constraints on that, but that's not a huge contributor to our expenses. And then, there's more competition for expertise. This applies more to R&D and G&A because our sales forces are still compensated based on a base salary and then a commission based on how much they sell. So we're reasonably well insulated from cost pressures.\n\nThere's a little bit of effect is, but not much is material.\n\nChris Howerton -- Jefferies -- Analyst\n\nThanks.\n\nTony Koblish -- President and Chief Executive Officer\n\nThanks, Chris.\n\nOperator\n\nThank you so much. And our last question comes from the line of David Turkaly from JMP Securities. Please go ahead and ask your question.\n\nDave Turkaly -- JMP Securities -- Analyst\n\nGreat. Thanks. Tony, you mentioned culture and sort of compensation potential for the reps. I was wondering if you can maybe expand on that a bit.\n\nI mean, are they able to make more? Are you doing something different than, say, you did at other medtech entities in the past in terms of the rate you're paying these folks? And what specifically would you highlight from the culture side that is allowing you to attract these folks?\n\nTony Koblish -- President and Chief Executive Officer\n\nYeah, I mean, our comp plan is, I think, rather typical for what I've done in the past. And what we've done in the past, we've got -- our whole team here virtually has built sales forces and have grown from zero to $100, zero to million to $200 million, which is what our goal is, right? So we have a very experienced crew here. typical for companies that have that ambition is uncapitated, incentive compensation, right? I mean, get paid less, up-sell quota, and then get paid much more beyond quota. We do some things that, again, that I think are typical that introduced some non-linearity into the pay scale, right? The more you beat your quota, the more you get paid beyond the percentage that you beat and the more you miss your quota, the less you get paid beyond the percentage that you missed by, right? So it's a culture that rewards high performance I don't think there's anything crazy about it, but it's just the opportunity that these hunter style reps can see coming from a large, more established company they can see the opportunity here.\n\nAnd some of our competitors have been bought and then bought again, and then we've been bought again. And they wind up working for big pharma or big giant medtech that's a different story than working for a hungry, nimble, agile, mobile, a little bit hostile, company like TELA Bio right? And I think that permeates the culture. We try to create a superbly supportive environment. We have your back, is one of the things that we say all the time.\n\nThat's our piece of the equation, and your piece of the equation is you got to deliver. We believe in transparency, understanding what's going on, you're part of the team, we're supportive, and we're building a great culture. And I think that culture is attracting people, both internally and in the commercial organization, and this culture construction is very intentional. And the reason why I'm waffling on about it now is because I hope people are listening, and consider this an invitation.\n\nIf you have what it takes and you want to be a part of this culture, contact us. Thanks for the advertising time, Dave.\n\nDave Turkaly -- JMP Securities -- Analyst\n\nI'll send my resume. I guess, as a quick follow-up, you mentioned the 100,000 or so deferred hernia procedures. I guess, what are your thoughts on timing in terms of how fast you work through that backlog? I imagine that's the market backlog, but is this something you think you get through this year? Or is this something that drags on?\n\nRoberto Cuca -- Chief Operating Officer and Chief Financial Officer\n\nSo did interesting conversation with a hospital administrator a couple of days ago in part to validate the size of the backlog that we'd estimated, and he did confirm that that's reasonable to him, and then to talk to exactly what you just asked. So he made the point that to work through a backlog, if you're getting additional new patients in at the same rate you previously did, you have to be doing surgeries at more than 100% of the rate that you did pre-COVID-19 because you have to do both the surgeries that come in the normal course and then dip into that backlog and work it down. What he said is that his hospital is doing something on the order of 80% to 85% of what they were doing pre-COVID-19, and that he sort of other hospitals doing even less than that. So at those rates, you're not working through much of the backlog.\n\nI mean, some of those patients are getting their hernias repaired, but you're contributing and expanding potentially the backlog because you're not doing even 100% of what you're doing before. The additional point he made is that many of those patients who are in the backlog by deferring their hernias are coming in with larger hernias that require, in some cases, more invasive procedures. So that's kind of a long run about way of saying that the backlog is not going to get worked through very quickly. It's going to require getting back to prior staffing levels with hospital plus, and we don't see that happening anytime soon.\n\nBut we expect that all of the backlog patients and all the new patients are going to be ripe for use of our OviTex products.\n\nDave Turkaly -- JMP Securities -- Analyst\n\nYeah, it sounds like there could be some potential upside there as we look ahead. And so, thank you for that.\n\nTony Koblish -- President and Chief Executive Officer\n\nYeah, thanks, Dave.\n\nOperator\n\nThank you so much, everyone. And I would now like to turn the conference back to Tony for closing remarks.\n\nTony Koblish -- President and Chief Executive Officer\n\nThanks, Louay. Thank you, everybody, for joining us this evening. We appreciate your interest in TELA Bio. We look forward to meeting up with you again in about three months' time.\n\nThank you.\n\nDuration: 0 minutes\n\nLouisa Smith -- Investor Relations\n\nTony Koblish -- President and Chief Executive Officer\n\nRoberto Cuca -- Chief Operating Officer and Chief Financial Officer\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nUnknown speaker\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nChris Howerton -- Jefferies -- Analyst\n\nDave Turkaly -- JMP Securities -- Analyst\n\nMore TELA analysis\n\nAll earnings call transcripts"
}