{
  "companyName": "SolarEdge Technologies",
  "companyTicker": "SEDG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/solaredge-technologies-sedg-q3-2022-earnings-call/",
  "content": "SolarEdge Technologies (SEDG 0.93%)\nQ3 2022 Earnings Call\nNov 07, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the SolarEdge conference call for the third quarter ended September 30, 2022. This call is being webcast live on the company's website at www.solaredge.com in the Investors section on the Event/Calendar page. This call is the sole property and copyright of SolarEdge with all rights reserved, and any recording, reproduction, or transmission of this call without the expressed written consent of SolarEdge is prohibited. You may listen to a webcast replay of this call by visiting the Event/Calendar page of the SolarEdge Investor website.\n\nI would now like to turn the call over to Erica Mannion at Sapphire Investor Relations, investor relations for SolarEdge.\n\nErica Mannion -- Investor Relations\n\nGood afternoon. Thank you for joining us to discuss SolarEdge's operating results for the third quarter ended September 30, 2022, as well as the company's outlook for the fourth quarter of 2022. With me today are Zvi Lando, chief executive officer; and Ronen Faier, chief financial officer. Zvi will begin with a brief review of the results for the third quarter ended September 30, 2022.\n\nRonen will review the financial results for the third quarter followed by the company's outlook for the fourth quarter of 2022. We will then open the call for questions. Please note that this call will include forward-looking statements that involve risks and uncertainties and that could cause actual results to differ materially from management's current expectations. We encourage you to review the safe harbor statements contained in our press release and the slides published today for a more complete description.\n\nAll material contained in the webcast is the sole property and copyright of SolarEdge Technologies with all rights reserved. Please note this presentation describes certain non-GAAP measures, including non-GAAP net income and non-GAAP net diluted earnings per share, which are not measures prepared in accordance with U.S. GAAP. The non-GAAP measures are presented in this presentation as we believe that they provide investors with the means of evaluating and understanding how the company's management evaluates the company's operating performance.\n\nThese non-GAAP measures should not be considered in isolation from, as substitutes for, or superior to financial measures prepared in accordance with U.S. GAAP. Listeners who do not have a copy of the quarter ended September 30, 2022 press release or the supplemental material may obtain a copy by visiting the Investors section of the company's website. Now, I will turn the call over to Zvi.\n\nZvi Lando -- Chief Executive Officer\n\nThank you, Erica. Good afternoon, and thank you all for joining us on our conference call today. This quarter, we saw record revenues for the company, led by record revenues from our global solar business driven from significant growth in Europe. In aggregate, we shipped this quarter a record 2.7 gigawatts of our DC-optimized inverter solution and 321 megawatt hour of residential batteries.\n\nThis quarter, we shipped 6.1 million optimizers and 265,000 inverters, representing quarter-over-quarter growth of 16%. We're happy with this increased output from our factories following the COVID-related challenges we experienced in the first half of the year in Vietnam and China. However, the demand for our products still outpaces our production and supply chain capacity. We are working hard to close this gap through the further ramp of production in our new Mexico facility and capacity increases in other locations.\n\nOn this note, in light of the recent IRA legislation and the increased demand from the U.S. market, we are aiming to establish manufacturing capability in the United States within 2023 and are in active planning and site selection process. Our revenue growth this quarter is mostly driven by strong momentum in Europe, where revenues grew by 42% from last quarter and by 90% compared to the same quarter last year. In particular, growth was strong in the largest European market of Germany, where revenue grew by 125% quarter over quarter and in the Netherlands, France, and the U.K., all with record quarterly revenues.\n\nWe expect the strong momentum in Europe to continue into 2023 and are seeing an elevated level of new orders coming from our channels to prepare and support this continued growth. In the third quarter, we prioritized shipments to Europe in light of the challenging winter expected there. This quarter, revenues in the U.S. were lower than the previous quarter.\n\nGiven the constrained capacity environment, we prioritized the supply to the European residential market, as mentioned earlier. In the U.S. commercial segment, however, this was a record quarter of inverter and optimizer shipments with an increase of 10% from the last quarter. This is the fourth consecutive quarter of double-digit growth in our commercial megawatt shipments to the U.S., reflecting the market momentum and our position in this market.\n\nWe expect this growth dynamic in the United States commercial market to continue into 2023. Outside of Europe and the United States, we also had record quarterly shipments in Taiwan and South Africa and good momentum in quarter-over-quarter growth in Australia. From a segment perspective, this was a record quarter for megawatt shift in both residential and commercial, as well as megawatt hours of battery shipments. In the commercial segment, which grew 12% quarter over quarter in megawatts shipped, we are seeing growth of installations in an increasing number of diverse applications such as floating PV where we commissioned this quarter several large projects in Israel and Taiwan and the agro or agricultural PV application aimed at dual use of land for solar generation and growth of crops.\n\nWe are engaged in several such projects in Europe and Asia and see this as a potential high-growth application for the future. Overall, our demand globally continues to be strong. Point-of-sale data from our distribution channels are at record levels and growing month over month, and our focus is to increase factory output to meet the demand efficiently and with less need for expedited shipments in order to continue the margin improvement we have seen this quarter. Shifting to products.\n\nOur battery shipments grew this quarter in line with our plans and reached a record 321 megawatts hours, driven primarily by our shipments of the three-phase battery that we announced last quarter. This demand is coming primarily from Germany and other three-phase European countries, spurred by the increase in energy prices and the growing demand for backup and independence from the grids. For our single-phase battery, we are seeing good demand from Australia, South Africa, and the U.K., countering slower-than-projected growth of battery attach rates this quarter in the United States. That said, in this quarter, the amount of our single-phase batteries in the United States that were installed and connected to our monitoring portal was double that of the previous quarter.\n\nOn the optimizer side, we recently announced the release of our new Sense Connect technology that detects temperature increase at the connector level to prevent potential electric arcs. By detecting and reacting to abnormal connector overheating that may happen due to faulty installations or connectors, our Sense Connect technology stops power flow before an arc can occur. With module-level site visibility, operation and maintenance providers are informed of the pinpointed location of the connector, so repairs can be conducted swiftly and easily. This helps maximize system safety, uptime, and reduces operational costs.\n\nThe Sense Connect technology is in addition to our wide range of safety features, among them the safe DC technology and rapid shutdown. Additionally, this quarter, we announced the release of our SolarEdge Home Load Controller. This is a wireless device that is designed to optimize energy consumption by controlling heavy-load home appliances. The Load Controller is easy to install, enabling remote and automatic control of home appliances such as heat pumps, EV chargers, pool and well pumps HVAC, and others.\n\nThis technology enables homeowners to increase their self-consumption by using excess energy that would otherwise be lost and extend their battery backup time during grid outages. Once installed, the Load Controller seamlessly integrates with our mySolarEdge app, enabling homeowners to control loads directly from their smartphone. For homeowners, this means that they can now schedule and track their solar energy production, battery storage level, grid services if they have connectivity, and solar cell consumption. The SolarEdge home operating system calculates energy usage and savings according to personal preferences while considering external factors such as weather events and utility rates.\n\nAlso, this quarter in grid services, we joined the Rocky Mountain Power Wattsmart program, making us one of the two battery suppliers selected thus far for this program. The program provides customers in Utah and Idaho, who enrolled with the SolarEdge home battery, a significant enrollment incentive, and additional monthly incentives. We are already seeing positive interest among existing SolarEdge battery owners and new potential installations. Together with this program, we have, to date, more than 20,000 systems under various grid services and data programs globally.\n\nIn this context, our financial results this quarter reflect the capital gain from a sale of shares from an investment we made about 18 months ago in a grid services company that materialized. Moving to our nonsolar business. In South Korea, the ramp of our Sella 2 factory is on schedule, and we began mass production and are shipping sales to customers in small quantities this quarter. Our e-Mobility revenues are at a steady but reduced rate, much in line with the overall automotive industry supply chain-related instability.\n\nAnd with this, I hand it over to Ronen, who will review our financial results.\n\nRonen Faier -- Chief Financial Officer\n\nThank you, Zvi, and good afternoon, everyone. This financial review includes a GAAP and non-GAAP discussion. Full reconciliation of the pro forma to GAAP results discussed on this call is available on our website and in the press release issued today. Segment profit is comprised of gross profit for the segment, less operating expenses that do not include amortization of purchased intangible assets, impairment of goodwill and intangible assets, stock-based compensation expenses, and certain other items.\n\nTotal revenues for the third quarter were a record $836.7 million, a 15% increase compared to $727.8 million last quarter and a 59% increase compared to $526.4 million for the same quarter last year. Revenues from our solar segment, which includes the sales of residential batteries, were a record $788.6 million, a 15% increase compared to $687.6 million last quarter and a 65% increase compared to $476.8 million for the same quarter last year. This quarter, our shipments, while up significantly from the last quarter, are still constrained by manufacturing capacity and not by demand. And as noted by Zvi, we channeled more residential products to Europe in advance of the energy challenges expected there this winter.\n\nAs such, the geographical mix presented does not necessarily represent the level of demand we see in each region. As we continue to ramp Mexico, we expect to close the supply gap to the United States. Solar revenues from the United States this quarter were $251.6 million, a 19% decrease from the last quarter, and represented 32% of our solar revenues. Solar revenues from Europe were a record $475.7 million, a 46% increase from the last quarter, and represented 60% of our solar revenues.\n\nSales in Europe are typically denominated in euros, and therefore, the devaluation of the euro negatively impacted our U.S. dollar revenues and gross margin. Specifically, the impact of the euro devaluation in comparison to the average exchange rate of the last quarter is translated into a reduction of $31.7 million in revenues and 360 basis points of gross margins. Over the last quarter, we increased our prices in Europe, and we continue to adjust the prices to the devaluating euro.\n\nHowever, the impact of price increases typically lags by one or two quarters. Rest of the World solar revenues were $61.3 million, a 15% increase compared to the last quarter, and represented 8% of our total solar revenues. On a megawatt basis, we shipped 859-megawatt to the United States, a record 1.4-gigawatt to Europe, and 470 megawatts to the rest of the world, slightly surpassing 2.7-gigawatt of quarterly product shipment. 52% of the megawatt shipment this quarter were commercial products and the remaining 48% were residential.\n\nIn the third quarter, we continued to see an increase in revenues related to our batteries. Of the 321-megawatt-hour batteries we shipped this quarter, the majority were shipped to Europe driven by the strong adoption of the demand for our three-phase batteries. Average selling price per watt this quarter, excluding battery revenues, was $0.233, a 1% decrease from $0.236 last quarter. This ASP per watt decrease is mainly a result of a weaker euro and an increased portion of commercial products in the mix.\n\nWe expect to see an increase in ASP per watt over the next quarter resulting from our price increases in Europe and the United States. This quarter, two customers accounted for more than 10% of our solar revenues. One of these customers is a European distributor. In general, over the last quarter, we have seen a more even distribution among our top 10 customers.\n\nRevenues this quarter from our nonsolar business were $48 million. Consolidated GAAP gross margin for the quarter was 26.5% compared to 25.1% in the prior quarter and 32.8% in the same quarter last year. Non-GAAP gross margin this quarter was 27.3% compared to 26.7% in the prior quarter and 34% in the same quarter last year. Gross margin for the segment -- for the solar segment was 28.3% compared to 28.1% in the prior quarter.\n\nDespite the 360 basis points negative impact of the euro devaluation compared to the last quarter and the increased portion of batteries within our overall mix, this quarter-over-quarter increase in gross margin as a result of the price increases we have implemented globally and of our disciplined execution on the operational activities where the increase in manufacturing capacity, coupled with reduction in shipping prices, contributed 140 basis points of reduced shipping costs to our gross margin. In addition, this quarter, we saw component and commodity prices starting to decrease, which positively impacted our payments to contract manufacturers and vendors. And lastly, as our revenues continue to grow, we see efficiencies in our operation and support organizations due to economies of scale. We expect this phenomenon to continue into the next quarters.\n\nGoods subject to tariffs, excluding batteries, shifting to the United States from China accounted for 24% of our U.S. shipments this quarter. This is a decrease compared to 31% in the last quarter and is mainly attributed to the ramp of our manufacturing in Mexico. Gross margin of our nonsolar segment was 11.2% compared to 2.7% in the previous quarter.\n\nOn a non-GAAP basis, operating expenses for the third quarter were $108.3 million or 12.9% of revenues compared to $109.6 million or 15.1% of revenues in the prior quarter and $83.8 million or 15.9% of revenues for the same quarter last year. The main reason for this quarter-over-quarter decrease is the discontinuation of the Critical Power division operations, increased efficiencies in our e-Mobility division, and a favorable effect of the new Israeli shekel and other currencies against the U.S. dollar, which reduced our operating expenses as part of our expenses are paid in these currencies. Our solar segment operating expense as a percentage of solar revenues were 12.2% compared to 13.7% last quarter.\n\nWe expect to see increased efficiency in this ratio as our revenues continue to grow faster than our expense base. Non-GAAP operating income for the quarter was a record $120.2 million compared to $84.7 million in the previous quarter and $95.2 million for the same period last year. This quarter, the solar segment generated a record operating profit of $126.7 million compared to an operating profit of $99.2 million last quarter. The nonsolar segment generated an operating loss of $6.5 million compared to an operating loss of $14.6 million in the previous quarter.\n\nNon-GAAP financial expense for the quarter was $31.6 million compared to a non-GAAP financial expense of $20.9 million in the previous quarter. $35.4 million are a result of foreign currency devaluation against the U.S. dollars, the majority of which are noncash and nonrealized expenses. As a reference, euro cash balances and euro-denominated accounts receivable balances amounted this quarter to approximately 300 million and 500 million euros, respectively.\n\nThis amount was partially offset by interest income derived from our investments. Our non-GAAP tax expense was $34.5 million compared to $7 million in the previous quarter and $10.1 million for the same period last year. I would like to focus a little on our tax expenses and provide guidance on this for the coming quarters. Our corporate structure is such that the parent company of the group is in the United States Corporation, while the majority of our research and development activities are performed outside of the United States.\n\nBased on U.S. tax regulations, which recently went into effect, R&D expenses performed outside of the United States are to be capitalized for tax purposes and recognized over a period of 15 years as opposed to over a one-year period to date and a five-year period beginning next year if expenses are in the United States. The result is that of our $69.7 million of quarterly R&D expenses, approximately $64 million are not treated as an expense for U.S. tax purposes this year and will be amortized and expensed over a 15-year period.\n\nThis change in tax treatment creates a tax burden on our financials and will diminish year over year as the greater portion of our R&D expenses will be amortized for tax purposes. In addition, the impact of our lower stock price on our taxable income was lower this quarter as vested employee stock awards generated lower tax expenses. Under the current stock price, we expect the effective tax rate for the next quarter to be slightly lower, and this rate is expected to reduce year over year as our overall income increases and a higher portion of our research and development expenses are recognized for tax. GAAP net income for the third quarter was $24.7 million compared to a GAAP net income of $15.1 million in the previous quarter and $53 million in the same quarter last year.\n\nOur non-GAAP net income was $54.1 million compared to a non-GAAP net income of $56.7 million in the previous quarter and $82.1 million in the same quarter last year. GAAP net diluted earnings per share was $0.43 for the third quarter compared to $0.26 in the previous quarter and $0.96 for the same quarter last year. Non-GAAP net diluted earnings per share was $0.91 compared to $0.95 in the previous quarter and $1.45 in the same quarter last year. The financial expenses related to foreign exchange had a negative impact of approximately $0.37 on our non-GAAP EPS.\n\nTurning now to the balance sheet. As of September 30, 2022, cash, cash equivalents, bank deposits, restricted bank deposits, and investments were $1.6 billion. Net of debt, this amount is $937.6 million. Accounts receivable net increased this quarter to $785.3 million compared to $669.1 million last quarter.\n\nAs of September 30, our inventory level net of reserve was at $561.4 million compared to $470.3 million in the prior quarter, mainly a result of higher raw material level, some of which are related to the ramp of our Sella 2 factory. Turning now to our guidance for the fourth quarter of 2022. We're guiding revenues to be within the range of $855 million to $885 million. We expect non-GAAP gross margins to be within the range of 27% to 30%.\n\nWe expect our non-GAAP operating profit to be within the range of $115 million to $135 million. Revenues from our solar segment are expected to be within the range of $810 million and $840 million. Gross margins for the solar segment are expected to be within the range of 28% to 31%. I will now turn the call over to the operator to open it up for questions.\n\nOperator, please.\n\nOperator\n\nAbsolutely. [Operator instructions] And we'll move first to Brian Lee with Goldman Sachs. Please go ahead.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nHey, guys. Good evening. Thanks for taking the questions. I'm going to start off with margins since such a focus here for a while.\n\nIt seems like margins -- gross margins have soft. Would you agree with that assessment? And then maybe walk us through, Ronen, a breakdown a little bit of the 140-basis-point benefit you talked about. And then as you think about 4Q guidance, clearly, there's some slight improvement in your alluding to here. Just maybe walk us through that a bit what the drivers are? And then what else is on TAP, whether incremental from the 4Q drivers or new drivers that you think can kick in even after this quarter?\n\nRonen Faier -- Chief Financial Officer\n\nOK. Brian, thank you very much for the question. So, generally, yes, we do believe that moving forward, our gross margins are expected to continue and improve. And this is mostly driven by the fact that the reduction in gross margins other than the euro-related income that we have in Europe.\n\nAnd as you can see, Europe is becoming a very large portion of our revenues. Other than this, a lot of our gross margin reduction was coming from increased shipment costs that are a result of the disruptions that we had both in Q3 last year in Vietnam and one of our vendors in Q2 in China that actually stopped our operations in our factories. The last one in Q2 lasted almost six weeks. And that means that -- three weeks, sorry.\n\nAnd that means that we saw very strong demand that we could only fulfill by shipping rapidly to our customers using expedited shipments that are very expensive. And also, of course, additional payments that we needed to pay to our contract manufacturers due to underutilization. What we saw in Q3 was a combination of, first of all, a very disciplined operational work that we did in all of our factories, including the ramp that we do in Mexico that worked as planned. The result was that we were able to manufacture approximately and ship approximately 16% more products.\n\nAnd this, in turn, first of all, reduce the underutilization prices that we had to pay to our contract manufacturers. In addition to this, we do see, on one hand, that prices of shipping costs or shipping are going down mostly on the regular shipments, not necessarily on expedited shipments. But lately, we also started to see that air freight prices are also going down. The combination of these prices that are going down with more production that we see from our factories that allowed us to reduce a little bit the expedited shipment, we still send many products in an expedited manner, but we did see a reduction allowed us to reduce the shipping cost by approximately 140 basis points.\n\nWe do expect that we will see an improvement there. The first thing is that we continue to increase the capacity in our factories. Mexico continued to ramp. And as we mentioned in previous quarter, we do expect that of the residential products, the majority, if not all of the products, will be at the rates that they can be shipped from Mexico by the end of the fourth quarter.\n\nThis is reducing substantially the times that it takes product to get to the United States and therefore, reduces the need in expedited shipments. In addition to this, of course, land shipments, at least in this environment, are not as expected as used to be overseas shipments before. The second thing is the fact that we are seeing also increasing the other factories, which in turn allows us to use less expedited shipments. On this, I would like to add more elements that are coming.\n\nOne is also economies of scale and efficiencies that we do see. We are able to grow our operations and our support organizations at a slower pace than the growth in revenues. And that in turn also creates a lower gross margin. So, to make the very long story short, combination of increased capacity, reduced shipments, and our ability to reduce the payments that we pay to our vendors are impacting this.\n\nAnd now I will add to the last element, and this is referring to your question about what will go into the next quarter, and this is actually our price increases. Over the last three quarters and especially in the last two, we have increased our prices to cope with the devaluating euro. Usually, we see a lagging effect of about one to two quarters of the price increases simply because of the fact that mostly these are done on shipments that are relatively newer or new orders. And that means that we believe that by Q1, most of the increases that we implemented in the third quarter and those that we implemented early fourth quarter will mature.\n\nSo, in general, I think the motive is that we expect to be by the end of the second quarter of '23 in the very neighborhood that we guided to during the Analyst Day last March.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nI appreciate all that color. And my second question was going to be around the battery shipments. I thought last quarter, Ronen and Zvi, it sounded like you were implying more of a flattish sequential trend. So, over 300 megawatt hours of volume seems quite here.\n\nMaybe talk to some of the near-term demand trends you're seeing for the battery segment. And then that transition, what that is looking like from your Korean supplier to sell it to maybe the timeline? And then what do you think it means for volumes and margins off of these levels? Thanks.\n\nZvi Lando -- Chief Executive Officer\n\nSo, I think, as we alluded, Brian, during the conversation, we introduced the three-phase battery a quarter ago aimed for the European market, in particular, Germany, but not only as well as some of the other European three-phase markets. And the demand there is obviously going up dramatically, and the batteries are typically going with inverters, either inverters that are already shipped and installed and we're waiting for batteries or new inverters that shipped this quarter. So, with our ability also to increase the output of inverters that pulled with it additional volumes of batteries, beyond those that were targeted for inverters that were installed previously. So, this double effect led to a very strong demand, which we were able to meet and that's the result of the increase that you saw.\n\nAnd as we commented on the single phase, the rate of shipment with the main market over there is the United. In the United States, the rate of shipment was slightly down, but that was partially covered by the fact that we introduced the single-phase battery also in some Rest of the World countries, the U.K., South Africa, and Australia, and we're seeing good acceptance there. So, between those phenomena and the two types or the two families of batteries that we're offering, we saw the increase to this 320-megawatt hour. Obviously, none of these batteries today are using Sella 2 cells.\n\nWe're just beginning the ramp right now and beginning to ship cells to some of our cell strictly so customers, not yet were still going into the early phases of qualification at the battery level. And we're still probably a few quarters away from a big portion of our battery shipments being based on our Sella 2 cells. But obviously, our long-term intent, as we've communicated all along is to maximize usage of our own cells while continuing to maintain a certain portion and active relationships with other cell providers to give us the flexibility in volumes and technology that we're aiming for.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nAll right. Thanks a lot, guys. I'll pass it on.\n\nRonen Faier -- Chief Financial Officer\n\nOK. Thank you. Thanks, Brian.\n\nOperator\n\nAnd we'll take our next question from Mark Strouse with J.P. Morgan. Please go ahead.\n\nMark Strouse -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks very much for taking our questions. Just wanted to go back to the commentary you made about potentially setting up U.S. manufacturing.\n\nUnderstand plans are still being finalized there, but just any more color how we should think about that? Would that be for solar product or potentially storage as well? And kind of -- is that something that you're waiting on the specific guidelines from treasury? Or could we potentially see an announcement being made sooner than that?\n\nZvi Lando -- Chief Executive Officer\n\nSo, I'm not sure that we can get into much detail other than suggesting that we're doing both things in parallel. So, obviously, to select a location, to define the processes, etc., it takes time. And we're doing it based on the preliminary assumptions as to the final -- or the preliminary version of the regulations. But since we understand that there is a good chance that there will be some even significant changes in the regulations, we probably won't close anything on -- from a production site and production plan point of view until that is clear.\n\nSo, we're running both elements in parallel with a lot of focus and sense of urgency. And as things become clear from both sides, we'll be able to give a better picture. But for now, I think it's just -- we're focused on it, we're tracking the regulations. And we're going through the process of planning and site selection.\n\nThe assumption is based on the current regulation that it is likely we'll be focused on inverters and optimizers, at least in the first phase, and not related to batteries.\n\nMark Strouse -- JPMorgan Chase and Company -- Analyst\n\nOK. Thanks. And then, Ronen, just real quick. I'm sorry if I missed this.\n\nThe 4Q guidance, did you say what level of euro you're baking in there?\n\nRonen Faier -- Chief Financial Officer\n\nThe level of euro, we're basically looking at about $0.98 per euro.\n\nMark Strouse -- JPMorgan Chase and Company -- Analyst\n\nOK. That's it for us. Thank you.\n\nRonen Faier -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nAnd we'll take our next question from Colin Rusch with Oppenheimer. Please go ahead.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThanks so much, guys. Could you talk a little bit about the volume of energy storage products in the channel? And how much of what you shipped during the quarter was able to sell through during the quarter?\n\nZvi Lando -- Chief Executive Officer\n\nYeah. So, unlike on the inverter and optimizer, the channels are very empty and days on hand are very low. On batteries, particularly on the single phase, the channel is more robust with -- and not on the edge. And that's part of the reason, especially on the single phase that there weren't that many shipment this quarter compared to the three-phase battery shipments where the channel is not -- is still not loaded.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nOK. That's helpful. And then in terms of the tax rate and how we should think about that going forward? You talked about a cadence of some step-downs, but you had pretty compelling tax rates historically. Could you talk a little bit about how we should be thinking about the step-down in tax expense, particularly as you have a little bit more robust operation in the U.S.\n\nhere? Are you able to offset some of the net spending as U.S. R&D and any capacity to start lowering that tax rate?\n\nRonen Faier -- Chief Financial Officer\n\nOK. Sure. So, first of all, again, I'll just explain a little bit. The vast majority of the impact that we saw this quarter is, although it started in the last quarter and it was already baked in, in a sense, but is the fact that under new regulations, the R&D that is performed outside of the United States is amortized over 15 years and not recognized immediately.\n\nThis is something that was actually legislated in the -- under the previous regime, but -- and was supposed to go away as part of the build back better plan together with the plan disappeared to. And therefore, what we see today is that the vast majority of R&D that we are doing today are simply not the taxable income. This year, we're talking about approximately $240 million of R&D expenses that are happening mostly outside of the United States, so you can see the impact. What we also saw this quarter, usually, we have a very strong expense related to the vesting of employee stock options as a result of the stock price.\n\nAnd now, when the stock price is about 30-something percent less than it was just a quarter ago, we also see a little bit of lower income. And that, of course, creates -- sorry, lower tax expense, and this creates a relatively high taxable income. The rate that we're going to see forward is going to be dependent on three major items. First one is how quickly we will grow our operating income.\n\nAnd we need to remember that this quarter, the rate was inflated also due to the fact that we had very high interest expenses or currency exchange expenses, and this is something that, of course, created also very large tax rate, I would say, compared to what we saw before. So, the first thing that we -- is going to be impacted is how quickly our operating profits are going to grow, we expect this to continue to happen. Second is the fact that every year, more percentage of our R&D expenses will be allowed for taxes. And lastly is the stock price that we cannot project.\n\nI would say that if we see north of 40% tax rate in the third quarter, next quarter should be, I would say, between 30% to 35%, again, dependent on the stock price. And from that point, it's supposed to go down as we move forward. Operations in the U.S. will not help it a lot.\n\nWe need to remember that under the IRA, and again, regulations are not out, so I'm not sure how does tax benefits from manufacturing will look like, especially given the fact that at least right now, we see that some of them can be granted as a cash payment instead of just tax credit. And therefore, I do not know how to project this. In general, within the next few years, we should go back to the normal, but it is going to take at least, I would say, six to seven years to around 20%. The one thing I would say is a little bit -- when you look at American corporations next year, R&D in the U.S.\n\nis going to be also amortized for five years. So, in general, what we will see for operations done outside of the United States and inside the U.S., the results will be a little bit more similar than they are today.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThat's incredibly helpful. Appreciate the detail. Thank you.\n\nOperator\n\nAnd we'll move next to Philip Shen with ROTH Capital Partners. Please go ahead.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nGuys, thanks for taking my questions. First one, to follow up on the U.S. manufacturing, I know you can't make any final decisions until we get clarity from the treasury department. But can you help us understand how much in terms of gigawatts for the inverters you might be contemplating? Are we talking about maybe two to four gigawatts of U.S.\n\nmanufacturing? And then what's your latest view on the difference between the microinverter and the resi inverter credits, $0.11 versus the $0.065 per watt? What's the probability that you think you guys might be able to secure that $0.11 per watt? Thanks.\n\nRonen Faier -- Chief Financial Officer\n\nOK. So, maybe I'll start with the first one, and Zvi will answer the second one. In general, the capacity that we plan is to fulfill the U.S. demand from the United States.\n\nThis is something that I would just mention that -- and we discussed in the past, we believe that over time, since our products are a large volumetric and relatively heavy, especially when you talk about batteries, we would like to have a manufacturing site in most of our biggest continents or if possible, the biggest countries in which we operate. So, in a sense, manufacturing in the U.S. for the U.S. makes sense operationally better than anything else.\n\nThe thing that stopped us from doing it right now was the fact that economically, this was less relevant. Once the IRA is there and assuming again that the overall regulations will be sufficient to justify manufacturing in the U.S., it is our intention to make the production in the U.S. of everything that goes to the U.S. If it's going to be inverters, it will be inverters.\n\nIf it's going to be also optimizers, it may be also optimizers, but that's the most favorable thing. And TV, Zvi, maybe you will comment about the microinverters in.\n\nZvi Lando -- Chief Executive Officer\n\nYeah, fairly. As you know, the act was passed through Congress quickly. And it's no secret that there are a lot of clarifications that are needed. And actually, even the technical definitions, as they are written right now, are not that clear cut in terms of their applicability to one technology versus the other.\n\nSo, together with many other companies, we're involved in reviewing and working with the relevant regulators for appropriate clarifications. And we are quite confident that it will end up being clear and consistent across the various technologies in terms of the way the regulations are applied.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nGreat. Thanks to you both on that. And then a couple of housekeeping questions. First one is on battery megawatt hours recognized in revenue.\n\nCan you share what it was for Q3 and then what might be expected for Q4? And then also in the quarter, Q3, you guys had some higher finance expenses. Can you give a little bit more color on that? And then also, how should we think about how that line item evolves in Q4 and beyond? Thanks.\n\nRonen Faier -- Chief Financial Officer\n\nOK. So, we'll go on by one. First of all, in the Q that will be filed over the next year or two, you'll see the recognized revenues, which were approximately $167 million from batteries. And of course, they're all there, but that's the number.\n\nFrom a tax point of view -- sorry, from interest expenses and finance expense and point of view, again, it's a matter of how does the euro behave against the U.S. dollar. We saw a move that was very strong at the beginning of the last quarter, where the euro devaluated sharply against the U.S. dollar.\n\nActually, over the last, I would say, almost two and a half months, we see relatively stability -- relative stability in this rate. As long as the euro is staying within the range of $0.98 plus/minus, the impact on finance income or expense should be very, very small. Of course, once the euro is getting stronger against the U.S. dollars, we're benefiting because, as I mentioned in the prepared remarks, we have today over 800 million euros or euro-denominated balances on our balance sheet, and therefore, simply take $800 million and take the difference in the quarter, and you'll see exactly what's going to be the impact.\n\nAnd if the euro goes down, then, of course, we are hurt by this impact. What it seems, at least to us right now, looking at interest rates, both decorations from the Fed and the Central European bank is that it seems to be a little bit more stable. And as such, we should see -- when neutralizing FX impact, actually, interest income due to the fact that we do generate several millions of dollars quarterly on our investments.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nGreat. Thanks for the color.\n\nOperator\n\nAnd we'll take our next question from Michael Blum with Wells Fargo. Please go ahead.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nThanks, guys. I wanted to go back to the cadence of gross margins over the next few quarters just to make sure I understand. And I just throw all my questions into one. Do you expect to still have to be paying expedited shipping costs in Q4? And if so, when do you think you'll no longer be paying those expedited shipping costs? And then on the batteries, I know, I think last quarter, you said the gross margins were somewhere around 15%.\n\nSo, I'm wondering where that stands right now. And when would you expect to get to that 25% target? Thank you.\n\nRonen Faier -- Chief Financial Officer\n\nThanks for the questions, Michael, and I'll go one by one. In general, expedited shipments are mainly a result of limitation of supply compared to the demand that we see. And we do expect them to diminish and be reduced toward the second -- end of the second quarter of 2023, where the biggest issue there is actually the ramp-up of our Mexican facilities that will require less overseas shipments going into the United States and will also free the capacity that we have today in China, Vietnam, Israel, and Europe for shipments in Europe itself. So, in general, we do expect those to reduce.\n\nI'm not sure that they will ever disappear completely because we need to understand that expedited shipments are sometimes even related to the needs of customers at that point. For example, at this point of time, and as Zvi mentioned, anyone talk about the expected winter in Europe. And when we see customers that are striving for products, we try to expedite shipments to them and also make sure that they're meeting the installation cycles that are very much reduced during the winter there. So, I think the expedited shipments will always be there for sure not to the extent that they are today.\n\nAnd therefore, I believe that the relief will be gradual but ever-growing toward the second quarter of 2023. Just remind in one of the previous questions, we expected time to be within gross margins that we guided during the Analyst Day being the 28% to 30% on the corporate level and 30% to 32% on the solar level, and we keep feeling comfortable around this. So, that's on expedited shipment. And please remind me the second one.\n\nZvi Lando -- Chief Executive Officer\n\nGross margins of batteries.\n\nRonen Faier -- Chief Financial Officer\n\nGross margin of batteries, thanks Zvi. So, gross margins Of batteries. Gross margin of batteries, yes -- thanks, Zvi. So, gross margins of batteries, we're aiming at 25%.\n\nLast quarter, as you mentioned, it was 15%, with the growing volumes and especially three-phase batteries that are going to Europe where -- we believe today that the pricing is a little bit more reflecting a little bit better margins. We're not yet there at 25%, but this is certainly on the way to get there. So, in general, we do see an improvement there. 25% gross margin is still the target there.\n\nI would like also, by the way, to mention one more thing, Michael, and everyone related to the previous question about expedited shipments. And of course, my answer is given the assumption that COVID is no longer with us. However, as you know, it's still in China, COVID is still very much present, and also very restrictive measurements taken against Covid. Recently, we heard of a little bit of eruptions in China, not yet or not impacting us.\n\nBut of course, everything that I say is contingent with China continuing to operate normally.\n\nOperator\n\nAnd we'll take our next question from Kashy Harrison with Piper Sandler. Please go ahead.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nGood afternoon, and thanks for taking the questions. So, first one for me, how much capacity do you currently have on a megawatt basis? And how does that number change once the Mexico facility is fully online? And then I had a follow-up question.\n\nZvi Lando -- Chief Executive Officer\n\nYeah. So, Kashy, thanks for the question. We don't give exact number on that. But to be clear, the limitation is less capacity-related and more supply chain-related.\n\nSo, to be able to ramp some of our suppliers, in particular, on some of the components where we are competing with electrical vehicles, in most cases, that's where our limitations are and that is where we are working to qualify alternatives and to get larger allocations and that was reflected in the growth that we saw this quarter and the growth that we're targeting for next quarter and beyond. It also involves increasing capacity and production lines and testing equipment. But at first proximation, the limitation is around component and component supply.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nThat's very helpful. Thank you. And as my follow-up, I wanted to ask about cash flow from ops. Working capital has been a big use of cash year to date.\n\nAnd it looks like your cash conversion cycles are, I think, a bit higher than they were back in 2019 in the pre-COVID environment. And so, just wondering, Ronen, as you look at this business moving forward, how are you thinking about cash conversion cycle, DSO, and so forth?\n\nRonen Faier -- Chief Financial Officer\n\nOK, sure. So, first of all, you're correct. This year, we see a little bit of a slower cash conversion. The two reasons for these are: one, is the fact that we do see an increase in our inventories.\n\nAs you will see, we had several million -- tens of millions of dollars of inventory just increasing this quarter, both a result of our, I would call it, passion to avoid what we call the golden screw, the one crew that you don't have that eliminate you from making a whole product. And that means that we're simply building inventories to make sure that we have as stabilized as possible manufacturing capacity. And also, by the way, this quarter, we sold approximately 40% -- $40 million more inventory just related of materials coming into Sella 2 of the production that we see there. This is the main usage of cash, and I add to this, the Samsung cell that we're buying.\n\nOn top of this, we also see that as some of our customers are experiencing longer time of shipment from our factories to theirs, or in some cases, we see lengthening times of inventory spend on ship simply because the shipping time from China to the U.S. extended in some cases to 12 weeks from seven. This is also extending very much the cash cycle. We expect this to revert in 2023.\n\nThe first issue is given the fact that we do see some relief on the components front, as Zvi mentioned, in the first area. And also due to the fact that we are stabilizing our manufacturing, over time, we will be able to build inventories in the various locations, and then we're going to have less working capital used. And also again, in Mexico, where instead of spending close to sometimes 90 days on a boat, you see products simply spending 10 days on a truck. The combination of all of this should return, I would say, by the later part of 2023 to a situation where our cash generation is very similar to the non-GAAP profit.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nAnd we'll take our next question from Julian Dumoulin-Smith with Bank of America. Please go ahead.\n\nAlex Vrabel -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. It's Alex Vrabel on for Julian. Just one more, if I may, just to sort of like follow on or sort of close out this margin discussion. Ronen, I think in the past, you've been really open about sort of characterizing what the headwinds are today as far as logistics and expedited shipping base and kind of how you see those things rolling off.\n\nSo, with that in mind, I mean, looking at what you mentioned as far as your tariff volumes, it looks like Mexico is pretty early in the ramp stage. You're still targeting full volume or full resi volume from that facility by year-end. I'm wondering, looking at the next quarter and sort of the one after that, I mean, can you break that down again for us as far as roll-off, logistics expense, and an ability to optimize around that, as well as potential carried drag from the component space? Thanks.\n\nRonen Faier -- Chief Financial Officer\n\nI'll try as much as I can with one correction, and this is the fact that Mexico has noted very early stages. This is actually the third quarter in a row that we are shipping products from Mexico in increasing volumes. And by the way, as a result, as I mentioned in our prepared remarks, only 24% of the products that we brought to the U.S. were bearing Chinese tariffs.\n\nI would just remind everyone that it was close to 80% at the beginning of the year. So, in that sense, Mexico is happening. It's on track, and this is definitely our aim to provide resi products at 100% from Mexico by the end of this year. And I think that we're on track.\n\nBy the way, there's always certain flavors that you need to bring from other places because we have many flavors of inverters. So, on that front, actually, Mexico is going as planned. From shipping costs and headwinds, we used to see in the past. As we mentioned in the last quarter, approximately burden of 600 basis points compared to about a year ago.\n\nThat was at the end of Q2. As we mentioned this quarter, about 140 basis points of this burden were taken away. And we believe that we can take until the end of the second quarter of '23, I wouldn't say all but a substantial part of the remaining amount. And this is a pure result of the fact that we do have more capacity and we're able to basically have a more predictable manufacturing that allows us to better plan the capacity with our customers.\n\nSo, on that front, we definitely see an improvement. As it comes to the 301 tariffs, we mentioned before that that's about 100 basis points load. Now it is going and diminishing. And it will not go to zero because today, some of our, at least commercial products, are still manufactured outside of the United States, but they will move also over time to other locations that are not bearing tariffs, and this will happen during 2023.\n\nAnd I also mentioned in the past that there are two areas that we cannot control. One, of course, is the issue of foreign exchange rates. We do increase prices in order to overcome it. But sometimes, we see that there is a little bit of a lag here.\n\nAnd we cannot always control the mix of our products given the demand that we see. Again, reiterating my previous answers, we feel comfortable with the fact that we can get closer or to be at the analyst day guided margin by the end of the second quarter of '23.\n\nAlex Vrabel -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Super helpful. Thanks for the clarifications there. Just one follow-on.\n\nI mean, if you make -- I mean, can you expand a little bit more on the demand trends you're seeing between single-phase and three-phase? I think you're really the third in the U.S. market to announce and sort of flag whether directly or indirectly, somewhat weaker demand trends. But curious if you can expand on that, what you're seeing and where you think that trends from here. Thanks.\n\nZvi Lando -- Chief Executive Officer\n\nYeah. So, let's start with a bit of a geographical spread. So, residential single-phase markets, the largest one is the U.S. The second largest one is probably the Netherlands.\n\nItaly is a single-phase residential market as is most of Australia, South Africa, and a few countries like that. So, it's not strictly only the U.S. And then three-phase, the large residential markets are Germany and associated markets around it like Austria and Switzerland. So, clearly, the countries that are -- it's not related to them being three-phase, but the countries that are three-phase residential markets like Germany, Austria, Switzerland, and a couple of smaller European markets, demand there is very, very strong.\n\nThe need is essential. And our market share position is good, and we believe that the offering -- and you always have to look at the combined offering. It's not strictly the battery. It's the combination of the battery and the inverter is well differentiated.\n\nSo, we feel -- we see the strong demand, and we feel comfortable about the expected growth in our ability to fulfill it. And attach rates over there are very, very high. So, almost every solar installation in these countries is going in with a battery. So, that's what's driving the high demand and attach rates.\n\nIn the single-phase markets, as I mentioned, the markets like Australia, South Africa, the U.K., Italy, are strong markets as well. And the demand there for single-phase batteries is strong. Nonetheless, there are still smaller markets compared to the United States and the Netherlands. If you take those very big single-phase residential markets, the Netherlands is still not a big battery market.\n\nIt is still with net metering and no -- as a result of that, no strong incentive for self-consumption. At the same time, our installed base over there is very, very big. And as we mentioned earlier, we had a record quarter this quarter as well. Eventually, as what happens in other markets, there is a good chance that in this market as well, there will be a need for batteries and then there's a huge potential to retrofit on the existing installed base.\n\nBut that is not something that is expected in the next -- in the short period ahead. If you look at the United States, which is obviously a big single-phase residential market, attach rates of batteries are increasing, but they're increasing at a slower rate than I think a lot of people in the market projected. And I mentioned that our installation rates have increased twofold from one quarter to the other, but still, the projections were for faster growth rate of attach rates of batteries. And as a result of that, also, as I mentioned to answering one of the previous questions, we have a little bit more inventory in the channel on single-phase batteries in the United States.\n\nTo -- we think that this is a phase of the market learning how to sell, how to install, prices stabilizing, and that the battery attach rate will continue to grow in the United States and possibly even accelerate, obviously, some of the acceleration might come from for the NIM. Three changes if they occur and if they occur in a way that encourages cell consumption. So, attach rates in the U.S. are slower than projected.\n\nThey're still growing relatively fast, and they have the potential to further accelerate going into the beginning of next year.\n\nAlex Vrabel -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you so much. Appreciate the color there.\n\nOperator\n\nAnd we'll take our next question from Jeff Osborne with Cowen and Company. Please go ahead.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nYeah. Good afternoon, and thanks for squeezing me in. A couple of questions on my end. I was wondering, Zvi, if you can go over what lead types are for both resi and commercial products in the U.S.\n\nand Europe, that would be helpful to understand. As the capacity is ramping up, what's going on there?\n\nZvi Lando -- Chief Executive Officer\n\nYes. So, as reflected in your question, it varies a little bit by product, probably on optimizers and single-phase inverters that's in the range of 12, 15 weeks or so. And on three-phase commercial products, it is a little bit longer than that, probably 18 to 20 weeks, roughly in the commercial three-phase inverters.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nGot it. That's helpful. And last question I had is just what do you attribute the share gains in the U.S. and the commercial side, too? I think you highlighted quarters of double-digit growth.\n\nZvi Lando -- Chief Executive Officer\n\nI think we've discussed this in the past. So, first of all, the market, I think a lot of people have been waiting for a long time for the U.S. rooftop market to wake up. And in a way, it's a huge untapped market.\n\nAnd I'm not sure that this is the -- it's completely released, but we're definitely seeing growth. And I think the forecasts are for further growth next year. And part of the drivers that we see are corporations investing in solar for a combination of ESG purposes, as well as because of the high electricity rates. And there, I think that we are in a good position as a cost-effective commercial solution with all of the safety requirements that this type of corporations might have.\n\nSo, that type of trend works in our favor. And additionally, in the last few quarters, we've introduced versions of the products that are more optimized for small ground mount community solar projects, and we're seeing growth of share in that segment, which is a growth segment as well. So, between the growth of the rooftop market and I believe we're in a position of gaining share in that market and the growth of the community solar. And clearly, over there, we know we're gaining share because our share previously was zero, and now we're shipping stuff to this segment.\n\nI think that's the -- that's where we are capitalizing on the opportunities.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nGreat. Thank you. That's all l have.\n\nOperator\n\nAnd we'll take our next question from Joseph Osha with Guggenheim. Please go ahead.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nHello. Hello, everybody. Just to return to Europe, obviously, there's significant disconnect between the megawatt growth and revenue growth, which I assume is mostly storage. I just wanted to check if that's correct or whether there's any ASP math going on, on the inverter side.\n\nAnd then just looking forward, wondering if we could continue to see that kind of disconnect in terms of storage driving growth in Europe well beyond what the megawatt volume on the inverters might suggest?\n\nZvi Lando -- Chief Executive Officer\n\nYes. So, that is part of the -- what makes it more difficult to strictly compare revenue to megawatts of shipments is batteries, but not only because Europe is also a very strong market, both in residential and in commercial. And also there, there can be a big variation from one quarter to the other, and also that has an impact on ASPs. But probably, that's a secondary effect to the battery effect that you recognized, which is going to be part of the mix a significant part of the mix going forward, yes.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nOK. So, we can -- all right. That's fair enough. And then looking at the U.S.\n\nmarket on single-phase storage, there's been something we're pointing about commissioning delays and whatnot. Do you all feel like there are some deliverables from your side in terms of additional software or tools to help that installation process? Or how are you working with your customers on that in the U.S.?\n\nZvi Lando -- Chief Executive Officer\n\nSo, actually, on that front, and we reported this in the past. In the past, we're actually seeing good commissioning times and we've invested a lot in training, and we see that as an advantage and not as a limiting -- limiter to adoption. As I said answering one of the previous questions from my conversations with customers, a lot of the adjustment or the progress will be coming from the whole channel learning how to sell batteries to explain the benefits to the consumers. And then also, obviously, through installation, and simplicity.\n\nBut I believe we are today with decent installation times, but we're still working on all of those elements to reduce it, to improve training, and to make the process even more seamless.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nOK. Thank you very much.\n\nZvi Lando -- Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] And we'll move next to Ameet Thakkar with BMO Capital Markets. Please go ahead.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nHi. Thanks for squeezing me in. Just one quick one for me. You guys mentioned a couple of times that you kind of expect to get back to that gross margins you played out at the Analyst Day by the second quarter of '23.\n\nI was just kind of wondering, in terms of the trajectory for the operating profit margins you laid out, what's the trajectory for that? It looks like your 4Q guidance implies that that's going to be kind of flat, I guess, the third quarter, despite a little bit better outlook on gross margins.\n\nRonen Faier -- Chief Financial Officer\n\nSo, in general, I mean, I'll start by the general trend and then go to the fourth quarter. The general trend is that while we will see -- as we mentioned, again, toward the end of the second quarter of '23 return to the guided margins we believe, at least, to the guided margins of the Analyst Day, this is usually on the heels of the fact that revenues are expected to grow and margins to improve and expenses will usually not grow at the same pace as revenues. And these expected to grow the overall operating margin. For Q4, specifically, the reason for the guidance, as it is right now, is because the Q3 operating expenses were impacted by the fact that we have closed some of our activities in the UPS division and also Critical Power division and our e-Mobility.\n\nAnd also, we had a little bit of a tailwind coming from currencies which we are not sure if it will continue into the fourth quarter. This resulted in actually lower operating expenses compared to the second quarter despite of the fact that we continue to increase in headcount. This will reverse in Q4. In Q4, we will go back to a growth trajectory.\n\nAnd here, of course, the main question and especially in the way that we're guiding is like take the careful margins of errors to any currency movements that may change us -- that may -- sorry, change a little bit the results and we're, of course, not in control. But in general, the trend is that the more we are going into the higher margin regime, again, we also go to lower regime of operating expenses as revenues and, therefore, higher operating margins.\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nAnd this does conclude the Q&A portion of the call. I would now like to turn it back to Zvi for any closing remarks.\n\nZvi Lando -- Chief Executive Officer\n\nThank you. So, in summary, we are pleased with the progress we made this quarter on all operational metrics and are looking forward to next quarter. And thank you all for joining us today. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nErica Mannion -- Investor Relations\n\nZvi Lando -- Chief Executive Officer\n\nRonen Faier -- Chief Financial Officer\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nMark Strouse -- JPMorgan Chase and Company -- Analyst\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nAlex Vrabel -- Bank of America Merrill Lynch -- Analyst\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nAmeet Thakkar -- BMO Capital Markets -- Analyst\n\nMore SEDG analysis\n\nAll earnings call transcripts"
}