{
  "companyName": "Atlassian",
  "companyTicker": "TEAM",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/atlassian-team-q1-2023-earnings-call-transcript/",
  "content": "Atlassian (TEAM -0.77%)\nQ1 2023 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and thank you for joining Atlassian's earnings conference call for the first quarter of fiscal 2023. As a reminder, this conference call is being recorded and will be available for replay from the investor relations section of Atlassian's website following this call. I will now hand the call over to Martin Lam, Atlassian's head of investor relations.\n\nMartin Lam -- Head of Investor Relations\n\nWelcome to Atlassian's first quarter fiscal year 2023 earnings call. Thank you for joining us today. Joining me on the call today, we have Atlassian's co-founders and co-CEOs, Scott Farquhar and Mike Cannon-Brookes; our chief revenue officer, Cameron Deatsch; and chief financial officer, Joe Binz. Earlier today, we published a shareholder letter and press release with our financial results and commentary for our first quarter of fiscal year 2023.\n\nThe shareholder letter is available on Atlassian's Work Life blog and the investor relations section of our website, where you will also find other earnings-related materials, including the earnings press release and supplemental investor data sheet. As always, our shareholder letter contains management's insight and commentary for the quarter. So during the call today, we'll have brief opening remarks and then focus our time on Q&A. This call will include forward-looking statements.\n\nForward-looking statements involve known and unknown risks, uncertainties and assumptions. If any such risks or uncertainties materialize or if any of the assumptions prove incorrect, our results could differ materially from the results expressed or implied by the forward-looking statements we make. You should not rely upon forward-looking statements as predictions of future events. Forward-looking statements represent our management's beliefs and assumptions only as of the date such statements are made, and we undertake no obligation to update or revise such statements should they change or cease to be current.\n\nFurther information on these and other factors that could affect our financial results is included in filings we make with the Securities and Exchange Commission from time to time, including the section titled Risk Factors in our most recently filed annual and quarterly reports. During today's call, we will also discuss non-GAAP financial measures. These non-GAAP financial measures are in addition to and are not a substitute for or superior to measures of financial performance prepared in accordance with GAAP. A reconciliation between GAAP and non-GAAP financial measures is available in our shareholder letter, earnings release and investor data sheet on the IR website.\n\nPlease keep in mind that we'd like to allow as many of you to participate in Q&A as possible. To facilitate that, we'll take one question at a time. Please rejoin the queue if you have another question or a follow-up, and we'll do our best to come back to you later in the session. With that, I'll turn the call over to Scott for opening remarks.\n\nScott Farquhar -- Co-Founder and Co-Chief Executive Officer\n\nThank you for joining us today. We are proud of our execution in Q1 against our long-term initiatives. We announced a new subscription offering in Atlassian Together, launched Atlas into general availability, and held Work Life, our first large-scale customer event focused on a single market. As you've already read in our shareholder letter, Atlassian is not immune to the broader macroeconomic environment, but we remain steadfast in our conviction that we have the right leaders, products and strategies in place to capitalize on incredible long-term opportunities in front of us.\n\nTurbulent markets provide an opportunity to shake up the leaderboards, and we're poised to play offense. We'll focus our investments to take share and strengthen our market position in this environment. We'll, of course, balance our continued investments with the overall growth of our business and be responsive to the macroeconomic conditions. We continue to have line of sight to $10 billion in annual revenue and believe we will come out of this environment in a much stronger market position.\n\nI'm incredibly thrilled to pass the CFO baton to Joe Binz, who I want to welcome to his inaugural Atlassian earnings call. He's only been here since early September, but has quickly gotten up to speed and will do far better than me in my short stint as interim CFO. With that, I'll pass the call to the operator for Q&A.\n\nOperator\n\n[Operator instructions] Your first question comes from Keith Weiss from Morgan Stanley. Please go ahead.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. I guess, kind of a top-line and a bottom-line question. You guys mentioned in the shareholder letter, and I appreciate the being upfront about kind of the macro impact you're seeing. Free-to-paid conversion slowed down and some of the paid, it sounds like NRR slowed down a little bit.\n\nWhat have you guys been seeing in kind of top-of-funnel trends? Is that kind of feeling as expected? Or did that slow down as well? And then, you are sustaining the operating margin guide for the full year, even with the revenues coming down a little bit. Where are the areas you guys are looking to get the increased efficiencies as we think about FY '23? Thank you.\n\nCameron Deatsch -- Chief Revenue Officer\n\nFirst off, this is Cameron. I'll speak to the top line for this and then hand off to Joe to talk about expenses. So yeah, as we mentioned previous quarter, actually back in our August earnings, we spoke about how -- while we are seeing plenty of people coming in and trying Jira, trying to our free versions of our product, and we continue to see that trend today, many more people coming in and signing up and using our products, we saw them starting to slow down, getting to that 11th user, entering their credit card information and becoming paid customers. So that trend definitely came through throughout the quarter, and we see it today where we still have plenty of people coming in.\n\nYear-over-year growth of our customers continues to grow, which is great, but just a little bit slower in the converting to actual paying customer. The new piece we saw in the previous quarter was that toward the end of the quarter, we actually saw user expansion in existing accounts. So this is largely people going from 100 users in confluence to 110 users, right? And that's largely due to company slowing down hiring, trying to constrain their own internal IT budgets and using more of the license they already have. Now we continue to see growth just that user growth wasn't nearly as strong as what we've seen historically.\n\nOn the other side, on top line, so while the user growth slowed down, we do continue to see migrations tracking along as planned, are additions working people from standard to premium and enterprise versions of our products, strong and cross-sell. Jira Service Management specifically continues to be adopted well. So while we are affected by basically hiring rates and how quickly people are adding people to their organizations, the big projects like migrations or choosing their new IT service management tools, we've seen no slowdown in those efforts to date. Joe, do you want to handle the expenses competition?\n\nJoe Binz -- Chief Financial Officer\n\nYeah, thanks, Cameron, and thanks, Keith. So there's really two focus areas. First and foremost, we're making reductions in our nonheadcount, driven discretionary spending. And then, secondarily, we'll be moderating the rate of planned headcount growth in the second half of FY '23.\n\nI'd say in terms of areas, Keith, I think there's efficiencies to be found across the board, whether you're talking about gross margins or process efficiencies or even resource allocation, right? Looking at where we have our resources allocated, make sure that we're constantly prioritizing investments and moving those resources with the highest ROI and most impactful things. And as Scott mentioned, this is all with an eye toward strengthening our position in the large, high-growth markets we're targeting and enabling us to emerge in a stronger position out of the downturn as we were going in. So hopefully, that gives you a sense, but I would say, it's very broad and based on those two primary principles.\n\nOperator\n\nYour next question comes from Michael Turrin from Wells Fargo Securities. Please go ahead.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey there. Thanks for taking the question. Appreciate it. And I'm sure it's going to be somewhat of a similar construct to the first one, but I'll ask a little bit differently.\n\nSo a couple of parts. The first one is just clarifying some of Cameron's comments from the first question. It sounds like it's fair to assume that it's more -- it's less the cloud migration trajectory like the pace of migrations that you're seeing changing here that's influencing the change in revenue target for cloud for the year than it is the expansion rate. So first part is just is that a fair assumption that, that 130% to 140% for large customers that we're seeing is what's causing the moderation impact? And then, the second part for Joe is just -- I know you're relatively new to the call, but your views just around potentially giving more margin.\n\nWhat would inform that discussion versus just continuing to stay the course with the investment cycle? I know the company tends to think long term. So just your thinking given the macro is changing a bit, I think, is useful here in the context of what you're seeing. Thank you.\n\nCameron Deatsch -- Chief Revenue Officer\n\nThank you. Happy to speak to the -- just to be very, very clear, yeah, we have seen no change in our migrations rates. Our migrations progress continues to be on track as it's been the last few quarters with the server end of life coming up to February 2024, as well as our loyalty discount program, which will basically take another step down in June. We have a series of compelling events that we've been working with our customers over the last couple of years.\n\nWe get better in those conversations every day. And the migration efforts continue to be right along with plan. So no impact due to migrations. It is largely purely focused on people adding users, that user expansion within their existing use of our products that we've seen slow down a bit over the last quarter.\n\nJoe Binz -- Chief Financial Officer\n\nGreat. Michael, this is Joe. Thanks for the question. On the NRR question, the expansion rate question.\n\nAs you know, we don't provide updates on expansion rates on a quarterly basis. Directionally, it remains very healthy and above the 130% we discussed at the investor day. I think that's indicative of the fundamental health of our business, particularly around upgrades to premium and enterprise additions, customers adding new products and churn rates. And while we talked about the macro impact on paid seat growth within existing customers, relative to expectations, the absolute growth rates there are still very good on an absolute basis.\n\nSo that's a big -- that's also a big driver behind those healthy expansion rates. And I'll turn it over to Scott to talk a little bit about the margin trade-off discussion.\n\nScott Farquhar -- Co-Founder and Co-Chief Executive Officer\n\nIn terms of -- stepping back in terms of thinking about long term, like we've been through multiple downturns to the business. Like we started in '01/'02 in sort of the dot-com crash, we went through '08/'09. And yeah, we're now in the third downturn for us. And what we've learned is that during those periods of time, like if you can invest wisely, you can come out the other side with the leaderboard shaking up a little bit, and you can come out higher on that leaderboard than you went going in.\n\nAnd so, that informs a lot of how we think about the investments through this period. So there's a couple of areas. One is we think that we can pick up staff where other companies are shedding staff. There's a lot of incredible people in the market who may only come on the market once a decade, and we have an opportunity to pick those staff up now.\n\nAnd so, may be really thoughtful around kind of how many we hire and where we hire, but our experience is that we can come out really strongly on the other side by selectively picking up staff that other people are letting go. We also, in terms of think about what the opportunities and we said in our investor day kind of -- it seems like a long time ago now, but early this year, we said we have three really good opportunities that we were going to invest behind that was migrating our customers to the cloud at the fastest rate we can, building new products to that point A program and investing more in ITSM with our JSM platform there. And so, again, we think those are long-term investments that pay off short, medium and long term, we want to continue to invest in those areas. And so, we're going to continue to do that.\n\nAnd so, we're going to be thoughtful around that. We need to make sure that does fit within a certain cost envelope and with the macro economic environments like we want to be conscious about what the cost invoice is. But again, our philosophy about investing for the long term about having low-priced products that are very particularly attractive in this market, picking up staff that hasn't changed through this cycle.\n\nOperator\n\nYour next question comes from Fatima Boolani from Citigroup. Please go ahead.\n\nFatima Boolani -- Citi -- Analyst\n\nGood afternoon. Thank you for taking my question. Cameron, this question is for you. It's a little bit of a counter factual.\n\nSo I know you're staying committed to the proportion of your cloud growth coming from migration. But conversely, why wouldn't we see a slowdown in migrations to the cloud if the sensitivity that you've seen most to date is on the user expansion area. So in other words, why wouldn't an existing customer just sweat out the capacity that they have versus going to sort of a per user or need seat model where potentially the TCO in the short term could be much higher. Just a couple of thoughts there on why that wouldn't actually impair the migration cadence to the cloud.\n\nThank you.\n\nCameron Deatsch -- Chief Revenue Officer\n\nSo basically, let me just try and rephrase the, -- why haven't we seen a slowdown in the cloud migration rates when it is an effort for customers to make a change versus just sitting on their renewals and wait until the last minute, the primary reason for that is that over the last two years, ever since we announced the server end of life, now almost exactly two years ago, we've had a very well-engineered set of programs that we have released between loyalty discounts, new migration tooling, more engagement with our enterprise customers, incentivizing our partners and incentivizing our customers to ensure that cloud is the proper destination for them. And many of them over the last two years have been in various stages. Some moved very, very quickly. Some are building plans today.\n\nSome are waiting, like you said, to the last minute. But across the board, we have seen that entire approach being like largely on track. So they haven't been seeing the [Inaudible] cloud as a capacity challenge. It's not like 100 users, the fact that they need to more add users, they can add more users on-premises if they want versus adding more users on cloud.\n\nIt's more of the while we've been looking to go to cloud and we've made the strategic decision to go to cloud, there's a whole lot more value that we unlock in cloud and more productivity for the users we have. So let's go through and continue to finish this project so that our teams operate more efficiently and have the best tools available to them even if we were going to have less people hired in the future. So it wasn't really tied to how many people are in the room, it's more tied to them choosing the best solution for them long term and of course, reacting to the programs that we put in the market to compel them to move to cloud.\n\nOperator\n\nYour next question comes from Arjun Bhatia from William Blair. Please state your question.\n\nArjun Bhatia -- William Blair -- Analyst\n\nHello. Yes, thank you for taking my questions. I'm curious, just when you think about the macro impact that you're seeing, is there any way to just break it down any further between the behavior that you're seeing from larger customers that are maybe multiproduct that are more committed than of a broader deployment versus smaller customers that are earlier in their journey. And then, Joe, one for you just when you're thinking about the rest of the year and the guidance that you've provided, can you just help us understand what you're incorporating from a macro perspective in the forward numbers?\n\nScott Farquhar -- Co-Founder and Co-Chief Executive Officer\n\nI can take that one. Look, I want to restress our philosophy of open company, no bullish, right? We've told you every single quarter we've been public. We are going to be open with you and clear with you about what's going on. We tried to do that best we can in the letter, right? The two areas that we're seeing impact, again, is the free instances, the rate of converting to paid, and secondly is the rate of user expansion growth, the historical rate has been pretty consistent for us, slowing down a bit.\n\nThe reason for that is we think both anecdotally and best guess is customers optimizing their spend. right? If you're going to add that 11th user, you're more likely today to think I'll stay at 10. The good part about that for us is we see no sort of decrease in usage or change in churn rates. These aren't customers leaving Atlassian at all.\n\nThese are customers who are dealing with their own turbulence and optimizing their spend and tuning the number of users they have, right? We've also highlighted where we see as great opportunities in front of us and being quite clear about where we're playing offense. And some of them go to the areas that you said. Cameron just addressed migrations, which continues to be strong. If you think about it from a customer perspective, the -- if you're looking at optimizing spend, cloud is an easier place to do that than on-premise because you are -- can pay monthly, and you can pay per user, etc.\n\nSo that gives you a slightly easy optimization. And secondly, it's a much higher ROI in terms of running the software. We do all that for you. So that's why we see continued opportunities and migrations, which are tracking strongly.\n\nSecondly, in enterprises, we certainly see that a significant opportunity on the back of 10 years of really great work of continuing to optimize for the enterprise. That's a huge opportunity area for us. And lastly, as we've mentioned repeatedly in ITSM, we're seeing really strong growth. So all those play into the enterprise that you talked about, but hopefully, that gives you some background color about where we think we're well-positioned to gain market share in this environment and really excited about the future.\n\nCameron Deatsch -- Chief Revenue Officer\n\nAnd this is Cameron, I'll add a little on. Just give you a little more view of the how we do SMB growth over our enterprise customer base growth. Now first and foremost, that the constraints in the growth rate of users we do largely see across all cohorts. Like I said, all sized customers, industries and geographies, it seems to be broad across the customer base.\n\nHowever, we do continue to see strength in our enterprise business for a few reasons, primarily due to the fact that migrations, which are going as planned, have an outsized impact when it comes to our enterprise business compared to our small and medium-sized business, simply due to pricing dynamics. The second is also in our enterprise business that we continue to see customers continue to standardize on our applications, choose the enterprise additions of our products when they move to the migrations, which continues to grow their inputs. On top of that, in just over the last month, we've announced a partnership with Accenture, which gives us massive scale with one of the large global system integrators in the industry to help our customers through their massive transitions, whether that's their agile transformation or their cloud transition. And just today, as Mike mentioned, that our growth in IT service management market, we were named the leader in the Gartner Magic Quadrant, which shows that even more enterprise credibility as we look to expand into IT operations and service management use cases in the enterprise.\n\nJoe Binz -- Chief Financial Officer\n\nAnd then, Arjun, this is Joe, you asked about the assumptions underpinning the guidance. We are assuming two fundamental things in our guidance. First, the current macroeconomic environment persists throughout the year. It does not get materially better or worse.\n\nAnd then, secondarily, the macro impact on the business and the trends we saw in Q1 around free-to-paid conversion rates and paid seat expansion at existing customers also persist throughout the year and does not get materially better or worse. So in other words, the guidance assumes status quo on those two factors. Like most, we continue to monitor things closely, both on the macro side and on the business side, and we're adjusting and responding to it. As you know, there's a lot of uncertainty right now, and we think this is an appropriate range, given what we have seen to date, both in Q1 performance and our Q2 quarter-to-date performance and the underlying trends we saw there.\n\nOperator\n\nYour next question comes from Alex Zukin from Wolfe Research. Please go ahead.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nYeah, hey, guys. Thanks for taking the question. So I want to dive into that last -- the last answer from both Cameron and maybe others. I guess, if we think about the enterprise impact, like can you maybe dissect the cloud revenue growth for the year, the takedown? Is it -- are the seat adds -- the headwinds from the seat adds, is that more in the mid-market, the SMB, the enterprise? Is there -- would you say it's being compensated by incremental module additions at the enterprise? Help us unpack that and give us a sense for when you started to see these issues? Is it in the last two weeks of the quarter? How that's trended in October? And from the financial perspective, is the cloud growth kind of exiting this year, where does that trend? Because if I remember correctly at the analyst day, we talked about that 50% wasn't just for this year cloud growth, but for a couple of years.\n\nSo I'm assuming it's coming off for this year, but I just want to clarify, is that also off for the next couple of years. Apologize for the multiple questions.\n\nCameron Deatsch -- Chief Revenue Officer\n\nNo problem at all. I'll address the first part and then hand off to Joe. So as you know, our cloud growth, easy to think is that it's new customers coming in, those customers adding users to the products that they have purchased in addition to upgrading additions to either the premium or enterprise version of their products. Also, migration is another big piece of our cloud growth.\n\nRoughly 10% of our growth is due to migrations. And of course, cross-sell expanding out to our other products. So to diagnose specifically what we saw in Q1, the specific areas we saw in Q1 was the net new customers starting to slow the rate. We still added over 6,000 net new customers, but we saw that somewhat slowing down as free customers slowed their conversion to paid customers, and we saw that user growth.\n\nSo someone who was an existing cloud customer slowing down the rate on which they added more users. We did not see any impact to either migrations or addition upgrades or in our major cross-sell motions. So it's primarily just the user additions tied to largely hiring. Our customers adding more and more employees into their business and then slowing that down, which slows down our user growth.\n\nThose -- other efforts are right on track as we originally planned. Joe?\n\nJoe Binz -- Chief Financial Officer\n\nThanks, Cameron. And then, Alex, your question on how we're going to exit Q4, we expect to exit Q4 with cloud revenue growth rates in the 40% to 45% range.\n\nOperator\n\nYour next question comes from Gregg Moskowitz from Mizuho Securities. Please go ahead.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nOK. Thank you for taking the question. So I think of Atlassian as an unusual software company in a good way, a couple of the reasons being that one, your quarters are typically very linear. And two, you have tremendous visibility into customer buying and usage patterns.\n\nAnd so, I'd have to believe that you had a very early warning of the paid user growth slowdown that began midway through the quarter. And with that said, what I'm wondering is, was there anything that you were able to do that has enabled you to mitigate the slowdown as it unfolded. Investors are pretty surprised to see results like this from Atlassian. And so, the question here or the spirit of the question is whether you have the ability to make adjustments and navigate the difficult macro better than others? Thank you.\n\nCameron Deatsch -- Chief Revenue Officer\n\nGregg, this is Cameron again. Sorry, Scott. Go ahead.\n\nScott Farquhar -- Co-Founder and Co-Chief Executive Officer\n\nIt's Scott here. Just want to sort of philosophically, Gregg, one of the things we look at, we're a long-term company and there are many of our peers drive their quarters really back from the sales team. They sort of say, how many sales people I got and how many reps do I have, and that's how they run their business. If you look at our business, it really is a much more long-term self-serve model where our customers come and we're also, from a price perspective, much more reasonably priced on a firstly basis than many of our competitors out there.\n\nAnd so, in terms of -- for good and bad, there aren't many things we can do within a quarter to affect the quarter's results, which is why you see the linearity that you've seen over the years from the last year. And so, when I look about the macro environment and what we're seeing, we've cut this every which way, by geo, by product, by market segment. It really comes down to that customers are not adding seats and heads the way they used to add them because the hiring environment has changed outside of Atlassian. And so, we see that.\n\nWe trend that they're in a long term, we're really -- we've got -- we can sell more products to customers. We have a great product pipeline in Point A products. We have great market opportunities in ITSM. The migrations are still going strongly.\n\nAnd one of the reasons they're going strongly is that the ROI is just so compelling to them, though they pay us more money, the overall cost to them or TCO goes down because they got less people managing things in an environment where they had to manage their own service and data centers. And so, that's a great opportunity. All those are great opportunities for us. They're not short term, do something within a quarter, they really play out over the long term.\n\nAnd again, when we look at sort of the opportunities for us now, they are to take market share because we have great products that are cost competitive versus competitors out there. And what we're seeing here is that we haven't seen any materially changed in churn, like it's mostly on adding fleets. And so, then also points to the stickiness of our products. And so, that's the way I think about that.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nVery helpful perspective.\n\nCameron Deatsch -- Chief Revenue Officer\n\nI can also add on to just the timing of things that we saw. As we mentioned in August, what we were seeing in the August time frame was the net new customers, the free customers converted to paid was slowing down going into August. We normally through our summer season, the July and August tend to see user growth slow down across our customer base, largely due to seasonality, vacations and holidays. It just tends to be a normal seasonal trend where July and August are slower as people are not upgrading instances, adding more users.\n\nWhat we noticed is usually most years when you come back in September, everyone is coming back to work, the holidays wear off and people start adding users and upgrading their instances again and that's when we actually did not see that normal user growth uptick that we normally do in September. The great thing is that one of the advantages that we do have is that we have plenty of other growth drivers we can continue to leverage in our business, whether it's upgrading additions, continuing to escalate our migration efforts or relying on expansion to other products of which we've even released a few new ones over the last few quarters. So plenty other levers that we tend to pull when we see user expansion slowdown.\n\nOperator\n\nYour next question comes from Brent Thill from Jefferies. Please go ahead.\n\nBrent Thill -- Jefferies -- Analyst\n\nHeadcount accelerated to the fastest growth in 11 quarters kind of into the face of this slowdown. Can you just talk to what you're going to do through the next six to nine months and how you're thinking about that investment pace? And then, I had just a quick follow-up on the geography perspective. EMEA looked like it had the biggest hit. Can you comment on what you're seeing in EMEA versus the U.S.? Thanks.\n\nScott Farquhar -- Co-Founder and Co-Chief Executive Officer\n\nI'll take the headcount and Cam can talk about the geo side of things. On the headcount, you're right. It is our high watermark on headcount growth. We do have, from a seasonality perspective, a lot of graduates coming out in the U.S.\n\nwho started this quarter. So that gives this quarter's numbers a boost. And we are thinking about sort of what does our headcount moderation look like going forward. We are still going to be growing our headcount, but of course, moderating that growth in light of the macroeconomic conditions and ensuring those people are going on the most productive of projects.\n\nCam?\n\nCameron Deatsch -- Chief Revenue Officer\n\nYeah. From a geographic perspective, as I mentioned prior, the trends we tend to see across our customer base has been largely across all segments, industries and geographies. So when we look to Europe specifically, or APAC, we have seen no quantitative change other than what we've already spoken about, the user expansion slowing down. but migrations, our addition upgrades, our cross-sell programs continue to be on track from a quantitative perspective.\n\nQualitatively, when we talk to customers, we do get plenty of discussions and concerns about largely uncertainty we see going into the next year. Plenty have financial concerns related to the variety of macroeconomic efforts that are areas that we see impacting their businesses. That has not cost projects to slow or migrations to slow down at this point, but it's definitely a constant conversation we are having with those customers.\n\nOperator\n\nYour next question comes from Michael Turits from KeyBanc Capital Markets. Please go ahead.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, guys. On the subject of the slowdown in both expansions of customers and conversions, you're trying to slower headcount growth among customers themselves. Can you say perhaps if there is you see anything in particular in the development world, in other words, among the headcount growth or not in your customers for software developers. And how that may or may not be tied to what we've heard about in terms of the spend in cloud this quarter?\n\nScott Farquhar -- Co-Founder and Co-Chief Executive Officer\n\nMichael, I appreciate the direction of the question is we're seeing headcount growth slowing our customers, where is that -- I think you're asking which departments of our customers are seeing that headcount slightly -- does that factor into other cloud spends and so forth. I think it's too early for us to have any sort of strong opinion on that, like we sell across the entire customer base in our customers. So it's sort of hard for us to be specific about that. Of course, our history is selling more to developers.\n\nBut the thing to take away from last year's result is, we're really speaking to our customers, we haven't seen people decide to slow the migrations. We haven't seen people try to reduce or sort of cancel contracts or anything like that. It really is just tied to headcount growth, but I couldn't give you any more detail on which department that is.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nCan I just ask one additional question, too? I mean, you said you're seeing across all segments. But another way of thinking about it is not segments per se, but customers with different sizes of spend. And I think you, obviously, have some people spending a lot of money with you in the small companies or big ones. But there's also the ability to have a fairly small spend with Atlassian and therefore, maybe in some senses to fall underneath the radar in terms of big budgeting decisions.\n\nDo you see any difference there between where you're a big part of the company's budget versus small?\n\nCameron Deatsch -- Chief Revenue Officer\n\nYeah, this is Cameron to answer that. And not really -- if you look across the base, actually, on the small end, you see this coming in our free users, like we have plenty of free instances with eight users, nine users, 10 users and then their willingness to put their credit card in and pay a relatively minimal amount to get into our paid plans, we've seen that slow down. Even when we get to our largest customers, most of our conversations with our largest customers are about expanding to new product use cases, whether that's Jira Service Management or Jira line or having these migrations conversations if they're large on-premises customers. So they're project-based, and a big portion of our revenue discussions are tied to that.\n\nWhat we have less discussions with them, adding 500 users or 1,000 more users because they've rapidly expanded their development teams or what have you. So the answer is no. We have not seen user expansion tied directly to share of wallet or the current spend with Atlassian, it's definitely much more tied to how many people are hiring and how much people are expanding their overall technology footprint in their businesses.\n\nOperator\n\nYour next question comes from Steven Koenig from SMBC Nikko. Please go ahead.\n\nSteven Koenig -- SMBC Nikko Securities -- Analyst\n\nHi, gentlemen. Thanks for taking my question. Given that like the higher velocity sales motions seemed to be the most affected here. I'm wondering if you look at your existing cloud customers and look at the monthly people versus the annuals, are you seeing any kind of like earlier slippage in the monthly? And are we going to need to work through 12 months of the annual customers renewing with adding fewer seats? Like how do you think about maybe the net expansion rates for those two different steps of cloud customers? Thanks very much.\n\nCameron Deatsch -- Chief Revenue Officer\n\nYeah, one advantage of our business model is that we have plenty of customers on monthly plans, we have the option to go annual plans across the board, and we largely let customers make the choice. We have -- but the good news is it's not like we have all annual plans come up at one time every year as we have annual plans renewing every single month just like we have monthly plans. So no, we see that user expansion challenge that we saw over the previous quarter continue to be like largely even across both our monthly and annual plans. We don't see any major delta between the two difference with the monthly plans is that we will have much more accurate tied to the customers paying for exactly the number of users they're using within the product and allows us to the annual plans where we can continue to watch those customers.\n\nWith cloud, we have incredible telemetry about the health and usage of the products and allows us to proactively engage with those customers if we tend to see usage or activities starting to go into unhealthy territories, given us even more abilities to run customer success programs, training programs and the like.\n\nOperator\n\nYour next question comes from Ari Terjanian from Cleveland Research. Please state your question.\n\nAri Terjanian -- Cleveland Research -- Analyst\n\nThank you for taking the question. Just asking a little bit differently on the user expansion. I appreciate all the color you've given thus far. Any way like you can estimate or break out like exposure to the tech vertical, I mean, it seems like kind of looking at the headlines, you have Amazon kind of slowing hiring, Shopify, Stripe, letting off people.\n\nJust kind of curious, like, obviously, those companies were hiring pretty aggressively during COVID. So just kind of curious if you've accounted or have seen any like a benefit from those cohorts during COVID? And if you're kind of expecting baking in for user growth from kind of the tech cohort in the coming months here? Thank you.\n\nScott Farquhar -- Co-Founder and Co-Chief Executive Officer\n\nAri, yeah, I would understand your line of questioning is sort of what -- are there tailwinds that are coming off from COVID or like that we should be thinking about. And we've looked at this and we think about almost every company these days is becoming a software company, whether you're a retailer or whether you are a car company or whether you are a transport company, just every aspect of the economy is becoming a tech company and that's why people have turned to our products. And I don't think that sort of secular trend is changing anytime soon. And I don't think -- the tech is a large industry it's a lot like than it was 20 years ago when we started.\n\nWe sell to tech, to banking, to manufacturing, like all down every industry vertical we sell to. And so, I wouldn't say we're overly exposed to technology workers. We do sell again products that help teams more effective, and our history was to start with technical teams. But those technical teams are in every single company out there.\n\nAnd when I talk to our customers, those technical teams are also they talk to people that most companies are doing their best to retain during the downturn like -- they're the ones that have taken a long time to build up, They have a lot of IP and they're very hard to restart. And so, we think that I need to get to the tech industry, but we do sell to technical teams across the board. And we think those teams are sort of last on the line to be reduced in terms of macro headwinds.\n\nOperator\n\nYour next question comes from Mark Cash from Raymond James. Please go ahead.\n\nMark Cash -- Raymond James -- Analyst\n\nThanks for the question. This is Mark on for Adam. I wanted to ask about the loyalty discounting you're doing to migrate customers to cloud. And understanding this is still ongoing, but how would you size the overall potential uplift to revenue and margins as these discounts are rolling off? And when would you really start to see that impact? Thank you.\n\nCameron Deatsch -- Chief Revenue Officer\n\nYeah, so this is Cameron here. So the loyalty discounts and as those you've been following for a while, when we announced the server end of life, we basically had aggressive loyalty discounts that rolled down effectively every July 1 over a three-year period as we led to the server end of life. So effectively, the sooner that our customers would choose to move to the cloud, they would get a bigger discount. And then, over the three-year period as the loyalty discounts roll down, they eventually get to list price.\n\nAnd that's still the truth for all of our customers. So we still have a loyalty discount in place. It's the last year of loyalty discounts going up until June 30. As of July of next year, all customers are effectively paying on new contracts, be paying list.\n\nAll existing customers, who are on one-year up to three-year contracts at the end of their three-year terms will be at list price as well. Joe, did you want to add anything?\n\nJoe Binz -- Chief Financial Officer\n\nYeah, Cam, I was just going to mention the question around when do we start to see those price changes and the impact of those in the model? And the answer to that is it's not immediate. So there's two reasons for that, Mark. First and foremost is the ratable recognition on subscription, which is 80% of our revenue. And secondly, the timing of renewals that happen throughout the year post those changes.\n\nSo you won't see an immediate impact when we go through those types of pricing changes, it will tend to run into the model over time.\n\nOperator\n\nYour next question comes from Peter Wade from Bernstein. Please go ahead.\n\nUnknown speaker\n\nThank you. Earlier, you touched on net revenue retention and referenced back to enterprise, you talked about 130% and 140% previously and that you were still seeing NRR over 130%. Now I wanted to clarify because, obviously, your cloud revenue comes from more than large and midsized businesses, whether or not when you said 130%, you were still exceeding that. Was that just for kind of the medium and large-sized businesses? Or was that for that entire revenue base that you report on?\n\nJoe Binz -- Chief Financial Officer\n\nYeah, Peter, thanks for the question. This is Joe. That was for the entire customer base that we report on.\n\nUnknown speaker\n\nOK. And then, as you're taking a look at the smaller customers within there that you are trying to get into paid, certainly, that transition is frustrating. But I think that you were alluding to it in the note here. But how are you seeing any competitive pressures there? I mean, certainly, you hear things like GitLab being thrown around as an alternative that people could use if they have a lower sophisticated organization.\n\nIs it genuinely that people are just not upgrading to paid? Or are you seeing situations where you are concerned with some of these customers that the names be using other solutions to try to get done what Atlassian may be able to do better.\n\nCameron Deatsch -- Chief Revenue Officer\n\nThis is Cameron. And yeah, first and foremost, across the board, whether it's the new customer acquisition or existing customers, we see no real change in our overall competitive position. We have incredibly strong products, incredibly happy customers, and we also have the certain critical applications where were highly integrated into their environments. Specific to what you mentioned, the free users converting into paid.\n\nWe definitely haven't seen any competitive dynamic there because we still see them as free users of our products. It's actually one of the advantages of our free program and that people will be choosing us and using our free version of our products compared to going to an alternative vendor across the board also at a dollar level if budgets are getting more constrained and customers are looking to save money, across our entire product base, one of our core parts of the Atlassian products so attractive is that we are relatively priced, less expensive than most alternatives. So no change in competitive dynamics nor are we seeing competitors being any direct impact to our free-to-paid conversion rates. Thank you.\n\nMike Cannon-Brookes -- Co-Founder and Co-Chief Executive Officer\n\nThis is Mike. I just wanted to add in one thing to maybe add a little bit of a stronger message to what Cameron is saying. I think it's actually an opposite behavior, right? We've talked about playing offense in this environment on a few shareholder letters now. And again, this quarter, the same.\n\nWe actually see the upcoming period as a good chance for us to pick up market share in a lot of our markets. We actually think we're very strongly positioned in all three of our major markets. Our investment in R&D are extremely affordable, high-value products for customers is a great chance for us to pick up market share in an environment where customers are optimizing that spend. So that's an area we're very bullish and going after.\n\nOperator\n\nYour next question comes from Fred Havemeyer from Macquarie. Please go ahead.\n\nFred Havemeyer -- Macquarie Research-Analyst\n\nHi. Thank you. I wanted to ask, with respect to the slowdown that you're seeing in net new -- sorry, free-to-paid conversion, as well as just user expansion. What we're seeing now in terms of layoffs, it's certainly ahead of what we saw at the COVID pandemic.\n\nBut I wanted to ask, if you were to compare or consider what you're seeing now to say, like the start of 2020 when layoffs intensified, businesses began to freeze hiring and just capital froze. How have you seen -- or could you just generally compare and contrast what you're seeing now versus then?\n\nCameron Deatsch -- Chief Revenue Officer\n\nSo this is Cameron. I will do my best, looking back to that area. Obviously, going back to 2020, at the beginning of the year, we just only saw this kind of right into COVID, we had two things that happened. If you remember, that is actually when we changed our business model from going trials based to free which resulted in a huge uplift in sign-ups and new free activations of our products, but we also saw that in line with the impact of COVID, small businesses shutting down and so on.\n\nAnd if you remember, our Q4 of fiscal year 2020, it was actually one of our slowest new customer growth quarters ever because of those two dynamics. Our conversion to free, as well as smaller customers largely going out of business or not renewing. Two years later, now we're at the tail end of COVID, and we are looking to see the trends, our net new customer number is still significantly higher than we had pre our free launch. So even if you took out all the uncontrolled unknown pieces of the COVID dynamic over the last two years, our change of business models go into free has significantly altered our ability to acquire and attract net new customers, and we see that today.\n\nIn addition to that, the fact is we still every single day, continue to see more and more customers signing up, coming into our store, as I say, and clicking the try button year over year, which is the same dynamic we saw back then. However, they're ability to get to the 11th user, enter their credit card, all that is significantly dependent on other environments that we don't always have control of. The most important piece that we look to is are they using our products? Are they getting value out of it, and we can be patient for the revenue. And that is what we see is consistent between that kind of early COVID months and what we see now a few years later.\n\nFred Havemeyer -- Macquarie Research-Analyst\n\nThank you. And then, just I think one follow-up on that. Also, Cameron, that was, I think, a great job, not just to try at explaining it. In terms of just Atlassian together, the bundled solution that you've launched and announced this quarter, I know it's very early days, but it seems like that's more of an enterprise-focused offering.\n\nAnd is there an opportunity outside of just driving sales into enterprise to potentially add this in or use the opportunity of a transition from some of these on-premise customers to either data center or cloud to onboard them into together?\n\nMike Cannon-Brookes -- Co-Founder and Co-Chief Executive Officer\n\nFred, it's Mike here. Super glad you managed to fair it out, a product strategy question. Thank you for doing that. Yes is the answer.\n\nSo a reminder, Atlassian together is an enterprise-focused offering. We announced at Work Life, a conference targeting work management. Now we have more than 150,000 customers in the work management arena, so a very strong market for us. There's no doubt that we've continued, as you've seen in our platform, to make our products, as we say, work differently together.\n\nSo we believe every team works in their own way, and we want our products to work incredibly well together, and we also want to work with all of the other products that customers use as the number of products per customer. I think it's topped 89 or 90 in the latest October survey and it's going to continue to go up, we believe. Atlassian together is an offering targeted our largest customers to allow them to purchase all of our work management applications together that work with each other and all the third-party applications generally used -- focused on customers who are increasing their spend significantly in terms of the number of users. So when you're rolling out Atlassian's Work Management applications from maybe 2,000 employees to 10,000 employees, it's an incredible way to do that because you don't have to manage individual applications and usage across your employee base.\n\nIt's very early days. Obviously, as you mentioned, for customers coming from server or data center, they only really have access to Confluence on the server data center realm. So Atlassian together includes Atlassian Access, Trello, Jira Work Management, Confluence and Atlas, which is our new offering. So those five products come in the Atlassian together package.\n\nIf you're coming from on-premise and moving to the cloud, you only have Confluence. So we do hope it is a compelling offering for customers who are migrating in that space. Far too early to see any actual results of that yet. Again, it was only announced a month ago.\n\nInitial customer feedback, I will say, is very positive. People understand the offering, especially for those larger customers that are moving significantly up in terms of their employee access to our Work Management applications and the ability for them all to collaborate with each other. But we'll have more updates for you as that rolls out.\n\nOperator\n\nThank you. And that concludes our question-and-answer session. I will now turn the call over to Mike for closing remarks.\n\nMike Cannon-Brookes -- Co-Founder and Co-Chief Executive Officer\n\nJust wanted to say thank you all for the detailed questions and for reading our shareholder letter and for attending today. Thank you to all the Atlassian employees for another kick-ass quarter. And I hope you have a great weekend, wherever you are in the world, and we'll talk to you next quarter.\n\nDuration: 0 minutes\n\nMartin Lam -- Head of Investor Relations\n\nScott Farquhar -- Co-Founder and Co-Chief Executive Officer\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nCameron Deatsch -- Chief Revenue Officer\n\nJoe Binz -- Chief Financial Officer\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nFatima Boolani -- Citi -- Analyst\n\nArjun Bhatia -- William Blair -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nSteven Koenig -- SMBC Nikko Securities -- Analyst\n\nAri Terjanian -- Cleveland Research -- Analyst\n\nMark Cash -- Raymond James -- Analyst\n\nUnknown speaker\n\nMike Cannon-Brookes -- Co-Founder and Co-Chief Executive Officer\n\nFred Havemeyer -- Macquarie Research-Analyst\n\nMore TEAM analysis\n\nAll earnings call transcripts"
}