{
  "companyName": "Wheaton Precious Metals Corp.",
  "companyTicker": "WPM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/wheaton-precious-metals-corp-wpm-q2-2022-earnings/",
  "content": "Wheaton Precious Metals Corp. (WPM -1.51%)\nQ2 2022 Earnings Call\nAug 12, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. Thank you for standing by. Welcome to Wheaton Precious Metals 2022 second quarter conference call. [Operator instructions] Thank you.\n\nI would like to remind everyone that this conference call is being recorded on Friday, August 12, 2022 at 11:00 a.m. Eastern Time. I will now turn the conference over to Mr. Patrick Drouin, senior vice president of investor relations and sustainability.\n\nPlease go ahead, sir.\n\nPatrick Drouin -- Senior Vice President of Investor Relations and Sustainability\n\nThank you, operator. Good morning, ladies and gentlemen, and thank you for participating in today's call. I'm joined today by Randy Smallwood, Wheaton Precious Metals' president and chief executive officer; Gary Brown, senior vice president and chief financial officer; Haytham Hodaly, senior vice president, corporate development; and Wes Carson, vice president, mining operations. Please note that for those not currently on the webcast, the slide presentation accompanying this conference call is available in PDF format on the presentation page of the Wheaton Precious Metals website.\n\nI'd like to bring to your attention that some of the commentary on today's call may contain forward-looking statements, and I would direct everyone to review Slide 2 of the presentation, which contains important cautionary notes regarding forward-looking statements. I should note that all figures referred to on today's call are in U.S. dollars unless otherwise noted. In addition, reference to Wheaton or Wheaton Precious Metals on this call includes Wheaton Precious Metals Corp.\n\nand its wholly owned subsidiaries as applicable. Now, I'd like to turn the call over to Randy Smallwood, our president and chief executive officer.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nThank you, Patrick, and good morning, everyone. Thank you for joining us today to discuss Wheaton's second quarter results of 2022. I am pleased to say that our portfolio once again delivered solid revenue, earnings and cash flow in the first half of 2022, as Gary will discuss later. This solid performance reflects the resiliency of the streaming model to inflationary pressures currently being felt across the global economy and especially among the traditional miners.\n\nIn fact, our average cash cost per gold equivalent ounce actually decreased in the first half of 2022 relative to the first half of 2021. While we continued to actively pursue a number of new opportunities in the second quarter, we also showed our willingness to strategically identify opportunities both inside and outside of our portfolio that create value for our shareholders. To that end, in the quarter, we announced the proposed termination of the Keno Hill stream for $135 million, which, when completed, will ultimately result in an absolute return on our Keno Hill investment of over 300%. However, the termination of the stream, combined with severe weather events at Stillwater, and lower-than-expected throughput from Salobo have resulted in Wheaton having to lower its 2022 production guidance.\n\nWes will provide more information later in the call. Despite this, given our strong balance sheet, liquidity available for investment, the production growth at our key producing assets and our diverse development portfolio, we are on track to generate sustained, long-term production and strong growth over the next four years. Lastly, we once again demonstrated our leadership in sustainability and value creation for all stakeholders by publishing our third annual sustainability report and announcing a sustainability-linked element in connection to the renewal of our existing undrawn $2 billion revolving credit facility. I would now like to turn the call over to Gary Brown, our senior vice president and chief financial officer, who will provide more details on our results.\n\nGary Brown -- Senior Vice President and Chief Financial Officer\n\nThank you, Randy, and good morning, ladies and gentlemen. The Company's precious metal interests produced 163,000 gold equivalent ounces or GEOs in the second quarter of 2022 comprised of 68,000 ounces of gold, 6.5 million ounces of silver, 3,900 ounces of palladium and 136,000 pounds of cobalt. Relative to the second quarter of the prior year, this represented a decrease of 15% on a gold equivalent basis, primarily due to lower production at Salobo. On a gold equivalent basis, sales volumes were only 3% lower relative to Q2 2021 with changes in ounces produced but not delivered or PBND, largely offsetting the lower production levels.\n\nAs at June 30, 2022, approximately 123,000 GEOs were in PBND, in addition to cobalt inventory amounting to 10,700 GEOs with the combined figure of 133,000 GEOs, representing approximately 2.4 months of payable production. This is approximately 24,000 GEOs lower than the average over the preceding four quarters. Revenue for the second quarter of 2022 amounted to $303 million, representing an 8% decrease relative to Q2 2021 due to a 5% decrease in the average realized gold equivalent price combined with the lower sales volumes. Of this revenue, 52% was attributable to gold sales, 43% silver, 2% palladium and 3% cobalt.\n\nDriven by the lower realized prices and sales volumes, gross margin for the second quarter of 2022 decreased 11% to $162 million. However, worthy of note is the 1% decrease in the average cash cost per GEO, highlighting the resiliency of our business model to the inflationary pressures being experienced across the mining industry. G&A expenses amounted to $10 million in the second quarter of 2022 and donations and community investment expenses amounted to an additional $1 million with a combined figure of $11 million being virtually unchanged from Q2 2021. For 2022, the Company continues to estimate that G&A expenses will amount to $41 million to $42 million while donations and community investments are estimated to amount to an additional $6 million to $7 million.\n\nStock-based compensation amounted to $2 million in the second quarter of 2022, representing a decrease of $6 million relative to comparable quarter of the prior year, primarily due to the differences in crude costs associated with PSUs. Net earnings amounted to $149 million in the second quarter of 2022 compared to $166 million in Q2 2021. Basic adjusted earnings per share decreased 8% to $0.33 compared to $0.36 per share in the prior year. Operating cash flow for the second quarter of 2022 amounted to $206 million or $0.46 per share compared to $216 million or $0.48 per share in the prior year, representing a 5% decrease on a per share basis.\n\nBased on the Company's dividend policy, the Company's board has declared a dividend of $0.15 a share payable to shareholders of record on August 26, 2022. Under the dividend reinvestment plan, the board has elected to offer shareholders the option of having their dividends reinvested in newly issued common shares of the Company at a 1% discount to market. During the second quarter of 2022, the Company made dividend payments relative to the prior two quarters totaling $117 million, invested $15 million relative to Marmato, and acquired $3 million of long-term equity investments. Overall, net cash inflows amounted to $72 million in Q2 2022, resulting in cash and cash equivalents at June 30th of $449 million.\n\nRecently, the Company added a sustainability-linked element to its revolving credit facility, underscoring the Company's commitment to ESG initiatives. In addition, the term of the revolving facility was extended to July 18, 2027. The capacity provided by the undrawn $2 billion revolving credit facility, combined with the strong forecasted operating cash flows, positions the Company very well to satisfy its funding commitments and sustain its dividend policy, while at the same time, having the flexibility to consummate additional accretive precious metal purchase agreements. That concludes the financial summary.\n\nWes Carson -- Vice President, Mining Operations\n\nThanks, Gary, and good morning. Overall production in the second quarter came in lower than anticipated with lower-than-expected performance from Salobo and Stillwater, partially offset by stronger-than-expected production from Constancia, Penasquito and Antamina. In the second quarter, Salobo produced 34,000 ounces of attributable gold, a decrease of approximately 39% relative to the second quarter of 2021 due to lower throughput and grades. Mine movements saw its continued improvement throughout the quarter.\n\nHowever, concentrate production was negatively impacted by process plant performance due to delays in the ramp-up after planned maintenance shutdown and additional corrective maintenance. Vale expects further maintenance work to continue in the second half of 2022 with a focus on improving the overall operational performance at both the mine and process plant, ultimately resulting in improved production through the remainder of the year. Vale also reported that fiscal completion at the Salobo III mine expansion was 95% at the end of second quarter. In addition, they began commissioning activities at the primary crushing and stockpile areas during the quarter.\n\nIn the second quarter, Stillwater mines produced 2,200 ounces of attributable gold and 3,900 ounces of attributable palladium, a decrease of approximately 27% for gold and 26% for palladium relative to the second quarter of 2021. Regional floods impacted the Stillwater operations on June -- sorry, June 13, 2022, including damage to multiple bridges and the access road to the Stillwater mine. Access to the East Boulder mine and the Columbus metallurgical facilities remained intact and both facilities continued full operations during the flooding events. Operations at the Stillwater mine, which accounts for 60% of the mine production from the Stillwater operations, resumed production on July 29, 2022, once safe access to the mine has been restored.\n\nProduction at the Stillwater mine is expected to return to normal levels by the fourth quarter. During the quarter, the Voisey's Bay mine produced 136,000 pounds of attributable cobalt, a decrease of approximately 64% relative to the second quarter of 2021, primarily due to lower grades during the ongoing transitional period between the depletion of the Ovoid open pit and the ramp-up to full production of the Voisey's Bay underground project. The Voisey's Bay underground mine extension, which includes development of two new underground mines, Reid Brook and Eastern Deeps was 74% physically complete at the end of the second quarter. Reid Brook underground continues our production for development during the quarter, and Vale has indicated that Eastern Deeps is expected to start up in the second half of 2022.\n\nGiven the proposed sale of the Keno Hill PMPA, lower production from Stillwater due to severe weather, as well as lower-than-expected production from Salobo, Wheaton is lowering production guidance. Wheaton's estimated attributable production in 2022 is now forecast to be 300,000 to 320,000 ounces of gold, 22.5 million to 24 million ounces of silver, and 35,000 to 40,000 gold equivalent ounces of other metals, resulting in production of approximately 640,000 to 680,000 gold equivalent ounces. For the five-year period ending in 2026, the Company now estimates that average production will amount to 820,000 gold equivalent ounces and for the 10-year period ending in 2021, the Company now estimates that average annual production will amount to 870,000 gold equivalent ounces. That concludes the operations overview.\n\nAnd with that, I'll turn the call back to Randy.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nThank you, Wes, and thank you, Gary. In summary, while not without its challenges, Wheaton recorded a solid quarter distinguished by several key highlights. We achieved strong quarterly revenue, earnings and cash flow and declared a $0.15 quarterly dividend. We enhanced our financial flexibility, which positions us well for future accretive growth.\n\nAnd lastly, we once again showed our leadership in sustainability by implementing a sustainability-linked credit facility and by being recognized as one of the Best 50 Corporate Citizens in Canada by Corporate Knights. So with that, I would like to open up the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] The first question comes from Trevor Turnbull of Scotiabank. Please go ahead.\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nYes. Thanks, Randy. I just wondered if you could talk a little bit about the changes to the five and 10-year guidance. I realize they're relatively small in the grand scheme of things and somewhat attributable to the adjustment on that termination of Alexco stream and then the mine changes that came out recently here on Stillwater.\n\nBut I wondered if there was any other contributing factors that caused you to adjust those longer-term outlooks.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nWell, I'll let Wes provide additional detail, but I'll start off by saying that Salobo, the drop in production this year in Salobo also has a big impact when you average that over the five and 10-year period. Keep in mind that 2022 is part of that five and 10-year average, right? And so, there's no doubt that that had an impact in terms of production. And then, as you said, the sale of Keno, the updated mine plan from Stillwater, and I would say the other factor that's come in is that we're now starting to see the shape of copper world, Rosemont and the reduction -- expected production in the early years, even though there's significant growth in terms of total ounces to be received from Rosemont, it's going to start at the Copper World area. And so production is definitely less than what was in the original Rosemont plans, and that also has an impact in terms of dropping the long-term forecast, and so across the spectrum.\n\nWes, anything to add?\n\nWes Carson -- Vice President, Mining Operations\n\nYes. The only other two minor ones where there was a change in Toroparu as well and where that fits into the production profile and the new plans they came out with, and then Phoenix being pushed out as well. We're the only two other minor ones. But overall, really, I mean, the main thing was the change to this year and then the Keno Hill stream were the two major ones.\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nOK, that's great color. I hadn't thought about the impact of this year's Salobo numbers. But, I appreciate that and thank you.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nGreat. Thank you, Trevor.\n\nOperator\n\nThank you. The next question comes from Adam Josephson of KeyBanc. Please go ahead.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nRandy, and everyone else, good morning. Thanks for taking my questions. Wes, just one follow-up on the last -- on your answer to the last one. So can you quantify how much of the five and 10-year reduction is based on this year's production specifically versus the other factors that you mentioned?\n\nWes Carson -- Vice President, Mining Operations\n\nYes. It's about -- probably about 30% of it would come in from this year.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nFor the five years.\n\nWes Carson -- Vice President, Mining Operations\n\nYes, for the year. And then on the 10 year -- yes, it's half of that. So yes.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nExactly.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nGot it. OK. And then this year, it seems like Salobo was -- of the 70,000-ounce reduction Salobo, seems like it was about 50. Randy, is that in the right ballpark, or is there something I'm missing there?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nIt's right in that ballpark. I was going to say -- I mean, we've obviously seen less production from Stillwater with the flood events that they've had there. So that's going to have an impact. Voisey's Bay is a little bit behind schedule in terms of going underground.\n\nSo we're seeing a little bit less cobalt out of Voisey's and such. I mean, the silver is still pretty well on track, but we've been impacted on the gold, both at Stillwater and at Salobo and then cobalt out of -- and palladium and cobalt out of, of course, Stillwater and Voisey's Bay.\n\nWes Carson -- Vice President, Mining Operations\n\nIt's actually -- it's about just over 40,000 is the number from Salobo. And we are expecting things to improve in kind of Q3, Q4 here. Q2 was pretty rough.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nAnd how much -- so 40 of the 70-ish was Salobo. How much is Stillwater?\n\nWes Carson -- Vice President, Mining Operations\n\nLet me check here.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nI mean, out of the 70,000 and between 40,000, let's call it about 15,000 to 20,000.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nAnd related to the five and 10-year, Randy or Wes, how much would you say Stillwater is? Just can you go into more details about the updated mine plan and the impact that that's having on your view of what the long-term production that you will be?\n\nWes Carson -- Vice President, Mining Operations\n\nStillwater is reasonably small in the long term. You're only talking like probably a couple of thousand ounces off of each of the five-year and 10-year. They are still planning on ramping up over the next few years, and it does -- I mean, there's some impact from the Blitz ramp up, but it isn't significant in the overall scheme.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nYes. The one number on the 10-year guidance that -- is impacted is, of course, Rosemont shifting over to copper world. That actually has a reasonable impact for the first five years. Again, it's a good news story because those are all ounces that weren't even part of our original plan.\n\nAnd so, we'll be seeing that production. And we're confident that ultimately the full Rosemont will get built and will be operated. But, with the new guidance that we've seen in our discussions with Hudbay as they're moving that project forward, that actually has a pretty big impact on our 10-year guidance. Not so much on our five-year guidance because it only comes on near the end of that five-year guidance.\n\nBut on the 10-year guidance, that's actually one of the biggest contributors to the 10-year -- to the change in the 10-year guidance.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nAnd on Salobo, how much confidence do you have that Salobo III will start up as you now expect it to in the fourth quarter? And just more broadly on Salobo, what is your confidence level at this point that they've got their operational problem -- at least they have a firm grasp of what the problems are and what they need to do to fix them compared to what's happened over the -- really since the pandemic started?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nWell, I'll let Wes add a bit more color and detail. I will say that we have just got down for our first site visit in a number of years. And I can't underscore how much more important it is to be physically on-site versus virtual mine tours in terms of getting a feel for how things are operating and getting a sense of confidence in terms of their ability. So I will let Wes provide a bit of color.\n\nBut I will tell you that one of the reasons that we invest in the most profitable mines in the world is that there's a very strong incentive on the Vale side to get it fixed, too. And I know that there's been a lot of management changes down there to try and resolve these issues. That being said, we can't forget the impact of the pandemic and trying to manage the pandemic. And Brazil was one of the tougher hit countries in the -- on the planet in terms of how COVID did impact operations.\n\nAnd so the measures -- a lot of the measures to try and limit the impact at the site itself also had an impact on productivity and working our way forward. So Wes, do you want to add more color?\n\nWes Carson -- Vice President, Mining Operations\n\nSure. Yes. So I was down on site with a technical team in the early part of June. So really quite recently set up well to really give us more confidence in the rest of this year and the ramp-up of Salobo III.\n\nWe were down there for four days in total. We got a good review of the entire site. We have a great relationship with Vale as being our largest partner, and they're always incredibly transparent with us in walking through exactly what the challenges are. And as Randy said, I mean, there have been quite a few changes at the site.\n\nThey've recognized what the issues are around the maintenance that have really been contributed to by COVID, particularly and also all the way back to the fatalities they had back in 2020. They've struggled really to kind of get things back in line through that period. But very strong confidence now as they've got things figured out. I think Salobo III is looking great.\n\nI mean, you could certainly see walking around the site there. I mean the 95% completion is there. They will get things going by the end of the year here. It's going to take some time to ramp it up though and actually get it up to full capacity.\n\nAnd I think the mine in great shape to be able to feed all three lines into next year.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nIt's important to remember that when Phase 1 -- when the mine first started, it took about 24 months to reach full capacity on that first line. The second line took about 18 months to get the full capacity. Obviously, as they continue down this path, should improve. So we're hoping that we should see full capacity easily by the end of 2023, 2024, early 2024.\n\nWes Carson -- Vice President, Mining Operations\n\nOne of the great things about walking through at the Salobo III project there was just all of the improvements they've made from learnings on Salobo I and II. They've added in a bunch more kind of redundancies in there to help with availability. They spent a lot of time on making sure that that Salobo III line is kind of the best they can. It's also worth noting that it is a completely separate line, right, from the primary crusher all the way through.\n\nSo there's no impact on Salobo I and II and how they run when they start up Salobo III. So there isn't any of the tie-ins or anything that you need to do with that. It's actually a completely separate line.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nI appreciate that from both of you. Wes, just to clarify one thing on the impact of Salobo on your long-term guidance, aside from your lower production expectation for this year, have your longer term Salobo production expectations changed based on the problems they've had, or are those the same as they were before, and the only impact on five and 10-year is the 40,000-ish lower ounces this year?\n\nWes Carson -- Vice President, Mining Operations\n\nYeah, it's just the production this year that we've lowered. We're still very confident in the long-term guidance that they have and then that we provided previously.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nI appreciate it. And Randy, just one last one on jurisdictional issues, specifically in South America. How, if at all, has your outlook changed in terms of your willingness or reluctance to invest in many of those countries for perhaps obvious reasons?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nYeah. It's -- political risk is a challenge. And getting it right is -- a country like Chile, which has for decades, has been one of the best investing jurisdictions in the world is all of a sudden proving very challenging with the number of permits being rejected of late with the new government down there. And I know that ultimately it's going to have an impact on foreign investment into the mining industry down there.\n\nAnd I can tell you that all you have to do is look at their state miner, Codelco and the lack of capital that it has in terms of building and advancing its own projects. That's going to have a real negative impact on Chile. And it's -- what you try and do is find assets that are strong enough to withstand any changes in taxation because we see it everywhere in the world. Even here in Canada, we see increases in taxation all the time and so on.\n\nAnd so, again, I reiterate the importance of looking for first and second quartile assets and focusing on assets that deliver high profitability to all the stakeholders, including the recipient governments for taxes and the recipient communities for income and stuff. We've got to make sure that we focus on these because they are the ones that are -- that have the best capacity to withstand these pressures, albeit increasing taxation or increasing royalties or bigger challenges in terms of permitting and the extra costs associated with that. It just sort of reinforces the importance of making sure that we focus on assets that have the capacity to manage that and still deliver their essential products to society.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nJust one last one. In terms of the discount rate that you would apply to a country like Chile, can you give us any rough sense of how that might have changed based on what's happened over the past year or so?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nYeah, it's a little bit higher than it was. It is a very fluid. We do have a team that assesses political risk. And so, it's a very fluid number.\n\nSo the number I'd tell you today would be different tomorrow and would have been different yesterday. It's a fluid number that we -- whenever we're looking at a project, we try and assess not only where a country is, but we also look at the vectors in terms of where do we expect it to be. The one thing about the streaming industry is these are life of mine investments. Unless someone comes along and offers you a really good price for an existing stream, they're life of mine investments.\n\nAnd so, political risk is incredibly important for us. And so we do put a lot of effort into it. And I can tell you that yes, Chilean political risk has added to our risk profile, and we're not willing to pay as much for Chilean opportunities as we were a year ago, two years ago.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nYeah. Thanks so much, Randy.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nThank you, Adam.\n\nOperator\n\nThank you. The next question comes from Ralph Profiti of Eight Capital. Please go ahead.\n\nRalph Profiti -- Eight Capital -- Analyst\n\nGood morning. Thanks for taking my questions, Randy.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nYeah.\n\nRalph Profiti -- Eight Capital -- Analyst\n\nRandy, if we can stay on the theme of Chile. Are you involved in sort of the mitigation plan at Phoenix with the partner Rio2, just given your growing ESG competence and how that's become a focus for the company? And would you be open to part of their strategy, which is to seek alternative financing and whether that be through a renegotiated stream or other capital investment means?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nWell, we're definitely in touch with them. I'll let Haytham provide a bit of color here. But obviously, it's an asset that we like. We think it's an asset that's got good optionality and good growth potential.\n\nBut ultimately, it's got to get up and running in the first place. And so, there's no doubt that we're in discussions with Rio2 on that one. And Haytham, I don't know if you want to add some color?\n\nHaytham Hodaly -- Senior Vice President, Corporate Development\n\nYeah, you bet. Thanks for the question, Ralph. Just in terms of Phoenix specifically, we are in discussions with them. We're trying to figure out what type of capital is required over the next little while and try to figure out ways to work with them to try and fill that -- those capital needs.\n\nGenerally speaking, any time one of our partners runs in any challenges, we're always there. We're always trying to determine how to best help them, what the right path for them would be in this situation in a politically motivated decision down in Chile. You've got to tread slowly here and try to figure out how you can withstand this regime here, at least for the next couple of years.\n\nRalph Profiti -- Eight Capital -- Analyst\n\nYes. Fair enough. I appreciate that. Gary, can I ask you a question on the sustainability-linked facility? And whether or not, Gary, this opens you up to exposure on third-party ESG scores, right? And does the potential rate that undrawn amounts sort of go beyond emissions targets and the parity goals and whether or not you run the risk of sort of environmental stewardship on things may be somewhat not in your total control.\n\nGary Brown -- Senior Vice President and Chief Financial Officer\n\nWell, there's three elements, KPIs, underlying the sustainability linked component of our revolver. And the maximum change in the drawn pricing associated with achieving or not achieving those targets is 5 basis points, plus or minus 5 basis points. So one of those targets is relative to -- ties into our partners' commitments to greenhouse gas emission reductions. And so, you take 5 basis points divide it by 3, you're down to 1.6 basis points.\n\nAnd that being said, we do anticipate improvements in our baseline KPIs from that perspective. So this -- the downside risk is really negligible. And we certainly do believe that there's more -- a better chance of us reducing our cost of borrowing in this regard. Patrick?\n\nPatrick Drouin -- Senior Vice President of Investor Relations and Sustainability\n\nYes. Ralph, I'll just add, the only KPI that ties us to external rating agencies, one based on our S&P rating. The added disclosure that we had in our last sustainability report that came out in which we were actually quantifying our Scope 3 investment, GHG emissions and whatnot as well as a number of other targets that we have put in place in that report. We strongly believe that that score will be going much, much higher.\n\nSo it isn't overly concerning to us because, again, of the work we're doing in the added disclosure that we've already put into place that should be reflected in the next round of scoring by S&P.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nAnd Ralph, I'd just add one more thing. We can't hide behind our partners. There's a lot of companies in this space that have done that for years, but we are responsible for the investments that we make and for the partners we have. And obviously, we don't control them.\n\nBut, we have to do everything and we have to take ownership in terms of the fact that they are our partners on a go-forward basis. And so, we do everything to try and help them be better. And I think that's one of the things that really differentiates streaming is that focus on the relationship.\n\nRalph Profiti -- Eight Capital -- Analyst\n\nGot it. Well said. Appreciate the answers. Thank you.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nThanks, Ralph.\n\nOperator\n\nThank you. The next question comes from Charlie Rotharth of Berenberg. Please go ahead.\n\nUnknown speaker\n\nGood morning, and congratulation on the results. And thank you very much for taking my question. \n\nRandy Smallwood -- President and Chief Executive Officer\n\nGood evening.\n\nUnknown speaker\n\nYeah. Good evening. So could you please -- you highlighted in your presentation the sort of available capital that you have. In the current pricing environment, could you provide a little bit of commentary on how you're thinking about the -- streams and whether or not you're finding them more available to you at the moment?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nI'll let Haytham answer that one.\n\nHaytham Hodaly -- Senior Vice President, Corporate Development\n\nSure. Thanks for the question, Charlie. We're continuing to see a number of smaller streaming opportunities, most of them falling into the sub-$300 million range. And they're primarily development stage opportunities, not unlike what you've seen over the last couple of years.\n\nMy team is currently working through a number of due diligence processes. And to put things in perspective, we're usually looking at about 10 to 12 opportunities at any given point in time. And hopefully, we can narrow it down to one or two high quality assets that meet our requirements over the next 12 months, if all goes well. Now, keep in mind that we do have strong organic growth, especially given the success we've had on entering into these streaming transactions over the last 24 months.\n\nSo we will be able to put some cash toward that, but we will continue to look for ways to deploy our cash, but it has to be accretively over the next little while, so.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nYes. I would add that any companies that have existing operations have done relatively well in terms of commodity prices and therefore cash flow, internal cash flows. And not a lot of need for outside capital for the ones that have existing operations. And so, it just continues to focus our development set onto development companies, single asset development companies that are building mines and helping fund that.\n\nAnd there's definitely a healthy demand for that.\n\nUnknown speaker\n\nUnderstood. Thank you so much. And then, can you -- I might have missed this, but could you please remind me? Your assumptions going forward in terms of commodity prices, are they materially different to the ones that you used for this year? I'm sort of thinking of the cobalt sell off at the moment and your $33 per pound assumption for '22.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nSorry. Is that -- do you mean like with respect to gold equivalent ounces and the production forecast or...?\n\nUnknown speaker\n\nYes, I do.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nYeah, we kept them identical to make sure it was an apples-to-apples comparison. So the conversion into gold equivalent ounces for the forecast is exactly the same as it was at the start of this year.\n\nPatrick Drouin -- Senior Vice President of Investor Relations and Sustainability\n\nBut to be clear, when we look at new opportunities, we evaluate them in terms of the current spot price.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nYes. That's -- again, it's a very fluid number. I've been in this business for well over 30 years now and I still can't tell you what the price of gold is going to be tomorrow. So it's very fluid.\n\nIt's always a function. Whenever we're looking at new opportunities, it's always a function of the spot price of the day. That's what drives valuation.\n\nUnknown speaker\n\nOK, understood. Sorry, to be clear, the pricing used for this year are the same for the five and 10-year GEO calculation?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nCorrect. Yes.\n\nWes Carson -- Vice President, Mining Operations\n\nYeah, we set those numbers once a year just so that they stay consistent. So they're set kind of when we put out our original guidance, and we keep them same for the year.\n\nUnknown speaker\n\nOK. Understood. Thank you very much.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nThanks, Charlie.\n\nOperator\n\nThank you. The next question comes from Lawson Winder of Bank of America Securities. Please go ahead.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, gentlemen. Thank you for today's update and thank you for the color you've provided so far on the update on the long-term guidance. That's been very helpful. I was hoping regarding Stillwater that you guys perhaps would have a little bit more color around yesterday's update from SSW than we do, in particular, around gold.\n\nSo when you guys originally did that stream, the expectation was for around 14,000 ounces per year of gold, once it hit its run rate, is that -- like, do you have a sense of how materially that's changed?\n\nWes Carson -- Vice President, Mining Operations\n\nYeah. Overall, it hasn't changed significantly. So I mean, it does ramp up as the Blitz project comes on. But over the next year or two is really where the main impact is as the project has been slowed down slightly.\n\nBut it's not a significant impact on gold, particularly, so.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nIt's really over the next couple of years. It's -- the Blitz project and the other improvements are just taking longer to implement and no doubt further complicated by the flood events that they've had there this year.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nYes, of course. OK. Thanks for that color. On cobalt, so in the other metals category, was there any change to the longer term outlook for cobalt?\n\nWes Carson -- Vice President, Mining Operations\n\nThere was a slight drop in the long-term outlook on cobalt just really because of Voisey's Bay and some of the challenges there with the project and kind of getting those undergrounds up and running. So primarily, 2023 dropped down a little bit. So that affected the other metals for the five and 10-year.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nAnd then, I'm just trying to true up my model for Copper World, Rosemont. So in your prior guidance, what year were you assuming for a start-up of Rosemont? And now in your current guidance, what are you assuming for a start-up for Copper World?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nWe've got a very minor amount of production from Copper World at the end of the five-year guidance. So we expect it's going to be in that range. They're still firming up things on the Hudbay side. So we still await more clarity.\n\nThis is just a best guess on our part in terms of that is 4-plus years out before we see any production, but it's a very, very small amount. Where we see it coming on is really years six -- I guess, six to 10 is Copper World. If they have some success on the permitting side, this could also -- on the federal side in terms of the Rosemont portion of the project that it would immediately bring about a change in that mining plan to bring on that additional production out of Rosemont. So it's a very fluid plan.\n\nHudbay is firming things up as we speak. But we just -- we saw enough of a change in the indication here in terms of early production out of Rosemont that it warranted pulling it out of the 10-year guidance.\n\nWes Carson -- Vice President, Mining Operations\n\nIt's similar place to where it was in the previous guidance we put out earlier this year as well. So the actual timing of it hasn't changed. It's more the actual volumes that changed because of the new plan that they put out.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nOK. Got it. That's outstanding. Thank you for the help with that.\n\nAnd then, finally, I just wanted to talk about Keno Hill. Thanks for providing the IRR. 335% is pretty remarkable and hard to argue with. But I know that was an asset you guys were excited about.\n\nAnd with a much better capitalized operator coming in, I'd be curious to get your thoughts on whether it was even close in terms of the potential return on having that asset actually wrap up and produce its full capability versus the return you realize from selling it?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nWell, again, I think it needed the -- it's kind of one of these things where you have to balance holding the stream on it and determining whether the investment would have gone into the project the way it was or to back out. And we just felt that the project itself -- we've been supportive of that project for well over 10 years now, I think, close to 14 years when we did the original deal, and it just hasn't been able to deliver. And it's a challenging jurisdiction. We know that Hecla has got better capabilities.\n\nThey've got operating teams up at Greens Creek in Alaska right next door, so to speak. It's a long ways away, but then on a relative basis, right next door. And we just felt that that was the best way for that project to move forward. The price offered, we had a lot of discussions about how to continue to stream on it and so on.\n\nBut in the end, we had to look at where we felt the best return was. It would have taken us a very long time to pull $135 million out of that project. And we just felt it was time to wash our hands of it and let Hecla give it a go.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nGreat. That's clear and very well understood. Thanks very much, Randy, and thank you.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nYup. Thanks, Lawson.\n\nOperator\n\nTHank you. The next question comes from Brian MacArthur of Raymond James. Please go ahead.\n\nBrian MacArthur -- Raymond James -- Analyst\n\nGood morning. I'd like to go back to the Salobo outlook a different way. I see you haven't changed your expected payment next year. But you sort of give guidance to $550 million to $650 million to get to 36 million tons.\n\nI guess, my first question is, do you still expect to make the payment next year? Second question, I guess, do you think the ramp-up slower, so you'll pay at the lower end of that just because of the new outlook for Salobo? Or three, does it just -- can you just go through how it's scaled up -- again, the trade-off, over the 90 days, what you have to hit versus what you have to pay, what the scaling of your payment looks like.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nWell, Brian, a great question, because it's clear that Vale has some work to do. The expansion payment is measured based on total performance of the site, not just Line 3. And that's important to remember. And as we have seen and as we're reporting here right now, Line 1 and Line 2 aren't performing to spec.\n\nAnd so, they've got a lot of work to do in order to get to the full payment. And as you know, and I think just what everyone knows, it is a matrix that is based on time and throughput levels, total throughput levels, not Line 3 throughput levels, but total throughput levels. And so, we're -- I'm hopeful -- I would love nothing better than to make that full payment because that means they're up and running all the way across the board on lines 1, 2 and 3. However, there's a bit of work for Vale to do on this front.\n\nAnd you're right. I think that's probably pretty conservative. Given that there -- as I said, Line 1 took two years to get up to full level. Line 2 took 18 months.\n\nBecause it's a 90-day completion test, that means you've got to add on a quarter, when you start your test, it takes a full quarter of production to sort of satisfy that test. I think there's a pretty good chance that expansion payment might not be made until 2024. We're hopeful it's made next year. But at the same time, they've got to get this line up and running and getting it to those levels.\n\nAnd the test is based on -- I think it's 90% of throughput capacity. And so, it's going to be a challenge for them, but they're still striving for that. I don't know if you want anything to add?\n\nWes Carson -- Vice President, Mining Operations\n\nIt is slightly higher than 90% on that one. They actually have to -- $35 million to hit that -- $35 million total...\n\nRandy Smallwood -- President and Chief Executive Officer\n\nRight. $35 million to show the $36 million capacity.\n\nBrian MacArthur -- Raymond James -- Analyst\n\nAnd sorry, just on that, so it's $35 million of the $36 million, that had triggered that matrix. And I guess it's the same all the way up. So say they only got to next year, if they got the $32 million, they could actually elect -- if they ran it and they got that, you just pay them at $32 million. But is there a scenario where they're better now to wait and try and get it up to $38 million and go like two years out, and therefore, you don't pay for even two years from now or something?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nIt's a one-time trigger. They're the ones that elect when they want to initiate the test. And then, we wait over the next 90-day period, we wait and see what the results are. And in that -- at the end of that, we pay them based on their performance over the 90 days.\n\nBut it's a one-time trigger. They have only got one chance to exercise this. And so, one of the other possible scenarios as they wait, we know there's been discussion about Salobo IV. There's been no commitments on Vale's side.\n\nOne of the other scenarios they could have is to wait and complete Salobo IV and get it to the point. Now that's easily quite a number of years out, but with the increased throughput capacity, would bump up numbers. And so, it's their option to choose whenever they want to exercise it. Our best guess is still that they somehow satisfy it sometime next year.\n\nIt's probably got a bit of conservatism to it. I would think that there's a real risk of it getting pushed into 2024. As I said, I'd love to make this payment because that means that they've resolved these issues, and we're back to Salobo being the best asset in our portfolio again.\n\nBrian MacArthur -- Raymond James -- Analyst\n\nGreat. Thanks very much for the color, Randy.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nThank you, Brian.\n\nOperator\n\nThank you. The next question comes from Adam Josephson of KeyBanc. Please go ahead.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nAdam, welcome back.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nThanks, everyone. Thanks, Randy. I didn't ask you enough questions earlier, obviously. Haytham, would you mind indulge me on where you're seeing most of your opportunities? Is it from precious metals mines? Is it base metals mines? And any shift you've seen of late along those lines?\n\nHaytham Hodaly -- Senior Vice President, Corporate Development\n\nYes. The majority of the opportunities we're seeing have been precious metals from base metal mines. There are some development projects out there that are more precious metals focused but have very, very strong margins that are considering precious metal streams as well. But there's also opportunities if we wanted to, to consider taking precious metal streams and a tiny bit of base if it helps a bit.\n\nBut at this point in time everything we're looking at is precious metals focused.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nI hear you there. I think, Randy, in months or years past, you've, I think, expressed a view that silver prices is -- back to a question earlier about your commodity price outlook, appreciate that no one knows where these prices are going. But that you thought that perhaps silver and gold prices could decouple, just given all of the presumed secular opportunities for silver. And obviously, we have not seen that happen.\n\nHave you changed your thinking at all along those lines? Do you still expect silver to decouple from gold at some point? Any thoughts on that would be great.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nWell, the fundamentals haven't changed. Silver acts as a precious metal, so it provides a store value and a measured value as gold does, but silver does so much more. Silver also -- high-efficiency electronics, which in today's world, incredibly important, more and more important all the time. Silver conducts electricity better than any other noble metal.\n\nAnd so, if you want to maximize your battery length, you want to maximize your efficiency, your processing power, your solar power generation on solar panels, you have to use silver. Silver has got antibacterial qualities beyond any other noble metal. Again, water purification systems, health applications, silver just has so many other -- and to me, look around the world and look at the challenges that we face as a society in terms of trying to be more efficient and less waste. That just means that silver is going to play a bigger, bigger role in terms of making sure that we use the energy we have as efficiently as we can.\n\nAnd so, that hasn't changed. And for that, I think silver is going -- silver has got the same attributes as a precious metal, obviously, not as anywhere near as widely accepted as gold, but it has the same attributes. There are large measures of society that treat it as a precious metal, as a store of value but it also has an increasing demand on the industrial side that is becoming more and more important to society every day. And so, I do believe that it will happen eventually.\n\nIt's underperformed relative to gold. And when I -- the other side of it is, the bulk of silver production comes from lead zinc mines, and I sure don't see a lot of lead zinc mines being built nowadays. That's an area that is going to have an impact in terms of overall silver production. So you've got stress on the supply side.\n\nYou've got increasing demand on the demand side. I think all the metrics just line up too perfectly to ignore it.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nAll right. I appreciate that. And just one last one, Randy. In terms of the guidance you gave, obviously, you guys give current year, five-year, 10-year average.\n\nYou have some peers that give five-year and current year, you have some peers that give just the current year and nothing more. And I think Dave said, look, we only have so much visibility into the future, and so we just don't necessarily think giving 10-year average guidance is appropriate given what visibility we have or don't have. And so, just given all these projects that you've had moving around, delayed, etc., have you given any consideration of perhaps just giving I don't know, current year and three-year or current year and five-year as opposed to going out as far as you do, given whatever visibility you have?\n\nRandy Smallwood -- President and Chief Executive Officer\n\nAdam, I think there's a point in time, like data that's measured in a point of time is important, but I think vectors are also important. And I think by us giving 10-year guidance, what we're highlighting is that it's a continuous uptrend that we've got strength for the next 10 years going forward. And so, I think it's a vector that we're talking about. And that vector hasn't been -- hasn't changed, right? What we're looking at now is we've seen a drop in terms of the overall, but the vector, the slope of that vector, the slope of that growth hasn't changed from where it was a year ago or six months ago when we came up with our previous guidance.\n\nAnd that's a key attribute of our portfolio that I think it's important to make sure the investing public understands. I know our shareholders understand it. I mean, it's one of the attributes. So we have good long tenure growth in our portfolio.\n\nWe've got assets, I think it's close to 40 years of proven and probable and measured and indicated -- proven and probable reserves and measured and indicated resources and another -- I think, it's 19 years of inferred resources after that. There's not another portfolio out there that has that. And so, I think it's important to capture that in terms of our own production forecast. We are confident that we'll be out there.\n\nObviously, it's going to change. I'm hoping -- I know it will change because we're going to make acquisitions over the next 10 years. And so, there's no doubt that it's going to change. But I think what is important is to show that that our 10-year average guidance is higher than our five-year guidance, and that hasn't changed.\n\nThat vector is still as strong as it's ever been. And that's the important aspect of making sure that we provide that 10-year guidance. I think if you go through the precious metals industry as a whole, a lot of reasons -- a lot of people don't provide 10-year guidance because the vector is pointing in the wrong way. And they've got holes that they need to fill by making either acquisitions or by spending aggressively on organic growth.\n\nAnd that's one of the reasons why it's not embraced. But in our portfolio, we do not see that. I have to reinforce again, one of the advantages of the streaming business model is that we provide precious metal investors access to long-life base metal operations by investing and purchasing off the noncore byproduct precious metals. And so, it's a very unique portfolio that we have within the precious metals space to have such long life, long reserve life, long resource life and deliver that back.\n\nAnd so, we're comfortable with that 10-year guidance. We think it's an important thing to make sure that the investors know about out there.\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nThanks so much, Randy. I really appreciate all your answers to my questions.\n\nRandy Smallwood -- President and Chief Executive Officer\n\nThanks, Adam. And thank you, everyone, for dialing in today. In closing, we believe that we are very well positioned to continue delivering value to all of our stakeholders for a number of different reasons: firstly, by having low and predictable costs, which when coupled with leverage the increase in commodity prices, results in some of the highest margins in the entire precious metals space; secondly, by offering our shareholders exposure to our diversified portfolio of long-life, low-cost assets and the strong organic growth embedded within it; thirdly, by returning value to shareholders through our unique cash flow-linked dividend policy; and lastly, by being a leader among precious metal streamers in sustainability and by supporting our partners and the communities in which we live and operate. I do look forward to speaking with you all again soon.\n\nUntil then, please stay healthy and stay safe. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPatrick Drouin -- Senior Vice President of Investor Relations and Sustainability\n\nRandy Smallwood -- President and Chief Executive Officer\n\nGary Brown -- Senior Vice President and Chief Financial Officer\n\nWes Carson -- Vice President, Mining Operations\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nAdam Josephson -- KeyBanc Capital Markets -- Analyst\n\nRalph Profiti -- Eight Capital -- Analyst\n\nHaytham Hodaly -- Senior Vice President, Corporate Development\n\nUnknown speaker\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nBrian MacArthur -- Raymond James -- Analyst\n\nMore WPM analysis\n\nAll earnings call transcripts"
}