{
  "companyName": "Superior Uniform Group",
  "companyTicker": "SGC",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/superior-uniform-group-sgc-q2-2022-earnings-call-t/",
  "content": "Superior Uniform Group (SGC 0.40%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone. Welcome to Superior Group of Companies' second quarter 2022 conference call. With us today are Michael Benstock, the company's chief executive officer; and Mike Koempel, the chief financial officer. As a reminder, this call is being recorded.\n\nThis conference call may contain forward-looking statements regarding the company's plans, initiatives, and strategies and the anticipated financial performance of the company, including, but not limited to, sales and revenue. Such statements are based upon management's current expectations, projections, estimates, and assumptions. Words such as will, expect, believe, anticipate, think, outlook, hope, and variations of such words and similar expressions identify such forward-looking statements. Forward-looking statements involve known and unknown risks and uncertainties that may cause future results to differ materially from those suggested by forward-looking statements.\n\nSuch risks and uncertainties include, but are not limited to, the following: the effect of COVID-19 crisis on the U.S. and global markets, our business, operations, customers, suppliers, and employees; general economic conditions in the areas of the United States in which the company's customers are located; changes in the markets, where uniforms are worn, where promotional products are sold and where call center services are used; the impact of competition; the company's ability to successfully integrate operations following consummation of acquisitions and the availability of manufacturing materials, as well as the risks and uncertainties disclosed in the company's periodic filings with the Securities and Exchange Commission, including, but not limited to, the company's annual report on Form 10-K for the year ended December 31, 2021, and the quarterly reports on Form 10-Q. Shareholders, potential investors, and other readers are urged to consider these factors carefully in evaluating the forward-looking statements made herein and are cautioned not to place undue reliance on such forward-looking statements. The company does not undertake to update the forward-looking statements contained herein except as required by law.\n\nWith that, I'd like to turn the call over to Mr. Benstock.\n\nMichael Benstock -- Chief Executive Officer\n\nThank you, operator. Good afternoon, everyone, and welcome to our second quarter 2022 earnings call. This afternoon, I will share SGC's performance highlights and touch on the current operational and macro environment. After that, Mike will provide our financial update.\n\nFor the Q&A session, we will be joined by chief strategy officer, Phil Koosed; Andy Demott, our COO; Jake Himelstein, president of our branded products segment, as well as Catherine Beldotti Donlan, the new president of our healthcare apparel segment. Superior Group of Companies continues to perform well despite the slowing economy, inflation, rising interest rates, excessive supply chain and logistical costs, and challenges across our core businesses, just as others are experiencing, we are seeing a more challenging operating environment. SGC has a long operating history, and we have shown resilience through various economic cycles due to our ability to provide innovative products valued by our customers, a broad product and geographical market reach, and a strong focus on improving market share and profitability. During the second quarter, as part of our long-term focus on future success, the company began the transition of key leadership positions as previously communicated with the addition of Catherine Beldotti Donlan, president of healthcare apparel; and Mike Koempel, our chief financial officer.\n\nThe transitions have been seamless with the support of Peter Benstock serving as healthcare apparel advisor and Andy Demott former chief financial officer, continuing to serve as chief operating officer until both of their retirements. We also added management expertise in supply chain and distribution to support future retirements and our long-term growth objectives. This strategic review of our businesses and the current alignment of our business segments will enable us to better optimize the efficiency of our resources. We've positioned SGC in a more focused manner, thereby creating a more effective framework to serve our customers, increase our revenues and maximize shareholder value.\n\nAfter a thorough review, we have reorganized the business along three business segments: healthcare apparel, branded products, and contact centers. Notably, we invested in our technology across all of our businesses. Our state-of-the-art robotic system at our Eudora, Arkansas distribution facility is already showing a return on investment in the form of lower operating costs and quicker order fulfillment. Our unified back end for all of our customer-facing website is now in place for all of our uniform customers creating better future efficiency and implementing technology enhancements, just a couple of examples that demonstrate the opportunities of further technology-led savings across our organization.\n\nTurning to our results. Second quarter consolidated revenues grew 13% to $147.9 million versus the second quarter of 2021, while our gross margin declined during the quarter due to higher cost of goods sold. We also reported higher SG&A costs primarily due to higher employee costs related to headcount and sales commissions along the rise in depreciation and amortization. Due to non-cash impairment charges, we had a net loss in the quarter.\n\nThese results certainly fell short of our expectations, but are not reflective of SGC's true long-term potential. Let's take a closer look at the quarterly results for each of our businesses. Starting with our healthcare apparel segment, our sales were $26.3 million, up 30% versus the prior-year quarter. Beyond the carryover effect of accelerated purchases resulting in customer stockpiling inventories in PPE during COVID-19 and the deteriorating economy, our customers have taken a more cautious approach toward ordering seeing a reduced need for inventory replenishment, and we have experienced a slowdown in order flow, as a result.\n\nWe, therefore, opted for the prudent approach of marking to market the value of our inventory and are rightsizing our segments, as well as greatly increasing our sales and marketing initiatives to mitigate the impact of the current conditions. We expect that this change in demand will be temporary, but the timing of the turnaround is difficult to predict. For now, we are aggressively enhancing our omnichannel approach to sales and marketing through the addition of new and experienced leadership, as well as technology for the healthcare apparel segment. Additional sales initiatives will better position the segment to broaden its market access.\n\nAnd as the economic headwinds dissipate, we anticipate our revenue growth will turn toward historic levels. Concurrently, we are focused on creating a leaner, more efficient business by identifying areas to save operating expenses in order to improve margins. Our branded products division grew 29% over prior year, as we generated record second quarter revenue of $102 million and a gross profit of $29.1 million. Our SG&A expense was up, as we increased our investment in this business to support future growth, including expansion of our sales force.\n\nThe segment had an operating loss of $4.7 million, primarily the result of one-time charges related to goodwill and tradename impairments, PPE-related inventory write-downs, as well as higher amortization expenses related to past acquisitions. From an operating perspective, the global supply chain for branded products continues to be a challenge. While many in-person events and conferences have returned, higher interest rates and recession concerns have led many companies to pause or reduce their marketing spend until there is more clarity with respect to the future. We have seen this manifest itself in reduced bookings by existing customers in recent months, which we expect to impact their revenues for the remainder of the year.\n\nAcquisition-wise, we acquired Guardian Products during the quarter. Guardian represents a continuation of our external growth strategy and aligns well with our acquisition of Sutter's Mill last year. Guardian and Sutter's Mill serve similar end markets, and we have already started to see the benefits of leveraging in-house decoration and production capabilities at Sutter's Mill to better serve Guardian's expanding client base. It is important to know that we have recently completed most of the integration of HPI and BAMKO.\n\nThe integration of sales and marketing, in particular, completed last year has already resulted in a robust pipeline of more RFP opportunities. Given the time it takes to close, branded uniform opportunity deliver products within the segment, we would not expect to see revenues associated with these efforts until the middle of 2023. Our third segment, contact centers, known as The Office Gurus, is recognized as the leader in providing nearshore customer contact management to smaller and midsized companies, many of whom have not previously outsourced these services. Our contact centers offer customized outsourced services and a technology offering that provides seamless representation of a client's organization at a more favorable cost versus in-house solutions.\n\nIt is an attractive business with very strong growth rates, a significant total addressable market, and very attractive margins. During the second quarter, we added 486 billable agents, 74% of them from existing customers. We had originally anticipated adding 600 billable agents for all of 2022, but have already put place over 850 during the first half of the year, a reflection that demand for our nearshore value proposition continues to be at all-time highs. We onboarded multiple new clients as well during the quarter that we believe will result in significant revenue growth over the balance of this year and next.\n\nOur contact center segment recorded revenues of $21.5 million in the second quarter, up almost 40% year over year. Our gross margin of 59.5% reflects the attractiveness of this business, and we are laser-focused on adding to our portfolio of customers. We're excited about adding another contact center facility to the successful business model in Q3 in the Dominican Republic. We understand we have a lot of work ahead of us but believe many of the initiatives we have put in place will enable us to enhance our results, as we move ahead and the economic challenges begin to abate.\n\nWith that, I'll turn the call over to Mike to take us through the financial highlights.\n\nMike Koempel -- Chief Financial Officer\n\nThank you, Michael, and good afternoon, everyone. Turning to the financial highlights of the second quarter, SGC reported consolidated revenues of $147.9 million versus $130.8 million during the second quarter of 2021, an increase of 13%. Our gross margin was 32.5% for the quarter, compared to 36.1% in the second quarter of 2021. The gross margin reduction was primarily driven by $4.5 million in inventory write-downs on excess inventory related to personal protective equipment and discontinued styles.\n\nGross margin also continued to be impacted by higher logistics costs. SG&A expenses as a percent of sales were 31.1% for the quarter, compared to 25.9% for the second quarter of 2021. The increase as a percent of sales was due to expense deleverage resulting from the 30% decrease in healthcare apparel sales. In addition, we had higher expenses associated with additional headcount to support growth in our branded products and contact center segments, depreciation and amortization, executive hiring and related transition costs, and investment losses related to our supplemental retirement plan.\n\nThe net loss was $26.7 million or $1.70 per diluted share, compared to net income of $6.4 million or $0.40 per diluted share for the second quarter of 2021. In the second quarter of 2022, the company recognized pre-tax non-cash impairment charges related to goodwill of $24.5 million or $23.6 million net of tax or $1.50 per diluted share, and tradenames of $5.6 million or $4.4 million net of tax or $0.28 per diluted share. In the second quarter of 2021, the company recognized a pre-tax non-cash settlement charge related to the termination of its defined benefit pension plans of $6.9 million or $4.5 million net of tax or $0.28 per diluted share. On an adjusted basis, which excludes the above charges in 2022 and 2021, second quarter net income was $1.3 million or $0.08 per diluted share, compared to net income of $10.9 million or $0.68 per diluted share for the second quarter of 2021.\n\nAs it relates to the tradename impairment, in the second quarter, the company began an effort to centralize certain branding and go-to-market strategies under the BAMKO brand and determined that it would no longer use certain tradenames associated with promotional products. The company's rebranding efforts resulted in the aforementioned impairment of tradenames related to its branded products. We view centralized branding as a very positive development for our branded product segment, as it removes any confusion surrounding the various brand names in the market and centralizes all efforts under BAMKO, which is one of the strongest and most recognizable names in the industry. SGC remains well capitalized and continues to operate effectively across all of its markets.\n\nSGC has shown its resilience by managing through challenging times with a continued emphasis on profitable growth opportunities by focusing on improving operational and financial efficiencies. In terms of the balance sheet and cash flow, cash and cash equivalents, as of June 30, 2022, were $10.3 million. Consistent with prior quarters, operating cash flow continues to be negatively impacted by elevated inventories. Over the last two quarters, we have reduced our buying levels, and based on product lead times, we expect inventories to decline later this year with a goal of returning to normalized levels of inventory and improve turns in 2023.\n\nLowering inventory, which is our largest asset, will drive significant improvement in working capital over time. While our leverage ratio of 3.3 times trailing 12 months' EBITDA is slightly elevated, it remains well below our covenant limit and will also improve based on our working capital efforts. Following a significant investment in warehouse automation last year, we are targeting a lower level of capital expenditures this year, less than 2% of sales, and we will continue to carefully scrutinize our investment for the balance of the year. SGC remains committed to returning capital to our shareholders and announced a dividend of $0.14 per share during the quarter, a 17% increase from last year.\n\nIn addition to our focus on driving working capital improvements, the management team also evaluated our organizational structure and identified opportunities to improve operating efficiencies, as well as our service to our customers. We expect these opportunities to achieve at least $8 million of annualized cost savings, while still maintaining our focus on consistent sales growth. Lastly, in terms of guidance, based on the current economic environment, our expectation is to achieve sales of $575 million to $590 million for 2022. With that, I would like to ask the operator to open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Kevin Steinke with Barrington Research. Please go ahead.\n\nKevin Steinke -- Barrington Research\n\nHey. Good afternoon, everyone, and Mike, welcome, and welcome to the call. I wanted to start off by asking about you mentioned a robust pipeline for HPI, obviously, given lead times, probably not translating revenue until mid-2023. So that indicates to me that your competitive position and sales pipeline is still strong despite what sounds like a near-term slowdown in ordering patterns and buying patterns.\n\nSo I just kind of wanted to see if you could talk a little bit more about those to somewhat competing dynamics and how you're continuing to think about your long-term outlook.\n\nJake Himelstein -- President of our Branded Products Segment\n\nYeah. Kevin, this is Jake Himelstein. I'll take that one. Yes.\n\nI mean, look, the combination of BAMKO and HPI, which we did with sales and marketing last year has really resulted in some really robust pipeline. We've talked about it in the last couple of calls, and we're really excited about where we are right now. And I think the economy, where it is and sort of some of that pullback you referred to, actually helps us in this regard, right? When times are tough, procurement goes out and tries to look for a new vendor, try to save costs, tries to bring in better partners. And the offerings that we can provide now that HPI and BAMKO together, nobody in the marketplace can touch them.\n\nAnd you're right, it will take some time to see the revenue on these come through given the size of the opportunities and how long they take to pull through the revenue. But this is quite literally the most robust pipeline that we've ever seen, right? We have now a combined group of sales reps that are going after branded merchandise and branded uniforms, largely the same buyers at our clients, and so it just makes sense to go after them together, and that's resulting in a pipeline that we've never seen before. So yes, you're right. The short-term pain of the economy certainly has had an impact.\n\nBut the result is that our pipeline is great, and we're really excited about whether that's going to lead us to in the coming quarters.\n\nKevin Steinke -- Barrington Research\n\nOK. Thanks. That's helpful. And related to that, you mentioned investing in your sales force in the branded products segment, kind of a short-term impact on margins, but also an indication, I guess, of your positive long-term outlook in that business.\n\nSo maybe talk about that your efforts to hire more on the sales side and if you expect that to continue in the coming quarters here?\n\nJake Himelstein -- President of our Branded Products Segment\n\nYeah. So in the branded products segment, there's 100,000 sales reps in the U.S. in this industry. So it is full of sales reps, many of which are commission-only sales reps.\n\nAs our competitors struggle in the current operating environment, we're really appealing landing spot for sales reps and for clients. We go through a really painstaking process of evaluating candidates to make sure they're the right fit for us. And we only take ones that are the right fit for BAMKO and kind of immediately start generating revenue. But what we see in tough times that our competition will tend to cut back on things like technology, our operational personnel, and we're investing in that, right? We've talked about that last couple of quarters, the amount we've invested in things like technology in our warehouses.\n\nThat makes us a really, really appealing landing spot and gives us really pick of the litter in terms of who we want to come onboard and sell for us, which is really advantageous for us.\n\nMichael Benstock -- Chief Executive Officer\n\nYeah. And I will add, this is Michael. Hi, Kevin. During COVID when most of our competition started going off and going into fetal position, we were able to add, I think it was 20-some-odd salespeople, almost like a 40% increase in the number of salespeople we had selling our products and you saw the robust growth that happened at BAMKO, as a result of doing so.\n\nAnd we're looking at it exactly the same way. We need to be very, very aggressive in adding people. The first half of the year, we did add people, not as many as we did in 2020 and 2021, but we're back to being in a very, very aggressive mode. And we think this is a time that we want to take more market share, we want to be able to bid on more opportunities..\n\nWe're a bigger company. We can handle even larger opportunities than perhaps we've ever handled before, and we could do it better than anybody. So I would tell you that BAMKO is highly regarded by our competitors' sales forces, and many of them would give anything to even be considered by BAMKO for employment. And we're going to -- we're going to capitalize on that over the -- over the coming quarters.\n\nKevin Steinke -- Barrington Research\n\nOK. Great. And also within branded products, obviously, combined now in terms of HPI and BAMKO, are you seeing similar slowdown in, I guess, what used to be those two separate segments in terms of promotional products or brand and promotional products and branded uniforms is the slowdown kind of universal across the product line in terms of ordering patterns?\n\nJake Himelstein -- President of our Branded Products Segment\n\nI think it does depend on the sector, and it depends on the type of company, right? Retail is still buying at the pace it was before. Certainly, look at the airline customers, and they can't get employees quickly enough and the turnover that they're having certainly puts more people in uniforms every day. But it depends on sector, right? High-growth type companies that may have been spending a lot on at-home gifting, maybe they cut back this year. But other companies, large tech companies that are steadier, that are really fighting for talent, they want to use money to try to attract and retain employees and new customers.\n\nAnd so we're doing still a lot of programs around that. That really took off starting in 2020, where people were sending gifts to people's homes, not just customers -- not just employees, but customers as well, and we're seeing more of those programs than we've ever seen. That continues to take off.\n\nMichael Benstock -- Chief Executive Officer\n\nWe're also -- we're also hearing that television advertising and other means of advertising is not quite as successful as it once was. And so everybody is looking for a new way to gain customer and employee loyalty, and we saw that during COVID and we will see that again. And I guess, it's a data complete at this point that we're going into some kind of recession, we're not already in one. But we've managed through every recession to grow market share, and we'll do so this time as well.\n\nThat's our belief.\n\nKevin Steinke -- Barrington Research\n\nOK. Understood. I guess switching to the Healthcare -- new healthcare apparel segment. Obviously, as you mentioned, there was the COVID-related headwind from the elevated buying last year.\n\nYou also talked about it, I think, a slowdown in order inflow and less inventory build by customers. Should we think about that as being kind of both on the CID and the fashion seal healthcare portions of that segment?\n\nMichael Benstock -- Chief Executive Officer\n\nI'll give you a short answer. I'll let Catherine chime in. Seeing as Catherine has been with us just a little bit over 60 days now. But yes, I think that's a correct assessment that the stockpiles and inventory that the laundries had are still not worked out.\n\nIt takes a little bit longer for them to work out. The stockpiles that nurses have in their closets, as a result of spending so much discretionary money during COVID, as they were working very hard, very long hours, weren't didn't find a lot of other places to spend it except on themselves and uniforms will dwindle over time as well. But it's going to take some time. I -- but I still think, and I've said it before on these calls, that one of the greatest opportunities for us is within the healthcare business.\n\nAnd I'll let Catherine speak about our -- some omnichannel strategies. And obviously, she's an expert. She comes from a background of having served all channels in retail and wholesale and so on in detail. Catherine, why don't you jump in and say hello to our shareholders.\n\nCatherine Donlan -- President, Superior Uniform Grou\n\nSure. It sounds good. Thanks, Michael. Hi, Kevin.\n\nNice to meet you. The first thing I wanted to add is how excited I am to be here, and what I believe is just explosive opportunity when we think about the future and the healthcare professional in a growing environment. But today, we are faced with and the consumer is faced with some economic headwinds and that the healthcare professionals dollars are being pulled elsewhere. And so as the demand stabilizes both from the consumer and with our retail partners, we're really focused on bringing to market the most innovative consumer right product that best serves the healthcare professional.\n\nAnd how we bring that out? We're really going to focus on marketplace management and really meeting the consumer, where they're at. And that, to Michael's point, is very much omnichannel shift for us to really focus on how the brand in our product shows up across the digital ecosphere.\n\nKevin Steinke -- Barrington Research\n\nOK. Yeah. Thank you for that commentary, that was helpful. And yes, I should add my welcome to you as well, Catherine.\n\nSo as we think about the gross margin, you mentioned the inventory write-downs. Is that largely related to PPE you mentioned, I think, some other products, but I just wanted to see if you could break that down a little bit more.\n\nMike Koempel -- Chief Financial Officer\n\nSure, Kevin. Hi. This is Mike. It's nice to meet you on the phone for the first time.\n\nAnd so to answer your question, yes, I would say about two-thirds of what we recorded for the quarter was PPE related as opposed to discontinued styles.\n\nKevin Steinke -- Barrington Research\n\nOK. OK. Thanks for that. And when we -- I guess, when we also think about cost and gross margin in the quarter, you had talked last quarter about implementing price increases that you thought would pretty much offset the inflationary hedging wins you're seeing at that time.\n\nDo you think that was largely the case in the quarter that you were able to offset inflation? Or do you see the need to raise pricing further?\n\nMike Koempel -- Chief Financial Officer\n\nYeah. I mean, maybe I'll start and then I don't know if Jake or Catherine want to talk about the pricing. But I would say, by and large, Kevin, for the quarter, I think the price changes that we've been able to implement with not a lot of resistance, I don't believe, have been able to largely offset. I mean we're still seeing some increased cost, obviously, as it relates to some of the freight and logistics.\n\nBut I'd say, by and large, we've been able to mostly offset that pressure with some price changes.\n\nKevin Steinke -- Barrington Research\n\nOK. Great. Then I wanted to ask you about the selling and administrative expense line, costs up there sequentially, and you again talked about continuing to invest in the management team, the management infrastructure to build an organization for the longer term. Should we kind of think about those expenses leveling out here, is the hiring leveling out? Just trying to get a sense, as to how you would think about that expense line run rate going forward.\n\nMichael Benstock -- Chief Executive Officer\n\nThis is Michael. I'll take a stab at that and anybody else can jump in. But the largest of those have been done. And as we've said, these -- in some cases, Catherine's case, Peter is still on the payroll until we determine likely first quarter, Andy as well sometime between now and then when they're through transitioning, they'll move up as well, as the others that we mentioned in the earlier script.\n\nThere still will be some additions, but I wouldn't say it's quite leveled off yet, but the offsets will be substantial. We spoke about $8 million of savings on an annualized basis. Some of those have already been implemented. And Mike correct me if I'm wrong, I think the impact of this year will be somewhere in the neighborhood of about 20% is what you calculated.\n\nIs that correct, Mike?\n\nMike Koempel -- Chief Financial Officer\n\nYeah. Yeah. Yeah. That's about right and that could be offset to some degree by some one-time costs, as we execute that.\n\nBut I think that's the case. And obviously, we'll be in position definitely by the end of the year to have the annualized savings locked in for 2023.\n\nKevin Steinke -- Barrington Research\n\nOK. Understood. So you'll get about 20% of those $8 million of cost savings benefiting 2022 and then annualize that into next year.\n\nMichael Benstock -- Chief Executive Officer\n\nCorrect. Correct. Yes.\n\nKevin Steinke -- Barrington Research\n\nOK. I guess just lastly for me here -- well, maybe a couple more, actually. You mentioned that you expect just your inventory, investments in inventory to maybe level off, or that not to be as much of a drag going forward. Does that indicate you've seen some easing of supply chain pressures.\n\nMichael Benstock -- Chief Executive Officer\n\nIt's not related necessarily to supply chain. Yes, we definitely have seen the easing of supply rate -- supply chain pressures, but not the cost of the supply chain. While there have been some reductions in some of the logistical costs, Kevin, we were paying at the height of the supply chain, logistical problems, not very long ago, actually, we're paying $30,000 to get a container out of China. And that's considerably less today, nearly half -- but it's still 2.5 times what it was pre-pandemic.\n\nBut the supply chain, we've compensated -- we began compensating over a year ago for the supply chain disruptions that were. So I mean one of the reasons why our inventory is a little bit bloated is because we moved early on and we didn't expect the -- we didn't know when the supply chain would repair itself. It hasn't completely repaired itself, but our planning has helped repair or at least mitigate some of the impact and some of the things that we expected to take a longer time came in sooner than we expected. So we're sitting with loaded inventories.\n\nWe should -- we're about at the peak now, and we should see a continuation of reduction now in our inventories going well into next year and might has probably a better time table than I have on that at hand.\n\nMike Koempel -- Chief Financial Officer\n\nYeah. I would say, Kevin, we should -- and I think we've said this before, I think as we reduced buying levels early this year, based on our lead times, we'll start to see some step down in inventory later this year more significantly next year. I think to your question, I think we always want to continue to be mindful of potential supply chain risk. We certainly don't want to go ditch to ditch so to speak.\n\nSo we'll be mindful, obviously, about the inventory reductions. But we definitely feel like we have opportunity to improve turns and still protect the business that protects sales going forward.\n\nKevin Steinke -- Barrington Research\n\nAll right. That's helpful. Understood. And then just lastly on the $575 million to $590 million revenue outlook for 2022, I don't know if you'd be willing to provide any just color around segment outlook and how segment outlooks and how that builds into that consolidated outlook for the year?\n\nMike Koempel -- Chief Financial Officer\n\nYeah. I would say, Kevin, the range -- I think the range implies that I think we'll continue to see some of the trends that we've experienced so far this year. There's obviously opportunities in the contact centers segment. I think for us, the healthcare, as you know, first and second quarters has been challenging.\n\nSo I think the Healthcare segment, I think, plays more into driving that range from a low end to high end, depending upon how quickly we might see that return. So I'd say those are a couple of the drivers, if you will, in the range and how we develop that.\n\nKevin Steinke -- Barrington Research\n\nAll right. Well, thanks for all the insight, and thanks for taking the questions. So it's all I have for now.\n\nMichael Benstock -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Tim Moore with EF Hutton. Please go ahead.\n\nTim Moore -- EF Hutton -- Analyst\n\nThank you. It's nice to see the three legs of this tool and to get the more granularity on healthcare business and the omnichannel penetration that Catherine was talking about. I also found in your presentation about social responsibility slide with screening suppliers, but I'm just going to jump into my questions, a lot of them have been answered already. But I was just wondering, for your prior four-year growth targets, do you intend to maybe share the growth rates for the new segments sometime later in mid-2023 when the care inventories normalize? I noticed $1 billion goal now -- now mentioned just in the coming years.\n\nMichael Benstock -- Chief Executive Officer\n\nThe $1 billion goal has not changed. We will be recasting our guidance with respect to the segments in a later quarter. We're not prepared to do it right now. It's why we gave guidance for the year instead, which is something, Tim, we don't usually do.\n\nBut we might continue doing in the future. We won't be as transparent as possible. But the combination of HPI and BAMKO is going to lead to some wonderful opportunities in the future. And I can tell you we've already closed some of those opportunities, and we're a finalist on quite a few as well.\n\nSo I think we'd be best off recasting when we have more clarity around it. But we feel very confident at least in the total number that we've provided.\n\nTim Moore -- EF Hutton -- Analyst\n\nGreat. That's helpful. And that's kind of what I expected when I saw the coming years mentioned. In that slide that now mentions 400 basis points of margin improvement, is that basis off of 2021? Or is it kind of based on maybe what 2022 will be?\n\nMike Koempel -- Chief Financial Officer\n\nYeah. I'd say -- Tim, you're talking about -- yes, on the basis point improvement on operating results.\n\nTim Moore -- EF Hutton -- Analyst\n\nYep. The 400 basis points mentioned on the slide?\n\nMike Koempel -- Chief Financial Officer\n\nIt'd be based largely off of 2022.\n\nTim Moore -- EF Hutton -- Analyst\n\nOK. That's what I thought it was. And I just wanted to do a follow-up question on the gross margin, things going on there for the contraction, they all make sense. And I was wondering if you had any kind of estimate of how long it might take to get the higher logistics costs to be more neutral of an impact? Is that more of an early 2022 story when some -- some more $8 million of cost savings start to kick in?\n\nMike Koempel -- Chief Financial Officer\n\nYes. I mean I think we'll obviously start to lap some of the increases that we've been feeling. I think that we're planning, I think, fairly conservatively. Obviously, we -- it's difficult to predict what's going to happen with logistics costs.\n\nI can tell you that we've seen variability in some of those costs just in the last 6 months. Obviously, all up versus pre-pandemic, but still somewhat volatile. So I think, Tim, we're still expecting to see some pressure going forward and trying to manage those as best we can. But at this point, again, still anticipating we'll continue to see some pressure through the supply chain.\n\nMichael Benstock -- Chief Executive Officer\n\nYeah. I'll jump in. I recently spent time in Vietnam at -- and visited with the -- with the port there and with one of the largest carriers there, who we contract with to move most of our merchandise out of Vietnam and other places, and they felt there was going to be a little bit of a softening of the market toward year-end. That would have -- that would begin to affect us on inventory we received in second quarter next year and inventory that we would sell in the third quarter and fourth quarter next year and later.\n\nSo I don't think we're going to see any immediacy to an improvement -- a drastic improvement in gross margin is that -- except that we don't expect to have the extent of write-offs that we had related to COVID in this quarter, and that certainly will go a long way toward helping the margin.\n\nTim Moore -- EF Hutton -- Analyst\n\nThat's helpful, Michael. Yes. I was kind of wondering, you mentioned that you were in Vietnam, maybe earlier this [Technical difficulty] it was probably maybe your first time back to [Technical difficulty] COVID started. Did you pick up any -- any other trends or any other takeaways that was interesting? Like anything else going on over there or how they're adapting in the last two years?\n\nMichael Benstock -- Chief Executive Officer\n\nI was just happy, I didn't pick up COVID, but I do see a softening in the market, the Vietnamese factories because retailers have been canceling on them left and right, that there is a lot of open capacity, which there hasn't been for a long time. And the more open capacity, the more ability we have to negotiate better on garment production on the actual sewing, cutting, sewing of our garments. But we're hearing the same thing from the Chinese mills as well because of all those cancellations, obviously, back tracks all the way to the textile mills. We also have the textile industry in Vietnam has matured somewhat since before COVID.\n\nThere have been a lot of investments in textiles there. We're actually sending a team there in September to look at all the various textile opportunities are there because we can -- if we can manufacture products in Vietnam from fabrics made in Vietnam, we can cut significant time frames out of our lead times, and obviously, that will result in more cash in our pocket from a standpoint, we'll be getting goods some sooner and be making deposits later and so on. So it all bodes well. I think we're in very, very good stead from a standpoint of our supplier relationships, and we have a lot of new suppliers, who are begging us to give them work at this point, which creates a nice competitive environment for us.\n\nTim Moore -- EF Hutton -- Analyst\n\nThat's great color to hear, and that's perfect that you were over there recently to get that the read. [Technical difficulty] clarification for the $8 million in cost savings, does that include -- I don't know if I calculate this correctly, about $2.4 million from the robotics warehouse? Or is that separate because that was a manual?\n\nMichael Benstock -- Chief Executive Officer\n\nYes. That's correct. It does include that.\n\nTim Moore -- EF Hutton -- Analyst\n\nAnd I know this was alluded to earlier by Mike, I'm just trying to wrap my head maybe around the capital benefit timing, is it going to be fourth quarter loaded -- or does it really [Technical difficulty] into the first quarter of next year and 2023 when you see some of the help from the inventory unwinding on the healthcare apparel side?\n\nMike Koempel -- Chief Financial Officer\n\nYeah. I would say, Tim, I mean we're going to push hard to realize as much as we can later this year. But I think I would anticipate that we'd see a bigger impact in 2023.\n\nTim Moore -- EF Hutton -- Analyst\n\nAnd what you know just -- what are you kind of looking at out there for kind of replenishment signs? And how do you track it for at least on the retail, fashion, healthcare apparel side? What are you doing on that front to really read that and make sure it's not -- it's -- who knows? I mean [Technical difficulty] pass, I don't know, but I'm just kind of curious.\n\nMichael Benstock -- Chief Executive Officer\n\nIt's a good question. Catherine can respond on the retail side for sure. Catherine, why don't you jump in there?\n\nCatherine Donlan -- President, Superior Uniform Grou\n\nYeah. Sure. So we've spent quite a bit of time really focused on not only understanding but analyzing for future demand our POS data and how we use that to inform our go-forward strategies. So being a very heavy replenishment business, that's critical for us to really make sure that we are able to use that data from really being clear on what the consumer is responding to and making sure that we are rightsizing our own inventory levels, as demand stabilizes in the marketplace.\n\nMichael Benstock -- Chief Executive Officer\n\nYes. I'll complement Catherine that she has taken that to a whole new level from an analytics standpoint and also from a relationship standpoint with our retailers in gaining their trust to be able to share a lot more data than they ever have with us, so that we can get more clarity around that and respond and service them better.\n\nTim Moore -- EF Hutton -- Analyst\n\nPerfect. That's very helpful to hear. And I can really appreciate that having studied a lot of marketing. My last question is, I'm kind of curious, how is the acquisition integration going for -- I know, Guardian is only a couple of months, how is the Sutter's Mill is going, and there really aren't Guardian integration.\n\nJake Himelstein -- President of our Branded Products Segment\n\nYes. I'll take that. It's Jake. It's going great.\n\nI mean, it's been really good. We've been really happy with the progress. And Guardian represents a really great complement to our team, which what we're already doing so well. And the combination of Guardian and Sutter's Mill, we've already done a lot of integration work there, both going after similar end markets in the auto business, but not cannibalizing each other selfs at all, in fact, perfectly complementary, and, in fact, growing each of their businesses.\n\nAnd each colleague that we're on together, we're more and more excited about the potential in the future. But right now, we're really laser-focused on continuing our -- the effort of integration and continuing our organic growth. With so many initiatives that we're focused on for the next couple of years that if the perfect fit comes along, we'll look at it. But right now, like there's so much to be excited about with the recent acquisitions we've done, and we're laser-focused on integrating them.\n\nTim Moore -- EF Hutton -- Analyst\n\n[Technical difficulty] And that's it for my question.\n\nMichael Benstock -- Chief Executive Officer\n\nAll right. Well, I want to thank everybody for joining us. Look forward to better news, as time goes on in future calls. In the meantime, enjoy the rest of your summer, and we'll see you in the fall.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Benstock -- Chief Executive Officer\n\nMike Koempel -- Chief Financial Officer\n\nKevin Steinke -- Barrington Research\n\nJake Himelstein -- President of our Branded Products Segment\n\nCatherine Donlan -- President, Superior Uniform Grou\n\nTim Moore -- EF Hutton -- Analyst\n\nMore SGC analysis\n\nAll earnings call transcripts"
}