{
  "companyName": "Conduent Incorporated",
  "companyTicker": "CNDT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/conduent-incorporated-cndt-q3-2022-earnings-call-t/",
  "content": "Conduent Incorporated (CNDT -1.46%)\nQ3 2022 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Conduent third quarter 2022 earnings announcement. [Operator instructions] Please note that this conference is being recorded. I will now turn the conference over to our host, Giles Goodburn, vice president, investor relations. Thank you.\n\nYou may begin.\n\nGiles Goodburn -- Vice President, Investor Relations\n\nThank you, operator, and thanks, everyone, for joining us today to discuss Conduent's third quarter 2022 earnings. We hope you had a chance to review our press release issued earlier this afternoon. Joining me today is Cliff Skelton, our president and CEO; and Steve Wood, our CFO. Today's agenda is as follows.\n\nCliff will provide an overview of our results and a business update, Steve will then walk you through the financials for the quarter, as well as providing a financial outlook. We will then take your questions. This call is being webcast, and a copy of the slides used during this call, as well as the press release were filed with the SEC this afternoon on Form 8-K. This information, as well as the detailed financial metrics package are available on the investor relations section of the Conduent website.\n\nDuring this call, we may make statements that are forward-looking. These forward-looking statements reflect management's current beliefs, assumptions and expectations and are subject to a number of factors that may cause actual results to differ materially from those statements. Information concerning these factors is included in Conduent's annual report on Form 10-K filed with the SEC. We do not intend to update these forward-looking statements as a result of new information or future events or developments except as required by law.\n\nThe information presented today includes non-GAAP financial measures. Because these measures are not calculated in accordance with U.S. GAAP, they should be viewed in addition to and not as a substitute for the company's reported results. For more information regarding definitions of our non-GAAP measures and how we use them, as well as the limitations to their usefulness for comparative purposes, please see our press release.\n\nAnd now, I would like to turn the call over to Cliff.\n\nCliff Skelton -- President and Chief Executive Officer\n\nThank you, Giles. Welcome, everybody. Glad to have you with us today. Let me begin by saying that Q3 felt pretty good for us.\n\nOur adjusted revenue came in at $977 million, right where we expected it to be, and adjusted EBITDA at $105 million with a 10.7% margin, both slightly better than expected. So very pleased with how Q3 came out, especially given the economic conditions we're all experiencing these days. Our new business ACV signings were quite strong at $191 million, one of the best Q3 we've had, and so we like our overall sales performance, especially from our account management teams. Net ARR activity continues to be positive at $70 million.\n\nNow as I've discussed in the past, that net ARR activity metric is going to be lumpy from quarter to quarter. And what we want to see is a positive number every quarter because it means we're selling more than we're off-boarding or losing, if you will. One loss or win, especially in the public sector, can skew any individual quarter but not the historical trend. In addition to having a strong sales quarter, we also see an expanding pipeline that bodes well for the future, especially in the public sector.\n\nSteve is going to get into that here in a moment. We are also optimistic because we've got a lot of big deals on the horizon, again, especially in the public sector. We expect to land a few of these, which should be meaningful. A couple of other key highlights in Q3 that we're quite proud of.\n\nWe were named as a leader in customer experience in all four categories examined by ISG. These categories were digital operations, AI and analytics, work from home and social media. Just to put that in a little context, only four or five customer experience firms achieved leader in all four categories out of 25-plus companies reviewed. Also, Newsweek named Conduent among its 2022 top 100 most loved workplaces.\n\nIf you think about it, that's quite remarkable given the number of companies evaluated. This is from all industries and all sectors. So to finish in the top 100 is quite a feat. Now there are a lot of ups and downs on the horizon here, to include what's happening in the economy, what's happening with interest rates, what's happening with the notion of a recession and how it all impacts our clients and their end customers.\n\nThese macroeconomic factors are certainly considerations for our future planning. Nevertheless, we're at a point in time where the hard foundational work, so necessary for referenceability and retention, transitions in some regard to our planned pattern of growth. We've taken several tactical actions along this path. We integrated our separate sales and marketing teams into our lines of business.\n\nThe idea here is that we're under-leveraging our current client base and not utilizing strong relationships to expand our share of wallet from our client base. And there's likely more integration to come. We've stood up a strategic growth team, which consists of a team of business development, product, marketing and technology leaders to penetrate new industries and establish new logos; to utilize relationships, especially in North America, to open new doors of opportunity; to characterize our technology-led solutions as just that, unique technologies that exceed that of the competition and thus, attracts new clients. The bottom line here, we have, in many cases, technology solutions that are not getting the adequate light of day from companies or public entities that don't know us just yet.\n\nAlso, we've begun to roll out our digital payments capabilities, including real-time payments and other forms not being utilized, especially in the public sector. Remember, we have millions of bills running through our back office. Those are millions of opportunities for end customers to more easily pay their bills while generating faster revenue and lower cost for our clients. We've made changes to our leadership team to better align capabilities in our transportation business and our strategic growth team.\n\nThere are massive international and domestic opportunities in the public sector, specifically government healthcare and transit and tolling. We have those on the near-term horizon. We also continue to see large opportunities in customer experience. While retail volumes in some areas are feeling the pain, other companies are now more open to outsourcing as a means to drive cost reduction and digitization.\n\nAnd the products we've struggled with in the past have been enhanced and are now selling, especially in our commercial segment. For example, through Q3 2022, the human capital solutions business has closed six new logo deals across its offerings. Going forward, suffice it to say, losses in stimulus are rolling off at higher margins. Given price competition and the economic landscape, we've got to sell even more high-value deals, especially in the public sector and non-CX areas of commercial.\n\nWe are driving more rigorous implementation efforts as there is a backlog or sold revenue waiting on milestones to be completed. When we win some of these big deals, which we will, we must execute the implementation with near perfection. Our sales-to-revenue process must go faster. We are further streamlining expenses in our business and especially from our shared services.\n\nWhile our real estate footprint is much reduced, it must shrink further as we've settled into what is predominantly a work-from-home model, especially in the commercial sector. Regarding the future, we expect the economic headwinds to be slightly stronger than the tailwind components in Q4 2022 and in 2023. And while we continue to be optimistic in our three-year plan, in no uncertain terms, the next year will be challenging. But in the primer, we expect to demonstrate our journey from substantial decline to a business that is flat to slightly up in the next year or so.\n\nRelatively speaking, that represents significant progress. And finally, when it comes to strategy and capital allocation, more to come in our investor and analyst presentation. But we see the opportunity in the obvious areas of either debt and equity buybacks and/or internal investments, which will stimulate growth. We also see a few pruning events we hope to describe to you soon.\n\nWe are fine-tuning these decisions with the board and will be prepared, as we previously discussed, to go deep with you in December and in the spring. So a lot of work to do, yet a lot of opportunity. Our teammates, our clients and end customers are resilient. We wish this growth plan was moving a little bit faster and external conditions were more accommodating, but what we can control is achievable, and we've come a long way from prior years of substantial revenue decline, and we will continue to tell you what to expect from us and then we will achieve it.\n\nWith that, let me ask Steve to take you through a more detailed look at Q3 and beyond. And thank you all for your time today. Steve?\n\nSteve Wood -- Chief Financial Officer\n\nThanks, Cliff. As we have done in the past, we are reporting both GAAP and non-GAAP numbers. I would like to point out that certain non-GAAP measures adjust for the Midas divestiture. This is similar to past practice.\n\nThe reconciliations are in our filings and in the appendix of the presentation. Let's turn to Slide 5 and discuss our key sales metrics. Our primary sales metric ACV grew 27% for the quarter as compared to Q3 2021. It was also up approximately 6% sequentially, and we have now posted sequential growth in this key sales metric for the past five quarters.\n\nYear to date, we are up 15% as compared to the first three quarters of 2021. All three segments posted year-over-year increases in ACV sales attainment, and we were once again particularly strong in the commercial segment with $114 million of ACV. New business ARR was up 3% as compared to Q3 2021 and is up 1% year to date as compared to 2021. Both the commercial and transportation segments are up quarter over quarter and year to date as compared to 2021.\n\nThe government segment is currently down, but our late-stage pipeline of opportunities remains extremely strong. TCV was also up approximately 3% as compared to Q3 2021. The net ARR activity metric, our combined measure of wins, losses, pricing effects and other contractual changes, was positive for the seventh quarter but was down sequentially. The reduction was driven by a renewal price adjustment on a long-standing client, as well as a contract termination, both within the government segment.\n\nThe combined impact of these discrete items on the metric was $75 million. Both items were understood and anticipated, and most importantly, they have already been built into how I guided the revenue expectation for the government segment for 2023 at the beginning of the year. That is a mid- to high single-digit decline. Their inclusion in the net ARR activity metric this quarter reflects the expiration of the protest period in the former and formal notice of termination in the latter.\n\nLet's now turn to Slide 6 and discuss some of the key sales metric trends. As I mentioned earlier, our trend on new business ACV, our primary sales metric, is encouraging, with ACV increasing sequentially for the past five quarters. Our TCV will fluctuate significantly quarter to quarter, as we have said in the past, given the change in mix of deals between segments. Commercial segment deals average about three years whereas those in the government and transportation segments are typically much longer in duration.\n\nThis drives a lot of the variability in TCV, as well as average contract length. It was a strong quarter for NRR growing 30% sequentially and 56% year over year. ARR was up 3% year over year as compared to Q3 2021 and is up 1% year to date as compared to 2021. The sequential decline in ARR as compared to Q2 2022 is a function of a lighter year so far for government contracts which we expect to reverse in the coming quarters.\n\nNow let's turn to Slide 7 and discuss our Q3 2022 financial results. Overall, as Cliff mentioned earlier, Q3 finished in line with where we expected it and where we guided when we laid out our expectations to you during our Q2 earnings call, slightly better when considering more unfavorable exchange rates impacting our international transit and European commercial businesses. This was a $5 million revenue headwind against that guidance during the quarter and an overall $14 million revenue headwind when compared to Q3 2021. In terms of the numbers themselves, adjusted revenue for Q3 2022 was $977 million as compared to $1.02 billion in Q3 2021, down 4.1% year over year or down 2.7% in constant currency.\n\nThe year-over-year headwind from the onetime government stimulus volumes from 2021 rolling off in the quarter was $68 million. This is the largest quarter to roll off versus 2021, and next quarter, the number is expected to be approximately $34 million. Within the quarter, we did get a $15 million revenue benefit from a minimum contractual revenue commitment from a large client which was anticipated in how we guided Q3 but that will not repeat sequentially in Q4. Adjusted EBITDA was $105 million for the quarter, down 11.8% as compared to Q3 2021, and the adjusted EBITDA margin of 10.7% was down 100 basis points year over year, again, largely driven by the margin loss from the onetime government stimulus volumes roll-off from 2021.\n\nAdjusted EBITDA was slightly ahead of our internal expectations for the quarter, driven by ongoing cost efficiency work and a more favorable mix, which included interest rate impact in our BenefitWallet business. Let's now turn to Slide 8 and go over the segment results. For Q3 2022, commercial segment adjusted revenues were $504 million, up 2.2% year over year. The segment benefited from the minimum volume commitment mentioned earlier.\n\nForeign exchange headwinds were $8 million in the quarter as compared to the prior year, and we earned an incremental $8 million from higher interest rates on our BenefitWallet business. Adjusted EBITDA for the quarter was $68 million, up 70% as compared to Q3 2021. Adjusted EBITDA margin was 13.5%, up 540 basis points. Both reflected the impact of the volume commitment noted earlier, as well as higher interest rates positively impacting our BenefitWallet business and cost efficiency programs.\n\nWithin the government segment, adjusted revenues for the quarter were $291 million, down 15.9% year over year as compared to Q3 2021. The year-over-year impact of the runoff of government stimulus revenues was $68 million in the quarter which, I noted earlier, is the largest compare against 2021. Removing that impact, the underlying base business would have been higher by about 4.8% year over year. Adjusted EBITDA for the government segment in Q3 2022 was $88 million, down approximately 34% year over year, reflecting this runoff of government stimulus volumes, partially offset by operational efficiency initiatives.\n\nThe adjusted EBITDA margin of 30.2% was down 820 basis points year over year. Transportation segment revenues in Q3 2022 were $182 million, up 1.1% year over year, including a $6 million headwind from foreign exchange in the quarter impacting our international transit business. For the transportation segment, adjusted EBITDA for the quarter was $25 million, up 13.6% as compared to Q3 2021, and the adjusted EBITDA margin was 13.7%, up 150 basis points year over year. Let's turn to Slide 9 and discuss the balance sheet and cash flow.\n\nOur total liquidity position is very strong. We ended the quarter with $587 million in total cash on the balance sheet, and our $550 million revolving credit facility is almost completely unused at this point. Our net leverage ratio is 1.7 turns, which we believe is below our normalized range of two to two and a half turns. In addition to the strength of our total liquidity position, our debt maturities are long dated, and we have no significant debt repayments until 2026.\n\nAs Cliff noted in his prepared remarks, we see opportunities to refine capital allocation. More to come as we get to our primer and our investor and analyst event, but we come at it from a position of relative strength. As I noted in our Q2 earnings call, capital expenditure as a percentage of revenue decreased during the quarter to 2.8%, and we expect Q4 to yield a similar percentage. Let's turn to Slide 10 and review our 2022 outlook.\n\nAs Cliff mentioned earlier, we are beginning to see some effects of economic headwinds. More specifically, we're seeing discrete areas of volume softness that started in Q3 and will likely be a factor in Q4 and into 2023, largely within the commercial segment and more specifically in some of our travel and entertainment clients in the CX space. For sizing, this industry segment is less than 8% of Conduent's commercial revenue base. This volume softness is in addition to the call-out we made in Q2 earnings when we noted a couple of our larger clients experiencing a level of post-pandemic normalization of their volumes having an approximate $25 million to $30 million headwind this year.\n\nWe now expect this headwind to be approximately $40 million on a full year basis and slightly more next year. As a point of clarity, these client demand-driven volume reductions are not part of our net ARR activity metric. The combined impact of these in the fourth quarter, along with further headwinds from foreign exchange, as well as timing of certain project revenues within the transportation segment, means we now expect overall Q4 adjusted revenues to be in the range of $985 million to $995 million. This would put us at or slightly above the low end of our previously guided full year range.\n\nTherefore, at a segment level, we now expect the commercial segment with these incremental impacts from volumes to be flat on a full year constant-currency basis. Within this, we expect the effect of currency to be an approximate $23 million headwind. We continue to expect the government segment to decline approximately 13% which, ignoring the onetime benefit from government stimulus programs in 2021, would have the underlying business growing slightly in 2022. As a reminder, the year-over-year impact from the onetime government stimulus volumes is approximately $189 million.\n\nWe expect the transportation segment to be also approximately flat on a full-year basis, adjusted for constant currency. The effect here we estimate to be an $18 million FX headwind. Some of the timing difference noted above on project revenues within the transportation business will likely catch up in 2023. Adjusted EBITDA margin for Q4 is expected to be in the range of 9.75% to 10.25%, which would put us at the midpoint of our previously guided full year range.\n\nWe still expect to convert approximately 15% of adjusted EBITDA to adjusted free cash flow, inclusive of paying off the remaining portion of the deferred payroll taxes under the CARES Act. Similarly, we are not changing our outlook on capex or restructuring charges. Finally, we are continuing with our long-range strategy and planning efforts that will inform into our expected investor analyst event later in Q1 2023 and its primer upcoming in December. Our current view and outlook for 2023, without adjusting for further interest rate or exchange rate variability, is that we are expecting adjusted revenue for 2023 to be about flat for the total company, with modest growth in commercial and transportation being offset by the previously messaged decline in government.\n\nThe volume effects noted earlier, a part of that change to the outlook, and we'll talk more about those in December in terms of how that informs into our thinking, around other things, capital allocation. Expect to hear more from us in the coming weeks around the exact timing for both of these communications. That concludes our financial review for Q3 2022. And I'll hand it back to Cliff for some more closing comments before we then take some questions.\n\nCliff?\n\nCliff Skelton -- President and Chief Executive Officer\n\nThanks, Steve. We'll turn it over to the operator for some questions here in just a minute, but I want to reemphasize a couple of key takeaways that Steve just discussed. First, Q3 was strong. Q4 retail volumes have some modest headwinds in it, putting us slightly above the lower end of our previous guidance.\n\nAnd recessionary-like conditions will have a small effect on 2023 volumes, likely creating a flattish 2023. Now we have some big sales expectations in Q4 and into 2023, creating what we hope will be breakthrough expectations potentially influencing the out-years. That all said, please remember a couple of things. We said in 2020 that this would be a three- to five-year journey.\n\nNow after three years, our year-over-year growth has progressed from year-over-year growth decreases of nearly negative 8% to flat and even more impressive when normalized for the influences of COVID, both positive and negative. Yes, the expectation is for a sustained, positive year-over-year growth, and that remains the journey we are on in this next phase, but we should first contextualize that from where we started. Meanwhile, our balance sheet is in tremendous shape. Not only do we retain more than reasonable net leverage ratios, as Steve discussed, but we have over $1 billion of total liquidity.\n\nConduent is a different company than it was just three short years ago, amid the pandemic of a century, an unparalleled political climate, rising interest rates and a recession or recessionary-like conditions that are not fully manifested. We are definitely proud of our progress. So with that, let's open it up for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Bryan Bergin with Cowen. Please state your question.\n\nZack Ajzenman -- Cowen and Company -- Analyst\n\nThanks. This is Zack Ajzenman on for Bryan. First question is one on the macro, on the pipeline. How much has macro uncertainty impacted client behavior at this point? And also, can you characterize current deal cycle cadence and how that informs early views into calendar '23?\n\nCliff Skelton -- President and Chief Executive Officer\n\nZack, yeah, we're not seeing a ton of macroeconomic influence over the pipeline in any negative way. In fact, the pipeline is stronger than it's ever been, especially, as I mentioned earlier, in the government and transportation businesses, transportation being more international, government being primarily in the government healthcare business where we see a ton. Where we do see those macroeconomic influences, if you will, is more in the retail volume space that Steve mentioned in his prepared remarks where call center volume, specifically in the travel industry, is causing some reduced revenue headwinds in some of our technology space. But that certainly will recover as we get through these recessionary-like environments.\n\nWith respect to deal cycle time and the model, I would break it into sort of two parts. One, we are seeing some delays from, let's call it, announcement of a deal to the signing of a deal in the government space specifically and also a little bit in transportation, not so much in commercial. What we've got to do that we can control is when we implement, we've got to implement on the time line we committed to with near perfection, as I mentioned in my remarks, because every milestone represents revenue. So we're all over that, and we see upside, to be honest with you, as it relates to the pipeline.\n\nZack Ajzenman -- Cowen and Company -- Analyst\n\nGot it. That's helpful. And our follow-up is on the net ARR metric. Can you just shed a bit more color on the underlying dynamics here? It sounds like it was embedded in the original guide, but perhaps you could talk about the metric and how it's performed relative to expectations, excluding these select client volume loss.\n\nSteve Wood -- Chief Financial Officer\n\nYeah, Zack, Steve, I'll take this. I think, the metric is largely performing the way we expected it to. What you see in the effect of the quarter is, obviously, the two deals that I referenced causing it to be down sequentially on a trailing 12-month basis in the quarter. But as you said, those were already things that we fully anticipated, and so they've been baked into the guidance and into how we were thinking about the outlook.\n\nSo this is one of those odd examples where we've got out a little bit in front of that in terms of how we've messaged how the government segment is going to perform in 2022 and into 2023, and this is the metric a little bit catching up on it. So overall, our expectation is that that metric continues to be positive. And Cliff talked about the fact that we've got a very strong late-stage pipeline in the government healthcare business. And at the point at which those deals hopefully get inked in the next coming quarters, then we will likely to see that net ARR metric spike up again.\n\nCliff Skelton -- President and Chief Executive Officer\n\nYeah, Zack, I wouldn't react to -- I mean, as long as that number is positive and the slope is upward, it's a good sign. I wouldn't react to the lumpiness of a slightly low quarter and I wouldn't overreact in a positive way due to the lumpiness of a really big number quarter. It had one deal rolled off as we -- in the timing that we thought it would have, you would have seen a much higher number, and you're likely to see a much higher number in the future. That's also not something we should overreact to when it's a trend, not any individual quarter number.\n\nZack Ajzenman -- Cowen and Company -- Analyst\n\nVery helpful. Thank you.\n\nCliff Skelton -- President and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nThank you. And that's all the time we have for questions today. I'll hand the floor back to Cliff Skelton for closing remarks.\n\nCliff Skelton -- President and Chief Executive Officer\n\nListen, thank you, everyone, for joining us. As I mentioned, there's a lot to do. There's a lot of opportunity. And there's a lot to be proud of when we consider, as I mentioned, where we started this journey just three years ago, when we were experiencing that negative 8% year-over-year growth rate, an unstable operating environment and uncertain future.\n\nIt's definitely a different company now. I would like to thank our associates, our clients and our shareholders for their continued support along the journey. I appreciate everybody joining today. And here's to a great finish in 2022.\n\nThank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGiles Goodburn -- Vice President, Investor Relations\n\nCliff Skelton -- President and Chief Executive Officer\n\nSteve Wood -- Chief Financial Officer\n\nZack Ajzenman -- Cowen and Company -- Analyst\n\nMore CNDT analysis\n\nAll earnings call transcripts"
}