{
  "companyName": "Xponential Fitness, Inc.",
  "companyTicker": "XPOF",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/xponential-fitness-inc-xpof-q2-2022-earnings-call/",
  "content": "Xponential Fitness, Inc. (XPOF 0.70%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Xponential Fitness, Inc. second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. The question-and-answer session will follow the formal presentation.\n\n[Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the call over to Kimberly Esterkin of investor relations. Thank you. You may begin.\n\nKim Esterkin -- Investor Relations\n\nThank you, operator. Good afternoon, and thank you all for joining our conference call to discuss Xponential Fitness' second quarter 2022 financial results. I am joined by Anthony Geisler, chief executive officer; Sarah Luna, president; and John Meloun, chief financial officer. A recording of this call will be posted on the Investors section of our website at investor.xponential.com.\n\nWe remind you that during this conference call, we will make certain forward-looking statements, including discussions of our business outlook and financial projections. These forward-looking statements are based on management's current expectations and involve risks and uncertainties that could cause our actual results to differ materially from such expectations. For a more detailed description of these risks and uncertainties, please refer to our recent and subsequent filings with the SEC. We assume no obligations to update the information provided on today's call.\n\nIn addition, we will be discussing certain non-GAAP financial measures in this conference call. We use non-GAAP measures because we believe they provide useful information about our operating performance that should be considered by investors in conjunction with the GAAP measures that we provide. A reconciliation of these non-GAAP measures to comparable GAAP measures is included in the earnings release that we issued earlier today prior to this call. Please also note that all numbers reported in today's prepared remarks refer to global figures, unless otherwise noted.\n\nI will now turn the call over to Anthony Geisler, chief executive officer of Xponential Fitness.\n\nAnthony Geisler -- Chief Executive Officer\n\nThanks, Kimberly, and good afternoon, everyone. We appreciate you joining our second quarter earnings conference call. I'll begin with an overview of our performance. Sarah will then join me to speak about our progress against our growth strategies.\n\nJohn will conclude with a review of our second quarter financial results and an update to our full year outlook. Xponential Fitness is the largest global franchisor of boutique fitness workout brands. Our business model is straightforward. We license our boutique studio operations, share our business processes and branding with franchisees, and in exchange, charge royalties and other fees for our services.\n\nAs our AUVs grow and as we increase the number of studios, we become more profitable, given that the royalties generated from systemwide sales are very high margin and given our SG&A platform scales. As of the end of the second quarter, franchisees collectively operated over 2,350 studios in 14 countries around the world across 10 leading brands and major workout modalities. We are pleased with our operational execution and resulting financial performance in the second quarter. Total members in North America for the second quarter increased by approximately 32% year over year.\n\nOur Q2 North American systemwide sales grew for the eighth consecutive quarter, up 45% year over year. Finally, we ended the quarter with run rate North American AUVs of $480,000, up from $384,000 year over year. The dynamic growth and run rate AUVs is a strong reminder that despite inflationary pressures to date, the workouts our franchisees provide across our diverse portfolio of 10 brands are an integral part of our members' lives. Importantly, as we continue to open more studios and as AUVs continue to grow, our profitability increases, driven by high-margin royalties from growing systemwide sales with an active pipeline of approximately 2,800 studios contractually obligated to open globally and only about a quarter of our conservative North American total addressable market currently penetrated.\n\nStudio openings are not expected to slow anytime soon, continuing to drive profitability. For the second quarter, we posted net revenues of $59.6 million, an increase of 66% year over year. Q2 adjusted EBITDA of $17.6 million, or 30% of revenue was up 112% from $8.3 million, or 23% of revenue in the prior-year period. While we acknowledge we are operating in a time of inflation and macroeconomic pressures, including labor and supply chain constraints, our business has remained resilient.\n\nFirst, Xponential's customers continue to prioritize their health as a necessary investment. Our customers do not view fitness as discretionary spend. The majority of our members have a typical household income of approximately $130,000 and subscribed to reoccurring membership packages, with fees that are a relatively small piece of their overall budgets. To that end, as a franchise business model, we benefit from highly predictable reoccurring revenue streams and limited ongoing capital requirements.\n\nIn the second quarter, approximately 68% of our revenue was reoccurring, largely driven by royalties. This percentage is lower than our 70% plus historical reoccurring revenues due to the high number of studio equipment installations in the quarter, as we prepare to ramp openings in the second half of the year. We expect the percentage of reoccurring revenues will continue to fluctuate from time to time, based on the number of equipment installations and subsequent studio openings in the period. Finally, paramount to Xponential Fitness' ongoing success is our ability to proactively support and grow our franchise system.\n\nOur business has remained resilient, and we have not experienced significant operational headwinds around talent acquisition or supply chain management. Given that approximately 25% of health clubs and 30% of studios closed permanently during the pandemic, there remains an adequate supply of fitness instructors in the space. In terms of supply chain, our equipment is primarily sourced in the United States. And as previously mentioned, we continue to take steps to proactively purchase equipment inventory for brands with a high volume of studio openings in the pipeline to mitigate against any potential disruptions in the coming quarters.\n\nIn addition, these advanced purchases have been particularly beneficial given the current high inflationary environment. Based on these factors, despite the uncertain macroeconomic environment, we remain confident about the go-forward trajectory of our business, particularly as the positive momentum has continued into the third quarter. As one of the only scale boutique fitness franchise operators during the 2008 financial downturn, I am keenly aware of the steps required to keep a business running successfully during economic volatility. At LA Boxing, I successfully scaled the business through the downturn before selling it in December of 2012.\n\nMore recently, Xponential has proven resilient in the face of COVID-19, growing our business significantly against the backdrop of industry contraction. One of the most important things I've learned in my career in fitness and franchising is that partnering with the right operators who have the tenacity, courage, and capital to successfully run their business no matter how challenging the operating environment they face is critical for success. As you may have heard me speak to previously, we take our franchisee selection process very seriously, with only 2% of our leads becoming franchisees. Our franchisees generally are corporate veterans looking for an entrepreneurial opportunity.\n\nTheir resilience and business acumen is evidenced by the fact that in the company's history, including most recently during the pandemic, we had zero studios closed permanently. Our franchisees have borrowed over $200 million from the SBA without any non-repayments under our ownership. Between our strong franchisee base, the support we provide our franchisees, and the continued strength of our underlying business, we feel confident that Xponential will not only be able to successfully weather a slowdown or recession, but maintain a solid growth trajectory going forward. As we continue to scale our global footprint, optimizing complex systems, data, and business intelligence is an increasingly important driver of our success.\n\nWith that, I'm excited to announce the appointment of Jair Clarke to serve on our board of directors, as well as on our audit and Human Capital Management Committees. Given Jair's current role as global chief technology officer of Commercial Systems at Microsoft and his prior senior digital leadership roles at Disney and at IBM, it's hard to imagine anyone who could be a better fit for the board as we continue to scale our global business. With that as a background, let's move to our four key strategic areas of growth, beginning with our first two growth levers: increasing our franchise studio base across all of our brands in North America, and expanding our brands and studio base internationally. We ended the quarter with 2,357 global studios, opening 128 net new studios in the second quarter.\n\nWe also experienced strong demand for our franchise licenses, selling 251 licenses globally in Q2, maintaining our annualized run rate of 1,000 licenses per year. In North America, we have almost 1,900 licenses sold and contractually obligated to open and have a replenishing pipeline of organic new studio expansion, offering us four years to five years of visibility into our growth. On the international front, we have almost 1,000 studios obligated to be open, and we continue to gain traction in terms of international expansion. We recently announced new master franchise agreements or MFAs for Club Pilates in the U.K.\n\nand CycleBar in Japan. As a reminder, our MFAs are structured to provide Xponential with high-margin flow through given we require minimal ongoing SG&A to support MFA growth. The Club Pilates MFA in the U.K. gives the master franchisee the opportunity to license at least 50 Club Pilates studios over the next 10 years.\n\nIn Japan, our new MFA provides the master franchisee the opportunity to license at least 30 CycleBar studios over the next eight years. These new partnerships will bring Xponential's global reach to 14 countries. On the M&A front, the BFT integration remains on track. As of today, BFT has over 200 open studios globally.\n\nRegarding future M&A, the pipeline of opportunities remains robust, and we will continue to opportunistically evaluate potential brands and new modalities. Turning to our third key growth driver: expanding margins and driving free cash flow conversion. As our business continues to grow, we're increasingly reaping the benefits of our asset-light scalable operating model, providing us with consistent and growing margin performance. Considering the current macro environment, we're very pleased to have held our operating margins steady.\n\nWe continue to expect our adjusted EBITDA margin will be in the low 30% range for the full year 2022, and we remain on track to achieving our long-term adjusted EBITDA margin. John will discuss this further when he discusses our full year outlook. With that, I'll pass the call on to Sarah to discuss our fourth and final growth driver; increasing our same-store sales and AUV.\n\nSarah Luna -- President\n\nPresidentThank you, Anthony.The health of our brand portfolio remained strong. As noted earlier, despite the elevated inflationary environment, Xponential consumers continue to prioritize their health and wellness, engaging with our brands through both in-studio and digital experiences. Our visitation rates have continued to increase, with total visits growing 28% year over year. This member engagement demonstrates that our offerings are not considered discretionary, but rather an integral part of our customers' lifestyle.\n\nOur core KPIs are continuing to grow and our churn levels remain steady at approximately 1.5% after 12 months. During the second quarter, we continue to optimize the ways in which we attract prospective members, while simultaneously focusing on delivering increased value to current members. Continued investments into improving our customer experience will translate into growing memberships, AUVs, and overall systemwide sales. Beginning with our in-person offering, XPASS provides subscribers access across our US studio locations under a single monthly recurring subscription.\n\nXPASS has been a powerful engagement platform for us, helping us attract new, retain existing, and reengage previously churned customers. The platform's primary goal is to fill classes to 100% capacity, which we are currently doing at a zero-dollar customer acquisition cost for the franchisees. By driving more bookings into existing classes, XPASS helps our franchisees increase studio profitability. XPASS has also proven to be a powerful acquisition tool for the broader Xponential system, with 25% of XPASS members having no prior studio relationship, purchasing an additional membership or class pack at our studios.\n\nMany of our cohorts are still in the earliest stages, and we are excited about these early signals of customers adopting both XPASS subscriptions and in-studio memberships. Since being fully rolled out at the end of 2021, XPASS has been profitable for Xponential, due in part to our careful management of acquisition and marketing spend. In terms of digital engagement, XPLUS offers thousands of live and on-demand digital workouts on a single platform. XPLUS continues to be a helpful tool to further promote brand awareness, increased customer engagement, and supplement our customers' in-person class attendance.\n\nThe majority of our brands offer promotional subscription to XPLUS with a membership purchase. In fact, during the height of the pandemic, we started to test the membership bundle offering at StretchLab, which provided in-studio classes and access to our digital library. The test case was successful, and we have since rolled this out to our entire StretchLab network. We continued to see great success after the rollout and are expanding this offering as an enhanced value proposition to all Club Pilates memberships.\n\nWe are eager to see the results of this new program, which addresses customer demand for further optionality in their fitness routine and increased membership value. In addition, as a stand-alone digital platform that interfaces with consumers around the world where we have yet to open a studio, XPLUS is highly conducive to B2B subscription options and commercial marketing partnerships. For example, as previously announced, we expanded our digital offering in collaboration with lululemon and its home gym technology, the MIRROR. Our four featured brands, Pure Barre, Rumble, YogaSix, and AKT are on track to go live on the MIRROR this fall.\n\nAnother B2B opportunity and driver in North American studio growth is our nationwide partnership with LA Fitness. This partnership provides us the exclusive right to open our Xponential Fitness studios within LA Fitness locations with a minimum development commitment of 350 franchise locations over five years. Today, we currently have seven open studios within LA Fitness locations, and we'll continue to build out this footprint. Our in-studio B2B partnerships continue to track nicely as well.\n\nWe recently announced three Xponential brand partnerships with leading energy drink, CELSIUS, is now the official energy drink partner of CycleBar, and C4 Energy is now the proud energy drink partner of Row House and Rumble studios. The mission of both C4 and CELSIUS align with our own brand growth initiatives, something we consider essential than securing brand partners. We are excited to continue to broaden the omnichannel offerings we can provide to our consumers as we create unique fitness communities for our membership base. Thank you again for your time.\n\nI'll now turn the call over to John to discuss our second quarter results and outlook in more detail.\n\nJohn Meloun -- Chief Financial Officer\n\nThanks, Sarah. It's great to speak with you to discuss Xponential's second quarter results. Second quarter North America systemwide sales of $249.8 million were up 45% from $172 million in the second quarter of 2021. On a consolidated basis, revenue for the quarter was $59.6 million, up 66% from $35.8 million in the prior-year period.\n\nAll 5 of the components that make up revenue grew during the quarter. Franchise revenue was $27.6 million, up 55% from $17.8 million in the prior-year period. The growth was primarily driven by higher royalties, as well as increased revenue generated from franchise license fees. Equipment revenue was $12.4 million, up 160% from $4.8 million in the prior-year period.\n\nThis increase in equipment revenue continues to be driven by a higher number of equipment installed, along with a greater concentration of installs within equipment-intensive brand. Merchandise revenue was $6.8 million, up 50% from $4.5 million in the prior-year period. The improvement during the quarter was primarily driven by a higher number of open studios, along with increased foot traffic across studios. Franchise marketing fund revenue of $4.9 million was up 49% from $3.3 million in the prior-year period, primarily due to strong systemwide sales and average unit volume growth.\n\nLastly, other service revenue was $7.9 million, up 45% from $5.4 million in the prior-year period. The increase in other service revenue was primarily driven by an increase in credit card rebates on higher systemwide sales and higher B2B and brand fee revenue. Turning to our operating expenses. Cost of product revenue was $13.5 million, up 115% from $6.3 million in the prior-year period.\n\nThe increase was driven by higher equipment installations for new studio openings and merchandise revenue in the period. Cost of franchise and service revenue were $4.5 million, up 45% from $3.1 million in the prior-year period. The increase continued to be driven by costs related to franchise sales commissions and from technology fee costs from a higher number of open studios. Selling, general and administrative expenses of $29.3 million were up 38% from $21.2 million in the prior-year period.\n\nThis increase was largely due to costs associated with public company expenses and higher non-cash equity-based compensation, as well as expenses related to one-time legal costs. As a percentage of revenue, SG&A expenses were 49% of revenue in the second quarter compared to 59% in the prior-year period. Depreciation and amortization expense was $3.6 million, an increase of 49% from $2.4 million in the prior-year period. Marketing fund expenses, which include expenses related to corporate marketing were $4.1 million, up 43% from $2.9 million in the prior-year period.\n\nThe increase was driven by higher spend afforded by higher marketing fund revenue and due to lower spend in the prior period due to the pandemic. Acquisition and transaction expenses were a credit of $31.6 million versus an expense of $0.3 million in the second quarter of 2021. This improvement is due to the change in noncash contingent consideration primarily related to our acquisition of Rumble. As I noted on prior earnings calls, the Rumble contingent consideration is driven by our share price.\n\nWe mark-to-market at each quarter and accrue for the earn-out. We recorded net income of $31.5 million in the second quarter compared to a net loss of $8 million in the prior-year period. The increase was the result of $11.6 million of higher overall profitability and $31.8 million of lower noncash contingent consideration primarily related to the Rumble acquisition and was offset by a $4 million increase in noncash equity-based compensation expense. We continue to believe that adjusted net income is a more useful way to measure the performance of our business.\n\nA reconciliation of net income to adjusted net income is provided in our earnings press release. Adjusted net income for the second quarter, which excludes the $31.6 million change in fair value of non-cash contingent consideration and $0.2 million expense related to the second quarter remeasurement of the company's tax receivable agreement liability was $0.1 million compared to an adjusted net loss of $7.8 million in the prior-year period. To calculate adjusted net loss per share, we isolate the portion of the net income loss that is attributable to Xponential Fitness, Inc., which is $0.1 million, and we reduced this number by $1.7 million to account for the dividend attributable to Xponential Fitness, Inc. paid on our preferred shares.\n\nThis results in an adjusted net loss of $0.07 per share on 25.4 million shares. A reconciliation of net income to adjusted net income is provided in our earnings press release. Adjusted EBITDA was $17.6 million in the second quarter compared to $8.3 million in the prior-year period. Adjusted EBITDA margin grew to 30% in the second quarter compared to 23% in the prior-year period.\n\nOur 2022 outlook anticipates adjusted EBITDA margins of over 30% and long term, we expect this number to grow to over 40% to 45%. Turning to the balance sheet. As of June 30, 2022, cash, cash equivalents and restricted cash were $29.3 million, up from $21.3 million as of December 31, 2021. Total long-term debt was $131.7 million as of June 30, 2022, compared to $133.2 million as of December 31, 2021.\n\nMoving to our outlook. Based on current business conditions, our year-to-date performance, and our expectations as of the date of this call, we are increasing our full year 2022 outlook for revenue and adjusted EBITDA and reaffirming our guidance for studio openings and systemwide sales in North America as follows. We continue to expect our total 2022 global new studio openings to be in the range of 500 to 520. This range represents the highest number of studio openings in our company's history.\n\nWe also continue to project North American systemwide sales to range from $995 million to $1,005 million or $1 billion at the midpoint, which represents a 41% increase from the prior year and the highest North American systemwide sales in our history. Total 2022 revenue will be higher than initially forecasted and is now expected to be between $211 million to $221 million, an increase of 39% from 2021 at the midpoint of our guided range. The increase in range was primarily attributed to higher overall franchise revenues, higher revenue from B2B and brand fee partnerships, and better performance in our company-owned transition studios. Adjusted EBITDA is now expected to range from $68 million to $72 million, a 156% year-over-year increase at the midpoint of our guided range.\n\nThis new adjusted EBITDA guidance range translates into roughly a 32.4% adjusted EBITDA margin at the midpoint. With regards to SG&A spend, we are seeing some cost pressure from general operations and particularly in legal, which was $7.4 million in the first half of 2022. We view this legal spend as an isolated event for purposes of our adjusted EBITDA. Based on the visibility today, SG&A, excluding equity-based compensation for 2022, will now be roughly 42% of total revenue at the midpoint of our outlook.\n\nLonger term, we are anticipating SG&A at approximately 25% to 30% of revenue. Given our asset-light model, capex continues to be a small percent of overall revenue. We anticipate our capital expenditures for 2022 to be approximately $7.5 million to $9.5 million, or 4% of revenue at the midpoint. Going forward, capital expenditures will be primarily focused on the BFT integration, tenant improvements related to a larger retail warehouse to scale merchandise sales and maintenance, and other technology investments to support our digital offerings.\n\nFor the full year, we expect our tax rate to be in the mid- to high single digits share count for purposes of earnings per share calculation to be $25.7 million and $3.25 million in quarterly dividends to be paid related to our $200 million convertible preferred stock. A full explanation of our share count calculation and associated pro forma EPS and adjusted EPS calculation can be found in the tables at the back of our earnings press release, as well as our corporate structure, and capitalization FAQ on our investor website. Thank you, again, for your time and for your support of Xponential. We look forward to speaking with you on our next earnings call.\n\nWe will now open the call for questions. Operator?\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for your questions. Our first question has come from the line of Alex Perry with Bank of America.\n\nPlease proceed with your questions.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking my questions, and congrats on a strong quarter here. So, I just wanted to get maybe a little more color on the guidance in terms of the revenue guidance. You kept the systemwide sales number the same and the studio openings the same.\n\nSo presumably, the equipment number would sort of be in line with your expectation. What was the delta that brought the rev guide up?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. Thanks, Alex. So from a revenue perspective, the three categories that we saw upside in kind of the first half, which we wanted to adjust guidance from a mix perspective is upside in the franchise revenue. We've announced a number of these B2B deals, which have provided some revenue upside that was favorable, and we perceive as favorable through the rest of the year.\n\nAnd then we've seen better performance in the transition studios that we've spoken of in the past. Roughly 0.5% to 1% of transition studios that we own have been performing better than the assumptions we originally had in our original guidance. So, the three of those combined gave us the opportunity to adjust the guidance upwards on revenue.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. And then just in terms of the systemwide sales guidance in particular, what does it sort of assume in terms of run rate AUVs? Is there -- do you expect a continued progression at the franchise level? I think you're already above sort of pre-pandemic AUVs. And then maybe if you could also speak to, do you normally see the same sort of churn as the rest of the fitness industry in the back half in terms of members leaving as people go back to school and the holiday season? Maybe just speak to us about sort of the seasonality as well. Thanks.\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. So, Alex, as it relates to -- you had a couple of questions in there. I'll tackle a couple and I'll turn it over to Sarah. From an AUV perspective, yeah, we have exceeded pre-COVID levels, $480,000 on average per studio in Q2.\n\nWe do expect AUVs continue to grow into the foreseeable future, which will drive the systemwide sales. I think that answers the first part of your question. And I think you had a couple else in there that -- what was the second part to that?\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nJust in terms of the seasonality of the business, could you just talk to the AUV progression and how you tie that back to potential membership churn in the back half? Do you normally lose members in 3Q and 4Q like other fitness players?\n\nSarah Luna -- President\n\nYeah. Typically, what we see on the second half of the year is that Q4 tends to be a little bit higher in terms of AUVs because of the Black Friday promotions and some of the year-end promotions that lead into a strong January interest across our membership base. But because we are in a recurring subscription model, we don't typically see that churn increases or that people cancel because they're away for Thanksgiving for four days, they're way for Christmas and the holidays for a week. They typically keep their membership and continue to come as often as they can during those times, but they're not canceling and then reupping once they're back into the regular routine.\n\nSo, we do anticipate that AUVs will continue to grow in steady state for the rest of the year.\n\nJohn Meloun -- Chief Financial Officer\n\nAnd one other point to add, prior to COVID, the AUVs climbed and we never really saw the top end of where the studios could perform, too. So the expectation going forward is AUVs will kind of get back onto that trend where they'll continue to climb as we fill capacity and add new members to the studio and as the younger cohorts of studios that have opened last year, this year get to, I don't want to say, full potential, but continue to grow to higher capacity.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. That's really helpful. Best of luck going forward.\n\nOperator\n\nThank you. Our next question has come from the line of Brian Harbour with Morgan Stanley. Please proceed with your questions.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nHey, guys. Maybe the first one. How many of the openings in the second quarter were international? And what kind of countries and brands are you seeing really drive that right now?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. So, from a mix perspective, we're still seeing about a 75% to 25% split between domestic and international. So about 25% of the openings in the second quarter were international. Some of the brands that typically drive more of the openings are the ones we've sold the most of and are relatively new.\n\nClub Pilates still seems to be a top performer. We sold a lot of licenses, and they have a pretty strong AUV. So, we're getting openings continued there. StretchLab is another brand where we sold a lot of licenses, and those licenses are now translating to openings.\n\nAnd our most recent acquisition of BFT continues to be one of the top openers. So the three top are Club Pilates, StretchLab, and BFT.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nOK. Great. John, also just your comment on SG&A and the cost pressure in there. Is that mainly just personnel related? Are you hiring more than you expected to in the past? Because I assume that kind of stays in the base.\n\nI don't know if there's anything one-time in there?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. So related to SG&A, there was some one-time expenses that I called out, particularly around legal. We did have to do some defensive legal workaround trademarks, particularly around BFT, and then we had some patent issues, again, related to one of our public competitors around defending a patent around BFT as well. So, we do view those legal costs as one-time.\n\nWe don't believe that there will be a material spend going forward. However, if they are, we will treat those as one-time add backs as we did in this quarter.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question has come from the line of Jonathan Komp with Baird. Please proceed with your questions.\n\nJonathan Komp -- Baird -- Analyst\n\nYeah. Hey, thank you. I wanted to just ask about the recent consumer behavior you're seeing, if you're seeing any changes in the membership or the packs that members are buying within the concepts. Or if you expect to see any differences across the concept, if there is a tougher consumer environment? And if that were the case, how might you react?\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. Well, the answer is no. We're continuing to see membership up, usage up, the consumers continue to spend money. So, we're still seeing that 25% of our membership is on the reoccurring four times a month, 25% on the reoccurring, eight times a month, and about 50% of the member units on the unlimited.\n\nAbout 60% of the dollars gathered are coming from the unlimited members, but the unit split is about 25%-50%, and that's remained constant and still continues to be the case today.\n\nJonathan Komp -- Baird -- Analyst\n\nOK. That's great to hear. And then, John, maybe one follow-up on the outlook for the year. Can you maybe just help to clarify? When I look at your revenue year to date, it's up a lot, 70% in the full year.\n\nAt the midpoint, it's up 39%. So could you just provide any other shaping comments on factors we should think about when modeling revenue in the second half and some of the pieces?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. I mean the position we're taking related to raising guidance is kind of looking at the performance of the first half and making the adjustment to the full year based on the upside we've seen so far. Given the macro environment, we still want to remain somewhat cautious and not be naive to think that things couldn't change or go flat. We're not seeing that.\n\nWe are seeing the momentum continue into, up to the point of this call. So, we've again taken a conservative approach and made sure that we deliver on the outlook that we've put out there. So the $221 million on the top end, that's kind of where we're committing our outlook from a revenue perspective and roughly the $72 million on the bottom-line adjusted EBITDA. That's where we see the high end right now as we continue to perform through Q3.\n\nWe'll come back to you guys and provide updates at that point. But I think the outlook now represents, based on the performance in the first half, the upside we saw and we'll continue to adjust through the back end of this year, the guidance as we see fit.\n\nJonathan Komp -- Baird -- Analyst\n\nOK. And just last clarification, if I could. The master franchise agreements you've signed this year, could you quantify how much that's contributing to the year or any rough perspective? Thanks, again.\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. I mean, from an international perspective, we don't break out what the contribution is. Again, when you think about the international business, the flow-through is much higher as we arrange these master franchise agreements where we get an upfront fee for the initial licenses to sell in those markets. And then as they sell licenses to their sub-franchisees, we don't have the SG&A cost to support that because that's borne by the master franchisor.\n\nSo there's high margin flow through. So although we don't break it out our segment international, there is a very profitable margin flow-through on the international and particularly with the acquisition of BFT being a contributor from day 1 that they do have -- the international side of the business does have pretty high-margin contribution and will continue to increase quarter on quarter as they open more studios and sell more licenses.\n\nJonathan Komp -- Baird -- Analyst\n\nOK. Understood. Thank you.\n\nOperator\n\nThank you. Our next question has come from the line of Randy Konik with Jefferies. Please proceed with your questions.\n\nRandy Konik -- Jefferies -- Analyst\n\nHey, guys. I just want to follow up actually first on the master franchise agreement. Maybe just remind us where you have them, where you are -- don't have that in our planning to potentially have them going forward? And just like longer term, how do you think about international, let's say, like five years out from now? Again, pretty nice margin opportunities and so forth and just adding to your TAM. Just wanted to get more flavor on that longer-term piece on the master franchise side.\n\nSarah Luna -- President\n\nYeah. Happy to take that question. So today, we have MFA commitments of roughly 1,100 studios across 12 different international countries. And our international strategy is to find the best partner to grow and scale our brands internationally on behalf of the brand.\n\nSo, we're going out looking for various countries where we know that we can be successful, both economically and the legal conditions are conducive to franchising. But more importantly, we're looking for the right partner to be us in that given country. So today, we've got some good presence in Australia, as well as Japan and then some of our other countries are kind of in the early innings of starting to develop and open their studios. From a contribution standpoint, it's still about 25% at this point, but we'll start to see that shift as the countries continue to grow and develop and we'll see a little bit of that shift on the P&L.\n\nRandy Konik -- Jefferies -- Analyst\n\nThat's super helpful. And then just on -- as we think about -- you talked a little bit about some cost items impacting things. Any thoughts around -- any offsets you guys can kind of have with that potential changes in royalty rates or anything like that? You are mandating kind of pricing changes on the studio side. Just kind of curious on how you're thinking about inflation and just maybe some offsets or things to react.\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. And we continue to be focused on that in Q1, as well as in Q2. We did procure some equipment, which allowed us to not only hit the opening numbers we needed, but also allowed us to kind of hedge against any of that type of inflationary situation. So, we continue to look at that and continue to progress forward.\n\nBut John had some more thoughts on that, too, as well.\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. I mean, some of the other things we're looking at in the second half is opportunities around some of our Pubco expenses. Obviously, going public, D&O insurance is one of the high-ticket items that we had, and recently going through a renewal of that policy and seeing some favorable expenses there. So, we are looking pretty much across all our vendors to optimize spend in the second half and again try and drive margin expansion.\n\nWe do see the commitment we made around getting to the 40% to 45% adjusted EBITDA margins long term. We're on track to achieve that. Even though we had a little bit of higher SG&A this quarter. Again, we view that as one-time.\n\nSo the focuses in Q3 and Q4 is getting back on track, driving optimization out of SG&A, continue to focus on vendors. As Anthony mentioned, making sure we mitigate inflation or cost increases around equipment by procuring in advance, and/or in larger volumes to make sure that we hit the openings, but again, hit the margin target. So it's kind of all-hands-on-deck effort across the company to continue to drive down costs through various strategies.\n\nRandy Konik -- Jefferies -- Analyst\n\nVery helpful. Thanks, guys.\n\nOperator\n\nThank you. Our next question has come from the line of John Heinbockel with Guggenheim Securities. Please proceed with your question.\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nSo maybe you can talk -- I know all the brands are different. But maybe talk to the issue as you climb toward $500,000 AUV capacity utilization or excess capacity still to be utilized in the studios, right? So where do we stand on that? And also from a functional standpoint, right, not all slots are created equal, right? There are obviously more popular slots. And I don't know if you have a thought at what AUV level, maybe we're not even close to it, does capacity become an issue for the member experience? That would be helpful.\n\nSarah Luna -- President\n\nThere are actually a couple of different strategies that we deploy when we're looking at capacity and how that then correlates with AUVs. So when we first opened a studio, we opened with a pretty minimal schedule so that we can fill the studio, fill the schedule and create this community feels across the members, as well as within that location. And we start with very aggressive pricing. As we start to see that there's more demand, we add more classes very carefully, but also start to increase the price points so that we are able to then meet the supply and demand curves with the appetite that the consumer has for spending on their membership.\n\nOnce you get to a mature studio that's in their sustainable business, we then look at driving AUVs with some of the vendor partners that we have. So driving retail and some of the brands that's driving private training or workshops, teacher training like with a brand with Club Pilates and now that we have a B2B department now bringing in additional lead flow and revenue opportunities through those partnerships as well. So, we're looking at continuing to expand the four-wall economics without necessarily driving additional utilization at the studio level. We chatted about bringing XPLUS to the Club Pilates and StretchLab membership.\n\nAnd part of that idea was to continue to add value and benefit to the existing brick-and-mortar membership, but also giving the member the opportunity if they can't get into a class or into a stretch session to still be able to enjoy an XPLUS experience. So, we're looking at a lot of different ways of how we continue to meet demand where it is, while also driving AUVs.\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nRight. Maybe as a follow-up to that, right? As you think about the real estate strategy going forward, the tension between cannibalization and network effect, I guess I would think most of the brands right are at such a young level that the network effect and convenience benefit far outweigh cannibalization. But how do you think about that dynamic?\n\nAnthony Geisler -- Chief Executive Officer\n\nWhen we launch a brand, we go through a very aggressive Buxton research analysis. So, we really take the members that we know like the brand, follow the brand and take that demographic, and then map it across the country. And we now then have enough data within the 10 brands to look at various fitness rows and what happens within those fitness roads as we continue to open various studios and various concepts within a concentrated area. We watch that very closely.\n\nWe haven't seen any sort of cannibalization. If anything, we actually see that it becomes an attractor. So, you have kind of like a food court, people go to that area, everyone has something to eat, and it becomes a hub. So, we find that with our studios as well.\n\nSo if anything, the data is actually a little bit stronger, dictating that that's actually a good model rather than saying that the studios and various concepts need to be set apart.\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question has come from the line of Warren Cheng with Evercore ISI. Please proceed with your questions.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nGood afternoon. Nice job in a pretty tough environment. Can you give us an update just on your franchisees' unit economics? Because the AUV side continues to trend really nicely in the right direction. But are your franchisees starting to see inflation show up on the cost side, especially just on the labor rent or financing side that are offsetting that AUV accretion?\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. I mean there's minimal, not material inflation, of course, everywhere, but we're not seeing that stores are continuing to operate AUVs continuing to grow. And so we're not -- when you look at kind of labor costs or things like that, the labor that we have typically makes $40 to $50 per class. So there's kind of pressure on minimum wage or things like that in labor.\n\nThey're not coming back to us looking for $51 or $52 a class. So, our employees are already paid kind of above the minimum wage. So as minimum wage or the labor side increases, we're not really seeing any labor or wage inflation. And so the stores are continuing to operate profitably.\n\nObviously, we opened more units in Q2 than we did in Q1, continued to sell at the current 250 or more pace per quarter. So, at the top of the funnel, we're seeing franchisees want to continue to buy more franchises and we're seeing franchisees continuing to want to open as we see AUVs continue to grow. So the economics are still strong.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nGot it. That's really helpful. And you gave a nice update on some of the partnerships that you've done, and you seem to continue to have new partnerships in kind of new shapes and sizes. Are there certain types that have been the most fruitful from a customer acquisition perspective that you would lean into going forward, or that we can expect you to lean into going forward?\n\nAnthony Geisler -- Chief Executive Officer\n\nI mean it's early innings on these partnerships. But obviously, there's really a couple of kinds of partnerships that we've been doing, one or partnerships that drive really butts-in-seats ultimately, right? How do we fill that last seat or those last three seats or whatever it might be in a particular brand or for a particular franchisee in a certain location? So that's one. And then the other one is really kind of on the vendor side, things that you see with C4, CELSIUS, or things of that nature, gives another product for the franchisee to be able to sell and service the customer, but it doesn't necessarily put somebody in class, right? They're not going to come and sign up, take a CycleBar class, so they can drink a CELSIUS. But there are other drivers like our healthcare deals and the MIRROR deal and other things that we're doing to drive our digital customers even into the brick-and-mortar.\n\nSo the partnerships really broke up in those two ways, but still early innings on the partnerships that are continuing to drive more people in seats. But you are seeing AUV increase and that's increasing somewhat from price, but also, from driving more people into the studios.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nGotcha. Thank you. Good luck.\n\nOperator\n\nThank you. Our next question has come from the line of Joe Altobello with Raymond James. Please proceed with your questions.\n\nJoe Altobello -- Raymond James -- Analyst\n\nThanks, guys. Good afternoon. Just want to go back to your franchisee base for a second. Maybe speak to the health or the financial health of your franchisees.\n\nAre you seeing any signs that macro pressures are having an impact on that base? For example, are franchisees buying one or two licenses rather than three to four, for example?\n\nAnthony Geisler -- Chief Executive Officer\n\nSo, we're not necessarily seeing that. Even in Q2, we were able to hit our current run rate number. And that's difficult to do typically in Q2 because as a franchisor, we have to refile in all the states and they'll be able to sell franchises. So, we're blacked out.\n\nSo even in Q2 for a couple of our top-selling brands like Rumble and BFT, we were still in the refiling process in Q2 in states like California, New York, which are places we sell well and want to be in. So, we're still seeing franchisees continue to buy. We've never been a big company on doing 20 packs or 30 packs or 50 packs or things of that nature. We've typically always sold on average about three per franchisee because that allows them to get out and get open and develop over a shorter period of time.\n\nAs a business, we've never had a problem scaling from the franchise sales side. So, another concept, people may look at it and say, hey, if somebody wants to buy 10, I better sell them the 10 and wait to develop that over five years because I can't sell or scale as quickly. For us, we would rather sell 3-3 packs to get to nine and sell one nine-pack and wait, right? Because we could be developing those 3-3 packs in conjunction with each other. So not necessarily people coming and getting 1s and 2s.\n\nWe still give a discount at three. So it tends to drive a lot of the sales part toward a three-pack.\n\nJoe Altobello -- Raymond James -- Analyst\n\nOK. That's helpful. And maybe just a follow-up on that. Looking at your cash flow, was very strong here in the first half.\n\nAnd I guess you guys are going to have a high-class problem in the sense that you're going to have sort of C cash buildup on the balance sheet. What's the, I guess, top priorities in terms of cash deployment over the next, call it, 18 months or 24 months?\n\nJohn Meloun -- Chief Financial Officer\n\nYeah. So as far as cash and you're right, I mean, as the company continues to generate cash operationally, there will be more or less a stacking of cash on the balance sheet. In the current capital structure, we continue to evaluate and determine whether or not it's more efficient to change the preferable or convertible preferred or how we have our debt structure. So, we are evaluating that.\n\nIt is something that's on our radar. Long term, if you look out two years, three years, four years, the company will be putting off a lot of cash. So things that we have considered and talked about is the opportunity to do things like share buybacks or potentially dividends. And we'll continue to evaluate that this year and into the next year.\n\nBut from our perspective, our focus right now is driving operations and in parallel, looking at how we could potentially change the capital structure, so it's more efficient for us long term.\n\nJoe Altobello -- Raymond James -- Analyst\n\nOK, great. Thanks, guys.\n\nOperator\n\nThank you. Our next question has come from the line of George Kelly with ROTH Capital Partners. Please proceed with your questions. \n\nGeorge Kelly -- ROTH Capital Partners -- Analyst\n\nHi. Thanks, everybody. So, two questions for you. First on XPASS.\n\nJust curious what the plan is to keep growing that product and how soon could it be that we start seeing an impact on your overall royalty rate just as that volume through XPASS builds?\n\nSarah Luna -- President\n\nYeah. We're continuing to look at the way that our members are interfacing with XPASS. Today, over the last quarter, we were actually able to drive down our cost per conversion. So that declined even after being able to do that in Q1.\n\nSo, we're looking at ways that we can blend our acquisition of customers to make sure that we're not paying for every customer that's coming in and then putting those customers into each of the individual studios. So really, we're working on optimizing the marketing efficiency of XPASS and then making that beneficial to the franchise partners. And then we're constantly looking at the technology in ways that we can continue to optimize the technology based on how consumers are using the membership, as well as the digital experience.\n\nGeorge Kelly -- ROTH Capital Partners -- Analyst\n\nOK. Gotcha. And then next question was on pricing. So curious, I know your AUVs now are exceeding pre-COVID, the pre-COVID highs.\n\nJust curious how much of that is pricing and how much of that is member growth?\n\nSarah Luna -- President\n\nYeah. So today, it's actually both. So, we're seeing that the membership -- average memberships per unit is growing, but we're also taking price on a daily basis. So as mentioned earlier, as we start to see that, demand is high, supply is low.\n\nWe work with the franchise partners at the corporate office to help them with their pricing model. We have five different pricing tiers across each of the brands. So, as we start to see that, utilization is high and their capacity is low, we first evaluate pricing and increase pricing where we feel that we can -- where we can do that for new customers. And that will start to decrease some of the wait list that we see across the studios and allow us to backfill canceled members with more expensive memberships.\n\nGeorge Kelly -- ROTH Capital Partners -- Analyst\n\nOK. I don't know if you have, maybe you don't, but is your consolidated member count sort of on par with pre-COVID levels? Or maybe you on a AUV -- or on a unit level basis or maybe you've exceeded it?\n\nAnthony Geisler -- Chief Executive Officer\n\nThat's definitely way higher. Utilization is higher. Membership count is higher. AUV is higher.\n\nSo, all those KPIs are past pre-COVID and continue to climb.\n\nJohn Meloun -- Chief Financial Officer\n\nAnd it's on a per studio basis as well. So the average members per studio is well above the pre-COVID wells.\n\nGeorge Kelly -- ROTH Capital Partners -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question has come from the line of Peter Keith with Piper Sandler. Please proceed with your question.\n\nUnknown speaker\n\nThis is Matt on for Peter. Appreciate you taking the time. One quick one from us. You mentioned some revenue growth in the prepared remarks was driven by higher royalty rates.\n\nI was just curious, I thought that was kind of a steady, maybe not as much of a leverage. So I guess what do you have in terms of ways you can increase your royalty rates? Obviously, there's a balance there. So just -- and then maybe what's the long-term target for that?\n\nAnthony Geisler -- Chief Executive Officer\n\nYeah. Higher royalty dollars come from 7% times higher systemwide sales, not from driving a higher percentage. However, Club Pilates, for instance, has increased from 6% to 7% to 8%. And so now on a go-forward basis, Club Pilates, which is our -- one of our highest AUV drivers, of course, highest systemwide sales driver with the most open units on a go-forward basis for new units coming on, not existing, but for new units being added to the system and opened and sold will drive at 8%.\n\nBut the royalty growth we're talking about simply comes from the same average percentage times a larger systemwide sales number.\n\nUnknown speaker\n\nOK. Got it. Understood. And then also going back on the business updates with MIRROR and LA Fitness and some of the others you've mentioned.\n\nI think it was once framed up that you can go to, say, a corporate and roll it out to like their corporate employee base. I was just curious if you'll have any updates on doing anything like that on the B2B front.\n\nAnthony Geisler -- Chief Executive Officer\n\nStill an opportunity for us, and we don't have anything we can announce yet, but it's still continuing to do that. And that's still a focus like many others for us as we find ways to leverage our assets like XPLUS and XPASS.\n\nUnknown speaker\n\nAll right. Thanks.\n\nOperator\n\nThank you. There are no further questions at this time. I would now like to turn the call back over to Anthony Geisler for any closing comments.\n\nAnthony Geisler -- Chief Executive Officer\n\nThank you. And thank you again for joining today's earnings call. In addition to our investor support, I'd like to acknowledge the entire Xponential Fitness team and our franchisees for their strong operational execution in the second quarter. Thank you, team, for your hard work and dedication to making boutique fitness accessible to everyone.\n\nI'd also like to note that next month, we will be participating in the Jefferies Virtual Fitness & Wellness Summit, as well as the Piper Sandler Global Consumer Technology Conference in Nashville and the Raymond James Consumer Conference in New York City. We hope to see many of you out there. Have a great day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKim Esterkin -- Investor Relations\n\nAnthony Geisler -- Chief Executive Officer\n\nSarah Luna -- President\n\nJohn Meloun -- Chief Financial Officer\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nJonathan Komp -- Baird -- Analyst\n\nRandy Konik -- Jefferies -- Analyst\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nJoe Altobello -- Raymond James -- Analyst\n\nGeorge Kelly -- ROTH Capital Partners -- Analyst\n\nUnknown speaker\n\nMore XPOF analysis\n\nAll earnings call transcripts"
}