{
  "companyName": "GAN Limited",
  "companyTicker": "GAN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/gan-limited-gan-q2-2022-earnings-call-transcript/",
  "content": "GAN Limited (GAN 5.63%)\nQ2 2022 Earnings Call\nAug 15, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the GAN Limited second quarter 2022 earnings call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Robert Shore, head of investor relations for GAN. Thank you, sir.\n\nYou may begin.\n\nRobert Shore -- Head of Investor Relations\n\nThanks, Melissa. GAN's second quarter 2022 earnings release was issued today after the market close and is posted on the company's website at gan.com. With me today are Dermot Smurfit, our CEO; and Karen Flores, CFO. Please note that we have provided a set of PowerPoint slides that will accompany prepared remarks.\n\nYou may access these slides in the Investor Relations section of our website. I'd like to direct you to the second slide of the presentation we have posted in the IR portion of the website that talks to our forward-looking statement and legal disclosures. Along those lines, I'd like to remind our audience today that we may make forward-looking statements on the call, which protected under safe harbor afforded by the Federal Securities laws, in each case are qualified by the forward-looking disclaimers contained in our earnings release. Forward-looking statements are based on current information and assumptions concerning future performance.\n\nOur actual results of operations may vary from those anticipated or implied in the forward-looking statements for a number of reasons, including the risk factors included in our SEC filings from time to time. We may also reference non-GAAP financial measures such as adjusted EBITDA, which are intended to supplement and not substitute for comparable GAAP measures. They are included as additional clarifying items to aid investors in further understand the company's second quarter performance in addition to the impact these items and events have on the financial results. Reconciliations of certain non-GAAP financial measures to the comparable GAAP measures are provided in the appendix of the presentation.\n\nThe comparisons we make in the call today relate to the corresponding period of last year, unless otherwise noted. We will also provide growth rates in constant currency when available as a framework for assessing how our underlying risks have performed, excluding the effects of foreign currency rate fluctuations, our growth rates are the same in constant currency refer to growth rate quality. With that, I'll turn the call over to our CEO, Dermot Smurfit. Dermot, go ahead, please.\n\nDermot Smurfit -- Chief Executive Officer\n\nThank you, Bobby, and good afternoon, everyone. Please join me on the fourth slide of the presentation to discuss our second quarter 2022 financial performance and operating segment results. We continue to make strong progress executing our strategy during the second quarter. However, financial results were below our expectations due largely to factors outside of our control, including foreign currency fluctuations against the U.S.\n\ndollar and a tightened operating environment in certain markets in Europe that negatively impacted marketing and customer activity. To a lesser extent, results were also impacted by a slower-than-anticipated start in Ontario, Canada. We are taking specific actions to respond to changing business conditions while not losing sight that we are still in the very early innings of the rollout of U.S. digital gaming and continue to strategically invest our capital.\n\nWe will balance market dynamics by focusing our marketing spend on the highest return countries, improving both our cost structure and running the business more efficiently. Operationally, we continue to enhance and expand our product offerings. I'm delighted to announce today that Caesars Entertainment has been secured as a client of our iGaming Super RGS, which now lifts our content distribution network reach to approximately 50% of the overall U.S. iGaming market, up from 20% at the beginning of this year with a target to reach 80% in 2023.\n\nWe are also ready to roll out our new GameSTACK 2.0 platform and will very shortly launch online and retail GAN Sports technology in two states which represents the combination of our companywide commitment to reimagine the sports gambling experience in America. So getting into the results. On the B2B side, we delivered an all-time record quarterly performance, driven by a 28% increase in gross operator revenue. The recurring revenue portion of the business, which we refer to as platform and content fees grew by 13% from the prior year.\n\nWe are continuing to invest in our core B2B strategy here in the United States, which remains an essential driver of shareholder value. Our one-stop shop B2B capability, now very much led by demand for GAN Sports, coupled with our seamless multistate single-wallet player account management platform remains at the heart of our right-to-win B2B market share over time, and we are excited by the visible B2B opportunities within our pipeline as we progress through the balance of this year. Our B2C segment, however, did not fare so well in the second quarter despite showing strong underlying key performance indicators. Revenue was $20.8 million versus $23.9 million in the prior year.\n\nThe results relative to the prior year were impacted by four main items: First, the international business of coolbet.com saw a negative foreign currency impact of $2.7 million as a result of the strengthening U.S. dollar. Second, new marketing challenges emerge in certain European markets, which led to a broader tightening of the operating environment there. Third, we experienced a slower-than-anticipated start in Ontario, Canada.\n\nAnd lastly, we had a tough comparison with the second quarter of 2021, which featured two marquee global soccer tournaments, which generally serve to drive heightened customer engagement. In addition, we experienced a sports hold of 9.7% in the quarter versus a 7% normalized range, which created a $4.2 million benefit from last year's second quarter. Our B2C underlying key performance indicators remain quite healthy and are growing. We saw strong underlying growth in handle or volume of wagers, nearly 40% growth in active customers and our per unit customer acquisition costs remain well below peers driven by operations in Latin America.\n\nWe'll continue to focus on operational excellence, but to be very clear, our B2C business remains healthy, profitable and growing. Turning to the operational highlights. Our top priority continues to be profitability, which enabled positive adjusted EBITDA generation in the quarter. While our focus is on profitability, both from the expense discipline perspective, as well as maximizing efficiencies, we continue to ensure that we make strong progress on our core strategy.\n\nGAN Sports is generating significant buzz and awards, and we expect a robust live launch schedule next year. We are continuing to build a unique library of content and games from our own studio, Silverback, to complement the rapidly growing Ainsworth library of more than 100 slots exclusively distributed online by GAN here in the United States. Jumping to our outlook for the full year 2022. We are revising our full year revenue to between $142.5 million and $152.5 million and our adjusted EBITDA to between $10 million and $15 million.\n\nOur revised revenue guidance incorporates our current expectations with respect to the impact of FX and operational headwinds in Europe related to B2C, as well as the slower start in Ontario. While we are disappointed in having to outlook -- lower our outlook for the balance of 2022, we expect to continue to yield positive adjusted EBITDA in every quarter of 2022 and deliver positive cash flow in the fourth quarter. Profitable growth is our No. 1 priority.\n\nFurthermore, the team is working diligently to mitigate the top-line challenges with measures to further refine our cost structure and protect our margins. While we continue to invest in our strategic initiatives, our overarching focus remains to generate increased levels of adjusted EBITDA, profitability and free cash flow. Several factors outside of our control will impact our operating results, the ultimate timing of the state-by-state rollout of the B2B U.S. opportunity, regulatory changes in key markets we serve, macroeconomic conditions and, of course, currency fluctuations.\n\nBut it is important to note that we are uniquely positioned with a leading full stack technology offering in online and retail sports betting, accompanying trading services, iGaming aggregation and, of course, social casino simulated gaming. I'm no less optimistic that GAN will continue to grow our clients, capture an increasing piece of the value chain and ultimately create substantial opportunities for our B2B platform and, of course, our GAN Sports omnichannel solutions as we seek to create value for all of our stakeholders. Let's move on together to the next slide, Slide 5. So you've heard us talk about our three strategic priorities: number one, cost discipline and profitable growth; number two, our investment strategy to capture a greater wallet share of the B2B value chain, which now includes GAN Sports and Super RGS; and thirdly, optimizing the organic growth we are seeing in both our B2B and B2C segments.\n\nOn the first tenet of cost discipline and profitable growth, we've been progressing well in the next iteration of our PAM. And as a reminder, our PAM or player account management platform includes patented technology enabling Americas retail casinos to offer online sports betting or iGaming seamlessly integrated with our existing on-property rewards program proven to be a critical success factor for online B2C operators with retail casinos. We've recently evolved our PAM by combining the best elements of our battle-tested proven U.S. platform with the leading element of Coolbet's award-winning technology to create GameSTACK 2.0.\n\nThis will be a best-in-class platform for our new and existing B2B clients with a host of new capabilities to further drive new revenue-generating deal wins. In addition to the added benefit, the platform is significantly more efficient to both maintain and develop. This year, we will also realize the majority of a $10 million annual tangible benefit in cost savings from GameSTACK 2.0 as a result of synergies in combining these technologies. Let's move together on to Slide 6, please, Slide 6.\n\nSwitching gears here to our investment strategy. We're still very much in the early stages of the sports and online opportunity in North America and remain laser-focused on delivering industry-leading product solutions to operators in these markets as recently recognized by Eilers & Krejcik research when they reviewed B2B powered apps. The outcome of this will be significant recurring B2B revenue that translates to better adjusted EBITDA and free cash flow generation. Our Super RGS, or iGaming content aggregation platform strategy is making great strides.\n\nAs touched on earlier, Caesars Entertainment today joins our growing client list. We now offer over 2,500 game titles here in the U.S., which is nearly 800 games increased from last year, and that includes over 100 exclusive online casino titles. Our own studio Silverback, based in Bulgaria is now producing fresh new content that we're really excited about. And the customer feedback on our upcoming expanded proprietary portfolio has been both positive and encouraging, with a handful of games currently preparing for certification in the fourth quarter.\n\nMoving across to GAN Sports. The product itself has exceeded our expectations since we originally acquired Coolbet in January of 2021 for the purpose of bringing their leading offering to the U.S. sports market. In the coming weeks, we will launch GAN Sports subject to regulatory approvals, which will be followed by a field technical trial in the Las Vegas locals market with Red Rock Resorts and a modest note of thanks to our friends at Red Rock Resorts for their support of GAN, and I'll draw your attention to their client testimonial set out on the slide, which merits industry attention.\n\nI'd like to note here, as many on the call already know, gaming is heavily regulated and the timing of go-live date is very much subject to receiving gaming regulatory approvals in the relevant states, which is very much outside of our control. However, our licensing and compliance team has been working around the clock with regulators to move this process forward. And as a proof point of this work, I'm happy to say that GAN is now licensed in 16 U.S. states and Ontario, Canada versus just seven states this time last year.\n\nThese regulatory relationships and associated privileged gaming licenses represent very real assets, both today and in the future, as well as creating a significant barrier to entry for competition. So we won't get ahead of ourselves or our partners, but we do expect a robust rollout of GAN Sports and Super RGS and will formally announce additional client partners as all approvals are received. Let's move on to Slide 7. Slide 7.\n\nTurning to the opportunity for organic growth and what makes us so excited about the future of GAN and why we are so different than our peers. Firstly, in our B2C segment, we have a profitable cash generative business with a leading brand, a great product and an opportunity to expand to new markets in a capital-light manner. Secondly, in our B2B segment, we can leverage our award-winning products, significant experience in regulated markets and being a one-stop shop solution with B2B sportsbook, multistate player account management enterprise solution and leading iGaming aggregation. There is a ton of runway ahead to grow and scale our B2B business.\n\nLet's move on to the next slide, Slide 8. This slide shows that GAN is the only provider that can truly provide a proven end-to-end B2B patented technology solution across retail and online sports betting, iGaming content and iGaming aggregation fully supported, of course, by our award-winning trading team led by Endre Nesset in Tallinn, Estonia, and our marketing services team led by Meir Deutsch and user acquisition and retention experts located in Tel Aviv, Israel. And so as more states come online, we are uniquely positioned to provide clients with a full suite of enterprise solutions that get them up, running and winning. From this perspective, there is really no true competitor to GAN that can deliver this kind of comprehensive offering across so many states today.\n\nThere are, of course, stand-alone B2B vendors of iGaming and iGaming aggregation. There are also B2B vendors of stand-alone sports solutions. Nobody else can do for clients what GAN can, and I'm extremely proud to represent all of our employees and team members today, many of whom have been working for years to create this unique full-service B2B enterprise solution customized to capture the continuing online gambling opportunity in America. Moving on to the next slide, Slide 9.\n\nI'll take the opportunity to remind everyone listening that our strongest quarter this year will be the fourth quarter with the World Cup occurring over the months of November and December. The last World Cup four years ago, saw over $150 billion wagered over the tournament. At that time, Coolbet was still in its infancy with under 40,000 active customers on a quarterly basis compared to the current active customer base of 260,000. In addition to the potential 4Q revenue and adjusted EBITDA lift, we anticipate the event will be both a key customer acquisition event, as well as a significant reactivation event.\n\nAs a reminder, Coolbet just recently registered its 1 millionth verified customer account and Coolbet continues to enjoy some customer loyalty or nearly 50% of players that joined before 2019 remain active customers today. We're excited to introduce a new cohort of players to Coolbet's brand and leading technology offering. We're also planning to launch in Mexico in the fourth quarter, a new regulated B2C opportunity for coolbet.com. We expect our share of this anticipated $600 million TAM to grow over time.\n\nBut initially, we expect both investment spend and revenue to be modest as we gain familiarity with the market with the first true scaling opportunity to occur in 2023. On the B2B side, we're very much looking forward to, firstly, the launch of GAN Sports; secondly, showcasing new features of our B2B offerings at G2E; and thirdly, capturing opportunities in multiple incremental states, including Oklahoma, Ohio, Massachusetts, and in particular, California, where we provide simulated gaming to leading tribal operators. Of note, California will hold a ballot initiative in November, which could create substantial B2B opportunities for GAN Sports and our new platform, GameSTACK 2.0. Before turning the call over to Karen, I'd note that while I'm not pleased with this quarter's results and the revision of guidance, I'll make a few additional points.\n\nFirstly, we're taking measures to mitigate near-term revenue headwinds. Secondly, the strategic progress behind our long-term initiatives continues unabated. And thirdly, there are several potential catalysts in the back half of this year. In the mid- to longer term, we're still in the very early innings of a massive opportunity in both domestic B2B and our international B2C markets.\n\nAnd while the timing of new market openings and the general macro environments are uncertain today, we continue to focus on what we can control and find additional ways to run the business more efficiently and ultimately more profitably. The result will be accelerated adjusted EBITDA, strong top line growth, a great product for our clients that I'm confident will drive increased shareholder value. With that, I'll hand it over to Karen. Karen?\n\nKaren Flores -- Chief Financial Officer\n\nThank you, and good afternoon, everyone. As Dermot referenced, Q2 came in under our initial expectations as a result of several factors. First, FX. The U.S.\n\ndollar strengthened during the quarter at a higher rate than what we've observed over the last year, and with the majority of our business currently derived internationally, this created a headwind that was the largest driver of the shortfall. As a result, revenue and adjusted EBITDA were negatively impacted $2.7 million and $1.3 million, respectively, on a year-over-year constant currency basis and $1.3 million and $600,000, respectively, versus the expectations included in our initial guidance. Next, we observed the tightening of the operating environment in certain markets in Europe, which resulted in an unexpected contraction in active users and revenue. As a result, Europe Q2 revenue of $10.2 million declined 28% and 18% in constant currency.\n\nLastly, our financial results in the second quarter of 2021 provide a tough comparison as we observed higher-than-normalized hold during the European football tournament, which positively impacted our revenue and profitability by $4.2 million in the prior year quarter as disclosed previously. Moving forward, I'll simply refer to this in my comments as the Q2 '21 hold event. Now turning to our consolidated quarterly business results. Q2 revenue of $35 million increased 2% compared to the prior year.\n\nAdjusting for the effect of currency exchange, revenue increased 10% in constant currency. Record B2B revenue of $14.2 million increased 36% and B2C revenue of $20.8 million declined 13% and 2% in constant currency versus the prior year quarter, which included the Q2 '21 hold event. Gross profit margins remained flat year over year at 70%. Adjusted EBITDA was $1.3 million, compared to $3.5 million in the prior year with a $1.3 million negative impact from constant currency effect and earnings in the prior year benefiting from the Q2 '21 hold event.\n\nAdjusted operating expense of $23.4 million was up 15% versus $20.5 million in the prior year quarter. The largest increase was related to sales and marketing, up 36% to $7.1 million and five points from 15% to 20% of revenue related to focused efforts to grow our customer base in emerging Latin American markets. Products and technology costs increased 15% to $5.1 million and two points from 13% to 15% of revenue, in line with investments in our technology platforms and upcoming launches. We expect to see positive near-term returns in both these areas of sales and marketing and product and technology.\n\nOur largest operating expense, G&A increased 4% year over year to $11.2 million and one point from 31% to 32% of revenue, largely due to software and related technology expenses, as well as unfavorable FX expense. These increases were partially offset by a reduction in professional fees as part of our ongoing effort to in-source our back office and development functions. Total interest expense of $1.1 million this quarter included $664,000 related to the April closing of our $30 million debt facility, which is now fully drawn down. The credit agreement was filed in conjunction with our 10-Q today as a material agreement for the company.\n\nDepreciation and amortization increased $2.4 million to $6.6 million for the quarter. The increase was primarily related to the amortization of acquired assets related to our Super RGS content licensing strategy. Our net loss of $38.3 million and EPS of negative $0.91 included a $28.9 million noncash impairment charge we recorded in the quarter. The impairment relates to our Coolbet acquisition completed in early January of 2021.\n\nAs most on the call are aware, valuations across the broader gaming technology and growth sectors have declined since that time, and the decline we've seen in our equity market cap was the primary driver of the write-down of our goodwill. As Dermot commented, we are seeing underlying strength in the business exhibited by strong KPIs in both segments and driven by our core growth markets of B2B U.S., which increased 41% year over year and B2C Latin America, which increased 9% and 22% in constant currency. As we approach the balance of the year, we intend to continue investing in future growth, while also refining and improving our cost structure, remaining vigilant in responding to changing business conditions. We expect to benefit from maintenance and support costs related to the integration of our GameSTACK 2.0 release, and we are carefully focused on our marketing spend, allocating it where we expect maximum returns.\n\nLastly, we ended the quarter with $49 million in cash, and our balance sheet is healthy following the establishment of our debt facility in late April. Moving on to Slide 12. I'll provide a bit more color on our B2C segment results. The underlying KPIs of the B2C segment remain healthy and growing, particularly in Latin America.\n\nOverall active customers of 260,000 was up nearly 40% from 187,000 in the prior year. This drove $557 million in handle, up 8% from the prior year and 22% in constant currency. Average turnover per active user has shifted downward driven by the geographic mix as Latin American growth is outpacing Europe, which has a higher proportion of VIPs versus retail players. In the prior year quarter, Latin America drove two-thirds of our active players and 40% of turnover.\n\nThis quarter, Latin America accounts for 75% of our active players and over 45% of turnover. Overall, Q2 B2C segment revenue of $20.8 million decreased 13% versus the prior year and 2% in constant currency. Increases in B2C revenues in Latin America, up 9% and 23% constant currency offset the declines experienced in Europe, which declined 27% and 17% constant currency as a result of changes to the operating environment, which contracted the active user base. The 23% increase in Latin America on a constant currency basis is particularly noteworthy given the prior year comparison includes both the Euro tournament, and the Q2 '21 hold event.\n\nQ2 sports hold was a normalized 7.1% compared to 9.7% for the prior year quarter. Additionally, customer acquisition costs remained stable at $65, and we continue to be pleased with the overall efficiency of our global acquisition efforts, which results in average payback periods of approximately four months. Turning to Slide 13. Q2 B2B segment revenue of $14.2 million increased 36% and in fact, has increased sequentially for the past four quarters.\n\nRecurring platform and content fee revenue represented 74% of segment revenue and increased 13% to $10.5 million. The increase was driven by 28% growth in gross operator revenue to $283 million. We experienced a 22% increase in U.S. rail money iGaming SaaS revenue, fueled by strong organic growth in Michigan, New Jersey and Pennsylvania, along with new states, including Connecticut and West Virginia.\n\nItaly declined 31% and 23% in constant currency, and that represents 10% of B2B revenue. Our simulated business was down 5%, representing 20% of total B2B revenue in the quarter. The take rate on our revenue increased 30 basis points from the prior year period to 5% on a higher mix of development and hardware revenues in the quarter. Over time, as we've said before, we expect the take rate to increase as we offer our full enterprise solution to capture the greater economics in the B2B value chain, but in the near term, it will fluctuate related to the mix shift of development services and other revenue.\n\nMoving on to our full year guidance on Slide 14. For full year revenue, we are now guiding a range of $142.5 million to $152.5 million. Within this, we are modestly increasing our B2B revenue guidance up from our prior guidance of $50 million to $55 million to now $52.5 million to $57.5 million and decreasing our B2C segment revenue guidance from our prior guidance of $105 million to $110 million, to now $90 million to $95 million. Our revised B2C segment revenue forecast is driven by two main factors.\n\nFirst, foreign currency headwinds. Our new outlook assumes a euro-dollar rate at parity for the second half of the year, down from when we initially presented our outlook. To take a simple example, EUR 100 million on last year's foreign currency exchange rates was worth approximately $118 million. This now equates to $105 million, taking actual exchange rates through July and holding July constant for the remainder of the year.\n\nThis is also a reduction versus the $130 million we would have assumed at the time of our original guidance. Said another way, the negative impact to B2C is approximately 11% on a year-over-year constant currency basis and 7% versus our original guidance. The second factor is softness outside our emerging growth market of Latin America. This is driven by marketing challenges in certain markets in Europe, which are contracting active users, and we have softened our outlook for B2C operations in the regulated market of Ontario due to the intensely competitive environment.\n\nOur revised guidance does not change our outlook that 2022 is a significant turning point for GAN, where we have incurred adjusted EBITDA losses for the last two years as we built the business for scale and remain confident that our efforts to drive top line organic growth and accelerated profitability will result in an overall adjusted EBITDA profit for 2022. Let me discuss some of the operational changes we are implementing in response to current market dynamics. First, on the expense side, our biggest expense item is labor. We have implemented some headcount reductions and our ending headcount in June was 675 as compared to 730 at the start of this year.\n\nWhile we have reduced headcount and are slowing our hiring ramp, the benefit of the integration and launch of GameSTACK 2.0 and its $10 million in annual synergies will allow us to focus resources to remain on track with our long-term strategies. Second, marketing spend in B2C is flexible and easily dialed up and down. We are reallocating spend only to the highest ROI countries, and we'll dial back where we aren't seeing a strong return. Third, in Ontario, we are launching a data app prior to the end of the quarter, and we'll continue to monitor the return on ad spend and customer LTVs in this market to ensure it enhances our future growth.\n\nBased on the above actions, we anticipate a reduced 40% flow-through impact of the revised revenue guidance. And as such, we're lowering our full year guidance for adjusted EBITDA to a range of $10 million to $15 million from our prior guidance of $15 million to $20 million. On a final note, we executed against our share repurchase program in the quarter. During the three months ended June 30, we repurchased 303,000 shares at an average price of $3.32 under our $5 million share repurchase authorization, fulfilling 20% of the total program.\n\nWe'll continue to monitor market conditions and remain opportunistic as we consider our objectives relative to free cash flow generation and maintaining a strong balance sheet. Moving on to Slide 15 and wrapping up my remarks. While our results this quarter were below the expectations we set for ourselves, the business remains very healthy and on a strong trajectory which was evident in our B2B results and the strong underlying key performance indicators in B2C despite operational headwinds. There is a lot to look forward to in the back half of the year, including the launch of GAN Sports and the FIFA World Cup.\n\nIn the mid- to longer term, GAN is uniquely positioned to capture an increasingly greater share of the U.S. sports and iGaming market, given our comprehensive end-to-end enterprise solution, expanding client roster and growing track record of delivering client success. I'll now turn the line back over to the operator to open it up for questions. Melissa, back to you.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of David Bain with B. Riley Securities. Please proceed with your question.\n\nDavid Bain -- B. Riley Securities -- Analyst\n\nThank you. I guess my first question, I understand B2C continues as profitable and is growing handle. But the marketing spend ratio has also moved up a little bit. How should we look at that from here in FIFA and the launch in Mexico in 4Q? I understand that the big customer acquisition opportunity and time period, should we look at that to rise a little bit at that point, along with the absolute EBITDA? And how do we target the percentage over the next several quarters? If you can help us with that, it would be great.\n\nKaren Flores -- Chief Financial Officer\n\nYeah. What I would say there is that we're -- we generally targeted 2022 as approximately 20% of revenue, but it will pick up in the fourth quarter because we do have additional marketing activities that we're putting behind the World Cup event, primarily within Latin America as we noted on the call. So you might see an uptick. But in general, it's -- we expect the marketing ratio because of the efficiency of the marketing spend by nature of the Coolbet business and how they promote the brand within each of the countries, we expect it to continue to be efficient, so around 20% is a good expectation.\n\nDavid Bain -- B. Riley Securities -- Analyst\n\nOK. Great. And then I appreciate that you reiterated the 4Q free cash flow guidance. If we look past that, given that there's an event in 4Q, and we look to 1Q, I mean, does free cash flow, should we look at it improving year over year and maybe getting net positive for the year, full year next year? Or can we look at it more like sustainable from a free cash flow standpoint from 4Q and 1Q or even 2Q? How do we think about the cadence there?\n\nKaren Flores -- Chief Financial Officer\n\nYeah. We're not specifically guiding it to 2023, but it is our expectation that we'll be overall free cash flow positive for the full year next year. Of course, the fourth quarter right now is the only quarter in 2022 that we're targeting to be free cash flow positive, but we do expect that to be, again, a wholesale change as we're talking about really accelerated path to profitability, which is the entire objective, our key priority right now. So we're going to continue pressing on that, and we expect continued improvement as we move through 2023 and continue to hit these milestones that we set for ourselves relative to the overall scaling of the business.\n\nDavid Bain -- B. Riley Securities -- Analyst\n\nOK. Great. Thanks so much.\n\nOperator\n\nThank you. Our next question comes from the line of Chad Beynon with Macquarie Group. Please proceed with your question.\n\nAaron Lee -- Macquarie Group -- Analyst\n\nHi. This is Aaron on for Chad. Thanks for taking my question. Can you talk about the opportunity set of potential partners in North America? Has the macroeconomic backdrop impacted the conversations you're having with potential customers in any way? Or has that been balanced by the somewhat more rational promotional environment and the progress toward profitability that a lot of the operators have made this quarter? Thanks.\n\nDermot Smurfit -- Chief Executive Officer\n\nAaron, thanks for the question. The different cohorts of potential B2B clients remains largely the same. You've got effectively every B2C operator of iGaming is a very clear candidate to be a client of iGaming aggregation in Super RGS driven by demand for the Ainsworth slots, but also some of the emerging slots coming out of our great new Silverback game studio in Bulgaria. When it comes to the PAM opportunity, we're certainly being a lot more aggressive in seeking minimum financial commitments from our B2B clients, so whether that's manifest as a minimum revenue or fee guaranteed again or in minimum marketing commitments to drive customer acquisition and therefore revenues, those are the two ways that we like to skin that particular cat.\n\nSo it's very much similar, plenty of Native American gaming opportunities in the sales pipeline near term, plenty of commercial opportunities principally around GAN Sports in a competitive replacement marketplace where we're seeking to displace or replace various different existing incumbent vendors of stand-alone B2B sports, and we're super excited by the demand indicators we're seeing that. Hopefully, Aaron, that answers most of your questions.\n\nAaron Lee -- Macquarie Group -- Analyst\n\nYeah, it does. That's helpful. And a follow-up for me. There's been an increase recently in M&A opportunities.\n\nCan you talk about if you believe you have everything within your company? Or are there opportunities to grow inorganically now as well? Thank you.\n\nDermot Smurfit -- Chief Executive Officer\n\nAaron, M&A is not part of our near-term focus right now. I mean it's a very interesting M&A environment when stocks appear to hit a bottom and bounce. So we'll monitor what happens next. But from our standpoint, we're really heads down focused on delivering fourth quarter free cash flow, profitable growth, all the aspects that we tried to communicate to the market over the course of the last few minutes, but no significant M&A.\n\nWe feel we are feature complete. Coolbet completed GAN with incredible GAN Sports technology. And as I said earlier, we're getting extraordinary very strong demand indicators for that retail and online sports offering.\n\nAaron Lee -- Macquarie Group -- Analyst\n\nOK. Understood. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Ryan Sigdahl with Craig-Hallum Capital Group. Please proceed with your question.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nGood afternoon. Thanks for taking my questions. I want to start with Mexico. So you mentioned in the call, you'll be launching B2C, but I believe you said you'll be launching a B2B customer as well in the press release or slide deck somewhere so.\n\nIs that an existing customer or a new customer? And then can you talk about kind of balancing B2B and the B2C in that market?\n\nDermot Smurfit -- Chief Executive Officer\n\nRyan, I'm afraid some of these wires across somewhere. Now Mexico is a regulated B2C market opportunity for us exclusively. We don't have any intention for B2B activities in Latin America, generally. And of course, Mexico is part of Latin America.\n\nSo if there was an error, then we will correct as appropriate. But Mexico to be abundantly clear is a B2C opportunity for GAN.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nNo, that could just be me, Dermot. I will go back and look. That's helpful. On the goodwill impairment, can you elaborate a little bit more what happened there, what's going on, and why it's in the B2B segment versus B2C?\n\nKaren Flores -- Chief Financial Officer\n\nYeah. I mean, Ryan, what I would say is that ultimately ties back to, of course, our intent to bring the Coolbet technology into the U.S. market and how we developed a model around that. There's been, of course, again, some modifications to the long-term strategy, the long-range forecast there.\n\nAnd it's -- again, relative to the overall equity valuation of the company, it was perfunctory relative to the change in the equity market cap. So we did take it within the B2B segment, and we have about $105 million left as outlined in the Q, and it's about a 65-35 split leaning toward B2C.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nAnd remind me, is that all of that back to the Coolbet acquisition? Or is there other -- anything else in there?\n\nKaren Flores -- Chief Financial Officer\n\nNo, it's the Coolbet acquisition.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Thanks. That's it.\n\nOperator\n\nThank you. [Operator instructions] Our next question is a follow-up from the line of David Bain with B. Riley Securities. Please proceed with your question.\n\nDavid Bain -- B. Riley Securities -- Analyst\n\nGreat. Thanks. If I could, just two more. One was following up from the customer acquisition strategy, one of the hold strategies among B2C has been augmentation of the exotic bets, the parlays and real-time betting.\n\nCan you tell us how Coolbet's been trending within that category in terms of new offerings and any forward initiatives to sort of move hold higher as we go forward?\n\nDermot Smurfit -- Chief Executive Officer\n\nYup, David, there's been a lot of focus on developing the early cash our capabilities and that's specifically for the international markets centered around Latin America. So that's been improving or helping support hold expectations and delivery. Then secondarily, effectively multi-leg parlays for the U.S. has been a major focus for us as we build up toward launch of GAN Sports in the coming weeks.\n\nAnd that's been extremely well received. And as I think most people within U.S. sports family knowledge know that they're extremely high-margin offerings for the end-user consumer, particularly in the retail environment. So we have a unique competitive advantage there, we believe.\n\nDavid Bain -- B. Riley Securities -- Analyst\n\nOK. Awesome. And then I get excited about the iBridge still. Anything new in terms of just even general more substantive conversations that you may be having since legal action was taken on a potential patent violation or any update in general on iBridge?\n\nDermot Smurfit -- Chief Executive Officer\n\nYeah, it's always early to comment on IP enforcement strategies, motions have been filed, and we have filed our counter oppositions to said motions, and we are extremely committed to enforcing our intellectual property rights here in the United States. And so far, as I said, we are pursuing the litigation of the claim, but it's still extremely early to make any substantive comment or observation at this time, David.\n\nDavid Bain -- B. Riley Securities -- Analyst\n\nOK. Fair enough. Thanks so much.\n\nOperator\n\nThank you. Ladies and gentlemen, this concludes our question-and-answer session. I'll turn the floor back to Mr. Smurfit for any final comments.\n\nDermot Smurfit -- Chief Executive Officer\n\nThank you, Melissa, and thank you, everyone, for joining us today. Well, we still have some work to do, but I'm extremely excited for the back half of the year to launch GAN Sports, enter new markets and the opportunity to introduce new players to the Coolbet brand during the World Cup. I do hope to see some of you in person at G2E in Las Vegas as we showcase our full service enterprise solution for digital gaming. Thank you again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRobert Shore -- Head of Investor Relations\n\nDermot Smurfit -- Chief Executive Officer\n\nKaren Flores -- Chief Financial Officer\n\nDavid Bain -- B. Riley Securities -- Analyst\n\nAaron Lee -- Macquarie Group -- Analyst\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nMore GAN analysis\n\nAll earnings call transcripts"
}