{
  "companyName": "Target",
  "companyTicker": "TGT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/16/target-tgt-q3-2022-earnings-call-transcript/",
  "content": "Target (TGT 0.45%)\nQ3 2022 Earnings Call\nNov 16, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to Target Corporation's third quarter earnings release conference call. [Operator instructions] As a reminder, this conference is being recorded, Wednesday, November 16, 2022. I would now like to turn the conference over to Mr.\n\nJohn Hulbert, vice president, investor relations. Please go ahead, sir.\n\nJohn Hulbert -- Vice President, Investor Relations\n\nGood morning, everyone, and thank you for joining us on our third quarter 2022 earnings conference call. On the line with me today are Brian Cornell, chairman and chief executive officer; Christina Hennington, chief growth officer; John Mulligan, chief operating officer; and Michael Fiddelke, chief financial officer. In a few moments, Brian, Christina, John, and Michael will provide their perspective on our third quarter performance and our outlook and priorities for the fourth quarter and beyond. Following their remarks, we'll open the phone lines for a question-and-answer session.\n\nThis morning, we're joined on this conference call by investors and others who are listening to our comments via webcast. Following the call, Michael and I will be available to answer your follow-up questions. And finally, as a reminder, any forward-looking statements that we make this morning are subject to risks and uncertainties, including those described in this morning's earnings press release and in our most recently filed 10-K. Also in these remarks, we refer to non-GAAP financial measures, including adjusted earnings per share.\n\nReconciliations of all non-GAAP numbers to the most directly comparable GAAP number are included in this morning's press release, which is posted on our investor relations website. With that, I'll turn it over to Brian for his thoughts on the third quarter and his perspective on the upcoming holiday season. Brian?\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nThanks, John. As I begin the call today, I want to highlight the proactive leadership position we will continue to take as the operating environment changes. Just as we took decisive action in the second quarter to rightsize our inventory, we're moving proactively in a period of rapidly softening demand and elevated uncertainty to successfully navigate near-term challenges, alongside our team and in step with our guests. As we look specifically at third quarter results, they demonstrate how our business continues to serve our guests even in the face of an increasingly challenging backdrop.\n\nBecause of the deepening level of trust we've established with our guests over the last several years, our top line continues to benefit from growth in guest traffic and new share gains across all of our core categories. This is particularly notable as consumers are showing increasing signs of stress and pulling back from discretionary purchases. And it reinforces the value of having a balanced multi-category portfolio, which allows us to satisfy our guests' ever-changing wants and needs. In today's environment, that means we continue to benefit from strong growth and market share gains in the categories our guests are leaning into most right now, including food and beverage, beauty, and household essentials.\n\nQ3 comparable sales grew 2.7%, on top of 12.7% a year ago and 20.7% in the third quarter of 2020. As you recall, early in the second quarter, we announced we will be taking decisive inventory actions based on the rapid change in consumer buying patterns that emerged near the end of the first quarter. These actions were designed to ensure we could continue to provide what our guests know and love about Target. More specifically, the effort was designed to free up space in our stores and hours for our team to continue offering fresh inventory and a reliable, uncluttered shopping experience for our guests, setting up our business to deliver strong growth in Q3.\n\nAmong the drivers of our comparable sales. Third quarter traffic expanded 1.4%, on top of 12.9% growth a year ago. In addition to traffic growth, we saw a 1.3% increase in average ticket as guests continue to rely on Target for convenient, reliable one-stop shop. Across our merchandise categories and similar to the second quarter, we saw very strong growth in our frequency businesses, led by double-digit growth in both beauty, and food and beverage.\n\nThat strength offset persistent softness in our discretionary categories, which worsened at the end of the quarter. Christina will provide more detail in a few minutes. While overall Q3 comp growth was nearly identical to our second quarter performance, we experienced dramatically different trends within the quarter. More specifically, through the first two months of the quarter, we had seen comp growth of well over 3% and then saw a deceleration to just under 1% in October.\n\nEven within the month of October, results in the back half of the month were much softer than in the first half. In the mix, our sales tilted much more heavily toward promotions. This rapid change in trend is consistent with what we're seeing in syndicated data on broader industry trends and the feedback we're hearing from our guests. More specifically, consumers are feeling increasing levels of stress, driven by persistently high inflation, rapidly rising interest rates, and an elevated sense of uncertainty about their economic prospects.\n\nWith high rates of inflation continuing to erode their purchasing power, many consumers this year have relied on borrowing or dipping into their savings to manage their weekly budgets. But for many consumers, those options are starting to run out. As a result, our guests are exhibiting increasing price sensitivity, becoming more focused on and responsive to promotions and more hesitant to purchase at full price. On the profit line, we saw an expected improvement in the third quarter as we will be on the bulk of those costs from our second quarter inventory actions.\n\nHowever, Q3 profitability came in well below our expectations, driven by several factors. First and foremost, we faced an unexpected gross margin rate headwind from a higher than expected mix of promotional sales, as guests moved away from full price purchases. In addition, like the rest of the industry, we're facing a growing financial headwind from shortage, which is running hundreds of millions of dollars higher than a year ago. Along with other retailers, we've seen a significant increase in theft and organized retail crime across our business.\n\nAs a result, we're making significant investments in training and technology that can deter theft and keep our guests and store team members safe. Looking ahead and taking recent trends into account, our team is making adjustments in real time with agility and flexibility in light of the revised expectations for both the top and bottom lines in the fourth quarter. It's in tough environments like these that we're most fortunate to have a durable business model and a strong balance sheet, allowing us to maintain our focus on long-term investments and market share opportunities at a time when many others will be forced to pull back. And to create additional capacity for us to continue investing in long-term growth and market share while also delivering strong bottom-line performance, we are undertaking an enterprisewide effort to identify opportunities to simplify and enhance the efficiencies of our business.\n\nI want to make it clear. This effort is not about slashing resources. Instead, it's about optimizing our operations to match the scale of our business. This effort is particularly important today because of the rapid and unanticipated level of scale our business has added since 2019, as total revenues have grown from less than $80 billion in 2019 to projection of well over $100 billion this year.\n\nWhile our team has done an excellent job of staying agile and quickly accommodating all of that growth, we now have an opportunity to look from top to bottom across all of our operations to ensure they are fully optimized for the size of our business. We're still in the process of fully scoping out this effort, but we believe it presents an opportunity to save a total of $2 billion to $3 billion over the next three years in support of our investments in long-term growth along with our profit goals. In the near term, our team is energized and laser-focused on bringing the best of Target to our guests throughout the holiday season, knowing it's critically important for Target to be there for them during the busiest time of the year. Our team is committed to offering value across our entire assortment through great everyday prices, unbeatable value on our own brands, and accessible opening price points in every category.\n\nIn addition, we'll highlight our compelling and simple promotions, free services like drive-up and in-store pickup, and new accessible payment options. And, of course, we'll provide additional savings opportunities through our RedCard and Target Circle programs, neither of which has a membership fee. So, as I get ready to turn the call over to Christina, I want to thank the entire Target team for your energy, your spirit, your care for each other, and your passion for our guests and our brand. You're the reason that Target is such a positive impact on the communities where we live and work and the reason we're known as a welcoming and inclusive brand.\n\nThank you, and happy holidays to all of you. With that, I'll turn the call over to Christina.\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nThanks, Brian, and good morning, everyone. The current retail environment requires tremendous levels of flexibility, resilience, stamina, and focus, a balance our team continues to carry out at every guest interaction. Consumers are strained as they work to support their family's day-to-day needs while looking for the occasional affordable luxury, prepping for the changing seasons, and planning for the holidays. It's a difficult balance to strike and getting increasingly difficult each week as more and more of their household budget goes toward the needs of the family, which limits the amount available for discretionary purchases.\n\nSo, it follows that of the many considerations that our guests are currently juggling, we consistently hear that value remains at the top of the list. We see our guests holding out for and expecting promotions more than ever, spending less on regularly priced items. When they shop our frequency categories, some guests are trading into smaller-pack sizes, opening price point options for owned brands to reduce their spending on a single trip. Others are opting for larger-pack sizes for stocking up when items are on promotion, knowing they will receive greater per-unit value.\n\nAnd these trends only became more pronounced toward the end of the third quarter, when spending patterns changed dramatically. With inflationary food prices absorbing more of their spending, those costs are crowding out other categories, including spending on discretionary items and, in some cases, even household essentials. However, we also know, both from our recent performance and from guest surveys, that despite the pressures they are facing, our guests want to celebrate the holidays in person with loved ones, and they're looking for Target to provide them safety, ease, and joy as they prepare for every celebration. These themes played out in the third quarter as guests responded increasingly to promotions, even as they celebrated key seasonal moments like back-to-school, college, and Halloween.\n\nAmong our frequency categories, beauty continues to drive strong performance, delivering sales growth in the mid-teens. Skincare, haircare, and cosmetics all performed very well, and our Ulta Beauty at Target offerings nearly tripled their total sales volume when compared to this period a year ago. Food and beverage continues to outperform the market with low double-digit growth and strength across the portfolio, gaining both dollar and unit share every week throughout the quarter. Comparable sales in essentials categories grew in the low single digits, reflecting particular strength in pets and health.\n\nWhile already soft, sales trends in our discretionary categories softened even more in the last few weeks of the quarter, a trend that's persisted into the first few weeks of November. But importantly, despite this challenging environment, we still saw unit share gains in all five of our core merchandising categories in the quarter, a sign that when guests are looking for convenience and value on both wants and needs, they're increasingly turning to Target. Apparel comps were down only slightly in Q3, driven by growth in kids', men's, seasonal, and new fashion-forward assortments, offset by softness in swim, women's accessories, and basics. In home, sales declined in the mid single digits despite strong performance in seasonal areas.\n\nHardline sales were also down mid single digits, reflecting continued softness in home electronics and sporting goods. Additionally, we saw a meaningful deceleration in toys this quarter, most notably in October. This is a trend we will continue to monitor closely as we move throughout the holiday season. Across the portfolio, owned brands continue to outperform their national brand counterparts, growing at double the rate of the total enterprise in the third quarter.\n\nBecause of our unique industry-leading in-house design and sourcing capabilities, Target's exclusive owned brands provide tremendous quality at incredibly competitive prices, a great combination anytime, but never more so than in an inflationary environment. So, as we turn our focus to Q4, we'll do what we always do: work tirelessly to deliver value and solutions to our guests while also delivering affordable joy at a time when they need it most. As we've outlined this morning, we're taking a prudent approach to our inventory planning and sales expectations for the fourth quarter in light of the concerning industry trends we've seen over the past several weeks. But even with this cautious stance, we're focused on providing our guests with affordability and ease at every interaction with the Target brand.\n\nOne of the signature ways we plan to stand out this holiday season is through our focus on the combination of newness and value, which cut across all our core categories. Given that the gift-giving season is underway and our guests are turning to Target more and more for their food and beverage needs, it's an ideal time for our recently announced partnership with British retailer, Marks & Spencer, who's collaborated with us to offer a limited-time assortment of gourmet premium food and chocolates that's sure to be perfect gifting solution this holiday season. Despite recent trends in toys, we know they will play a critical role for our guests over the holiday season, and we have all the top toys and exclusives this year at incredible prices. Back by popular demand, our exclusive assortment from FAO Schwarz features more than 120 toys.\n\nAnd for all the Marvel fans out there, the first of its kind collaboration between Target and Disney will feature exclusive Black Panther merchandise and experiences, including the only at-Target Black Panther: Wakanda Forever War on the Water Lego set. And the power of these partnerships doesn't stop there. We've added nearly 50 Disney shop-in-shop experiences this year, bringing the total to well over 200 of these shops across the country. In partnership with Apple, we've more than tripled the number of shop-in-shops since last year, and our Target Circle members have access to free trials of some incredible Apple services, including a free four-month trial of Apple Fitness+.\n\nAnd with Ulta Beauty at Target, we'll have open another 250 locations this year and now have more than 350 locations open across the chain. Through all of our new tried and true and exclusive holiday offerings, we'll remain laser-focused on supporting our value proposition with key deals starting earlier than ever. Week-long Black Friday deals and our guests' favorite deal of the day offers are available now and feature our best planned prices for the season, with prices up to 50% off across toys and games, electronics, kitchen appliances, and more. Besides industry leading promotions, we are offering compelling, easy-to-shop everyday price points on key items, like $3 Christmas ornaments, $5 holiday Wondershop and candle assortments, and $10 gifting assortments across categories like beauty, apparel, and home.\n\nAnd to reinforce our commitment to value, we'll be offering free and easy payment and fulfillment options, including our recently launched reloadable RedCards, which provide all the benefits of our RedCard debit and credit programs, including free shipping and 5% off every purchase, all without the need for a credit check or an existing bank account. Combine this with our easy, convenient, and free same-day service options, like drive-up and order pickup, all with no membership fees and our free-to-join loyalty program, Target Circle, we have an unmatched combination of value-added and affordable shopping experiences to help our guests celebrate and amplify the joy of the holidays. Throughout the season, we will remain nimble and respond to changes in consumer, promotional, and macro trends, always in service of optimizing current and long-term performance. And despite the challenges facing our business and our guests, we have a not-so-secret weapon to help us provide joy and value for our guests, our world-class team.\n\nLike Brian, I want to pause and add my sincere gratitude for the Target team. No matter what is thrown your way, you execute with grace, compassion, and consistency, a combination that leads our guests to return to our stores and website time and time again. With that, I'll turn the call over to John.\n\nJohn Mulligan -- Executive Vice President, Chief Operating Officer\n\nThanks, Christina. Across the operations team, we focus every day on delivering strong execution even as we continue to keep our eyes on and invest in projects that will support Target's long-term profitable growth. As you know, throughout the year, our supply chain and transportation teams have been continuously navigating through an unpredictable environment, and these volatile conditions continued in the third quarter. The good news is that the lead times in global shipping have started to move in the right direction.\n\nMore specifically, compared with the second quarter, lead times improved by about 15% in Q3 and were more than three weeks shorter than a year ago. While we were really pleased to see this improvement, the acceleration was faster than we expected, causing many overseas orders to arrive earlier than needed. As a result, the team has been reducing lead times on our future orders just as they extended them during the pandemic. In addition, to prevent earlier rivals from entering our distribution and store network before they are needed, the team has implemented multiple strategies and tactics, including new processes to efficiently segment shipping containers as they arrive at domestic ports, allowing early arriving containers to age before sending them downstream into our regional distribution centers.\n\nSo, today, even as we continue to look heavy on the balance sheet, our inventory is in a much healthier position than earlier in the year because of the heaviness you're seeing today is due to the early arrival of fresh inventory we are planning to sell. For example, by early November of this year, nearly 90% of our key Q4 programs had already moved into our distribution centers and stores. In contrast, last year, just over half our key programs were in the network as of the same time frame. Similar to our experience with lead times, we saw improvement across multiple dimensions of our transportation costs in the quarter, even as those costs remain above pre-pandemic levels.\n\nContainer rates and global shipping have come down by about one-third in recent months, and we'll realize that benefit in 2023 as we renegotiate our staggered contracts with shipping partners. And importantly, we expect to see further reductions in those rates going forward as they remain about three times higher than we were paying in 2019. Similarly, domestic transportation rates have come down since the beginning of the year but remain higher than a year ago and double the rates we were facing in 2019. And, of course, fuel costs, which are a major driver of our domestic transportation expense, are still running more than double the amount we were paying in 2019 despite having moderated in recent months.\n\nNow, I'll turn to the work of our properties team, where we're still wrapping up some projects but close to completing our supply chain and store projects for the year. On the distribution side, we're continuing our work-to-build replenishment capacity across the country, given the amount of growth we've delivered over the last few years. The other big addition to our distribution infrastructure is the build-out of our sortation center strategy. A year ago, we were operating a single sort center here in the Minneapolis market, And this year we've opened five more, with several more on track to open in 2023.\n\nThese centers, which are typically a little bigger than a single store, increase our speed and meaningfully reduce our last-mile delivery costs in the markets where they operate. They also create back-room fulfillment capacity in the stores they serve, as they eliminate the need for each individual store to sort the boxes they've packed for delivery. On the store side, we are on track to complete about 200 full remodel projects this year, in which we update every part of the store to reflect our latest thinking and offer a modern and inspirational shopping experience for our guests. Beyond full remodels, we're also on track to complete about 200 fulfillment retrofits this year, in which we optimize their capacity and efficiency in supporting our same-day services.\n\nAnd finally, the team is on track to complete our new store program for 2022, in which we plan to add 23 new locations to the chain. The size of these new stores ranges widely from 19,000 to 145,000 square feet, as we continue to open the right sized store for the neighborhood we're serving. And as we've mentioned in recent calls, based on evolving conditions in the commercial real estate market, we've been finding more and more opportunities to open larger locations that can offer the full range of our assortment, along with a full suite of fulfillment options to serve our guests. In light of that opportunity, just over a week ago, we opened the first example of a new, larger store prototype in the Houston, Texas market.\n\nAt nearly 150,000 square feet, this new format incorporates our latest thinking in store design, featuring a more open layout, localized elements to inspire and serve our guests, five times more space to support our digital fulfillment services, and sustainable features in support of our Target forward goals. While we continue to open new stores of all sizes in the next few years, we plan to lean into this new layout when appropriate and incorporate its features into other projects, including remodels. Among the many innovations we've incorporated into this new location in Houston, we've added two new drive-up services. The first is the ability for a guest to order a beverage from Starbucks on their way to pick up their drive-up order.\n\nWe started testing this new service in the second quarter with a limited menu in a small number of stores, allowing us to collect feedback and fine tune operations before expanding it more broadly. Based on the success of that pilot, earlier this month, we rolled it out to more than 200 additional stores across the country, just in time for the holidays. The other emerging capability is the ability for a guest to return a purchase through our drive-up service. We began testing the service only a month ago with our team members in a small number of stores, consistent with our test and iterate approach.\n\nBased on the operational success of that initial test, in early November, we expanded the service to our guests in that same small set of stores, and we look to apply any learnings from that guest-facing test before rolling out the service more broadly next year. So, now, before I turn the call over to Michael, I want to pause and thank our teams across the country who have worked tirelessly to ensure we are staffed and ready to serve our guests during the upcoming holiday season, our busiest time of the year. Consistent with prior years, before determining our seasonal hiring goals, we focused first on providing opportunities to our existing team to support their desired hours and backup training interests. And today, based on all that hard work and preparation, I'm happy to report that we're entering the holiday season in a very healthy staffing position, reflecting our success in hiring throughout the year, the significant wage investments we've made throughout the country, an increase in the number of team members who are looking to pick up extra hours, and an 18% increase in applicants for seasonal positions compared with a year ago.\n\nAs Brian mentioned, it's in times like these that we feel most fortunate to have a durable business model which can sustain us through an ever more challenging economic and consumer backdrop and allow us to emerge with additional profitable growth and market share opportunities over time. That's why we're ensuring our teams are staying focused on our guests and taking the right actions to continue deepening our relationship with them. If we maintain that guest focus, I'm confident we'll find ourselves in an even stronger competitive position over time. With that, I'll turn the call over to Michael.\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nThanks, John. I want to start where John just ended and reiterate how closely we're listening to our guests, ensuring we understand how they're feeling and how that is affecting their shopping behavior and moving quickly to serve their rapidly changing needs. Obviously, if recent softening consumer trends continue through the fourth quarter, that will put some pressure on our near-term financial performance. But with a durable model and an agile team, we can navigate those challenges and emerge even stronger in the long term, while continuing to deepen our relationship with guests and build long-term preference for Target.\n\nOnce again this quarter, I'm going to begin my remarks by covering our inventory position, given that it continues to be an important area of focus. And like last quarter, I'm going to base my discussion on comparisons to 2019, given the highly volatile conditions that have affected inventory since the onset of the pandemic. As you saw on our balance sheet this morning, we owned $17.1 billion of inventory at the end of the third quarter, which is $5.7 billion higher than the end of Q3 2019. In percentage terms, this year's number represents an approximate 50% increase from three years ago, a deceleration from three-year growth of 68% as of the end of the second quarter.\n\nOf the dollar increase in our inventory since 2019, about two-thirds, or $3.9 billion, is aligned with our sales growth over that same three-year period. The remaining one-third, or about $1.8 billion, is new inventory that's arrived early relative to when it would have been received in pre-pandemic years. This early inventory is being driven by two related factors. The first is our explicit decision to add cushion to our lead times this year in order to mitigate the risk we're facing a year ago, when the bulk of our global shipments were arriving late.\n\nThe second factor is the unexpectedly rapid acceleration in the global supply chain that we saw in Q3, which caused us to receive shipments even earlier than scheduled. It's also important to note that the composition of our inventory continues to evolve, as we've leaned into frequency categories where we're seeing robust growth and take an increasingly cautious position in discretionary categories. More specifically, the percent of our inventory units in discretionary categories was 8 percentage points lower than at the end of Q2 and lower than in 2019 as well. With that context, I'll turn to our third quarter financial performance, beginning with the top line.\n\nTotal sales grew 3.3% in the third quarter, the same as in Q2, driven by a 2.7% increase in comparable sales combined with the benefit of new stores. Total revenue grew 3.4% in Q3, reflecting a 9.5% increase in other revenue, which was driven by the growth in our Roundel ad business. Traffic continues to be an important driver of our growth, having expanded 1.4% in Q3, on top of nearly 13% growth a year ago. In addition, this quarter, we benefited from a 1.3% increase in average ticket.\n\nAmong our sales channels, stores continue to drive our growth, as we saw a 3.2% increase in store comparable sales in Q3, on top of nearly 10% growth. A year ago, comparable sales in our digital channel grew 0.3% in the quarter, on top of nearly 30% last year. Same-day services led our digital growth, most notably through our drive-up service, which delivered high single-digit growth, on top of more than 80% growth last year. As Brian mentioned, while our overall Q3 comp increase was consistent with Q2, we saw a dramatic change in the pace and composition of our business toward the end of the third quarter.\n\nMore specifically, within the quarter, comparable sales grew 2.8% in August, rose to 4% in September, and decelerated to 0.9% in October. Also notable, even within the October period, there was a dramatic change in the pace of our sales. As you'll recall, the month began with an initial round of holiday promotions from Target and some of our competitors. And in that week, we saw a high single-digit increase in comp sales compared with last year.\n\nHowever, for the remainder of the month, we saw a low single-digit decline in comp sales over those last three weeks. Nearly all of the slowdown was driven by our discretionary categories, apparel, home, and hardlines, as our guests became increasingly cautious in their spending in those categories at both Target and throughout the industry more broadly. So far, in the month of November, trends have been largely consistent with what we were seeing at the end of October in terms of our comp trends, the mix of sales between frequency, and discretionary businesses and the focus on promotions by our guests. While our Q3 gross margin rate of 24.7% was more than 3 percentage points higher than in Q2, it came in far short of our expectations, driven by three factors.\n\nThe primary driver was a higher-than-expected markdown impact from promotions, as our guests became increasingly price sensitive and concentrated their discretionary spending on items on promotion, most notably in the latter weeks of the quarter. While we anticipated a highly promotional environment this fall, given the excess inventory we've been seeing across retail, this enhanced focus on promotions reflects an increasing level of stress on consumers, as they navigate through multiple headwinds, including persistent inflation and rapidly rising interest rates. A second factor that's impacting our gross margin is inventory shortage, or shrink, which is a growing problem facing all retailers. At Target, year to date, incremental shortage has already reduced our gross margin by more than $400 million versus last year, and we expect to reduce our gross margin by more than $600 million for the full year.\n\nAs Brian mentioned, this is an industrywide problem that is often driven by criminal networks, and we are collaborating with multiple stakeholders to find industrywide solutions. For example, because stolen goods are often sold online, Target strongly supports the passage of legislation to increase accountability and prevent criminals from selling stolen goods through online marketplaces. A third factor that affected our Q3 gross margin was the incremental cost of managing early inventory. In the near term, these pressures should begin to recede as we move through the fourth quarter and into next year as receipt flow naturally moderates following the holiday season, and we begin to benefit from the reduction in order lead times John mentioned earlier.\n\nAnd, finally, regarding gross margin, category mix moved from being a slight headwind in Q2 to a small tailwind in Q3, contributing about 20 basis points of gross margin benefit in the quarter. This change in mix impact might seem counterintuitive given some of the category trends I highlighted earlier. However, underneath the surface of discretionary comps, when compared to our second quarter results, comp sales in apparel, a high-margin discretionary category, got stronger in Q3; while comps in hardlines, a lower-margin discretionary category, saw a deceleration in the third quarter. Moving down to the SG&A expense line, we saw a small amount of deleverage in Q3 even as we continue to benefit from disciplined cost management across the organization.\n\nIn spite of that discipline, we're facing inflationary cost pressures across multiple expense lines in the P&L. Within compensation, expenses reflect ongoing investments in hourly team member pay and benefits, partially offset by a year-over-year rate benefit from lower-incentive compensation expense. Altogether, on the operating income line on both a dollar and rate basis, we saw a year-over-year decline of about 50% in the third quarter. I want to emphasize that we're not happy with this performance and expect to deliver much stronger dollar and rates performance over time.\n\nNow, I want to turn to capital deployment. And as always, I'll start by reiterating our priorities, which have been consistent for decades. We first look to fully invest in our business in projects that meet our strategic and financial criteria. Then, we look to support our dividend and build on our 50-year record of annual dividend increases.\n\nAnd, finally, we devote any excess cash beyond these first two uses to repurchase our shares over time within the limits of our middle A credit ratings. Beginning with our first priority, capital expenditures have come in at about $4.3 billion through the first three quarters of the year. And we're now expecting our full year capex will come in around $5.5 billion in light of continued inflationary pressures affecting the cost of this year's projects, we paid just under $500 million in dividends in the third quarter, up from $440 million a year ago, reflecting a 20% increase in the per-share dividend, partially offset by a decline in our average share count. And, finally, we didn't repurchase any shares in the third quarter, given current financial performance and the working capital investments we've made to support in-stocks and early receipts.\n\nIn the near term, we will continue to take a very cautious approach to share repurchase in light of the volatility in the environment and our commitment to maintaining our middle A credit ratings. So, now, I want to close my Q3 review with a discussion of our aftertax return on invested capital. For the trailing 12 months of the third quarter of this year, our aftertax ROIC was 14.6% compared with 31.3% a year ago. While this is a disappointing decline, a mid-teens aftertax return on capital is still very healthy in absolute terms and a testament to the durability of our business.\n\nImportantly, we expect to see a significant recovery from this number over time, as we move beyond the unusual headwinds that have been affecting our business this year. Now, let me turn briefly to our expectations for the fourth quarter. In the current environment, we're facing an even higher degree of uncertainty than a quarter ago, given the volatility we've been seeing recently. And in light of the dramatic changes in shopping patterns we've seen both at Target and across the industry, we believe it's prudent to plan for a wide range of comparable sales outcomes in the fourth quarter that centered around a low single-digit comp decline, consistent with recent trends.\n\nUnderlying the sales expectation, we're planning for softer discretionary category comps than we've seen the last two quarters, partially offset by the benefit of continued strong growth in our frequency businesses. If these sales trends persist, we'd see far less of a benefit from leverage on fixed expenses than we've seen so far this year. In addition, we'd expect greater markdown pressure from Q4 promotions, given the increase in price sensitivity our guests have shown recently and our commitment to end the year with a clean inventory position, especially in those categories where trends have softened. And as I mentioned, we're planning for additional pressure from inventory shrink, given the worsening trends that have emerged so far this year.\n\nAltogether, these expectations lead to a wide range for our expected Q4 operating margin rate centered around 3%. The single most sensitive input to this profit projection is the level of demand for our discretionary businesses. If that demand improves from recent trends, we would expect fewer markdowns and would likely outperform our updated profit expectations. While if demand softened further, profit could see additional pressure.\n\nAs we look beyond the holiday season, we're planning for a continued challenging environment as we move into next year. And as John and Brian have already pointed out, we are fortunate to have a durable model that is well positioned to continue serving our guests even in the toughest of times. In addition, we have a significant opportunity to harness efficiencies in support of our long-term growth and profit goals. At the end of 2019, our operations had been built to support a business that delivered $77 billion in sales that year.\n\nAnd our long-term algorithm at the time was anticipating low single-digit top-line growth in the years ahead. If things had played out that way, we might be looking at a total sales number in the low to mid $80 billion range this year. Instead, even in the midst of a very challenging environment, we're positioned to deliver total sales of well over $100 billion this year. So, today, we have a compelling opportunity to look across our operations with an eye to simplify and optimizing those operations for a more than $100 billion business.\n\nAnd today, as we look at the operations we have and where we think they can be, we believe there's a $2 billion to $3 billion savings opportunity over the next three years. To be clear, this isn't about slashing resources. And, in particular, we're focused on continuing to invest in our team, which is our most valuable asset. As Brian said, we are in the initial stages of scoping this opportunity, and we expect to share detail on our progress at our 2023 financial community meeting.\n\nIn the meantime, I want to join Brian in wishing all of you a happy holiday season. And I want to pause and thank the entire Target team for making Target a great place to work and a store that's ready to bring joy to millions of our guests throughout this season and beyond. With that, I'll turn the call back over to Brian.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nBefore we turn to your questions, I want to relay a few thoughts that I share with our Target team earlier today. While the circumstances we're facing are difficult and certainly not what anyone would wish for, we need to embrace the moment, focus on what we can control, and lean into our strengths. Because even as we face multiple challenges all at the same time, we have an even longer list of strengths on our side, and there are quite a few headwinds. But we've shown time and time again that our strengths can overcome any challenge we face, we have nearly 2000 well-located, well-maintained store locations.\n\nWe have a rapidly growing set of owned brands that are already generating more than $30 billion in annual sales. And we have a unique and growing list of national brand partners, including Starbucks, CVS Health, Levi's, Apple, Disney, and Ulta Beauty. Our unmatched product design, development, and sourcing capabilities allow us to offer an unbeatable combination of price, quality, design, and fashion throughout our owned brand portfolio. We have a durable operating model and a balanced portfolio of merchandise categories, which allow us to pivot quickly in a rapidly changing environment.\n\nOur operations are profitable, generate robust cash flow, and are backed by a strong balance sheet that enables continued investment during lean times. And, of course, we have a unique, amazing, passionate team that's only grown stronger over the last few years. So, this morning I've asked our team to focus on what they do best, moving with agility and responding to the environment in real time, delivering outstanding execution throughout the holiday season and beyond, and doing it all as one team, aligned in support of our guests and each other. While we'd all prefer to be operating in a more robust environment, today, we have the opportunity and all the resources we need to continue playing offense while many others cannot.\n\nBy harnessing the strength of our assets and our amazing team, I'm confident we'll continue to grow guest engagement and deliver compelling growth on both the top and bottom line over time. With that, we can move to Q&A. Now, Christina, John, Michael, and I will be happy to take your questions.\n\nOperator\n\n[Operator instructions] Our first question is from Chris Horvers with JPMorgan. You may go ahead.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks, and good morning. Can you talk about how your -- so, two questions. So, my first question is, can you talk about how you're looking at your business from a planning perspective and how far the down low single-digit quota day-to-day trend is relative to your internal plan? Said another way, we knew that holiday was pulled forward last year, given early sort of panic buying. As you think about the past month, is the three-year trend also deteriorating? And do you think that, perhaps, the election exacerbated the trend? It seems like you're planning on a one-year basis on a three-year basis, given comparison season to the balance of the quarter.\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nHey, Chris. This is Michael. I can take that one. We did see deceleration in the three-year CAGR in the back part of October as well.\n\nAnd so, we're factoring that into our extrapolating trend going forward. And you've heard me say, I think, other times on this call, Q4 is always its own animal. And so, extrapolating trends into Q4 is tricky business in a normal year. But we think it's important to focus on the consumer changes that we saw in October and plan the business prudently and cautiously against those trends.\n\nIt gives us the best position to be able to tell the consumer where we're at and continue to drive that unit share performance that we were pleased to see in the third quarter.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nChris, did you have a second question?\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nYeah, The second question is really your views about structural margins and how it's changing. You did a 6% operating margin in '19, and you've just added 30 billion in sales. You did a 7% in '20 and 8% in '21. I guess, what's changing? How do you think about the puts and takes? There's more inflation, it seems like, on the SG&A side.\n\nAnd, yes, in the near term there's more inventory, moving costs, and promotion. But I guess how do you think about the long term, especially in light of the $2 billion to $3 billion cost target?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nYes, Chris. I'll take that one too. We're definitely not operating at a profit level we expect to over time. And the one-time impacts we've seen this year from the volatility and the change in trend has led us to more markdowns and salvage action on inventory than we've seen historically by a wide margin.\n\nAnd so, we would expect to get a lot of that margin and that improved markdown performance back. And so, that's the factor I'll start with first. And the second thing I'd call out is what you heard us describe in terms of the efficiency opportunities we have in the business. To your exact point, we've generated incredible scale quickly.\n\nThat opens up a lot of opportunities for us to rethink process, technology, and create efficiencies throughout the business by taking that scale. That came on us quickly, stepping back and optimizing the business against that scale. So, we're excited about the efficiencies that should come with the growth that we've seen over time.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thanks very much.\n\nOperator\n\nThank you. The next question is from Michael Lasser with UBS. You may go ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. Obviously, Target's performance this year has been volatile. And, Michael, you just mentioned that you do believe you can get the margin that you lost this year to transition your inventory back.\n\nBut now, you're also saying that you need to cut $2 billion to $3 billion in cost to support your profitability over the next few years, which, in a way, undermines the idea that you can get the margin back that you lost. So, can you size in aggregate how much you think is recapturable? Is it $2 billion to $3 billion and you add another $2 billion to $3 billion on that? You're playing with a pool of savings that's really $46 billion over the next couple of years. So, A, is that right? And then, I have a follow-up question.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nMichael, thanks for joining us today. And I actually -- we just spent a lot more time at our investor conference talking about the efficiency initiative. But it might be helpful for us to share a couple of examples of the work that we think is in front of us. And I might ask John to start first and talk about some of the learning we've seen from a performance standpoint and have Christina talk about some opportunities that we're already looking at from a merchandising standpoint.\n\nJohn Mulligan -- Executive Vice President, Chief Operating Officer\n\nYeah, Michael. I think this is -- I think Michael Fiddelke characterized it well. This is what we always do. We've always done this.\n\nAnd when we look back at fulfillment, this is something we've done year after year. And I remember back in 2017, taking lots of questions about \"Will you guys have enough capacity in your stores to do all this fulfillment?\" And taking that question in 2018 and 2019, and here we are with a digital business that's 20% of our business now. And 95%, 96% of our fulfillment is done in-stores. And so when you look at what we've done there, it is essentially what Michael's talking about, continually going back, looking at the process, modifying the process, reinventing the process, investing some capital in some cases to support things like drive-up or extra pack stations, and consistently, over that time, increasing our unit productivity as it relates to fulfillment in double digits every year since then.\n\nAnd that's created capacity for us to continue to drive our digital business and improve our economic performance in the digital business along the way. And so, when we step back and look at all the scale we've gained, just like that scale we gained in the digital business that allowed us to continually improve fulfillment, we've gained all this scale now in our existing business, the broader business. And that allows us to take a step back, look at what we've been kind of doing the last couple of years to meet our guest demand as we grew quickly and say there's a lot of places for us to go back, reinvent process, add additional technology, and improve the way we deliver for our guests.\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nAnd I would add on a similar note, we think that there is opportunity to do that same step-back on how we create, make, buy, move, and sell our apparel business. If you think about the exceptional growth that we've had in our business across the board, but certainly in a big category like apparel, and the volatility we've seen in import transportation lead times and, you know, ups and downs in the market, for us to take a step back and say, is there process flow, technology, planning decisions, sourcing decisions, and opportunities to flow inventory with more efficiency, is at the heart of this exercise. We actually have started it a while ago, and we'll really be able to accelerate the investment in that process work and reimagine the opportunity around our apparel flow.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nMichael, I want to make sure we're really clear. We see significant opportunities over the next three years to find cost savings in the neighborhood of $2 billion to $3 billion as we improve processes and simplify our operations. At the same time, we'll continue to be focused on growth and taking market share and meeting our gaps that continue to enhance our business' position. So, it's not an either/or.\n\nIt's an and. We'll continue to be focused on being a growth company, continue to build market share, driving traffic to our stores and visits to our site, and become a much more efficient organization that leverages the scale we've gained over the last three years.\n\nMichael Lasser -- UBS -- Analyst\n\nThat's super helpful. Let me just clarify that and ask one follow-up question. Is the $2 billion to $3 billion on top of what you will get from recouping the inventory write-down, the cancellation fees that you paid to cancel orders this year? Or is that -- the $2 billion to $3 billion inclusive of that recapture opportunity? My second question is, you need to make price investments in the business to improve the perception among customers during this difficult economic time. That is taking more -- it's going to stage discussion now that your big competitor talked about a good start to its fourth quarter.\n\nSo, there's discussion around whether Target might be losing share to a competitor that's perceived to be more value-oriented. Thank you so much.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nMichael, there are a couple of questions there. One, we see the savings as being incremental to our operating plan. Two, we do expect the holiday season is going to be very promotional. We're seeing that as we move into the month of November.\n\nBut as we've mentioned many times, one of the things that really stands out in our quarter is our ability to continue to hold and gain unit market share across all five of our merchandising categories. So, we're continuing to build share. We're going to continue to see traffic driving our business. And we think it's going to be a promotional holiday season.\n\nAnd we're prepared to compete with the environment.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you so much, and good luck. Have a good holiday.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question is from Ed Yruma with Piper Sandler. You may go ahead.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nHey, good morning, guys. Thanks for taking the question. I guess, first, you called out shrink a number of times. And I know it's been a persistent issue, but it seems like it's intensifying.\n\nIs this something you think you can remediate kind of, you know, tactically your process? Or is this kind of endemic of other structural issues, namely maybe the location of some of your newer stores and jurisdictions where maybe shrink is just more endemic? And then, as a bigger-picture question, you know, as you look at '23, with the consumer being volatile, how quickly can you bend the merchandise offering to focus more on those entry price point or those value-seeking items that the consumer is demanding today? Thank you.\n\nJohn Mulligan -- Executive Vice President, Chief Operating Officer\n\nHey, Ed. This is John. I'll take the shrink question. I think, first, I'd say it started probably in some localized geographies originally, but we see those circles expanding and expanding and the impact continuing to grow.\n\nI think from a solutions perspective, we see two things. One, this is a nationwide problem that we need to address nationwide with other retailers. And this is primarily driven by organized crime. And so, there is a role for us to work as a retail group with law enforcement, with the government to help find solutions.\n\nMore specific to Target, there are things that we can do from a remediation standpoint. We have put those in place in a number of stores, and we see the impact of that. It's obviously not something we like to do. It's far less convenient for guests as they shop our stores, but we think we can manage that from a service perspective.\n\nAnd you can see us continue to do that as we see stores that are more impacted. We'll continue to provide additional remediation factors. The biggest focus for us is keeping our team and our guests safe. And so, we start there.\n\nAnd so, that drives a lot of our behavior, and that's the goal. And then the third thing is to prevent theft. But we really start in a place where it is about keeping our team and our guests safe as they're in our stores.\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nAnd on your second question, Ed, on value and price perception and our offering, I would tell you that we've had a concerted effort to make sure that we demonstrate the balanced value across our assortment for a long period of time. In fact, last quarter, I called it a maniacal focus on opening price points because we need to make sure that we appeal to the range of consumers that shop Target. And as I said in my prepared remarks, some of that's going to be opening price point value options that we can engineer into, especially in our strong owned brand offering. But some of that is actually larger sizes, where people are seeking value through the per-unit equation that comes with bigger pack sizes.\n\nSo, we are absolutely focused on it. It comes through in everyday price, it comes through in our owned brand assortment, it comes through in our promotions, and it comes through our accessibility with our great RedCard, our free loyalty programs, and the solutions in aggregate. And that's part of the Target equation. It's all also relevant with the assortment that's fresh, seasonal, and on trend.\n\nIt doesn't matter what your priced at if the assortment is relevant, and that's why we need to always stay Target.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is from Scott Mushkin with R5 Capital. You may go ahead.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nYeah. Hey, guys. Thanks for taking my questions. So, you know, you guys got into some good detail about the cost savings you have planned.\n\nI was wondering, is there any thought that, you know, 2023, we may have an extension of the challenges and, you know, thinking about capex, thinking about labor hours, and how you might how you might attack that if 2023, you know, is -- the Fed is successful here and, you know, engineers a recession?\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nScott, as you might imagine, right now, we are laser-focused on the holiday season and making sure we end 2022 in a position where we continue to hold and grow share and meet the needs of our guests. For the very early stages of looking at 2023, we'll be back after the 1st of the year with more details about our overall plans, including capex spending and our outlook for the overall consumer environment. So, give us a few weeks. We'll be back to you after the 1st of the year.\n\nBut, obviously, we're going to spend a lot of time right now focused on executing our plan, getting through the holiday season, and then assessing the consumer and the overall retail landscape as we look to 2023.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nSo, then another extension of a question, will want to get a second view on this. You know, imitation is the best form of flattery. And one of the competitors, especially in apparel and home, has been copying you guys pretty readily and partnering with other brands. I mean, how much do you think that could impact your sales or maybe is impacting your sales in those categories? Or do you think, you know, it's really not a factor?\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nScott, that's why we spend so much time looking at unit market share performance. And as we continue to perform well across our entire portfolio, we feel like we've got the right mix, great national brand partners to strengthen our own brands. We have a fabulous in-store experience and the ease and simplicity of our digital channels. So, we think we're well positioned to continue to hold and grow share across our entire portfolio, not just in the holiday season but for years to come.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nOK. Thank you very much. Appreciate it.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nThank you, Scott.\n\nOperator\n\nThank you. The next question is from Rob Ohmes with Bank of America. You may go ahead.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey. Thanks for taking my question. Maybe for Christina and maybe, Brian, chime in here. I know it's early, but with the kind of shift in trends you're seeing, is there any more you can tell us maybe about the income demographic dissecting of your guests? Has there been any, you know, changes in patterns among that? You know, so, for example, Walmart obviously called out yesterday that they're seeing more of these $100,000-plus people, you know, trading into Walmart.\n\nIs there anything that you can tell us about your lower-income guests versus your middle- or higher-income that helps us understand what's going on?\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nYeah. You know, our first point about how we're performing is obviously the strength of our traffic, as well as our market share gains. And those are broad and across all of our categories. As we look at the guests and where the growth is coming from, it's coming from a deepening engagement with our current guests.\n\nAnd so, they are coming more often and they are spending across more categories. And there are couple inflection points in behavior with the Target guests that are really meaningful. One is when they become an omni-channel guest. The second is how much they use our fulfillment capabilities.\n\nAnd the third is the amount that they buy food and beverage. And all those three are growing at a faster rate than total Target. That gives us confidence that, going forward, we'll continue to deepen the engagement with the guests that are most meaningful for our long-term business.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nAnd then just maybe a quick follow-up. Anything on the digital side -- any new initiatives you guys would be thinking about, you know, maybe doing more with marketplace or things to get your digital growth a little higher again?\n\nJohn Mulligan -- Executive Vice President, Chief Operating Officer\n\nWell, I think there's a couple of things there. One, the digital team is doing a great job in there. To Brian's point, right now, they're very focused on delivering a great Q4 for our guests. I think a couple of things we are excited about is, first, bringing -- and these are the top two requests from our guests, always being led by our guests as it relates to what we're going to provide from a digital perspective.\n\nNumber one is adding Starbucks to drive-up. And we have seen that in the test stores. Very, very popular. This has been a request for a long time from guests, \"I'm getting milk, I'm getting diapers, why can't I get my latte to go as well?\" I think the second one under the heading of continuing to create ease, and this is also a request from our guests, is being able to do returns to drive-up.\n\nThat one's a little bit further behind Starbucks. We're testing that in a small number of stores. It just went guest-facing recently. And so, we'll continue to test that through the fourth quarter here and look to hopefully expand that next year.\n\nBut I think the examples there are more important than what we're doing. That is the guests leading us to what they want us to provide from a digital perspective, whether that be on the site or in how we fulfill their services.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. The next question is from Simeon Gutman with Morgan Stanley. You may go ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey, good morning, everyone. I wanted to ask on the sales backdrop for a minute. You took a lot of markdowns, and some inventory was released to the market. Walmart had the same, and they've been discounting.\n\nWhy couldn't this environment just be, you know, off price, having a lot of inventory, and the market is just stuffed and that could be part of this weakness, and it's going to take some time for that to clear, as opposed to the consumer really weakening in fundamentals. I just wanted to throw it out there.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nI mean, I'll go back to some of the syndicated data that we've been looking at. And clearly, across all of retail, we saw a change in shopping behavior in the back half of October leading into November. The most recent information we've seen from NPD would indicate during the first week of November, general merchandise categories contracted by 14%. So, a very significant change in shopping behavior.\n\nSo, I think, as Christina has pointed out a number of times, we've had a consumer who has been dealing with very stubborn inflation for quarter after quarter now. They're certainly starting to look at higher prices in food and beverage. In many cases, prices are up double digits. They're shopping very carefully on a budget.\n\nAnd I think they're looking at discretionary categories and saying, \"All right, if I'm going to buy, I'm looking for a great deal and great value.\" So, what we've seen overall is a change in consumer behavior over the last few weeks. We're going to watch it carefully throughout the holiday season. But I think it is a byproduct of a consumer who has been facing higher costs throughout the year, is working with their budget, shopping very carefully, looking for value, and recognize they've got to start with core staples before they spend dollars in discretionary categories.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nYep, that makes sense. My follow up is the 2 billion to 3 billion. It sounds like it's process-oriented. But some of the things you mentioned in terms of flowing inventory, it seems like that will require capex.\n\nAnd again, I don't want to put words in your mouth. But to be able to drive these efficiencies, is it pure process or does capex need to step up to make investments in order to realize the savings?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nYeah, it's a fair question, Simeon. And sometimes, it involves capex, and we're happy to invest that capex when the return is there. And so, if we can put capital into the business that can drive efficiency for the team, I think -- you've seen that seen us do that with technology in stores and supply chain. So, that's a path we've been on, and we certainly aren't shy about making that investment when the return is there.\n\nBut it will require capital. There's a lot of process reengineering and optimization that we can do that shouldn't have a capital price tag associated with it. And again, back to the examples John and Christina provided, so much of that is about the scale we've gained. You know, there's a path of simplifying and taking costs out of a business when you don't have growth.\n\nWe've got a fortunate position to be looking at the business on the heels of just exceptional growth. And that creates a lot of opportunity for us to rebuild process against a business that's substantially bigger than it was a few years ago.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGreat. Thank you. Good luck.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nOperator, We've got one last question today.\n\nOperator\n\nThank you. Our last question comes from Kate McShane with Goldman Sachs. You may go ahead.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nHi. Thanks for taking our question. We just wanted to ask a couple of follow-up questions on the inventory position. Just if there was any inventory left over from the issues that you experienced in the spring.\n\nAnd now that it sounds like maybe Q4 is going to be a little bit weaker, but I think the inventories you probably bought was for more of a low single-digit comp scenario, is the goal to be clean with regard to holiday inventory coming out of Q4 into 2023?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nI will answer that with you in this question, Kate. And that is we are committed to being clean at the end of the holiday season. And you're also right in the first part of your question. We accomplished what we want to do in the first half of the year.\n\nWe feel good about that work. And you heard me quote some versus 2019 benchmarks. If you were to just look versus last year, you'll see that, you know, Q2, our inventory was up 36% year on year. In Q3, it's about 14%.\n\nAnd so, we made good progress on the plans we had in place. Obviously, we're looking at the change in the trend closely. And if that trend we see persists, it will come with more markdowns to make sure we accomplish exactly that goal of ending the season clean.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nOperator, that concludes our third quarter call. We wish everyone a safe and happy holiday season, and look forward to seeing you in person in 2023. So, thank you.\n\nDuration: 0 minutes\n\nJohn Hulbert -- Vice President, Investor Relations\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nJohn Mulligan -- Executive Vice President, Chief Operating Officer\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nEd Yruma -- Piper Sandler -- Analyst\n\nScott Mushkin -- R5 Capital -- Analyst\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nKate McShane -- Goldman Sachs -- Analyst\n\nMore TGT analysis\n\nAll earnings call transcripts"
}