{
  "companyName": "Bioceres Crop Solutions Corp.",
  "companyTicker": "BIOX",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/bioceres-crop-solutions-corp-biox-q4-2022-earnings/",
  "content": "Bioceres Crop Solutions Corp. (BIOX -1.31%)\nQ4 2022 Earnings Call\nSep 08, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, and welcome to the Bioceres Crop Solutions fiscal fourth quarter 2020 financial results conference call. My name is Alex, and I'll be coordinating the call today. [Operator instructions] I will now hand over to your host, head of investor relations, Paula Savanti. Paula, please go ahead.\n\nPaula Savanti -- Head of Corporate Finance and Strategic Research\n\nThank you. Good morning, everyone, and thank you for joining. Presenting today during the call will be Federico Trucco, our chief executive officer; and Enrique Lopez Lecube, our chief financial officer. Both will be available for the Q&A session.\n\nBefore we proceed, I would like to make the following safe harbor statements. Today's call will contain forward-looking statements, and I refer you to the forward-looking statements section of today's earnings release and presentation as well as our recent filings with the SEC. We assume no obligation to update or revise any forward-looking statements to reflect new or changed circumstances. Also, please note that for comparison purposes and a better understanding of our company's underlying performance, we will discuss during our presentation as-reported results as well as comparable results, which excludes the impact of hyperinflationary accounting in Argentina.\n\nAdditional information in connection with the application of the rule IAS 29 can be found in our earnings report. Finally, this conference call is being webcast. The webcast link is available at the Bioceres Crop Solutions Investor Relations website. At this time, I will turn the call over to our CEO, Federico Trucco.\n\nThank you.\n\nFederico Trucco -- Chief Executive Officer\n\nThank you, Paula, and good morning to everyone on the call. Thank you for joining us today. Please turn to Slide 3 for a quick overview of the main highlights for the quarter and the fiscal year. I would like to start by saying that we are extremely proud of the performance delivered by our teams in the fourth quarter and full fiscal year 2022.\n\nThis last quarter was particularly challenging since we are comparing to a record-setting quarter in 2021 while we grew at close to 40% compared to the fourth quarter of fiscal 2020. Consequently, the 44% top-line growth observed in the current quarter represents an amazing closing to an amazing year with an end of 62% revenue growth for the 12-month period. Adjusted EBITDA for the year ended at $61.9 million after excluding HB4 ramp-up costs. Although this number represents a 24% improvement over last year's metric, it fails to capture the full magnitude of our EBITDA expansion as IAS 29 accounting rules artificially magnified some of our costs.\n\nThis will be explained in more detail by Enrique during his part of the presentation. Fiscal 2020 was not only an amazing year due to our financial performance but also in terms of achieving gatekeeping regulatory clearances, most importantly, feed and food approvals for HB4 Wheat in Brazil and for HB4 Soy in China. These approvals placid us in a very select club of companies. We are, for the first time, reporting revenues associated to the HB4 technology with $12.4 million recognized in the quarter for HB4 Wheat, representing a 94% increase when compared to contributed goods reported for the HB4 program in the year-ago period.\n\nFinally, and as an important subsequent event to the quarter's end, we have successfully culminated our merger with Marrone Bio Innovations and have integrated and suit the company in less than four months since announcing the transaction. Like the recent integration back in 2016, we believe this merger will be transformational for us. I will provide a brief update on the integration process later in the presentation. Please turn to Slide 4 to better understand the growth acceleration that we're currently experiencing.\n\nAnd for this purpose, we're going back to 2019 when we became listed. Top line revenue growth has accelerated in the past fiscal year with a growth rate at 62%. That is more than four times the average of the last two years. Similarly, our adjusted EBITDA growth has more than doubled the average growth of the last two years and more than tripled that of last year.\n\nEnrique will explain the drivers behind the current performance, but I would like to highlight that what we are seeing today is the outcome of decisions that we took many years back. only modestly reflecting initial for sales and not accounting in any form for the growth we expect from our recent merger and international expansion. Likewise, on Slide 5, you can see the evolution of HB4 revenues or contributed goods since we launched the HB4 program. The HB4 program was designed to parallel-track product development in terms of geographic targeting and performance validation for prelaunch varieties with the inventory ramp-up process.\n\nFiscal 2022 revenues and contributed goods represent a 74% increase over the year before period with an overall gross margin expansion of 900 basis points. You can see that almost all the growth experienced in fiscal '22 was achieved in the currently reported quarter with HB4 Wheat, which is discussed in more detail in Slide 6. Wheat revenues were generated with the HB4 program kept at a steady state slightly over 50,000 hectares and with initial sales to conventional channel participants such as multipliers and distributors, something we can only do now after being granted registration for the first five materials. Growing conditions are very challenging now in Argentina with many regions being affected by long-standing non-lapping routes.\n\nAlthough it is too early to tell, HB4 varieties are favorably withstanding the current stress, and we look forward to report on the revolution in upcoming calls. To minimize disruption in the commercial chain, we continue to build our downstream channel for HB4 Wheat as shown in Slide 7. In the past quarter, we doubled the number of processors onboarded now reaching a total of 25, and we are currently working with 23 new processors to be onboarded in the next few quarters. Total processing capacity stands at over 1 million tonnes, a number that far exceeds HB4 grain current or near-term availability.\n\nWe are also working to take advantage of existing import approvals and have recently finalized our first final export of HB4 flower to Brazil. To leverage on the identity reserve capabilities developed for the HB4 program and expand our relationships with downstream players, we have planted the first 300 hectares of good wheat materials. These are wheat varieties genetically edited to meet consumer demands, such as increased dietary fiber or reduced gluten content. Although these materials are targeted yet been improved to perform competitively, something that is currently ongoing, the produced grain will allow us and our partners to jointly develop consumer interest in anticipation for our future technology launch.\n\nTurning now to Slide 8. We have finished harvesting last season's HB4 Soy crop and are moving forward to launch two of the varieties with selected multipliers and distributors in the upcoming season. We have also redesigned the HB4 program to allow growers to test a larger set of materials within their production regions, and this will allow us to accelerate variety validation evaluation and geographic positioning. We intend to have more materials available for launch in upcoming seasons.\n\nWe are also making good progress in Brazil, where we are advancing two varieties under the HB4 program approach to be ready for launch in the '23, '24 season. Based on our ongoing conversations, we also expect our leading licensees to be able to launch their first materials during the '23, '24 season, and this is both for Argentina and probably, a lesser extent, to Brazil. Slide 9. provides an overview of the progress we are -- sorry, Slide 9 provides an overview of the progress we made during the last fiscal year in terms of regulatory clearances.\n\nWe are pleased to see the evolution of approvals for HB4 Wheat since the initial green line in Argentina back in 2021. The approval in Brazil was particularly important since this was a prerequisite to be able to get variety registered in Argentina and, consequently, revenues booked. We intend to seize the current regulatory momentum in wheat and continue to submit applications in important import geographies such as those of Southeast Asia. We have already filed in Indonesia, for instance, and we are looking forward to file in the upcoming months in Thailand, Vietnam, and the Philippines.\n\nThe approval of HB4 Soy in China carries a similar implication for us to that of wheat in Brazil as we now can register varieties that enable conventional sales in Argentina. Also, China's approval was a triggering event for our licensees, which are now free to launch in their respective geographies. We expect to be able to recognize HB4 Soy revenues in the upcoming season. Right after the quarter's end and less than four months since the announcement, we have successfully merged with and delisted Marrone Bio Innovations.\n\nThis update of the integration process can be found on Slide 10. We have rebranded the company under the ProFarm name and promoted the founder, Matti Tiainen, a founder of the subsidiary, as our President and Managing Director for these business units. The ProFarm business unit will manage the portfolio and pipeline of legacy Marrone globally and have channel responsibilities in North America and Europe. Similarly, Rizobacter will remain our defacto commercial channel in South America and other rest of the world geographies.\n\nOn the cost synergies front, we are already at 60% of the $8 million target we set for ourselves and expect to be able to fully achieve this goal in the upcoming months. Finally, I would like to thank former CEO, Kevin Helash, and the interim board for their contribution to this successful integration process. I would also like to welcome Yogesh Mago and Keith McGovern, as continuing board members as well as Cassie Hilder and Agustin Biagioni, who have taken key EVP roles for the integration process and future operations of the company. Enrique, the floor's yours.\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nThank you, Federico, and good morning to everyone joining us today. Before I dive into what has been an exceptional year from both an operational and a financial perspective, I want to remind you that I will focus my comments on comparable revenues and comparable growth profit. As you know, our reported results are affected by the adoption of IAS 29 in our Argentine subsidiaries. Given the current local macroeconomic conditions in Argentina, IAS 29 this year has resulted in revenues and costs that are overestimated for our local subsidiaries and, therefore, margins that are underestimated.\n\nWe show you the differences in the release and on the slides, but I'll speak today to more relevant comparable metrics. If you would refer to Slide 11, fourth quarter comparable revenue growth of 44% topped off an exceptional year, in which all quarters delivered strong growth. Full-year comparable revenues were recorded at almost $320 million, a 62% year-on-year gain, as Federico pointed out. Importantly, these metrics do not include pro forma numbers, which will begin to be consolidated in the first quarter of fiscal 2022.If I summed up both the quarter and the year, I would point to accelerated adoption of some of our main technologies.\n\nWe increased volumes of micro-beaded fertilizers by 64% for the full year. We expanded inoculant sales in an important target region in Brazil, and we also reported HB4 Wheat revenues for the first time, which represented more than half of the seed and integrated products revenues in the fourth quarter standing at $12.4 million. We also benefited from our proactive steps to reorganize commercial operations for third-party product sales. Throughout the year, we had some tailwinds that favor the adoption of our technologies, but we also faced disruptions in global logistics and some temporary cost pressure.\n\nOverall, we were able to successfully weather the challenges of the year and leverage the commercial -- the strength of our commercial teams to capture value in an ever-changing global environment for agriculture. Slide 12 illustrates the breadth of our strength across all of our reporting segments. Crop Protection benefited from the reorganization of third-party product sales, as I mentioned, as well as from higher prices, which were driven by disruptions in global supply chains. CP sales represented almost half of overall sales in both the quarter and the full year.\n\nIncreased adoption of our micro-beaded fertilizers and inoculants drove 45% growth in the quarter and 77% growth for the year in the Crop Nutrition segment. During a volatile time in the global fertilizer market, we nearly doubled sales of micro-beaded fertilizers, adding 200 new clients and experiencing doubling of past purchases by existing customers. Additionally, in Brazil, we saw a particularly strong inoculant sale. Brazil has been a targeted expansion region for our LLI or long light inoculant technology because of the competitive advantage it offers growers in that country.\n\nWhile a smaller contributor from a dollar perspective, the addition of revenues from for wheat was the most exciting development for the quarter and the year in the seed and integrated products segment. We delivered first-time revenues of $12.4 million, topping our prior estimate of $10 million to $12 million in initial revenues. This creates a strong base from which to continue to grow this breakthrough seed offering. Clearly, our exceptional revenue growth in 2022, we have set a new high watermark for the company and elevated the base from which we will grow.\n\nWhile this year's tremendous space will be very difficult to replicate, we do see a path forward with continued growth in line with our historical from current annual growth rates. We now have the tools and the portfolio in place, which will allow us to consistently deliver revenue growth at multiples far above the industry average. In the near term, we are broadening our biologicals portfolio with the addition of ProFarm Group expanding the global adoption of our products to our extensive and growing network of partners and capitalizing on our investments in HB4 technology. Let me now take a moment to look at comparable gross profit and gross margins more closely, as shown for the fourth quarter on Slide 13.\n\nThe Total gross profit rose by 32% to $41.4 million. seed and integrated products increased by 270% from the sales of HB4 Wheat, while the relatively smaller gains in Crop Nutrition were mostly offset by the decline in Crop Protection gross profit. The resulting gross margin was 366 basis point decline, reflecting product mix and higher cost of goods sold. Since the effect of IAS 29 is cumulative throughout the year, it becomes particularly relevant in the fourth quarter.\n\nWhile IAS 29 application expanded revenues above the comparable figure, it had the opposite effect on gross profit, constricting the reported metric by almost $5 million versus the comparable gross profit and therefore reducing margins to 34.5% on the reported metrics. As shown on Slide 14, each reporting segment contributed to the 45% increase in full-year gross profit of $136.9 million. From a gross margin perspective, the same factors that impacted margins in the fourth quarter were evident throughout the fiscal year. As a result, margins were in the low 40% range rather than the high 40% range reported for our last fiscal year.\n\nAt this point, we expect our annual target for blended gross margin to be in the mid-40% range, and we are well within reach. Going forward, we anticipate that the addition of pro forma and HB4 sales will boost our margin profile and will help offset the margin headwind we experienced with manufacturing costs at our Argentine facility. While the first half of the year has been challenging for ProFarm due to persistent drought conditions around the world, particularly in the United States, we are looking forward to including their revenues in the second half of the year where they sell their seed and soil treatment, which is typically the stronger half of the year. Please turn now to Slide 15.\n\nAdjusted EBITDA in the fourth quarter, excluding HB4 freelance costs, was $17.7 million, 2% higher when compared with $17.4 million in the same quarter in 2021. This number excludes $3.2 million in costs associated with the prelaunch ramp-up of inventories for the HB4 program as we continue to target revenues well above what was reported in the current quarter and the fiscal year. Adjusted EBITDA growth was lower than top-end growth, given changes in the segment mix, the gross margin dynamics I just mentioned and macro dynamics in Argentina that created transitory cost pressure in our local subsidiaries. Consistent with our past practice, we do not use comparable figures in reporting adjusted EBITDA.\n\nHowever, we have isolated the impact of IAS 29 adjustment in this graph to illustrate this effect to a tune of $4.4 million for the quarter. On Slide 16, we highlight the 24% increase in full-year adjusted EBITDA, excluding, once again, gross profit gains drove the improvement to $61.9 million, with operational expenses offsetting some of that pain. Importantly, out of the almost $30 million increase in operating expenses, only two-thirds of this are costs associated with operational growth. The remaining increase is explained by HB4 program operating costs and IAS 29 adjustments.\n\nOperational growth was driven by higher valuable SG&A in line with our sales growth as well as higher logistic costs as we took cautionary measures to ensure continued supply of our products. as well as the temporary cost pressures in Argentina I already mentioned. The overall effect of IAS 29 accounting is very relevant when looking at full-year results. where it reduces gains in adjusted EBITDA by a nontrivial amount of $18.5 million.\n\nLet me take a few moments to close with a review of our balance sheet and cash position. If you will turn to Slide 18. As you know, we have proactively replaced more expensive sources of capital with newly issued debt instruments throughout the year. Additionally, we have lowered our total financial debt position over the course of the fiscal year, giving conversion of 75% of the 2019 convertible notes into common stock.\n\nBy fiscal year end, our net financial debt stood at $127.3 million, and our net debt to LTM adjusted EBITDA ratio stood at 2.47 turns. As CFO, I'd like to be somewhat below this range, although we'll see some uptick in the first two quarters as we report debt associated with the ProFarm acquisition. In relation to the ProFarm acquisition, we have executed subsequent to quarter closed two financing agreements and new secured convertible notes due in 2026 that provided us with $55 million in cash and the rollover of the remaining part of the 2019 convertible notes into a new note with no convertibility feature into common stock. As a high-growth company, I believe we are in a good position with the appropriate mix of short-term debt and working capital, further backed by a meaningful liquidity position as our cash, cash equivalents and short-term investments stood at $38 million by year end prior to incorporating the $55 million proceeds from the new convertible note and debt from ProFarm.\n\nIn summary, 2022 has been a watershed year for BCS. The revenue growth and profitability from our base business, plus the investments we have made for future growth will be catalysts for success in line with our historical CAGR. We have greatly enhanced the diversity of our revenue sources, broadened our market reach and acquired a new stream of exciting R&D projects with ProFarm. We are in a solid financial position and have the flexibility to invest in capital projects and other commercial and manufacturing improvements.\n\nEveryone on the team has done a remarkable job of setting the stage and putting in place the resources that will transform Bioceres in the coming years. With that, let me turn the call back to Federico.\n\nFederico Trucco -- Chief Executive Officer\n\nThank you. Enrique, I think we can open up the floor now for Q&A. Operator?\n\nOperator\n\n[Operator instructions] Our first question for today comes from Ben Klieve of Lake Street Capital Markets.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nCongratulations on the end of a really successful year here. First, I have a couple of questions on the launch of HB4 Soy. And Federico, in particular, a comment you made in your prepared remarks about the licensing model. Can you elaborate a bit more on, first of all, kind of the degree to which HB4 Soy both in Argentina and Brazil is expected to be kind of a straight licensing model versus an EcoSeed concept? And then second of all, can you characterize kind of who these licensing partners are? If you can't name names, if you can kind of give a broad characterization of who these folks are.\n\nFederico Trucco -- Chief Executive Officer\n\nSure. So thanks, Ben, for joining the call. It's always great to hear you. In terms of HB4, so this is the one crop where we probably have a greater gap in terms of genetics.\n\nFor those of you that do not know, in wheat we are partnered with the leader for LatAm genetics, which is floating on the brain. In soy, this is more of a stand-alone effort. So to be able to counteract that to some extent, we have licensed the technology to leading participants. And there are two that are publicly disclosed or that we have disclosed in the past, such as Don Mario, which is the No.\n\n1 market share player in Latin America and TMG that is a Brazil grain company that is important for that country. So these two licensees that have outstanding genetics we'll be able to launch in the upcoming -- not so much in the upcoming season but in '23, 24 with the material safety in developing. And the China approval was key to be able to enable this particular channel. We continue to pursue the EcoSeed concept within the HB4 program and with sales through our own network.\n\nAnd that is what you're likely to see in the upcoming season, bringing the lion's share of the revenues with two varieties that now can be commercialized outside of the program structure using the more conventional approach. These two varieties have been positioned in areas of Argentina that together represents slightly less than 1.5 million hectares. So obviously, we're not indicating that that's sort of the acreage we're likely to achieve, but it is meaningful enough for us to be able to do what we need to do this year so that we can be on track for the guidance we provided after the Chinese approval.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nGot it. Got it. That's all very helpful. Another HB4-related question, Enrique, maybe more for you.\n\nI'm curious, you very helpfully break down kind of the costs associated with the HB4 ramp historically. I'm wondering what your expectations are for really fiscal '23 in terms of costs associated with the ramp versus EBITDA contributions in a commercial launch. I mean to what extent do you think those kind of prelaunch costs are going to offset the profitability from the commercial launch of both wheat and soy?\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nBen, thanks for joining the call and for the question. So I think there's a divergence between the type of revenue ramp-up that you can expect from HB4 and profitability reported, profitability coming from HB4 and the run rate of the prelaunch costs that you see reported in SG&A. I mean those are more associated to our identity research channel and what we do with generation HB4 as a program where we were jointly with farmers where, as Federico pointed out, revenues and profitability from HP will be coming from different sources, not only just that. So I think that we are currently at the run rate of what can be expected for that.\n\nAnd as we continue to multiply variety and expand and the research channel, you might see that following that acreage rather than the total reported revenues and profitability for HB4. So in essence, I don't think that those are going to offset However, bear in mind that we are ramping up the program. We are still ramping up the variety. So as Enrique pointed out, this is only the beginning for HB4.\n\nAnd I think that we will continue to see those costs to show up in the next fiscal year.\n\nFederico Trucco -- Chief Executive Officer\n\nLet me add something to that. Ben, for you to keep in mind, I think the HB4 program will be kept almost at a steady state. Except mainly in soy, where we might increase it slightly in we today, we're at 50,000 hectares, for instance. So we're not expecting to increase that significantly.\n\nAnd this is what we use in a way to attract the variety validation, the free marketing component and the inventory ramp-up process. So the more varieties we get that we can channel directly to farmers, either within the EcoSeed concept or as we can see, if you will, through conventional distribution, the more those revenues will dilute the -- sort of the ramp-up cost associated to the program. So I think they will become less significant or proportionately less significantly on a forward-going basis.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nGot it. OK. That's all very helpful. A point more to talk about it.\n\nI'll just ask one more and then get back in queue. And it's a question kind of on a high level around the outlook on the fertilizer side. I mean this business has just been exceptional now for a long time. And Enrique, you commented on capacity expansion broadly.\n\nI'm wondering how you're looking at addressing kind of long-term growth from the micro-beaded fertilizer products specifically and kind of when you think you're going to have to make a decision about potentially making a real material capacity expansion from that product line specifically.\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nThat's a great question, Ben. And I mean it's a nice challenge that we faced throughout the year because we reached almost half of our capacity ahead of what we expected. So we have already been working on an expansion project for our facility in Latin America that is already on its way. So there will be some capex going into that to support further growth in that facility that supplies the Latin American market.\n\nI don't think that it's going to be of the size and materiality of the initial investment with us. But you can certainly expect that we will be investing in expanding that capacity to continue growing revenues from micro fertilizers.\n\nOperator\n\nOur next question comes from Kemp Dolliver from Brookline Capital Markets.\n\nKemp Dolliver -- Brookline Capital Markets -- Analyst\n\nFirst question relates to the performance of the various HB4 Soy varieties. And can you just talk a little bit about what you've learned with regard to cause and effect with regard to the performance of the different varieties and how you are thinking about future development of the soy varieties?\n\nFederico Trucco -- Chief Executive Officer\n\nSure. So thanks, Kemp, for joining. It's a pleasure to have you here. I think that the key here is to understand that for us to be able to select the right materials, we need to farther up with farmers to identify where these materials work and when they need to be planted and if that is done concurrently with the inventory ramp-up that we can have anticipated launches.\n\nWe do it in the conventional way where lots is done with the trialing within the crop development teams. And then we take the varieties to farmers. It takes longer. So that is in a way what brings about some of the bumpiness, if you will, in our ability to move forward with these materials.\n\nNow the good news is that we have two materials that we've been testing over the last two seasons, particularly one that's been tested, I think, for more than two seasons, which is 40 to 20 where we now feel fairly comfortable about performance and its ability to win over commercial checks in a particular region of the province that accounts for a little less than 1 million hectares. And when we talk about leading with conventional checks, we're not talking about HB4 performance. I mean we're not talking about how the gene works in the different backgrounds. We're talking about the competitiveness of the hardware in which we're incorporating that software, which, as I indicated before, it's being developed by us and not coming from a market leader like Florimond Desprez in the case of wheat.\n\nSo that is what's leading the challenge. We're improving every year. Obviously, we're not going at the same pace we are going with wheat, but we do have the possibility of using licensees to, in a way, narrow that gap, which is what I recently discussed. The performance issues, one that is [Inaudible] related that has to do with the genetics of the materials we are using, and it's not in a way related to the performance of the team, which has been well validated not only by us but also by our technology partners.\n\nKemp Dolliver -- Brookline Capital Markets -- Analyst\n\nOK. That's good. So I mean, obviously, there's trial and error involved in this process. And based on your last -- your closing comment, it sounds like you've identified, say, the commonality within these -- within the traits that are influencing the performance of the ones that are -- that you've identified as say, loss versus win? Is that pretty fair? Or is there still some just you would need to do additional research to really understand the differences in performance?\n\nFederico Trucco -- Chief Executive Officer\n\nLook, this is kind of gathering farmer information to be able to justify a launch and making sure that the launch it's not erratic and we're launching a video that meet the standards that are required for the technology I think that what we are doing here today is probably open kimono in many ways. This is not something a company will normally disclose. They don't tell you how they get to the variety [Inaudible] they launch. We want to do this in a different way because we think it sort of saves time even though this is also showing when we fail, and not only where we win.\n\nNow if we win in 8 out of 10 situations, that's impressive. That's probably something that you will not see in a standard variety, and that's the type of quality material that we would like to launch within the program. The one thing we have changed to be able to improve upon what we've been doing is to allow farmers to test a broader set of materials. So in the past, we would only give one variety for each farmer and we would have a win and loss for that particular field.\n\nNow we are giving three to four varieties for each farmer, keeping hectares at the same level. We don't want to increase hectares necessarily to keep costs under control, but we want to improve the quality of the data for the targeting launch validation process. And that I believe will significantly accelerate our ability to bring new varieties to the conventional channel like we are going today with 42 20 or 50 21.\n\nKemp Dolliver -- Brookline Capital Markets -- Analyst\n\nThat's great. And my last question or at least topic, it relates to the Australian, New Zealand market. And I think also this ties into some context with Ukraine. And recently, there have been some reports that Australian farmers are increasing their plans to export wheat, as I'm sure others are, to try to offset the loss of the Ukrainian capacity.\n\nSo number one, how are you thinking about advancing process -- your business in Australia? And then also, just hypothetically, if Ukraine stabilizes and becomes a significant grower again, is that market ever an opportunity? Or is there just -- or do they just serve the anti-GMO part of the world that would not accept these products?\n\nFederico Trucco -- Chief Executive Officer\n\nSo that's a great question. I think, first, on Australia and New Zealand, we have not included an update here, but we announced a few months back our intent to acquire with genetics business in country that is currently owned by [Inaudible] Genetics was in part the breeding program that was run by [Inaudible] in the past. And that is a process that's still ongoing and we expect to be able to close before the year's end. This is something we're doing via our JV with [Inaudible] Genetics.\n\nSo that will give us a footprint in Australia and an initial set of materials on which we can deploy the HB4 technology. We have already sent materials that are going through the quarantine process to advance the trialing in country and be able to get the production clearance. We do have feed and food clearance today. We need the planting or cultivation clearance to be able to launch in Australia season.\n\nSo that is a very meaningful market. I can say that it's probably twice the opportunity that we're currently pursuing in Latin America. And in terms of the Ukraine and other geographies, I believe that the more we make HB4 Wheat sort of status quo, if you will, the more likely these geographies that have historically rejected GMOs will accept the technology. And I can point to a sort of an interesting observation, which is what happened in Brazil.\n\nThere was a post-approval survey in Brazil that show that close to 70% of consumers have no concerns on GMO wheat. And that observation helped change the position of key groups that historically rejected transgenics in the crop. I mean with this, we're not saying that the job is done, but I think it's far from being done, but we are much closer today to being able to deploy these technologies in geographies where before we thought that would be very challenging, Ukraine being one of them. Who knows? Maybe one day, we will have GMO in France.\n\nI think that can be today more realistic than what it was a year ago. But that's what -- I don't know, Enrique, if you have any comments on this.\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nI think just to complement on what Federico said, I mean it's evident that with the Ukraine situation, Food security has become a concern for everyone, and it seems to be a consensus technology and in particular, GMO is a meaningful part of the reply or answer that humanity needs to provide to that full security. So I think that has been also a qualitative tailwind for us throughout the year in obtaining regulatory approvals and gaining exposure to processors. You can see that we've added 30 new processors. And as with many things, concerns fade away when there's a threat of not having something that is important for you.\n\nOperator\n\nOur next question comes from Dmitry Silversteyn from Water Tower Research.\n\nDmitry Silversteyn -- Water Tower Research -- Analyst\n\nI was wondering, you posted a very strong revenue growth number, obviously, and a lot of it has to do with the launch of the HB4. But if you have to look at price, and I think you mentioned that pricing was a little bit of a tailwind in foreign exchange translation. What role did price and FX play in your revenue growth in the quarter?\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nDmitry, this is Enrique. Pleasure to have you on the call for the first time, and thanks for your question. So I would have to say that FX plays no role whatsoever in increasing our revenues, our comparable revenues, as I mentioned. Bear in mind that this company operates mainly in hard currency.\n\nSo either dollars or euros with the exception of Brazil that is a market that operates in local currency. So there's practically no tailwinds from FX whatsoever. There is some tailwinds coming from prices, mainly in the CP segment. So Crop Protection products did see some increase in prices coming from the disruption in the supply chain.\n\nSo raw materials that go into CP coming from China or India, into the U.S., Brazil, Argentina, Paraguay, Uruguay, the main ag-producing countries, was a threat throughout the year, and that allows for price increases, which at the end of the day helped us in that particular segment. Now more important than that, to me, is the fact that this highlights a competitive advantage from biologicals, which we have significantly invested in with the ProFarm acquisition. Biologicals have manufactured in country. You don't need to get raw materials from the other side of the world to be able to supply farmers with inputs.\n\nSo that was a tailwind in CP. In the rest, I would say that it was not a major tailwind prices. It was more related to us expanding the business and having much greater adoption of our main technologies. I would say that probably micro-beaded fertilizers were the star product for the year in that regard.\n\nDmitry Silversteyn -- Water Tower Research -- Analyst\n\nGot it. Got it. If I can follow up on the Crop Protection question on Crop Protection area. Your gross margin there is what I would consider to be a little bit below what kind of the industry averages, if you will, which I think is north of 40%.\n\nClearly, it's going to improve as you integrate ProFarm. But can you talk about sort of what the drivers of the margin is? First of all, are you looking to expand margins in this business in the short term? And secondly, what would be the major drivers of that?\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nThat's a very good question. Bear in mind that in Crop Protection, we have some sales to [Inaudible] from third-party product sales. So this is not strategic product category for us but rather something tactical. In some countries like Brazil, Paraguay and Argentina, we collect from retailers by getting products in return.\n\nAnd also, we have become the partner of choice for some other companies that want to commercialize in Latin America [Inaudible] products to us as a commercial partner. So those two categories of products that are more tactical in nature have lower margins, have lower working capital requirements and are kind of like low-hanging fruit for us. Now those products are probably delivering gross margins that range between 25% to 35%. And that's what, at the end of the day, drives down the overall segment margin, which I believe -- I mean, that segment should have a normal run rate, a margin that is closer to 40%.\n\nWhen you compare that to other CP companies, bear in mind that [Inaudible] CP companies are selling products with their own brands and don't have as much of [Inaudible] as we have on this type of more tactical product categories. I think that this will remain to be the lower margin business segment within all of the segments until we start seeing Marrone, I should say, ProFarm products becoming reported there that have gross margins are closer to 60%.\n\nDmitry Silversteyn -- Water Tower Research -- Analyst\n\nGotcha. That's very helpful. And yes, I totally get the third-party distribution margins would be lower. We've seen that in other companies that have participated and particularly in the Latin America market.\n\nYou mentioned some planned cost issues with Argentina plant impacting your quarter a little bit in terms of margins. What's the situation there now? And can we look for the cost manufacturing facility to stabilize as we get into 2023?\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nThat's also a great question. Thanks for asking. So first, I will say that, today, Argentina continues to be an important manufacturing hub for us. So even though we commercialize globally many of our products, those are material in manufacturing in Argentina.\n\nWe are expanding our manufacturing capacity in Brazil to diversify product sources. But for this particular fiscal year 2022 period, Argentina continues to play an important supplying role. Two things I would say, Dmitry, it is important to us and what we track is the evolution of the local inflation versus the depreciation of local currency against the U.S. dollar.\n\nSo if inflation outpaces depreciation of the local currency, that means that we will begin to see cost pressure out of local currency-denominated costs being inflated when measured in U.S. dollars. That applies as much to cost of goods sold as it applies to SG&A functions that are located in country. Throughout the year, I would say that probably in the fourth quarter, we saw these two macro variables, local inflation and depreciation of local currency converging.\n\nThat is what we were expecting. But for the previous 15 to 16 months, inflation versus depreciation of local currency. So there's an accumulation -- there's a cumulative effect that has yet not been fully corrected. So I would say is that the bleeding has been stopped in the fourth quarter.\n\nAnd what we expect is that at some point, these two variables need to converge. It has been always the case and when you look at the last four decades in Argentina. And when that happens, the business will get back to the normal run rate and what I was saying about gross margins being in the mid-20% range. I cannot tell you when that would happen.\n\nI would only point out that there's upcoming elections in Argentina in 2023, and that has proven to be a catalyst many times for macro variables to fall back in place.\n\nDmitry Silversteyn -- Water Tower Research -- Analyst\n\nUnderstood. That was very helpful. And then final question before I get in the queue. The Latin American planting season is well underway now.\n\nCan you provide any color as to how that's going, what you're seeing that may be different from what you saw in 2022, '23 season? And just give us any color that you can on what the current planting season in Latin America looks like for you specifically.\n\nFederico Trucco -- Chief Executive Officer\n\nSo this is Federico. Great to have you, Dmitry, in the call. In terms of Latin America, as I indicated, we are facing significant drought, particularly for winter crops in Argentina. So this is an evolving situation, but grains are required promptly.\n\nSo it's, in a way, a double-edged component for us because it does showcase HB4 technology and allows us to make the technology more visible to farmers. But on the other hand, it does have a consequence in terms of farmers' income and ability to incorporate new technologies in the future because of their ability to invest if they have a weak crop at the end of the winter. So I think we're waiting for rains. This is in part important in Argentina.\n\nIn Brazil, we have to close because we still have a weak business there of relevance. And I don't know, Enrique, if you want to add anything to the Latin American part.\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nYes, I would only point out, Dmitry, the fact that planting is probably the one decision that the farmer always wants to make and less nature really imposes restrictions and they end up not being able to plant. So you will see that for the product categories of our portfolio that are designed to us planting, we tend to see a high resilience in revenues even though there might be drought windows. It does not work the same way for CP products, for example. So what I would say is that probably, we did have a good planting season for winter crops in Argentina that mostly shows up in our Q4 results.\n\nWhat we are probably looking with a little bit more focus now are how rains will evolve in light of the upcoming some of the costs. Some usually takes place by the end of Q1, beginning of Q2 of our fiscal year in Latin America.\n\nOperator\n\n[Operator instructions] Our next question comes from Brian Wright of ROTH Capital\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nWould the -- I was hoping to get an update on ProFarm, just maybe are you in a position to provide an update on kind of what their 2Q results kind of look like?\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nBrian, this is Enrique. Thanks for joining the call, and pleasure to be talking to you. So as I mentioned, Q4 of our fiscal year, so March through June was a drought quarter in the U.S. in particular.\n\nAnd in California, even more so. As you know, about half of the revenue stream from ProFarm is coming from cash crop sales in California, where half is coming from road crops in the U.S. and Europe. So what I would say is that for ProFarm has been a tough quarter.\n\nWe do expect and we are here to see how the second half of the calendar year, we will evolve for them coming out of that. So I would expect Q4 and full fiscal year of ProFarm revenues to be here flat or slightly below the number that they reported in the previous fiscal year of them, so 2021. I mean, to us, obviously, I think that it is more important, the benefit that we will be gaining from diversifying revenue sources, which I mentioned. Sometimes California, for example, might be an offsetting factor as it was in March through June.\n\nAnd hopefully, sometimes you will help us sort of like offset other revenue threats like the ones that we have in Latin America with drought for some of the crops potentially. So that's all I can say. As of now, we will be probably giving a little bit more color on ProFarm's numbers in the upcoming earnings call, where we will be consolidating the results for the first time.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nGreat. Great. Just also on -- just from a bigger picture, given the drought conditions in Argentina right now, given just broad weather conditions across the globe, isn't that conducive for the next selling season as far as HB4? Or am I --\n\nFederico Trucco -- Chief Executive Officer\n\nNo. Look -- Brian, this is Federico. Great to have you on the call. But I think, obviously, the current situation with drought becoming not only notorious here in Latin America, but also in Asia, the situation in China is quite dramatic.\n\nIn Europe, as we've seen coming out of the summer, yields have been hit by significant drought and high-temperature conditions. The California situation that we are witnessing for [Inaudible] crops. So all of this is creating sort of a need for the next generation of biotechnology solutions. So if you look at sort of what the industry delivered until now, which was mostly Crop Protection-focused, I think that what we are seeing today also in light of climate change creates a perfect scenario for the type of solutions we are bringing to market.\n\nNow that also there has been kind of our central solution in terms of seed rate, but also the biological package that comes along with ProFarm we saw last year, where we can improve crop health and soil health and improve the bionutrition so that we are less demanding or less dependent on chemical nutrients, if you will, for crop management. So I think this is obviously favorable for us. You see these reflected in the regulatory clearances and the speed at which we're obtaining approvals in geographies that have been challenging in the past. And so I think your observation is well based.\n\nOperator\n\nWe have no further questions for today. So I will hand it back to Federico Trucco for any closing remarks.\n\nFederico Trucco -- Chief Executive Officer\n\nOK. So thanks, everyone, again, for joining. As I said at the beginning, this has been a terrific year, one that we are very proud of. So I want to congratulate the more than 700 people today that work in the broader Bioceres Crop Solutions organization for their hard work and invite them to keep on doing what they are doing so that we can continue to deliver the type of performance we are showing here today.\n\nI hope you have a terrific rest of the week and look forward to interact and do follow-ups with those that are interested in learning more about our company and our technologies. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaula Savanti -- Head of Corporate Finance and Strategic Research\n\nFederico Trucco -- Chief Executive Officer\n\nEnrique Lopez Lecube -- Chief Financial Officer\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nKemp Dolliver -- Brookline Capital Markets -- Analyst\n\nDmitry Silversteyn -- Water Tower Research -- Analyst\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nMore BIOX analysis\n\nAll earnings call transcripts"
}