{
  "companyName": "LINDBLAD EXPEDITIONS HLDGS INC",
  "companyTicker": "LIND",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/lindblad-expeditions-hldgs-inc-lind-q3-2022-earnin/",
  "content": "LINDBLAD EXPEDITIONS HLDGS INC (LIND 4.91%)\nQ3 2022 Earnings Call\nNov 02, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, and welcome to today's Lindblad Expeditions Holdings, Inc. third quarter 2022 financial results call. My name is Bailey, and I'll be your moderator for today's call. [Operator instructions] I would now like to pass the conference over to Craig Felenstein, chief financial officer.\n\nSir, please go ahead.\n\nCraig Felenstein -- Chief Financial Officer\n\nThank you, Billy. Good morning, everyone, and thank you for joining us for Lindblad's 2022 third quarter earnings call. With me on the call today is Dolf Berle, Lindblad's chief executive officer. Dolf will begin with some opening comments, and then I will follow with some details on our financial results and liquidity before we open the call for Q&A.\n\nBefore we get started, let me remind everyone that the company's comments today may include forward-looking statements. Those expectations are subject to risks and uncertainties that may cause actual results and performance to be materially different from these expectations. The company cannot guarantee the accuracy of any forecast or estimates, and we undertake no obligation to update any such forward-looking statements. If you would like more information on the risks involved in forward-looking statements, please see the company's SEC filings.\n\nIn addition, our comments may reference non-GAAP financial measures. A reconciliation of the most directly comparable GAAP financial measures and other associated disclosures are contained in the company's earnings release. And with that out of the way, let me turn the call over to Dolf.\n\nDolf Berle -- Chief Executive Officer\n\nThanks, Craig. Good morning, and thank you all for joining us on the call today. The third quarter was an extremely rewarding one for Lindblad Expeditions on multiple fronts, highlighted by strong financial results, diligent operational execution, and further progress across a variety of strategic initiatives. The entire team has been extremely focused on continuing to deliver amazing guest experiences, attracting a broader audience of guests across our platform, returning the company to profitability, building the combination of talent, systems, and operating capabilities, which will support future growth and ensuring the acquisitions we made last year are performing well.\n\nI'm excited about all that we accomplished and grateful for the efforts by our team and our partners across the globe who have gone above and beyond to make this progress happen.On our Q2 earnings call, we foreshadowed that we anticipated returning to profitability on the EBITDA front in Q3. Not only did we do just that, but the $18.6 million in EBITDA Lindblad generated exceeded the expectations we had for Q3 only a few months earlier. Craig will be sharing greater details on the factors behind this performance. But in broad strokes, they included higher occupancy levels driven by strong summer seasons across Alaska, the Galapagos, and the Arctic, significant demand across our land-based businesses, focusing on our marketing approach across the company and efforts of our entire team to maintain efficiencies while delivering extraordinary guest experiences.\n\nOne of the operational highlights from this past quarter was the citing of perhaps the largest number of NAR walls we have ever encountered in our 50-plus-year heritage up in the Northwest passage. This citing delighted our guests and was made possible by the advanced ICE capabilities of our newest chips, the National Geographic Endurance and the National Geographic Resolution, who made their inaugural voyages into this beautiful part of our planet. Experiences such as these are a reminder to our guests and our team of how exhilarating and how memorable voyages with Lindblad Expeditions continue to be. As we executed operationally this past quarter, we were also able to capitalize on certain changes in marketplace dynamics.\n\nChief among these were an evolution in the restrictions around COVID, which certainly raised the comfort and confidence levels toward travel on the part of our guests. The relaxation of the COVID test rate, including most notably the listing of the requirement to test before returning to the U.S. removed significant concerns for travelers. At the same time, over the course of the quarter, in close consultation with medical experts, we also made adjustments to our company policies and protocols fleetwide.\n\nWe have now removed all pre-departure testing across our fleet, are only testing guests as necessary during each voyage, and the requirement to wear masks has been lifted. The safety of our crew and guests remains a top priority, and we will continue to evaluate and amend our protocols as necessary. Overall, the combination of relaxed protocols, broader immunization levels, and a reduction in the severity of the most recent COVID variants have created a positive shift in the psyche of our guests. A manifestation of this shift is the tremendous zeal we are noting on the part of our guests to return to voyaging.\n\nThere is great enthusiasm for seeing the world's natural wonders, learning from our naturalist and guides, and sharing this experience with traveling companions. We are not only seeing this excitement onboard our fleet every day, but we are also seeing this enthusiasm with regards to demand for future travel. Part of this is certainly pent-up demand that built up over the last wo and a half years. But prior to the pandemic, there was a growing population of travelers who are interested to experience adventure travel, and that trend appears to be picking back up again.\n\nWe are not only seeing strong bookings from our loyal returning guests, but also from a whole new cohort of first-timers who are looking for immersive and authentic travel experiences. During the third quarter, we saw a 71% increase in gross bookings for in-year travel and a 31% increase in teen. Overall, we remain very well-positioned for the year ahead with bookings for 2023, 23% ahead of where bookings were for 2020 at the same point in 2019 prior to the pandemic. There are a variety of steps we are taking to further accelerate our marketing and booking capabilities.\n\nAnd let me touch upon three. First, we are at a stage in our digital transformation where we can see real traction with our omnichannel marketing approach, refinement in our search engine marketing, a focusing of our messaging on the differentiators behind the Lindblad brand, and a blending in of our traditionally wider audience of qualified guests. Second, we have invested in additional sales and marketing leadership under our new chief commercial officer, Noah Brodsky, by adding experienced talent in both the global head of sales and also brand and communication goals. Third, in our guest contact center, we have added highly experienced leadership and increased the number of guest-facing frontline experts.\n\nThis has greatly improved the impact of our messaging around these life-changing trips for our guests and greatly reduced any friction guests have in booking their voyages. While optimism is the prevailing sentiment, it is important to know that there are still challenges we are addressing in this business environment. Despite the strong results in Q3, the financial performance would have been even better had it not been for the impact of the Russia-Ukraine conflict on 8 voyages, including our Northeast passage itineraries and the cancellation of five Japan voyages on the National Geographic Resolution. The good news is the majority of the guests that were impacted have rescheduled for future voyages, and we don't foresee any restrictions on currently scheduled geographies moving ahead.\n\nAnother item that impacted the quarter, along with parts of 2023 is an increase in guest cancellations. While gross bookings continue to far exceed cancellations every week, we are seeing cancellations run higher than pre-pandemic levels, with the most often noted reasons related to the logistics and cost of air travel and some lingering COVID concerns. The majority of these cancellations are not looking for refunds but are pushing their voyages to later dates, which speaks to the robust and sustainable demand for expedition travel. We also continue to manage through higher fuel costs and supply chain headwinds, fuel costs, while still high, have begun to abate a bit, and we are minimizing the supply chain impact by working closely with suppliers and sourcing even more locally when advantageous.\n\nLet me now turn to the latest additions to the company, starting with the newest ship in our fleet, the National Geographic Islander 2. This all-suite ship launched in the Galapagos during August, and the initial response has been nothing short of outstanding. The 48-passenger ship has been persusly renovated to deliver our signature immersive experience in this amazing geography. She features diverse exploration tools and amenities, along with indoor, outdoor dining options and comfortable and stylish public places to view the incredible wildlife and landscape under the watchful eye of our highly experienced staff and crew, many of whom have been with the company for many years.\n\nWe're also seeing strong momentum across our expanded platform of land companies. As many of you know, last year, we broadened and deepened our platform of adventure and experiential travel opportunities with the acquisitions of Cycling Company, Dubin Cycling, and Adventure off the beaten path, which focuses primarily on the U.S. national parks and Classic Journeys, a leader in walking tours across the world. Following the blueprint we used to drive the growth of Natural Habitat, our intention is to build these companies aggressively, leveraging the cross-selling opportunities and the scale and support that resides in our large carter company.\n\nThat growth has already started as all of these companies, including Natural Habitat, have been able to capitalize on the significant demand coming out of the pandemic. They are ideally situated to attract travelers who want to get out and explore, given their focus on unique experiences with small groups of travelers in remote locations. We have already significantly surpassed the contributions from our land business back in 2019, and we have just begun to scratch the surface of what these combined entities can do together. By way of summary, we are very optimistic about the future for Lindblad Expeditions.\n\nAlthough challenging and, at times, painful, the pandemic months were at time when we focused on building the capability of the company from a marketing systems and operational standpoint. A number of these investments have been technical, such as our investment in a new website and our marketing technology stack. But just as importantly, we have invested in building the leadership capabilities in the company. While there is still some uncertainty ahead, we know we are well prepared and highly practiced in our ability to keep guests and our crew safe and deliver remarkable guest experiences.\n\nWe're energized by the momentum we are generating across all facets of the company, and we're excited by the opportunity to build upon this success to drive additional earnings growth in the months and years ahead. And now I will turn the call over to Craig.\n\nCraig Felenstein -- Chief Financial Officer\n\nThanks, Dolf. Lindblad's strong return to positive adjusted EBITDA in the third quarter demonstrates the resiliency of the company over the last few years and the opportunity moving forward, given the growing audience for high-quality adventure travel. This financial milestone would not have been possible without the sustained hard work and dedication of our teams across our fleet and offices. And I would like to once again thank them for their extraordinary efforts.\n\nThroughout the pandemic, we were consistently focused on emerging as a strong and vibrant company, well-positioned with a strong balance sheet to ramp operations quickly and with a robust platform to deliver sustained long-term growth, and we have done just that. The strategic steps we have taken over the last several years to expand our fleet capacity and diversify our product offerings are delivering strong financial results today while significantly increasing our earnings potential from pre-pandemic levels. At the same time, the financial diligence we have employed should allow us to weather any short-term uncertainties as we further ramp operations to fully capitalize on this expanded potential. Looking at the third quarter of 2022, we have just begun to scratch the surface of this opportunity.\n\nTotal company revenue of $144.8 million increased $80.3 million versus the same quarter a year ago and was $43.8 million or 43% higher than Q3 2019 due in large part to our expanded fleet and additional land-focused offerings. At the Lindblad segment, revenue of $83.7 million increased $50.6 million year on year and $7.2 million or 9% versus the third quarter of 2019, primarily due to the ramp in operations, which included additional available guest nights from new capacity and higher pricing across the fleet. Occupancy in the quarter was 81%. And while guest counts are not yet back to 2019 levels, you can see the revenue opportunity we have across the expanded fleet as we grow occupancy levels and increase yields.\n\nThe current quarter also included $61 million of revenue with the Land Experiences segment, an increase of $29.6 million year on year and $36.6 million from 2019. The current quarter results were led by the ramp in operations across our land companies, including natural habitat trips to Alaska, Galapagos, and Iceland, off-the-beaten-path trips to U.S. national parks, DuVine bike tours in Italy and France, and classic journey trips in Europe and Latin America. Turning to adjusted EBITDA.\n\nThe strong revenue growth across the company drove adjusted EBITDA of $18.6 million during the third quarter, an increase of $25.2 million versus the third quarter a year ago. The significant return to positive results demonstrates the strong operating leverage inherent in our business model as we continue to ramp occupancy levels and maintain high price points. Looking at the cost side of the business, operating expenses before depreciation and amortization, interest and taxes increased $55.1 million or 71% versus the third quarter a year ago, led by a $42 million increase in cost of tours versus the same period a year ago, primarily related to the ramp and ship expeditions, which included higher fuel costs as well as from expenses related to operating additional land-based trips. Fuel was 6.2% of revenue this quarter as compared to 3.7% of revenue in the third quarter of 2021, reflecting higher fuel prices and an increase in the number of ships in operation.\n\nSales and marketing costs increased $5.8 million versus the third quarter a year ago, primarily due to higher commissions related to the increase in revenue and from increased search and direct mail marketing to drive future bookings. G&A spending increased $7.3 million, excluding stock-based compensation and one-time items versus the third quarter a year ago, primarily due to higher personnel costs as we ramp operations and increased credit card commissions related to final payments for upcoming itineraries and higher deposits on new reservations for future travel. Total company net loss available to stockholders in the quarter of $9.8 million or $0.18 per diluted share improved dramatically versus a net loss available to common stockholders of $25.7 million or $0.50 per diluted share reported in the third quarter a year ago. The $15.6 million improvement reflects the ramp in operations, partially offset by $2.3 million of additional interest expense net associated with higher rates and increased borrowings, mostly related to the delivery of the National FTraclusion in September 2021 and our debt refining in February 2022.\n\nThe current quarter also includes a $1.5 million increase in depreciation versus the same quarter a year ago, related primarily to the launch of the resolution. And lastly, the third quarter a year ago included $4.4 million of other income primarily related to the utilization of the searched. Turning to the balance sheet. We remain well-positioned to continue to ramp operations and weather any additional short-term uncertainties.\n\nWe ended the third quarter with $116 million in unrestricted cash and $30 million in restricted cash, primarily related to deposits on voyages that originate in the United States as well as credit card reserves. The $146 million of total cash decreased $30 million versus the end of the second quarter, primarily due to principal and interest payments of $21.7 million, including the semiannual interest payment on our senior notes and capex spending of $6.1 million, which included renovations on the National Geographic IL2 ahead of our August launch as well as spending on our digital initiatives. Cash used in operations was $2.4 million, reflecting the significant guest payments for upcoming voyages and deposits for future travel, offset by the costs associated with operating ship and land itineraries and marketing spend to drive future bookings. Q3 is traditionally a cash usage quarter, given the guest payments for summer travel takes place predominantly in the first half of the year, and the operating expense are mostly incurred in Q3.\n\nYear to date, cash generated from operations was approximately $23 million, offset by principal and interest payments net of approximately $20 million and capex of $30 million, which included growth capex of $15 million. Looking ahead, we are exceeded by the sustained operating momentum across our platform. Given the seasonality of our business, including the heavy dry dock and transit times across our fleet and the slower season for most of our land companies, as well as the higher short-term cancellations that Dolph mentioned earlier, we do anticipate adjusted EBITDA loss in the fourth quarter of 2022 before a return to significant profitability in the first quarter of next year. Overall, we are well-positioned for strong results in 2020, given current guest demand.\n\nWe have a significant portion of our anticipated revenue for 2023 already on the books, and our percentage of sales reached is similar to what it was back in 2018 for 2019 despite having 39% more capacity available for sale. Bookings nearly every week continue to exceed bookings in the same week in 2019, and there is no question that there is significant pent-up demand to get out and explore the world's amazing geographies. While there will likely be short-term choppiness, the world has reopened, and our guests are once again experiencing a thrill of exploration. We have ample liquidity to weather any immediate headwinds, and with a strong booking position moving forward, along with an expanded fleet and a broader set of product offerings, we are well-situated to build upon our results prior to the pandemic and deliver additional shareholder value in the months and years ahead.\n\nThanks for your time this morning. And now Dolf and I would be happy to answer any questions you may have.\n\nOperator\n\nThank you. [Operator instructions] The first question today comes from the line of Steve Wieczynski from Stifel. Please go ahead. Your line is now open.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nHey, guys. Good morning. So Craig or Dolf, I want to ask about the uptick in cancellations that you guys are seeing right now. And I guess what I'm trying to understand is if these cancellation rates have been still accelerating, have they been steady? Or have they plateaued at this point and are now starting to return to normal levels? And then maybe how those could be impacting the fourth quarter? And then also how the resolution has booked out so far for the fourth quarter as well.\n\nCraig Felenstein -- Chief Financial Officer\n\nSure. Thanks, Steve. I appreciate the question. So on the cancellation front, and when we say cancellations, it's always important to remember that these are not cancellations that people are just taking their money back and going home.\n\nWhat we're seeing with the vast majority of these cancel agents as people are moving their bookings to either later in 2023 or into the early part of 2024. With regards to the trend that we're seeing, actually, the trending cancellations has improved pretty much every week since we reported earnings back in early part of August for Q2. What we have not seen yet is to return to the same levels that it was prior to the pandemic. So the trend is actually very much a positive with regards to how it's done over the last several months, but it is not quite back to the level where we want it to be back pre-pandemic levels.\n\nWith regards to the resolution and the move from her from Japan in Q3 to earlier start in Antarctica in Q4. She's done fairly well from a booking perspective. We had originally anticipated her doing four voyages in the fourth quarter. And now it looks like we'll probably have only two, maybe three voyages in the fourth quarter.\n\nBut the voyages that are still on the books have significant occupancy levels, not to the same level that you would normally see for a trip that was launched a year and a half for sale. But for a trip that was initiated in the last few months, the occupancy levels are at a very nice level, and voyages will be very profitable for us.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Gotcha. And then the second question, just maybe around your buyback program. And obviously, the stock has been kind of stuck here in that upper single-digit range for a while at this point.\n\nAnd with a very solid outlook for 2023, I would suspect that you guys would or could start to buy your stock once you're allowed to, which I believe is, I think, February of next year. So maybe just some thoughts around the potential for the buyback to start back up.\n\nCraig Felenstein -- Chief Financial Officer\n\nSure. So as a reminder, for those of you who are not aware, we -- because of the Main Street loan that we had taken on and paid back in February of 2022, we are precluded from buying back our shares until the year has expired from that point. So we are not able to buy back shares until February of next year. What I would say with regards to capital allocation overall is that we always look at our available capital and look at the opportunities that we have in front of us through the same lens, which is if we have the opportunity to invest in organic growth opportunities, if you have the opportunity to make acquisitions that will increase the growth potential of the company.\n\nThat is certainly something that we want to do. In the absence of that, we will absolutely look to buy back shares of this company. We have done that in the past prior to the pandemic. Certainly, where the stock sits today, we think that there is a significant opportunity from here, given the earnings potential of the company.\n\nYou can see the earnings that we generated in the third quarter. We look at the earnings opportunity that we're going to generate in 2023 and then certainly in 2024 and beyond as significantly growth from there. So with regards to buying back stocks, we do think that the stock is an attractive alternative for us once that opportunity presents itself starting in February.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Great. Good color. Thanks, guys.\n\nAppreciate it.\n\nCraig Felenstein -- Chief Financial Officer\n\nThanks, Steve.\n\nDolf Berle -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. The next question today comes from the line of Ryan Sundby from William Blair. Please go ahead. Your line is now open.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nHey, guys. Good morning and congrats on a really nice quarter here. Occupancy of 81% continues to move closer to where you guys were in 2019. Can you maybe just walk us through some of the key hurdles there that you need to clear to close the rest of that gap? Is it certain guest demographic has to come back? Is there a geography that's really pulling that back? And is there an impact here from Endurance and resolution coming on that's having impact thereto?\n\nCraig Felenstein -- Chief Financial Officer\n\nSure. So when you look at occupancy across the fleet, we obviously believe that we will get back to pre-pandemic levels, which will have us in the high 80s, low 90% occupancy levels. And we believe that we can even get higher than that given the demand for expedition travel, and the offering that we provide is a pretty ideal match. So we think that that is certainly where we are headed back to.\n\nWhen you look at some of the headwinds that you have today, one is that -- remember, the average booking window for us tends to be about nine months. So a lot of what you're seeing here has -- our bookings that were still done at times when the pandemic was still a little bit hotter than it is today, which certainly impacted guest demand. Dan talked a little bit about the cancellation rates that we're seeing. If you take the cancellation rates back to a more normalized level, you would see occupancy rates somewhere in the mid-to-high 80% already.\n\nAnd then the last thing is you want to make sure that you're not constantly moving the pieces of your puzzle around with regards to the fleet. When you move a ship at what I would say is within three to six months of departure, you're likely not to have the same occupancy levels that you would have historically. Because we've added inventory back in 2017 and 2018 in Alaska, which is a high-demand area, because we added inventory in the polar region with the Endurance resolution, we fully expect that the occupancy level of the company will get back to the levels that we have had in the past. We also think it's important at the same time to make sure that we're maintaining that high price point, right? So when you look at the opportunities from a revenue perspective, it's a marriage of delivering on that occupancy levels, but also maintaining that high pricing as you expand capacity.\n\nAnd we've certainly done that in the past, and we look to do that in the future. So we would certainly expect to be back at really high occupancies when you look out in 2023.\n\nDolf Berle -- Chief Executive Officer\n\nAnd Ryan, this is Dolf. Just to add that we're investing and seeing some nice returns in search marketing which is really broadening. We think the audience of people that we're reaching who have a real interest in this product. And historically, we've had such a good experience with our brochure marketing that we've made adjustments to our websites where we're greatly increasing the interest in people receiving our catalogs.\n\nAnd we believe that those are both things that will allow us to compress the cycle for people booking and capitalizing on this demand. So we're making active efforts to try to compress the cycle that Craig referenced.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nMaybe just kind of one follow-up on Steve's question. If you look at the itineraries that did take place in the quarter or maybe the future demand curve, are you seeing any trade down or mix shift into either lower price or even shorter duration trips there? Just trying to understand if you're seeing any kind of pullback in spending outside of that cancellation.\n\nCraig Felenstein -- Chief Financial Officer\n\nNo. I think the trends overall are relatively similar. What you're seeing is when you look at the demographics of people who are booking it certainly continues to be very high domestic bookings. You continue to see a very high proportion of repeat business, 40% repeat business, which is consistent with what we've seen historically.\n\nThe overall booking trends have been remarkably consistent. I would say the one thing that you probably have seen, which is a little bit different, is the booking window was shortening over the last several months. You were seeing that nine-month window kind of compress a little bit. However, we just sent out our explorations annual mailing, which is a pretty robust direct mail offering that we do every time -- every year in the fourth quarter.\n\nAnd when you do that, you start to see a bunch of bookings for the end of 2023 and into 2024 as people get really excited about the opportunities in the future. So that window is lengthening a little bit again. But overall, I think that's the only real change that we've seen.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nAll right. It's great to hear. Thanks. Congrats.\n\nCraig Felenstein -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. The next question today comes from the line of Tyler Batory from Oppenheimer. Please go ahead. Your line is now open.\n\nJonathan Jenkins -- Oppenheimer and Company -- Analyst\n\nHi. Good morning, guys. This is Jonathan on for Tyler. Thanks for taking our questions and congrats on the quarter.\n\nFirst one for me. I just wanted to follow up on the cancellations. Can you remind us your cancellation policy and any high-level commentary on the return to a more normalized policy? And I guess how much of a potential driver of the elevated cancellations could be attributable to like a difference in policy compared to pre-COVID?\n\nDolf Berle -- Chief Executive Officer\n\nIt's a great question, Jonathan. So one of the reasons that we feel the cancellations were high in recent months is that we had a much more lenient cancellation policy over the course of the pandemic in any time previous. We have reinstituted a more strict cancellation policy now, which is up to 15% of -- there's various sort of stages and length of time before trip plays off that has different levels of requirement to pay. But we've now reinstituted what's a more rigorous policy that way.\n\nAnd so a lot of what we're seeing in terms of any cancellations above previous levels are really just the remnants of people who booked under the policy that was more lenient in recent months, and that's now calming down quite a bit. But yes, we've returned to a more strict cancellation policy.\n\nJonathan Jenkins -- Oppenheimer and Company -- Analyst\n\nAnd then, Craig, you mentioned the expectation for an expected EBITDA loss in the fourth quarter. Can you just walk us through kind of the puts and takes there and the primary drivers of that assumption? And maybe how they differ from the fourth quarter of 2019, where I believe it was an adjusted EBITDA gain.\n\nCraig Felenstein -- Chief Financial Officer\n\nSure. When you look at the fourth quarter, while we did deliver positive EBITDA in the fourth quarter of 2019. Overall, the fourth quarter is a weaker quarter for us traditionally, just given the -- what I would say is the fleet usage in the quarter. Traditionally, we have a whole lot of dry docks going on in the quarter.\n\nWe have a lot of transit days as ships are moving from other parts of the world down to the polar region in many cases. So that ultimately does tend to drive lower results in the fourth quarter. When you look at the fourth quarter of 2022, the biggest driver is going to be the lower occupancy across the fleet for that fourth quarter. So you have a natural transit times of natural drydock times, but you also have lower occupancy levels.\n\nbecause you have -- the resolution was moved at what I would say, is a later date from Japan down to Artic earlier. And while she will be somewhat profitable on the voyages that she operates, -- she does have transit time in the quarter and the time where she's not operating, will obviously have cost on that front. The other thing to remember in the fourth quarter for us is that out of the land companies, will Natural Habitat will certainly have a strong fourth quarter. The other land companies that we acquired.\n\nIt is a seasonally slow quarter for them before they ratchet up again heading back into 2023. So all of those things combined are going to be the primary drivers behind the projected loss in the fourth quarter. And then, certainly, the cancellations that Dolf mentioned earlier, are still running harder than we would normally expect. -- which will drive occupancy rates lower.\n\nNow it is possible certainly that we have some strength in last-minute bookings, cancellations could drop. If those things happen, we can have some upside here. But given current trends, we expect it to be a loss in Q4.\n\nJonathan Jenkins -- Oppenheimer and Company -- Analyst\n\nOK. Very clear. Thank you for that. And then the last one for me, if I could.\n\nThe new land-based offerings obviously very strong. Any early color on how those acquisitions are trending compared to your original expectations? And does the strength you've seen there so far increase your aside to do additional bolt-on land acquisitions?\n\nDolf Berle -- Chief Executive Officer\n\nWell, that's a great question. And we're very pleased with the momentum there, and we realized that the psyche of guests around smaller group, land travel is slightly different than the way they felt about cruising in recent months, and we're seeing the fruits of that. We're extremely pleased with the leadership in those companies. These are the entrepreneurial CEOs who continue to run those companies.\n\nAnd so I think we believe that we're more than on track in terms of expectations, and we think it can grow from here as we spend more time with them and they actually learn from one another. As it relates to potential further acquisitions, we maintain a strong point of view that our platform company and the idea of being able to cross-market between various pools of guests is still a very good one. And so we remain opportunistic. We're being thoughtful around liquidity in terms of the strength of the balance sheet as we emerge from the pandemic.\n\nAnd so we're balancing the appetite for growth that way with just being prudent financially. -- but we're certainly in the marketplace. Trying to think about what the next strategic move that would be most helpful for the company is in that regard, and look forward to continuing to expand the company in that way.\n\nJonathan Jenkins -- Oppenheimer and Company -- Analyst\n\nVery helpful. Thank you for all the color. The all for me.\n\nDolf Berle -- Chief Executive Officer\n\nThanks, Jonathan.\n\nOperator\n\nThank you. The next question today comes from the line of Chris Woronka from Deutsche Bank. Please go ahead. Your line is now open.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nHey. Good morning, guys. Thanks for all the details so far. So a question on -- as you look forward, and maybe it's more of a 2024 question at this point.\n\nBut are you having to -- are you thinking about, I guess, adjusting some of the geographies and itineraries. And when you think about some of the issues with the Baltic region and even parts of Asia, at what point do you make a call and say, we're going to just until further notice beyond those regions? And what kind of impact do you think that -- can that have a -- can you recover yields on that as I know those are generally higher yielding itineraries.\n\nDolf Berle -- Chief Executive Officer\n\nThanks. Well, let me first begin by saying that we do think that there is room for expansion within our current stronghold, which is Antarctica, as you know, Alaska, over time in the Galapagos and the high architect. And so we know that there is real demand. We have waiting lists in many cases for ships that are scheduled to be in those areas going forward.\n\nAnd so we will continue to really think hard about how we can maximize the strength of those itineraries. You're absolutely right that there are some geographies that we have to really keep a close eye on. And we do that as a matter of course. I think the company always has done that.\n\nThat's part of our natural routine. One of the things I feel great about is that the company demonstrated a strong ability to pivot in the last 18 months when we knew we had challenge. The example of the Russia-Ukraine contract, flicked end pivoting harder into the Northeast passage just one example of that. So we're remaining vigilant.\n\nWe have to keep track not only of what's going on from a governmental standpoint but also really kind of get sentiment, right, get confidence in these regions. So at the moment, we are planning full itineraries across the world, not probably Russia but elsewhere for 2024. But in the next few months, we'll double down on what we think the most profitable and successful voyages can be. And I think we'll have a much better sense of how confident we can be over the next few months.\n\nThe world is still evolving and emerging in such a way that it's less predictable. It's more predictable than it was six months ago, and it's less predictable than it was prior to the pandemic. And so I realize that's sort of a nuanced answer, but that's how we're thinking about it.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nOK. Thanks. I guess as a follow-up, you guys -- it's obviously been a really big effort to kind of get everything back up and running. And the question is kind of on marketing, some of the sales and marketing costs going forward.\n\nYou covered a lot of ground there. But do you think the margin profile of the business has changed dramatically? I mean, are the marketing costs, do we think those cycle off at some point next year? Or, given that you're focused on growth, should we kind of run rate what we're seeing now?\n\nCraig Felenstein -- Chief Financial Officer\n\nSure. So Chris, when you think about sales and marketing costs, one of the first things I would say is you got to remember that a big driver of the growth in sales and marketing cost is higher commissions related to the higher revenue, right? So as we continue to grow the company, you're going to continue to see commission costs that would be a bigger part of that, which is helping us to drive that revenue higher. So that is the first thing. The second thing I'll say is when you look at the company and how we grow, we absolutely think there's an opportunity to expand margins from 2019 levels.\n\nNow you're not going to do that overnight. Certainly, the biggest driver of margins is going to be revenue. And if you can get occupancy rates back to where they were previously, you should have some nice margin expansion. The good thing for us is as we add additional shifts to the equation, those ships tend to operate at a gross margin well over 50% and, in some cases, well over 60%.\n\nSo the -- there's a natural margin expansion as you add hardware if you can continue to fill that hardware at the high occupancy levels and at the higher per diems. So we feel pretty good about that. There is one item that is, I would say, working against margin expansion, and that is the success of the land-based companies, while it is a very big positive for us from a cash flow perspective and a very big positive to us from an EBITDA growth perspective, those companies do tend to operate at a lower margin overall. So there is a natural minor headwind because of that.\n\nBut we do think that there is a significant opportunity to expand margins as we grow the business moving forward.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nOK. Very helpful. Thanks, guys.\n\nCraig Felenstein -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. The next question today comes from the line of Alex Fuhrman from Craig-Hallum. Please go ahead. Your line is now open.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nHey, guys. Thanks for taking my question and congratulations on the return to profitability here. I wanted to ask about your bookings for '23, the strong increase that you're seeing above pre-pandemic levels. Can you give us some color on which geographies have really been driving that? You mentioned there continues to be some volatility and headline risk around some places in Asia, as an example.\n\nAnd, of course, you've lost certain routes around the Northeast passage in the high arctic because of the Russia situation. Have those regions been kind of underperforming in the bookings? Or has it been pretty much around the world that you've been kind of getting to that double-digit growth number?\n\nCraig Felenstein -- Chief Financial Officer\n\nSure. Thanks, Alex. So the strength in bookings has actually been very, very broad-based, which is nice to see. You're seeing really nice uptick in, I would say, Alaska and the Galapagos in large part to newer guests, guests that are not part of Lindblad family previously that are now traveling with us.\n\nSo it's nice to see there. And when you look at the polar regions in the Arctic as well as Antarctic, you're seeing a nice return from a lot of our previous guests who have traveled with us who are looking to get out there and start to explore the world again. So we are not seeing one geography drive things. It's been pretty broad-based.\n\nAnd even some of the shoulder season inventory is doing relatively well. So we feel pretty good about the itineraries that we have in place for 2023 today. We feel really good about what even lies ahead for 2024, and we expect these trends to continue moving forward.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nGreat. That's really helpful. Thanks, Craig.\n\nCraig Felenstein -- Chief Financial Officer\n\nThank you.\n\nDolf Berle -- Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] The next question today comes from the line of Christine Webb from Artisan Partners. Please go ahead. Your line is now open.\n\nChristine Webb -- Artisan Partners -- Analyst\n\nHey, guys. Congratulations on the quarter. Just wanted to follow back up on the cancellation rates. Can you maybe tell us pre-coat sort of what that rate was? And as you exited 3Q, what you were trending at? And then I know you used the word cancel, but a lot of them are rescheduled.\n\nCould you maybe just tell us the mix? So what portion of the cancellations you're seeing are rescheduled versus actual cash refunds?\n\nCraig Felenstein -- Chief Financial Officer\n\nYes. Let me answer the second part of that first, and then I'll get into the cancellation rate. When you look at the refund level, the refund level is very, very low, even the guests that haven't necessarily canceled and rebooked. They haven't canceled a natural refund.\n\nThey had canceled. They are deciding what they want to do. So in terms of the refund levels that we're out there giving today, it is, well, still not down to 2019 levels. It is very, very far below where it was at the height of the pandemic, and we are not seeing much cash flow out the door from a refund perspective.\n\nThe one exception to that from time to time is when we have canceled the voyage overall. What we did cancel Japan, there was obviously a little higher -- well, there was still a high uptake from a lot of those people to the following year. It was a higher-than-normal refund related to that kind of a switch. With regards to cancellation rates, it's a hard question to answer because when you say cancellation rate, as a percentage of what.\n\nSo what I would say the best way to look at cancellations is when you look at cancellations as a percentage of bookings coming in the door, the percentage that we're seeing today, and we're not going to speak to the specific percentage is probably two to three times what it was back in 2019. If I look back to the second quarter, it was probably three or four times what it was back in 2019. So you can see that it started to step down. And when I look at, for example, in October onto itself, it was probably only about one time where it was back in 2019.\n\nSo the trends are favorable right now in terms of where they were over the last several months to where they are today, but not quite yet where we want them to be overall.\n\nChristine Webb -- Artisan Partners -- Analyst\n\nAnd then for individuals that are rescheduling or potentially canceling or looking to see what Itera, they want to move on with next. If they choose to reschedule, do they roll in some of the more strict policy? Or do they get to keep the existing lenient policy, assuming this is a guess that booked during the COVID period where they had leaning options for canceling their trip?\n\nCraig Felenstein -- Chief Financial Officer\n\nYes. If they've changed their booking from this period to the next period, we will certainly hold them to the same cancellation policies that our new guests are booking today. That said, we have, as a company throughout the pandemic, worked with our guests because our guests tend to be very, very loyal. And we will continue to work with our guests to make sure that they have the flexibility and the options they need to book travel, especially somebody who stuck with us throughout the pandemic.\n\nBut we have gone back to our traditional cancellation policies, and our goal is to keep those pretty firm here moving forward.\n\nDolf Berle -- Chief Executive Officer\n\nFor what it's worth, some amount of the cancellations occur because someone actually comes down with COVID or someone in their party has COVID, or someone in their family has cobot. And so we think that what's going on with COVID in people's individual lives in addition to whatever policies there might be in any given country related to quarantine, are still the biggest factor behind what's going on with people canceling. And so, all of those trends seem to be going in a good direction as it relates to reducing cancellations in the future. But that's what we experienced over the last couple of months.\n\nChristine Webb -- Artisan Partners -- Analyst\n\nOK. Thank you so much.\n\nDolf Berle -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThere are no additional questions waiting at the moment. So I'd like to pass the conference back over to Craig Felenstein for any closing remarks. Please go ahead.\n\nCraig Felenstein -- Chief Financial Officer\n\nThanks, Bally, and thank you, everybody, for joining us this morning. We look forward to continuing to dialogue with you as we head off this call. And if you have additional questions, please reach out, and we're happy to talk. Thank you.\n\nDolf Berle -- Chief Executive Officer\n\nThanks, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCraig Felenstein -- Chief Financial Officer\n\nDolf Berle -- Chief Executive Officer\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nJonathan Jenkins -- Oppenheimer and Company -- Analyst\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nChristine Webb -- Artisan Partners -- Analyst\n\nMore LIND analysis\n\nAll earnings call transcripts"
}