{
  "companyName": "AeroVironment",
  "companyTicker": "AVAV",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/aerovironment-avav-q1-2023-earnings-call-transcrip/",
  "content": "AeroVironment (AVAV 0.29%)\nQ1 2023 Earnings Call\nSep 07, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the AeroVironment fiscal year 2023 first quarter conference call. [Operator instructions] Please be advised that today's conference call is being recorded for replay purposes. I would now like to hand the conference over to Jonah Teeter-Balin. Thank you.\n\nPlease go ahead, sir.\n\nJonah Teeter-Balin -- Senior Director, Corporate Development and Investor Relations\n\nThank you, and good afternoon, ladies and gentlemen. Welcome to AeroVironment's fiscal year 2023 first quarter earnings call. This is Jonah Teeter-Balin, senior director of corporate development and investor relations for AeroVironment. Before we begin, please note that certain information presented on this call contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nForward-looking statements include, without limitation, any statement that may predict, forecast, indicate or imply future results, performance or achievements and may contain words such as believe, anticipate, expect, estimate, intend, project, plan, or words or phrases with similar meaning. Forward-looking statements are based on current expectations, forecasts and assumptions, which involve risks and uncertainties, including, but not limited to, economic, competitive, governmental and technological factors outside of our control that may cause our business strategy or actual results to differ materially from the forward-looking statements. For further information on these risks, we encourage you to review the risk factors discussed in AeroVironment's periodic reports on Form 10-K and other filings with the SEC, along with the associated earnings release and safe harbor statement contained therein. This afternoon, we also filed a slide presentation with our earnings release and posted the presentation on our website at avinc.com in the Events and Presentations section.\n\nThe content of this conference call contains time-sensitive information that is accurate only as of today, September 7, 2022. The company undertakes no obligation to make any revision to any forward-looking statements contained in our remarks today or to update them to reflect the events or circumstances occurring after this conference call. Joining me today from AeroVironment are chairman, president and chief executive officer, Mr. Wahid Nawabi, and senior vice president and chief financial officer, Mr.\n\nKevin McDonnell. We will now begin with remarks from Wahid Nawabi. Wahid? \n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nThank you, Jonah. Welcome to our first quarter fiscal year 2023 earnings conference call. I will start by summarizing our quarterly performance and discuss recent achievements. Then Kevin will provide a more detailed review of our financial results, after which I will provide a summary of our expectations for the remainder of fiscal year 2023 before Kevin, Jonah and I take your questions.\n\nLet me emphasize a few key messages, which are included on slide No. 3 of our earnings presentation. First, our first quarter results were generally in line or above our expectations, and we're on track to achieve our fiscal year 2023 objectives, leading to another year of double-digit top line organic growth. Second, we're seeing strong order momentum demonstrated by a record funded backlog of more than $300 million as of August 27.\n\nAnd third, AeroVironment continues to successfully manage through ongoing supply chain challenges and is very well positioned for continued value creation even beyond this fiscal year, primarily due to strong demand across nearly all our product lines. Let me first summarize our financial results for the quarter. We delivered first quarter revenue of $108.5 million compared to $101 million in fiscal year 2022, an organic increase of 7% year over year. This growth was primarily due to higher demand for our tactical missile systems and our small, unmanned aircraft systems product lines.\n\nGross profit for the first quarter was $33.7 million compared to $28.7 million in the prior year period. Our gross margin increased to 31% from 28% in fiscal year 2022. This increase primarily reflects higher sales volumes, as well as favorable product and geographical mix. We reported a non-GAAP adjusted net loss of $2.5 million or $0.10 per diluted share as compared to a loss of $4.2 million or $0.17 per diluted share for the first quarter of fiscal year 2022.\n\nLooking ahead, we remain confident in the future of AeroVironment and our ability to deliver superior shareholder returns despite ongoing supply chain constraints, inflationary pressures and a tight labor market. We remain in direct contact with our most critical suppliers to improve material lead times. We're also continuing to work directly with the office of the US Secretary of Defense at the Pentagon to prioritize our raw material needs. When appropriate, we continue to build additional inventory, which will allow us to meet the growing near-term demand for our highly innovative solutions.\n\nWe're still facing continued headwinds related to the tighter labor markets, especially in key engineering disciplines in support of our growing set of customer-funded R&D programs. That said, we are successfully managing staffing levels across the organization and continue to prioritize our development activities to ensure the most urgent and important programs receive the resources they require. Let me reiterate, demand for our innovative solutions remains high, both domestically and overseas. Our small UAS and Switchblade loitering munitions have both seen a surge in demand due to the conflict in Ukraine.\n\nOur other product lines are also benefiting from this greater global awareness and ongoing trends toward increased adoption of unmanned robotic systems. While our first quarter backlog remained roughly the same as last quarter, we're experiencing greater contract award activity in the current fiscal year quarter, which coincides with the fourth quarter of the US government's current fiscal year. As of August 27, we have a record funded backlog of over $300 million and are optimistic about additional wins in the next four to six months. Notably, our mix of business is shifting to higher product sales, which should improve our margin profile in fiscal year 2023.\n\nWe're also proud to have published our inaugural corporate social responsibility report, now available on our website. AeroVironment is built on a legacy of more than 50 years of environmental stewardship, and our commitment to sustainability is embedded in our mission of developing highly innovative solutions that deliver on our customers' missions while doing more with less. Let's not forget, the overwhelming majority of our robotic solutions are designed with fully electric propulsion systems, making them among the greenest and most environmentally friendly solutions in the market. Now, I would like to provide an update on current developments within each of our product lines.\n\nLet me begin with our small UAS product line, which experienced growth over the prior year's first quarter. Given the strength of this business, we continue to see additional growth opportunities, particularly with international customers. We're also prudently investing in developing new advanced solutions and plan to introduce multiple new products to market this fiscal year. This will position us to pursue additional future programs of record within the US DoD while leveraging a large installed base for upgrades and enhancements.\n\nOverall, we see increasing global demand in our small UAS, including multiple opportunities for our best-in-class Puma AE and Puma LE UAV systems for Ukraine. Our tactical missiles systems product line is also experiencing robust growth this fiscal year. The overall demand trends for our Switchblade 300 and 600 loitering munitions are accelerating. Switchblade remains unique in terms of its long range, precision strike, loitering duration and patented wave-off features.\n\nWe're extremely proud of this innovation and the capabilities it provides Ukraine and its military to defend their country. Since our last earnings call, interest in both Switchblade 300 and 600 has continued to grow, with TMS product line sales increasing 20% year over year. The US government is intent on backfilling inventories reduced through its presidential drawdowns to support Ukraine. We were recently awarded a $20.6 million contract for Switchblade 300 systems from the US Army.\n\nIn addition, the prior congressional legislation authorizing $40 billion in military and humanitarian aid has provided the opportunity for new orders for Ukraine. We are encouraged by these developments and the opportunity to further assist Ukraine and our other allies in Europe. Additionally, we recently received a DO priority rating by the US federal government, which will expedite and prioritize the purchase of necessary supplies for Switchblade from our vendors. A DO-rated order is the second highest level of priority that can be granted by the US DoD.\n\nWe're also fielding multiple requests for proposals from additional allies for both Switchblade 300 and 600 loitering munitions. We continue to work with these customers to translate their interest into firm contracts and expect additional sales later this year and next fiscal year. Overall, our pipeline and demand levels continue to increase, setting us up for strong shipments late in fiscal year 2023 and into fiscal year 2024. As you can see, we remain positive about both the near-term and long-term outlook for our TMS product line.\n\nOrder flow is picking up with backlog growth and deliveries expected to accelerate as the year progresses. We maintain broad bipartisan support for Switchblade products as Congress begins formulating the budget for government fiscal year 2023. The key challenges to meet this growing demand for our Switchblade loitering munitions remains the timing of these contracts coupled with global supply chain constraints. However, we're optimistic that our proactive management of supply chain challenges, coupled with the assistance of the US government, will help us deliver on our operational objectives.\n\nI will now switch gears and discuss our medium UAS or MUAS product line. I'm very pleased to announce that after some delays, the US Army has officially awarded AeroVironment Increment 1 of the Future Tactical UAS program also known as FTUAS. We're excited by this important award. As a reminder, the FTUAS program in aggregate is expected to be valued at more than $1 billion over a 10-year period.\n\nIn the near term, the US Army's proposed funding for FTUAS is approximately $100 million for government fiscal year 2023. Our focus now turns to competing for Increment 2, which we expect to be awarded in the next 12 months. We look forward to demonstrating the full breadth of our unique capabilities to the US Army on this very important program. In addition, we're excited to announce that we recently acquired Planck Aerosystems, a leading provider of advanced unmanned aircraft navigation solutions.\n\nThis acquisition will enhance autonomy capabilities across our entire portfolio and is especially applicable to our JUMP 20 UAV, where it is expected to further our competitive advantage for FTUAS and other upcoming programs. Based in San Diego, Planck Aerosystems has developed unique unmanned aircraft solutions for close to a decade with products ranging from embedded software applications to fully integrated UAS solutions that leverage technologies for guidance, navigation and artificial intelligence. As part of our MUAS product line, Planck, including its Autonomous Control Engine or ACE, capabilities will be integrated into our existing products to enable improved autonomous takeoff and landing on land or at, sea particularly in GPS-denied and contested aerospace environments. Working together as part of AeroVironment, we will offer even more compelling and depreciated solutions to our customers.\n\nIt is a great addition to the company, and we're thrilled to have their talented staff as part of our team. Lastly, our MUAS business continues to pursue additional international opportunities, including through recent demonstrations of our JUMP 20 systems to potential customers in both Europe and the Middle East. Regarding our unmanned ground vehicles or UGV product line, we continue to see strong interest abroad and are pursuing new opportunities, leveraging the heightened interest fostered by the conflict in Ukraine. This product line also remains on track to grow this fiscal year.\n\nWithin our HAPS product line, I'm pleased to announce that we secured an additional $25 million of funding during Q1 to continue with the next phase of development for our Sunglider platform underscoring our strong enduring partnership with SoftBank. Both companies are committed to the vision of developing and commercializing stratospheric-based telecommunication services for the growing global population. We're now focused on building a third aircraft to perform further flight testing, demonstrate increased endurance and obtain FAA certification. In addition, we are now pursuing opportunities within several agencies of the US DoD, which we believe can benefit from our advanced solar HAPS solution.\n\nOverall, we remain on track for HAPS revenue of between $25 million to $35 million this fiscal year. And finally, I'll share some exciting developments for our MacCready Works Advanced Solutions product line. Recently, NASA announced that it plans to send additional space flights to Mars in the coming years for ground sample analysis and mineral retrieval. The Mars sample retrieval lander will include two recovery helicopters known as Mars science helicopters due to the success of ingenuity, which has already performed 29 consecutive and successful flights on Mars and survived over a year beyond its original planned lifetime.\n\nThese helicopters will provide a secondary crucial capability to retrieve samples from the surface of Mars. We believe these upcoming missions will provide AeroVironment with multiple opportunities to showcase our innovative unmanned robotic solutions while enabling the collection of valuable scientific data that benefits all humanity. We remain actively engaged with NASA's Jet Propulsion Laboratory, or JPL, on this next important mission. With this architecture solidified, the program is expected to move into a preliminary design phase this October, which is expected to last about 12 months.\n\nDuring this phase of the program, we will complete engineering prototypes of the major mission components, after which more definitive manufacturing timelines can be prepared. In summary, AeroVironment remains on track for double-digit top line organic growth and improved underlying results this year. We're keeping expenses under control, successfully managing through ongoing supply chain constraints and seeking out the best and brightest talent to ensure we deliver for our customers and shareholders. Solid execution, combined with robust global demand for our products and services, gives us confidence in our performance for the quarters to come.\n\nWith that, I would like to now turn the call over to Kevin McDonnell for a review of first quarter financials. Kevin?\n\nKevin McDonnell -- Senior Vice President and Chief Financial Officer\n\nThank you, Wahid. Today, I'll be reviewing the highlights of our first quarter fiscal 2023 performance, during which I will occasionally refer to both our press release and earnings presentation available on our website. In summary, this was a good quarter, both in terms of organic revenue growth and improvement to our adjusted EBITDA versus last year's first quarter. We've done all this despite continued supply chain challenges, as Wahid highlighted in his remarks.\n\nNow, I'd like to provide more detail to the revenue for the quarter. Revenue for the first quarter was $108.5 million, an increase of 7% over the first quarter of fiscal 2022 revenue of $101 million. Slide five of the earnings presentation provides a breakdown of revenue by segment for the quarter. Our largest segment during the quarter was small UAS with $43.3 million of revenue, up from last year's $40 million.\n\nApproximately 70% of small UAS revenue in the quarter was from international customers, and we expect this trend to continue throughout the year. Our Tactical Missile Systems, or TMS, segment contributed $23 million of revenue during the quarter compared to $19.2 million in fiscal 2022. Despite the strong first quarter growth, we are still hampered by supply chain challenges in the TMS segment. Our medium UAS segment finished the quarter with revenue of $19.3 million, a $3.1 million decrease compared to the first quarter of fiscal 2022 of $22.4 million.\n\nThe decline is largely a result of lower MEUAS program revenues. However, as Wahid mentioned, our Medium UAS division was recently awarded with the Army's FTUAS Increment 1 program. This is an important milestone in building increased Medium UAS product revenue over the coming quarters. Our HAPS segment contributed $10.2 million in Q1, in line with the $10.4 million in the prior year first quarter.\n\nAs noted by Wahid, we recently signed a contract for extension of our HAPS program with SoftBank. Revenue from the other segment, which includes our Telerob and the MacCready Works businesses, increased year over year to $12.8 million versus $9.2 million in the fiscal 2022 first quarter. Most of this growth in other came from our MacCready Works business, which continues to win contracts for advanced mission capabilities. Now, looking at gross margins.\n\nSlide five of the earnings presentation shows the mix of product versus service revenue. In Q1, we saw a product mix of 53%, which is in line with the first quarter of last year. GAAP gross margins improved from 28% to 31% year over year. I'll now speak to our adjusted gross margins.\n\nSlide six of the earnings presentation shows the trend of adjusted product and service gross margins, while Slide 12 reconciles the GAAP gross margins to the adjusted gross margins, which excludes intangible amortization expense and other noncash purchase accounting items. Overall, adjusted gross margins in the first quarter were 34%, up compared to 32% in the first quarter of FY '22. This increase was a result of higher margin sUAS international product sales. Adjusted product gross margins for the quarter were 45% versus 42% in the first quarter of last fiscal year due again to a favorable geographical mix.\n\nIn terms of adjusted service gross margins, the first quarter was at 21% versus 22% during the same quarter last year. The slight year-over-year decrease was due to lower Medium UAS service gross margins. As mentioned last quarter, we expect product mix to be higher in the fiscal 2023, which will result in improving gross margins, partially offset by some short-term increased supply chain costs. Now, turning to GAAP earnings.\n\nWe had a GAAP net loss for the first quarter of $8.4 million compared to a net loss of $14 million for the first quarter of fiscal 2022. The $5.5 million year-over-year improvement was due to a $5 million in increased gross margin dollars, a $4.5 million decrease in acquisition-related expenses and a $1.8 million decrease in SG&A expenses. These positive items were partially offset by a $3.6 million increase in tax expense and an increase of $1.3 million in R&D expenses. I should note that under the current tax accounting rules, we'll continue to have a tax expense in quarters with a pre-tax loss and a tax benefit in quarters with taxable income of approximately 50% of the GAAP pre-tax income in both cases.\n\nIn terms of adjusted EBITDA, slide 13 of our earnings presentation shows a reconciliation of GAAP net loss to adjusted EBITDA. The adjusted EBITDA for the first quarter of fiscal 2023 was $13.1 million, an increase of over 90% over the prior year. Of the $6.3 million improvement over Q1 of FY '22, $5.4 million was related to increased adjusted gross margins as a result of improved product margins, $2.3 million related to lower SG&A expense, and this was partially offset by a $1.3 million increase in R&D spending. Slide 10 shows a reconciliation of GAAP and adjusted or non-GAAP diluted EPS.\n\nThe company posted adjusted loss per diluted share of $0.10 for the first quarter of fiscal 2023 versus $0.17 diluted share loss for the first quarter of fiscal 2022. Turning to the balance sheet. The total cash investment to end in the quarter were $123.5 million. This represents an increase of $6 million over our year-end balances.\n\nWe saw improvement in accounts receivable and unbilled receivables during the quarter, partially offset by some expected inventory increases. We anticipate inventories will continue to increase throughout the year due to increasing demand for our products and supply chain headwinds that requires us to buy some inventory ahead of orders. We continue to have a strong balance sheet with over $100 million of cash investments and $100 million working capital facility. I would like to conclude with our FY '23 revenue visibility.\n\nSlide eight of the earnings presentation provides a summary of our product -- of our current fiscal 2020 visibility. Visibility as of today is at 75% to the midpoint of our revenue guidance range. The 75% visibility compares favorably to historical Q1 conference call visibility. Now, I'd like to turn things back to Wahid.\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nThanks, Kevin. We remain confident in our ability to deliver on our expectations for fiscal year 2023 and beyond. While federal budget priorities are still being determined by -- for government fiscal year 2023, our advanced unmanned robotic solutions continue to be in strong demand. As such, we are reiterating our previously provided guidance for fiscal year 2023, which is again shown on slide No.\n\n7. We anticipate revenue of between $490 million and $520 million for fiscal year 2023, representing double-digit organic growth and net income of $11 million to $18 million or $0.42 to $0.72 per diluted share. We forecast non-GAAP adjusted EBITDA of between $82 million and $92 million, and non-GAAP earnings per diluted share, excluding acquisition-related costs, amortization of intangible assets and other onetime expenses, of between $1.35 and $1.65. We continue to expect 60% of revenue will be in the second half of this fiscal year, reflecting the timing of current and anticipated awards.\n\nOur adjusted gross margin should end up at or slightly above last fiscal year. This is mainly driven by favorable product mix and higher volumes, somewhat offset by the unfavorable impact of ongoing supply chain expenses. We also expect to deliver adjusted EBITDA of between 16% and 18% of revenue for the full year, as previously discussed. Before turning the call over for questions, let me just reiterate a few key takeaway points on which our investors should focus.\n\nFirst, we remain on track for our fiscal year 2023 guidance, including, among other things, double-digit top line organic growth, stable margins and improved bottom line results. Second, we're seeing strong order momentum demonstrated by the record funded backlog of more than $300 million as of August 27. And third, AeroVironment continues to successfully manage through ongoing supply chain challenges and is very well positioned for continued value creation even beyond this fiscal year, primarily due to strong demand across nearly all our product lines. I would like to thank our employees for their hard work during the quarter.\n\nTheir perseverance and dedication have enabled us to continue supporting our military and allies around the world. All of us at AeroVironment are committed to providing the US, our allies and other customers around the world with the most reliable, innovative and invaluable unmanned aerial and ground-based robotic solutions. Similarly, we remain committed to our goal of delivering strong returns for our shareholders. And with that, Kevin, Jonah and I will now take your questions.\n\nOperator\n\n[Operator instructions] I have the first question. It's coming from Ken Herbert of RBC. Your line is open.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nYeah. Hey, good afternoon, everybody. Wahid, I just wanted to start out. Can you just maybe provide an update specifically on Switchblade 300 and 600? How much of the maybe the 300 in funded backlog you've called out or implied in the fiscal '23 revenues are sales associated with Switchblade into Ukraine, either directly into Ukraine or as part of a replenishment of inventories here in the United States?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nSo Ken, the mix of backlog so far is somewhat evenly divided between the product lines. And as I mentioned in my remarks, we expect significantly more new orders for Switchblade over the next four to six months for the two specific reasons you mentioned. One, to provide more switch blades to Ukraine through the US government, and two, to also backfill the depleted inventories of the US DoD that they've already drawn from to help Ukraine with so far. So I would say, as of now, the mix of our backlog is evenly distributed.\n\nIt's not heavily tilted toward Switchblade yet, but we do have line of visibility to several additional contracts and orders that are in the works through the US DoD and some of our allies that should make it into orders in the next few months.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nOK. That's helpful. And just as a follow-up, is it possible maybe to quantify the impact of the supply chain on the fiscal first quarter? And what's your visibility on if that's getting better? Is it steady? Is it stable? I mean how do we think about that impact as it flows through the rest of the fiscal year?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nSure. You're welcome, Ken. So definitely, supply chain remains to be a headwind for everyone around the world that I know of, and we talk to in our industry as well, and that's no different for us. We are managing it very successfully by proactively working with suppliers, with the US DoD, with the Office of the Secretary Defense, with the distributors of our suppliers and many, many other activities that we've got going.\n\nFor Q1, the results really were threefold. One, it was within or slightly above our expectations, so we're very pleased with the results for Q1 as we expected them to be. If you recall, government continuing resolution for fiscal year 2022 did not end up until sort of March-April time frame. So a lot of the acquisition dollars and funding that the US DoD is expecting to put in contract in government fiscal 2022 is actually being executed now, which is basically going through this month and next month as the last two months of it, and that's why there's some delays in contracting in that regard.\n\nAnd lastly, supply chain still while -- still remains a headwind. We have managed to secure as much of our supply as we can for this fiscal year while there still remains to be some risk. But overall, we feel good about the remainder of this year. We believe that given our position today and all the actions we've taken, including building a little bit in advance where it's prudent, positions us well to be able to achieve our operational plan for this year. \n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nThank you.\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nYou're welcome, Ken.\n\nOperator\n\nThank you. Our next question will be coming from Peter Arment of Baird. Your line is open.\n\nPeter Arment -- Baird -- Analyst\n\nGood afternoon, Wahid, Kevin, I guess I wanted to come back to, I guess, talk about Switchblade as well. Just over the summer, you've had a lot of interest, I think, internationally. Maybe you could just update us on the timeline there because it sounds like what you're referring to is the supply chain is particularly impacting your TMS kind of product line, so your ability to kind of fulfill some of the demand that's obviously increasing.\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nPeter, that's accurate. Overall, most of our products are somewhat affected by the supply chain constraints, the global supply chain constraints, but Switchblade in particular. Because some of the -- as you know, some of the electronics that are within Switchblade are very specific to Switchblade, specifically the warhead and fuse for the arming of the loitering munition, etc., etc. Overall, I can tell you that the activity level in terms of demand signals is very, very strong for Switchblade and our small UAS overall.\n\nIt's both domestic, as well as international. We are actively engaged on with several countries. The list continues to grow, and most of those engagements are progressing quite well through the acquisition and contracting process. That's why I mentioned on earlier in my remarks that we expect to secure more contracts, and the momentum should continue into our second and third quarter of this fiscal year.\n\nNow, how much of that demand we can convert to actual sales and revenue for this year is still undetermined because of the timing of those contracts and the supply chain constraints. But we're working at them actively, but what I can say is that we feel good about being able to achieve our current plans given the situation we're in and the visibility that we have within our pipeline. And then, lastly, of course, Switchblade has absolutely been an incredible game changer for the Ukraine military through this conflict. Many of the US allies in Europe are awoken by this, and they're really interested in acquiring the capability.\n\nWe're actively engaged with them on both DCS and FMS cases, and I expect that to continue over the next several months and quarters.\n\nKevin McDonnell -- Senior Vice President and Chief Financial Officer\n\nI'd add to that that we're also seeing -- it shouldn't get lost that we're seeing increased adoption with the US DoD across a broader class of customers there. So while the international demand is great and the Ukraine war, we're also seeing in the US side, so it's kind of a double whammy.\n\nPeter Arment -- Baird -- Analyst\n\nYeah. And then, just a follow-up related to this conversation on Switchblade. Wahid, the profitability for this area in TMS, I assume as the international mix grows, particularly if you get more direct, we should expect that to improve. Is that a correct assumption?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nYeah. So our first quarter profitability was pretty much in line and slightly above our expectations. Usually, we have a lower and unprofitable first quarter, and that over time improves. This year, especially, we do have the backlog.\n\nBut supply constraints, that's what is really driving some of the revenue and top line for the first half, and that's why we expect about 60% of our revenue to be in the second half. And of course, for the full year, we expect it to be a fairly profitable year for us, way better results than last fiscal year, and we expect that momentum to continue into our government -- our fiscal year 2024. I believe that the demand drivers and the macroeconomic levels. Despite the economy and higher interest rates and inflationary pressures, I believe that we're positioned very well for this fiscal year, as well as next fiscal year and beyond.\n\nPeter Arment -- Baird -- Analyst\n\nI appreciate all the color. Thanks.\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nYou're welcome, Peter.\n\nOperator\n\nThank you. Our next question will be coming from Austin Moeller of Canaccord Genuity. \n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nHi. Good afternoon. Wahid and Kevin, so just my first question here. This has sort of been touched on by a few analysts before me.\n\nBut within that $307 million backlog as of August 27, how many of those customers are specifically NATO Europe customers that were part of the 20 countries approved by the DoD and the state department a few months ago?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nSo Austin, we have a fairly growing list of international customers, both for Switchblade, as well as for our other small UAS products. We're also engaged with multiple countries in our Medium UAS JUMP 20 systems internationally. I'm not able to comment specifically on the number of customers and company countries, primarily because of the sensitivity of those countries and customers of disclosure. But what I can tell you is that the portfolio of those customers is growing, the demand is healthy, and I expect that to even grow further in the coming months.\n\nMajority of those engagements are through the US government and FMS cases. But there is also multiple activities and even unfunded contracts on a DCS basis, which is reflected on our unfunded backlog, which is separate from the $307 million that I mentioned earlier. Although we are more bullish on FMS cases for Switchblade than DCS because US government, I believe, generally prefers for this type of loitering munitions to be procured and provided to our allies through FMS cases. Although we have a letter authorizing it for both DCS and FMS, but we feel more optimistic on the FMS sales in general. \n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nOK. That's helpful. And then, of the customers that are looking at the JUMP 20 and Medium UAS, how many are looking at buying that kit and bundling it with some Switchblade 300 just given that you can fire those off the wings?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nSo we have actually demonstrated that capability. Several customers are interested in them. We are actively engaged in those discussions. The number, again, is sensitive to our customers, but I expect long term in the next two to three years that multiple of our existing Switchblade customers would be highly interested in both our Vapor helicopter, as well as our medium JUMP 20 UAS to be equipped with Switchblade, multiple Switchblades, which we have demonstrated both in live demonstrations in real life.\n\nSo I think that not only Switchblade will be successful and grow as its own product line, and similarly, our medium UAS evidence of -- one of the major evidences the Army program, but other platforms and enabling our medium UAS and other platforms with Switchblade become more and more common in the industry over the years to come.\n\nOperator\n\n[Operator instructions] The next question we have is coming from Louie DiPalma of William Blair. Please go ahead.\n\nLouie DiPalma -- William Blair and Company -- Analyst\n\nWahid, Kevin and Jonah, good afternoon. Has the contract that has been discussed widely in the media for AeroVironment to manufacture and ship 10 Switchblade 600 to Ukraine, has that contract closed yet? And was that responsible for a portion of the increase in backlog during the month of August?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nLouie, I am not in a position to be able to, again, comment on specific contracts due to the customer sensitivity. What I can tell you is that for Switchblade 600 specifically, we have several, several engagements and contract activities that are near signage or award with the US DoD. They're both for Ukraine, as well as some other allies besides Ukraine. And also, a portion of that unfunded backlog that we have is also specifically related to Switchblade 600 when the DCS sales for one of our allies.\n\nAnd so, again, but I'm more optimistic on FMS sales of Switchblade in general than DCS, although we remain engaged on both fronts with our customers and the pipeline for both Switchblade 300 and 600 looks quite healthy and growing.\n\nLouie DiPalma -- William Blair and Company -- Analyst\n\nAnd you were successful with the FTUAS Increment 1. And can you remind us how does that win position AeroVironment for that ultimate $1 billion program of record? And how does Increment 2 fit into the mix with the program of record?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nSure. So Louie, the way that the US Army has so far described and plans to award the future tactical UAS program is as follows. Increment 1 is really critical and was critical for us and for anybody who wins it because it is the first set of air vehicles and systems, where the US Army is going to buy them and provide them to an operating combat brigade. So one combat brigade within the US Army is going to receive a system, and they are going to take that system and basically operate them.\n\nThe intent there is to inform the US Army program office of any additional enhancements, improvements or changes to the platform if they see any or to make sure that what they have so far selected is what the operators and users really want and need for their missions. Additionally, in Increment 2, the US Army plans to add additional improvements or enhancements to the performance requirements of the competition, which we are very well aware of. And our goal is to meet those additional expectations ahead of the customers' acquisition process. And so, the reason why Increment 1 is so critical is that whoever gets Increment 1 award.\n\nA, they get to field systems with the users. And B, are in a much better position than all the other competitors to benefit and be ahead of competition in terms of competing for Increment 2, although Increment 2 will be an open competition. But that will give us an advantage because, so far, according to the US Army, we are the only awardee for Increment 1, and they are proceeding with us only at this time. And based on our engagements with them, they're very happy and satisfied with our systems performance, and they look forward to fielding these systems and working with us to improve and deliver more capability to the military.\n\nAnd so, once Increment 2 gets awarded, that becomes the official program of record, which is expected to be about $1 billion in the budget process and as part of the acquisition planning process within the US Pentagon and US Army.\n\nLouie DiPalma -- William Blair and Company -- Analyst\n\nGreat. And do you expect that $1 billion to be allocated just to one vendor? Or is it expected to be like multi-company?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nThat's a great question, Louie. It is not common for the US Army for such set of capabilities, whether it's a group two/three UAV, or a weapon system or another asset that the soldiers or the combat brigades carry for them to actually have multiple options or multiple choices. Because then you force structure, you have to deploy these systems and train the force structure based on more than one set of capabilities. So although the US Army hasn't said definitively that they plan on awarding to 1, that is their plan today, OK? Could that change? Possibly.\n\nIs it likely? In my view, the likelihood is low. And primarily, the reason I think the likelihood is low is because the way that the US military and Army operates and trains and does its training, document and supply maintenance and support structure, for having two separate systems for this -- and a given combat brigade will make it extremely difficult, if not impossible, to practically implement.\n\nLouie DiPalma -- William Blair and Company -- Analyst\n\nRight. One final question if I may. Are you able to -- I know it's -- this is very -- it might be premature. But are you able to discuss your partnership with Northrop Grumman for the Jackal Switchblade variant that they showcased at the Special Operations Forces conference?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nYeah, I can't comment on that, and we are certainly partnered with Northrop Grumman for a very specific US Army opportunity that's referred to as LRPM, long-range precision munitions, and it's essentially the US Army's version of a Switchblade capability that can be deployed and equipped the US Army military with. That is a very large program which both Northrop and AeroVironment feel that we have a very compelling solution that we should compete and go forward with. So what you saw at that conference, the SOCOM, was where Northrop actually demoed -- displayed the first prototype of the Jackal loitering munition system in public. We are engaged with them.\n\nWe're very pleased with that partnership. We're making very good progress, and we intend to compete there. And the reason why this is important is because this is another example of how we believe the adoption of loitering munition is going to keep getting more and more momentum, not in the US DoD, but also with majority, if not all of our allies in the next decade. And we're very, very fortunate and pleased to be in a position that we are as the leading provider with a demonstrated, validated, field proven capability that is already fielded by the thousands.\n\nAnd that gives us a significant advantage in the marketplace to be able to capitalize on those opportunities going forward.\n\nLouie DiPalma -- William Blair and Company -- Analyst\n\nAwesome. Thanks.\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nYou're welcome, Louie.\n\nOperator\n\nOur next question will be coming from Brian Ruttenbur of Imperial Capital. \n\nBrian Ruttenbur -- Imperial Capital\n\nYeah. Thank you very much. A couple of quick questions. First of all, back to supply chain.\n\nWhat we're hearing is the supply chain from a number of companies is at least visibly starting to get better, that six to nine months, things should be dramatically improved from where they are now. I know you made a comment about supply chain still having -- that you're still having issues there. Can you comment about what you're seeing in the next couple of quarters in terms of visibility on the supply chain?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nBrian, the supply chain situation really is extremely dynamic and changes literally on a daily basis. Since we are a prime system contractor and provider of a system solution to our customer, we deal with a variety of different products, not just one set of specific electronics or that. We buy composite material, motors, semiconductors, microprocessors, lenses, gimbal cameras, etc., etc., so battery packs, battery systems, etc. So our needs is pretty broad, and our portfolio is pretty wide and large as well.\n\nSo the profile of supply chain constraint changes on every one of those categories on a very, very fast-paced basis, no. 1. No. 2, as I mentioned in my remarks, we have received authorization from the Pentagon, US Department of Commerce and Department of Defense, a authorization that allows us to go with our suppliers and place at-risk orders ahead of actual US government contract signed for the demand that the US DoD is forecasting for Ukraine and for the US DoD at a DO priority rating level.\n\nThat is a very difficult authorization, which is to my knowledge almost unprecedented. But the US DoD has given us that authorization, and we're engaged already the last two months with our suppliers on all of our at-risk orders and non-at-risk orders to be able to secure that. So while I cannot give you a very clear picture, we see improvements in some areas, but we also see some areas that are stagnant. And I would say that the two areas that are still of the highest need for us is some semiconductors and processors that go into the Switchblade systems, as well as a critical sort of components that go into the Switchblade warhead.\n\nAnd we're working those, as I said, from many, many different angles. But it is a -- and Department of Defense, the office of the Secretary of Defense for sustainment and acquisition is directly engaged with us on a weekly basis, is working and actively making phone calls with us and reaching out our suppliers to try to solve this. And that has been very helpful, but it's still not sufficient to be able to give us a 100% confidence yet. But we feel pretty good about our position and ability to be able to deliver on our expectations this year.\n\nBrian Ruttenbur -- Imperial Capital\n\nRight. And as a bolt-on to that, just as a follow-up, gross margins, you said, are going to be flat to slightly up. Is that because of the supply chain? Or is that because of the rising cost and you price a lot of your deliverables years in advance and prices are rising? Is it a combination of those two factors? Or is it one versus the other?\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nThat's accurate, Brian. It is basically a combination of both. So we expect the gross margins for the full year to be at or slightly above last fiscal year's gross margins, and the reason why it's going to be up is because the mix of our products revenues changed favorably to more hardware sales and product sales versus services and also a heavier dose of international sales versus domestic sales, which also gives us a better margin profile. Now, that is offset, to some extent, by some increases in supply chain constrained costs and expenses, expediting of parts, some material cost because of the macroeconomic levels, the pricing increases, etc., etc.\n\nNow, having said all that, we have already taken some active steps to adjust our prices where we can, which we can -- in many, many cases, we can. But the effect of that is not immediate. We always work with our customers to make sure we plan with their budgets accordingly and what they have put in their budgets. So we do not want to surprise them at the last minute, and we are working with them to make sure that they can accommodate those and we can justify those increases as time moves forward.\n\nSo that's the reason why I think for this fiscal year, it will be either at or slightly above and hopefully even better next year.\n\nBrian Ruttenbur -- Imperial Capital\n\nThank you.\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJonah Teeter-Balin -- Senior Director, Corporate Development and Investor Relations\n\nWahid Nawabi -- Chairman, President, and Chief Executive Officer\n\nKevin McDonnell -- Senior Vice President and Chief Financial Officer\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nPeter Arment -- Baird -- Analyst\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nLouie DiPalma -- William Blair and Company -- Analyst\n\nBrian Ruttenbur -- Imperial Capital\n\nMore AVAV analysis\n\nAll earnings call transcripts"
}