{
  "companyName": "Sea Limited",
  "companyTicker": "SE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/15/sea-limited-se-q3-2022-earnings-call-transcript/",
  "content": "Sea Limited (SE -1.48%)\nQ3 2022 Earnings Call\nNov 15, 2022, 7:30 a.m. ET\n\nOperator\n\nGood morning, and good evening. Welcome to the Sea Limited third quarter 2022 results conference call. [Operator instructions] I'd now like to turn the conference over to Ms. Minju Song.\n\nPlease go ahead.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you. Hello, everyone, and welcome to Sea's 2022 third quarter earnings conference call. I'm Minju Song from Sea's group chief corporate officer's office. Before we continue, I would like to remind you that we may make forward-looking statements, which are inherently subject to risks and uncertainties and may not be realized in the future for various reasons, as stated in our press release.\n\nAlso, this call includes a discussion of certain non-GAAP financial measures, such as adjusted EBITDA and net loss excluding share-based compensation. We believe these measures can enhance our investors' understanding of the actual cash flows of our major businesses when used as a complement to our GAAP disclosures. For a discussion of the use of non-GAAP financial measures and reconciliation with the closest GAAP measures, please refer to the section on non-GAAP financial measures in our press release. I have with me Sea's chairman and group chief executive officer, Forrest Li; group chief financial officer, Tony Hou; and group chief corporate officer, Yanjun Wang.\n\nOur management will share strategy and business updates, operating highlights, and financial performance for the third quarter of 2022. This will be followed by a Q&A session in which we welcome any questions you have. With that, let me turn the call over to Forrest.\n\nForrest Li -- Chairman, Group Chief Executive Officer\n\nHello, everyone, and thank you for joining us today. We recently passed our five-year IPO anniversary. The rest of the management team and I have learned a lot from running Sea as a public company, a journey that has seen deep high and lows. I'm grateful for the support and advice all of you have given us over the years, and thank you for your patience and faith in us.\n\nGiven the significant uncertainties in the macro environment, we have entirely shifted our mindset and focus from growth, to achieving self-sufficiency and profitability as soon as possible without relying on any external funding. We are adapting quickly to the changing climate because we believe that companies that fail to do so may not survive. All our efforts are directed to ensure that Sea not only survives the macro storms, but emerge stronger, more efficient, and more resilient, and as a long-term winner in our markets. This positions us to continue capturing the long-term potential for our businesses and markets and to deliver strong and sustained shareholder returns over time.\n\nOver the last quarter, we took decisive actions to improve margins and set clear goals and priorities for the quarters to come. In addition, to emphasize our commitment to the stated goal, I announced in mid-September that the management team will stop receiving cash compensation until we achieve self-sufficiency. To share more color on our plan to achieve self-sufficiency, I would like to discuss our current view of a few financial metrics at the group level that we believe may have relatively important effects on our bottom line and cash position. First, our adjusted EBITDA.\n\nOur group total adjusted EBITDA improved by 29% quarter on quarter. This meaningful improvement was a result of better profitability from both our e-commerce and our digital financial services businesses. I will discuss this in greater detail later. Second, capital expenditure.\n\nHistorically, our capex has mainly related to servers, office space-related spending, as well as logistics-related real asset and equipment. In the third quarter, our group capex was $232 million, consisting mainly of servers and logistics-related spending. This may fluctuate from period to period due to the nature of the expense. For example, during some earlier periods, we committed to a heightened level of investment in our server capacity.\n\nThis was done in anticipation of future business needs, while considering potential delays in several procurement due to the supply chain disruptions earlier. These earlier commitments were partly reflected in our capex for the third quarter and may continue to impact our financials for the coming quarters. However, in line with our current focus, we have taken strong measures to tighten our capex budget, and we'll manage it with a strong focus on efficiency and investment returns over the long run. Another metric that may cause fluctuations in our cash flow from period to period is changes in working capital.\n\nThis may continue to fluctuate due to many factors, such as timing of billing and payment collection cycles. However, in the long run, the direction is also clear for us to focus on improving working capital management. Last, but not least, it goes without saying that we are very focused on our cash position. As at the end of the third quarter, cash, cash equivalents, and short-term investments was $7.3 billion, representing a net reduction of $485 million from the end of the second quarter.\n\nWe aim to continue to maintain a net cash position after budgeting for the full retirement in cash of outstanding convertible bonds and assuming no external funding. I'm confident in our ability to execute well against our stated goals, as we have demonstrated so many times in the past. Let me now take a moment to talk about some of the specific steps we have taken to improve our bottom line. We have completely overhauled our budgeting practice to consistently and comprehensively review our spending.\n\nAcross all businesses and markets, we reviewed and reduced high count, decreased existing spending and future investment commitments on office space and logistics facilities, and tightened travel and entertainment policies. On top of that, we improved procurement policies and procedures, reduced the spending on computer hardware, and stopped all new financial equity investments. We have also accelerated cost-saving initiatives in our business operations. For example, at Shopee, we have meaningfully scaled back marketing expenses, especially around shipping subsidies.\n\nAt Garena, we are now focused on running our existing key franchises as efficiently as possible and are taking a more selective approach to developing and launching new games to prioritize the highest potential titles in our pipeline. Finally, at SeaMoney, we have deprioritized offline adoption of ShopeePay and further diversifying funding for our credit business across multiple sources. Our current initiatives are designed to further quantify our leading positions and enable us to continue to win in our key markets over the long run. In the coming quarters, we will continue to focus on improving key financial metrics for the long-term health of our business.\n\nWhile our results may fluctuate and affected by the macro environment and many other factors, we are currently working toward adjusted EBITDA breakeven for Shopee overall by the end of 2023. We believe our strong focus on cash flow and achieving self-sufficiency as much as possible is the right strategy to pursue at this stage, even though we may see no growth or even negative growth in certain operating metrics in the near term. To be very clear, we remain highly confident about the compelling long-term growth prospects of our businesses and the market. Once we achieve self-sufficiency, we will be in a position to decide to reaccelerate growth again in a much more efficient and a long-term sustainable manner.\n\nLet's now discuss each business segment in detail. Beginning with e-commerce. We made significant progress in narrowing Shopee's losses across all regions, despite headwinds from ongoing macro uncertainties and reopening trends. Adjusted EBITDA loss in the third quarter was $496 million, improving quarter on quarter by 24%.\n\nThis was driven by strong top-line growth, particularly in core marketplace revenue and meaningful efficiency improvements in operating costs across our markets. These improvements were partially offset by severance and early lease termination-related costs and increases in HQ costs, such as a shared R&D staffing and shared server hosting expenses. As we began more focused efforts on optimizing HQ costs, including R&D costs from the later part of the third quarter, we expect savings on share costs to start to show in the following quarters. GAAP revenue in the third quarter was $1.9 billion.\n\nThis includes around $1 billion of core marketplace revenue, mainly consisting of transaction-based fees and advertising revenue and, therefore, offering higher margins. The core marketplace revenue increased by 54% year on year, contributing meaningfully to the improvement in monetization and overall profitability. We aim to continue to create more value for our sellers and buyers and expect monetization to positively correlate to their satisfaction over time. As mentioned, we also further optimized the cost during the quarter with a positive effect on our bottom line.\n\nFor example, Shopee's GAAP sales and marketing expenses in the third quarter decreased by 15% quarter on quarter as we adjusted our free shipping offerings across several markets. These initiatives have accelerated Shopee's path toward profitability. During the quarter, our Asian market recorded an adjusted EBITDA loss of $217 million, improving by 31% quarter on quarter as a result of profitability improvement across all markets in the region. Additionally, the region combined recorded a positive contribution margin, in line with our previously shared expectations.\n\nAt the individual market level, we recorded positive contribution margins for most of our Asian markets, including our largest market, Indonesia. Furthermore, Malaysia and Taiwan recorded positive adjusted EBITDA. While our other markets combined, our adjusted EBITDA loss was $279 million, improving by 16% quarter on quarter as a result of increased monetization and cost savings. In Brazil, we saw continued improvement in unit economics with adjusted EBITDA loss per order before allocation of HQ costs at $1.03, an improvement of roughly $0.40 from the previous quarter.\n\nMeanwhile, GAAP revenue grew by over 225% year on year. We will continue to invest in the exciting opportunities we see in our Brazil market. I recently spent time in the country, meeting with local sellers and buyers. And I was reminded once again of Shopee Brazil's strong and clear value proposition in empowering its local community.\n\nThis drives a strong and clear business case to continue to invest prudently in that market. Of course, every investment will be made with a discipline and a strong focus on continued efficiency improvements to reach profitability. Overall, as we pivoted toward focus on monetization and profitability, we have continued to see healthy buyer and seller engagement across our platform. We believe this reflects the value we deliver to our communities.\n\nIn the third quarter, we observed solid retention rates for our active buyers and maintained our average order frequency and time spent for active user at a stable level compared to the previous quarter. The number of brands on Shopee Mall also continued to grow strongly by 36% year on year to over 42,000, reflecting more brands recognizing the value Shopee brings to them. Importantly, we are always looking to further improve the services we offer our sellers and provide a superior shopping experience for our buyers. We want to make sure that incremental monetization is well justified by additional value we continue to create and deliver in our ecosystem.\n\nOver the past few quarters, we have enhanced the efficiency and the predictability of our delivery, improved the complaint resolution rate of automated customer services, and reduced respond resolution time. Our sellers are now enjoying more features to help them navigate our ecosystem more easily and increase their sales. For example, they have access to pricing recommendations if their item prices are detected as noncompetitive and have self-service access to our many performance enhancement programs and business management tools. Moving on to digital entertainment.\n\nGarena continues to be impacted by reopening trends, especially as our gamers return to fully reopened school and work post-pandemic. At the same time, we are faced with rising global macro uncertainties. We believe this continues to impact consumer discretionary spending, including in games. These headwinds has resulted in weaker engagement and user trends in the third quarter.\n\nDuring the quarter, GAAP revenue was $893 million and bookings was $665 million. Garena's quarterly active users reached 568 million with 52 million quarterly paying users. Our paying user ratio and ARPU remained stable quarter on quarter. We experienced ongoing moderation in engagement and monetization.\n\nStill relatively to the industry overall, Free Fire performance remains robust. We are also pleased that Arena of Valor delivered solid growth in active users and bookings for the third quarter. It has been encouraging to see the game's resurgence once again and the strong support from a resilient core user base. Its performance in the past six years since launch is in line with our view that strong operations can have meaningful positive effect on the game and that a strong mobile game can be built into a long-term franchise with multiple peaks.\n\nFor Garena overall, with the worsening macro environment and reopenings having a continuing impact on our markets, we now expect bookings for the full year of 2022 to be between $2.6 billion and $2.8 billion. Looking ahead, we will focus on stabilizing our large existing franchises, while selectively launching new games and investing in our pipeline with greater discipline and a stronger focus on efficiency and returns. At the same time, we will be strengthening our organization and carefully optimizing our spending through more efficient marketing and content investments. Finally, moving on to our digital financial services business.\n\nIn the third quarter, SeaMoney's GAAP revenue reached $327 million, up 147% year on year. At the same time, adjusted EBITDA loss decreased by 57% year on year to $68 million. The improvement was predominantly driven by more targeted sales and marketing spending for the mobile wallet business, and our credit business maintaining its healthy profitability while generating cash for the group. With the growing volatility across our markets, we are closely monitoring the health of our credit business and our loan book.\n\nAs of the end of the third quarter, our loan book stood at $2.0 billion, net of allowance for credit losses of $253 million. Nonperforming loans past due by more than 90 days, represented less than 4% of our total gross loans receivable. And the weighted average tenure of loans outstanding was about four months. We will continue to focus on improving the quality of our underwriting, optimizing risk controls and user experience, diversifying our sources of funding for the credit business and improving the quality of our other digital financial offerings to users.\n\nIn closing, while we have demonstrated our strong execution and ability to scale rapidly in the right market and macro environment, we believe we are also able to adapt to the current conditions swiftly and demonstrate our ability to manage toward profitability. The cadence of bottom line and cash flow improvements may vary quarter to quarter, but we are confident that we are becoming a more resilient and efficient business in a better position to capture the long-term opportunities for testing our markets. With that, I will invite Tony to discuss our financials.\n\nTony Hou -- Group Chief Financial Officer\n\nThank you, Forrest, and thanks to everyone for joining the call. We have included detailed financial schedules today together with the corresponding management analysis in today's press release. And Forrest has discussed some of our financial highlights, so I will focus my comments on the other relevant metrics. For Sea overall, total GAAP revenue increased 17% year on year to $3.2 billion.\n\nThis was mainly driven by the increased monetization of our e-commerce business and the growth of our credit business. On e-commerce, our third quarter GAAP revenue of $1.9 million included GAAP marketplace revenue of $1.6 billion, up 39% year on year, and GAAP product revenue of $0.3 billion, up 3% year on year. Within GAAP marketplace revenue, core marketplace revenue, mainly consisting of transaction-based fees and advertising revenues, was $1 billion, whereas value-added service revenue, mainly consisting of revenues related to logistic services, was $0.6 billion. E-commerce adjusted EBITDA loss was $496 million, as we continue to improve on monetization by creating more value for our users and further optimize on cost efficiency.\n\nDigital entertainment bookings were $665 million, and GAAP revenue was $893 million for the third quarter of 2022. Adjusted EBITDA was $290 million. We continued to experience ongoing moderation in engagement and monetization with the reopening trends and uncertain macro environment. Digital financial services GAAP revenue was $327 million, an increase of 147% year on year from $132 million in the third quarter of 2021.\n\nAdjusted EBITDA loss was $68 million compared to $159 million for the third quarter of 2021. We recognized a net nonoperating loss of $9 million in the third quarter of 2022 compared to a net nonoperating loss of $13 million in the third quarter of 2021. We had a net income tax expense of $65 million in the third quarter of 2022, which was primarily due to corporate income tax and withholding tax expenses. As a result, net loss, excluding share-based compensation, was $374 million in the third quarter of 2022 as compared to $448 million for the same period in 2021.\n\nAt the end of the third quarter of 2022, we had $7.3 billion of cash, cash equivalents and short-term investments on our balance sheet. With that, let me turn the call to Minju.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, Forrest and Tony. We are now ready to open the call for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from Pang Vitt from Goldman Sachs. Please go ahead.\n\nPang Vittayaamnuaykoon -- Goldman Sachs -- Analyst\n\nThank you very much for the opportunity. Good afternoon, all the management here. Two questions from my side. Firstly, on Shopee.\n\nAs you're now expecting Shopee breakeven by end of next year, can you provide a bridge from the current EBITDA loss to your breakeven target? How do you plan to get there? What is the biggest driver here, revenue increase or cost cut? And what kind of top-line growth do you expect are you building to sacrifice market share if your competitor doesn't follow suit? And second one on gaming. Have you seen any sign of stabilization for Free Fire? And at the same time, we have seen news of the termination of partnership with Riot Games as well. How does it mean for your publishing business going forward? And is there any implication for the Rover agreement with Tencent?\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, Pang. Regarding the e-commerce breakeven timing, as we shared, of course, these are the goals that we are working toward while taking into account the macro environment and fluctuations in results and the factors beyond any of our control. But overall, I think the trend, as indicated in our third quarter results, has been that we are both improving on the top line and also on the cost efficiency side. So, on the top line side, as we disclosed, we've increased our take rate, in particular the core marketplace revenue.\n\nAnd also on the cost side, we have tightened our expenses related to sales and marketing especially around logistics. This is not just for reducing logistic subsidies but overall improving logistics costs for the entire ecosystem. Such as on an order basis, logistics cost continue to decrease. And that's a very clear direction to continue to work toward.\n\nAt the same time, we also, at the company level, focused more on overhead and other costs and purchase of the procurements, etc. So, this is coming from all directions. And in terms of the drivers, we continue to believe that when we continue positive trends on both the monetization front but also the efficiency and cost improvement front. Some of these savings probably came at later this quarter and will continue to show in the following quarters.\n\nAnd in terms of the, you know, impact on market share, etc., I think from what we have so far observed in the market, we continue to maintain our strong market leadership, and our peers also have behaved in a relatively rational manner. Now, a lot of these is not individual to us. But generally, we are responding to the macro trends and environment that we believe is the right thing to do for us. And so, we will try to, at this point, continue to focus on improving our cost efficiency and improving our financial metrics health for the long-term success of the company.\n\nAs we also shared, in our view, there's -- while there are near-term headwinds from the macro developments, our view and confidence in our market's long-term growth potential remain as strong as before, given the positive demographic trends and low penetration in all markets. And therefore, whatever we are doing now is still to best position us to be a long-term winner in these markets and in all businesses. In terms of Free Fire, we continue to see headwinds impacting our user number and engagement, as well as monetization, which is reflected not only in our third quarter results, but also reflected in our revised guidance for the full year. Of course, our efforts continue to focus on engaging with our user base and provide the best content and community engagement to Free Fire, which remains to be the biggest franchise in our portfolio.\n\nIn terms of publishing, as we always shared before, we focus both on game development and publishing as two key contributors of our game business. And the recent termination of the, as we announced, legal merchant partnership with Riot as a result of the expiry of agreement would have no impact on our overall publishing business, as the contribution is immaterial from the particular game. We celebrated the 10-year partnership we have with Riot, and we think it's a very fruitful partnership and success for both our -- both partners. And we also look to continue to work with top game developers around the world to strengthen our publishing pipeline.\n\nAlso, this decision is a right decision and has no relationship to anything regarding the right of first refusal agreement we have Tencent.\n\nOperator\n\nThe next question comes from Alicia Yap from Citigroup. Please go ahead.\n\nAlicia Yap -- Citi -- Analyst\n\nHi. Thank you. Good evening, management. Thanks for taking my questions.\n\nI have two questions. First is do you expect any headwinds on the core marketplace revenue, given the challenging macro environment? So, will brands and merchants actually cut back the spending on advertising on Shopee? And then, secondly, on the sustainable long-term level, once Shopee reached EBITDA profit, what could be the margin profile, the rough margin range that we should expect the Shopee business can be? And then, just lastly, on the Brazil and Latam, will you further scale back on other countries and then, near term, only focus on Brazil going -- I mean, for the near term? Thank you.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, Alicia. In terms of the -- any headwinds for marketplace revenues, so far, as we increase the take rates across various service offerings and the sellers adopt more of our programs and pay higher advertisement and also some of the opting programs to Shopee, we continue to see sellers' response to remain positive, and they continue to invest in the platform. As we shared before, that our focus is on delivering more value to the sellers and our buyers so that they continue to grow their business in a healthy and profitable manner on the platform and be -- they charge the partnership with Shopee. Now, of course, we are mindful of the potential macro headwinds that might, over time, more deeply affect our region and the market as a whole.\n\nAnd this might affect, for example, people's purchase power, discretionary spending, and, to the point, might also have a more pronounced effect on our platform and overall e-commerce in the region. When that happens, that could have an impact -- negative impact also on our ability to monetize. So, that is something that we are mindful of, and we're doing everything that we can to help our sellers improve their service offerings to the buyers. Eventually, I think our success depends on our -- the success of our sellers and our buyers' enjoyment of the services and the goods we partner with our sellers to offer to our buyers.\n\nIn terms of the margins for Shopee, as we shared, there are main two components in our marketplace revenue, once the core marketplace revenue, the other is value-added services. Within core marketplace, revenue is mainly transaction-based fees and advertisement. We believe the margin for this portion of the revenue in the long-term steady state could potentially be more in line with what you would normally see for a pure play marketplace type of business model. For value-added services, that mainly consists of logistics services, including logistics services, which is mostly last-mile logistics that we provide the first-party and also third-party services that we provided on our platform that are -- we make as a result of our service business model to our sellers and buyers to improve the user experience.\n\nAnd as a result of that, from a GAAP accounting perspective, we do recognize that revenue on both basis. Now, because of this revenue is mostly related to logistics services, these will be more reflected of potentially logistic services type of margin in the long run. And our focus is continuing to improve the cost efficiency of logistics services for our ecosystem as a whole, whether through our own first-party provider services or our partnership with all the third-party logistics providers to overall reduce the cost and provide a better, higher-quality service to our users. In terms of our other growth markets, as we shared earlier, that we believe, Brazil is -- continues to be a very important growth market for us, as we see very clear value proposition Shopee is offering to the local communities.\n\nAnd we will continue to invest in the market with a strong focus on returns and efficiency. We also continue to have presence from a cross-border perspective in the remaining Latam market. At this point, we have no plan to further -- make further changes to the current approach.\n\nOperator\n\nThe next question comes from Thomas Chong from Jefferies. Please go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\nHi. Good evening. Thanks, management, for taking my questions. My first question is on Shopee as well.\n\nGiven that on a constant currency basis, the GMV is actually going at 21% on a year-on-year basis. I just wanted to get some color from management. How should we think about the GMV outlook in coming quarters or 2023? And given that the online penetration is still low, so I just want to get some color for management, the long-term perspective on the GMV side. And my second question is about the online game as well.\n\nI think we talked about Free Fire. I just want to get management some thoughts with regard to our game pipeline. Should we expect there would be more new games to be released in 2023? Thank you.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, Thomas. Regarding the GMV growth, as we shared before, and at this point, our focus is very clearly on improving monetization and to achieve self-sufficiency. So, GMV growth will be output until we get to that point. And then, we can reassess our situation and see what's the best path forward.\n\nAs I shared also, our long-term prospects or the long-term prospects of the market is unchanged. In the short term, there will be a lot of factors, including macro environment, inflation, forex, and, you know, the continued reopening trends, as well as, you know, tough comparisons during COVID and our own focus on efficiency, cost management, and improving monetization of the platform. So, there could be impact on the -- some of the top-line growth in operating metrics. There could be no growth or negative growth, and we can accept that.\n\nBut on the other hand, as we shared, our long-term view is we want to emerge as the strongest winner in this market. In terms of the game pipeline, we do have games in our pipeline on self-development as well as publishing. And as usual, we don't discuss specific games that we haven't announced for launch yet, but there are always things that we are working to.\n\nOperator\n\nOur next question comes from Piyush Choudhary from HSBC. Please go ahead.\n\nPiyush Choudhary -- HSBC -- Analyst\n\nYes. Hi. Thanks a lot for the opportunity, and two questions from my side. Firstly, on Garena, could you share a bit of light on what factors are attributing to this change in guidance? Because your bookings stood at around 2.2 billion in nine months, while your lower end of the guidance is 2.6, implying almost 40% drop in bookings quarter on quarter.\n\nSo, can we understand what could drive such higher slowdown in bookings in fourth quarter versus third quarter? That is first. Secondly, your net change in cash position was around 485 million in third quarter. Can you give us a breakup of how much was used in cash capex, how much was due to change in working capital, and how much was due to lending, you know, fund used in lending? Thank you.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, Piyush, in terms of the gain guidance that we shared, we continue to see headwinds impacting our markets from both the macro environment, in particular, inflation affecting discretionary spending, including spending on games, as well as forex. And overall weakness, I think that's also impacting game industry as a whole. So, while we're working on user engagement and the quality of our games, we also want to give a more reasonable, you know, picture based on the information that we have now regarding our outlook for the fourth quarter. I think this is something that we continue to observe.\n\nAnd the direction is clear. But on the other hand, there are many factors beyond our control. In terms of the cash flow for the improvement, as we shared, it's driven mostly by the EBITDA improvement across our e-commerce and digital financial services businesses as a result of better monetization, as well as cost efficiency improvement. In terms of capex and working capital, they fluctuate.\n\nBoth may fluctuate from quarter to quarter, as we shared earlier, for many reasons. For example, on the capex side, for us, historically, these are many office buildings, servers, and logistics-related leases and machineries, etc. On the office side, I think we are continuing to manage our headcount that will also reduce the office lease required for our employees and to reduce also renovations going forward. That also reduces the computer hardware that we might need for employees.\n\nIn terms of the servers, as we shared, we are tightening our budget for servers and try to more closely project the numbers based on our business needs. Previously, we did have tightened spendings on servers and in line with our projection of future business growth, but also to take into account the previous supply chain disruption globally that affected sort of procurement timetable. So, some of that impact might affect us in the coming quarters as well. And when exactly that might hit is not certain yet because that depends on delivery timing, sale timing, etc.\n\nSo, similar things for working capital. Overall, it doesn't have -- overall, a very significant impact on our cash flow, as we shared. EBITDA is a major component of that. But the working capital -- changes in working capital can have fluctuations from time to time, again, based on billing and payment cycles, etc.\n\nBut we will -- in the long run, however, this is something that we continue to focus on to improve our working capital. So, something that both the capex and working capital is something that we control and focus on the long run. But we think, quarter-on-quarter analysis, it might not be too relevant. In terms of the lending business, as we shared, we have about 2.4 billion of gross loan book and more than $200 million of provisions for losses, credit losses.\n\nSo, that represents about a little bit more than 10% of our gross loan book outstanding. And 90-day past due is around 4% and with our tenure for outstanding loan book is around four months. So, overall, that gives you a sense of how much that is included. And also, in the G&A expenses discussion of our earnings release, we did also break out and talk specifically about the credit loss in terms of P&L impact, so you can track that as well.\n\nOperator\n\nThe next question comes from Jiong Shao from Barclays. Please go ahead.\n\nJiong Shao -- Barclays -- Analyst\n\nThank you very much for taking my question. I have two follow-up questions around your e-commerce business. For the EBITDA loss for Q3, you talked about the one-off severance costs and the early termination of the leases costs. Would you be able to quantify that impact for Q3 and how we should think about that for the current fourth quarter? The second follow-up question is competition.\n\nThere seems to be a deceleration in recent quarters and the month. And you talked about the macro. You talked about the sort of cost-cutting initiatives. I was wondering if you could potentially talk about competition impact, if any, from a particular competitor.\n\nIt seems that the one particular competitor has been particularly aggressive in the regions. Thank you very much.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, John. In terms of the severance and early termination, lease termination expenses, we did disclose that at a group level. That's about $77 million. Most of that is attributable to e-commerce related, so you can get a rough sense of the size.\n\nIn terms of the competition, I think as we continue to track our peers as well in this region, we believe our progressive leading position has been maintained in the third quarter. Of course, we take competition very seriously, and we make sure that our service offerings remain competitive. And our monetization take rate is well justified by the value, additional value offering to our buyers and sellers in line with the overall market movement.\n\nOperator\n\nThe next question comes from Venugopal Garre from Bernstein. Please go ahead.\n\nVenugopal Garre -- AllianceBernstein -- Analyst\n\nHi. Thanks a lot for the opportunity. So, two questions from me. Firstly, given all the news flow that we have seen on cost actions taken, could you just highlight to us how are employee headcount looks like at the end of Quarter 3 versus what it was, let's say, in Q2 and of Q1 end? And more importantly, what kind of overall quantum of cost we've been able to sort of take out from the system? And how much of it, you know, is yet to reflect in our overall numbers? That's the first question.\n\nMy second question is more related to the investments. Given the sort of cost focus now, especially the couple of areas, one is digi bank side of things. I just wanted to understand how a rollout plan is shaping up in Singapore and if it could lead to any cost increases near term? And secondly, on Shopee Express, how does the focus on costs sort of lead to any shift in strategy toward that because that also requires quite a bit of investments going forward? Thanks.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you. Regarding the employee headcount of the management of we -- the way we approach it is not a top-down or targeting a sort of percentage of employee kind of exercise. The way we approach it is more of an initiative-by-initiative, function-by-function, unit-by-unit, project-by-project assessment to look at what is the right amount of resources we might need for our intermediate business needs, as well as the ongoing business, projected business needs, and what we want to prioritize on and what we might deprioritize. So, the recent headcount management is mostly related to market assets, deprioritization of certain business initiatives, for example, as we mentioned, the offline payment initiative, and then also rightsizing in different functions and teams to make sure we have a strong organization and run efficiently.\n\nThis is an ongoing exercise is also continuing -- will have -- as a result, you know, we may continue to have some of the severance costs associated with over the quarters because some of these started in the late part of the third quarter and going to the fourth quarter. And the cost savings also will show in the following quarters. But again, our view is that in the long run, the cost savings is more on having a more efficient organization, having a better culture to run things efficiently and focus on returns on investments, and having a better discipline to running the entire organization in terms of resource allocation and investment into future business initiatives and projects, as opposed to the specific numbers that you might hear from quarter to quarter. In terms of our investments in digital banks, I think at this stage, we are still in a very nascent stage.\n\nAnd we have started some pilot programs for the MariBank in Singapore, opening up limited features to employees. We work very closely with our regulators to make sure that things are going well according to plan. On the other hand, it's a long-term initiative. We do not expect any immediate significant ramp-up in costs related to that.\n\nIn terms of eco-logistics, in terms of -- for Shopee Express, this is a last-mile delivery services. So, most of the expenses on that front is more related to staff and vehicle rentals, and then some pieces of hubs, the last mile hubs, that we want to place those pretty close to our buyers, where our buyers are. So, these are more opex kind of expenses that we can ramp up and down in line with the business volume relatively swiftly as opposed to long-term significant pay tax. So, the way we want to run it and to ensure that Shopee Express continue to remain very competitive and overall reduce the cost of delivery for our buyers and work very closely also with other third-party service providers to continue to reduce cost and improve delivery quality and efficiency.\n\nOperator\n\nThe next question comes from Ranjan Sharma from J.P. Morgan. Please go ahead.\n\nRanjan Sharma -- JPMorgan Chase and Company -- Analyst\n\nHi. Good evening, and thank you for the presentation and the opportunity. Two questions from my side. Firstly, on your financial services, with the close to 60% reduction in losses on a year-on-year basis, should we also be thinking about potential breakeven -- EBITDA breakeven of financial services next year? Second question is on your other services.\n\nAdjusted EBITDA losses are up 140%. Can you please share more details what's behind that and whether we should expect that to reduce in the coming quarters? Thank you.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, Ranjan. In terms of the DFS business, as we shared, the reduction in losses mainly came from our tightening on spending in terms of investments in the wallet, mobile wallet initiative. And we will continue to focus on efficiency. And given currently the losses at a very manageable level, as we continue to improve on cost efficiency and monetization over time, we believe that this business is something that is much of a long-term business that we need to focus on quality as opposed to scale growth as rapidly as possible and rapid monetization.\n\nSo, we want to make sure that our business model is resilient, including the credit business in terms of the underwriting quality, user experience, operational efficiency, etc. And also, in terms of our banking business, again, it's very much a quality-, trust-, resilience-focused business. So, we don't expect a lot of fluctuations in this business. And we don't see it at this point as a business that we focus growth on.\n\nIn terms of profitability for the other services, our adjusted EBITDA increase was -- I think if you look at quarter on quarter, it's much smaller. And lots of it is actually also related to severance costs that we initiated in the third quarter relating to the food delivery business. So, if we take into account, adjust it for that cost, I think the trend probably is in a different direction. But in any case, we continue to manage the cost efficiency and growth efficiency of the other services, and we expect to see more savings to show up in the following quarters there.\n\nOperator\n\nThe next question comes from Varun Ahuja from Credit Suisse. Please go ahead.\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nYes. Hi. Thanks for the opportunity. My first question is on the gaming side.\n\nIf you look at second quarter, there was some stability in the user base. Third quarter, again, we have seen an 8% quarter-on-quarter decline. So, if you can help us understand what is happening there. Is it the new users last three, six months were coming to the platform? Is it the older user base? In which regions? So, if you give some clarity on that front.\n\nAnd related to gaming business, given the reduction in guidance compared to the, I suppose, midyear last quarter, what are the negative surprises that you see on that business for you to bring down the guidance and not give more clarity on the business? Secondly, on the overall outlook or guidance -- resumption of guidance, what data points are you looking at in terms of markets? So, when can investors expect a resumption of the guidance from the ˙company, so -- which all -- in terms of hard core data points that you want to look at before resuming the guidance? Thank you.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, Varun. In terms of the game guidance, as we shared, right now, we continue to see impact on user engagement and user base from the macro headwinds. And also, we see that in Q3 where school reopens fully. There's also quite a significant impact on the some of the user base and user engagement numbers.\n\nSo, that's why, you know, we revised the guidance lower. In the longer run, how this will trend, I think it still remains to be seen. Of course, as we also shared regarding Arena of Valor, as an example, that it's a six-year-old game, and we started to see some new growth in the game six years since its launch. So, we believe that after you reach certain core user base and for a very long-term game, with the right type of operations and efforts, there could be potential upside to the game and that can for [Inaudible] by the performance.\n\nNow, for Free Fire, it still remains to be seen where the core user base might be reached. And so, our focus is on continuing, again, in terms of providing the best experience as we can to our users. In terms of the guidance for the future, as we shared, given the macro uncertainty, at this point, we do not intend to provide guidance for our business. So, if our view changes about the macro and operations, we will update the market then.\n\nOperator\n\nThe next question comes from Josh Levin from Autonomous Research. Please go ahead.\n\nJosh Levin -- Autonomous Research -- Analyst\n\nThe first question is on Garena. How much visibility do you have into Garena's bookings and EBITDA? Or asked another way, how can investors be confident that management can accurately forecast Garena's bookings and EBITDA over the next year or so? The second question is, can you provide a bit more detail on what is in the DFS loan book? What kind of loans are in there? And what you might have done to change your underwriting policies given the macro uncertainty? Thank you.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, Josh. As we shared just now that we are not providing guidance for our business, including bookings for digital entertainment, given the macro outlook. And in terms of the digital financial services, we have various products across different markets relating to the credit business, including final period of products, loss of buyers and sellers, and factoring to our sellers. So, we will continue to improve our underwriting quality by reviewing the data and also by looking at cycles information, backlog information, taking into consideration as many factors that we can, but also past track record of user and user behavior to project potential shifts in user and user patterns and adjust our underwriting policies accordingly.\n\nAnd also, as we shared, our average tenure for the outstanding is four months, so it's a relatively short tenure at this point. And we will continue to act swiftly to manage our loan with quality and focus on user experience. Thank you.\n\nOperator\n\nDue to time constraints, this concludes our question-and-answer session. I would like to turn the conference back over to Minju Song for any closing remarks.\n\nMinju Song -- Senior Manager, Group CCO Office\n\nThank you, all, for joining on today's call. We very much look forward to speaking to all of you again next quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMinju Song -- Senior Manager, Group CCO Office\n\nForrest Li -- Chairman, Group Chief Executive Officer\n\nTony Hou -- Group Chief Financial Officer\n\nPang Vittayaamnuaykoon -- Goldman Sachs -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nPiyush Choudhary -- HSBC -- Analyst\n\nJiong Shao -- Barclays -- Analyst\n\nVenugopal Garre -- AllianceBernstein -- Analyst\n\nRanjan Sharma -- JPMorgan Chase and Company -- Analyst\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nJosh Levin -- Autonomous Research -- Analyst\n\nMore SE analysis\n\nAll earnings call transcripts"
}