{
  "companyName": "Lemonade, Inc.",
  "companyTicker": "LMND",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/lemonade-inc-lmnd-q3-2022-earnings-call-transcript/",
  "content": "Lemonade, Inc. (LMND -1.16%)\nQ3 2022 Earnings Call\nNov 09, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, hello and welcome to the Lemonade Q3 2022 earnings call. My name is Maxine, and I'll be coordinating the call today. [Operator instructions] I will now hand over to Yael Wissner-Levy, VP communications, at Lemonade, to begin. Please go ahead when you're ready.\n\nYael Wissner-Levy -- Vice President, Communications\n\nGood morning, and welcome to Lemonade's third quarter 2022 earnings call. My name is Yael Wissner-Levy, and I'm the VP communications at Lemonade. Joining me today to discuss our results are Daniel Schreiber, co-CEO and co-founder; Shai Wininger, co-CEO and co-founder; and Tim Bixby, chief financial officer. A letter to shareholders covering the company's third quarter 2022 financial results is available on our investor relations website, investor.lemonade.com.\n\nBefore we begin, I would like to remind you that management's remarks on this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the risk factors section of our Form 10-K filed with the SEC on March 1, 2022, and their other filings with the SEC. Any forward-looking statements made on this call represent our views only as of today, and we undertake no obligation to update them. We will be referring to certain non-GAAP financial measures on today's call, such as adjusted EBITDA and adjusted gross profit, which we believe may be important to investors to assess their operating performance.\n\nReconciliations of these non-GAAP financial measures to the most directly comparable GAAP financial measures are included in our letter to shareholders. Our letter to shareholders also includes information about our key operating metrics, including in-force premium, premium per customer, gross loss ratio, and net loss ratio, and a definition of each metric, why it is useful to investors, and how we use each to monitor and manage our business. With that, I'll turn the call over to Daniel, who will begin with a few opening remarks. Daniel?\n\nDaniel Schreiber -- Co-Founder and Co-Chief Executive Officer\n\nGood morning, and thanks for joining us to review our Q3 results and the outlook for the remainder of 2022. I'm happy to share that we had a strong quarter with our top and bottom lines coming in better than expected. Year on year, our IFP, or in-force premium, grew 76%. Our premium per customer grew 35%.\n\nAnd at 65 million adjusted EBITDA loss, our bottom line also bested our expectations. Our loss ratio had been coming down in recent quarters, and Q3 saw a reversal in that welcome trend. The spike in loss ratio, however, was not unexpected. We had cautioned that the Metromile deal would have an adverse effect on loss ratios in the short term, and Hurricane Ian added several points of loss ratio, too.\n\nWith that said, we do anticipate the overarching downward trend to continue in the coming quarters, notwithstanding the occasional bumps. Q3 is moving season and usually our most efficient time to acquire customers. COVID played a little havoc with seasonal patterns in recent years. But this year, the familiar seasonality was back and on full display.\n\nAccordingly, we pulled in some of our marketing spend from Q4 to Q3. This helped boost our Q3 top line but will come at the expense of growth in Q4. All told, we expect our second half of the year to be as guided, while the allocation between the quarters has been jiggered to optimize our spend. Much else has happened since the last call, but the two highlights are a deal we announced with Chewy and a launch in the United Kingdom.\n\nStarting with Chewy. Chewy is the foremost destination for pet parents in the U.S. And in the spring, they will start selling Lemonade Pet to their 20 million customers. Chewy's revenue share compensation consists of a few components, but we'll be paid out primarily in the form of Lemonade equity.\n\nWe're thrilled to choose Lemonade, and we're thrilled they chose Lemonade stock. In addition to amounting to a huge vote of confidence in what we're building, this structure aligns our interests which we incentivize to drive sales of Lemonade Pet and deliver long-term growth at an extraordinarily low cash burn for Lemonade. That's why the launch in the U.K., at the risk of sounding too sappy, this is a meaningful step for us. In short, as we know, it hails from the U.K.\n\nAnd on a personal note, so do I. So, both professionally and personally, bringing Lemonade to the U.K. is a homecoming of sorts. Beyond the sentimentality of it all, the U.K.\n\nis the largest insurance market in Europe and so represents a material addition to our total available market. Finally, we're looking forward to next week's investor day, where myself and others on the leadership team will go deeper into our strategy metrics path to profitability and how we're running the business. We'll be sharing more about our AI lines of business and our financial modeling than we've ever done before, and we very much look forward to seeing you there. If you haven't registered yet, please head over to our investor.lemonade.com site and sign up under the news section.\n\nAnd with that, let me hand over to Tim. Tim, over to you.\n\nTim Bixby -- Chief Financial Officer\n\nGreat. Thanks, Daniel. I'll give a bit more color on our Q3 results, as well as expectations for the fourth quarter and the full year. And then we'll take your questions.\n\nWe have another strong quarter of growth, driven by additions of new customers, a portion of them related to the acquisition, as well as a continued increase in premium per customer. In-force premium grew 76% in Q3 as compared to the prior year to $609 million. We believe that this key operating metric is useful to understand the full scope of our top-line growth before the impact of reinsurance and regardless of the timing of customer acquisition during the quarter. Premium per customer increased 35% versus the prior year to $343.\n\nThis increase was driven primarily by the Metromile acquisition impact and, to a lesser extent, the combination of increased value of policies over time, as well as a continuing mix shift toward higher value homeowner car and pet policies. Gross earned premium in Q3 increased 71% as compared to the prior year to $136 million, roughly in line with the increase in in-force premium. Revenue in Q3 increased 107% from the prior year to $74 million. The growth in revenue is driven by the increase in gross earned premium, as well as a reduction in the proportion of premium ceded to reinsurers to 55% in the quarter as compared to 70% in the prior year.\n\nOur gross loss ratio was 94% for Q3 as compared to 77% in Q3 2021 and 86% in Q2 2022. Operating expenses, excluding loss and loss adjustment expense, increased 33% to $110 million in Q3 as compared to the prior year. And this is primarily driven by increased personnel expense, stock-based compensation expense, and legal and professional fees, partially offset by lower sales and marketing expense. We also continue to add new Lemonade team members in all areas of the company, though at the more modest pace we've seen for several quarters in support of customer and in-premium growth geographic expansion.\n\nGlobal headcount grew 36% versus the prior year to 1,371, primarily due to the impact of the closing of the Metromile acquisition in July. Net loss was $91.4 million in Q3, or $1.37 per share, as compared to the $66.4 million net loss we reported in the third quarter of 2021, while adjusted EBITDA loss was $65.7 million in Q3 as compared to $51.3 million in the third quarter of 2021. Our total cash, cash equivalents, and investments ended the quarter at approximately $1.1 billion, reflecting an increase of $164 million due to the Metromile acquisition, partially offset by use of cash for operations and capital expenditures of $131 million since year-end 2021. With these goals and metrics in mind, I'll outline our specific financial expectations for the fourth quarter and an updated full year 2022.\n\nFor the fourth quarter of 2022, we expect in-force premium at December 31 of between $612 million and $615 million, gross earned premium between $147 million and $150 million, revenue between $77 million and $80 million, and adjusted EBITDA loss between $65 millions and $62 million; stock-based compensation expense of approximately $60 million, capital expenditures of approximately $3 million, and a share count weighted for additional shares issued in connection with the Metromile acquisition totaling approximately 70 million shares. And for the full year, we expect, again, in-force premium, December 31, between $612 million and $615 million, gross earned premium between $486 million and $489 million, revenue between $245 million and $248 million, and adjusted EBITDA loss between $238 million and $235 million; stock-based compensation expense for the full year of approximately $60 million, capital expenditures of approximately $11 million, and a share count, again, weighted for additional shares issued in connection with the Metromile acquisition totaling approximately 65 million shares. And finally, a reminder again that our first investor day is happening next Tuesday, November 15th, starting at 9 a.m. Eastern Time in our New York offices and via webcast.\n\nPlease RSVP, if you haven't already, using the link provided in our shareholder letter, or join us via webcast during or following the event. And with that, I would like to turn the call back to Shai. Shai?\n\nShai Wininger -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Tim. We now turn to the top-voted shareholders questions. And the first one is coming from Darren, who's asking how much growth should we expect to see from the Chewy partnership? And will it include any alliance with PetSmart? So we're really excited about the Chewy partnership. And we believe that the deal can easily deliver significant growth and extraordinarily low cash burn.\n\nBeing able to offer Lemonade Pet to 20 million customers and those that will add in the coming years can easily become one of our primary growth channels for Lemonade Pet. By the way, this partnership relies heavily on the Lemonade API, which we continue to strengthen as we grow our partnership-based distribution channels. I believe that using our technological advantage to integrate with partners quickly is strategic for Lemonade. To the second part of your question, PetSmart was once owned by Chewy.\n\nBut the two brands separated, I believe, in 2020, and so the deal does not include any alliance with them. The next question comes from Paper Bag Investor, who wanted to get an update on the Metromile integration. And he also asked about the comment Daniel made of us waiting for regulators to approve rates before loss ratios can improve. Well, it's been just a few months since the Metromile deal closed.\n\nBut the synergies between our team's data and tech stack are in full force. In fact, out of the Metromile employees offered a role at Lemonade, 100% have accepted it. And it's already impossible to tell who's a former Metromiler and who's not. Regarding Metromile's loss ratio, you're right.\n\nSome regulators take more time to approve rate changes than others. In California, where 65% of Metromile's business was, the regulators have taken an unusual position and resisted rate changes across the auto industry as a whole. Several major carriers have reported elevated loss ratios as a result, and many of them have effectively pulled out of that market until this impasse is resolved. Along with the rest of the industry, we look forward to bringing rates back in line with risk as soon as possible.\n\nIn another question from Darren, he asked if we're concerned at the prolonged inflation. A hardening reinsurance market, increased claim cost limits on rate changes, and increases in reserve requirements could create the perfect storm and capsize Lemonade. Darren, the short answer is no. I don't think these will culminate into a perfect storm or any capsizing.\n\nYou've touched on several different risk dimensions, so let me address them one by one. Inflation means that prices keep going up, so the impact on the cost of claims is immediate, while the time it takes to change prices moves at the pace of regulators. There's a lagging window in which premiums collected are lower than what they should be to maintain a healthy loss ratio. We've made the changes so that some of our products ought to adjust for inflation.\n\nAnd for others, we're getting into a filing pace and rhythm that should keep pace with inflation. But it will take a while for all these changes to work their way through the system and for policies to earn into these new rates. As for your point about reinsurance hardening and the increase in reserve requirements, reinsurance companies had a rough several years. But this doesn't mean that they'll change our business model or stop providing reinsurance.\n\nWe've seen this affecting mostly the cost of reinsurance and expect it to go up. But at the same time, we're becoming more diversified. With more products available in more regions, we believe that our reinsurance should play a different role in our business, optimizing on two primary needs: protection against rare catastrophic events and optimizing our surplus requirements. Tim will address this more fully in our investor day next week.\n\nDarren also wanted to know more about a comment that was made by Daniel in which he mentioned that the majority of our marketing tests are deemed failures. He wanted to know what was the actual total cost of these failures and, going forward, how do we plan to course correct with winning strategies that don't result in further shareholder dilution. Darren, I think this point was misunderstood. When we say that a large part of our marketing campaigns are failures, it doesn't mean that they've brought in zero business or led to losses.\n\nJust like everything else we do, we approach advertising in a data-driven way. Unlike traditional marketing, where you'd have one campaign to bet your annual marketing budget on, we create thousands of different variations and test them with very small budgets. There are so many because we run ads for different products with different creatives, different audience segments, and different targeting. You can think about this as a sports tournament.\n\nWe run many ads and put small budgets behind them to see which one works. We then take the winners, apply what we've learned to improve them, and then have them compete against each other. This process leaves you with the best performing ads while spending a fraction of the cost of a full campaign. You also learn a lot in the process.\n\nSo, the next set of ads will perform better straight out of the gate. In another question, George wanted to know what is our top priority for 2023. Thanks for the question, George. Our primary focus for '23 is our path to profitability, which translates into three main pillars: loss ratio, cross sales, and efficiency.\n\nAs a reminder, we are in the midst of making hundreds of changes in all of our product lines to adjust for inflation and accuracy based on our customers lifetime value predictions. On our screens, we're starting to see encouraging signs of improvement. And our team will continue this focus throughout the year. On cross sales, we're seeing continued improvement as our team focuses on bundling, upsell, and cross-sell initiatives through our newly created customer group.\n\nAnd on efficiency, we'll be focusing on further improvement of our APIs and our ability to integrate with distribution partners, as well as invest in Blender and our internal automation tools. We'll provide more insights on all three in our investor day next week, and I invite you to tune in. And with that, let me turn the call back to the operator for more questions from our friends on the Street.\n\nOperator\n\n[Operator instructions] Our first question today comes from Michael Phillips from Morgan Stanley. Please go ahead, Michael. Your line is now open.\n\nMike Phillips -- Morgan Stanley -- Analyst\n\nThank you. Good morning, everybody. You mentioned there in the final comments the reinsurance impacts of diversification of product, and I assume geography, too, to help offset the hard end market there. But anything else besides that? Like, I guess, specifically, would you be willing to take a higher cat when it's retention on your business to kind of offset prices there?\n\nTim Bixby -- Chief Financial Officer\n\nYeah. Hey, Mike. The short answer is yes. So, I think, you know, our view on reinsurance generally is optionality.\n\nSo, historically, I think we've taken advantage of good markets and good terms that fit with our overall goals, the size of the business, the risk profile. But generally, our bias is to lean toward reinsurance more as a benefit for surplus efficiency, capital efficiency, now that we are getting a really good grip around our loss ratio or claims risk, different products. We're much more comfortable, I think, now than three or four years ago in terms of balancing that risk. And so, yeah, I think we'll be open to taking a little more risk, balancing the terms, and we'll kind of see how the market plays out.\n\nOur next renewal is coming up not until midyear next year, but we would be open to that.\n\nMike Phillips -- Morgan Stanley -- Analyst\n\nOK. Thank you, Tim. And then I don't know if you're willing to give kind of the mix of home versus rented today versus the prior period, but I guess I'm curious just to hear your thoughts on the impact of inflation between those two sets of books, how inflation affects a renter policy differently than a home policy.\n\nTim Bixby -- Chief Financial Officer\n\nYeah. So, it definitely affects both but more concentrated in homeowners just because of the more likely significance of reconstruction remodeling, sort of the heavy-duty stuff that usually happens, whereas, in renters, you're usually talking more about possessions. But the reality is inflation is really across the board. And so, more concentrated in home, but we're really looking at doing our best to offset and mitigate inflation in all of our products.\n\nThere really is no product where it's untouched, but it's definitely a little more concentrated in home cars now, you know, for us with Metromile gone from quite small to a significant part of the business. And so, those are -- it's a little more concentrated in those products.\n\nMike Phillips -- Morgan Stanley -- Analyst\n\nGreat. OK. And just a quick numbers question. On the loss ratio, you mentioned, you know, the Metromile impact and the Ian impact.\n\nBut can you give us the exact dollar amount of claims paid on Ian? How much of an impact in the loss ratio was --\n\nTim Bixby -- Chief Financial Officer\n\nSo, yes, it was fairly minimal, something on the order of less than $3 million to date.\n\nMike Phillips -- Morgan Stanley -- Analyst\n\nIan was not what you said, is that correct? I'm just making sure.\n\nTim Bixby -- Chief Financial Officer\n\nI'm sorry?\n\nMike Phillips -- Morgan Stanley -- Analyst\n\nYou said Ian was minimal, is that correct? Just making sure I understood.\n\nTim Bixby -- Chief Financial Officer\n\nYeah, yeah. That's right.\n\nMike Phillips -- Morgan Stanley -- Analyst\n\nOK. OK. Perfect. Thank you very much.\n\nTim Bixby -- Chief Financial Officer\n\nYes. And maybe just as a reminder on that, you know, Florida, in aggregate, represents less than 1% of our business. So, we're relatively unexposed there, and it's essentially a renters book. So, we had some impact, but relatively, you know, quite nominal versus folks who have a large homeowners book in Florida, which we do not.\n\nMike Phillips -- Morgan Stanley -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. And the next question comes from Tracy Benguigui from Barclays. Please go ahead. Your line is open.\n\nTracy Benguigui -- Barclays -- Analyst\n\nJust going to follow up actually on Mike's question about the loss ratio. So, if Ian wasn't a huge contributor, if you can just walk through the sequential decline, which was worse in that 3 to 5 points that you had previously shared.\n\nTim Bixby -- Chief Financial Officer\n\nYeah. So, we obviously guide to loss ratio, but we did have impact from Metromile, which has had been running at a somewhat higher than historical assertion, certainly higher than our car. And then home, while we've made a healthy number of filings only about a quarter of the book of business or so, has aged into those filings. And so, we're still seeing that benefit.\n\nIt'll take, you know, several quarters before the existing filings have an impact on that business. But we'll continue to sort of work hard to keep up with the inflation impact. So, I think of it as home, Metromile, and the other parts were more or less as expected.\n\nTracy Benguigui -- Barclays -- Analyst\n\nMaybe on Metromile, I mean, auto is a tough market. What are you seeing specifically -- I don't make any comments on bodily injury or physical damage, severity claim.\n\nTim Bixby -- Chief Financial Officer\n\nYou know, we don't have much on that at hand on this -- prepared for this call today, but maybe that's something that we'll look to provide a little more detail, a little more disclosure going forward. But to the extent we are kind of looking at the specific parts, it tends to be -- cars, in general, are more expensive to repair. And so, from our experience in our book of business, which we have a little bit longer experience for Metromile, it tends to be more around the repair, replace as opposed to the injury. But that's probably something where we'll think about maybe providing a little more color in the coming quarters.\n\nTracy Benguigui -- Barclays -- Analyst\n\nAll right. So, maybe this question, you're more prepared to answer. How do you see your business mix shifting post Chewy deal, Metromile among pet insurance, home renters, and auto?\n\nTim Bixby -- Chief Financial Officer\n\nSo, I wouldn't describe Chewy at this point because it's early, hasn't really launched next year formally. What the benefit it really gives us is an ability to add significant pet policies potentially but at a much lower cash cost. And so, we'll have some optionality there. We see nice incremental growth through the Chewy partnership.\n\nWe can choose to let that flow through and increase the natural growth rate of pet, or we could also offset and grow some of our other lines of business knowing that we'll achieve our pet goals through the Chewy channel versus through the direct channel. So, we have kind of that choice. And let's see how that plays out. We've got a healthy target in the first year, and it grows over time.\n\nAnd we think it's a really nice structure where it will give us significant pet policies if we achieve those targets at a much lower cost. In terms of overall share, I wouldn't -- at this point, I wouldn't expect a dramatic shift in share. But, you know, Pet has continued to grow modestly, a pretty sizable share, 20% of the overall book, but I would assume it will continue to represent a healthy portion of the total book.\n\nTracy Benguigui -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Tommy McJoynt from KBW. Please go ahead, Tommy. Your line is open.\n\nThomas McJoynt-Griffith -- Keefe, Bruyette and Woods -- Analyst\n\nHey, good morning, guys. Thanks for taking my question. The first one, could you talk a little bit about some of the math or at least some of the theory behind your reference to that optimal cash burn equating to 20% to 25% growth? And what sort of runway does that give you given your existing capital resources?\n\nTim Bixby -- Chief Financial Officer\n\nSure. So, you know, a couple of the data points that we've shared, obviously, our cash balance is there. We'll put out the Q today. But think of it as roughly just under 1.1 billion in cash investments equivalents.\n\nWe've set aside something less than 300 million in terms of supporting surplus that's within the insurance carriers themselves. So, looking out over the coming years -- and this is something we're going to get into a fair bit more detail at our investor day, and so we don't want to jump the gun on that. But we think about our growth rate as a primary lever of how much cash we burn, and it's really a growth rate of our choice. I think, sometimes, there's a misconception that if our growth is slowing, it's because the market demand is changing.\n\nThat's not the case. It's us choosing to grow at a certain pace because our -- sort of our unit economics and acquiring new customers are quite healthy and quite predictable. So, we've dialed back the growth rate. You saw it in Q3.\n\nYou see it in the guidance for Q4. And you're exactly right, that sort 20-plus percent growth rate gives us comfort that we've got not months or quarters of run rate but many years of runway before we have to be concerned about the ultimate availability of capital.\n\nThomas McJoynt-Griffith -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. Thanks. And then, switching over back to a question on the Chewy partnership. Just want to clarify, is Chewy's compensation there solely driven by the top-line number of policies and array as referrals rather than the underwriting profitability of those policies? And then, as a follow-up, do you think about the concept of paying those partners with warrants or stock to be part of kind of a regular playbook as you explore new partnerships?\n\nTim Bixby -- Chief Financial Officer\n\nSo, on the first question, yes, the structure is on customer acquisition. We are very comfortable with what customers do. And once they enter the Lemonade funnel and so it's really focused on giving us access to 20 million fairly happy Chewy customers and doing our best to leverage Chewy's capabilities there and bring them into the Lemonade family, but they will become true Lemonade customers in every sense of the word and go through our underwriting process, just as any other type of customer. In terms of the structure, I would look at our history.\n\nSo, this is the first time we've done this. The bar is very high. And there are structures that are much simpler, but this is one where the scope of their customer reach, the strength of their brand name, and the synergies with pet as really a core of our business made everything sort of fit and come together where we're willing to structure it with equity. There are very firm guardrails around that equity.\n\nSo, it must be earned. They must achieve targets in order to ultimately generate value from those warrants. And so, we feel like it's a really nice balance of sort of risk and reward for both sides.\n\nThomas McJoynt-Griffith -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. Thanks, Tim.\n\nOperator\n\nThank you. Our next question comes from Andrew Kligerman from Credit Suisse. Please go ahead. Your line is open.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nHi. Good morning. Could you share with us some of the products and distribution channels which kind of incented you to spend a bit more on your marketing this quarter?\n\nTim Bixby -- Chief Financial Officer\n\nI think we've seen nice marketing efficiency, but we've actually been tempering the total marketing spend over time. Perhaps, the comment that we made in the letter of pulling in spend from Q4 to Q3 are sort of behind your question, I'm guessing. And so we, have -- yeah, so we have continued to see nice efficiency. And seasonality is just something that we've seen be quite persistent, you know, even through the last few years where COVID has a lot of unpredictability.\n\nWe've continued to see, you know, moving season, which is, you know, people relocating, kids back to school, all the different changes that typically happen in the fall continue to drive better results. And so, we saw that, you know, continue and even strengthen somewhat in Q3, and that drove it. In terms of channels, I don't think -- I wouldn't point out any major shift in the channels. You know, two years ago, you didn't see many checks going out to TikTok.\n\nThat obviously has changed. But that's not a surprise. So, I think the channel that you'd expect and see across other consumer customer acquisition efforts would be similar to us. We're very focused on direct acquisition as opposed to brand marketing or some of those other ancillary spend.\n\nWe do a little bit, but not too much. And we can just continue to leverage our LTV to CAC models, which get better and better. And when those numbers improve, we're more comfortable turning it up. We did a little more of that in Q3.\n\nAnd from a capital management standpoint, guided to Q4 that represents a bit of a pullback in Q4. And if we see more efficiency then, we obviously have the ability to adjust, but that was the major cause of the shift.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nGot it. And then, unfortunately, my line was breaking up when I heard you talking about loss ratio and rate. So, apologies if this was touched on. But in the auto insurance line, could you specify what your underlying loss ratio was ex-cat, ex-prior-year development again in the auto line? What was your aggregate rate increase across the country and, you know, what you filed and received in the quarter?\n\nTim Bixby -- Chief Financial Officer\n\nSo, that is more detailed than we've disclosed, though, very interesting, of course. We're going to get into a little more detail around car loss ratios and how we see it breaking down by product in our investor day again. So, I'll punt until that. I think, for a reasonable feel for how loss ratios are generally have evolved, I would point to the public filings of Metromile previously, which where the loss ratios have been above 100% for some time.\n\nSo, over time, we expect to bring those in line with the rest of our product goals toward a much lower rate. But for now, those rates, you can assume have persisted at an elevated level.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nOk. We look forward to hearing about it next week. Thanks.\n\nOperator\n\nThank you. Our next question comes from Jason Helfstein from Oppenheimer. Please go ahead. Your line is open.\n\nUnknown speaker\n\nHi. This is Steve on for Jason. So, just two quick questions. One is, can you help us understand the impact on Metromile for third quarter gross profit? And then, secondly, how do you think about scaling the auto insurance side of the business over the next 12 months and the impact on the P&L? Thank you.\n\nTim Bixby -- Chief Financial Officer\n\nSo, we don't break out Metromile. We're really reporting as one consolidated company at this point. I can give you some data points to get you in the right direction. So, historically, if you look at Metromile's stand-alone premium levels, you would see numbers in the -- earlier this year, 117, tracking down to roughly 110%.\n\nSo, it's fair to assume that there -- if you isolate Metromile, it would still be above $100 million in IFP. And so, with that, combined with the historical loss ratios of above 100, you can kind of let that flow through and see that that would have a pretty material impact on the gross margin line. But we don't break out Metromile specifically. The loss ratio in general, I think, is the primary driver of the gross profit change.\n\nAnd so, as that loss ratio comes closer to our target, I would expect that the gross margin and the adjusted gross margin as we report them to come back in line with what we saw when our loss ratio a couple of years ago was in the 70s. In terms of your second question, scaling cars, so, we're -- with Lemonade Car before the merger of Metromile, we have launched so far three states. Metromile brought us up to a total of about 10 states in total. And then, we have a plan -- we haven't disclosed state by state.\n\nWe typically don't in advance because we do -- we're a little opportunistic about moving things around. It's not always in our control, the exact date of launch from a regulatory perspective. But I would -- you should expect additional launches over the course of all of 2023. So, by the end of the year, I'd expect several new states.\n\nBut when we get closer to launching them or at the point of launch, then, obviously, we'll give more clarity on that. But we'll expect to continue to add new states consistently over the next couple of years.\n\nUnknown speaker\n\nGreat. Thank you very much.\n\nOperator\n\n[Operator instructions] Our next question comes from Josh Shanker from Bank of America. Please go ahead, Josh. Your line is open.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking question. My first question relates to the guidance for premium in-force in 4Q. It's very little higher than it is in 3Q. My guess is that you're going to be not renewing the Metromile customers and growing in other places.\n\nAnd if that assumption is correct, I'm wondering if you can talk about that plan.\n\nTim Bixby -- Chief Financial Officer\n\nYes, that's a fair proxy. So, again, Metromile is no longer viewed by us as a stand-alone business. It's part of Lemonade. Our car product is made up of pay per mile, which historically was Metromile as well as a fixed price product.\n\nBut if you were to isolate it to exactly those customers acquired through Metromile, there's a typical attrition rate, and we're not investing heavily at this point to grow that business. And so that in the Q4 guidance, you see that historical Metromile number coming down. It's actually been a pleasant surprise. The retention rate has been solid and a bit better than our expectations, which is providing some benefit to the IFP growth.\n\nAnd then, the remainder is really our reduction of spend in Q4, part of which we pulled into Q3 until you'll see a growth rate that increases the size of our overall business, excluding Metromile, and compensate for some of the natural attrition that's happening in that Metromile customer base.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nHi there. Sorry, I lost you for a second. And then the -- on Chewy deals, Trupanion already sells the pet insurance product through Chewy. I'm wondering if you think this marketplace becomes one where Lemonade is one of several brands sold on that website and whether you're competing on product and price or whether you're competing on exclusivity.\n\nAnd maybe, I don't know if you probably looked at Trupanion's success, though, they haven't really sold that much product on Chewy, so to speak. How might you approach differently?\n\nTim Bixby -- Chief Financial Officer\n\nYes. So, we -- you know, while we're aware of the competition, it's not really a primary focus. So, we like the ability to be open to all channels, and, therefore, it's not an exclusive structure for either of us. We want to be open to other channels and working with other partners.\n\nSo, whether or not Trupanion is there, whether or not Trupanion does well, we really don't expect it to impact the Lemonade trajectory. It's a very large market. Chewy has access to an extraordinary both large and dedicated customer base. So, there's plenty of room for all of us.\n\nYou know, we'll obviously look to expand channel partnerships for where it make sense. This is one that we're really excited about, both strategically and also just the sheer size of what they've done and what we think it can do for pet.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thanks for the answers.\n\nOperator\n\n[Operator instructions]\n\nDuration: 0 minutes\n\nYael Wissner-Levy -- Vice President, Communications\n\nDaniel Schreiber -- Co-Founder and Co-Chief Executive Officer\n\nTim Bixby -- Chief Financial Officer\n\nShai Wininger -- Co-Founder and Co-Chief Executive Officer\n\nMike Phillips -- Morgan Stanley -- Analyst\n\nTracy Benguigui -- Barclays -- Analyst\n\nThomas McJoynt-Griffith -- Keefe, Bruyette and Woods -- Analyst\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nUnknown speaker\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nMore LMND analysis\n\nAll earnings call transcripts"
}