{
  "companyName": "BlackRock",
  "companyTicker": "BLK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/13/blackrock-blk-q3-2022-earnings-call-transcript/",
  "content": "BlackRock (BLK -1.05%)\nQ3 2022 Earnings Call\nOct 13, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Jake and I will be your conference facilitator today. At this time, I would like to welcome everyone to the BlackRock, Inc. third quarter 2022 earnings teleconference.\n\nOur host for today's call will be chairman and chief executive officer, Laurence D. Fink; chief financial officer, Gary S. Shedlin; president, Robert S. Kapito; and general counsel, Christopher J.\n\nMeade. [Operator instructions] Thank you. Mr. Meade, you may begin your conference.\n\nChris Meade -- General Counsel\n\nThank you. Good morning, everyone. I'm Chris Meade, the general counsel of BlackRock. Before we begin, I'd like to remind you that during the course of this call we may make a number of forward-looking statements.\n\nWe call your attention to the fact that BlackRock's actual results may, of course, differ from these statements. As you know, BlackRock has filed reports with the SEC, which lists some of the factors that may cause the results of BlackRock to differ materially from what we see today. BlackRock assumes no duty and does not undertake to update any forward-looking statements. So with that, I'll turn it over to Gary.\n\nGary Shedlin -- Chief Financial Officer\n\nThanks, Chris, and good morning, everyone. It's my pleasure to present results for the third quarter of 2022. Before I turn it over to Larry to offer his comments, I'll review our financial performance and business results. While our earnings release discloses both GAAP and as-adjusted financial results, I will be focusing primarily on our as-adjusted results.\n\nAs a reminder, beginning in the first quarter of 2022, we updated our definitions of as-adjusted operating income, operating margin and net income. Year-over-year financial comparisons referenced on this call will relate current quarter results to these recast financials. Market conditions remained very challenged in the third quarter, with global equity and debt markets ending down 25% and 14%, respectively, for the first nine months of 2022. In total, these market declines, along with significant dollar appreciation against major currencies, reduced the value of BlackRock's assets under management by over $2 trillion since December 31.\n\nInflation, rising rates, liquidity, market volatility, and geopolitical uncertainty remain significant concerns for clients, but more of them are turning to BlackRock for comprehensive solutions to help build more resilient portfolios. They increasingly value our unparalleled breadth of investment products, styles and exposures, which allows them to customize portfolios to address the investment policies, return targets, and unique needs of their stakeholders. Our ability to deliver this customization at scale is a unique advantage, and it is during times of market uncertainty that the power of our platform becomes most evident. Despite the most challenging market backdrop in decades, BlackRock generated industry-leading long-term net inflows of $248 billion during the first nine months of 2022, demonstrating the strength and stability of our globally integrated multi-asset solutions-oriented platform.\n\nWe've invested for years to develop leading franchises in high-growth areas such as ETFs, private markets, outsourced solutions and technology. And importantly, we've worked tirelessly to fully integrate these capabilities into our One BlackRock business model and culture. This connectivity and collaboration is more important than ever before, as we bring together the entire firm to deliver better outcomes for our clients and differentiated growth for our shareholders. And while we can't control near-term volatility or the specific client risk preferences that may result, BlackRock's platform has been purposely built over time to help clients meet their objectives regardless of the market environment.\n\nOver the last 12 months, BlackRock's broad-based platform has generated approximately $400 billion of total net inflows, representing positive organic base fee growth of 2%. During a tumultuous market environment, BlackRock generated third quarter long-term net inflows of $65 billion, representing approximately 3% annualized organic asset growth. Quarterly long-term net inflows were partially offset by net outflows from cash and advisory AUM. However, total quarterly annualized organic base fee decay of 4% reflected outflows from higher fee precision ETFs, the continued impact of elevated redemptions in active equity and fixed income mutual funds, and outflows in institutional money market funds.\n\nThird quarter revenue of $4.3 billion was 15% lower year over year, primarily driven by the impact of significant lower markets and dollar appreciation on average AUM and lower performance fees. Operating income of $1.6 billion was down 22% and reflected the impact of approximately $96 million of closed-end fund launch costs in the third quarter of 2021. Earnings per share of $9.55 declined 16% versus a year ago, also reflecting a lower effective tax rate, partially offset by lower nonoperating income compared to a year ago. Our as-adjusted tax rate for the third quarter was approximately 19%, reflecting $93 million of discrete tax benefits.\n\nWe continue to estimate that 24% is a reasonable projected tax run rate for the remainder of 2022, but the actual effective tax rate may differ because of nonrecurring or discrete items or potential changes in tax legislation. Nonoperating results for the quarter included $219 million of net investment income and reflected a $267 million noncash gain related to our strategic minority investment in iCapital. Third quarter base fees and securities lending revenue of $3.5 billion was down 10% year over year, broadly in line with the decline in our average AUM. The negative revenue impact of approximately $1.9 trillion of market beta and foreign exchange movements on AUM over the last 12 months was partially offset by positive organic base fee growth over the same period and the elimination of discretionary yield support, money market fund, fee waivers versus a year ago.\n\nOn a constant currency basis, we estimate second quarter base fee and securities lending revenue would have been down 8% year over year. Sequentially, while base fee and securities lending revenue was down 4% on an equivalent day count basis, our effective fee rate was approximately flat. As a result of continued global equity and bond market declines toward the end of the quarter, including the impact of FX-related dollar appreciation, we entered the fourth quarter with an estimated base fee run rate approximately 7% lower than our total base fees for the third quarter. Performance fees of $82 million decreased from a year ago, primarily reflecting lower revenue from liquid alternative products, including lower fees from a single hedge fund with an annual performance measurement period that ends in the third quarter.\n\nOur Aladdin business delivered record sales in the first nine months of 2022, and demand for our technology solutions has never been stronger. Quarterly technology services revenue increased 6% from a year ago, reflecting this increased demand, but also reflecting significant headwinds associated with the FX impact on Aladdin's nondollar revenue and market declines on Aladdin's fixed income platform assets. Annual contract value, or ACV, increased 7% year over year. On a constant currency basis, we estimate ACV would have increased 10% from a year ago.\n\nTotal expense decreased 10% year over year, reflecting lower compensation, G&A and direct fund expense. Employee compensation and benefit expense was down 12%, primarily reflecting lower incentive compensation due to lower operating income and performance fees, partially offset by higher base fee compensation. Quarterly G&A expense declined 6% versus a year ago and reflected the impact of $96 million of closed-end fund launch costs in the third quarter of 2021, which are excluded when reporting our as-adjusted operating margin. Excluding these costs, G&A expense increased 13% due to higher marketing and promotional expense, including the impact of higher T&E expense and ongoing strategic investments in technology, including cloud computing costs.\n\nSequentially, G&A expense was up 5%, primarily reflecting higher marketing and promotional expense. Direct fund expense was down 10% year over year, driven by lower average index AUM. Our third quarter as-adjusted operating margin of 42% was down 560 basis points from a year ago, reflecting the immediate negative impact of markets and foreign exchange movements on quarterly revenue and the ongoing longer-term strategic investments we have been making in technology and our people. BlackRock's industry-leading organic growth is a direct result of the purposeful investments we have consistently made through market cycles.\n\nThe diversification and stability of our platform has allowed us to pursue critical investment when others have been forced to pull back. But we also recognize that this market environment may require a different playbook. While we continue to have deep conviction in our strategy and the long-term growth of the global capital markets, we have begun to more aggressively manage the pace of certain discretionary spend. We are continuing to pursue critical hires that support our near-term growth but are pausing the balance of our hiring plans for the remainder of 2022.\n\nIn addition, we now expect our full year increase in 2022 core G&A to be in the range of 13% to 15%, lower than our previous guidance of 15% to 20% that we communicated in January. While these steps will not materially impact our 2022 results, they will better position us going into 2023, should market headwinds persist. Throughout our history, we've demonstrated that we are pragmatic and agile in managing our expenses. As always, we remain committed to optimizing organic growth in the most efficient way possible and will be prudent in continuing to assess our overall level of spend in the current environment.\n\nOur capital management strategy remains to first invest in our business and then to consistently return excess cash to shareholders through a combination of dividends and share repurchases. We repurchased nearly $1.4 billion worth of shares in the first nine months of this year, including $375 million in the third quarter. At present, based on our capital spending plans for the year and subject to market conditions, including the relative valuation of our stock price, we still anticipate repurchasing at least $375 million of shares in the fourth quarter, consistent with our previous guidance. BlackRock's third quarter long-term net inflows of $65 billion once again demonstrate the stability of our diversified platform and the strategic alignment with clients.\n\nWe're increasingly looking for partners who can provide them with global insights and whole portfolio solutions tailored to their future goals. Third quarter ETF net inflows of $22 billion were led by surging demand for our bond ETFs, partially offset by sentiment-driven outflows from commodities, broad emerging markets exposures and small-cap equity precision ETFs. As we have seen repeatedly in periods of market volatility, investors turn to iShares precision exposure ETFs to express risk and tactical asset allocation preferences. Bond ETFs generated $37 billion of net inflows, the second best quarter in our history.\n\nWe're not only leading the bond ETF industry in terms of AUM and net new business market share, but we're working with all stakeholders to grow the bond ETF industry itself. It took 17 years for the industry to reach $1 trillion in 2019. It is now closing in on $2 trillion, and we believe that the industry will be at $5 trillion before the end of the decade, with BlackRock leading that significant growth. Retail net outflows of $5 billion reflected ongoing industry pressures in active fixed income and world allocation strategies, partially offset by strength in index SMAs and our systematic equity income and multi-strategy alternatives funds.\n\nInstitutional active net inflows of $71 billion were led by fixed income and multi-asset net inflows and included the impact of several previously announced significant outsourced CIO mandates, including the funding of approximately 45% of the AIG Core Bridge fixed income assignment. Institutional index net outflows of $23 billion primarily reflected equity net outflows as clients sought to derisk or rebalance in the current environment. Demand for alternatives also continued, with $2 billion of net inflows and $4 billion of new commitments raised across our liquid and illiquid platform during the quarter. New illiquid commitments were driven by private credit and infrastructure.\n\nWe now have approximately $37 billion of committed capital to deploy for institutional clients in a variety of alternative strategies, representing a significant source of future base and performance fees. Our cash management platform experienced net outflows of $40 billion, primarily driven by redemptions from U.S. government money market funds, as reduced debt issuance in a higher rate environment, coupled with ongoing capital management and a general reduction in corporate cash levels, contributed to industrywide institutional outflows. As rates stabilize, BlackRock is well positioned to grow market share by leveraging our scale, product breadth, technology and risk management on behalf of liquidity clients.\n\nFinally, third quarter advisory net outflows of $9 billion were primarily linked to the successful transition of the last remaining assets managed in connection with our assignment with the New York Federal Reserve Bank. Throughout our history, BlackRock is led by listening to clients. This connectivity has been foundational to our growth over the last 34 years, and our relationships with clients have never been deeper. We have always capitalized on market disruption to emerge stronger by continuing to innovate, to work collaboratively, and to deliver the full power of our platform.\n\nWhile challenging, this market environment is no exception. With that, I'll turn it over to Larry.\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nThank you, Gary, and good morning to everyone, and thank you for joining the call. Today and throughout our history, we have focused on providing our clients with choice in how they pursue their long-term investment goals. Over the last 34 years, we have built the industry's most comprehensive and integrated investments in technology platform. Our diverse solutions provide clients with more choice to address their unique priorities.\n\nIt is our job to deliver them the best financial returns based on our clients' own preferences. Our comprehensive platform allows us to serve clients around the world of all types and sizes, whether you are looking for a broad-based index exposure, private markets or fully outsourced solutions. For many clients, market-weighted portfolios will suit their needs. Others may want access to precise exposures in certain regions or sectors, whether that's Latin America or Southeast Asia or healthcare or agriculture.\n\nSome others will want their investments to reflect their values or contribute to environmental priorities or pursue opportunities in the energy transition. BlackRock provides investment choice to our clients, and our clients decide how they invest their money. Because of this, clients are turning to BlackRock more than ever. Our broad investment product capability, our leading technology platform, our whole portfolio approach, and global insights are strongly resonating worldwide with our clients.\n\nI cannot think of a time when we are having more comprehensive conversations with more clients than we are today. First nine months of 2022 have brought on a complex economic environment. Consumers, companies and portfolios remain impacted by the continued strengthening of the U.S. dollar, which reached a record high against the pound in the quarter, following a holistic plunge in the U.S.\n\nGilt markets. Central banks continue to prioritize bringing down inflation, as they should. At the same time, increased government stimulus is creating a disconnect between fiscal policy and monetary policy. While central banks are tasked with bringing down inflation, governments are injecting stimulus into the economy, making the central bank's jobs even harder.\n\nThe speed at which central banks are raising rates to rein in inflation alongside slowing economic growth is creating extraordinary uncertainty, increased volatility, and lower levels of market liquidity. After an early summer rally in equities, markets again came under pressure in the third quarter, with equity markets ending down 25% for the first nine months, and the aggregate bond index is down over 14%. While, of course, BlackRock is not immune to the impact of markets and currency moves, we remain focused on what we can control. We are bringing our capabilities and insights to clients to help them navigate the opportunities and challenges presented by this environment.\n\nEven when much of the industry has experienced outflows, clients entrusted us with more than $248 billion in net new business in the first nine months of 2022, including $65 billion in the third quarter. And our voice continues to resonate in every region where we operate. In the U.S. alone, during the third quarter, clients awarded us $84 billion of long-term net inflows.\n\nBlackRock is uniquely positioned in this environment because of our integrated investment management, integrated technology and our advisory expertise, something no other asset manager can provide. Even with these historical difficult market conditions, BlackRock's AUM is still up $2 trillion since the beginning of 2019. And during that period, we also added over $1.6 trillion in assets under management from organic growth alone. No one else in the industry has done this.\n\nAnd let me be clear, this is not by an accident. For years, we strategically invested in our platform, both organically and inorganically, in anticipation of our clients' evolving needs and preferences. What made our investment so successful was our steadfast commitment to integrate our capabilities onto one platform, onto one culture, onto one technology platform. That is what One BlackRock is about, and this is why we connect to our clients worldwide.\n\nThey have one organization to come to. That culture and approach is just as relevant today, maybe even more so, while others are talking about change and challenges in the asset management industry that we have long anticipated, long prepared for, and we are spending our time delivering solutions to our clients. Our long-standing commitment to reimagining our business to innovate ahead of the needs of our clients is translating into industry-leading organic growth we're generating today. BlackRock's whole portfolio approach is resonating more than ever against this market backdrop, as clients look for partners with comprehensive capabilities and a global outlook to help them rethink their portfolio allocations.\n\nIt is especially essential to the momentum we are seeing in these major outsourcing mandates. BlackRock anticipates a growing need from insurance companies, pension and wealth distribution partners for more comprehensive outsourced solutions, as they are increasingly looking to focus on their core business. We invested to align our investment expertise, operational expertise, and technology to address these clients' needs. The movement toward outsourcing accelerated even faster than we anticipated.\n\nAnd BlackRock has been in the forefront, working with clients of all sizes that help them meet their investment objectives and to better serve their own stakeholders. Just in the last two years, we are honored that BlackRock has been entrusted to lead several significant outsourced mandates totaling over $300 billion in AUM, spanning existing, but also entering new client relationships and new capabilities. Third quarter results included some of the flows that these outsourced relationships have, and we see strong momentum going forward. Aladdin is not only the operating system that unites all of BlackRock, it is a key component of many of our largest clients' relationships.\n\nDriven by our continued innovation and the power of our user provider model, demand for Aladdin has never been stronger. We've seen record new mandates in 2022, and see strong momentum going forward. We have invested to expand Aladdin's value proposition to addressing our clients' needs across investment life cycle. Aladdin's integrated offerings are resonating with clients, with about half of this year's mandate spanning multiple Aladdin products.\n\nThis includes clients using the Aladdin whole portfolio view, which grew out of our own acquisition of eFront, to seamlessly manage portfolios across public and private asset classes on one single platform. It includes clients leveraging Enterprise Aladdin, alongside Aladdin Accounting or the Aladdin Data Cloud. The success of our expanded Aladdin offerings demonstrates how clients value our innovation and our integrated capabilities. Just as Aladdin is transforming the operating system of the asset management industry, bond ETFs are revolutionizing fixed income investing with iShares leading industry growth and industry innovation.\n\niShares bond ETFs generated $76 billion of net inflows in the first nine months in 2022, even as a generational rise in inflation and tighter monetary policy resulted in sharp price declines in the bond markets. Flows in 2022 highlighted the unique diversity of BlackRock's Bond ETF platform. Flows were led by U.S. Treasury ETFs, but also saw strong growth in investment grade in municipals and international government bonds.\n\nToday, BlackRock's ETF platform stands at $700 billion in AUM across 300 ETFs, serving millions of investors globally. We also saw more opening of the bond ETF ecosystem, such as the CME's announcement that it would accept certain bond ETFs for collateral management and continued adoption from U.S. insurers, giving changes to the bond ETF capital treatment announced earlier this year. Beyond fixed income, we are partnering with clients to deliver benefits of ETFs to their portfolios across each of their major product categories.\n\nInvestors continue to turn to iShares ETFs for long-term investments, active and for passive. And we also saw growth across core equity, sustainable ETFs in the third quarter and throughout the year. Across our ETF platform, BlackRock generated inflows of $22 billion in the third quarter and $131 billion year-to-date. ETF flows for BlackRock were particularly impacted by high utilization of iShares precision exposures ETFs by institutional clients for their own exposure management.\n\nThe tactical asset allocation tools are unique to BlackRock, and high utilization of ETFs reinforce the value proposition across the iShares' strong secondary market liquidity and unique options and lending market ecosystem to allow our portfolios and investors to either go long or short using iShares as a vehicle to express their market views. BlackRock's leading performance and innovation in the ETF industry is another testament to the integrated nature of our model and our platform. Aladdin enables us to handle complexity and precision with scale. iShares products diversification and innovation offers clients the widest choice in the industry.\n\nGlobally, we have over 1,000 ETFs, nearly six times the number of our next largest player. In 2022 alone, we launched 75 new ETFs, nearly double the number of launches by the next three largest providers combined. The breadth of this platform also enables us to capture changes in client demand and help our clients nimbly reposition as market conditions evolve. ETFs are increasingly the first place investors go to make tactical asset allocations and updates, manage liquidity or position for compelling long-term opportunities.\n\nAnd particularly, clients have been turning to us to help them navigate rapidly rising rates and capitalizing on generational opportunities in fixed income. BlackRock's top-performing diversified fixed income platform across ETFs, and active and across duration, across credit, and high yield is uniquely positioned to help clients in line with their specific needs and goals, whether it is to lock in risk-free yields or to generate more income or to hedge against inflation. In addition to significant funding from outsourcing relationships, BlackRock's active platform demonstrated continued momentum and systematic equities in LifePath target date funds and alternative strategies. We believe we will benefit from money in motion as clients recalibrate and build portfolios with high-performing active alongside ETF and private markets.\n\nWhile market volatility impacted shorter-term performance in some funds, long-term performance remains strong, so approximately 89% of our active fixed income and 82% of our fundamental equity are above our peers and medium for the five-year period. We continue to see demand for alternatives, especially in private credit and infrastructure. As investors seek additional sources of yield or uncorrelated returns amid this more challenging public market alpha, we raised $6 billion through commitments and net inflows in the third quarter and $23 million in the first nine months of 2022. BlackRock has built comprehensive private market capabilities that provide exposure across illiquid alternative asset classes and importantly are integrated as a part of the One BlackRock platform.\n\nThis is unique in the industry and offers us a tremendous leverage, alternatives at BlackRock benefiting from the firm's global footprint, our network of clients and distribution relationships, access to differentiating high-quality deal flow, understanding our clients' whole portfolios and leading data analytics and technology. In addition to our investment and technology capabilities, our Financial Markets Advisory group continues to play a critical role in advising financial and official institutions. In the third quarter, we announced that our FMA group will be working pro bono with the Government of Ukraine to provide advice on designing and investment framework, with a goal of creating opportunities for both public and private investors to participate in the future of reconstruction and recovery of the Ukrainian economy. BlackRock continues to innovate in a variety of areas to expand the choices that we offer to our clients.\n\nLast fall, we announced BlackRock's Voting Choice Initiative, which leverages our technology to help eligible institutional clients participate in proxy voting decisions. Following years of work on technology and regulatory barriers, nearly half our clients' index equity assets, including pension funds representing more than 60 million people, have simple and efficient options about their preferences if they choose. We're going to expand choice even further, and we're committed to a future where every individual investor can have the option to participate in the proxy voting process, if they choose. Of the client assets currently available for voting choice, nearly 25% are held by clients who have so far elected to exercise their own voting choice and voting preferences.\n\nFor other clients, BlackRock investment stewardship team serves as an important link between them and the companies they invest in. Over the past few months, I've been energized by the surge in people and activity in our offices around the world. Our people across all levels of our organization are more motivated, they're more engaged and more focused on the future than ever before. Just as we continually innovate and evolve our business to stay ahead of our clients' needs, we also evolve our organization and our leadership team, key to delivering the full power of One BlackRock to our clients and having our senior leadership team, having deep experience, knowledge and connectivity across the entire firm, with a desire of building deeper and broader horizontal leadership.\n\nWe make organizational leadership changes every few years because we believe these changes bring the best benefits to our clients, our shareholders, our firm, and to our leaders themselves. These changes not only keep us more tightly connected, they stimulate fresh thinking and helping us better anticipate all our clients' needs. Part of the changes to our leadership that we announced last week reflected Gary's desire to take on a new role, once again working directly with clients. He will be with us as CFO for the next quarter's earnings and through our year-end reporting.\n\nBut I want to take a minute to recognize and thank you. Thanks, Gary. He's a great friend and has helped drive strong growth for BlackRock and our shareholders in the last 10 years as the CFO, and for many years before that as our true trusted advisor. I'm glad he'll continue with us at BlackRock as the vice chairman focusing on a number of our strategic client relationships.\n\nAnd I know that Martin, who has been named as our new CFO, will hit the ground running. With deep knowledge, deep experience from his 16 years at BlackRock across a varieties of different roles, Martin is a true example of stellar and pursued horizontal leadership with many different experiences within the firm. He will be working very closely with Gary and the entire finance team over the next few months to ensure a smooth transition. BlackRock is fortunate to have a diverse and engaged board of directors who act as stewards on behalf of all our shareholders and stakeholders in overseeing BlackRock's management and our operations.\n\nIt has always been important that our board functions as a key strategic governing body that advises and challenges our management team that guides BlackRock into the future. Beth Ford has been the kind of a director we seek out, someone who brings new perspectives and new expertise to the board. She has been an invaluable, valued member of our board. But because of her spouse's new position as CIO of the Minnesota State Board of Investments, she decided that it would be appropriate for her to step down from our board.\n\nAnd we're grateful for the many contributions that Beth has made as a member of the BlackRock board. We built BlackRock because we believe in the power of the capital markets, the power of what they have done in transforming economies for their long-term growth, and the importance of being invested in them. The money we manage belongs only to our clients. Over many years, we have built the most comprehensive platform to help them meet their investment objectives and deliver better outcomes for the portfolio.\n\nWe provide them choice, so that their portfolios can be tailored to match their preferences and their goals unique to them. Our clients hold many different views. They operate in vastly different regulatory and cultural environments. And in this politically polarizing world we're living in today, we think that the model of client choice that we built during the last 34 years is more important than ever.\n\nIn the last few months, especially in the United States, our industry and BlackRock itself has been the subject of increased political dialogue. We've seen and heard a lot of misinformation about BlackRock. We're engaging more with our stakeholders than ever before. We're telling our story so that people can make decisions based on facts, not on misinformation, not on politicization by others.\n\nI do believe that the vast majority of our clients, our voice is resonating as strong as ever. We hear it in our dialogue with them and we see it in our flows. Again, in the United States alone, we have had positive net term inflows of $133 billion in the first three quarters of the year. And as I noted earlier, in the third quarter alone, we had $84 billion in long-term net inflows awarded to BlackRock by U.S.\n\nclients. The majority of our clients are investing to fund the retirement of teachers, of nurses, of firefighters, of factory workers, who are saving for their future. They are entrusting BlackRock with more of their portfolios because they know we are here to serve them today and all tomorrows in the future and have a track record of helping them achieve their goals. Our clients remain our North Star.\n\nAs markets change and as our clients need more of us, we will stay true to our fiduciary mindset, our innovation instinct, and our One BlackRock culture that has defined us and enabled differentiating growth and differentiating relationships with our clients. I believe the best of BlackRock is ahead of us. And we are all committed to delivering the power of our unified platform to benefit our clients, to benefit our employees, and most of all, to benefit our shareholders. With that, let's open it up for questions.\n\nOperator\n\n[Operator instructions] And we will take our first question from Craig Siegenthaler with Bank of America.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nLarry, I hope you and the team are doing well.\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nHi, Craig.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nGary, also just wanted to congratulate you on the new role, but I think you got one more earnings call with us.\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nThanks, Craig. Look forward to it.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nSo my question is on the potential for client rebalancing into fixed income just as rates and markets eventually stabilize. And arguably, nobody has better perspective on this topic than you guys just given the breadth of the BlackRock platform. But what is your outlook for fixed income given higher yields and also some of the sector themes like the benefits of demographics, including the retirement of the baby boomers?\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nCraig, let me turn it over to Rob.\n\nRob Kapito -- President\n\nHello, Craig. Thank you for the question. The markets in 2022 have certainly disrupted their traditional portfolio allocations from the past. Traditional 60-40 allocations are certainly at a balance, and portfolio liquidity profiles have also been impacted.\n\nAnd now for the first time in years, investors can actually earn very attractive yields without taking much duration or credit risk. Just a year ago, the U.S. two-year treasury notes were yielding 25 basis points. And today, they're earning 4%, corporate bonds are over 5% and high yield is above 9%.\n\nSo let me give you a little helpful context. If we go back in 1995, to get a 7.5% yield, which is what many institutions were looking for, a portfolio could be in 100% bonds. If you fast forward 10 years, in 2005, it had to be 50% bonds, 40% equities, and 10% alternatives. Then move another 10 years.\n\nAnd in 2016, you needed only 15% bonds, 60% equities, and 25% alternatives. This describes the growth of several markets. Now today, to get that same 7.5% yield, a portfolio could be in 85% bonds and then 15% equities and alternatives. And as you know, over the last several years, most of our clients, both institutional and retail, have been underweighted in fixed income.\n\nToday, infrastructure and sustainability stimulus in the U.S. is going to create significant opportunities for long-term investors and infrastructure to add returns to portfolios. So the combination of bonds and infrastructure is going to present some great fixed income outcomes for our investors. And over the last several years, BlackRock has built some great teams that have great performance in these particular areas.\n\nSo clients are coming to BlackRock to help them pursue what I would call generational opportunities in the bond market, both institutional and individual. And we're helping those clients to navigate recalibrations of their fixed income portfolios. And just to reiterate a couple of comments from Larry. We saw $37 billion of net inflows into bond ETFs, which is the second best quarter we've had in history, and then an additional $1.5 billion into private credit and active fixed income inflows of where we have significant good performance for the long term.\n\nSo I think we're going to see dramatic and large inflows into fixed income over the next year as interest rates rise. The breadth, diversification, and performance of BlackRock's fixed income and alternative capabilities over time across unconstrained, high yield, total return, duration, private credit and infrastructure positions us to capture those fixed income client flows as they look to lock in yields, rebalance back to target allocations, or execute on opportunities for additional yield and certainly inflation protection in infrastructure. Back to you.\n\nOperator\n\nOur next question will come from Alex Blostein with Goldman Sachs.\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nGood morning, Alex.\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nYeah. Good morning, Larry. Thanks, everybody for taking the question. Congrats both to Gary and Martin as well.\n\nSo maybe just to build on Craig's question but zooming out a little bit and thinking about BlackRock's organic base fee growth holistically, clearly, the firm is not immune to the macro challenges that we see in this space today. But given Rob's comments around the attractiveness of fixed income markets and sort of other initiatives that you have at the firm, do you expect BlackRock to get back into sort of this mid-single-digit organic base fee growth over the near to medium term? And what are some of the other building blocks that will help you get there?\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nGary?\n\nGary Shedlin -- Chief Financial Officer\n\nThanks, Alex, for the question. I think just looking back, when we set our 5% organic base fee growth target, it was never intended to be a quarter-to-quarter measure of our success, but really to think about what we can do to differentiate our growth and be more consistent over market cycles in the long term. And I think we've proven that. Obviously, in the last 12 months, we've delivered 2% organic base fee growth.\n\nAnd I think that's really a reflection of two things. One is our broad-based platform and its relevance to clients across a variety of market conditions. But more importantly, if you really see where our growth is coming from today, it's coming from areas where we have invested to build newer franchises, in particular, places like alternatives or sustainability that are frankly new parts of our growth paradigm. If you look over a longer period of time, 5% organic growth over seven of the last nine years.\n\nAnd I think, obviously, there's some pro cyclicality to that in terms of stronger markets, but I think we've shown our ability to generate positive organic base fee growth in years marked by market volatility. Obviously, we did it in '16, we did in '18. This is a little bit of a different environment, but we absolutely believe that over time we'll be able to continue to maintain that growth. And why do we feel so confident about that? A, because I think we bring to the table a number of things: one, global reach to a full range of investment strategies across active index, alternatives and cash; a strong perspective on integrated risk management, where we've talked about an integrated business model today; and obviously, unique performance, which in the long term is still very, very strong for us.\n\nBut it's this ability to bring together all of these things to address client problems and their goals of objectives in the long term through whole portfolio solutions, which I think is really the difference for us. So I mean, Rob Kapito mentioned a number of items. But whether it's private markets; whether it's ETFs; whether it's fixed income or broadly, sustainability, technology, leading position in cash, and ability to bring it all together; whether using technology to generate revenue itself or using technology to generate increased flows; whether in wealth or an institutional world, I think we still feel really, really comfortable that there's room to grow. But obviously, we need some stable markets to be able to do that.\n\nI think we cautioned everybody in very, very bold markets like we saw in basically '20 and '21 that 7% and 11% was probably a little bit above our punching rate. But looking basically on an average over these cycles, I think we feel very comfortable with 5%. And I think once markets stabilize, clients are going to get right back to their focus on long-term needs and solutions, and we'll be right there with them to basically help them address those problems.\n\nOperator\n\nYour next question will come from Ken Worthington with J. P. Morgan.\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning. Thanks for taking the question. The financial press has reported that BlackRock is caught in the middle of the ESG debate by those who think you're doing too much and those who think you're doing too little.\n\nSo maybe how would you characterize the cost here to BlackRock in terms of either reputation or lost business from the leadership position that you've taken on ESG issues? And have these costs been growing more recently as the financial press suggests? And then maybe looking forward, are you thinking about adjusting or repositioning the message on ESG, so you can better maximize the benefits and minimize the costs?\n\nRob Kapito -- President\n\nGreat question, Ken. Thank you. Well, I think our flows for the year and our flows for the quarter here in the United States speak volumes about what's really happening. Once again, U.S.\n\nflows in the third quarter, around $85 billion; $133 billion for the year; $258 billion over the last 12 months. And importantly, I think what it's resonating is that we're providing clients, from any views, choice. So there are clients who have views on one side of the conversation related to sustainability. We allow them to have a choice, and we help them design their portfolios.\n\nAnd clients who have views, whatever those views may be, we provide them with product choice and product ideas. And I really do believe that's resonating in almost every circumstance. And I do believe that has been the foundation of BlackRock, providing choice. We're giving clients that choice and access.\n\nAnd there are many clients who still believe that investing in sustainable strategy is the right long-term strategy. And that is giving them the choice to invest, and other clients may have different views. And so our message has been about choice. Our message has always been about whatever the client is looking to do and moving forward.\n\nAnd we've enlarged choice like no other asset management firm in the world by providing even voting choice now. And as I said, about a large component of our institutional clients have chosen now to bring back that vote. And we hope we have the ability to expand choice, as I said in my prepared remarks, across the entire universe of investors, from small investors to all investors. And I believe if this is where we are going, we are going to provide that.\n\nI think this resonates very well because we're staying in front of the needs of the clients, and I think that is resonating in our flows this quarter. We designed voting choice. Actually, we announced it over a year ago. And it's now playing into a very good -- it's a major part of the dialogue today.\n\nSo I'm aware, obviously, of the articles, and we are addressing that. We are trying to tell our story. We are telling our story with facts, and I'm here to tell our shareholders today that choice is resonating.\n\nOperator\n\nWe'll now take our next question, which will come from Michael Cyprys with Morgan Stanley.\n\nMike Cyprys -- Morgan Stanley -- Analyst\n\nHey. Good morning. Thanks for taking the question. So I was hoping you could elaborate a bit around the pacing of your investment spend.\n\nI know in the past you've mentioned that you'd look to invest through the cycle. And clearly, you updated your core G&A guide here this morning on the call to more tightly manage that spend. So I was hoping you could talk about how you prioritize where to invest at this point in the cycle versus where to slow down versus where to really pull back. And what does this all mean as you think about overall expense growth into 2023 compared to the 13% to 15% guide on core G&A for this year? Thank you. \n\nLarry Fink -- Chairman and Chief Executive Officer\n\nGood question, Mike. Gary, do you want to? \n\nGary Shedlin -- Chief Financial Officer\n\nSure. Thanks, Mike. So look, we're obviously trying to be very mindful on our margin. On the one hand, we know that shareholder value is clearly driven by continuing to invest to optimize organic growth.\n\nAnd we also know that historically, in markets like these, we have very much expanded our competitive moat because we can invest and others can't. On the other hand, Mike, we're also mindful that while we continue to grow organically, our overall revenue run rate is down, again, primarily driven by factors outside of our control like FX and beta. And our level of discretionary spend is higher than it was a year ago. We had these same discussions as a management team post the onset of the pandemic in early 2020, when equity markets were down about 30-plus percent.\n\nWe faced that similar conundrum. And thankfully, we made the correct decision to kind of solder on tap brakes, but ultimately solder on. And as a result of that decision, we posted the two best years of organic growth in our history. But we're also mindful that these markets are not only a little different, but the time of recovery may similarly have a longer duration.\n\nAnd so while we do have that deep conviction in the strategy, we've talked about that on a number of the questions this morning, and not only that, but also the long-term growth of the capital markets, we do think it's appropriate at this time to more aggressively manage the pace of certain of those investments. And as I mentioned in my remarks, we're going to really pause the balance of our discretionary hiring plans for the remainder of the year. We tightened up some of the discretionary spend in our G&A. And we'll be using those as key placeholders and observations as we begin our discussions for our spending plans next year.\n\nYou guys asked about margins of our individual business. And I can tell you that our highest margin business is beta. The good news is that's both true on the way up, but also on the way down. And as markets hopefully recover, I am very confident that we're going to expect to see our revenue growth to meaningfully outpace growth in our discretionary spend and be accretive to our operating margin over time.\n\nBut going into this year, our focus at a minimum will be on aggressive reallocation to a number of the areas that we've talked about, again, whether it be private markets, ETFs, technology supporting whole portfolio solutions and making some tough calls in terms of how to make sure that we're balancing that organic growth in a way that benefits not only our clients, but also our employees and our shareholders.\n\nOperator\n\nAnd our last question will come from Dan Fannon with Jefferies.\n\nDan Fannon -- Jefferies -- Analyst\n\nThanks. Good morning. Wanted to follow up on the headlines around LDI and what's been going on in that market. And if you could please size your AUM and even potential revenue associated with that strategy.\n\nAnd how you might think there could be or what you think about repercussions from either clients or regulators given what's going on.\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nLet me start with the context of LDI first. LDI has been a 20-year market. It's been transparent. Regulators have proved strategies.\n\nConsultants were the ones who really approve the strategies on behalf of the individual funds. It is our estimate the LDI market in the U.K. is about $1.7 trillion. We have about 20% of that, $250 billion.\n\nSo let's describe what happened. These products were built with the idea that we'll -- create these strategies. You had risk corridors of 100 to 125 basis points. That corridor worked for over 20 years.\n\nBecause of a fiscal policy announcement by the U.K. government, markets fell over 100 basis points in one day. And many of the corridors were penetrated. Now what does that mean? It means the clients have to post margin in their total return swaps.\n\nMany clients did not have the ability to rapidly post margin in a single day. And that created the market setback. The Bank of England comes in and steps in and stabilizes it. And during the stabilization period, for those who needed to be stabilized, for many of the funds, they posted the margins.\n\nFor many of the other funds that could not do it, we had to create, and other firms had to create different types of corridors, broadening the corridors, should the corridors be not 100 basis points, but a 200 basis point corridor. And that announcement by the Governor of Bank of England yesterday, it indicated to me that much of the reconstruction of these products have been done. They have the intelligence of every player in this. And as I said, some of the pension funds did not have a collateral.\n\nAnd in doing so, they may have to sell other assets to meet margin calls. Some clients were easy to provide the margin call and some clients needed to have some form of restructuring. By the actions this morning, the Gilt markets have been -- I don't know the Gilt markets since we've been on this call, but as of this morning, Gilt markets were stable. And so it appears much of the reconstruction of these products may have been done, and the market maybe should be a little more normalized.\n\nI'm not here to tell you I know the intelligence of has everybody done it, will there be more volatility starting in Monday on this, I don't know that. What I do believe that we should do like BlackRock was a leader in terms of money market reform, we want to work with the regulators, be a part of this to try to say, if volatility is going to continue to be this large, maybe there has to be whole redesigning of some of the products, whether that is in a commingled fund or in separate accounts. But we are going to be part of the solution to move this forward, as we always are. But I think this is a specific event to the U.K.\n\npension market. And it was a major component of the U.K. pension market. And so it had very deliberate issues that impacted that market.\n\nBut as of now, there has been adequate time, in most cases, not all, I'm not here to suggest it's over, of changing the corridors, widening that, obviously at a cost, and then importantly, putting up the necessary margins that were necessary in the severe market moves in the U.K. Gilt market.\n\nOperator\n\nLadies and gentlemen, we have reached the allotted time for questions. Mr. Fink, do you have any closing remarks?\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nI do. Thank you, everyone, for joining us this morning and for your continued interest in BlackRock. Our third quarter results are a direct result of our commitment toward serving our clients and providing choice to our clients in the backdrop of a very severe market downturns in both bonds and equities. But I believe the organic flows, the position we've had, the ability to provide choice to our clients resonated with the outcomes of the third quarter.\n\nAnd I believe they'll be resonating in the quarters to come. So I'm excited about the opportunities ahead of us, and I see real opportunities that BlackRock's position has never been stronger than ever. I want to thank everybody, and have a good quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Meade -- General Counsel\n\nGary Shedlin -- Chief Financial Officer\n\nLarry Fink -- Chairman and Chief Executive Officer\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nRob Kapito -- President\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nMike Cyprys -- Morgan Stanley -- Analyst\n\nDan Fannon -- Jefferies -- Analyst\n\nMore BLK analysis\n\nAll earnings call transcripts"
}