{
  "companyName": "Redfin",
  "companyTicker": "RDFN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/redfin-rdfn-q3-2022-earnings-call-transcript/",
  "content": "Redfin (RDFN -0.47%)\nQ3 2022 Earnings Call\nNov 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Redfin Corporation Q3 2022 earnings conference call. [Operator instructions] At this time, it is my pleasure to turn the floor over to your host, Meg Nunnally. Ma'am, the floor is yours.\n\nMeg Nunnally -- Head of Investor Relations\n\nGood afternoon, and welcome to Redfin's financial results conference call for the third quarter ended September 30, 2022. I'm Meg Nunnally, Redfin's head of investor relations. Joining me on the call today is Glenn Kelman, our CEO; and Chris Nielsen, our CFO. Before we start, note that some of our statements on today's call are forward-looking.\n\nWe believe our assumptions and expectations related to these forward-looking statements are reasonable, but our actual results may turn out to be materially different. Please read and consider the risk factors in our SEC filings together with the content of today's call. Any forward-looking statements are based on our assumptions today, and we don't undertake to update these statements in light of new information or future events. On this call, we will present non-GAAP measures when discussing our financial results.\n\nWe encourage you to review today's earnings release, which is available on our website at investors.redfin.com for more information related to our non-GAAP measures, including the most recently directly comparable GAAP financial measures and related reconciliations. All comparisons made in the course of this call are against the same period in the prior year, unless otherwise stated. Lastly, we will be providing a copy of our prepared remarks on our website by the conclusion of today's call, and a full transcript and audio replay will also be available soon after the call. With that, I'll turn the call over to Glenn.\n\nGlenn Kelman -- Chief Executive Officer\n\nThanks, Meg, and hi, everyone. As many of you have by now heard, Redfin today laid off 13% of our employees and announced the closure of RedfinNow. The reduction since April 30 has been 27%. We're grateful for the dedication and ingenuity of the people leaving and heartbroken that we don't have enough customers to pay for their work.\n\nOur June layoff was a reaction to slowing 2022 home sales. Today's layoff assumes a housing downturn that lasts at least through 2023, letting us earn adjusted EBITDA next year even if home sales declined at the levels of the great financial crisis when the U.S. population was 10% smaller. We still plan to generate our first annual net income in 2024.\n\nRedfin generated $600 million of third quarter revenue, compared to a projection of $590 million to $627 million. From the third quarter of 2021 to the third quarter of 2022, we increased the share of transactions closed by Redfin agents and from customers whom Redfin referred to our partner agents, but only by 2 basis points. We had warned investors on our last call that our June layoff of so many agents would be a setback for third quarter market share, so we consider any gain a victory. We lost $90 million, compared to a projection of $87 million to $79 million.\n\nThe adjusted EBITDA loss was $51 million. The entirety of the earnings shortfall came from RedfinNow which has been selling its homes at lower-than-expected prices. As recently as August, we still anticipated full year gross profits from our property segment, which includes both RedfinNow and our concierge service. The property's 2022 gross profit through the third quarter were negative $5 million, and we now forecast full year gross profit losses of $22 million to $26 million.\n\nOur inventory of homes has declined from its August peak of $432 million to $265 million as of October 31, with another $92 million under contract to sell. Of the purchases that went under contract in the second quarter, 67% had sold or were under contract for sale by September 30. By October 31, that number was 82%. We expect to complete the liquidation of our RedfinNow inventory in the second quarter of 2023.\n\nStarting from the end of the third quarter, this will return more than $100 million of cash to our balance sheet. Our decision to close our iBuying business is only partly due to the challenges we've had selling RedfinNow homes. Prices may stabilize in 2023, but the cost of capital, especially the capital coming from our balance sheet, is likely to remain higher for the foreseeable future. That has already lowered how much Redfin and other iBuyers can pay for homes, which in turn, has discouraged redfin.com visitors from contacting us about an instant offer.\n\nThose visitors who still want a cash offer will largely be routed to Opendoor through a partnership that has been in place since 2019 with renewed activity in the first half of 2022. iBuying for Redfin has never been an end in itself, but only a means to meet more homeowners when they first consider moving. Now that iBuying's contributions to listing demand has become smaller and less certain, it isn't worth the risk. We can sell more homes over time by focusing on our core business, building our online audience, and giving customers the best brokerage, mortgage, title, and rental service.\n\nIn each of these areas, our performance is improving even as housing demand is fallen. We increased our share of listing search traffic in the third quarter and expect those gains to accelerate now that we fixed a bug in our software that from April 25 to August 30 precluded new online visitors from getting listing recommendations. This bug was the main reason that in the third quarter of '21 to third quarter of 2022, redfin.com visitors declined by 5%. Fixing the bug boosted our traffic in the final month of the third quarter and beyond.\n\nEven with the bug, Redfin's year-over-year decline in third quarter visitors was 9 points better than realtor.com, which we seek to overtake as America's No. 2 real estate site. By September, the magnitude of our year-over-year decline was 1 point better than the top incumbent, zillow.com. We now expect listing search share, which we measure by comparing our visitor growth to that of zillow.com and realtor.com to accelerate.\n\nIn July, we began competing significantly better for people who start their home search on Google, which is the main source of new redfin.com visitors. For Google searches on a home address in the first 10 markets Redfin opened, we started appearing first more often than any other competitor. These home -- excuse me, these home address searches account for about two-thirds of the traffic we get from Google. In October, traffic from new visitors coming to Redfin via search engine had increased 14% year over year.\n\nSince the most reliable, earliest indicator of transaction share growth is search share growth. Our gains in search engine ranking will probably raise our fortunes more than any other development we discuss today. The improving sales execution can have a compounding effect on search share gains. Until recently, our sales force has struggled to overcome a change in customer behavior.\n\nSince the great financial crisis, homebuyers have become more casual and convenience-driven and asking for service from the array of agents they can now meet online. To yield the same number of sales, our website and mobile applications have had to generate more and more customers, both for Redfin agents and especially for partner agents, but that started to change this year. In a 2020 pilot that didn't expand all of Redfin until the 2022 home buying season, we reduced the number of customers each agent serves and close rates start up. Of the Redfin customers who end up buying a home, 37% stuck with the Redfin agent for purchase on the -- excuse me, of the Redfin customers who end up buying a home, 37% stuck with the Redfin agent for purchase in the second quarter of 2022, up from 28% in the second quarter of 2021.\n\nThis was the first significant year-over-year gain across a full quarter since 2019 when we started measuring how many Redfin customers who end up buying a home stick with Redfin for the sale. Loyalty deals, which we define as repeat referral customers, as well as customers from a Redfin agent's personal network, also kept growing as a fraction of our brokerages total deals, up from 31% in the third quarter of 2021 to 33% in the third quarter of 2022. A new discipline of managing agent performance should bolster both loyalty sales and specialty close rate. This, in turn, can develop the brokerage into a second engine of Redfin's growth, with redfin.com's traffic gains as our first engine.\n\nIn each of our top 20 markets over the last six months, the brokerage's share of homebuyer sales grew faster than our share of homebuying demand. But we also need to improve the brokerage's gross margins. Our July fixed price increase in which we eliminated a commission refund averaging well more than $1,000 for homebuyers in 22 markets has had almost no sales impact. We now plan to eliminate the commission refund in all markets, starting with the customers writing offer on December 1.\n\nPilot data indicates this will lower the total number of brokerage transactions by a minuscule of 0.13% while lifting gross margins 5 points. Redfin's bedrock principle is that Americans deserve a better deal from brokers, but our focus now is on saving customers' money where they value it most, in listing fees and mortgage rates. Improving close rates, driving loyalty sales, and increasing revenue per sale will increase the efficiency of Redfin's main gross profit engine, but we've also lowered the brokerages cost. Our November layoff has reduced the number of field personnel to match lower levels of U.S.\n\nhousing demand, but it has also increased the ratio of revenue-producing agents to support personnel field management training. The 2023 ratio will be higher than in 2022, but also higher than in 2021 when real estate services had 33% gross margins. Since the housing market is expected to keep worsening, we may not be able to get all the way back to 33% margins in 2023, but we can get close. And when a balanced market returns, real estate services can even -- can earn even higher gross margins.\n\nIf redfin.com is the first engine of our growth and the brokerage's network of loyal customers is the second, the mortgage and title services we can offer brokerage customers is the third. In the five years that we spent trying to build our own lender from the ground up, our attach rate for any given month never exceeded 8%. Since Redfin acquired Bay Equity Home Loans in April, the percentage of Redfin homebuyers using Redfin for a mortgage has kept increasing from 12% in June to 17% for the third quarter. Gains from here may be more gradual and occasionally uneven, but mostly, we expect increases to continue in the three markets where we've been especially focused on integrating the Redfin and Bay Equity sales force.\n\nAttach rates over the last three months have been between 23% and 25% and are still rising. With title service, we're doing even better. In the third quarter, Title Forward's attach rate was 40% of eligible brokerage transactions, up from 29% in the second quarter. In the third quarter of 2021, the attach rate was only 8%.\n\nRedfin's investment in its agents is employees, which gives everyone a stake in selling our entire product suite, is one reason for our success. The other is the quality of our mortgage and title service. Among Redfin brokerage customers, Bay Equity's third quarter Net Promoter Score was 12 points higher than other lender. That investment in employing agents is still controversial.\n\nOn the day of layoff, we're painfully aware that employing our agents limits Redfin's resilience to extreme volatility. Employing agents has magnified Redfin's losses in the 2022 bust and limited our share gains in the 2020 boom. If Redfin were a portal or even a traditional brokerage with contractors on 100% commissions, idleness would mostly be a problem for our agents, not our company. But our identity isn't binary.\n\nWe decide from month to month and sometimes week to week whether to staff our brokerage to handle 50% or 75% of the demand generated by redfin.com. The rest of the demand is routed to partner agents who often pay us one-third or more of their commission on a closed sale, nearly all of which is gross profit. To make our business more resilient with higher gross margins, we could staff to send more demand to partners, limiting the number of agents left idle in a downturn. It will always be more profitable for a brokerage to employ an agent busy with million dollar customers and to use partner agents for occasional sales of $200,000 homes.\n\nWhat happens in between is where we use our judgment, balancing margins and share growth risk and reward. It's best to make those calculations not a priori, but based on what will deliver the most profit in the current market, our focus is squarely on 2023 earnings. But that focus won't tilt the balance far from employees. Compared to partners, our employees close sales at a higher rate.\n\nBuild customer relationships that lead to repeat and referral sales for our benefit and drive higher mortgage and title attach rates. This gap between employee and partner performance is only widening. The judicious allocation of opportunities to our own agents is how we make the most profit per home buyer. And it's why our growth is more durable than if we were purely dependent on increasing online traffic or recruiting agents.\n\nImproving the performance of our brokerage mortgage and title business is the most well-established way to increase the gross profits we earn from each online visit to redfin.com. But we're also investing aggressively in digital services with gross margins above 70%. Our referrals to partner agents has been the first example of that approach. Rent, a rentals marketplace that we acquired in April 2021 is now the centerpiece of our strategy to expand it.\n\nWe told investors that it would take us six months to find Rent's new leader and that this leader would then nearly 12 months to turn Rent around. Jon Zigler started as Rent's CEO in August 2021. We added Rent's listings to redfin.com in March 2022 and relaunched the company formerly known as RentPath, under the Rent name in June 2022. By August, sales were growing fast.\n\nNet bookings, which are the annualized revenues from new customers less the annualized revenues from departing customers, were negative $4 million to $5 million in every quarter of 2021. In the first two quarters of 2022, Net bookings were already positive, but only barely so. For the third quarter, net bookings were plus $5 million, and we expect an even larger gain for the fourth quarter. On the strength of these bookings in the fourth quarter of 2022, Rent will generate its first quarterly year-over-year revenue growth in years.\n\nWe expect Rent to start generating adjusted EBITDA by the fourth quarter of 2023. From September '21 to September 2022, sales productivity more than doubled, and we've now assembled a team of account manager focused on customer retention and add-on sales. In the third quarter, the revenue loss due to churn as a percentage of total revenue fell 15% year over year. But the most important change has been in the development of a second product line to complement Rent's listings marketplace.\n\nDigital tools for property managers to market their communities on search engines and social media sites and to respond to inquiries from potential residents. Rent's listings marketplace began adding more clients than it lost in August 2022, but that trend began for digital tools six months earlier in February. As a result, digital tools account for -- excuse me, as a result, digital tools accounted for 25% of Rent's third quarter revenue, compared to 22% in the third quarter of 2021. Selling property managers both the fish and the fishing poles lets us form more lasting client partnerships with more than double the revenue per client.\n\nOne reason Rent has been able to focus on these tools and spend the increasing contribution of rentals visits from redfin.com. In June, redfin.com added 12% of rental visits above and beyond the visits to Rent site. By September, this contribution has grown to 18%. Before I turn the call over to Chris, let's talk about the housing market, which more people are worrying may collapse as it did in 2008.\n\nThis concern has seemed only half right to us. 2023 sales may decline to levels similar to the great financial crisis, though the U.S. population has grown 10% since 2008. But outside of pandemic boom towns like Boise, we expect prices to be more stable because homeowners have more equity today than in 2008, allowing many to set off this downturn.\n\nMortgage purchase applications in the last week of October fell 41% year over year. The number of homes for sale is starting to pile up with a 7% year-over-year increase through the end of October, but that is compared to historically low 2021 levels. The number of new listings on October actually fell 18% year over year. This is the season when Redfin's listening customers take their homes off the market for the holidays, but what's different in 2022 is customers' caution about relisting next year.\n\nOur agents report that this inventory may not be coming back anytime soon. The problem with demand is that housing has become unaffordable. From October 2020 to October 2022, the monthly payment for an American family buying the median-priced home increased by 71%. For that same family to rent a median price department, the monthly payment increased by 24%, still far faster than income growth.\n\nThe rate of household formation in late 2022 was less than one quarter what it was at its summer 2020 peak. It will remain that way until the cost of housing declined substantially. Over the summer, home prices eased only slowly in response to higher interest rates. Almost every other debtor in the American economy immediately felt the Fed staying, but homeowners have been reluctant to sell their homes when that involves giving up a 30-year mortgage at a fixed 2.8% rate.\n\nIf every homeowner had a fixed-rate mortgage, the pricing lock jam might never have broken but builders and iBuyers face higher holding costs and are now the ones forcing prices down in an otherwise deadlocked market. This is a major reason why the seasonally adjusted Case-Shiller Home Price Index which increased 2.4% from January to February, fell 1.3% from July to August. August data came out on October 25. The magnitude of both the gain and the drop are nearly unprecedented.\n\nLow liquidity adds to the volatility created by massive rate swings. In places like Phoenix and Atlanta, more than 10% of the sales are from home flippers. Homebuilders are more creative than the iBuyers about pricing but almost as motivated. One of our Houston agents has seen builders offer a $10,000 checker closing costs a $3,000 gift card and a free refrigerator.\n\nA Dallas area builder is offering agents $10,000 in extra commissions and a chance to win a Mercedes. More commonly builders are subsidizing a lower mortgage rate sometimes by as much as 1.5 points. These incentives, which don't show up in pricing data are led -- iBuyers hate holding homes near a new development. Falling prices will eventually spur sales, but the immediate effect on buyers will be discouraging.\n\nWhat this means for Redfin is that the only growth we'll get next year is what we take from others who charge higher fees and offer slower service with a customer experience that often breaks the moment an online visitor asked for help. Taking share in a falling market is always hard, but there's a reason we told investors on the eve of our public offering that we were born in the dark. We've run a mid-margin business through terrible ups and downs after years of competing against companies with billions in cumulative losses, [inaudible] can feel like a relief. The overriding concern our investors have is whether we can get through this downturn without running out of money.\n\nWe'll pay our debts come heck or high water and will keep growing. Redfin's still regional listing search site can gain on its rivals for years to come. Our rental business can double. Our brokerages progress on close rates and loyalty sales can send our share through the roof.\n\nOur lending and title business can print money. It's going to be a long night, but Redfin can still thrive in the darkness, and when the sun rises, we'll be stronger than ever. Take it away, Chris.\n\nChris Nielsen -- Chief Financial Officer\n\nThanks, Glenn. Third quarter revenue was $601 million, up 11% from a year ago and within our $590 million to $627 million guidance range. Real estate services revenue, which includes our brokerage and partner businesses, generated $212 million in revenue, which was down 18% year over year while coming in above the high end of our guidance. Brokerage revenue or revenue from home sales closed by our own agents was down 17%, driven by transaction volume decreases of 17%.\n\nRevenue from our partners was down 37% on a 26% decrease in transactions and mix shift to lower-value houses. Overall, real estate services revenue per transaction was up 1% year-over-year. The property segment, which consists primarily of homes sold through RedfinNow, generated $300 million in revenue, up 26% from a year ago and driven by a 37% increase in homes sold. Our rentals business generated $39 million, down 4% from a year ago, but up slightly from the second quarter of 2022, marking our second consecutive quarter of sequential rentals revenue growth.\n\nOur mortgage segment generated $48 million in revenue, which was at the high end of our guidance range. Our other segment, which now includes title and other services, contributed revenue of $7 million, an increase of 122% year over year, driven by increased attach rates for our title and closing services. Total gross profit was $58 million, down 54% year over year with a total gross margin of 9.7%. Total operating expenses were down $4.1 million or 3% year over year.\n\nDecreases in operating expenses in our organic business were offset by a $9.1 million increase attributable to the acquisition of Bay Equity, our mortgage business. As a percentage of revenue, total operating expenses represented 24%, down from 27% one year ago. Technology and development expenses increased by $4.4 million or 10% year over year. Included in the increase was $0.6 million from Bay Equity.\n\nThe remaining increase was primarily attributable to a $3.0 million increase in personnel costs. Total technology and development expenses represented 8% of revenue, flat from 8% one year ago. Marketing expenses decreased by $15.4 million compared with the same period in 2021. The decrease was primarily attributable to reduced advertising spending as we were still running mass media advertisements in the third quarter of 2021 but shifted the timing of our campaign earlier in 2022.\n\nThis decrease was offset by an increase of $1.6 million from Bay Equity. Total marketing expenses represented 6% of revenue, down from 9% one year ago. General and administrative expenses increased by $6.6 million or 12% as compared with the same period in 2021. The increase was primarily attributable to a $6.8 million increase from Bay Equity.\n\nTotal G&A expenses represented 10% of revenue, flat from 10% one year ago. Turning to segment-level profitability. Real estate services gross margin was 26%, down 1,140 basis points year over year. This was driven by a 970-basis-point increase in personnel costs and transaction bonuses.\n\nTotal net loss for real estate services was $9.8 million, down from a net income of $23.3 million in the prior year. The decrease was primarily attributable to lower revenue and gross margins as the housing market slowed, offset by an $8.3 million year-over-year decrease in operating expenses. Properties gross margin was minus 10.9%, down 1,090 basis points year over year. This was driven by a 1,110-basis-point increase in home purchase and related capitalized improvements.\n\nTotal net loss for properties was $44 million, down from a net loss of $8 million in the prior year. The increased loss was attributable to lower gross margins for the segment as we sell through inventory purchased last spring at unfavorable prices. For the quarter, we recorded a net charge of $13.5 million as a result of the lower cost or market analysis for the inventory that we earned on September 30. At the end of the quarter, the cumulative balance of these write-downs was $18.3 million.\n\nThis reflects what we observed on pricing to sell homes that we bought earlier in the year. Rentals gross margin was 77.6%, down 410 basis points year over year. This was driven by a 230-basis-point increase in personnel costs as we've expanded the services that Glenn mentioned. Total net loss of rentals was $20.4 million, down from a net loss of $17.9 million.\n\nThe increased loss was primarily attributable to year-over-year declines in revenues discussed earlier, while operating expenses remained roughly flat at $50.8 million, compared to $51.2 million in the prior year. Mortgage gross margin was 9.7% for the third quarter, down from 12.8% in the second quarter of 2022. This was driven by lower refinancing volumes. Total net loss for mortgage was $5.2 million.\n\nOther segment gross margin was 15%, an improvement from the negative 12% one year ago. Total net loss was less than $0.5 million, compared to a net loss of $1.5 million in the prior year. Turning back to consolidated results. Total net loss of $90 million is below the low end of our $87 million to $79 million guidance range.\n\nThe previously mentioned lower of cost to market charge was the driver of our forecast. Adjusted EBITDA loss was $51 million. Diluted loss per share attributable to common stock was $0.83, compared with diluted loss per share attributable to common stock of $0.20 per share one year ago. Now turning to our financial expectations for the fourth quarter of 2022.\n\nConsolidated revenue is expected to be between $430 million and $459 million, representing a year-over-year decline between 33% and 29%. We expect our real estate services segment to account for $136 million to $144 million of that revenue. Properties revenue is expected to be between $220 million and $240 million. Rentals revenue is expected to be between $39 million and $40 million.\n\nMortgage revenue is expected to be between $29 million and $32 million. Turning to segment gross profit. We expect real estate services gross margins to decrease both year over year and sequentially, consistent with typical seasonality. For properties, we expect a gross profit loss of $21 million to $17 million.\n\nFor mortgage, we expect a gross profit loss of $1 million to $3 million. Total net loss is expected to be between $134 million and $118 million, compared to a total net loss of $27 million in the prior year. Adjusted EBITDA loss is expected to be between $71 million and $58 million. On a consolidated basis, this guidance includes approximately $25 million in total company marketing expense, $17 million of stock-based compensation, $18 million of depreciation and amortization, $23 million to $21 million in restructuring expenses, and $5 million to $4 million of interest expense.\n\nIn addition, we expect to pay a quarterly dividend of 30,640 shares of common stock to our preferred stockholder. This guidance assumes, among other things, that no additional business acquisitions, investments, restructurings or legal settlements are concluded and that there are no further revisions to stock-based compensation estimates. Before we open the call for questions, I just wanted to take a moment to acknowledge the difficult but necessary decisions we announced today regarding our employee reductions and the wind-down of RedfinNow. Glenn and I both firmly believe that we have the right long-term strategy for the business, but we also acknowledge the need to remain focused on driving profitability in the short term and allocating capital wisely as we navigate a challenging housing market.\n\nAnd now let's open the line for your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Tom White with D.A. Davidson. Please state your question.\n\nTom White -- D.A. Davidson -- Analyst\n\nGreat. Good evening, everyone. Thanks for taking my question. Glenn, I thought this question was going to be a bit of a less fielder, but you kind of touched on this in the prepared remarks a bit.\n\nI'm curious whether you guys have given any consideration to turning or leaning more into kind of the digital media lead gen parts of your business and maybe reducing kind of your brokerage footprint or even exiting brokerage completely as a way to kind of have less fixed overhead, be higher margin, accelerate kind of the timetable for meaningful profits? It seems like you've got the great portal that gets a lot of traffic, both for kind of listings and for rentals. You've got a partner network built already. I realize that it's kind of a pivot away from maybe the original focus of the business around lowering kind of expenses for consumers. But would just be curious to hear your comments or thoughts on that.\n\nGlenn Kelman -- Chief Executive Officer\n\nWell, first of all, we have definitely invested in digital revenue streams. We already talked about rent and the partner program, but we haven't mentioned the mortgage marketplace. We started using Zillow for that and built our own so that we could monetize directly, and that is going to increase gross profit per visit. We're running display ads on the website.\n\nWe're adding them to global applications. We have to fit between our teeth to monetize every pixel on the site as aggressively as we can. And we think that the employee model is entirely consistent with that. It is crazy to turn over a $2 million opportunity to a partner agent when an employee will close that at a higher rate.\n\nWe'll keep the customer relationship for life and will return more gross profit dollars from that sale. The only thing we can't afford to do is have employees who are idle. And so when we discuss the balance between demand going to partners and demand going to employees, especially on the day of the layoff, we just wanted to be clear that we set staffing levels to a point where even if demand declines, we can still keep our employees busy and profitable and take that demand away from partners. We've run that closer to the bone in past years because we wanted to take share and the employees closed sales at a significantly higher rate.\n\nBut long term, I just think that you will get more durable growth if you give people a better proposition where it's a seamless customer experience, the service is faster, the fees are lower, real estate is more efficient. And short term, if we're just trying to squeeze as much profit out of 2023 as we can, we do that with employees. We just have to be judicious about it because we overhire and they're idle, it totally roasts our margins. So we've just been careful in setting staffing levels after this layoff to make sure we can keep everybody busy because when we do, that's the way to make the most money off an online inquiry.\n\nTom White -- D.A. Davidson -- Analyst\n\nThat makes sense. Appreciate it. Thanks for the call.\n\nOperator\n\nOur next question comes from Jason Helfstein with Oppenheimer. Please state your question.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nThank you. I have just a question. What type of testing have you done on pricing? I mean, we've heard that consumers like the product, but it just seems like you don't charge enough to make enough profit at the corporate levels, right? I mean, that's kind of what we've been all been talking about. So why keep the fees to consumers this low given that you're kind of the only brokerage firm who's trying to do this with brokers as employees, right, which has its downside that we've all talked about.\n\nWhy not charge more? And what sensitivity testing have you done on that?\n\nGlenn Kelman -- Chief Executive Officer\n\nWell, Jason, I just wanted to acknowledge that it has an upside to it. You capture more gross profit per inquiry as long as you keep the agents busy. But to address the fee, we have just eliminated the homebuyer commission refund. We tested that in the summer.\n\nWe're eliminating wholesale on December 1. It will add 5 points of gross margin. We've been running this business for 16, 17 years, except when we're caught in a downdraft like this, it has a 30-plus percent gross margin for real estate services. So if you're generating $1 billion in revenue at a 30% gross margin, you can decide whether or not you want to be profitable.\n\nAnd the cuts we've made in headquarters costs to lower our fixed costs indicate that we are deciding to be profitable, that we are titrating our headquarters spending to our gross profit. Now we may take further steps to raise prices even more, but we have determined through extensive testing that buyers are not price sensitive, and sellers are price sensitive. And if you look at all of the portals trying to generate sell-side demand, they have failed. And we have succeeded because it turns out that people who come to a website respond to either a cash offer or to a 1% fee.\n\nAnd so if we want to take share in a durable way, we still think that offering customers a better deal on the sell side will drive share. And that we can do that profitably because we can run a business at a 30% plus gross margin at $1 billion scale and still have that to generate 10% to 15% operating margins over time. So we need to see if we're going to generate profit in 2023, I think we've reiterated several times that come hell or high water, that's what we want to do.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nSo without giving long-term guidance, basically, that $1 billion of real estate revenue, that's the North Star to make this -- the real estate brokerage business economics work.\n\nGlenn Kelman -- Chief Executive Officer\n\nI don't care what the revenue volume is. The North Star is to generate adjusted EBITDA in 2023. If we were in a situation where it was $800 million of revenue or $1.4 billion of revenue, we would still generate adjusted EBITDA. And I wasn't making a segment prediction on my revenues, I was giving you a gross sense of where our revenues are, and it's about $1 billion when you add everything up.\n\nSo we're not trying to provide forward guidance. We're just saying that these existential anxieties about how do you make a business work when you have $1 billion in revenue and 30-plus percent gross margins, I think you decide to spend too much in headquarters or you cut those costs back. And today we cut them back.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Naved Khan with Truist Securities. Please state your question.\n\nNaved Khan -- Truist Securities -- Analyst\n\nYeah. Thank you very much. Two questions from me. Maybe just on the gross margin and how we should think about for 2023 since that's part of the overall equation.\n\nSo -- and I mean, real estate gross margin. So I think, Glenn, you talked about how you pointed to 2021 gross margin 33% and maybe you won't get there, but get close to those. That's with the elimination of the cash back to the buyers. Is that fair? And then how should we be thinking about the sort of the improvement in gross margins throughout the year given the -- all the uncertainty that we have with respect to how housing market evolves into next year?\n\nGlenn Kelman -- Chief Executive Officer\n\nSo there are several drivers of gross margin. First of all, as I said, we've run this business for many, many years where the gross margin has been around 30% or better. And it's very hard to do that when rates increase at an unprecedented rate. But we still, we ran this business at 20-plus percent gross margin.\n\nThe drivers are raising prices, which we just did and saw that had a minimal impact on demand for rolling that out enterprisewide. Second, lowering field costs. That means that not only are we just reducing the number of agents to match the demand that we have coming into 2023 but also that we structurally changed the brokerage so that there are fewer managers, fewer trainers, fewer support staff per revenue-producing agent. So we are going to get more efficient and charge a higher price at the same time while being very judicious about how we allocate opportunities to employees versus partners because we want to make sure that we have enough demand to keep our employees busy at all times, it annihilates our margin when that doesn't happen.\n\nSo those are the three prongs of driving higher gross margin.\n\nNaved Khan -- Truist Securities -- Analyst\n\nSo maybe just on that. So are you --\n\nGlenn Kelman -- Chief Executive Officer\n\nWait, can I just pause? Chris, do you have anything to add to that?\n\nChris Nielsen -- Chief Financial Officer\n\nThank you. Sorry about that. Just a comment here in terms of timing of gross margin changes. So Glad you gave an overall description of how we're thinking about gross margins going into 2023.\n\nAnd then just in terms of how you might think about it quarter to quarter, we do expect something that would be more consistent with the normal seasonality of gross margins that we've seen in the business where gross margins are lowest in the first quarter, they tend to tick up into the second quarter and then into the third quarter a bit higher than that and then pull back into the fourth quarter as volumes decline. So that's the general shape of what we would expect in any normal year, 2023 included. We do expect volumes to be down, but we don't expect the same amount of in-year volatility that we've seen this year.\n\nNaved Khan -- Truist Securities -- Analyst\n\nUnderstood. And then the follow-up I had is around liquidity. So I guess, with you guys deciding to exit iBuying and given that you still hold some inventory, just trying to figure out how much cash that would add to the balance sheet when once you come out of this. Give us as a sense of what that looks like.\n\nGlenn Kelman -- Chief Executive Officer\n\n$100 million -- it's $100 million in cash added to the balance sheet.\n\nNaved Khan -- Truist Securities -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nOur next question comes from Mike Ng with Goldman Sachs. Please state your question.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nHey, good afternoon. Thank you very much for the question. I was just wondering, given the improvement and momentum that you have in rentals, the exit of properties, and the cost savings, do you feel more or less confident or about the same regarding your 2023 EBITDA positive target? And then as a follow-up, I was just wondering on rental specifically. It's good to hear that you expect to see profitability in the fourth quarter of '23.\n\nDoes that suggest we might be at breakeven profitability for the full year? Or is it a little bit too early for that? Thank you very much.\n\nGlenn Kelman -- Chief Executive Officer\n\nToo early to be breakeven for the full year on Rent. We are not guiding to that. The business is doing extremely well. It's getting better week by week and month by month.\n\nBut we're going to stick to the guidance. It's going to break even in the fourth quarter, not for the full year. And then obviously, having Rent breakeven by the end of the year really makes it easier to have the overall [inaudible] That business has, in some ways, been a liability at least in 2021 and coming into 2022. It was just losing money hand over fist.\n\nAnd now they are raking it in. There's a tailwind in rentals, but they're also executing really well, and they have a unique product suite that we tried to describe in the call, that gives us great confidence that we're going to keep increasing sales while holding costs steady.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nThank you very much for the insights.\n\nOperator\n\nOur next question comes from John Campbell from Stephens Inc. Please state your question.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nHey, guys. With the reductions you've made, I know that's never an easy thing. The market's kind of left you with little choice there. But just if I zero in on the market, kind of how you guys are viewing the market, at this new staffing level and just overall opex, I'm just curious what kind of market you're positioned for.\n\nIs that something similar to what we've seen of late? Or is that -- are you being proactive in kind of reducing costs ahead of an expectation that housing continues to drop from these levels?\n\nGlenn Kelman -- Chief Executive Officer\n\nThe latter. We think that the housing market could get worse. We haven't seen U.S. home sales dip below 4 million units a year in decades.\n\nAnd the U.S. population has grown. So we looked at what happened between 2008 and 2011 and took that as a baseline, even though since then the population has grown about 10%. Now we're not just going to be a boat without a sail or a motor that floats with the tides in and out.\n\nWe need to take share, we need to kick butt. But we just see pretty strong traction, especially at the top of the funnel. Right now, our website is really, really taking search share from its competitors. And that is the best and most reliable indicator of top-line growth.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nYeah. That's very helpful. And then, I mean, to your point, you got a lot of kind of noise this quarter, a lot of moving parts here, but that was a very good outcome for you guys. I mean, with the reduction in demand overall and you guys seeing growth at the top of funnel, that's a very good outcome.\n\nBut I thought maybe the bigger theme here was the exceptional, the attach rate, 17% that was, I think, double -- over double what you guys saw last quarter. What do you attribute to that degree of lift? Is that bringing on and better integrating Bay Equity? Or what's the main call out there?\n\nGlenn Kelman -- Chief Executive Officer\n\nBay Equity is a great lender. It delivers fantastic service, but we also employ our real estate agents. And when you employ the agents, you can ask them to sell more them themselves. You can ask them to sell every product the company has got.\n\nSo we think that we can continue to drive attach rates higher. We're not getting much credit for it, and we shouldn't until Bay Equity generates a profit, but no lenders are generating a profit right now. So I just want to be clear that we can make more money for homebuyer because we can sell them more products, and we can sell every single one of those products at a profit. There's not going to be a loss leader where we're buying houses just so we can sell someone a mortgage or doing the mortgage just so we can make money on title.\n\nWe want every single one of these products to be profitable. And basically, John, just to make sure that I'm clear, we expect the market to be about 30% smaller in 2023 than it was in 2021. So there were 6.1 million units in 2021 and maybe there will be 4.2 million, 4.3 million units in 2023. And I can't help, I got to keep clarifying.\n\nIf there's less than that, we're going to have to adjust to that, too. But taking 2 million units out is already a lot.\n\nOperator\n\nOur next question comes from Mark Mahaney with Evercore. Please state your question.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thanks. You talked a little bit about -- you gave your macro housing outlook. And I think one of your simple points was that home balance sheets, residential balance sheets are just much stronger than they were back in '08,'09.\n\nBut what's your thought on the duration of the housing challenge that we're likely to see? Is this something that you think resolves itself within six to 12 months? What do you think are the odds that it could take much longer to resolve?\n\nGlenn Kelman -- Chief Executive Officer\n\nHope is not a strategy, Mark. We don't know how long it will take to resolve. So we have to assume that the sun will never come up, that it will be night always, and plan for a business that can make money in that environment. Trying to predict when the war in Ukraine will end, when inflation pressures will ease, when the Fed will back off is fool's errand for us.\n\nAll we can do is prepare for the market that we are in and to have the discipline to make money in that market instead of saying the sun is going to come out tomorrow. So I don't know, nobody can predict the future.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. All right, Glenn. That's a very fair point. Chris, one question for you on gross margins.\n\nThe business has sustained 30% gross margins in the past in the real estate services segment. When the sun is back out, just talk again about where those gross margins can go long term. Is there a reason that it's always going to be bound in that low 30% range? Is there something that would change in a model that would allow it to kind of go materially higher than that, not 40%, but kind of mid- to high 30s?\n\nChris Nielsen -- Chief Financial Officer\n\nI'm going to build off of Glenn's comments in the script here, and we talked about getting back to the 33% level that we saw in 2021. And we do believe margins can continue to rise from there. The biggest lever we have is also the one that Glenn talked about, and that's continuing to improve customer success rates, that we're meeting a lot of customers, and the better service we provide to those customers, the more of them that we can close, that more we improve gross margins. It's the best lever in the business.\n\nAnd we're really excited about some of the progress we're already seeing on that front. So that's the way we think things continue to march up from there.\n\nGlenn Kelman -- Chief Executive Officer\n\nThat's the 5-point lever from raising prices.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Jay McCanless with Wedbush. Please state your question.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nAfternoon, everyone. So with the actions you've taken today, any sense of what base opex, either on a quarterly or an annual dollar basis should be going forward?\n\nChris Nielsen -- Chief Financial Officer\n\nIt's not something that we've broken out for people. So there's not more detail that I want to add there. There are a variety of levers we still have on opex and decisions we'll make during the course of the year, including probably most prominently any kind of marketing that we do, how much we spend both in mass media and regular online advertising, that's a variable that will continue to fester in the year based on the kind of results we see from marketing campaigns.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nAnd then referring to the 8-K this morning with RedfinNow, it looks like from the end of October to the end of January, you want to reduce the dollars outstanding there by about two-thirds and then be completely out of that business by the end of 3Q. I guess it's kind of hard for me to believe you can move through the inventory that fast given how bearish you are on the overall housing market. Maybe could you walk us through that progression that you lined out in the 8-K this morning?\n\nChris Nielsen -- Chief Financial Officer\n\nSure. I'll comment here, which is just that this is the kind of sell-through that we've actually been seeing in the third quarter and continue to see into the fourth quarter. We provided revenue guidance for that segment between $220 million to $240 million. So that's an indication that we're continuing to see those homes move.\n\nWe are pricing the homes to sell them. We want to make as much profit as we can and of course, we're doing that, but we've also told the team that, a little bit to Glenn's earlier commentary, hope is not a strategy here. We're not waiting for home prices to improve. And so we have the prices marked where we think they are to be really competitive to sell.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nAnd last one, what are the plans to --\n\nGlenn Kelman -- Chief Executive Officer\n\nSorry, I just wanted to note that other iBuyers have sold 40% of the inventory that they bought in Q2 and we sold 67%. So we have a really large head start on liquidating our inventory.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nOK, great. And then just kind of walk us through with the $100 million potential cash coming back to the balance sheet, where does that get deployed? Or is that a rainy day fund?\n\nChris Nielsen -- Chief Financial Officer\n\nWe don't have a specific need or desire or investment area that we want to build in the business. So you should think about it as rainy day, but you should also think about it as us continuing to be really thoughtful about our capital structure, about the dollars we have in play, about the best investments the company could make. And so all that's on the table, but you shouldn't think of it as us taking those dollars and wanting to put them into opex or acquisitions or anything else.Great. Thanks for the questions.\n\nOperator\n\nOur next question comes from Tom Champion with Piper Sandler. Please state your question.\n\nJim Callahan -- Piper Sandler -- Analyst\n\nHi. This is Jim on for Tom. So I guess first on marketing. Is there any sort of change in strategy or any new channels that could be more compelling in a downturn? And second, on RedfinNow, I guess, can you discuss what the trade-offs might be for site traffic if we look out, say, two to three quarters? Thanks.\n\nGlenn Kelman -- Chief Executive Officer\n\nSo the shift in marketing strategy is mostly from a national buy to more local. We've gone back and forth over the years, and it just makes more sense to advertise locally because we're not like a Taco Bell where we make the same margin on Taco sold in Louisville or one sold in Manhattan. We make far more money when we sell more expensive houses, which are concentrated in coastal areas. So we're just going to deploy our advertising dollars more selectively to the highest margin markets.\n\nAnd then what was the second question?\n\nJim Callahan -- Piper Sandler -- Analyst\n\nThe -- just trade-offs for --\n\nGlenn Kelman -- Chief Executive Officer\n\nRedfinNow's impact on traffic.\n\nJim Callahan -- Piper Sandler -- Analyst\n\nYes, with RedfinNow.\n\nGlenn Kelman -- Chief Executive Officer\n\nZero. It may affect conversion. So this is something that we've said many times before that having a cash offer on the website got more of the visitors that we did have to contact us about selling their home. But what we noticed over the past six months is that once the offers really came down and a higher cost of capital was factored into the iBuyer price, the conversion started to suffer.\n\nSo when you're at 20%, 25% below what the consumer believes to be market value, the phones don't ring in the same way. And you might make more money and take more share just by advertising a 1% fee. So it certainly won't affect traffic, and we don't even think it will affect conversion that much.\n\nJim Callahan -- Piper Sandler -- Analyst\n\nGot it. OK. Thanks.\n\nOperator\n\nOur next question comes from John Colantuoni with Jefferies. Please state your question.\n\nUnknown speaker\n\nHi. This is Chris [inaudible] on for John. Can you just dig in a little more to the market share number you gave us? Is there anything more to call out about kind of drivers of that moderation from the last quarter? And then how are you thinking about share going into 2023? Any levers you could pull there to kind of offset any headwinds? Thank you.\n\nGlenn Kelman -- Chief Executive Officer\n\nWell, we thought there were two offsets to share, one, which we had warned investors about in the last call, which is just that when 5% of your sales force walks out the door and a June layoff, it's going to be harder to take share just because some of the customers are left in the lurch for those agents are actively trying to bring their customers over to a different brokerage. So we knew it would be hard to take share with that kind of disruption. But we also were just affected by the staying listing recommendation spot where new visitors came to the site, we weren't recommending listings to them, which has been instrumental in engaging visitors, getting them to stick with their site, and eventually contact our agents. And so now the website is cranking again better than ever because we've seen this significant increase in Google ranks.\n\nSo the top of the funnel should be better. We're going to have another layoff here disrupting our ability to take share. But we're fairly bullish about share because we have this top-of-funnel gain, and then we're also executing better in the middle of the funnel with higher close rates.\n\nUnknown speaker\n\nOK, great. Thank you.\n\nOperator\n\nOur next question comes from Curtis Nagle with Bank of America. Please state your question.\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nSo Glenn, just wanted to refocus a bit more on the elimination of the buyer refund. So look, I think this has been some of this kind of long feature in terms of marketing, sort of think about it as a customer acquisition tool, right, for you guys over the years. And I understand you guys have done at least a quarter or two of testing here and results have not been detrimental right, in terms of loss. But I just wonder if -- taking it out kind of over a longer period of time, that might be just hard to see in terms of what the impact to customer acquisitions or market share gains that you just may not have seen or not been able to see over a short period of time.\n\nI guess, how would you look at that?\n\nGlenn Kelman -- Chief Executive Officer\n\nWell, I'm the nutjob who has wanted the commission refund. Even though every time we've tested eliminating it, buyers have had no reaction. It is different on the sell side. We've also raised prices on the sell side from 1% to 1.5% when the customer doesn't also buy a house with us.\n\nAnd there, we did see a trade-off in share. But on the buy side, we haven't. I think some of the long-term effects that you're asking about are possible. I worried that the reason agents don't leave Redfin is because they have to offer their customers that buy-side refund at another brokerage.\n\nI'm worried that it helps with customer loyalty as well that customers come back for that refund. But we really haven't been able to pull that apart. We've run no refund in markets like Portland and in Missouri, where a refund is illegal. And they have the same agent retention, the same customer retention over many, many years.\n\nAnd so I just love saving customers' money. But right now, we got to make money. And so I'm so glad we did this. I should have done it a long time ago.\n\nI kick myself every morning that we didn't do it earlier. It's the right thing to do.\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking the questions, folks.\n\nOperator\n\nOK. That was our final question. I'll turn it back over to you for any closing remarks.\n\nMeg Nunnally -- Head of Investor Relations\n\nWe're at the top of the hour. So thanks, everyone, for joining, and have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMeg Nunnally -- Head of Investor Relations\n\nGlenn Kelman -- Chief Executive Officer\n\nChris Nielsen -- Chief Financial Officer\n\nTom White -- D.A. Davidson -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nNaved Khan -- Truist Securities -- Analyst\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nJim Callahan -- Piper Sandler -- Analyst\n\nUnknown speaker\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nMore RDFN analysis\n\nAll earnings call transcripts"
}