{
  "companyName": "Riskified Ltd.",
  "companyTicker": "RSKD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/riskified-ltd-rskd-q2-2022-earnings-call-transcrip/",
  "content": "Riskified Ltd. (RSKD -1.91%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Riskified second quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Chett Mandel, head of investor relations.\n\nChett Mandel -- Investor Relations\n\nGood morning and thank you for joining us today. My name is Chett Mandel, Riskified's head of investor relations. Riskified is hosting this call to discuss its second quarter earnings results for the period ended June 30, 2022. Participating on today's call are Eido Gal, Riskified's co-founder and CEO, and Agi Dotcheva, Riskified's chief financial officer.\n\nEarlier this morning, Riskified issued a press release announcing its financial results for the second quarter of 2022. A copy of this press release has been furnished with the SEC on Form 6-K. Before we begin, I want to remind you that matters discussed on today's call will include forward-looking statements related to our operating performance, financial goals and business outlook, which are based on management's current beliefs and assumptions and are not guarantees of future performance. You should not put undue reliance on any forward-looking statements.\n\nPlease note that these forward-looking statements reflect our opinions as of the date of this call and except as required by applicable law, we undertake no obligation to revise this information as a result of new developments that may occur after the time of this call. Forward-looking statements are subject to various risks, uncertainties and other factors, some of which are beyond our control that could cause our actual results to differ materially from those expected and described today. In addition, we are subject to a number of risks that may significantly impact our business and financial results. For a more detailed description of our risk factors, we encourage you to read Riskified's periodic and other SEC filings, where you can review the discussion of factors that could cause the company's actual results to differ materially from these statements.\n\nA replay of this conference call will be available on our website under the investor relations section. I would also like to remind you that during the call, we will discuss some non-GAAP measures when talking about Riskified's performance. The presentation of this financial information is not intended to be considered in isolation or as a substitute for or superior to the financial information prepared and presented in accordance with GAAP. We use these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons.\n\nWe believe that these measures provide useful information about operating results, enhance the overall understanding of past financial performance and future prospects and allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making. You can find a reconciliation of those non-GAAP measures to the nearest comparable GAAP measures in the earnings press release issued and furnished with the SEC on Form 6-K today and in our prior filings with the SEC, all of which is posted on our website at ir.riskified.com. I will now turn the call over to do Eido Gal, Riskified's co-founder and CEO.\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nThanks, Chett, and hello, everyone. Since the year started, I have been and remain very confident in our go-to-market strategy, the traction with our pipeline of new and existing clients, our strong financial position and our ability to optimize our expense base through careful cost saving measures as we will further discuss on this call. We believe that the impact of the decisions that we have made to support the growth of the business is clearly seen in our results. We continued our positive momentum from the first quarter with another strong quarter, having achieved quarterly revenue of $60 million, up 8% year over year.\n\nIn the face of the current macroeconomic landscape, I am pleased that we were able to continue to increase the amount of gross merchandise volume that we reviewed with $25 billion reviewed during the quarter, up 18% year over year. Overall for the first 6 months of the year, our business continues to perform well, and we generated exceptional outcomes for our merchants while continuing to grow, capture market share and scale our platform. Conversations with our merchants have continued to shift from how do we rapidly grow and fulfill unprecedented amounts of orders at any cost to how can we drive uplifted revenues in a sustainable and profitable manner. The good news for Riskified is that in times like these, we have the ability to help merchants solve this problem through increasing conversion rate while simultaneously decreasing their fraud-related expenses.\n\nWe believe that the ROI that we can offer today is even more compelling and is a much stronger value proposition than non-guaranteed decision, which can't address these same problems. Proof of the continuing success that we are having with our merchants was seen in our revenue growth during the quarter, which was primarily driven by new merchants revenue added in the past 12 months and upsells within portions of our existing customer base. With the addition of these new merchants, we continue to see our top merchant concentration decrease as a percentage of total to reflect a more balanced portfolio. In addition, we continue to be well diversified across verticals and geographies.\n\nIn fact our top 10 new merchants in the quarter were spread across five different industry areas and three separate geographies. We expect this broad-based and diversified positioning to allow us to continue being resilient across varying macroeconomic environment and throughout different consumer buying patterns. Overall I'm very encouraged by our first half performance and our ability to execute on the goals that we set for ourselves at the beginning of the year. Our top priority for the second half and beyond is to continue to improve efficiency and reduce our overall expense base to recognize additional operating leverage.\n\nIn order to accomplish this and to help accelerate our path to profitability, we recently reevaluated a number of areas in our expense base, which we will further discuss on this call. As part of this process, we came away with a clear plan, lower hiring pace, a deeper understanding of where to prioritize our investment dollars and how to limit incremental spend while finding opportunities to reduce our overall cost structure. We do not anticipate that this expense reevaluation will impact our long-term growth trajectory. I'm really excited about the progress that we are making in accelerating our path to profitability, and Agi will expand on what this means for our financial outlook.\n\nBut before that, I want to reiterate a few key points on our ability to deliver long-term value for our merchants and shareholders. First, I continue to believe that the overall addressable market is large and growing despite a recent general slowdown in some areas of the global economy. Within this large universe, we are a clear market leader of fraud solution. We believe that we have a superior data advantage to enable the best outcome and operational improvements for our merchants, which is recognized throughout our relationships with many of the world's largest and highest quality merchants.\n\nSecond, the stickiness of these relationships has been through an incredible over 99% customer retention rate. These relationships are deeply integrated and can be challenging to approve. Combined this with the fact that we are on track to review approximately $100 billion in GMV on an annualized basis in 2022, we have created what we believe to be unrivaled positioning for ourselves in this industry. Third, I am excited to partner with Riskified's new president of worldwide field operation, Ravi Kumaraswami, on our go-to-market strategy.\n\nI believe that Ravi's proven technology leader with more than 20 years of experience will build upon our existing momentum and spearhead the go-forward sales strategy by focusing on identifying new opportunities to further accelerate our growth. Fourth, through our very strong balance sheet and financial position, we believe that we have the financial flexibility to pursue profitable growth. And finally, I believe that we have a tremendous asset and the fact that we have operated the company in a profitable manner in prior periods and we know the levers of both and processes to prioritize in order to get back to it. I'll now turn it over to Agi, who will cover the financial results in more detail.\n\nAgi Dotcheva -- Chief Financial Officer\n\nThank you, Eido, and thank you, everyone, for joining today's call. As Eido mentioned, our GMV for the second quarter was $25 billion, reflecting an 18% year-over-year increase. We also achieved record second quarter revenue of $60 million, up 8% year over year. The growth in GMV and revenue during the quarter was primarily driven by the continued expansion of our platform across new merchants and sells and further penetration across industries and geographies.\n\nWe continue to benefit from having broad diversification across the industry. During the second quarter, we enjoyed ongoing growth across our emerging categories and continue to benefit from sustained growth across other categories like fashion and luxury goods and electronics. As expected, tickets and travel continue to rebound to be at or above pre-pandemic levels and was the most meaningful area of growth during the second quarter. Alongside the positive traction we are seeing in the business, some of our more mature merchants declined year over year due to softening global e-commerce activity and other macroeconomic factors such as the aging of COVID restrictions, PSD2, rising interest rates and supply chain issues.\n\nFrom a geographic standpoint, while we saw ongoing softness in the U.S., particularly in the stay-at-home category, we continue to have momentum outside of the U.S. We saw strength in EMEA following the recovery of tickets and travel and through the addition of new merchants and once again, in APAC, which is an important and growing market for us. Continuing with gross profit margin. As we've mentioned in the past, gross profit margin is a metric that is best analyzed on an annual basis.\n\nAs individual quarters can fluctuate mainly due to the changes in the industry mix of our billings, seasonality factors, the ramping of new merchants, the varying risk profile transactions approved and other business priorities. Our non-GAAP gross profit margin of 52% was consistent with the first quarter of 2022, and we remain on track to meet our annual non-GAAP gross profit margin target of 51% for 2022. Total non-GAAP operating expenses for the second quarter were $44.6 million, up 39% year over year, but it's important to note that they were essentially flat on a sequential basis. During the second quarter, we initiated a plan to efficiently and thoughtfully reduce our operating expenses.\n\nThe investments that we made in 2021 through 2022 were instrumental to help our growing merchant base, manage a broader range of high-value use cases and enhance our ability to support our new geographies. We're already recognizing some of the benefits of this investment, and we believe that will generate high ROI. Going forward, in order to match the additional level of investments to the opportunities in the current macro environment, we undertook a wide press evaluation of our overall expense base and identified key areas of cost optimization. As a result of this process, we successfully identified areas of opex improvement, which in total should generate savings of at least $10 million in 2022.\n\nWe believe that these cost savings are not one-time in nature and will continue to benefit the company on a run rate basis. The biggest driver of this savings was modifying our hiring plan for 2022. For the remainder of 2022, we expect to slow hiring to only the most strategic and high-impact areas of the company. We now expect only a modest increase in total headcount versus the beginning of 2022 and will benefit from lower costs associated with this minimal headcount growth.\n\nSome other areas included optimizing tools assistance through negotiation of long-term contracts and usage, evaluating nonessential marketing spend and identifying processes to increase the productivity of our current internal teams. We believe that we'll be able to reduce spend in these areas while keeping our long-term plans for growth intact. Adjusted EBITDA loss for the second quarter was negative $13.6 million and negative $27.1 million for the first half of 2022. We successfully decreased our adjusted EBITDA loss from our previous guidance and are excited and confident about our more aggressive trajectory to profitability.\n\nIn addition, free cash flow was negative $13.3 million for the second quarter and negative $23.3 million for the first six months of the year. Our free cash outflow remains closely aligned with our adjusted EBITDA results. Moving to the balance sheet. We maintain a fairly strong liquidity position, which we anticipate to be more than sufficient to support the investments we're contemplating as we aim to move toward profitability.\n\nWe ended the second quarter with approximately $498 million of cash and deposits on the balance sheet and we carry zero debt. And now turning to our updated guidance outlook for 2022. For the full year of 2022, we are revising upward our guidance ranges that we introduced in late February and that we reaffirmed last quarter. For the full year 2022, we now anticipate revenue to be between $255 million and $258 million, up from our previous guidance of $254 million to $257 million.\n\nThe updated revenue guidance assumes currency rates against the USD remain stable to current levels, and we will monitor other macroeconomic factors such as supply chain issues, inflation and the broader e-commerce environment. In terms of quarterly phasing, we expect our third quarter revenue to maintain strength in tickets and travel in the fourth quarter to reflect seasonal softness due to broader e-commerce and retail uncertainty that may persist during the holiday shopping season. The improved revenue guidance and opex improvements we discussed earlier are expected to generate savings of at least $10 million this year are leading us to meaningfully improve our adjusted EBITDA guidance to be between negative $54 million and negative $57 million from negative $66 million and negative $69 million in our prior guidance. For modeling of 2022 annual EPS, we expect a weighted average share count of approximately $167 million.\n\nOverall we're pleased with our second quarter and first half results and we remain excited about our continued prospects for long-term growth. We are encouraged by our ongoing success with new merchants, reopening trends in the tickets and travel industry and the contributions from our global go-to-market investments. Thank you all for the time. This concludes our prepared remarks.\n\nWe look forward to continuing to report our progress to you in the coming quarters. Operator, we are ready to take the first question, please.\n\nOperator\n\n[Operator instructions] And our first question comes from Terry Tillman of Truist Securities. Please proceed.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nHi. Good morning. Can you hear me OK?\n\nAgi Dotcheva -- Chief Financial Officer\n\nWe can hear you great.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nWonderful. And I have two questions. First question, just maybe building on some of the comments on tickets and travel. Could you kind of double-click though, in 2Q? Because you do have some large customers there, but was it broad-based across kind of the whole universe of your TNT customers and was it more existing customers just really having their business perk up? Or did you have some newer wins that were coming online also that affected the tickets and travel? And then the second part on tickets and travel is Agi, I think you said kind of depends in 3Q.\n\nShould GMV be up somewhat in 3Q on tickets and travel? And then I have a follow-up.\n\nAgi Dotcheva -- Chief Financial Officer\n\nYeah, Terry, thank you for the question. So since the second half of last year, we have been seeing strong performance in tickets and travel clients with many returning at three or above and beneath level, more or less. And additionally, as you just mentioned, we have been adding merchants in this area and expanding with existing merchants. So that's across a number of logos.\n\nAnd regarding Q3, overall, we're optimistic, but also cautiously observing these trends into the later quarters because of the year just to see how the momentum kind of goes on.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nOK. And then, just a second question. It's nice to see this faster pace to profitability. But what I'm curious about is, I mean, should this trend line continue? And anything you can share on maybe when would give a breakeven point? And the second part of this is Ravi is on board, congrats on that.\n\nWe've heard great things about him. Is he going to be able to have the wherewithal to be able to add to the sales force still?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nOK. Terre, so I'll take that. So yes, we're definitely very happy and excited about that reevaluation. That resulted in an accelerated cost of profitability.\n\nWe really found great areas, I think to do more with less headcount, just optimize the systems, processes and costs, so becoming a bit leaner while keeping the long-term trajectory intact. We definitely think that the savings are ongoing in nature, and we'll continue to look for ways to find more optimizations. And as we kind of progress throughout the year and get closer to the guidance for '23, we can talk about how that would impact those numbers. With Ravi, we're incredibly excited to have him on board.\n\nIt's been an amazing initial 90 days. I can tell you that the things that excited me most when I met him, is both his experience at Ariba and leading the go-to-market functions there and the success he's had over there. And most recently, he was CEO of a company called Crownpeak and he was really able to drive profitable growth. So I think we're really aligned on kind of the -- we had a great opportunity the first 90 days to align and the go forward with the market strategy.\n\nAnd I think we both feel that with this updated plan, he definitely has the tools he needs to go out and achieve success in the market.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Tien-Tsin Huang of J.P. Morgan.\n\nPlease proceed with your question.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nThanks so much. Healthy results here. I was curious if you're changing your risk appetite at all given some signals of potentially a weaker consumer and what that might mean for your financials if that's the case. I'm asking because we've heard this earnings season to shift toward credit, for example, and some credit tightening with some of the different players.\n\nSo I'm just curious how you're seeing that and how your risk performance has been even through the most recent weeks.\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nWe feel great with the results for the quarter. On the churn back, they've been trending better than anticipated and guided for, and we continue to anticipate to see improvements on a cohort basis as we progress.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nThat's great to hear. I know that, obviously, the gross margin and what that was great. So on the storing of the hiring with the expense reevaluation as you just went through, I'm curious what -- are you narrowing your focus in certain areas? What areas are maybe being deferred? What are you -- what's nonnegotiable on your side from an investing standpoint?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nWell, that's a great question. I think really what we did to give a few examples to make it a bit more concrete, right? Let's say there's a new geography we're going after. So instead of having 15 people initially will have 10, right? So we're really keeping the same opportunities both on the go-to-market side and on the product side. But we're finding the areas where we can achieve the same financial outcomes if we believe a smaller number of head count.\n\nSo that's really the change.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nVery clear. Thank you.\n\nOperator\n\nThank you. One moment. And our next question comes from Ramsey El-Assal of Barclays. Please proceed with your question.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thanks so much for taking my question this morning. I wanted to follow up with a question on tickets and travel. And I'm just trying to get a sense relative to 2019 of what tickets and travel is as, say, a percentage of volume.\n\nReally, I'm really trying to get at is how much room there is to run from this point on in terms of the recovery of that segment that vertical.\n\nAgi Dotcheva -- Chief Financial Officer\n\nYeah, sure. Ramsey, thank you for the question. So I think what we mentioned in the past, we were around 6%, but it's just when COVID hit, but that was also partly driven of the shrinking of the industry. A lot has happened since then.\n\nAnd as I -- as I just mentioned earlier, on one hand, we've seen the recovery. And just on that base, we see most of our merchants. And of course, there's variability between different ones, but most of them are pre-pandemic levels, some are still below. But overall, as a cohort as a group, we think that they are somewhere at or above.\n\nAnd separately, the other parties, we've been adding new logos in new merchants. And I think this is like a very important driver to continue to expand in this category. And if you see our performance in EMEA and our growth there is really substantial and meaningful and a lot of it is driven by some of the recovery and the growth of emerging in this category.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nOK. Thank you. And a follow-up for me is I just wanted to ask about the sales pipeline. I guess, you just mentioned in your response now that you're adding new logos in that category.\n\nI was just curious, and just A, for an update on the sales pipeline; but b, is the macro environment having an impact on decisioning. I know the e-commerce backdrop is tough. I'm trying to think whether that causes merchants to pause a little bit or if it's the opposite where they think now is the time that I need to implement this because I need to boost my sales and drive savings, etc. Maybe just a couple of comments there would be helpful.\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nRamsey, so we feel very excited and happy with the performance of the go-to-market team in the first half and really good about the pipeline entering the second half. I think that the current macro environment is helping our messaging resonate more and more with merchants -- because remember, we're guaranteeing in cost savings while driving incremental sales. So we do see that resonating a bit better in this environment.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nThat makes a ton of sense. Thanks so much.\n\nOperator\n\nThank you. One moment. And our next question comes from Will Nance of Goldman Sachs. Please proceed.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys. Good morning. Appreciate you taking the question. I appreciate all the detail on the expense review this quarter.\n\nI wanted to just ask, I think you made the comment something on the lines of like this isn't a onetime reduction, but something that should benefit you guys going forward, and it doesn't change the long-term growth trajectory. Just wondering if it kind of changes your thought process then around terminal margins and where the business can get to over time?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nI don't think there's been any change in the terminal margin or long-term opportunity from a growth perspective.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. Appreciate that. OK. And then, a follow-up question.\n\nI just wanted to ask about your distribution strategy after the recent FIS partnership with the competitor. I'm just wondering how you guys are thinking about the ability to distribute products or kind of partner with payment processors to kind of extend the reach of the business beyond direct sales?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nThat's a great question. So let me -- too many parts, right? No. 1, we see the most success with enterprise clients because we're consistently the most accurate solution and these complex enterprise organizations can choose best-of-breed solutions, even though they tend to run multiple gateways and acquirers, right? So we really think the direct relationship and integration we have with them provides us with that ability to outperform others in the market. Now, when we think about kind of how do we attack the lower tier, it's definitely something that these various partnerships could be helpful with.\n\nAnd you know that Robes kind of earning out the overall go-to-market strategy and plan. It's definitely something that's on his agenda, right? So that would be No. 1. No.\n\n2, I think it's a great validation of the chargeback guarantee model in the market, which we continue to benefit from.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. Makes sense. Appreciate the questions and nice results.\n\nOperator\n\n[Operator instructions] And our next question comes from Dylan Wright of Credit Suisse.\n\nDylan Wright -- Credit Suisse -- Analyst\n\nHey, guys. This is Dylan on for Tim. Can you please give us an update on the discretionary versus nondiscretionary mix of GMV or billings in the quarter? And as a quick follow-up to that in a different way, what percentage of billings was related to tickets in travel in Q2? And how does that compare versus last year? I believe last quarter, it was 20% of billings in Q2. And how does that compare versus last year? I believe last quarter, it was 20% of billings versus 6% in Q1 2021.\n\nAnything there would be great.\n\nAgi Dotcheva -- Chief Financial Officer\n\nAny further question? So answer the second part first. If I think about the market share, as I said, we've been expanding both through existing customers, we're also adding new. So I believe we saw this growth also sequentially from Q1 to Q2. I don't have the exact numbers on top of my head, but it's a very nice and meaningful growth overall compared to last year.\n\nAnd on the second question -- can you just -- I'm sorry, can you repeat the first part?\n\nDylan Wright -- Credit Suisse -- Analyst\n\nYes, yes. Just trying to get a sense of the discretionary versus nondiscretionary mix of GMV or billings.\n\nAgi Dotcheva -- Chief Financial Officer\n\nYeah, yes, of course. So we're very diversified. And if I look at all the trends that are impacting our portfolio of merchants, I'll probably not call out this one is a major one. I will think more about the growth of services type of the business versus some of the other kind of safe home category.\n\nThis is a trend that is much more prevalent and is a good driver. And that we've seen some of the kind of the safe home merchants and some of their reports, as well as the public companies, they've shown like a tough year-over-year comparison as well and kept the trend of continuing to decline. And in terms of discretionary, nondiscretionary, as I said, I don't think there's anything tools in fact to kind of report on anything different from last quarter.\n\nOperator\n\nThank you. One moment. Our next question comes from Brent Bracelin. Please proceed.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGood morning. Thanks for taking the call. I wanted to double-click into the ticketing and travel section. Obviously, understand the strength there, but what's driving new logo momentum? And perhaps could you talk a little bit about expectations for ticketing and travel in Q3? Are you seeing any sort of kind of macro headwinds impact that segment given obviously, there's a little more macro risk in Q3 here?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nBrent, so actually, over the past year, we've seen a lot of traction and movement in the ticket and travel space, as we've helped them streamline and automate their operations in a very scalable way. And now that volumes are picking up, we're really seeing that and enjoying that. So I think it's more around the value proposition of streamlining and automating the process. And I'll let Agi take the second part.\n\nAgi Dotcheva -- Chief Financial Officer\n\nYeah, it's still healthy and expected to remain strong. So work I things will continue to enjoy the momentum.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGreat. And is there some sort of like critical mass within ticketing travel that's kind of driving additional new logo momentum? Is there any sort of data advantage that's playing to your hand here in that vertical? Any color on kind of over the last year, you're getting the momentum. I get that you can streamline and automate, but within that space, is there becoming a data moat for you at all?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nThat's a great point. And definitely, as we're seeing more and more success, we're able to improve performance for everyone within our network, especially within the tickets of travel domain. We mentioned that we're on a run rate to do $100 billion plus of guaranteed GMV that give us certainly the largest guarantee vendor, but one of the largest vendors in that space. So it's -- yes, it's a competitive note, like you mentioned.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nHelpful color. And then, Agi, as you just think about some of the cost improvement you now have put in place in the model. How are you thinking about that path to breakeven and beyond. Maybe you could help us kind of bridge how you're thinking about kind of getting there.\n\nAgi Dotcheva -- Chief Financial Officer\n\nYeah. If I think of some of the areas that we've looked into, which is kind of starting with some of the modifying in the car front, but also looking efficiency across a number of processes and tools that we use, I think it's a very meaningful and a very exciting step and step forward and which accelerates our cost of profitability. And we're all very much focused as a team, as a company to kind of take through the execution. So I'll say this is a great first step.\n\nThere's always areas we'll continue to sharpen our pencils. We continue to progress.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGreat to hear. Thank you.\n\nOperator\n\n[Operator instructions] And I'm showing we have a question from the line of Robert Napoli with William Blair. Your line is now open.\n\nRobert Napoli -- William Blair and Company -- Analyst\n\nGood morning, everyone. Thank you. Nice to see the trends and the results. A question, I think, Eido, I mean, your target growth rate was -- has been 25% to 30% with a combination of 10% to 15% e-commerce growth, 15% growth in new logos.\n\nDoes that still -- what is your, I mean, there's a lot of discussion and disagreement around the e-commerce growth rate over the long term. But just any thoughts on your long-term growth rate that -- growth rates that you had out there previously as we move into 2023 and beyond?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nGood question. Good question. So look, we're really happy with the performance in the first half. In the second quarter, similar to the first quarter, most of kind of the gain was driven by net new logos and upsells to our existing clients.\n\nSo really, when you think about the organic growth in combination kind of with the regulatory impact, it was negative, right? So really the results we're seeing a result of kind of that strong growth. And we've guided to and anticipate better numbers in the back half of the year.\n\nRobert Napoli -- William Blair and Company -- Analyst\n\nAnd on e-commerce growth rates?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nYeah. We think there's still going to be more challenged than the standard this year.\n\nRobert Napoli -- William Blair and Company -- Analyst\n\nOK. And then, just on the path to profitability, I just wanted to follow up on that. I mean, can you put a timing in general on when you would expect to get to like EBITDA positive? Is that something that you think is achievable by 2024?\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nLook, I think we've run the business on a profitable basis before, and we know the different levers to pull in order to get there. We're really happy with the reevaluation and kind of the immediate steps we've taken and the accelerated path. And we want to continue to sharpen on pencils on additional areas to create those things. We want to be thoughtful as we think about 2023 over the next few quarters.\n\nAnd once we do that, we'll be happy to share in more updates and a better guide.\n\nRobert Napoli -- William Blair and Company -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nAnd I'm showing no further questions. So with that, I'll hand the call back over to Eido for closing remarks.\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nAll right. Thank you, everyone. Talk soon in a few months.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChett Mandel -- Investor Relations\n\nEido Gal -- Co-Founder and Chief Executive Officer\n\nAgi Dotcheva -- Chief Financial Officer\n\nTerry Tillman -- Truist Securities -- Analyst\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nWill Nance -- Goldman Sachs -- Analyst\n\nDylan Wright -- Credit Suisse -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nRobert Napoli -- William Blair and Company -- Analyst\n\nMore RSKD analysis\n\nAll earnings call transcripts"
}