{
  "companyName": "Fossil Group",
  "companyTicker": "FOSL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/fossil-group-fosl-q2-2022-earnings-call-transcript/",
  "content": "Fossil Group (FOSL 3.61%)\nQ2 2022 Earnings Call\nAug 10, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the Fossil Group's second quarter 2022 earnings call. At this time, all parties are in listen-only mode. This conference call is being recorded and may not be reproduced in whole or in part without written permission from the company. Now, I'll turn the call over to Christine Greany of The Blueshirt Group to begin.\n\nChristine Greany -- Investor Relations\n\nHello, everyone, and thank you for joining us. With us today on the call are Kosta Kartsotis, chairman and CEO; Jeff Boyer, chief operating officer; Sunil Doshi, chief financial officer; and Greg McKelvey, EVP and chief commercial officer. I would like to remind you that information made available during this conference call contains forward-looking information, and actual results could differ materially from those that will be discussed during this call. Fossil Group's policy on forward-looking statements and additional information concerning a number of factors that could cause actual results to differ materially from such statements is readily available in the company's Form 8-K and 10-Q reports filed with the SEC In addition, Fossil assumes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nDuring today's call, we will refer to constant-currency results. Please note that you can find a reconciliation of actual results to constant-currency results and other information regarding non-GAAP financial measures discussed on this call in Fossil's earnings release, which was filed today on Form 8-K and is available in the Investors section of fossilgroup.com. With that, I'll now turn the call over to Kosta.\n\nKosta Kartsotis -- Chairman and Chief Executive Officer\n\nGood afternoon, everyone, and thank you for joining us today. In our second quarter, we were impacted by a challenging and complex macroenvironment in each of our operating regions. As a result, our quarterly sales were down 10% versus last year or down 5% in constant currency. Broadly speaking, there were a number of diverse factors contributing to top-line softness.\n\nThe first was that the consumer is not responding the way they did last year. We saw shifts in spending in the quarter with rotation out of goods and into services and travel. There are also signs that higher levels of inflation impacted discretionary spending, especially against the backdrop of last year's stimulus in the United States. In some cases, higher levels of inventory across many categories that some of our largest wholesale partners translated to fewer replenishment orders in the quarter.\n\nAlso, ongoing COVID-19 restrictions pressured sales significantly in Mainland China. And lastly, foreign currency headwinds intensified and accounted for approximately $18 million or 430 basis points of impact to net sales in the quarter. From a regional perspective, these factors affected consumer behavior and our sales performance in somewhat different ways. In the Americas, Q2 sales were down 4% in constant currency.\n\nTraffic was up nicely in our physical stores, with comps up nearly 20%, while e-commerce showed a decline due to the tough comparisons from last year. Our wholesale partners were impacted by across-the-board increases in inventory levels, which caused them to be conservative on replenishment orders. From a consumer perspective, traffic and average dollar sale has been positive versus last year in our stores and online, while the conversion is lower. And from a category lens, we have seen some category growth data that suggest that the overall traditional watch market is down versus last year, but up versus 2019, indicating to us that last year's stimulus activity drove higher sell-through.\n\nBoth our jewelry and leather categories showed strong growth. In Europe, where constant-currency sales declined 3%, consumers were out in physical stores with much lower COVID-driven restrictions during the quarter. Sales were up in both our retail stores and in our shipments to brick-and-mortar wholesale. Offsetting the growth in physical locations was a decline in digital sales, both our own e-commerce sites and pure-play accounts primarily driven by lower traffic.\n\nAnd as expected, FX headwinds contributed significantly to our overall sales results. More broadly, category sales data in key markets continue to highlight that our brands are seeing some modest improvements in market share. Turning now to Asia. Constant-currency sales declined 6%.\n\nAs we anticipated, ongoing COVID restrictions in both digital and nondigital channels continued to dampen sales in Mainland China. As we exited the quarter and some of these measures eased, we have seen some modest improvement, although sales are still down double digits. Our business in India continues to operate at a strong pace. We saw a nice sequential improvement in quarterly revenue, where consumer demand for the Fossil brand remains strong.\n\nOur go-to-market strategies and localized marketing efforts have created strong brand equity with the Indian consumer, providing a solid foundation for future growth. Beyond China and India, other markets in the Asia region, including Japan, Malaysia, Singapore, and Australia, have returned to more consistent and predictable revenue growth as countries have reduced the COVID restrictions. From a brand perspective, our Fossil business has been relatively strong, and we are pleased with the results in Q2. Net sales for the Fossil brand were up 7% and increased double digits in traditional watches.\n\nOur newness in marketing are helping us to gain market share in our largest markets. Our Fossil leather and jewelry businesses had double-digit growth and represented one-third of the global Fossil business. We had better stock positions in these categories and had increased product marketing in-store and online. These businesses both have significant long-term growth potential, and we are putting additional resources behind them.\n\nImportantly, our design and marketing capabilities give us confidence in our pathway for sustainable future growth, and we are focused on innovation in product and marketing. As part of that, we are using innovative collaborations to connect with existing and new consumers and to create more brand heat. Our recent collaboration with Jeff Staple is a great example of this. Last month, we introduced a Staple and Fossil collection, spearheaded by the streetwear legend and designer, Jeff Staple.\n\nThis garnered a great deal of attention for both consumers and media, creating a big brand heat moment for the brand. In our licensed brands, traditional watch sales were down, particularly in Mainland China, where COVID restrictions persisted, creating a year-over-year headwind. While the declines have been sharply impacted by COVID-driven restrictions since Q4 of 2021, the market potential for fashion watches in the region remains large over the long term, and we are well-positioned to capture growth as the conditions improve over time, particularly through our digital-first capabilities. Our jewelry category remains robust, and we have seen a nice trend for several quarters, including Q2, with broad-based growth across brands and channels.\n\nWe remain encouraged by what we see as a long runway for growth for branded fashion jewelry. Turning now to smartwatch sales. Sales in the category lagged in Q2, with growth in Asia more than offset by declines in the Americas and Europe. Heading into holiday, we expect sales trends to improve with the recently launched Gen 6 hybrid platform and our refresh of Gen 6 with Wear OS3.\n\nBoth platforms will work on our proprietary new Smartwatch app, which will have an improved wellness feature set. Both Gen 6 with Wear OS3 and our app are planned to launch in time for holiday 2022 selling. We are particularly excited about the Smartwatch app as it will enable us to get first-party data and engage with our customers at a higher level. Now looking to the back half of 2022.\n\nBased on the macro dynamics that intensified in Q2, we are taking a more cautious view of the consumer across all three of our geographies. Our revised outlook, which Sunil will cover in more detail, reflects that our wholesale business will remain challenging and that we have reduced our prior expectations for a return to normalcy in our China business this year. As we navigate the near-term outlook, we continue to focus on our key priorities and opportunities. We will continue to invest in initiatives to drive brand heat through design and merchandising capabilities across watches, jewelry, and leathers.\n\nOur digital investments, which are being directed to both technology and talent, are expected to drive a number of significant enhancements in the coming quarters that will not only increase our active customer list, but also fuel deeper engagement with our existing file while helping us attract new customers. In closing, a big thanks to all of our Fossil team members all over the world for their relentless pursuit of excellence. And now, I'll turn the call over to Sunil.\n\nSunil Doshi -- Chief Financial Officer\n\nThanks, Kosta, and good afternoon, everyone. I'll first start with some additional commentary on the second quarter and then provide an update to our full year outlook. Q2 net sales came in at $371 million, down 10% year over year and down 5% on a constant-currency basis. The stronger dollar resulted in 430 basis points of headwind to our revenue.\n\nLet me break down our sales by region. Sales in the Americas region were down 4% in constant currency. Our direct-to-consumer channels led the region with 6% total growth, which was driven by comp store sales of nearly 20%. Consumer traffic in the U.S.\n\nand Canada were up even greater, and spending was strong versus last year, particularly in watches, leathers, and jewelry. From a wholesale perspective, net sales declined 10% in constant currency in the region. Many of our wholesale partners entered the quarter with elevated inventory levels compared to last year, particularly in our licensed brands. This led to fewer than expected replenishment orders during the quarter.\n\nSellout trends in the channel were down 10% versus last year, but up versus 2019, which we attribute to lapping last year's stimulus-driven activity. As a group, we saw gains in share in the category. Exiting the quarter, inventory levels within our key wholesale partners have come down significantly relative to the start of Q1, but are still higher than last year. Moving to Europe.\n\nConstant-currency sales declined 3%. Similar to the Americas region, our direct-to-consumer channels in the region outperformed wholesale channels as consumers were clear of COVID-19 restrictions compared to last year and the Omicron surge of late 2021, early 2022. DTC sales increased 13% with store comps over 50% as consumers rotated from online shopping to brick-and-mortar. In our Fossil stores, we saw robust sales in our traditional watches, jewelry, and leathers.\n\nSales in our wholesale channel were down 9% to last year. A key callout here, net sales into traditional brick-and-mortar wholesale were positive versus last year as many wholesale accounts across the Eurozone replenished inventory to support consumers who were shopping the channel post-COVID-19 restrictions. Offsetting brick-and-mortar gains, we saw a reduction in shipments into key wholesale digital accounts, which included a timing shift for Amazon's European Prime Day event from Q2 last year into Q3 of this year. In Asia, sales were down 6% in constant currency.\n\nSales in Mainland China were down 43% versus last year in constant currency, but still up 14% versus 2019. Other markets that have historically benefited from Mainland Chinese tourists, such as concessions in Korea and travel retail throughout the region, were also down compared to last year. Outside of these markets, revenue grew by 19% as we saw more of a return to normalcy in consumer demand. And as Kosta mentioned, sales in India were robust, up triple digit to last year's COVID-impacted levels and up sequentially versus Q1 of 2022.\n\nFrom a channel perspective, global digital sales decreased 21% versus a year ago and represented approximately 35% of our total sales mix. As a reminder, digital sales include sales on our own e-commerce sites, global third-party platforms, and wholesale.com. Similar to last quarter, our digital sales were down in our Asia region in Q2, primarily from Mainland China, where the majority of our sales are digitally driven and the impact of COVID policy has shifted consumer spending away from our category. Second, in Europe and the Americas, traffic declined to our own e-commerce sites and digitally based wholesale accounts have contributed to our digital sales decline in the quarter as consumers pivoted more strongly to physical stores with eased COVID restrictions.\n\nHowever, as Kosta mentioned, global comps in our retail stores were up over 30% as we were able to capture consumer demand that pivoted back to brick-and-mortar. We ended the quarter with 349 company-owned stores, down 10% versus a year ago as we continue our program to rationalize our store base and improve our overall store profitability. Turning to category performance. In Q2, traditional watch sales decreased 7% in constant currency with double-digit growth in the Fossil brand, offset primarily by declines in our largest license brands.\n\nSales in Armani were down year over year due to sales declines in Mainland China despite retaining a leading position on key digital platforms. Sales in our largest licensed brands in the Americas were down from last year as wholesale partners reduced open to buy as they work to normalize their inventory levels. Net sales in smartwatches were down 18% in constant currency as growth in our Asia region was more than offset by declines in the Americas. In the Americas, sell-through in our DTC channel and in key digital accounts was down to last year.\n\nWhile consumer demand was softer than last year and contributed to the sales declines, we also maintained pricing on our core platforms better than last year, which partially offset the sales declines with improved margins. Net sales of smartwatches in our India market showed growth in our core Gen 6 platform. Q2 net sales in our jewelry category increased 12% in constant currency, with broad-based global growth across most of our major owned and licensed brands. Net sales in our leathers category increased 12% in constant currency as improvements in our in-stock positions drove better selling in our DTC channels.\n\nMoving down the P&L. Second quarter gross margin was 51.6%, down 240 basis points versus 2021. The year-over-year decline is primarily attributable to three factors: Approximately 170 basis points from the nonrecurrence of a prior-year benefit due to a change in duty costs into the United States. Approximately 130 basis points of higher freight costs as both ocean and air freights were up versus last year and higher inventory costs in our European and Asian subsidiaries due to a stronger dollar this year versus last year.\n\nThese elevated costs were partially offset by product margin improvements from our category mix, pricing benefits and currency hedging contracts. Turning to expenses. Total operating costs were $202 million, down 3% versus last year. Both impairment and restructuring costs were down versus last year as we wound down costs under the New World Fossil 2.0 transformation program.\n\nOperating expenses, as a percent of sales, increased by 400 basis points. SG&A costs, which excludes impairment and restructuring costs, were $199 million, down 1% versus last year. As a percentage of sales, SG&A costs were 53.7%, up 490 basis points versus the prior-year period. The increase reflects higher labor costs and investments in our digital initiatives, which were only partially offset by reduced store costs resulting from lower store count, as well as a decline in marketing costs.\n\nQ2 operating loss was $11 million compared to operating income of $14 million in the year-ago period. Operating margin was minus 2.9% compared to 3.5% last year. Adjusted operating loss was $8 million compared to operating income of $21 million last year, and adjusted operating margin was minus 2% versus 5% last year. Looking at the balance sheet.\n\nInventory balances at the end of Q2 were $438 million, up 24% versus last year. This reflects increased receipt flow, as well as higher levels of in-transit inventory as we pulled some inventory receipts forward early in the quarter due to extended transportation lead times and to mitigate potential COVID-driven restrictions from our primary supply base in Mainland China. Lower sales in the quarter also contributed to higher ending inventory balances. Our Q2 ending cash balance was $167 million, and we had $54 million available under our revolving credit facility.\n\nTurning to our outlook for fiscal 2022. With the first half of the year behind us, we are taking a more cautious outlook on global consumer demand in the second half of the year. We expect that sustained inflation on core goods like food and energy and the reversion of spending toward more historical levels of services will moderate consumer demand in our categories, primarily impacting our sales outlook in the Americas and in Europe. We also expect that consumer spending in Mainland China will not fully recover this year, primarily due to the effect that COVID policies have had on discretionary categories.\n\nAnd we have also taken into account prevailing currency rates, which has seen the dollar strengthen relative to our previous guidance. So taken together, we now expect full year revenue to be in the range of minus 5% to minus 8%, down from our previous guidance of flat to 3%. Using the midpoints of our current and previous guidance, our change in forecast will be quantified as follows: First, from a constant-currency standpoint, our revised revenue guidance is approximately 650 basis points lower than our previous guidance as we expect moderation in consumer demand to impact all of our operating divisions versus just the international operating divisions that was assumed in our prior guidance. In addition, we have reduced our expectations for a return to growth in Mainland China based on the impact that COVID restrictions will continue to have on consumer discretionary spending in 2022.\n\nSecond, prevailing currency rates have added another 150 basis points of headwind to our net sales versus our prior projection. While year-to-date currency rates have created approximately 340 basis points of impact to net sales, we estimate that prevailing rates will create approximately 500 basis points of headwind in the second half of the year. So for the full year, that's approximately a 450-basis-point impact on our sales. From an adjusted operating margin perspective, our revised revenue outlook, coupled with lower-than-expected gross margins, we now expect adjusted operating margin to be in the range of 2% to 4% for the full year compared to our prior guidance of 5.5% to 6.5%.\n\nIt's also important to note that prevailing foreign exchange rates do not have a material impact on our adjusted operating margin rate. While revenue translates at a lower rate, our expenses also translate at a lower rate, and our hedging program largely offset the impact of higher inventory costs associated with our foreign subsidiaries purchasing inventory in U.S. dollars. With that, I'd now like to turn the call back to Christine to take us through some questions.\n\nChristine Greany -- Investor Relations\n\nThanks, Sunil. I'll start with Kosta. Can you tell us what you've seen during prior recessionary periods that might be informing your expectations for the sector, as well as the consumer as we enter the second half of the year?\n\nKosta Kartsotis -- Chairman and Chief Executive Officer\n\nThe macroenvironment is quite different from anything we've ever seen before. It's very unusual. As we mentioned, there are headwinds in all three regions, and it seems there for different reasons. In the Americas, we've seen market share data that suggest the overall market is down and one possible reason is that last year's stimulus aided some sell-through activity.\n\nIn Europe, it appears there's concerns about the war have affected the sales and of course, we are being affected by the lower euro. It's notable that both the U.S. and in Europe, our DTC business is stronger than our wholesale business. In China, we are still being affected by the COVID-related disruption and watching the market closely as it opens up a bit.\n\nWe obviously feel good about our position there and our long-term future there is going to be, we think, fantastic. Our Fossil businesses has been relatively strong overall, and we've been investing in additional design and merchandising capabilities and expect to see ongoing improvements in our watch, leather goods, and jewelry businesses. Our jewelry business, overall, both Fossil, Kors, EA, and Diesel has been strong, and it's got a long runway ahead of it, so we're excited about that. And of course, all these opportunities will be turbocharged by our increasing digital capabilities.\n\nWe have made significant investments in talent and technical capabilities that should be a game changer for us. And over the next few months, we will see a number of significant enhancements coming online that will definitely boost our capabilities for storytelling and engaging our customers in a more robust way. We also have been able to grow our customer list significantly this year, and that's going to pay large dividends for years to come. And so, we're very excited about all those activities.\n\nWe're also launching a new customer data platform this fall that will optimize our CRM capabilities, which should be very successful for us.\n\nChristine Greany -- Investor Relations\n\nThank you, Kosta. I'll move over to Greg. Kosta mentioned that higher inventory levels in the wholesale channel resulted in lower-than-expected replenishment orders during Q2. How did inventory levels look exiting the quarter? And what are you hearing from your wholesale partners about the second half? Have you had any order cancellations due to softening sell-out trends?\n\nGreg McKelvey -- Executive Vice President and Chief Commercial Officer\n\nAs we noted, some of our wholesale partners have had higher levels of inventory in Q2, not only in our categories, but broadly across many categories and more so in the Americas region relative to the rest of the world, which we believe impacted the level of replenishment in the quarter. The levels have come down relative to the start of the quarter, though, which is a good thing. We have not seen cancellations. But that said, in this environment, we do think that many wholesale partners to take a cautious approach on managing their open to buy as all retailers monitor demand signals.\n\nChristine Greany -- Investor Relations\n\nThank you, Greg. Moving on to Sunil to discuss guidance for a moment. Sunil, can you please walk us through the key assumptions that are factored into your revised full year outlook? In particular, what are you expecting from a consumer demand perspective in the U.S. and Europe?\n\nSunil Doshi -- Chief Financial Officer\n\nSure, Christine. I'll probably break it into two parts, I'll walk through some of the revenue assumptions and then touch on the operating margins. First, on revenue, broadly speaking and excluding the impact of foreign exchange rates and currency, we do expect that the outlook on consumer demand and some of the issues we talked about in Mainland China will lead us to be contracting revenue in each region in the back half of the year. But the factors are slightly different as we referred to in the prepared remarks.\n\nIn Asia, the primary factors surround our view that consumer spending will not materially improve in the back half in Mainland China or in the markets that are most heavily impacted by Chinese tourism. In Mainland China, our revised outlook reflects only a modest improvement versus Q2, even as we lap the fourth quarter of '21, negative 20% that we saw. These markets, that's Mainland China and those markets that are most directly impacted by Chinese tourism, that's about 50% of the sales mix in the region. Conversely, in India, our forecasts haven't changed from prior guidance and trends from the first half of the year continue to show strong underlying demand.\n\nPlease note in India for the third quarter, we will expect more of a flat -- possibly slightly negative growth rate as we lap a very strong snapback from last year's COVID restrictions in that country. But sequentially, the revenues are very strong, and we're pleased with the progress that we're seeing from consumer demand in the country. In the Americas and Europe, our revised outlook assumes that consumer spending in discretionary categories, particularly ours, will experience some pressure due to sustained higher levels of inflation and some normalization of spending toward services and therefore, limit traffic across the channels. And we're closely watching the promotional intensity in some markets that could drive some offset between sustaining top-line revenue trends and margin.\n\nConversely, our inventories are more weighted toward leathers and jewelry versus last year, and we will be bringing online some new capabilities that Kosta mentioned from our digital investments. We view both of these as opportunities that could provide some improvement to Q2 trends in these markets. Then lastly, as I mentioned, from a revenue perspective, prevailing rates are expected to be about a 500-basis-point headwind for the balance of the year. And then if I turn over to operating margins, I'd say our operating margins reflect the potential for some deterioration in gross margins, given that we're hearing of increased promotional intensity.\n\nThus far, it's been our wholesale partners and what we've done in retail. We've worked hard to avoid being in that promotional environment and our underlying margins and DTC have shown that. But we are cognizant of the fact that higher levels of inventory out in the trade could create some pressure on that, and we're developing our game plans accordingly. With those pressures, we are also looking at the near-term offsets of our expense structure as well to help manage our raw operating margins.\n\nChristine Greany -- Investor Relations\n\nVery helpful context. Thanks, Sunil. Just quickly, if you could help us understand your working capital requirements for the back half and how you're thinking about inventory and cash flow?\n\nSunil Doshi -- Chief Financial Officer\n\nSure. In our business, inventory obviously makes up the bulk of our working capital. And historically, working capital has peaked around the third quarter, we built inventory ahead of the seasonally higher fourth quarter. That said, this year was a little bit different.\n\nWe did pull ahead some inventory into late first quarter of 2022 to mitigate the potential risk that COVID policies in Mainland China could have had on our inventory flow. We also allowed for extended lead times on leathers where we ship by ocean, and we've also been increasing our open to buy in that category. So we ended that quarter -- the first quarter, that is, up 20% versus the first quarter of '21. We ended the second quarter up 24% versus its prior period, which reflects a little bit more of that pull forward, as well as achieving lower sales in the quarter.\n\nWith that backdrop, we don't expect our inventory growth rate to accelerate from Q2 to Q3, and we would expect our inventory growth rates to come down by the fourth quarter. The quality of our inventory is high and the increase versus last year is generally composed of core products across the portfolio. Looking forward and with the more cautious outlook that we provided, we are calibrating our future flow and we'll continue to manage down our overall inventory levels through the first half of next year.\n\nChristine Greany -- Investor Relations\n\nOK. I have a follow-up for Greg. Are you contemplating any strategic or operational pivot did you navigate the slowdown in consumer spending?\n\nGreg McKelvey -- Executive Vice President and Chief Commercial Officer\n\nI'd highlight four areas where we are double clicking in response to the environment. First, we plan conservatively and execute aggressively. That is the bias we'll take with us into the back half. And while we are realistic about the headwinds we face in the market, all three regions are well positioned with both quality and quantity of inventory and will aggressively take advantage of upside opportunities.\n\nSecond, we're highly focused on distorting and investing in our most profitable businesses with increased sales effort opened by allocation and marketing spend. As a result, we'll likely see mixed shifts over the coming months that will improve the overall health of our business. Third, we continue to innovate but are building much tighter assortments for 2023 that align with our focus brands and category strategies, and at the same time create significant downstream efficiencies in the supply chain and maximize working capital. Lastly, from a marketing perspective, given the current environment, we're focusing on shifting our mix to more immediate ROI, conversion driving digital marketing activations.\n\nWe expect to continue to invest at our recent levels on a rate basis and remain agile and ready to increase spend as we see improving trends in the macro and consumer purchasing behaviors.\n\nChristine Greany -- Investor Relations\n\nThank you, Greg. Jeff, over the past few quarters, many companies have been reporting on cost pressures driven by a number of issues, particularly energy costs. They've also commented on the continued supply chain challenges globally. How have these issues been impacting Fossil during the last quarter? And any perspective on future views relative to these issues?\n\nJeff Boyer -- Chief Operating Officer\n\nSure, Christine. There continues to be cost pressure across a number of key inputs in our business: energy, oil-based materials, metals, and logistics, to name a few. If you recall, we did take pricing action earlier this year to offset many of these expected cost issues. The good news is that due to both our pricing actions, as well as the great work done by our sourcing teams, we've largely offset nearly all of these expected cost increases.\n\nThe one exception has been logistics costs as both ocean and air freight rates have remained high. Although it appears that additional capacity is coming to the market, we haven't seen those rates adjusting much at this point in time. As Sunil mentioned, freight costs were one of the primary drivers of our gross margin contraction in the quarter. We expect these logistic costs to begin stabilizing and should see a more favorable trend by the fourth quarter.\n\nRegarding product deliveries, we're fortunate that much of our product, about 90%, is delivered by air freight, which has had both shorter delivery times and more predictable performance. However, product shipped via ocean freight still has elongated delivery windows, though generally time on the water is coming down. That said, bottlenecks have moved to rail depots as they were backed up with inventory, and truck chassis positioning has been misaligned, which is creating some delays in that segment of the logistics chain. Fortunately, we extended the time periods from our vendors to our DCs for the 10% of the product that we're shipping via ocean, including the rail segment.\n\nAs a result of a solid performance in our airfreight channel and the extended planning horizon we used on predict levered on the water, our on-time delivery of our new products, our seasonal offerings, and standard replenishment SKUs has been very good, and well over 90%. As Sunil mentioned, we've also pulled ahead some inventory to ensure solid impact levels and order fill rate performance. To maximize our sales potential and minimize inventory risk, we have continued to focus our inventory on our stronger selling products. So we're in a very good position in terms of both quantity and quality of our inventory assortment.\n\nChristine Greany -- Investor Relations\n\nTerrific. Thank you, everyone, for the exchange today. I'll turn things back to Kosta to close us out.\n\nKosta Kartsotis -- Chairman and Chief Executive Officer\n\nWell, thanks, everyone, for joining us today, and we look forward to speaking with you in November during our Q3 call. So have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristine Greany -- Investor Relations\n\nKosta Kartsotis -- Chairman and Chief Executive Officer\n\nSunil Doshi -- Chief Financial Officer\n\nGreg McKelvey -- Executive Vice President and Chief Commercial Officer\n\nJeff Boyer -- Chief Operating Officer\n\nMore FOSL analysis\n\nAll earnings call transcripts"
}