{
  "companyName": "Quanex Building Products",
  "companyTicker": "NX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/02/quanex-building-products-nx-q3-2022-earnings-call/",
  "content": "Quanex Building Products (NX -1.42%)\nQ3 2022 Earnings Call\nSep 02, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Q3 2022 Quanex Building Products Corporation earnings conference call. [Operation instructions] I would now like to hand the conference over to your speaker today, Scott Zuehlke, senior vice president, CFO, and treasurer. Please go ahead.\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nThanks for joining the call this morning. On the call with me today is George Wilson, our president and CEO. This conference call will contain forward-looking statements and some discussion of non-GAAP measures. Forward-looking statements and guidance discussed on this call and in our earnings release are based on current expectations.\n\nActual results or events may differ materially from such statements and guidance, and Quanex undertakes no obligation to update or revise any forward-looking statements to reflect new information or events. For a more detailed description or forward-looking statement disclaimer and a reconciliation of non-GAAP measures to the most directly comparable GAAP measures, please see our earnings release issued yesterday and posted to our website. I'll now discuss our financial results on a consolidated basis, followed by comments on the results for each operating segment. On a consolidated basis, we reported net sales of 324 million during the third quarter of 2022, which represents an increase of 15.8% compared to 279.9 million during the third quarter of 2021.\n\nThe increase in revenue was mostly attributable to higher prices related to the pass-through of raw material cost inflation. Net income increased by 90.4% to 25.9 million, or $0.78 per diluted share, during the third quarter of 2022, compared to 13.6 million or $0.41 per diluted share during the third quarter of 2021. On an adjusted basis, EBITDA for the quarter increased by 34.3% to 44.2 million, compared to 32.9 million during the same period of last year. This equates to adjusted EBITDA margin expansion of approximately 180 basis points year over year.\n\nThe increase in earnings for the three months ended July 31st, 2022 was largely due to increased pricing and surcharges related to the pass-through of raw material cost inflation and higher volumes in the North American fenestration segment. Now, for results by operating segment. We reported net sales of 184.7 million in our North American fenestration segment for the third quarter of 2022, which represents growth of 25% compared to the third quarter of 2021. The increase in revenue is primarily driven by an increase in price and raw materials surcharges along with increased volume.\n\nWe estimate that around half of the revenue growth in this segment was due to an increase in volume, and the remainder was due to an increase in price. Adjusted EBITDA was 27.1 million in this segment or 48.7% higher than prior year. We realized margin expansion year over year in this segment, and we expect that to continue through Q4 as pricing continues to catch up to inflationary pressures. We reported net sales of 72.5 million and our North American cabinet components segment in Q3 of 2022, which was 17% higher than prior year.\n\nThe entire increase was driven by price as volumes declined. Customers are working down their backlogs as demand softens in this segment. The increases in hardwood index pricing, as well as discretionary pricing actions, offset the volume decline and resulted in revenue growth for the quarter. Adjusted EBITDA was 5.6 million for the quarter, which represents an increase of 126.6% versus prior year and resulted in margin expansion of approximately 370 basis points.\n\nSimilar to 2Q, timing of price increases, better availability of green lumber, improvements in lumber yield, and labor efficiency were the main drivers of the positive results in the quarter. Once again, as a reminder, we have material index pricing mechanisms in place in this segment, but they typically have a 90-day lag. It will be a challenge to realize margin expansion year over year in Q4 in this segment due to the fact that we have a tough comp but also because demand continued to soften, and we expect hardwood prices to reset lower come October 1st. Our European fenestration segment reported revenue of 67.6 million in the third quarter, which represents a decrease of 4.9% year over year.\n\nHowever, excluding foreign exchange impact, this would equate to an increase of 8.7%, all driven by increased pricing as volumes declined. Adjusted EBITDA came in at 12.1 million for the quarter, which was 15.8% lower than prior year. We currently expect revenue to decrease in this segment in Q4 versus the comparable quarter of 2021 due to the foreign exchange impact and the softer demand backdrop in Europe. But we anticipate that we can protect margins as price increases continue to catch up to inflationary pressures and we flex our cost structure appropriately.\n\nMoving on to cash flow and the balance sheet, cash provided by operating activities was 51.7 million for the third quarter of 2022 compared to 18.5 million for the third quarter of 2021. The value of our inventory continued to increase during the quarter due to inflationary pressures, which had a negative impact on working capital, but we were still able to generate free cash flow of 46 million for the quarter, mainly due to the significant increase in net income. We were able to repay 25 million in bank debt and repurchase 5 million of our common stock during the quarter. Our balance sheet continues to be strong, our liquidity position is solid, and our leverage ratio of net debt to last 12 months adjusted EBITDA decreased to 0.1 times as of July 31, 2022.\n\nIn the near term, we will remain focused on generating cash and opportunistically repurchasing our stock. We will also maintain our focus on growing the company through organic, inorganic, and innovative growth opportunities as they arise, while continuing to preserve our healthy balance sheet. As stated in our earnings release, we are reaffirming guidance for fiscal '22, which is based on our strong results year to date, coupled with ongoing conversations with our customers. Overall, demand for our products is still relatively healthy, but in addition to the softness in Europe, we are beginning to see some signs of softness in our North American cabinet components business.\n\nFrom a cadence perspective, the fourth quarter of this year versus the fourth quarter of last year, we now expect about 15% revenue growth in our North American fenestration segment and low single-digit revenue growth in our North American cabinet components segment. However, due to the foreign exchange impact and the continued softness in Europe, we now expect revenue to decline by about 15% in our European fenestration segment in the fourth quarter. As a reminder, on a consolidated basis, we guided to net sales of 1.18 billion to 1.2 billion, which we expect will generate approximately 150 to 155 million and adjusted EBIDTA in fiscal 2022. I'll now turn the call over to George for his prepared remarks.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nThanks, Scott. I will begin my commentary by discussing the current macroeconomic environment and how we believe this will impact Quanex going forward. In North America, heightened mortgage rates, increased economic uncertainty, inflation concerns, and upcoming midterm elections will continue to provide headwinds to consumer confidence in the near term. However, let's not lose sight of the fact that the U.S.\n\nhousing market is significantly under-built with low inventories, and the demand for residential housing is still strong. We also expect the R&R market to remain healthy due to the age of existing housing and higher level of homeowner equity. These factors will enable the building products sector to be somewhat resilient and rebound much more quickly from any downturn or recessionary environment. Another factor we believe will benefit Quanex mid- to long-term will be continued changes to building codes and standards as they relate to energy performance of building envelopes.\n\nAnd the recently passed Inflation Reduction Act of 2022 includes provisions where households can save up to 30% with tax credits for home construction projects on windows, doors, insulation, or other weatherization measures that prevent energy from escaping homes. Our current portfolio includes components used in products that accomplish those goals. From a supply chain perspective, we have begun and expect to see continued easing concerns over the supply of raw materials with significant downward pressure on costs. Steel, aluminum, resins, and hardwoods have all begun to see decreases in input prices for the first time in over two years.\n\nHowever, labor conversion and medical benefit costs will continue to see significant pressure, and we will still require a price pass-throughs to offset those increased costs. In the U.K. and Europe, economic uncertainty, high levels of inflation, and energy supply concerns resulting from the war in Ukraine are all negatively impacting consumer confidence and slowing residential new construction and R&R activity. The largest concern in the region in the near term will be both the supply and cost of energy in continental Europe.\n\nAnd any further erosion, which we can't predict, could change our outlook. Even with the near-term uncertainty, the Quanex team continues to remain focused on the areas that we can control, such as service and quality to the customer, effectiveness of our pricing mechanisms, operational performance, working capital and cash management, and culture development and strengthening. Over the past three years, we worked hard to build a foundation of people and processes that are prepared to adjust and react rapidly to changes. Our continued performance improvement through COVID and the past year and a half of supply chain challenges highlight this fact.\n\nWe have followed our playbook and stayed true to our mission of improving cash flow generation, return on invested capital, and profitability, all while maintaining a strong balance sheet. We are ready to move Quanex into the next phase of our evolution, and it is in this point that I would like to spend some time on now. Last night, we posted an updated investor presentation to our website. You can find this document under the investors tab of the site and in the presentations and events section.\n\nThe presentation will give you a good overview of who we are today in terms of financial metrics, product offerings, and the markets we serve. More importantly, the updated presentation provides a deeper insight into our core competencies and lays out a roadmap for our growth-with-purpose strategy and our planned pathway to achieve $2 billion of revenue. Let me be clear, we have a very defined strategy with optionality for growth. The goal of the strategy is profitable growth to create further value for shareholders over time, all while maintaining a healthy balance sheet.\n\nThe presentation will also serve as a checklist that we review prior to making any investment decisions, whether it be organic growth, inorganic growth, or growth through innovation. The most important takeaway is our view that we are not a window and door company, nor are we a cabinet company. We are a manufacturing company with a broad set of core competencies. We just happen to currently serve primarily the window and door and kitchen and bath cabinet markets.\n\nWhile this may seem like a simple play on words, I would argue that it is a game-changing way to look at our business. We believe that focusing on our core processes of compound and sealant mixing, extrusion, metal roll forming, and mill working, rather than narrowly focusing on only opportunities in fenestration and cabinet markets, will allow us to identify additional organic and inorganic growth opportunities and, over time, will improve our growth and profitability profiles versus our historical averages. From an M&A perspective, our priorities will focus on identifying margin accretive businesses that either: one, expand our portfolio and current markets and reinforce our sector leadership; or two, are synergistic with our manufacturing capabilities and provide entry points into new growth-oriented markets. From an innovation perspective, our investments will be driven from our desire to build on our manufacturing core competencies and materials expertise.\n\nWe will identify and develop new products and markets while using current strengths and capitalizing on synergies. We have effectively followed our road map over the past two years to improve operational and financial performance. And now, we will work to execute our new revised strategy to achieve above-market growth, continue margin expansion, and, most importantly, increase shareholder value. And with that, operator, we are now ready to take questions.\n\nOperator\n\n[Operator instructions] And our first question will come from Daniel Moore of CJS Securities. Daniel, your line is open.\n\nDan Moore -- CJS Securities -- Analyst\n\nThank you. Good morning, George. Good morning, Scott.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nGood morning.\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nGood morning.\n\nDan Moore -- CJS Securities -- Analyst\n\nI'll start a little bit backward-looking before we get into some of the changes, but double-digit volume growth in North America fenestration, pretty impressive. Can you kind of break that down by product, end market, you know, vinyl screens, etc., and how much of it reflects end market growth versus maybe some share gain?\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nSo, I would tell you that out of the products that make up that segment, screens and spacer drove that growth. Probably more screens than spacer. Vinyl profile -- window vinyl profiles did not help, but I will say that we've been talking for a while now about vinyl fencing. And we started manufacturing and producing volume that contributed and will probably contribute more as we go forward to the vinyl extrusion piece.\n\nDan Moore -- CJS Securities -- Analyst\n\nGot it. Very helpful. And then maybe just talk about the year, shifting gears a little bit, to Europe. You know, the cadence of demand over the past several months has been kind of slowing month over month.\n\nAnd how much of the guide for fiscal Q4 is FX-driven versus, you know, kind of volume decline expectations?\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nSo most of the softness or even the FX, obviously, is in our European fenestration segment. And if you look, there's a sales chart on the very last page of the earnings release. And if you look at the footnote, we had about a $9 million negative impact just due to FX in the quarter. And that's meaningful because you take what looks like a decrease in revenue on the top line from income statements, and it's actually an increase in revenue if you adjust for FX.\n\nSo, it's had a meaningful effect. It will continue to have a meaningful effect year over year in 4Q. Who knows what tax rates are going to get through next year? But it has definitely had a very significant impact on top line.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nYeah. I would -- to add to Scott's comments. I would say, you know, the market itself has remained surprisingly strong, considering everything else that's going out there, you know, when you neutralize the FX piece of it. So, the one thing that we continue to adjust for and you see really in all the segments as the supply chain is also eased up, you know, we've peeled back and reduced our lead times to customers.\n\nSo, you know, we're trying to net out the volume impact as well as people readjusting with lead times and their ability to not carry as much inventory. So, we've seen some of our customers do a little stocking. But the European market has shown some surprising resiliency considering everything that's going on there.\n\nDan Moore -- CJS Securities -- Analyst\n\nGot it. And then maybe just shifting back to North America. Do you have an updated kind of overall window shipment projection for calendar '22, you know, with Ducker is, obviously, but your thoughts there? And what does your crystal ball tell you at this stage for '23?\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nYes. Crystal ball is pretty cloudy. For Ducker, their late assessment for '22 over '21 for window shipments is barely above flat. So 0.2% growth this year versus last year.\n\nAnd then like I said, I mean, we're actually going through our budgeting process, right, as we speak. So, we're not -- we don't have a firm view on volume for next year across product lines, but I can tell you that from a revenue standpoint, just based on what we're seeing in the raw materials markets and costs coming down, if you think about -- we've talked in the past about adding surcharges in specific situations. Those -- we will start to peel back surcharges. So, revenue could very well be down next year versus this year.\n\nHowever, we are comfortable and confident that we can continue to expand margin.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nKind of as we stated at the beginning of the macroeconomic section, we hope to be able to give you better clarity on what we see in '23 in our December meeting with midterm elections and some of the energy concerns that are still shaking out. You know, our hope is by that point in time, we'll have a little better a clear indication of what we're seeing for that point.\n\nDan Moore -- CJS Securities -- Analyst\n\nAll right. Last for me, I'll jump out. But it's really helpful, the new slide deck, as I kind of, you know, parse through it last night. The -- on the M&A front, can you maybe talk a little bit about what sort of adjacencies that would be complementary to your manufacturing capabilities? You've talked about fencing, obviously, multiple times in the past, but any others that you may have your eye on now would be helpful.\n\nThanks again.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nSo, as we look at our manufacturing processes and, really, as we said, you know, we're approaching M&A in two very distinct paths. One, we'll look to fill out any holes in our current portfolio and the sectors that we serve today. But from an adjacency perspective, you know, looking at things like our mixing capabilities and, you know, there's different seals and gaskets that go into numerous applications in other markets, not only in building products but across many different markets. So, the fencing, we'll continue to look at different types of -- PVC types of extrusion opportunities.\n\nThe whole intent is really looking at that complete core competency of manufacturing processes and then going into different markets based on that. So, the opportunities where we can vertically integrate, and then identify new markets, yeah, I think that's something we'll continue to look at. And building off of mixing, extrusion, metal forming, roll forming, and millwork, those will be the key.\n\nDan Moore -- CJS Securities -- Analyst\n\nVery good. Thanks for the color.\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nYup. Thanks.\n\nOperator\n\nAnd our next question will come from Steven Ramsey of the Thompson Research Group. Steven, your line is open.\n\nSteve Ramsey -- Thompson Research Group -- Analyst\n\nExcellent. Maybe to start with on the pressure of North America cabinetry volume coming down, maybe some of this seems to be in conflict with some of the recent KCMA data and large producers recent results and outlook. Maybe kind of talk to just any more details on the cabinetry volume outlook over the next two to three quarters?\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nSo, first thing to note is for the KCMA data, be cognizant, those are cabinet sales. So, it doesn't really break out volume versus price. And obviously, price is driving any of those sales growth numbers, same with our results, even though volume is down.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nYeah, and in terms of complete volume, I think you're seeing a couple of things, and, you know, there's -- some of our customers who have recently announced earnings, highlighted the same thing. I mean as they continue to reduce their backlogs because of the availability of lumber becoming more abundant price starting to drop. Lead times are going back. So, we're really trying to identify, is it truly a drop in revenue or in units produced? Or is it really customers adjusting with the lead times and carrying less inventory? We know backlogs for our customers are starting to drop, which would indicate that there is some softness in opening orders, but it also could indicate that I don't need to place orders eight months in advance now, too.\n\nSo, there's still a lot of noise in the system. We anticipate some continued softness in volume, as well as pressure, as Scott said, on the index pricing, but still a lot of noise to be able to determine exactly what sort of trends exist.\n\nSteve Ramsey -- Thompson Research Group -- Analyst\n\nOK. Helpful. And then to make sure I understand, on the fencing opportunity, maybe you can kind of talk to how that is scaling up in the past couple of quarters just for some context. And then going forward, in fencing, do you need to acquire or invest to scale that up? Or are you in a position to serve that market effectively with what you have as you increase your internal production?\n\nGeorge Wilson -- President and Chief Executive Officer\n\nSo, as we look at the fencing market, you know, we were evaluating it very heavy to begin with and where we felt like we added the most value. I think, you know, right now it is a very segmented market that -- driven regionally by design channels to market. But when all is said and done, the components that are manufactured and shipped to the installers and the wholesalers and the distributors are very common. So, I think what we see is we're settling very nice into the OE model again.\n\nI don't think, at this point in time, you would ever see us getting into some high level of distribution. You know, but from a manufacturing and an OE perspective to continue to serve all of those regions, I think we're very well scaled up. I don't think it would need significant investment. And really, at this point, it's just getting our components out to all the distributors in all the different regions and showing our capabilities as a very good OE supplier of PVC components.\n\nWe've acquired a couple of new customers, and that continues to scale up. So, I think we're well along the path. And hopefully, within the next year, we'll be able to start giving some references of size of that market for us. We're not ready to break that out at this point, but soon.\n\nSteve Ramsey -- Thompson Research Group -- Analyst\n\nOK. Helpful. And then last question for me, this shift in M&A and this execution plan, maybe the first, how soon do you see this playing out, especially in the context of changing outlook for housing in general? And then this idea of taking your current capabilities and expanding them to different product sets, I guess, why is now the time for this?\n\nGeorge Wilson -- President and Chief Executive Officer\n\nSo, first, to answer your question, on the timing of it, there's really no specific timing. You know, what we've done is we've built a business and we focus on our playbook, as I mentioned, to get the balance sheet and the fundamental processes in people and processes in place within the organization so that when we were ready to make this next step, we could execute. And that's where we're at today. So, as we look forward, there's no specific timeline.\n\nWe're going to look at opportunities by expanding our view outside of the fenestration in the cabinet market. So, what I will tell you is we're seeing more opportunities of things that are adjacent and fit our core competencies. So, I think we're getting better looks, but we have no specific target on a timeline to make anything happen. We're going to continue to be diligent and making sure that whatever we do fits within our somewhat conservative operational view of leverage.\n\nAnd, you know, if it fits, we put ourselves in that position. We are pretty happy with the fact that by taking a more broader look and trying to build off of our core competencies, we are seeing more opportunities in different looks at businesses that we really like.\n\nSteve Ramsey -- Thompson Research Group -- Analyst\n\nExcellent. Thank you.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nAnd our next question will come from Julio Romero of Sidoti. Julio, your line is open.\n\nUnknown speaker\n\nHi. How are you?\n\nGeorge Wilson -- President and Chief Executive Officer\n\nHey, good. Hello.\n\nUnknown speaker\n\nHi. This is [Inaudible] on for Julio Romero. I have a question. Basically, there is a lot of concern on the macro level with energy prices in Europe.\n\nSo, basically, I just wondered like how they like affecting operations in Europe? Thanks.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nGreat question. So, at this point, we have not been impacted on supply. And we've had a fixed contract in place that has protected us from the cost side up until this point. That will expire in the near future.\n\nWe anticipate the impact to be what I would call significant, but one that we fully anticipate to pass-forward and through to our customers as everyone else in that region will. So, it will impact our operating performance. It is a significant level and -- but we expect it to be margin-neutral because we anticipate passing those prices through. Again, at this point, there -- in our manufacturing facility, remind everyone is in Germany.\n\nSo, you know, we continue to watch the situation. They have not gone to full rationing of any sort of natural gas at this point where we're located, but we'll continue to look at it. But our intent is to pass along price as it is incurred.\n\nUnknown speaker\n\nThank you for the color. My next question is basically, how should we think about inventory levels, like maybe stay at the same level as now, or maybe come down as supply chain challenges ease up?\n\nGeorge Wilson -- President and Chief Executive Officer\n\nIt's different by segment. I think value-wise, I would anticipate just as our inventory ramped up because of valuation of raw materials and input costs that you'll see the same sort of downward pressure. So, I don't see significant changes in terms of the volume of inventory we carry, but I think you'll see some easing of the valuation of that inventory on a go-forward basis. We're fairly just in time.\n\nSo, as long as there's availability of raw materials, we don't typically have a need to stock or over abundantly hold any certain specific inventory. So, we monitor and measure our days of inventory very, very closely. And I don't expect a significant adjustment from days, but value of inventory should come down.\n\nUnknown speaker\n\nThank you so much for taking my questions.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nThank you.\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nThanks.\n\nOperator\n\nThank you. And our next question will come from Kenneth Zener of KeyBanc Capital Markets. Kenneth, your line is open.\n\nChristian Zyla -- KeyBanc Capital Markets -- Analyst\n\nGood morning, everyone.\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nGood morning.\n\nChristian Zyla -- KeyBanc Capital Markets -- Analyst\n\nThis is actually Christian Zyla on for Ken Zener.\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nOK.\n\nChristian Zyla -- KeyBanc Capital Markets -- Analyst\n\nGood morning.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nHi, Christian.\n\nChristian Zyla -- KeyBanc Capital Markets -- Analyst\n\nFirst question I have is just in regards to the European fenestration. I guess two-part question. Just in regards to what happened in the quarter, did you see that demand kind of slow as the months went by? Or did that kind of -- come to kind of more abrupt halt? And then is that a function of maybe customers getting priced out with all the price increases? Or does that tie into some of the commentary you guys had on the pull-forward last quarter?\n\nGeorge Wilson -- President and Chief Executive Officer\n\nSo, in terms of the timing, I think what we've seen is a very slow, not even really that noticeable. As Scott mentioned, I mean, when you neutralize for the exchange rate, revenue was actually up, although volumes have come down slightly. You know, as I said, we've been very surprised at the resiliency of those markets not dropping faster than maybe we would have anticipated. So, you know, I think it's been very general to this point.\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nI think a lot of it has to do with just discretionary income and the uncertainty over in Europe, mainly sending around energy costs going higher and just taking a safer approach from a consumer standpoint.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nAs we've talked about in the past, the one thing that we noticed is energy costs do get more expensive globally. You know, that tends to be, to some extent, a little bit of a positive for us because the products that we serve tend to be significantly more energy efficient than some of our competition or basic programs. So, when people are replacing things, the energy payback to go to systems that use our components now are affordable. So, you know, it's not all gloom and doom as it relates to that.\n\nIt actually lends itself to our products very nicely.\n\nChristian Zyla -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thanks for that, That was actually my follow-up question. And then in regards to capital allocation, I know last quarter, you talked about the compelling view of the share buybacks, and you follow up that commentary with about $5 million in share buybacks. It sounds like with the slide, I can start in the commentary from today that M&A maybe is kind of creeping up in that priority list.\n\nCan you just talk about, is buybacks still No. 1 in kind of the ranking of that order? Thank you.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nI think, at this point, we're not really prioritizing any. We're looking at each opportunities exist when we are in open periods. And, you know, we're very restricted because we don't have a 10b program. So, we do buy stock were opportunistically in the market, and as you know, there's limits on how many shares we can buy per day.\n\nAnd with the low float, it's a pretty low number. So, you know, the impact that we can have on share buyback can be relatively minimal because we're not able to buy large amounts. I would tell you, I think we are looking at M&A a little differently now. But, you know, again, everything is project or day specific.\n\nSo, I think we holistically look at our capital allocation strategy on a daily and weekly basis and determine what we want to do on a go-forward basis. We put ourselves in a very good position to be able to utilize any of the tools that are available to us and capitalize on opportunities. We feel like we're in a very good spot right now.\n\nChristian Zyla -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thanks for taking my question.\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nThanks.\n\nOperator\n\nI would now like to turn the conference back to George Wilson.\n\nGeorge Wilson -- President and Chief Executive Officer\n\nI'd like to thank everyone for joining us today, and we look forward to providing you an update on our full year results in our next earnings call in December. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nScott Zuehlke -- Senior Director, Chief Financial Officer, and Investor Relations\n\nGeorge Wilson -- President and Chief Executive Officer\n\nDan Moore -- CJS Securities -- Analyst\n\nSteve Ramsey -- Thompson Research Group -- Analyst\n\nUnknown speaker\n\nChristian Zyla -- KeyBanc Capital Markets -- Analyst\n\nMore NX analysis\n\nAll earnings call transcripts"
}