{
  "companyName": "Enanta Pharmaceuticals",
  "companyTicker": "ENTA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/enanta-pharmaceuticals-enta-q3-2022-earnings-call/",
  "content": "Enanta Pharmaceuticals (ENTA -0.73%)\nQ3 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Enanta Pharmaceuticals fiscal third quarter 2022 financial results conference call. [Operator instructions]. Please be advised that this call is being recorded. I would like now to turn the call over to Jennifer Viera, investor relations.\n\nPlease go ahead.Jennifer VieraThank you, operator, and thanks to everyone for joining us this afternoon. The news release with our fiscal third quarter 2022 financial results was issued this afternoon and is available on our website. On the call today are Dr. Jay Luly, president and chief executive officer; Paul Mellett, our chief financial officer; and other members of Enanta's senior management team.\n\nBefore we begin with our formal remarks, we want to remind you that we will be making forward-looking statements, which may include our plans and expectations with respect to our research and development pipeline and financial projections, all of which involve certain assumptions and risks beyond our control, that could cause our actual developments and results to differ materially from those statements. A description of these risks is in our most recent Form 10-Q and other periodic reports filed with the SEC. Enanta does not undertake any obligation to update any forward-looking statements made during this call. I'd now like to turn the call over to Dr.\n\nJay Luly, president and CEO. Jay?\n\nJay Luly -- President and Chief Executive Officer\n\nThank you, Jennifer, and good afternoon, everyone. Our vision at Enanta is to leverage our expertise in virology and liver disease to discover, develop and deliver groundbreaking medicines, as we've already done with and AbbVie's MAVIRET for hepatitis C virus. This quarter, we made important strides toward achieving another breakthrough medicine. Today, I will start by detailing our recent positive data from the phase 1 trial of EDP-235 in healthy volunteers.\n\nAs a reminder, EDP-235 is our oral antiviral inhibitor of the coronavirus 3CL protease, also known as the main protease or Mpro, which is in clinical development for the treatment of COVID-19. EDP-235 has fast track designation and is designed to be a once-daily oral treatment without the requirement for ritonavir boosting. Our first-in-human, randomized, double-blind, placebo-controlled, phase 1 study enrolled healthy volunteers to evaluate the safety, tolerability and pharmacokinetics of oral EDP-235 in single and multiple ascending doses for seven days along with the effect of food. A total of 72 subjects received at least one dose of EDP-235 or placebo.\n\nThere were 40 subjects in the single ascending dose phase and 32 in the multiple ascending dose phase. All SAD and MAD cohorts enrolled eight participants, who were randomized to receive EDP-235 or placebo in a 3:1 ratio. To optimize dose selections, the study evaluated a broad range of single and multiple doses in a fasted and fed state. The SAD phase 1ncluded cohorts with doses of 50 milligrams, 100, 200, 400 and 800 milligrams fasted, and a 200-milligram fed crossover cohort.\n\nThe MAD phase 1ncluded cohorts with doses of 200 milligrams and 400 milligrams fasted and 400 milligrams and 800 milligrams fed. Overall, EDP-235 was generally safe and well tolerated in healthy subjects up to 400 milligrams for up to seven days. Adverse events were infrequent, with headache and gastrointestinal-related symptoms, such as nausea and abdominal discomfort being the most commonly reported AEs during the MAD phase. The majority of AEs were mild, with the exception of three that led to study discontinuations.\n\nThere was one moderate headache in the 400-milligram fasted cohort, one severe headache in the 800-milligram fed cohort, and one Grade 3 ALT, Grade 2 AST elevation in the 800-milligram fed cohort. The single subject with elevated ALT AST had no other lab abnormalities and no clinically significant lab abnormalities were observed in any other patients. Furthermore, all AEs were subsequently resolved. EDP-235 exposure was enhanced with food administration of a standard meal and increased approximately proportionally with ascending single and multiple doses, with a half-life consistently ranging from 13 to 22 hours, resulting in a PK profile suitable for once-daily dosing.\n\nData demonstrated that EDP-235 had strong exposure multiples over the EC90, where EC90 is a measure of potency, namely the concentration of drug that results in 90% inhibition in vitro. Specifically, EDP-235 200 milligrams taken once daily with food resulted in mean trough plasma levels at steady state that were threefold and sixfold over the plasma protein adjusted EC90 for the Alpha variant and Delta variant, respectively, while 400 milligrams resulted in levels that were sixfold and twofold over the plasma protein adjusted EC90 for these respective areas. These target exposure multiples were achieved without the need for ritonavir boosting and its associated drug-drug interactions. Additionally, EDP-235 is projected to have four times higher drug levels in lung tissue compared to plasma, which would be expected to drive the 400-milligram multiples to 24-fold and 48-fold over the EC90 for the Alpha variant and the Delta variant, respectively.\n\nThis is significant, because in antiviral drugs potency and exposure level often translates to clinical efficacy. EDP-235's preclinical and clinical profile suggests the potential for a best-in-class antiviral treatment for SARS-CoV-2 infection. We plan to finalize the phase 2 protocol in alignment with the FDA and initiate the study during the fourth quarter of this year. Looking at the COVID-19 landscape, there continue to be infections globally due to new variants and the BA.5 variant reportedly can circumvent much of the immunity arising from prior COVID infection or vaccination.\n\nThis highlights the urgent need for a convenient, easily prescribed antiviral COVID treatments for patients, potentially even beyond high risk patients. EDP-235 has the potential to fill this need as it is designed to be used once daily without ritonavir boosting and easily prescribed quickly without the need to assess drug-drug interactions associated with ritonavir. We believe a one pill, once a day antiviral treatment regimen with EDP-235 can enable a true test to treat model to facilitate rapid treatment of COVID infections. Beyond COVID-19 and continuing with our industry-leading respiratory virology treatment portfolio, we are also advancing our respiratory syncytial virus or RSV program.\n\nRSV is another virus that represents an important unmet need as it can result in severe respiratory infection and is associated with significant morbidity and mortality in children, the elderly and the immune compromised. Further, there are no targeted treatments or vaccines available. Our robust RSV program includes EDP-938, the most advanced N-protein inhibitor in clinical development today, as well as EDP-323, a potent L-protein inhibitor. We are confident in the potential of EDP-938, which has fast track designation from the FDA.\n\nWe are evaluating EDP-938 high risk populations in ongoing and planned clinical studies, including pediatric patients, adult hematopoietic cell transplant recipients, and high risk adults, all of which have significant unmet need. Last quarter, we announced data from RSVP, a phase 2b trial in otherwise healthy adults, with community-acquired RSV infection. In this low-risk population, which had mild, self-resolving upper respiratory tract infection, EDP-938 did not meet the primary endpoint of reduction in total symptom score compared to placebo or the secondary antiviral endpoints. However, we were pleased to observe a statistically significant difference in the number of subjects achieving undetectable RSV RNA at the end of treatment with EDP-938, making this the only study that has reported a statistically significant antiviral effect in an otherwise healthy adult population with community-acquired RSV.\n\nEven though patients were treated within 48 hours of symptom onset, a key observation in this study was that the viral load and symptoms had already peaked and were declining at the time of the first dose, indicating RSV infection results quickly in this otherwise healthy population. Importantly, EDP-938 demonstrated a favorable safety profile in a data set that now includes approximately 500 subjects exposed to the drug. We continue to believe that RSV antiviral treatment, including EDP-938 has the greatest potential to show optimal efficacy in high risk populations as these patients have reduced RSV immunity, which manifests in a higher and longer duration of viral load and greater disease severity, allowing a bigger window to realize the full potential of EDP-938. Moving forward, our broad clinical development plan is focused on evaluating EDP-938 in populations with the greatest unmet need, namely those who are at high risk for severe disease.\n\nOur ongoing studies include RSVPs, a phase 2 study in pediatric RSV patients, and RSVTx, the phase 2b study in adult hematopoietic cell transplant recipients with RSV. Both are expected to recruit beyond 2022, subject to the reemergence of RSV in broader populations at pre-COVID levels. Also in the fourth quarter of this year, we are planning to initiate another phase 2b study in high risk adults, including the elderly and those who have asthma, COPD or congestive heart failure. We believe EDP-938 has the potential to deliver a potent, oral, antiviral treatment for all populations at high risk from RSV infection.\n\nOur robust RSV antiviral portfolio also includes EDP-323, a novel oral therapeutic targeting the RSV L-protein RNA polymerase. We believe EDP-323 has the potential to be a stand-alone treatment or it may be used in combination with other agents such as EDP-938 to potentially broaden the treatment window or range of addressable RSV patient populations. EDP-323 is supported by preclinical data that demonstrate strong oral absorption and good plasma exposure across different species. Importantly, EDP-323 has subnanomolar in vitro potency against both major subtypes of RSV, RSV A and RSV B and is not expected to have cross resistance to other classes of inhibitors.\n\nWe plan to initiate a phase 1 study of EDP-323 in the fourth quarter of this year. We also continue to pursue our respiratory discovery program in human metapneumovirus, or hMPV, a virus that is similar to RSV and that it impacts a number of vulnerable populations, including the elderly adults with underlying pulmonary disease and those who are immune compromised. We're continuing lead optimization of potent nanomolar hMPV inhibitors and plan to select a clinical candidate in the first half of 2023. Turning to hepatitis B.\n\nWe remain committed to developing a combination regimen as a functional cure for chronic HBV patients, as we believe the ultimate care for this infection will involve combination therapy. Our commitment is based on the continued high unmet need for this disease, which is a global public health threat and the world's most common serious liver infection, making it the primary cause of liver cancer, the second leading cause of cancer deaths in the world. Last quarter at EASL, final data from two of our phase 1b studies of EDP-514 were presented. EDP-514 is our HBV core inhibitor with Fast Track designation, which is shown to be safe and potent in two different chronic HBV patient populations, those who have high viral load, whom we refer to as viremic patients, and those who are on treatment with a nucleoside reverse transcriptase inhibitor, whom we refer to as nuc-suppressed patients.\n\nBased on these data, we remain convinced that EDP-514 has the potential to be a best-in-class core inhibitor for HBV. We believe that a core inhibitor such as EDP-514 will ultimately be an important component of a successful combination regimen. We continue to evaluate internal and external opportunities for additional candidates to develop in combination with EDP-514 and a NUC to create a triple drug regimen. Before moving to the financials, I want to address briefly our ongoing patent litigation in which we are seeking damages for Pfizer's infringement of our issued 953 patent in the manufacture, use and sale of its COVID-19 antiviral paxlobid.\n\nWe recognize the importance of paxlovid's availability for patients and we do not intend to seek an injunction or take other action in this litigation to impede the production, sale or distribution of paxlovid. And finally, in this lawsuit, we are taking steps to ensure that we will be fairly compensated for our intellectual property. Importantly, our 953 patent is completely separate from the patent estate covering our discovery of EDP-235 and our ongoing antiviral discovery work for coronaviruses. Indeed, we have a growing 3CL protease inhibitor patent estate, including several issued U.S.\n\npatents, one of which covers EDP-235. These patents describe compounds built on an independent and distinct chemical scaffold from the one described in the 953 patent and in Pfizer's patents for paxlovid. At this point, I'd also like to take the opportunity to welcome our new chief medical officer, Dr. Scott Rottinghaus, who joins Enanta today.\n\nScott is an infectious disease-trained physician, who has more than 20 years of experience in a broad range of therapeutic areas. He joins us from Alexion, now a part of AstraZeneca, where he was vice president, head of Clinical Development, Hematology and Nephrology. He's also held positions at Pfizer, where he worked on trials of a DNA vaccine for influenza and on studies of anti-infectives and continued to practice as an attending physician and assistant clinical professor in infectious diseases at Yale School of Medicine. His experience also includes multiple NDA and MAA submissions and FDA Advisory Committee participation.\n\nWe're very excited to have Scott join us as we advance our antiviral development programs. Finally, I'd like to wrap up by highlighting our near-term milestones. We are thrilled with our phase 1 results of EDP 235 and look forward to advancing the COVID-19 program into a phase 2 study in the fourth quarter of this year. We're also on track to begin a new phase 2 RSV study in high risk adults in the fourth quarter of this year.\n\nAnd last, we're excited to initiate a phase 1 study for EDP-323, our RSV L inhibitor in the fourth quarter of this year as well as nominated clinical candidate for human metapneumovirus in the first half of 2023. With that, I'll turn the call over to Paul to discuss the financials. Paul?\n\nPaul Mellett -- Chief Financial Officer\n\nThank you, Jay. I'd like to remind everyone that Enanta reports on a September 30 fiscal year schedule. Today, we are reporting results for our third quarter ended June 30, 2022. For the quarter, total revenue was $19.5 million and consisted of royalty revenue earned on AbbVie's global MAVYRET net product sales.\n\nThis compares to total revenue of $21.6 million for the same period in 2021. Royalty revenue was calculated on 50% of MAVIRET sales at a royalty rate for the quarter of 10% after adjustments for certain contractual discounts, rebates and set-offs, which are now approximately 2% of AbbVie's total reported HCV product sales. You can review our royalty tier schedule in our 2021 Form 10-K. Moving on to our expenses, for the three months ended June 30, 2022, research and development expenses totaled $39.1 million compared to $47 million for the same period in 2021.\n\nThe decrease was primarily due to timing of our clinical trials year over year. General and administrative expense for the quarter was $12.9 million, compared to $8.4 million for the same period in 2021. The increase was due to an increase in headcount and compensation expense. Enanta recorded an income tax benefit of $0.4 million for the three months ended June 30, 2022, due to the release of the state tax reserve during the period compared to a tax benefit of $9.4 million for the three months ended June 30, 2021, when we had the benefit of federal net loss carrybacks available under the CARES Act of 2020.\n\nEnanta is still due a refund of $28.7 million, the tax losses carried back in 2021 to offset taxable income in prior years. Net loss for the three months ended June 30, 2022, was $31.7 million or a loss of $1.53 per diluted common share, compared to a net loss of $24 million or a loss of $1.19 per diluted common share for the corresponding period in 2021. Enanta ended the quarter with approximately $292.7 million in cash and marketable securities. We expect that our current cash, cash equivalents and short-term and long-term marketable securities as well as our ongoing royalty revenue will continue to be sufficient to meet the anticipated cash requirements of our existing business and development programs for the next two years.\n\nFurther financial details are available in our press release and will be available in our quarterly report on Form 10-Q when filed. I'd now like to turn the call back to the operator and open up the lines for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes with Akash Tewari with Jeffries. Please go ahead.\n\nUnknown speaker\n\nThis is [Inaudible] for Akash. Thanks for taking our question. First, we've seen the FDA-approved vaccine on preclinical and also on [Inaudible] antibody of the market based on preclinical data. Could you talk about the potential for an accelerated path with COVID antivirals? And secondly, can you go over your thoughts on phase 2 design in terms of patient population on points.\n\nGiven the lower event rates we're seeing with on, how do you think about the size and accrual, when can we expect EDP-235 to enter the market? Thank you. Yes. Can you hear me a little better?\n\nOperator\n\nYes. Sorry about that. Could you repeat the question?\n\nUnknown speaker\n\nNo worries. Yes, definitely. So this is Clark on for Akash. First, we've seen the FDA approved vaccines on preclinical data and also pulled Regeneron monoclonal antibody off the market based on preclinical data.\n\nCould you talk about the potential for an accelerated path to approval with COVID antivirals? And secondly, can you go over your current thoughts on phase 2 design in terms of patient population and endpoints? Given the lower event rates we're seeing with Omecron, how do you think about trial design or trial size and powering and accrual times? When can we expect EDP-235 to enter the market? Thank you.\n\nJay Luly -- President and Chief Executive Officer\n\nHi, there. Thanks for the question. This is Jay Luly. And I apologize for the connection.\n\nThe operator's line keeps dropping out on us. So we're coming in through a cellphone. I hope people can hear us here. I think the vaccines and the antibodies are very different than the antivirals.\n\nI think once you've demonstrated, you're basically looking for generation of a species that has reactivity against the virus and once you do that with a vaccine or an antibody, it's easy to kind of look at the neutralizing capabilities of that entity. Antiviral development is just different. So I don't expect there to be the same sort of correlative short path that would accelerate things. And with regards to the patient population, that's something that we're sorting out the whole -- I would say, the whole design thinking through the phase 2 and 3 in this area.\n\nIt is dynamic. It's changing, the vaccination state of people is changing, both being vaccinated and then suddenly having immunity wear off either because the vaccine has sort of been short-lived and/or the booster, or the variants have evaded the vaccine. So again, we're in the process of designing, having our interactions with the FDA, and plan to finalize those interactions and start a phase 1 later this year in the fourth quarter. So stay tuned on the front of trial design in that.\n\nOnce we've wrapped up those interactions as well as subsequent studies, but I think the plan would be to try to wrap up the phase 2 and hopefully be in phase 3 next year, and then we'll have to see what the environment of the virus looks like in terms of how we schedule and size that trial. Were you able -- hopefully, you were able to hear the answer to the question. \n\nUnknown speaker\n\nYes, we were. Thank you.\n\nJay Luly -- President and Chief Executive Officer\n\nAll good. Good. Thank you. I'm holding my breath here.\n\nJennifer Viera -- Investor Relations\n\nNext question, please.\n\nOperator\n\nThe next question comes with Roy Buchanan with JMP Securities. Please go ahead.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nHi. Thanks for taking my questions. I had a few for 235. The 4:1 lung-to-plasma ratio that you guys are talking about for total drug, is that using the total amount of drug that's in the plasma? Or is it just the free nonprotein bound drug? And then in the IS-IRV poster you had last year, there was an EC90 of 33 nanomolar.\n\nWas that corrected for serum protein binding?\n\nJay Luly -- President and Chief Executive Officer\n\nYeah, so the question regarding the 4:1 ratio, it was total drug. We measured total drug in the plasma and total drug in the blood in the plasma. So total drug in the lung and total drug in the plasma. So it's measured in the same way.\n\nSo it does -- it accounts for, trying to think of the right way, the ratio would be the same either way you calculated it, whether you adjusted for the plasma or adjusted for binding in one tissue and the other, it would be the same sort of adjustment, the ratio wouldn't change. And then with regards to -- I'm sorry, what was the other question?\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nPoster from IS-IRV meeting last year, the EC90. \n\nJay Luly -- President and Chief Executive Officer\n\nThe 33?\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nYeah.\n\nJay Luly -- President and Chief Executive Officer\n\nYeah, it was not plasma adjusted. That was in -- I think it was in human airway epithelial cells, was that cell line at the time. Yeah, so that was not adjusted in that.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nOK. And then I had a couple on -- a question on the headache. I guess any characterization you can make? Does it onset early? Does it resolve or persist or does it come on later in the treatment course? Thank you.\n\nJay Luly -- President and Chief Executive Officer\n\nIt resolved. I don't recall exactly when it came on, but any headaches that were observed resolved. So.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nOK, thank you.\n\nJay Luly -- President and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThe next question comes with Brian Skorney with Baird. Please go ahead.\n\nBrian Skorney -- Robert W. Baird -- Analyst\n\nHey. Good afternoon. Thanks for taking my questions. I know it's reported as a low rate in trials, but it seems like the paxlovid rebound in practice is pretty common currently.\n\nSome estimates have seen to have that as much as 50% obviously we saw out and rebound on it. Just thoughts on what you think this is? Is it a paxlovid PK issue? Do you think they don't have enough 24-hour coverage? Do you think five days isn't enough? Could it be a potential resistance issue? And just how do you think the EDP-235 and sort of your program development could try to focus on ensuring that you mitigate it in your program?\n\nJay Luly -- President and Chief Executive Officer\n\nSure. Thanks. You cut out at least at the end on the beginning of the question, but I think I've intuited what it was. So the -- it doesn't appear to be a resistance issue.\n\nThere's no sign of resistance with regards to paxlovid treatment. So I assume -- well, this is just hypothesis right now. It could be that paxlovid could profit from longer dosing. That's one possibility.\n\nBut I think the other has to do -- it does -- paxlovid does have a short half-life, even though there's a ritonavir boosting involved. And our clinical half-life is longer once a day. So that having good PK characteristics can only help you. The other characteristic of 235 is that it has good tissue partitioning and potentially into tissues that could be a reservoir of virus.\n\nAnd so we think that a molecule like EDP-235 with very good PK, once-daily dosing, nice long half-life, good exposure multiples and good tissue targeting, could help potentially find the virus where it might be hiding and help with that. So that's one of the things that we're hoping to find out in future studies. The duration of treatment of five days versus seven or something longer, no one really knows the answer to that, other than five days with paxlovid isn't that bad. Can you do better with a better molecule that has different characteristics? That's the possibility that we'll be exploring in the future.\n\nDoes that help?\n\nBrian Skorney -- Robert W. Baird -- Analyst\n\nYeah, that's very helpful. And then if I could just sort of another quick question there on the ALT elevation you made. So I was just wondering if you've discussed the NOL for EDP-235 is the end organ tox liver here. And just I know in the protease experiences sort of uncommon ALT elevations that are mechanistically distinct from liver injury.\n\nI just wonder if you go up -- if you have any idea. \n\nJay Luly -- President and Chief Executive Officer\n\nYeah, we haven't -- yeah, we typically don't describe our preclinical safety findings, if any, other than with the FDA.\n\nBrian Skorney -- Robert W. Baird -- Analyst\n\nOK, thanks, Jay.\n\nJay Luly -- President and Chief Executive Officer\n\nYup. You're welcome.\n\nOperator\n\nThe next question comes with Eric Joseph with J.P. Morgan. Please go ahead.\n\nUnknown speaker\n\nHi. Good afternoon. This is Hannah on for Eric. Thanks for taking the questions.\n\nJust a few from us. Just wanted to get a sense if there's any alternative mechanisms in the COVID-19 viral life cycle that you'd be looking to target like co-target with EDP-235 to have just more of a potency profile upfront? And then for the second question, just what are your current thoughts on the relationship between viral induction, COVID-19, has there been a consensus reached by the scientific community on this? And is there any utility in your view in using reduction in viral load as a registrational endpoint?\n\nJay Luly -- President and Chief Executive Officer\n\nYes. I'm sorry, you broke up on parts of both questions, but I think the first question was, are there other mechanisms that we're thinking of in COVID other than protease. Did I -- was that the question?\n\nUnknown speaker\n\nYes. Just any other mechanisms you're interested in. And would you look to maybe look at combination pathway or combination approach upfront just so you have that [Inaudible]\n\nJay Luly -- President and Chief Executive Officer\n\nOK. You cut out right there. But the -- so the short answer is, there are other mechanisms. We're looking at a couple of other ones in-house.\n\nAgain, not lacking any confidence in 235 against the COVID world as we know it now, but just sort of doubling down with our strengths in protease, thinking about the future and if the virus were to take any twists and turns, maybe there would be the need for combinations in the future. Again, no sign of that offering benefit now, but we're in long term here. So since the beginning of the pandemic, we've been working on multiple different mechanisms in-house. The second one, I heard the tail end of the question.\n\nI thought it was asking, did -- was it possible to have a virologic endpoint in registration. Was that the question?\n\nUnknown speaker\n\nYeah. Just what is the utility of biologic endpoint in COVID currently?\n\nJay Luly -- President and Chief Executive Officer\n\nWell, it's a little confusing in part, because remdesivir seems to have good data in terms of prevention of hospitalization and death in patient populations, but yet it hasn't demonstrated an effect on viral load reduction, yet other mechanisms such as protease inhibitor has demonstrated viral load reduction. So it's a little bit -- it's not the only thing that you can measure that matters. And in fact, the viral load reductions that you sometimes see in COVID when you do see them are fairly modest. I think that's in part based on the area that you can readily sample, which is through a nasal pharyngeal swab.\n\nSo where that goes in terms of endpoints, I think you want to -- certainly, if you can demonstrate an antiviral effect or a trend wherever you can look for it. But beyond that, that doesn't always appear to be necessary and I would put nukes in that category or at least remdesivir. Is that helpful?\n\nUnknown speaker\n\nGreat. Very helpful. Yes. And just thinking about outside of Covid and outside of respiratory viruses, just wondering if there's any potential for antiviral acute treatment approach in something like monkey box, considering it does seem to hang around a little bit longer than respiratory infections? Is this something of interest for you guys?\n\nJay Luly -- President and Chief Executive Officer\n\nI'm not sure. I don't know. Hopefully, vaccines will be ultimately very helpful there. But to the extent they're not, we have our eyes on any viruses where vaccines we avoid.\n\nSo if there's a need, we would be thinking about it.\n\nUnknown speaker\n\nOK, very helpful. Thanks for taking the questions.\n\nJay Luly -- President and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThe next question comes with Brian Abrahams with RBC Capital Markets. Please go ahead.\n\nUnknown speaker\n\nThis is Steve on for Brian. Thanks for taking our question. You shared EC90 multiples for the Alpha and Delta strains. And with some difference between those strains, can you comment on your expectation for multiples with the Omicron variant? And maybe whether you expect time to steady state or other PK parameters would be important for current or future strains that might be faster replicating to assess efficacy or predict efficacy there? Thanks.\n\nJay Luly -- President and Chief Executive Officer\n\nYeah. Sorry, I hate to do this to you, but part of the first part of the question broke up and part of the back end of it did. I'll ask you to repeat the beginning, but I think the Omicron, I heard was the tail end. We have -- we have Omicron studies in process right now.\n\nWe don't have the data. We'll get it later this year. But what -- just speaking about it in general, when you're talking about protease, the protease mutations across all the different variants and even sub-variants, all the different variants of concern like Omicron and then you drill down and look at whether it's BA.2 or 212 or 4 or 4.6 or 5, the protease itself is highly conserved. And any mutations, if they do occur are distal.\n\nThey're far away from the active site of the enzymatic activity where our drug works. And so that's important actually for the virus's own survival is to not radically mutate that site. So what we've observed is up and down the line with every variant that we've tested, first thing we do is look at biochemical test for enzymatic inhibition. And very, very tight data.\n\nYou can see some of that data in our slide deck. So we believe that for all the variants of concern, the sub-variants have followed and very likely future variants, that by targeting the protease mechanism, 235 will continue to have very, very strong activity. And I apologize, I missed the beginning of the question.\n\nUnknown speaker\n\nI think you covered it there. That was pretty comprehensive. Thanks.\n\nJay Luly -- President and Chief Executive Officer\n\nGood. Great. Thank you.\n\nOperator\n\nThe next question comes with Roanna Ruiz from SVB Securities. Please go ahead.\n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nGreat. Afternoon, everyone. So I was curious if you have any thoughts on whether an EUA filing for EDP-235 is still on the table for the FDA? Or at some point, do you think it will be more strategic to go for a full NDA approval for the product?\n\nJay Luly -- President and Chief Executive Officer\n\nWell, right now, we don't know that an EUA is not available. I think it's going to be, again, as we get closer to that time, it's going to be facts and circumstances on the ground with regards to what the virus is doing. But the FDA, I'm not aware that they've given indication yet that for new drug therapies in the antiviral category that it's not available.\n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nGot it. Thanks. And a quick one on RSV as well. I was curious, have you heard anything on the ground about the RSV infection rates in the Northern and the Southern Hemisphere? And how are you monitoring enrollment for your ongoing studies there?\n\nJay Luly -- President and Chief Executive Officer\n\nYeah. Well, we're kind of between sort of traditional seasons. I think next up would be, I don't want to say, hopefully, but the next season would be Northern Hemisphere starting later in the -- it's been very quiet in the Northern Hemisphere of late, which is not unexpected, generally speaking, at this time of the year. So as you get into late Q4, that's the traditional time when it would perk up again.\n\nAnd so that's currently what we're planning and expecting.\n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nGot it. Helpful. Thanks.\n\nJay Luly -- President and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. [Operator instructions] The next question comes with Jay Olson with Openhimer. Please go ahead.\n\nUnknown speaker\n\nHi. This is Chung on the line for Jay. Congrats on the progress. Just maybe a follow-up on a question asked previously.\n\nJust can you share a little more color on the discovery programs on COVID-19? And is that more specific or more potent against some emerging variants? And where do you see the need to combine EDP-235 with another mechanism or with another molecule?\n\nJay Luly -- President and Chief Executive Officer\n\nSure. We see no reason to combine now. Again, there's no signs of resistance, as it relates to patients, who are treated with protease inhibitors. It's an acute treatment, acute infection.\n\nWe're talking about five or so days. And so if you put lots of pressure on the drug, which we do or on the virus, which we do, a trough, we see great multiples of a very potent drug with a long half-life and good tissue uptake. So I don't see the need for it. But as I said before, if a more serious variant came along, someday, you may want to have as many weapons as you could possibly have.\n\nAnd this is no different, by the way, than any virus we've taken on. When we went after hep C, we went after multiple mechanisms, even though it looked like probably a couple would be enough, but you don't know at the -- until you're done, you're always wondering. Same with hep B, same with RSV, when we get into an area, we're going to mine as many different mechanisms until we know we don't need them. As long as we possibly might in the future, we want to be at the cutting edge with everything that we can.\n\nSo I would say EDP-235 being sort of the cornerstone at Enanta. We'll continue to do research on this. And maybe someday combinations will be necessary. Hopefully, they won't.\n\nAnd hopefully, 235 is all we'll ever need or anyone will ever need.\n\nUnknown speaker\n\nGreat. Thank you so much.\n\nJay Luly -- President and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThe next and final question comes with Akash Tewari with Jefferies. Please go ahead.\n\nUnknown speaker\n\nHi. This is Clark again for Akash.Thanks for taking our additional question. First, could you comment on the potential cost for the trials for the EDP-235? And secondly, in your phase 1 healthy volunteer study for EDP-235, what percentage of patients reached EC90? And can you comment on the PK variability across patients? Thank you.\n\nJay Luly -- President and Chief Executive Officer\n\nSo you broke up on the tailend of the question, and it's quite frustrating at least at our end. I hope you can hear at your end. So the cost, I think at the end of the day, we'll need to wait and see how we've sized the trial. It's really hard to project on that until we see how big they are and that's going to be dependent on all kinds of design factors that we haven't finalized yet with the agency.\n\nSo stay tuned on that. I think the -- generally speaking, the concept on the phase 2 piece would be fairly small and then we would head in to the larger portion, which would be registrational, obviously. And ultimately, keeping in mind all of that, our ultimate plan is to be teaming up with a larger company that can more effectively help with the global launch and distribution of the drug. So stay tuned on that front.\n\nAnd then I missed the other part of your question, sorry.\n\nJennifer Viera -- Investor Relations\n\nHello?\n\nUnknown speaker\n\nSorry. The second part of the question was, in your phase 1 healthy volunteer study for EDP-235, what percentage of patients reached EC90? And can you comment on the PK variability across patients?\n\nJay Luly -- President and Chief Executive Officer\n\nI think I'll let Tara take that question.\n\nTara Kieffer -- Senior Vice President, New Product Strategy and Development\n\nSure. No problem. Clark, this is Tara Kieffer speaking. So we actually saw pretty low variability in our phase 1 study.\n\nIt was about 15%. And so we would expect down the road, we would have the vast majority, greater than 95% of the patients above that EC90 value.\n\nUnknown speaker\n\nGreat. Thank you.\n\nTara Kieffer -- Senior Vice President, New Product Strategy and Development\n\nSure.\n\nOperator\n\nThis concludes our question-and-answer session. I would like now to turn the conference back over to Jennifer Viera for any closing remarks. Please go ahead.Jennifer VieraThank you, everyone, for joining us today. Serious apologies for the technical glitches.\n\nIf you do have any follow-up questions, feel free to contact us by email or call me at the office. Thanks again, and have a great evening. Goodbye.\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJay Luly -- President and Chief Executive Officer\n\nPaul Mellett -- Chief Financial Officer\n\nUnknown speaker\n\nJennifer Viera -- Investor Relations\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nBrian Skorney -- Robert W. Baird -- Analyst\n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nTara Kieffer -- Senior Vice President, New Product Strategy and Development\n\nMore ENTA analysis\n\nAll earnings call transcripts"
}