{
  "companyName": "AppLovin Corporation",
  "companyTicker": "APP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/applovin-corporation-app-q3-2022-earnings-call-tra/",
  "content": "AppLovin Corporation (APP 0.96%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nRyan Gee\n\nHello. Good afternoon, everyone. Welcome to AppLovin's earnings call for the third quarter ended September 30, 2022. Joining me today to discuss our results are our co-founder, CEO, and chairperson Adam Foroughi; and our president and chief financial officer, Herald Chen.\n\nPlease note our SEC filings, as well as our shareholder letter discussing our third quarter performance, are available at investors.applovin.com. During today's call, we may be making forward-looking statements regarding future events, expectations regarding the market, the future financial performance of the company, and our strategic review of our apps portfolio. These statements are based on our current assumptions and beliefs, and we assume no obligation to update them, except as required by law. Actual results may differ materially from the results predicted.\n\nWe encourage you to review the risk factors in our most recently filed Form 10-Q for the fiscal quarter ended June 30, 2022, and in our Form 10-Q for the third quarter, which we expect to file later this week We will also be discussing non-GAAP financial measures. Reconciliations of our GAAP and non-GAAP financial measures are included in our shareholder letter available on our investor relations website. Please be sure to review the GAAP measures and the reconciliations as the non-GAAP measures are not intended to be a substitute for or superior to our GAAP results. Be advised this conference call is being recorded, and a replay will be available on our IR website.\n\nI'd now like to turn it over to Adam for some opening remarks, then we'll open it up for Q&A. Please go ahead, Adam.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nThanks all for joining us today. As this market continues to be difficult, it's easy to get disappointed, but you're not going to hear any disappointment from me today. I've been building businesses for nearly two decades now. And one thing I know is it takes years, not quarters to build a great business.\n\nWe have several things to be excited about at AppLovin today. First, in '22, we're going to generate over $1 billion of EBITDA, growing nearly 50% over '21. We're going to convert a majority of this to cash. Our ability to generate so much cash allows us to patiently address our market and go after the business opportunities in front of us even in a difficult market.\n\nSecond, our business is incredibly stable. It's easy to look at our industry and realize how difficult it is right now, but it's really easy also to forget how big a sector we're in. Everyone's got a mobile device. Most people are playing mobile games.\n\nMany people are playing mobile games every single day. The size and stability of our category, as well as our market-leading technologies give us a lot of confidence in our business long term. So, what are we focused on at AppLovin today that gives us a lot of confidence that as we go through this economic downturn and come out, we're going to be a stronger business for it. First and most importantly, we're focused on retaining our core team.\n\nMany of our key contributors have been at the company for many years. I've had the pleasure of working with each and every one of you. We're going to continue to invest at AppLovin to make it a great place to work at. Second, we're really focused on attracting new talent.\n\nOver the last decade, there's been a talent crunch in Silicon Valley. More recently, we're getting resumes from incredibly qualified individuals better than we've ever seen before. The opportunity to attract new talent and pair with our existing and exceptional team gets us very excited. Third, we're working tirelessly to improve our core technologies.\n\nWe see a path to doing so. And if we're successful, it will allow us to create growth that we can control. Fourth, we're still investing in new initiatives, and we're very excited about these. They utilize our core technologies and core competencies and will enable us to go into bigger market opportunities.\n\nIf we're successful here, we'll create immense upside for both our shareholders and team. And lastly, we'll continue to be strategic with our cash. We'll look at share buybacks. We'll also use this moment in time to try to attract new investors, shareholders that are going to be focused on our long-term vision, just as we are.\n\nThe market today presents a low multiple entry point into our company. What's interesting about that is we generate a ton of cash, so it gives us a good base, and we're also going after very, very big opportunities. If we're successful in executing around our vision over the coming years, we're going to create outsized returns, private market like returns. That opportunity gets us really excited.\n\nIn fact, we're working harder today at AppLovin than we've ever worked before because of that upside. I'll now hand you off to Herald.\n\nHerald Chen -- President and Chief Financial Officer\n\nThanks, Adam. And as we outlined in our shareholder letter, given the challenging backdrop, we are very much focused on what we control. Firstly, bolstering our leadership positions in our core markets and our core products; and second, using this cash flow that Adam mentioned, to really invest behind initiatives that are focused on increasing the durability of our business, ultimately leading to long-term growth, which will then lead to enterprise value creation. Shifting to the third quarter.\n\nStarting with the software business, we grew that 59% year over year. And based on our guidance from the second quarter, as expected, it was generally flat to the third quarter. EBITDA grew 49% year over year and achieved a 62% margin in the third quarter. We had 538 SPECs, a record in the quarter, and that also had an NDRR, net dollar revenue retention of 166%.\n\nOn the app side, which is a midstream or change, operational changes as we previously discussed, the revenue was down 24% year over year, but EBITDA, which is where we're focused, was up 12% to a 17% margin. So, on a combined basis, the total revenue was down slightly year over year, but EBITDA was up 35% to $258 million, $1 billion run rate, and achieved an EBITDA margin of 36%. Then shifting to our outlook for Q4. We see Q4 coming in fairly similarly to what we achieved in Q3.\n\nAnd if that's the case, then the year, we'll end up at $2.8 billion with a margin structure around 37% to 38% adjusted EBITDA. The components of that we see would be software being over $1 billion in revenue with a mid-60s EBITDA margin. And on the application side, we would see a $1.7-plus billion revenue stream with a margin structure in the mid-teens. Of note, going forward, we will only be providing our forward quarter guidance and will not be providing a full year guidance in the future.\n\nThen talking about cash flow in a little more detail. We do plan on generating $1 billion of EBITDA this year. We also plan on finishing the year with over $1 billion of cash on our balance sheet. And as you all know, we're able to convert a high percentage of the EBITDA to free cash flow, given our very limited amount of capex.\n\nAnd as Adam described, we're able to then reinvest those dollars and have the financial flexibility and the patience to invest in projects, not trying to chase quarter-to-quarter growth on things that don't yield long-term return, but really invest behind our team, our talent and our tech to ensure that we're in a great spot going forward. We also have $400 million of availability -- over $400 million of availability on our stock repurchase plan. And given the stock market environment today and the rerating of risk, as well as our highly leverageable operating structure, where if we do have growth in our high margin, high cash flow business, we think the combination of today's stock valuations and stock multiples, combined with the ability to have high operating levers when we return to growth, those dollars fall into the bottom line. We think for shareholders and for us in considering stock buybacks could be a very attractive return.\n\nAnd with that, I'll turn it back to Ryan to go through Q&A. Thank you.\n\nRyan Gee\n\nThanks, Harold. So, we'll now begin the question-and-answer portion of the call. [Operator Instructions] And we'll get through as many as we can in the allotted time. So, the first question that we're going to take is from Tim Nollen from Macquarie.\n\nGo ahead, Tim.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nRight. Can you guys hear me?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nAll good, thanks, Tim.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nExcellent, thanks. Could I dig in a little bit to the software platform side, please? You've said previously that given the integration of MoPub and the great scale you've got there, all the integrations you've got on the mediation platform, that game makers will simply have to continue advertising to promote use of their games and you've got such a great market position there. It does, however, look like the growth is slowing. Just wondering if you could maybe update us on your thought process as to how game developers are going about their advertising or where they are pulling.\n\nAnd is there any increased risk from some of these being small game developers and therefore, in a financial crunch like this, high-interest rates, maybe they're running into some sort of near-term funding problems of their own, and that might lead to them pulling back on spending. Thanks.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nThanks, Tim. So, a couple of things packed in there that I'm going to address. First, we're on our mediation platform and also AppDiscovery platform, we're market leaders. The MAX platform, that's our mediation solution probably has the vast majority of all the ad inventory in the gaming sector running through it.\n\nNow what's interesting about that is it gives us access to a diverse set of advertisers where we're not dependent on any individual one. And most companies this year have been going through their P&L and really cutting costs. So marketing and opex. So most companies are at a stable point now where you're seeing the gaming market not growing because of that because of the focus on cash flow but you've also had that happen.\n\nAnd because we've got a lot of diversity and because the sector is so big and consumers are still engaging with mobile games as much as they've ever engaged before. And the biggest change was just this handicap of shift from growth investment to cash flow, and that's already been baked in. That gives us a lot of confidence in the stability of our business that I referenced in my comments a couple of minutes ago.\n\nRyan Gee\n\nTim, did you have any follow-ups? \n\nTim Nollen -- Macquarie Group -- Analyst\n\nNo, I'll jump back in queue, let some others go in. Thanks. \n\nRyan Gee\n\nOK. We'll next go to Youssef Squali with Truist Securities. Youssef, go ahead.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nHi, guys. Can you hear me?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYes, we can.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nExcellent, thank you. So, I guess just as a follow-up to the comments about the stability in the business, Adam, I know you guys are not guiding, obviously, to 2023. But how are you guys thinking about the puts and takes? As you go through your own budgeting process, do you think at a base level that 2023 is a growth year or not? And then revenues from non-SPECs was down 34%. Can you just unpack that for us a little bit what drove that?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nSo, I'll touch on the first point, and then we can come back to revenue from non-SPECs because frankly, I think that's just a very small percentage of our numbers. So it's going to be a volatile metric that doesn't, frankly, matter a whole lot. When you think about the business as it is, again, we're very strong in the market. We have very consistent business.\n\nSo there's no share loss anywhere in our core technologies. They work really well for the mobile game developer. And the one thing that we can't control that gives us hesitation on having long-term guidance right now is this focus of cash flow among our advertiser base and frankly, any company in technology today and away from growth. That's been baked into a lot of businesses at this point.\n\nMost managers are savvy enough to now have made the changes there. We just don't know when that reverses out. When the economy is going to turn around, when there will be a shift back to growth and sort of when you get to the bottom of this economic downturn. What we do know and that gives us confidence is we're already there and the business is very stable.\n\nWe also know that our core technology has a lot of room to improve. That was another thing I touched on is that we're working really hard to improve it. And really, we have two paths to grow. One is advertisers are willing to invest more into growth and cash flow.\n\nSo, they're going to lower their goals and invest more dollars into our platform. The other is entirely in our control. It's improving the efficacy of our solution so that we're able to take the dollar spent. And even at a tighter set of goals, drive more scale to our advertising partners.\n\nWe see a path to doing that, and that's what we're working on today. Both of those things give us a lot of confidence that we're going to have a strong baseline where we are in terms of the cash that we're able to generate, and we have room to grow as well that both has one factor outside of our control and one factor entirely within our control.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nOK. But at a high level, though, no comment whether 2023 is a growth year for you guys or not. I guess you're saying it really depends on the overall macro environment.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nAnd our overall ability to improve our core technologies. \n\nYoussef Squali -- Truist Securities -- Analyst\n\nRight. On the non-SPEC, the reason I was asking is to try to get a sense of whether you're seeing more of the weakness among the smaller kind of software platform clients were among the enterprise because the non-SPECs would tend to be the smaller ones, correct?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. Honestly, we don't actually look at each individual business. None of these partners make up a big part of our business. It's just as a whole, we all know that every company is under a lot of pressure right now to cut costs.\n\nSo there has been just cost-cutting and budgetary constraints across the advertising sector. That's impacted most businesses, whether small or big.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nGot it. Thank you.\n\nRyan Gee\n\nThank you. We'll next go to Eric Sheridan, Goldman Sachs. Eric, go ahead.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for taking the question. Hope you can hear me OK. Maybe two, if I can. First, on the software platform.\n\nIntrigued by the comment you made in the letter about continuing to invest for the long term against potential new use cases. Away from the dynamic you find yourself in the market today, maybe sketch out a little bit about what you're sort of investing against for the longer term and how you see the software platform continuing to evolve. That would be number one. And then number two, turning to the apps business.\n\nFelt like based on the letter, there was a fair bit of puts and takes in the quarter, the relevance of selling nonstrategic assets some investment being redirected in different elements. Can you talk a little bit about some of the headwinds and tailwinds just historically, that business faced as a result of those decisions in Q3 that impacted the absolute dollar amount we saw? Thanks so much.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nI'll take the first question, Eric, and Herald will jump on the second. When it comes to our core business, we're pretty large scale at this point. We've talked about processing billions of dollars a year of advertising budget, and we're netting quite a bit, well over $1 billion a year of software revenue. And so at that level of scale, we built very good core technologies there.\n\nWe also touched on a couple of letters ago about some investments in new initiatives. These have option value in our business. Frankly, like I said, I've been building businesses over a couple of decades. It takes years to be able to build the business to make an impact on a business as large scale as ours.\n\nBut what gives us confidence going after these is they use the same core technologies and core competencies as our main business. One of those is extending our advertising solution to CTV. We did an acquisition there with a team role that we're very excited about. They have core technologies that are differentiated.\n\nAnd as we get our ad technologies to be sophisticated enough to extend to CTV, which is a work in progress, there'll be a go-to-market there, too, and the two technologies will couple together. Initiatives like that, we're not baking into any of our forward outlook or a thought process around the short term in the business, but we think long term will create immense shareholder value and value for our team.\n\nHerald Chen -- President and Chief Financial Officer\n\nEric, on the app side, I think we're making very good progress against our initiatives to get our portfolio to the position we want to get in terms of both the margin and then in a position for growth. So, I'd say, really, there's three things that have taken place there. One was instead of just driving users to gain the data, we really cut back on the UA to make sure that we are driving strong ROAS. And as we know in this marketplace, ROAS is even more difficult to come by.\n\nAnd so, we've managed that UA spend. So, we're taking revenue hit in exchange for profitability. And then the second lever is just going through the portfolio and saying, well, which ones actually have the ability to drive real enterprise value for us in the long term? And there's some that frankly need more investment and more team, and there's others that really won't get there. And so, we're in the process of winnowing through that, some of the studios we've just shut down or sold back to the founder.\n\nWe're renegotiating some of the earnouts. And again, others were actually investing in quite a few new games. So, the third lever will then be ultimately when we get to portfolio that we want to own and grow forward. We think that will be a healthy portfolio.\n\nWe hope to get there really by the end of this year is what we talked about. And then from there, it really depends if the market recovers in terms of valuations on whether or not we'd actually be able to monetize any significant portion of the portfolio. We may end up owning all of it, or with the right bid, we may end up selling all of it. But given the macroeconomic environment and where purchase multiples might be out there, our focus is very much on owning those assets for now, optimizing them and then figuring out what value creation could be had down the road.\n\nAnd it is a significant amount of value relative to our current enterprise value and would be very accretive and deleveraging to us, we think, with the right price for the right assets.\n\nRyan Gee\n\nWere there any other follow-ups for you, Eric?\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nAll good, thank you.\n\nRyan Gee\n\nOK. Thanks, Eric. We'll next go to William Lampen at BTIG. Clark, go ahead.\n\nClark Lampen -- BTIG -- Analyst\n\nHi, guys. Good evening. I've got two. Adam, you talked a couple of times about improving your own core technologies, and you alluded to that a couple of times sort of intra-quarter back in August and September.\n\nI wanted to see if maybe you could give us just a small window into sort of what you're working on, how that's progressing, and sort of what's in focus. And then on diversification and appreciating that you guys are operating this business with more of a long-term mindset right now. And I think, as you said, like a private entity, are you comfortable investing more to help scale and drive growth for businesses like Wurl or perhaps also Array or Vessel next year? And maybe along those lines, has Apple's change around in-app NFT utility changed the priority in terms of which of those new businesses, you do want to focus a little bit more on scaling and growing? Thanks a lot.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nThanks, Clark. I'll go to the second first and then back to the first question. We're focused on investing in new initiatives but we know how to build businesses with a cash flow mindset from the very beginning. As a company at AppLovin and we were profitable our second month in operation.\n\nAnd every one of these new initiatives, we take that same approach into. We're excited about the opportunity. We leverage a lot of the resources that we already have in place and the incremental investments that we're making into them are not material given the market opportunity that they present us. We'll continue to approach any business opportunity that way.\n\nWe think of them as start-ups and the GMs that we have running those businesses also think of them as the CEO of a start-up. And when you have a new business that you're trying to incubate and build, a lot of times, you want to do it organically, make sure the product market fit is there, not overinvest early, and then we will invest behind growth as we know that we have something that's hot. And at that point in time, we'll talk about these businesses because in theory, they'll be making an impact to our numbers, both revenue and cost. And on the first question, when it comes to core technology, we always measure the error rate in our predictive engine.\n\nThe whole model is predicated on being able to predict what are users going to download and engage with next and driving value to our advertisers. Value comes from revenue. So we've got to be very, very good at predicting a future event. And we know that there's error in our system.\n\nThere's a lot of incremental changes that we, as a technology company, will do at all times. But very rarely, we'll go and rebuild a lot of our core system. We're doing both right now. And the last time we rebuilt a lot of our core systems to try to get an upgrade was actually the initial release of AXON, which was now, I think, about two years ago and obviously facilitated a ton of growth in our business.\n\nWe're very excited about the potential of all of our investments in technology into our future.\n\nClark Lampen -- BTIG -- Analyst\n\nThat's really helpful. And if I could, maybe, Herald, just as a quick follow-up, you have north of $400 million in authorization for your buyback right now. I know that you have a lot of sort of attractive capital allocation opportunities in front of you. How does the sort of stock buyback option fit into the overall priority set right now?\n\nHerald Chen -- President and Chief Financial Officer\n\nYeah. Thanks, Clark. Look, it is a high priority for us to allocate our capital wisely, particularly when there's opportunities that arise. And in this market, maybe it's around stock, maybe there's other assets that have gotten a lot cheaper that we'd want to own or it's just hiring a lot of great people that we didn't have access to before.\n\nAnd so, we're taking advantage of this time in making lemonade out of these lemons, and we're glad to have the EBITDA that we do and the cash balance sheet that we have. But certainly, at these stock prices and given all the upside opportunities we see in the free cash flow characteristics and just the cash-on-cash yield that we project out, we certainly are considering stock buyback and we think the sizing of $400 million. We'll have to figure out what's the right amount to use at what period of time.\n\nClark Lampen -- BTIG -- Analyst\n\nThanks, guys.\n\nRyan Gee\n\nOK. Thanks, Clark. We'll next go to Matt Cost at Morgan Stanley. Matt, go ahead.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nHey, can you hear me?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYes, we can.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nGreat. Hey, Adam. Hi, Herald. So, it seems like the overall app install ad market has been decelerating over the course of 2022 but has not reached the level that we've seen mobile gaming and consumer spending on mobile gaming reach where you've got market year-on-year decline.\n\nSo is it a fair statement that maybe the ad business here is a lagging indicator to what consumers are spending on mobile games? And does that create maybe more risk for next year, which you're reacting to? That's question one. Question two is, are there any indications or data points that you'll be looking for? I know you can't predict the future, but that you will be looking for to try to assess when the market has bottomed and maybe you'll be looking for opportunities to push harder on investment at that point.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. So, I'll take the second first again, just top of mind. Look, we're investing in our business as it is. We run a high-margin business because we've got a lean team, we've got an exceptional team that creates a lot of output.\n\nWe've been run entrepreneurial since the get-go. So, there's no shortage of investment against things that we see as opportunities. We've got new initiatives that we're investing into. We've got a technological rerate that we're investing into.\n\nAnd we're organizing a lot of the acquisitions that we've made over the last couple of years to be more advantageous for our business going forward. So, we've not stopped investing and we'll continue to invest both in growth opportunities that we see in front of us right now and those that we come up with in the future. Nothing about the market is going to change that because we do generate enough cash to be opportunistic enough to be able to invest in things that we deem worthwhile even in today's market. Now when it comes to the market itself, mobile gaming has been declining.\n\nPeople are still consuming the same amount of mobile games, though. The big change, there's been two changes. One is, as we've talked about, macroeconomically, a lot of companies are focused on cash flow and away from revenue growth. That's just a requirement.\n\nThat's already baked into the advertising ecosystem. The other change that came obviously in our sector right around the same time as the economy fell off is that IDFA change. And traditionally, mobile gaming companies were able to spend a lot of their revenue back in the user acquisition, namely on some big social properties to be able to grow. Those buys had the best return on ad spend.\n\nThey were highly targeted, and they were able to use those profits to subsidize future growth. Take that away, and you have two things that really hit the category. And both those happen at the same time. So, you can't really decouple them.\n\nBoth are also baked into the business. Our business, we're fortunate enough to have a massive penetration in the market we operate in. Our mediation product is market leading and our AppDiscovery product is market-leading. And we've got no dependency on any single advertiser.\n\nThe nice thing about mobile gaming is that it is a very commoditized industry when it comes to advertising. All of our mobile gaming categories have multiple gaming companies that all look very similar to the naked eye. They certainly have different products. But if you think about some of our biggest advertisers, they make solitaire games or they make puzzle games, and there's 100 other ones of them that look the same, and most of them are marketing on our platform.\n\nSo even if a couple of them start struggling as businesses, the other ones just fill in the gap. Therefore, we look at our businesses in a very stable place, and we don't see much more deteriorating going forward.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nSo would it be fair to assume then that your quarter ahead guidance does not contemplate material further deterioration?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah, I think we said, stable.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nGot it. Thank you.\n\nRyan Gee\n\nThank you. We'll take our next question from Stephen Ju at Credit Suisse. Stephen, go ahead.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nAll right. Thanks, guys. So, Adam, to dig into the AXON topic a little bit more. I think you've previously talked about how it has helped you guys drive I think it was a 500% improvement in the accuracy of what ads you are showing.\n\nSo, have those improvements been fairly steady over the last couple of years? Or do they tend to show up in large steps as you think about what kind of effective CPI improvements you could drive over the longer term? And also, if you can update us on where you are in the transition of the mediation solution from, I guess, the more waterfall to real-time bidding? Thanks.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. So, on the first, obviously, when we rolled out the AXON upgrade, there were huge step-ups of growth. And when you roll out a core technology like that, it has to get adopted by all your advertisers. So, we have very predictable growth that was in the double digits, I think, around 30% for four subsequent quarters.\n\nThat accuracy came from the upgrade in the engine. Then we've had incremental changes every step of the way. A material upgrade to the engine really is a step function opportunity, whereas your incremental upgrades end up just baked into your numbers. This isn't to do with CPI though.\n\nIt's not that we were able to improve the accuracy and drive up CPI. Our goal is to say advertisers have their goals. Our advertisers are willing to spend today in our platform of whatever return on ad spend goals they've set, the amount that they're willing to spend. We have a lot of excess budget that we're not able to fulfill today.\n\nSo, if we're able to improve the accuracy of our predictive engine, we'll be able to fulfill that excess budget and maintain advertiser rates similar to where they are. So that the advertiser is happy, and we're growing our business. And that's the opportunity that we're excited about. That's a performance business at its core.\n\nSo, on the second question, in the move from mediation to real-time bidding, we've talked about this in the past. There were some early adopters of real-time bidding, and a lot of the market is going to move there over time. And there's just some technology companies that are still getting to the point of being able to support real-time bidding instance. Now the biggest and most interesting partner there for us in the future is Google.\n\nThere was an announcement a couple of months ago about their investment in real-time bidding. We're one of the launch partners for their efforts there. They're starting to see strong success there. We love that partnership.\n\nAnd together, if we can facilitate Google moving toward real-time bidding, it will really end up tilting the majority of the market over to it. We're excited about that. It will create efficiency gains for publishers, incremental revenue for the publisher that will then flow back into user acquisition. Obviously, we can charge for it.\n\nSo, it improves the business opportunity we have with the MAX products. And so, we think there's a lot of gains to be had there over the coming quarters and years.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nAnd Herald, I think up to 40% of your revenue base is coming in from international given the strength of the U.S. dollar that had to have put the squeeze on revenue growth for you guys a little bit. So, can you talk about the FX headwinds probably separated for perhaps the software business, as well as apps? Thanks.\n\nHerald Chen -- President and Chief Financial Officer\n\nYeah, for us, a lot of the app side is transacted in dollars and through app stores. And so really more of the FX headwind is probably more macroeconomic and then if people are just transacting in a currency, then it's always translated into dollars for us. So, we don't actually -- for our specific P&L, on the software side as well, we don't have like a big FX headwind on our P&L. It would be just if there was some currency translation of someone buying a good in a game itself, for example, you might see it there.\n\nBut for us directly, it's not a big impact.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nGotcha. Thank you.\n\nRyan Gee\n\nThank you, Stephen. Well, next go to Jason Bazinet with Citi. Jason, please go ahead. Hey, Jason, please check that your -- that you've unmuted yourself.\n\nGo ahead and ask your question. OK. We'll next go to Omar Dessouky at Bank of America. Omar, please go ahead.\n\nOmar, please check that you've unmuted yourself.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nOK. Can you hear me now?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nWe can.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nYeah. So, look, in terms of specifically these other big players in the market that have been dominant prior to IDFA. They're making a lot of investments into kind of privacy-enhancing technologies and infrastructure and presumably once they get around to completing that and have it available for general use, market share could kind of shift back to them. And I was wondering if you had any thoughts on how long -- like how many years that would take before some of these players like Facebook could get there?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. Thanks for the question, Omar. We can't comment on what other people are investing into or how long those investment efforts will take. But the reality of our sector is we want the pie to be growing.\n\nIf the pie is growing, it means advertisers, these mobile gaming companies in general are able to reinvest more dollars into user acquisition. And we've got a strong share of that pie. We've always had a strong share of that pie. We had a very strong growing business.\n\nPrior to the IDFA change, we didn't really change a whole lot. After the IDFA change and now we're just caught up in the macroeconomic cycle. But the reality is that IDFA change is a burden on the growth of the whole sector. We want our advertisers, including our own gaming studios to be able to invest on Facebook and other properties as successfully as they possibly can.\n\nThe deployment of dollars in efficacious and ROAS-based advertising creates this upside to the category that did fuel a decade of consistent growth. Take that away and it creates a handicap. So, we have no fear to that. We hope that all the technologies in the ecosystem continue to innovate and improve.\n\nWe also, as a possible growth opportunity are hoping that Apple and the other -- and Google and other platforms bring more inventory online because as Apple continues to invest in their advertising efforts and they've talked about bringing more inventory online, it creates more places for these same advertisers to go invest and again, grow their business. Because our business is performance-based, that never means that we lose budget. It just means that the businesses of our advertisers will improve, which then ends up allowing them to be more stable companies and reinvest back into our platform as well.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nOK. So, if I heard you right, it sounds like you're saying that a resurgence of those dominant companies pre-IDFA is actually more of like a tailwind and benefit for you guys rather than headwind --\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. We want a growing sector. In a growing sector and a predictably growing one where companies can reinvest their dollars, everyone is winning together. And we have market leadership technologies when it comes to monetization, mediation, and growth.\n\nAnd so we've got a very strong base to our business. We were always totally fine, doing very well, growing consistently prior to the IDFA change and we'll see that afterwards if these companies do make their technologies more efficient again.\n\nRyan Gee\n\nAny other follow-ups, Omar?\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nNo other follow-ups. Thank you very much.\n\nRyan Gee\n\nOK. Great. Thanks, Omar. We'll next go to Franco Granda with D.A.\n\nDavidson. Franco, go ahead.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nYes. Good afternoon, everyone. Thanks for letting me ask a couple of questions here. I was wondering, how many studios are you down to at the moment? How many do you own? And how should we think about the performance-based payments for the studios given the lower expected revenues?\n\nHerald Chen -- President and Chief Financial Officer\n\nYeah, we have about a dozen studios now, and we are -- as I think I mentioned before, in process of renegotiating some of those payments. The vast majority that have already been paid out. And some of those studios are obviously not performing and not going to hit their earnouts either. And so, the projected earn-out payments are not terribly significant.\n\nWe hope as we restructure them in a way that there's more alignment for the new world and the new expectations that they succeed and we succeed along the way. So they're very much going to be aligned with our success going forward.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nAwesome. And then can you speak to what the business at Wurl is like at the moment? Where do you expect it to end for the year relative to your expectations entering the year? And then maybe any color around customer engagements that could translate into revenue next year? \n\nHerald Chen -- President and Chief Financial Officer\n\nYeah, we're excited to own Wurl. Obviously, it's a very big category. If you've been looking at some releases of companies that are involved in the CTV category, it seems to be the one place that there's some green shoots and some growth. So we're excited to be entering the category and assessing our best strategies there.\n\nWurl in and of itself in terms of revenue still very -- relatively small but growthful. It's in the $30 million, $40 million, $50 million range in terms of where it's going to grow to in the near term. So not meaningful from our revenue standpoint but it is very strategic, given the inventory that they operate with, given all the partners that use them for the distribution of content. We think it's an interesting way to enter the category instead of us trying to do it from a standing start.\n\nAnd they've got a team of people that are thinking about it every single day. And as Adam mentioned earlier, we're very much partnered up with them on the technology side, using our ad tech technology and their experience and expertise in the CTV category to figure out what our best plays are. But that's going to be a longer-term play for us. It is a big category.\n\nWe want to figure out how to get it right. It's very dynamic. A lot of players in the space. And Wurl is going up and groups coming together.\n\nSo it's something we're very focused on and excited about, but still pretty early.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nThank you. That's it for me.\n\nRyan Gee\n\nOK. Thank you, Franco. We'll next go to Martin Yang with Oppenheimer. Martin, go ahead.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nHey, Ryan, can you hear me?\n\nRyan Gee\n\nWe can hear you, Martin.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nGood afternoon. I want to dig in to the mechanics when a diversified publisher scale back UA and focus on ROAS. How -- assuming a customer's yours does the same as you treat your apps? And how does it impact your AppDiscovery and AppLovin Exchange, respectively?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. So that's only directly impactful to us, Martin, on the AppDiscovery side, the ALX business is third-party demand sources that aggregate a lot of demand that may have the same or different models to us. But on the AppDiscovery product, if there's a customer to say, for instance, wants to spend $1,000 a day at 10% return on ad spend, willing to make $100 a day in the first 24 hours, our systems are very good at driving advertising for them that will yield that return. Now that may back into somewhere around, let's call it, a day 270 return on ad spend, where they break even on the $1,000 spent, and they may be looking at this economy and saying, we can't afford to wait 270 days anymore to breakeven on the dollar invested.\n\nSo, they pull back that date. What they would do is they'd go, we're willing to spend the same $1,000, but now get us 20% return on ad spend in the first 24 hours. And again, that in our system, it's all programmatic. So, they changed the goal, it instantly will flow through the system and the advertising now will try to find users that will yield twice the return on ad spend that yesterday's budget and targets would have gone and yielded.\n\nAnd so that's really the change that has flowed through the industry is that as advertisers have had to get tighter with the cash that they're able to invest on user acquisition, those just automatically flow through our system. Now also as this economy goes the other way and we get back to a growth period, hopefully at some point into the future, it will go the other way where they lower their goals and automatically will have a step up in the dollars that we can go spend on their behalf to drive them their new economic goals.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nOne more follow-up on margins for software platform. So aside from your own investment decisions regarding opex and anything else that are in your control, what are the potential factors that could impact your software platform margin?\n\nHerald Chen -- President and Chief Financial Officer\n\nHey, Martin, we report on a net revenue basis to start with. So, we do take out the vagaries of having a gross to net in our net revenue. So below the line there, though, it's really the data center costs, which we talked about before, and we have our contract in place and that we have a very good handle on to know what that cost will be. Our team is in place.\n\nYes, we were trying to add awesome talent that's available to us now. But we're not talking about dozens and dozens of people at a time. So, I wouldn't see any real significant increase there. Our new initiatives, we are spending against already.\n\nSo, it is in the P&L and part of our operating expenses today. Now if one of them catches fire, do we increase dramatically there? Potentially. But as Adam said, we've always been very cash flow focused and return focused. We'll do the right thing there.\n\nAnd by the way, likewise, on the app portfolio, and we've been targeting to get our margins up. But if there is a game that we see in the past, we've done that with Project Makeover and others. But if there's a game that we see that has a great return on ad spend, we will spend there to and possibly bring down margins on a quarterly basis as we scale our game. But on the software side, we have a high degree of confidence and visibility into that.\n\nNow mid-60s margin structure, including new initiatives. And if our core technology ramps up, there's a significant amount of flow-through per incremental dollar to the bottom line given the fact that our infrastructure is basically fixed at this point, as well as our team has paid for as well.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nGot it. Thank you.\n\nRyan Gee\n\nThank you. We'll next go to Ralph Schackart with William Blair. Ralph, go ahead.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nThanks for taking the question. I jumped on late, so I apologize if this has been asked. But can you maybe talk about sort of the softness that you saw in the quarter and maybe sort of the pace of that? And I think on the call, you had said that you feel that stuff is -- that the business has stabilized. Just trying to understand sort of the linear area of the pullback and sort of the comments around stabilization.\n\nThat's the first one. And then I have a follow-up, please.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. Ralph, we referenced it in the last call, but we've been pretty stable since our last big step-up growth quarter. It's not that we're seeing any trends change late in the quarter at all since then. We signaled that we thought it would be relatively flat on the quarter, it was.\n\nWe see the same thing going forward. Right now, we're in an ecosystem that sort of has priced in all of this difficulty on the macro side and difficulty on the targeting side. And so we see stability everywhere in this business at the moment, and that gives us a lot of comfort with where we're at.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nOK. And then just a clarifying question from the shareholder letter talked about during Q3 within Apps business about the sale of nonstrategic assets, did you sell off something during the quarter?\n\nHerald Chen -- President and Chief Financial Officer\n\nYeah, there was one that actually a very, very small asset that we sold back to the founders. They were trying to develop a new game that wasn't going to come to fruition so that they wanted to own the entity going forward. So, it's a very, very small asset.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nOK. Thanks, Adam. Thanks, Herald.\n\nRyan Gee\n\nOK. Thank you, Ralph. We'll go ahead and take our last question from David Pang with Stifel. David, go ahead.\n\nDavid Pang -- Stifel Financial Corp. -- Analyst\n\nHey, guys. Thanks for the question. Just wanted to see if you could provide an update on the DSPs that were transitioning from MoPub to MAX that you highlighted last quarter. And then for Herald, how are you thinking about leverage in general in a rising rate environment? Thanks.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nDSP side, we use the word stable again, super stable. We are cut over on pretty much all the MoPub DSPs at this point. Really, the shift is a year ago, there's a lot more brand dollars in the ecosystem. A lot of these DSPs are advantageous for us because they're hedged on our business.\n\nThey go tap into brand dollars, which is not something we've traditionally focused on. And all of those big vendors are live on our platform. They're doing very well. They like the new infrastructure and system.\n\nMAX plus MoPub is over two times bigger than what MoPub was for them. So, in terms of the pipes being connected up to the DSPs were there, in terms of them being able to spend materially more than they were doing in the past, we're actually there as well because our business is so much bigger. But in the long term, there's really going to be an opportunity there as this economy recovers for these DSPs to flow more dollars to our system.\n\nHerald Chen -- President and Chief Financial Officer\n\nYeah, David, thanks for the question. Yes. So on the leverage side, we feel very comfortable with where we sit today. We're at just over two times net leverage, which is very reasonable.\n\nWe have four Bs in terms of the rating. So, we feel comfortable there as well. Of course, interest rates have gone up significantly and something that we watch. We did hedge out for the year, some of the interest -- actually more than half of the interest fixed for the year.\n\nOur duration also is fairly strong. So, we have maturities coming in '25 and '28. So, we can live with our term loans. There's no maintenance covenants or anything like that on it as well.\n\nSo, it does provide us quite a bit of flexibility. So, we're very, very comfortable with the current leverage levels, and we still generate after interest cost, significant amount of free cash flow. As we described before, we have a relatively modest tax rate. Given a bunch of deductions, we have very little capex to us in there, just a little bit of lease expense.\n\nWe are able to flow through a very strong percentage even with the amount of leverage we're carrying today.\n\nRyan Gee\n\nDavid, did you have any follow-ups there?\n\nDavid Pang -- Stifel Financial Corp. -- Analyst\n\nNo, we're good.\n\nRyan Gee\n\nOK. Well, thank you, everyone, for joining. That does conclude our call for today. We appreciate you hopping on, and we'll speak with you all next quarter.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nThanks, everyone.\n\nDuration: 0 minutes\n\nRyan Gee\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nHerald Chen -- President and Chief Financial Officer\n\nTim Nollen -- Macquarie Group -- Analyst\n\nYoussef Squali -- Truist Securities -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nClark Lampen -- BTIG -- Analyst\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nStephen Ju -- Credit Suisse -- Analyst\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nDavid Pang -- Stifel Financial Corp. -- Analyst\n\nMore APP analysis\n\nAll earnings call transcripts"
}