{
  "companyName": "Smith & Wesson Brands",
  "companyTicker": "SWBI",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/07/smith-wesson-brands-swbi-q2-2023-earnings-call-tra/",
  "content": "Smith & Wesson Brands (SWBI -1.14%)\nQ2 2023 Earnings Call\nDec 06, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to Smith & Wesson Brands, Inc.'s second quarter fiscal 2023 financial results conference call. This call is being recorded. At this time, I would like to turn the call over to Kevin Maxwell, Smith & Wesson's general counsel, who will give us some information about today's call.\n\nKevin Maxwell -- General Counsel\n\nThank you and good afternoon. Our comments today may contain forward-looking statements. Our use of the words anticipate, project, estimate, expect, intend, believe, and other similar expressions are intended to identify forward-looking statements. Forward-looking statements may also include statements on topics such as our product development, objectives, strategies, market share, demand, consumer preferences, inventory conditions for our products, growth opportunities and trends, and industry conditions in general.\n\nForward-looking statements represent our current judgment about the future and are subject to risks and uncertainties that could cause our actual results to differ materially from those expressed or implied by our statements today. These risks and uncertainties are described in our SEC filings, which are available on our website, along with a replay of today's call. We have no obligation to update forward-looking statements. We reference certain non-GAAP financial results.\n\nOur non-GAAP financial results exclude costs related to the planned relocation of our headquarters and certain manufacturing and distribution operations to Tennessee, the spin-off of the outdoor products and accessories business in fiscal 2021, COVID-19-related expenses, and other costs. Reconciliations of GAAP financial measures to non-GAAP financial measures can be found in our SEC filings and in today's earnings press release, each of which is available on our website. Also, when we reference EPS, we are always referencing fully diluted EPS. When we discuss NICS results, we are referring to adjusted NICS, a metric published by the National Shooting Sports Foundation based on FBI NICS data.\n\nAdjusted NICS removes those background checks conducted for purposes other than firearms purchases. Adjusted NICS is generally considered the best available proxy for consumer firearm demand at the retail counter. Because we transfer firearms only to law enforcement agencies and federally licensed distributors and retailers and not to end consumers, NICS generally does not directly correlate to our shipments or market share in any given time period, we believe, mostly due to inventory levels in the channel. Before I hand to call over to our speakers, I would like to remind you that any reference to EBITDAs is to adjusted EBITDAs.\n\nJoining us on today's call are Mark Smith, our president and CEO; and Deana McPherson, our CFO. With that, I will turn the call over to Mark.\n\nMark Smith -- President and Chief Executive Officer\n\nThank you, Kevin, and thanks, everyone, for joining us today. With firearm demand continuing to normalize, our second quarter results once again demonstrated the significant progress we've made over the past several years in creating a highly adaptive and robust business model that consistently delivers strong profitability regardless of market conditions. A comparison back to our fiscal 2020, which was the last period of normal firearm demand, provides a great illustration. While top-line revenue increased by 6% in Q2 of this year versus FY '20, EBITDAs increased by nearly 90%, driven by higher ASPs and lower operating costs.\n\nLooking forward to the second half of our fiscal year, while we anticipate more normal demand levels, our seasoned team has effectively managed through these cycles before, and our business model is specifically designed for this. And we expect to continue delivering strong levels of profitability even with the significant one-time expenses associated with our move to Tennessee. All of this is thanks to the hard work of the Smith & Wesson team in remaining steadily focused on the long-term success of the business, no matter the conditions. And as always, our appreciation for their dedication cannot be overstated.\n\nTurning now to the market. Consumer demand for firearms, as measured by NICS, was largely consistent from our fiscal Q1 to Q2 tracking below the surge period. The trend worsened in the latter half of our second quarter, as evidenced by the accelerated year-over-year decline in monthly NICS, ending with October only nominally increasing sequentially and representing the lowest sequential increase over September on record. Not surprisingly, this deterioration coincided with the broader consumer slowdown, driven by persistently high inflation, the beginning of the winter heating season across the northern half of the country, and rising interest rates.\n\nBut this said, the most recent data from November NICS released last week indicates a return to more normal demand patterns, and firearm demand does remain healthy when compared to historical levels and remains elevated when compared to our FY '20, which again was the last pre-pandemic period. This indicates that the temporary headwinds are being offset by longer-term tailwinds. As you'll recall, there are more than 10 million new consumers added to the firearms market over the past 18 to 24 months, many of whom are now returning for subsequent purchases. With these new entrants, previous study is indicating that firearms enthusiasts will own an average of 7 to 8 firearms, and recent data showing that concealed carry is on the rise, we believe long-term demand trends remain very healthy.\n\nHowever, with the uncertainty surrounding the current economy and its impact on firearm demand levels, many firearm retailers and distributors continue to take a cautious approach and continue to adjust inventory levels. This is creating near-term headwind to our business, as we discussed in the last earnings call. Importantly, this is a normal and healthy process and consistent with how we have seen the market adjust in past periods following significant surges in demand. And we know that inventory levels for our products within our distributors and strategic retail accounts are down considerably sequentially and versus prior year, marking the third consecutive quarter of significant channel inventory decline and indicating, therefore, a solid pull-through of our products at retail.\n\nAll of this means we remain in a highly competitive environment, and winning profitable market share at the consumer level remains our core focus. With many consumers squeezed by inflation and record prices for household essentials, consumer price sensitivity on discretionary purchases has increased, predictably, leading to increased promotional activity within the firearms space. As we have mentioned before, we take a very strategic approach to pricing and are confident in the pricing actions we've taken to align our ASPs with the power of the Smith & Wesson brand and our long-standing reputation for quality and innovation. We believe we are now well-positioned versus competing products across the full feature value spectrum.\n\nThe resulting higher ASPs have driven strong profitability by helping us mitigate inflationary pressures and also partially offsetting lower volumes. We expect our use of promotional activity in this competitive landscape to similarly remain aligned to ensure we do not erode those gains long term. However, we may increase promotional activity on certain of our core product lines in the second half of our fiscal year to address the realities of the current challenging economic conditions. Additionally, and now more than ever, innovation and new product introductions are critical to continuing our leadership position in the industry.\n\nThanks to the hard work of the Smith & Wesson engineering and product management teams throughout the pandemic, we are very well-positioned to continue our steady cadence of product launches. Just in the past few months, we introduced our M&P Metal, a full metal version of our iconic M&P full-size pistol; our EQUALIZER, a 15-round concealed carry pistol featuring our patented EZ technology, which reduces slide racking force by over 35%; and our Competitor, made via our performance center in collaboration with our legendary pro-shooting team of Jerry Miculek and Julie Golob, a full-featured metal frame pistol ready for competitive shooting straight out of the box. These products have been very well received by the market and are exceeding our expectations. And stay tuned, we have several more exciting new products lined up for introduction throughout the second half of our fiscal year.\n\nIn summary, we continue to manage the business for the long term, ensuring we consistently deliver high levels of profitability regardless of which direction demand is trending. Fiscal 2023 continues to be a year of recalibration and adjustment for our industry and Smith & Wesson. Interest in shooting sports remains strong, and participation rates remain above pre-pandemic levels, which bodes well for the long term. Over the near term, the industry is facing the dual challenge of a cyclical downturn and more intense macroeconomic headwinds pressuring consumer spending, particularly on discretionary items such as firearms.\n\nWhile this will likely to continue to impact our top-line revenue over the balance of fiscal 2023, it is precisely the type of environment for which our flexible model was built, and we expect to remain highly profitable and continue delivering on our commitments to our customers, employees, and stockholders well into the future. With that, I'll hand the call over to Deana to cover the financials.\n\nDeana McPherson -- Chief Financial Officer\n\nThanks, Mark. Net sales for our second quarter of $121 million was $109.4 million, or 47.5% below the prior-year comparable quarter, but $7.3 million above the second quarter of fiscal 2020, the last pre-pandemic comparable second quarter. As we noted in our last earnings call, we expected our second quarter volumes to be roughly 20% to 25% of the full year, and we came in within that range. For the third consecutive quarter, inventory in our distribution channel has meaningfully declined.\n\nThis ongoing inventory correction, combined with the impact of promotional activity by our competitors and the trading down by consumers to lower-priced products, negatively affected our quarterly sales. On a positive note, however, the discipline that we've exhibited in promotions during the current quarter has improved our overall profitability when compared with pre-pandemic levels, reflecting ASPs that were approximately 45% above fiscal 2020. Although gross margin in the second quarter of 32.4% was well below the 44.3% realized in the prior-year comparable quarter, the increase in ASPs resulted in a 4% improvement over the second quarter of fiscal 2020. Relocation costs negatively impacted the current quarter gross margins by 1.5% and the comparable quarter last year by 0.5%.\n\nThe decrease in margins from last year was also due to a combination of reduced sales volumes across nearly all product lines, the impact of inflation on material and labor costs, unfavorable fixed cost absorption due to lower production volume, and unfavorable product liability and inventory valuation adjustments, partially offset by decreased compensation costs. Operating expenses of $26.7 million for our second quarter were $9.9 million lower than the prior-year comparable quarter, primarily due to a $3.1 million reduction in relocation costs, lower sales-related expenses such as co-op advertising and freight, and decreased compensation-related costs driven by temporarily unfilled positions, we believe, as a result of the relocation. Net income of $9.6 million in the second quarter, compared to $50.9 million in the prior-year comparable quarter, reflecting lower net sales and gross margin, slightly offset by reduced operating expenses. However, when compared to the second quarter of fiscal 2020, net income was $9.3 million higher this quarter due to higher ASPs and lower operating and interest expenses.\n\nGAAP earnings per share of $0.21 in the second quarter was down from $1.05 last year but was $0.20 more than we reported in the second quarter of 2020. Non-GAAP earnings per share of $0.26 was down from $1.13 in Q2 fiscal 2022 but $0.24 higher than in fiscal 2020. EBITDA of $25.6 million represent 21.1% of sales. During the quarter, we used $35.3 million of cash from operations and spent $28 million for capital projects, resulting in net free cash used of $63.3 million.\n\nThis was consistent with our expectations given our planned inventory build during the quarter, payment of profit sharing from fiscal 2022, and increased spending on the construction of our new facility in Tennessee. We remain focused on managing the business for long-term profitability, market share performance, and capital return to our stakeholders. To that end, our board has authorized our $0.10 quarterly dividend to be paid to stockholders of record on December 20th, with payment to be made on January 3rd. Looking forward to the third quarter.\n\nNow that we are operating under a more normal seasonal demand model, with distributor inventory at more comfortable levels, our earlier estimate of 20% to 30% unit volume for the third quarter continues to appear reasonable. We expect that margins will continue to be pressured by costs associated with relocation, inflation, and lower volume than in the prior two years. In addition, we've begun to increase promotional activities on select products and expect that to continue through most of the rest of this year, which will likely affect ASPs, margins, and operating costs. And finally, as show season begins in January, both sales and marketing costs are likely to grow beyond our current quarterly run rate.\n\nWe remain committed to our long-term financial targets. And while the low end is still within reach for fiscal '23, recent industry trends have created additional uncertainty as we are also being impacted by the one-time costs related to the construction of the Tennessee facility and equipping it with state-of-the-art machinery. When you combine these one-time costs with the working capital needs of our business to meet cyclical consumer demand and costs associated with preparing for next summer's move, we will likely continue to experience negative free cash flow during our third quarter, even with inventory beginning to decline seasonally. Finally, our effective tax rate is expected to be approximately 24%.\n\nWith that, operator, can we please open the call to questions from our analysts?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Mark Smith of Lake Street. Please go ahead.\n\nMark Smith -- Lake Street Capital Markets -- Analyst\n\nHey, good afternoon. How are you guys?\n\nHey, Mark. How's it going?\n\nGood, good. Hey, I just want to start out just talking big picture on kind of the promotional environment. You know, it seems like it's gained steam kind of around the holidays and Black Friday. It doesn't seem like you guys have followed suit.\n\nIs that correct? And then it sounds like, you know, you're maybe open a little bit more here in the second half to be a little more promotional. But it doesn't sound like you're going to follow what we're seeing from some peers and get overly promotional here in the second half.\n\nYeah, it's a good question, I think. You know, so far, yes. The answer is we haven't -- you know, we haven't participated to the level of some of our competitors. I think we're taking a little bit as we kind of -- as I said in some of the prepared remarks where, you know, we're kind of taking more of a longer-term approach.\n\nWe don't want to erode those ASPs that we've been able to gain over the last couple of years. We do feel like we are in a good position versus the competition and what the brand should be able to command. You know, with all that said, you know, we're -- sorry, and one more thing. We're also going to try and push a little bit more on new product and get a little bit, you know -- rather than being totally reactive and just going straight into promotions.\n\nThere are some things we can do with new product to kind of drive volume and maybe some, you know, bundling with some accessories, etc., some -- you know, a little bit more creative things. All that said, you know, I think we all understand that the economic conditions are what they are, especially for, you know, discretionary items like firearms. So, we're kind of going to have to, you know, play the hand we're dealt as we kind of go forward here. And so, I think, you know, your question of are we going to participate, you know, in a more meaningful way in promotions second half? You know, the answer is probably yes.\n\nOK. And it looks like just as we look near term, and I know you don't and haven't given kind of quarterly guidance, but, you know, given we saw, you know, some handguns, nine millimeters being sold by peers at $200 or so at retail, you know, plus rebates, I would expect you're not expecting any significant volume growth here in the near term as the peers are overly promotional.\n\nYeah, I think Deana kind of gave some comment -- some color to that in her prepared remarks around the, you know, the percentages of unit volume that we expect for the first half versus the second half. And so, you know, I think we're kind of holding to that. I think you can get to where you need to be based on some of the comments that Deana gave on the percentages first half versus the second half on unit volume.\n\nDeana McPherson -- Chief Financial Officer\n\nRight. I mean, generally speaking, Mark, we don't expect Q3 to be terribly different from where Q2 came. You know, the seasonality may change. We'll see how the Christmas season goes and reorders in January.\n\nBut right now, we're not forecasting it to be terribly different than Q2.\n\nMark Smith -- Lake Street Capital Markets -- Analyst\n\nAnd then your Q4, as you know, you've been around a while, so Q4 is usually for us -- our fiscal Q4 is usually kind of -- you know, you get that, you know, pick up in Q4. So, you kind of go back to historical and expect that same kind of pickup we've had historically pre-pandemic.\n\nYeah. And let's just -- I want to walk through just your new product launches and move into more kind of historical norms and kind of timing of shipments. Within your inventory build at the end of the quarter, can you speak to maybe how much of that was new product if you had some new products that were launching kind of, you know, at the end of the quarter?\n\nNot a lot of it. Our new product, just the timing of it, we usually load into the channel prior to the actual consumer launch so that it's available at retail once we start talking about it. So, you'll note that we launched the -- you know, those new products were right at the beginning of November. So, we had really loaded a lot of those in already, and then the middle of November.\n\nSo, they were already starting to ship into the channel. So, a lot of that inventory build was not associated with new products.\n\nOK. And then as you just discussed Q4, the April quarter may be seeing a little bigger build in shipments. Is that primarily due to continued new product launches and getting that product into distributors' and retailers' hands?\n\nYeah. Yes. Our second half will continue. You saw the cadence kind of pick up.\n\nAnd, you know, we almost had kind of one new product launch every month since September and right at the end of October, beginning of September, one at the beginning of October and -- sorry, end of October, beginning of November. And then one just most recently with the Competitor, you know, that we do anticipate to kind of continue a pretty steady cadence, you know, probably not to that level, but, you know, throughout the second half. So, the second half does have a lot of new products included in it.\n\nOK. And I might be digging in a little bit here just into your plans on launches, but a lot of your products that you have launched recently have been at the mid to higher end of maybe ASPs and price points. Should we expect that going forward or is there a chance that you come out with more of your lower-end introductory-type products going forward?\n\nYeah, I think you're you are digging a little bit there, but I'll give you a little bit of color. It's -- you know, as I said earlier, I mean, we're managing the business for the long term, and we do believe that the Smith & Wesson brand and, you know, and our reputation does allow us to kind of, you know, play in that, you know, mid-upper tier. And, you know, so yes, I mean, the new products we're launching -- that the intent with the new products that we're launching is that we, you know, we can command full margin for a brand new product, you know, and we anticipate those products will come in kind of, you know, where our ASPs are sitting today and, you know, shouldn't materially impact them, so hopefully, you know, help us to be able to maintain them. You know, but that said, you know, the new products, the detail of it is you're going to span the spectrum between, you know, kind of our lower end and all the way up into our high-end products.\n\nSo, you know, as much color as I can give you is that they're not really going to materially impact our ASPs.\n\nOK. That one was helpful.\n\nOne way or the other.\n\nOK. The next one, just kind of shifting a little bit. Can you just give any more updates on relocation as far as timing and costs and anything? You know, is it still going according to plan or have we seen anything shift?\n\nNo. Yeah, that's -- appreciate the question. Everything is going very well. And yes, according to plan, on a timing basis.\n\nAs we talked about in previous calls, you know, despite the inflationary impacts and, you know, across the economy, it is a little bit toward the north end of our range of what we expected. But we are still within our contingencies. And, you know, we still anticipate to be able to do it within our budget, although albeit toward the north end. And from a timing perspective, it's going very well.\n\nSo, you know, the building is right on track. And our personnel out there, we're actually -- you know, we've got over 60 employees already working out of the area, mostly front office personnel working out of the Tennessee at a temporary location there. So, you know, that the move from a personnel perspective is going very well as well.\n\nOK. And then another kind of big picture question, just, you know, cash -- the balance sheet has changed a fair amount. We've seen the inventory come up, cash position comes down, still debt free. But just looking at the expectation that you'll still have some negative free cash flow here this next quarter, has anything changed as far as capital allocation or plans of investment?\n\nI'll let Deana get into the detail in a second. But just generally from capital allocation, nothing has changed in terms of our priorities. I think we said right from the get-go, you know, three years ago when we were talking about the spend that our capital allocation priorities would be reinvestment back in our business and then returns excess cash back to stockholders. And that remains the priority.\n\nSo, you know, right now, obviously, we're investing back in our business with the facility in Tennessee, which, you know, continues to be a fairly significant cash drain but was planned and anticipated. And then once we're done with that, you know, we don't see anything major on the horizon in terms of the cash expenses needed for the business and we'll be back into, you know, returning cash to the stockholders.\n\nDeana McPherson -- Chief Financial Officer\n\nYeah, you'll see that our capital spending is higher than it normally is just in the quarter and in the mind for the, you know, the full year. Without that, you know, we would have been, you know, $30 million to $40 million higher in cash. So, we did plan for it. We expect to spend the cash.\n\nYou know, we went into this knowing that that was an excellent use of cash for the long-term viability of the business. And, you know, unfortunately, I mean, I don't get to hold the cash that I want to hold. But once we get back to the opening -- grand opening of the new facility, that should cover everything that we need to do in the short term. And we'll get back to looking at how can we make more investments to our investors.\n\nMark Smith -- Lake Street Capital Markets -- Analyst\n\nOK. And then the last one for me, just big picture again, regulatory environment. We've seen, you know, the first kind of piece of legislation or change here in a long time. Can you just give an update on where you guys stand and any recent legislation nationwide, not state by state, any change that that had on your business?\n\nYeah, we -- as we always kind of answered this question, Mark, we make lawful products and we abide by all the laws and whether it's local, state, or federal. And we will always continue to do that. You know, it's one of the things we pride ourselves on is, you know, compliance with regulations and running an ethical business. And so, you know, that said, you know, the state regulations, we have seen them kind of -- you know, they come and go, ebb and flow.\n\nAnd, you know, there's a lot of -- I guess a lot of noise, if you want to call it, there. You know, the Oregon legislation, you know, obviously is causing a temporary big spike in that area for folks looking to exercise the Second Amendment rights, you know, while they feel they still can. You know, we'll continue to react to those as they come up. In terms of the long-term macro impact to the business, we've just kind of seen -- you know, I mean, you look at some of the states that have the most restrictive laws on the Second Amendment.\n\nYou know, they are some of our top NICS states. So, you know, those consumers are still willing to exercise their rights, even with the restrictive laws. As to the impact to our business, you know, it's fairly minimal.\n\nOK. Great. Thank you, guys.\n\nYup.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line of Rommel Dionisio of Aegis. Please go ahead.\n\nRommel Dionisio -- Aegis Capital -- Analyst\n\nHi. Good afternoon. Thanks for taking my question. You know, you guys launched the M&P 12, the shotgun, about a year ago.\n\nAnd about a year -- now that we're about a year into it, Mark, I wonder if you could just go through your thoughts on the category. You know, have a lot just gone a year into it and, you know, I'm guessing you didn't enter this broad new category with just one model, one SKU, that being a long-term plan. I would just love to hear your thoughts in terms of, you know, how that launch has gone and how you view the category and the response to your product and your plans going forward to the extent that you can disclose those. Thank you.\n\nMark Smith -- President and Chief Executive Officer\n\nSure. Thanks for the question, Rommel. Yeah, the long gun category and the -- and shotguns, in general, you know, yes. You know, it's going to -- there is some opportunity for us, some whitespace for us in the company.\n\nThe M&P 12 that we launched was, you know, really more addressed toward a little bit of a niche in that market, which is bullpup shotguns and is more of a -- one of the higher-end bullpup shotguns. And again, as I said earlier, we believe, you know, definitely commands that, you know, higher-end price due to the, you know, quality and brand reputation that we have. That is, unfortunately, you know, in the recent downturns in one of those categories, the higher end, you know, more tactical specialty shotguns has been one of those categories that's been kind of more hard hit. The shotgun category is still -- we anecdotally hear it's still moving very well, but it's at the low end, you know, a lot of hunting shotguns and, you know, pumps, etc.\n\nSo, you know, long term, as about as much color as I can give you is yes, you know, I mean, it's some whitespace for us and, you know, continues to be an area we look at and evaluate. And, you know -- and as I said earlier, you know, new product development is one of those things, one of those areas that it's a really great lever we feel we can pull to, you know, keep those consumers interested in us and gain more than our fair share of the market as we go forward. So, hopefully, that gives you -- you know, you can read between the lines there and gives you that information you need.\n\nRommel Dionisio -- Aegis Capital -- Analyst\n\nSure. Thanks for the color, Mark.\n\nMark Smith -- President and Chief Executive Officer\n\nYup. Thanks, Rommel.\n\nOperator\n\nThank you. [Operator instructions] And as there are no further questions in queue, I'd like to turn the call back over to Mark Smith for closing remarks. Sir.\n\nMark Smith -- President and Chief Executive Officer\n\nThank you, sir. And I just want to thank everybody for joining us today. We'll talk to you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Maxwell -- General Counsel\n\nMark Smith -- President and Chief Executive Officer\n\nDeana McPherson -- Chief Financial Officer\n\nRommel Dionisio -- Aegis Capital -- Analyst\n\nMore SWBI analysis\n\nAll earnings call transcripts"
}