{
  "companyName": "loanDepot, Inc.",
  "companyTicker": "LDI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/loandepot-inc-ldi-q2-2022-earnings-call-transcript/",
  "content": "loanDepot, Inc. (LDI 1.23%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon and welcome everyone to loanDepot's second quarter 2022 conference call. [Operator instructions] I would now like to turn the call over to Gerhard Erdelji, senior vice president, investor relations. Please go ahead.\n\nGerhard Erdelji -- Senior Vice President of Investor Relations\n\nGood afternoon, everyone, and thank you for joining our call. I'm Gerhard Erdelji, investor relations officer at loanDepot. Today, we will discuss loanDepot second quarter 2022 results. Before we begin, I would like to remind everyone that this conference call may include forward-looking statements regarding the company's operating and financial performance in future periods.\n\nAll statements other than statements of historical fact are statements that could be deemed forward-looking statements, including but not limited to guidance to our pull through weighted rate lock volume, origination volume, pull through weighted gain on sale margin and expenses. These statements are based on the company's current expectations and available information. Actual results for future periods may differ materially from these forward-looking statements due to risks or other factors that are described in the Risk Factors sections of our filings with the SEC. A webcast and a transcript of this call will be posted on the company's investor relations website at investors.loandepot.com under the Events and Presentations tab.\n\nOn today's call we have loanDepot president and chief executive officer, Frank Martell and chief financial officer, Patrick Flanagan to provide an overview of our quarter, as well as our financial and operational results, outlook and to answer your questions. We are also joined by our chief capital markets officer, Jeff DerGurahian and LDI mortgage president, Jeff Walsh to help address any questions you might have after our prepared remarks. With that, I'll turn things over to Frank to get a start. Frank?\n\nFrank Martell -- President and Chief Executive Officer\n\nThank you, Gerhard. Thank you all for joining us on today's call. I look forward to sharing my perspective on market conditions, our results and the company's Vision 2025 plan. Our second quarter results reflect some large call it items, which Pat will elaborate on shortly, as well as the challenging market environment that continued in our industry, which resulted in declines in our mortgage volumes and profit margins.\n\nAs we discussed a few weeks ago during our public announcement of our Vision 2025 plan, like other mortgage companies, we scaled our organization during 2020 and 2021 to meet the demands of unprecedented mortgage volumes, especially refinancing transactions. After two years of record-breaking volumes, the market has contracted sharply and abruptly so far this year. We anticipate market conditions will remain challenging over the short to medium-term, with mortgage originations projected to decline by roughly 50% in 2022 from 2021, including an accelerated decline in the second half of 2022. At this point, we expect to see further declines in volumes in 2023.\n\nDespite this environment and formed by our Vision 2025 plan, we continue to believe loanDepot is positioned for long-term success, built on the support of a strong balance sheet and ample liquidity. Our recently announced Vision 2025 plan is designed to address current and anticipated market conditions, achieve run rate profitability exiting 2022 and position the company for long-term value creation. The four primary strategic pillars of Vision 2025 are, first, raising our focus on purchase transactions, while serving increasingly diverse communities across the country. As the Company pivots to increasingly purpose driven origination -- organization, we expect to increase our focus on addressing persistent gaps and equitable housing, while advancing the goal of growing our share of lending for purchase transactions and maintaining responsible management of credit risk.\n\nSecond, meaningfully progress our previously announced growth generating initiatives including launching a digital HELOC product later this year and continuing to leverage our investment in our servicing business. Third, centralizing management of loan originations and fulfillment, increasing operating leverage and achieving best-in-class quality and service levels. And fourth, aggressively right sizing our cost structure for current and expected mortgage origination volumes. Over the past several months, we have taken aggressive actions to realize the goals outlined in our Vision 2025 program.\n\nWe made substantial progress in a number of critical areas, including, one, pivoting our origination organization toward a unified and purpose driven unit. Second, reducing organizational layers and increasing management spans to create operating efficiencies. Third, centralizing our operations compliant and support efforts. Fourth, cutting third party and facilities related spending and fifth, reducing staffing levels.\n\nIn a few minutes, Pat will provide additional detail on our progress resetting our cost structure. Importantly, I believe the progress we've made over the past several months, clearly supports the achievement of our goal of achieving run rate operating profitability exiting 2022. Earlier, I mentioned pivoting our originations business to a unified and purpose-driven organization. One of the main goals of Vision 2025 is to delight our customers during one of the most important financial transaction of his or her lifetime.\n\nTo meet this goal, we want to provide our superior standard of customer service throughout the home ownership journey from marketing to underwriting and closing, to providing ancillary and complementary products and services to servicing the loan for its duration. Working through third party mortgage brokers makes it more difficult for us to control the customer experience and ads a layer of expense that reduces our profitability. Therefore, as part of the Vision 2025 plan, we have initiated the exit of our wholesale business channel. This will enable us to further reduce expenses, consolidate operations and better meet our goals of becoming a purpose-driven organization, with direct customer engagement throughout the entire lending process.\n\nIn summary, despite challenging market conditions, we remain laser focused on aggressively implementing Vision 2025 and we expect to exit 2022 achieving run rate operating profitability. As we look ahead to 2023 and beyond, I believe loanDepot is well-positioned to succeed through leveraging and expanding our unique lending and servicing solutions, driving first quartile cost productivity and process efficiency and harnessing the collective energy and innovative spirit of the companies dedicated team. With that, I will now turn the call over to Pat Flanagan, who will take you through our financial results in more detail.\n\nPat Flanagan -- Chief Financial Officer\n\nThanks, Frank and good afternoon, everyone. During the second quarter, loan origination volume was $16 billion, a decrease of 26% from the first quarter of 2022. This was within the guidance we issued last quarter of between $13 billion and $18 billion. Volume during that period consisted of $10 billion of purchase loan origination and $6 billion of refinance origination, primarily cash out refinances.\n\nOur strategy to emphasize less interest rate sensitive mortgage products has resulted in an increase in the proportion of purchase transactions from 30% a year ago to 59% in the second quarter, as well as increase in cash out and purchase transactions from 59% to 95% during the same period. Our pull through weighted rate lock volume of $12 billion for the second quarter resulted in quarterly total revenue of $309 million, which represented a 20% -- 39% decrease from the first quarter. Rate lock volume came in at the low end of our guidance we issued last quarter of $12 billion to $22 billion. The decrease in revenue is a result of significant margin compression driven by increasing volatile interest rate and market adjustments as the industry continues to shed capacity.\n\nOur pull through weighted gain on sale margin for the first quarter came in at 150 basis points, which is below the guidance we provided for the second quarter. An increase in provision for repurchase loss reserve also impacted our revenue and gain on sale margin. Our provision for repurchase reserve increased to $82 million during the second quarter from $13 million during the first quarter. The increase was mainly driven by rapidly increasing interest rate, which negatively impacted the fair value of loans subject to repurchase that were originated in prior periods at lower interest rates.\n\nAdjusting for the $69 million increase in the provision for repurchase loss reserve, our pull through weighted gain on sale margin would have been 205 basis points or near the higher end of our guidance for the quarter. Turning now to our servicing portfolio. Customer retention remains one of our primary areas of focus. By controlling the entire customer experience and retaining data in our in-house platform, we improve our operating efficiency by capturing additional revenue opportunities and leveraging our marketing and customer acquisition expenses across multiple products and services.\n\nOur preliminary organic recapture rate remained strong at 72% for the 12 months ended June 30, 2022. The unpaid principal balance of our servicing portfolio increased to $155 billion as of June 30, 2022, compared to $153 billion as of March 31, 2022. This increase was primarily due to net additions to the portfolio, offset somewhat by the sale of $4 billion in unpaid balances during the quarter. As of the end of the second quarter, we serviced 87% of our portfolio in-house, compared to 67% at the end of the first quarter and we're on track to bring all of our agency in Ginnie Mae servicing in-house before the end of the year.\n\nBy leveraging our in-house infrastructure for this highly scalable business, we've reduced our quarterly cost of servicing from 2.4 basis points of unpaid balance in the first quarter to 2 basis points in the second. Reflecting the net growth of the portfolio, servicing fee income increased from $111 million in the first quarter of 2022 to $117 million in the second quarter of 2022. We hedge our servicing portfolio, so we do not record the full impact of the increase in fair value in a rising interest rate environment in the results of our operations. We believe this strategy protects against volatility in our earnings and liquidity, our strategy for hedging the servicing portfolio is dynamic and we adjust our hedge positions in reaction to changing interest rate environments.\n\nDuring our Vision 2025 call in July, we discussed our market outlook for the remainder of 2022. We continue to forecast the market will come in below an annualized $2 trillion, a significant component of this plan is to align our expense base with lower origination volume and create efficiencies we believe will result in improved operating leverage and financial performance over time. Looking ahead to the third quarter and assuming no material changes in the interest rates or the competitive landscape, we expect both pull through weighted rate lock volume and origination volume between $6.5 billion and $11.5 billion, reflecting the current interest rate environment weighing on demand. We expect third quarter pull through weighted gain on sale margin to increase from the second quarter margin to between 175 and 225 basis points, reflecting ongoing competitive pressures.\n\nOur total expenses for the second quarter of 2022 decreased by $88 million or 8% from the prior quarter, driven primarily by lower personnel expenses, including both salaries and volume-based commissions and lower marketing expenses. The second quarter included charges of $41 million for goodwill impairment, $6 million of real estate and other intangible asset impairment, $4 million of severance benefits and $3 million of consulting and other professional expenses related to Vision 2025. Net of these items and the $69.2 million increase in the provision of purchase loss reserves, our adjusted second quarter pre-tax loss would have been $130 million. We continue to aggressively reduce our cost structure to return to run rate profitability by the end of 2022.\n\nWe reduced our headcount from approximately 11,300 at year-end 2021 to approximately 8500 at the end of the second quarter and expect to end the third quarter with our headcount below our previously stated year-end goal of 6500. We plan to achieve our cost reduction goal by further reducing management stance, consolidating redundant operational functions, reducing marketing expenditures, real estate cost and other third-party charges. We also continue to evaluate all aspects of our business for potential additional expense reduction as the market continues to evolve. As a reminder, we expect to recognize additional charges during the second half of 2022 as part of our Vision 2025 Plan including severance and benefits related charges, currently anticipated between approximately $25 million and $28 million, charges related to the exit of real estate now approximately $6 million to $8 million and approximately $7 million to $9 million of outside service costs.\n\nApproximately 75% of these expenses will be recognized in the third quarter with the remainder expected in the fourth quarter of the year. The plan is being executed against the backdrop of a strong balance sheet with $1.2 billion of tangible equity, ample liquidity with over $950 million of unrestricted cash and equivalents and what we believe our excellent relationships and the support of our financing partners, the agencies, and other investors. With that, we're ready to turn it back to the operator for questions and answers. Operator?\n\nOperator\n\n[Operator instructions] Our first question will come from the line of James Faucette with Morgan Stanley. Please go ahead.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nThanks. This is Sandy [Inaudible] on for James. Exiting the wholesale channel and in mindful of your outlook just on gain on sale margins, how are you thinking about the cadence, you only provide quarterly guidance here, but the cadence of GOS margins over the coming quarters and will exiting that channel provide some support or upward pressure, really how are you thinking about that?\n\nFrank Martell -- President and Chief Executive Officer\n\nSo, we think, net of the adjustments for the provision increases as we mentioned, margins are expected to be higher in the third quarter within the range that we talked about and exiting the wholesale business actually provide some upward lift to margins.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGot it. Thank you. And then just one follow-up, you walked to the cost structure. Any areas where you're leaning in or maintaining investments that you'd like to call out? I'm thinking technology and a few other things, anything to flag there?\n\nFrank Martell -- President and Chief Executive Officer\n\nNo, I think really if you look at the $375 million to $400 million full-year run rate cost savings, about 65% of those are going to be in the people area, with the balance being a blend of other third-party and infrastructure related as well. There will be some investments that we will make that will offset some of that reduction primarily around our customer-facing organization, some of our tools, our quality systems as well. So there'll be a few offsets, but in general it breaks down roughly two-thirds staffing and one-third other.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGot it. Thank you, guys.\n\nOperator\n\nYour next question will come from the line of Doug Harter with Credit Suisse. Please go ahead.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nThanks. Just on your commentary that you expect to be breakeven by the end of this year, what are you expecting on the revenue side there, how much contribution from home equity are you expecting or is it mainly on the cost side, that gets you back to breakeven?\n\nFrank Martell -- President and Chief Executive Officer\n\nYeah, I think that the primary focus is adjusting our cost structure to the market forecast that both Pat and I talked about. I think HELOC is a very modest because we're launching it later in the year, is a very modest contributor really, really de minimis frankly.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nAnd then just to make sure I understand the volume guidance in the context of exiting wholesale, I guess when do you expect to kind of stop funding volumes and how much of kind of the 3Q volume guide is from wholesale?\n\nPat Flanagan -- Chief Financial Officer\n\nHi. The plan is to fund out the remaining wholesale pipeline, which is approximately $1 billion and have the entire pipeline wrapped up by the end of October of this year.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nGot it. Makes sense. Thank you.\n\nOperator\n\nYour next question will come from the line of Trevor Cranston with JMP Securities. Please go ahead.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nHey, thanks. Follow-up on the question about the plan to exit 2022 being profitable. Can you comment on what kind of baked into that projection in terms of where you need to see volume and gain on sale levels, is it kind of steady from what you're expecting in the third quarter, is there any improvement at all baked into the expectation to get back to profitability?\n\nFrank Martell -- President and Chief Executive Officer\n\nYeah, I think broadly speaking, of course, we're looking at in-market that looks more like in the low $2 trillions for the year, so that implies a slow down through the second half of the year. And then as I mentioned in my prepared remarks, we're looking at a decline into 2023. So I think it's important to recognize that our plans incorporate a run rate that will allow us to overcome that, expect a downdraft as well. I think if you look at '23, we're kind of thinking in line with most of the other externally available MBA, it's a forecast that are out there.\n\nWe saw a bit more conservative applied conservatism applied on our part.\n\nPat Flanagan -- Chief Financial Officer\n\nAs far as and as far as again on sale margins, the plan that we've been talking about the Vision 2025 plan ending the year with run rate profitability assumes that the fourth quarter gain on sale margins should be relatively consistent with the guidance we provided for Q3.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nOK, got it. And then you mentioned the impact of higher rates on the repurchase provision in the second quarter. I guess when you -- when we look at how rates have moved so far in the third quarter if they were to stay relatively steady from here, would it be reasonable to expect some of that provision to come back in 3Q just based on our rates of move?\n\nFrank Martell -- President and Chief Executive Officer\n\nWell, it's -- we think that the provision levels are accurate for what we see in the future. We think that over time, as rates continue to rise at a slower pace or remain stable that that gap will come back and the provision will look similar to historic levels. So this was an anomaly around the differential between the rate when the loans are originated and the rate that we at market rates when we repurchase. It's also reflective of dislocation and the private labeled market from credit spread perspective as well.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nSure. That makes sense. OK, thank you.\n\nOperator\n\nYour next question will come from the line of Kevin Barker with Piper Sandler. Please go ahead.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nThank you for taking my questions. So how much of opex or operating -- I'm sorry, operating expenses will decline from the exit in the broker channel? And is this fully embedded in your guidance for $375 million to $400 million of expenses?\n\nFrank Martell -- President and Chief Executive Officer\n\nYeah, Kevin, it's included as part of the overall run rate reductions in the $375 million to $400 million.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. And then how much is coming from -- directly from the exit of broker channel, are you able to provide that? Or --\n\nFrank Martell -- President and Chief Executive Officer\n\nNo, we don't provide that level of specificity.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. And then in regards to the expenses, how much is already embedded within the second quarter operating expenses, excluding the goodwill impairment?\n\nFrank Martell -- President and Chief Executive Officer\n\nCan you please say embedded, can you just define what that you're talking about there, just be clear?\n\nKevin Barker -- Piper Sandler -- Analyst\n\nHow much of the $375 million to $400 million of expense saves that you laid out has already been achieved as of the second quarter with the $520 million of operating expenses that you reported, excluding the $41 million of goodwill impairment.\n\nFrank Martell -- President and Chief Executive Officer\n\nSo in terms of the $375 million to $400 million of expense reduction, so that's really not -- I think goodwill is not in that number, just to be clear. So we've identified substantially all of that and have action plans against all of that. There's still a bit to solve for, but essentially I'd say that we're very close to identifying the entire target and actually have action plans, a lot of a substantial amount, well over half of that's actually been actioned or is in the process of being actioned as of today.\n\nPat Flanagan -- Chief Financial Officer\n\nA significant portion will be realized in Q3, a significant amount of headcount reductions were July and August and there's a couple of months of severance expense at trails as a result of those terminations.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. So when we think about the move in operating expenses from $606 million in the first quarter, the $520 million in the second quarter, how much of that is due to the expense saving as you put in place versus production declines, is another way to look at it, like how much more do we -- should we expect?\n\nPat Flanagan -- Chief Financial Officer\n\nWe had headcount declines of -- was about 25% reduction in the quarter. We had a 40% reduction in the quarter -- quarter over quarter for marketing expense, 15% was personnel related and then 8% was volume-based commission plan. So there was adjusted expenses were 17% lower quarter over quarter. So it's -- we didn't break it out that way because we were projecting the volume decline into the model, so I don't have it sort of segregated against Vision 2025 and volume decline.\n\nIt was all intermingled into getting to the appropriate level of expenses.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. Thank you again for taking my questions.\n\nOperator\n\nYour next question will come from the line of Stephen Sheldon with William Blair. Please go ahead.\n\nPat Mcilwee -- William Blair -- Analyst\n\nHey, team. This is Pat Mcilwee on for Stephen today. So my first one, what top of funnel trends have you been seeing as mortgage rates have pulled back a little bit in recent weeks? Just curious, are you seeing any more organic traffic at all as that's happened?\n\nFrank Martell -- President and Chief Executive Officer\n\nNot to a material degree.\n\nPat Mcilwee -- William Blair -- Analyst\n\nOK. And then how do you think about your ability to gain market share in this declining originations market? Or is this really more about positioning yourself to stabilize the cost structure and then gain market share once volumes really do stabilize?\n\nPat Flanagan -- Chief Financial Officer\n\nYeah, we're not going to chase market share. So we are very focused on pivoting to a purpose-driven, affordable lending, underserved lending model. It's going to take some time for us to get there. We're very laser-focused on cash flow profitability.\n\nCertainly, we have areas that we think we're strong in from a market position standpoint. But in terms of, in general, trying to drive share in this environment is not something we're trying to do. So it's much more of a focus on trying to get the -- toward a model whereby we are intimate with our customers throughout the life cycle of their transactions. So you're going to see a lot more focus on our talk rack around that kind of mantra.\n\nBut we're not chasing share in volume at the expense of liquidity and profitability and strategy, frankly.\n\nPat Mcilwee -- William Blair -- Analyst\n\nOK. That's helpful. Thank you.\n\nOperator\n\nYour next question will come from the line of Mark DeVries with Barclays. Please go ahead.\n\nMark DeVries -- Barclays -- Analyst\n\nYeah, couple of questions about the exit of wholesale. One is just a point of clarification, are you just getting out of the broker business or are you also exiting the work with the JVs?\n\nFrank Martell -- President and Chief Executive Officer\n\nNo, this is simply related to wholesale and non-delegated correspondent business channel. And in the partnership channel, we'd always separate it those to entities, joint venture still being a big part of our focus with new builder and affordable housing and such and wholesale and non-delegated correspondent is what is being wound up currently.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. And Frank, could you just talk a little bit more about the decision to exit as opposed to just attempt to take out some of the cost and try and continue to run those businesses?\n\nFrank Martell -- President and Chief Executive Officer\n\nYeah, look, I think we want to stand for something. So when we talk about purchase driven, I think the demographic shifts in housing and mortgage are such that we think the future is around serving a broader contingency, particularly the diversity of the millennial and the subsequent generations there. So -- and that implies a lot of investment in certain areas over time to be able to do that. So we're definitely looking at the demographics in the long-term view and trying to make sure that we service those markets and have the solutions to service those markets and delight the customers.\n\nMy view is some of this -- we've had four go-to-market channels. We want to go to one kind of -- and frankly, we've operate those in somewhat separate ways to some degree. So we're trying to go to a unified back office where we have unified operational group and the support around that. And then really free up the team to look at the market holistically and serve the end markets that we want to serve, which is that purpose-driven lending.\n\nIt's going to take us a little bit of time to get there, but I think the exit of wholesale like I talked about, is really around trying to get more intimate with the customer set and not go through intermediaries, not that we wouldn't do some of that if it serve the strategy, but and certainly we're simplifying our organization in the process.\n\nMark DeVries -- Barclays -- Analyst\n\nGot it. Makes sense. And then just one question about the guidance for 3Q, pretty wide range on the two origination ranges. What kind of gets you to the high end and what scenario gets you to the low end of those ranges?\n\nPat Flanagan -- Chief Financial Officer\n\nI think we -- they're same dollar ranges we've previously given. We understand the context is wider because of just the shrinking market. So I think it really is dependent on market conditions in the near-term. So it is -- it's a very fast-moving market.\n\nPart of that range is how well our JVs do in completing inventory by year-end. And so the volatility is what makes us need to give a wide range.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. Got it. Thank you.\n\nOperator\n\nOur next question will come from the line of Kevin Barker with Piper Sandler. Please go ahead.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nHey, thanks. I just wanted to clarify and follow up some of the questions about the gain on sale margin in this quarter, given the decline. You broke up a little bit on the call, so I just wanted to clarify some of those. Was this related specifically to repurchase liability? Or was it due to loans and pipeline that were unable to be sold or the market moves quickly against you? How should we think about like the decline in gains on margin in the second quarter?\n\nPat Flanagan -- Chief Financial Officer\n\nYeah, it's almost entirely in repurchase activity and the market price differential from the increase in interest rates.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. So --\n\nFrank Martell -- President and Chief Executive Officer\n\nNot so a lot really.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. And so the repurchase liability, is that related to the -- your pipeline from the second quarter? Or is this loans over a long period of time that is related to?\n\nFrank Martell -- President and Chief Executive Officer\n\nThe loans that were sold home loan over the last 12 months that come back for record warrant violations or performance-related issues. And there were -- it was 3% loans repurchased in a 6% world, right? You have a differential of almost 300 basis points. And on top of that, new yield requirements by purchasers of these types of loans.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. All right. Thank you for taking my questions. Appreciate it.\n\nOperator\n\nOur next question will come from the line of Kyle Joseph with Jefferies. Please go ahead.\n\nKyle Joseph -- Jefferies -- Analyst\n\nHey, good afternoon, thanks for taking my questions and sorry to cover this, hopped on a little late. But just one follow-up would be on your 3Q guidance and kind of the intermediate term outlook going into the fourth quarter in terms of breakeven. Can you give us a sense for the cadence and magnitude of MSR sales?\n\nPat Flanagan -- Chief Financial Officer\n\nSo we are trying to accelerate the cost-cutting and expense savings into the third quarter to -- so we can preserve most of the balance sheet and have to sell less MSRs to cover operating losses. We did complete a $18.6 billion MSR sale in July. That was in the 6/30, the June 30 quarter end marks reflected the value of that MSR sale. So the market was still robust in the second quarter, so we can rely on MSR sales that we have to.\n\nBut our focus is to shrink operating losses and eliminate the cash burn from operating losses as quickly as possible. And then we'll continue to adjust the mix of both the amount of servicing we sell at the time of origination and couple that with any other bulk sales should we need to, to bolster liquidity. But the goal is to try to minimize the amount of MSR sales going forward.\n\nKyle Joseph -- Jefferies -- Analyst\n\nGot it, very helpful. Thanks for taking my question.\n\nOperator\n\nI will now turn the conference back over to management for any closing remarks.\n\nFrank Martell -- President and Chief Executive Officer\n\nOK. Thank you, Regina. Look, thanks, everybody again for joining us and for some very good questions, we appreciate that. I just want to close by reiterating our Vision 2025 plan is having its intended effect.\n\nWe have -- we've made a tremendous amount of progress both structurally and from an operational point of view. And I think those are the actions needed to achieve our targeted $375 million to $400 million annualized expense savings target going into 2023. And I think we're on our way to achieving that and to hit run rate profitability exiting this year, which has been the goal. As Pat mentioned, we have strong liquidity and we want to preserve that.\n\nAnd so we want to do that without selling MSRs if possible, so that is definitely the goal and we're making progress there. We do have an eye on the lower volume scenario anticipated for '23 and making sure that's incorporated in our planning. So we do have one eye on '23 as well. I think importantly, looking forward from a business point of view, I think I'm excited about our strategic pivot to a purchase -- a purpose-driven organization.\n\nWe have a number of new digital solutions that we think, including the HELOC solution, which we think will be innovative and differentiate the company in the marketplace. And I think importantly, we also have a best-in-class servicing operation, which we think we can leverage for growth as well. So those are good growth aspects, it's not just cost cutting, but there is growth entailed in our plan. And look on behalf of Pat and the rest of the team, I want to thank everybody and we look forward to continue to keep you all apprised on our drive to enhance both short-term and long-term shareholder value.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGerhard Erdelji -- Senior Vice President of Investor Relations\n\nFrank Martell -- President and Chief Executive Officer\n\nPat Flanagan -- Chief Financial Officer\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nDoug Harter -- Credit Suisse -- Analyst\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nKevin Barker -- Piper Sandler -- Analyst\n\nPat Mcilwee -- William Blair -- Analyst\n\nMark DeVries -- Barclays -- Analyst\n\nKyle Joseph -- Jefferies -- Analyst\n\nMore LDI analysis\n\nAll earnings call transcripts"
}