{
  "companyName": "Kroger",
  "companyTicker": "KR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/kroger-kr-q3-2022-earnings-call-transcript/",
  "content": "Kroger (KR -0.09%)\nQ3 2022 Earnings Call\nDec 01, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Kroger Co. third quarter 2022 earnings conference call. My name is Nadia, and I'll be coordinating the call today. [Operator instructions] Please note, this event is being recorded.\n\nI would now like to turn the conference over to Rob Quast, senior director, investor relations. Please go ahead.\n\nRob Quast -- Director, Investor Relations\n\nGood morning. Thank you for joining us for Kroger's third quarter 2022 earnings call. I am joined today by Kroger's chairman and chief executive officer, Rodney McMullen; and chief financial officer, Gary Millerchip. Before we begin, I want to remind you that today's discussions will include forward-looking statements.\n\nWe want to caution you that such statements are predictions, and actual events or results can differ materially. A detailed discussion of the many factors that we believe may have a material effect on our business on an ongoing basis is contained in our SEC filings. The Kroger Company assumes no obligation to update that information. After our prepared remarks, we look forward to taking your questions.\n\nIn order to cover a broad range of topics from as many of you as we can, we ask that you please limit yourself to one question and one follow-up question, if necessary. I will now turn the call over to Rodney.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThank you, Rob. Good morning, everyone, and thank you for joining us today. We're pleased to announce another quarter of strong results. powered by our strategy of leading with fresh and accelerating with digital.\n\nOur associates continue to create a seamless customer experience, delivering fresh and affordable food anytime, anywhere with zero compromise on quality, selection or convenience. Our associates' incredible dedication means we have momentum entering the fourth quarter and we are continuing to consistently deliver a full fresh and friendly experience for our customers throughout the busy holiday season. It is clear that inflation remains top of mind for our customers and for our company. We are laser focused on helping our customers by providing fresh and affordable food.\n\nResearch shows cooking at home is still three to four times less expensive than dining out. And we are seeing more customers engage with Our Brands as a way to stretch their food budgets without compromising on quality. During the quarter, we continue to see many of the same shopping trends we observed throughout the year. In addition to higher engagement with Our Brands products, Customers are downloading and redeeming digital coupons and continuing to showcase their cooking at home skills learned during the pandemic.\n\nOur breadth of choices, quality of fresh products and the value of our personalized promotions are helping customers navigate the current environment, and our customer-focused approach is working. We continue to see overall household growth and significant loyal household growth, which drives a meaningful portion of our sales volume. We are proud to serve as America's grocer, especially during the holiday season. As friends and family come together, we look forward to providing our customers the perfect ingredients to create cherished memories.\n\nAt a time when 48% of customers have told us they plan to cut back on their Thanksgiving celebration due to inflation. We took action and made sure our Thanksgiving was enjoyable and memorable for everyone. To do that, we introduced an easy guide for customers to build an affordable meal of our brand's products with all of Thanksgiving favorites that a family could enjoy for as little as $5 a person. This is just one example of how we create amazing quality at a great price when it matters most to our customers.\n\nWe empower our customers to create lasting food memories by consistently executing against our go-to-market strategy, focused on Fresh, Our Brands, personalization and our seamless ecosystem. Fresh remains important in today's environment, and we are committed to bringing the freshest products to our customers' tables. Our Fresh for Everyone strategy is grounded in keeping products fresher, longer. Our end-to-end Fresh initiative is transforming these efforts.\n\nAt the end of quarter three, we have a total of 1,252 certified stores. At these locations, we see higher fresh sales and identical store sales. With these impressive results, we continue to roll out the initiative nationwide. As part of our end-to-end fresh initiative is our supply chain, where we continue to invest and enhance operations.\n\nWe are improving productivity and maximizing our fleet by controlling more product movement across our network. Most importantly, we are using our data and science to maximize freshness for our customers. Beyond our end-to-end Fresh program, we are bringing more fresh products to our customers. During the quarter, Home Chef launched new plant-based ready-to-cook meals.\n\nThey also collaborated with Kroger's in-house dieticians to launch our new simple and nutritious healthy meal kits. Home Chef continues to be an exceptional example of how Kroger's history of mergers help bring new and exciting capabilities to meet our customers' changing needs across the country. Turning to Our Brands. We delivered another strong quarter in Our Brands with identical sales growth that outpaced overall identical sales.\n\nThis was led by our by our Kroger and Private Selection brands. Customers continue to engage with the Our Brands portfolio, which offers high-quality products at affordable prices. Our brand products are loved by every member of the family, including the pets. This quarter, we saw tremendous growth in our pet food brands as families continue to treat their dogs and cats.\n\nAs you know, they're like a member of the family. We continue to expand and diversify Our Brands portfolio at every price point. After launching Smart Way as our opening price point brand last quarter. We introduced several new Smart Way products this quarter and plan to roll out additional products next quarter.\n\nThese products are meeting the needs of our customers on a budget, and we've already seen 2 million households to purchase Smart Way products. In regard to personalization, our customers are looking for opportunities to save on the products they love. Our loyalty programs and personalized promotions allow them to do just that. We continue to use our leading data science capabilities to develop unique customer insights and offer targeted promotions on the products we know they love.\n\nThis strategy is driving digital engagement with digital coupon downloads, 32% higher than last year. We anticipate these interactions will continue through the holidays with customers expected to realize more than $200 million in savings from our highly personalized digital offers. Moving on to Seamless. We're improving our Seamless experience that brings our customers fresh products anytime, anywhere with zero compromise on quality, selection or convenience.\n\nWe saw back-to-back quarters of strong digital growth led by our delivery solutions. This quarter, we introduced app enhancements that make it easier for customers to engage with our savings and promotion. We launched our first in-app flash sales and enabled our customers to clip digital offers directly from their cart. Improving the customer experience is always top of mind for us, and Kroger Pickup now offers three-hour pickup lead times at all stores in our network, with as little as one hour lead time in some areas.\n\nWe're investing in digital growth initiatives, including expanding our Kroger delivery network in new and existing geographies. We are also growing Boost, our one-of-the-kind membership program. This is the industry's most affordable membership program, and it is foundational to growing our delivery service. We are incredibly pleased with our customer response to Boost as we rolled out the program nationwide earlier this year.\n\nWe continue to invest in our associates as part of our long-term strategy. In addition to investing in average hourly rates this quarter, we enhanced the benefits available to our associates. We expanded the eligibility for our 401k plan participants to encourage earlier commitments to lifelong savings, and we took steps to continue supporting working parents by increasing family lead time and our company-sponsored benefit plans. We are excited to celebrate amazing associates this quarter, who were recognized for their outstanding work and commitment to our customers.\n\nWe were the most recognized employer for Progressive Grocer's GenNext honorees, with 28 of our young leaders recognized for driving change and innovation, both within the organizations and communities they serve. Additionally, our KEPASA Hispanic and Latino Associate Resource Group was honored by the U.S. Hispanic Chamber of Commerce as the Employee Resource Group of the Year. In summary, we are building momentum as we close out the year.\n\nWe are excited to surprise and delight our customers this holiday season with high-quality fresh products at affordable prices. allowing customers to serve on the items that matter most. And with that, I'll turn it over to Gary to cover our financial results. Gary?\n\nGary Millerchip -- Chief Financial Officer\n\nThanks, Rodney, and good morning, everyone. Kroger's relentless focus on delivering value for our customers was the foundation of our strong results in quarter three. As Rodney mentioned earlier, our consistent execution of our go-to-market strategy is resonating the shoppers and driving increased customer loyalty. We were especially pleased with the balance achieved in our results this quarter as we continue to invest in our customers and associates, while also effectively managing costs to achieve solid earnings growth.\n\nThese results provide yet another proof point of the strength of our value creation model and our ability to operate successfully in different environments. I'll now provide additional color on our third quarter results. Adjusted EPS was $0.88 for the quarter, an increase of 13% compared to the same quarter last year. This growth was driven by top line revenue and our disciplined approach to balancing investments with effective cost management.\n\nIdentical sales without fuel grew 6.9%. Our Brands continue to resonate deeply with customers as sales grew 10.4%. The outstanding quality and value offered by these exclusive to Kroger products is an important differentiator in our go-to-market strategy, and this is especially true during periods of high inflation. As we shared at our investor day in March, Our Brands products are margin accretive and represent a key pillar in our strategy to grow profitability while also delivering greater value for customers.\n\nDigital sales grew 10% during the quarter with delivery solutions leading the way, up 34% year over year. Delivery solutions includes the Kroger delivery network powered by Ocado delivery from our stores via Kroger and third-party platforms and our convenience offering, Kroger Delivery Now. Our industry-leading Net Promoter Scores in Kroger Delivery are driving new customer engagement and best-in-class retention rates. Gross margin was 21.4% of sales for the quarter.\n\nThe FIFO gross margin rate, excluding fuel, decreased 5 basis points compared to the same period last year. This result reflected our team's ability to effectively manage higher product cost inflation and shrink through strong sourcing practices while also helping customers manage their budgets and keeping prices competitive. During the quarter, we recorded a LIFO charge of $152 million compared to $93 million in the prior year. This was primarily driven by higher product cost inflation in grocery.\n\nWe still expect to see some moderation in inflation during our fourth quarter as we cycle higher inflation from a year ago. Kroger's operating general and administrative rates decreased 3 basis points, excluding fuel and adjustment items compared to the same period last year. The decrease in OG&A rate was driven by sales leverage and execution of cost-saving initiatives, partially offset by investments in our associates. We continue to identify opportunities to remove cost from our business without affecting the customer experience and are on track to deliver our fifth consecutive year of $1 billion in cost savings.\n\nKroger Health had another successful quarter, delivering higher-than-expected sales and profitability despite cycling the impact of higher COVID vaccine revenue from a year ago. We continue to see significant growth opportunities in healthcare, and our Kroger Health team remains committed to ensuring our customers obtain medically necessary prescriptions. Recently, we announced that we are terminating our Express Scripts agreement for commercial customers as of December 31. The Express Scripts contract would have required Kroger to fill our customers' prescriptions below our cost of operation, something we could not accept as we aim to keep our prices low for customers during this inflationary period.\n\nWe expect this contract termination will reduce sales by about $100 million in Kroger's fiscal fourth quarter, impacting identical sales without fuel for the quarter by approximately 35 basis points. This decision is not expected to have an impact on operating profit or EPS. Included in our results for the quarter is an $85 million pre-tax charge related to the settlement of all opioid litigation claims with the State of New Mexico. This amount was excluded from our adjusted FIFO operating profit and adjusted EPS results to reflect the unique and nonrecurring nature of the charge.\n\nThis settlement is not an admission of wrongdoing or liability by Kroger, and we will continue to vigorously defend against other claims and lawsuits related to opioids. This settlement is based on a unique set of circumstances and facts related to New Mexico, and Kroger does not believe that the settlement amount or any other terms of our agreement with New Mexico can or should be extrapolated to any other opioid-related cases pending against Kroger. It is our view that this settlement is not a reliable proxy for the outcome of any other cases or the overall level of Kroger's exposure. Currently, Kroger has two active matters pending in West Virginia and Texas scheduled for trial in 2023 and 2024, respectively.\n\nKroger continues to believe that the claims are without merit, and that it has strong defenses to these claims. Kroger is also differently situated from many of the other defendants in these cases. Our pharmacy operations have a much smaller footprint, both in terms of the size of the business, and market share with respect to opioids, and we are proud of the outstanding work performed by our associates in delivering critical care and services to our pharmacy customers. Turning now to alternative profit businesses, which are a fast-growing and key part of our value creation model.\n\nThe traffic and data generated by our supermarket business continues to create a flywheel effect for alternative profits and growth this quarter was again led by retail media. CPG brands are finding significant value in our unique ability to build custom audiences that draw on our data to deliver precisely measured return on investment. Last month, KPM added a new channel to its suite of retail media solutions, welcoming Snapchat into the portfolio. Advertisers are now able to use Kroger's proprietary capabilities to optimize Snapchat's immersive ad formats.\n\nWe are constantly innovating to expand our reach, and KPM recently increased its programmatic advertising marketplace capabilities to include video and one of the fastest-growing digital media sectors, connected TV. These new frontiers will provide exciting future growth opportunities for KPN. Fuel is an important part of our overall value proposition, and our fuel rewards program remains a key differentiator to help customers stretch their dollars during a period of high inflation. Fuel rewards engagement remained high during the third quarter and led to gallon sales, which outpaced the market.\n\nThe average retail fuel price was $3.84 this quarter, versus $3.24 in the same quarter last year. And our cents per gallon fuel margin was $0.50 compared to $0.42 in the same quarter in 2021. The results we reported today would not have been possible without our incredible associates who continue to do an outstanding job executing our strategy and delivering a full, fresh and friendly experience for our customers. We have a long track record of investing in our associates and are committed to continuing these investments to ensure Kroger remains an employer of choice.\n\nBuilding on $1.2 billion of incremental investments since 2018 and we have raised our average hourly rates by over 5% so far in 2022. During the third quarter, we ratified new labor agreements with the UFCW for associates in Columbus, Las Vegas, Chicago, Fort Wayne and pharmacists in Southern California, covering more than 28,000 associates. During the fourth quarter, we have also ratified new labor agreements for associates in Toledo and Nashville, as well as the teams is master agreement. Turning now to cash flow and liquidity.\n\nDuring the quarter, cash flow was affected by increased inventory balances. This was predominantly due to higher product cost inflation, particularly in grocery, in stocks improving to pre-pandemic levels and forward buying of inventory in pharmacy. We are comfortable that our current level and mix of inventory is appropriate to support our future sales expectations and would expect to see an improvement in working capital during the fourth quarter. Regarding capital expenditures, we are committed to investing in the business to support our go-to-market strategy and continue to see many opportunities to drive future growth.\n\nAs shared last quarter, various initiatives have been delayed due to supply constraints, and we now expect capital expenditures to be in the range of $3.2 billion to $3.4 billion in 2022. The net effect of higher inventory and lower capital expenditures for the year is that we continue to expect to generate free cash flow of $2.3 billion to $2.5 billion in 2022. In closing, I'd like to share additional color on our outlook for the remainder of the year. The Kroger team's consistent execution of our go-to-market strategy continues to build momentum in our business and gives us the confidence to again raise our full year guidance.\n\nWe now expect full year identical sales without fuel of 5.1% to 5.3%, adjusted FIFO operating profit of $4.8 billion to $4.9 billion and adjusted net earnings per diluted share of $4.05 to $4.15, representing growth of 10% to 13% over 2021. This guidance assumes a LIFO charge of approximately $500 million for the full year, which represents a $300 million headwind over the 2021 LIFO charge. Our third quarter and year-to-date results highlight the strength of Kroger's value creation model, which has proven to be resilient in different operating environments. Looking ahead, we remain confident in our ability to deliver attractive and sustainable total shareholder returns, and we look forward to sharing detailed 2023 guidance during our fourth quarter earnings call in March.\n\nAnd now I'll turn it back to Rodney.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Gary. The results we've shared with you today are a testament to our business model strength and agility to support our customers in all economic environments. This is made possible because of the hard work and dedication of our incredible associates. Before we open the floor to your questions, let me provide a brief update on our pending merger with Albertsons.\n\nAs you may know, I had the opportunity and Vivek did as well to testify before the Senate Judiciary Subcommittee on antitrust, competition policy and consumer rights this week. I shared with the senators that our merger will lower prices for customers starting day one, continued investments in our associates and stores and customer experience and do even more in our communities than either company can do alone. We believe this merger will allow us to fulfill these commitments to our customers, our associates and our communities well into the future. We are making early progress on our integration planning as expected and we continue to engage with all of our stakeholders and regulators.\n\nWe are advancing our road map to close the transaction in early 2024. We look forward to working with the regulators as they review the transaction and do not have a substantial update at this time. We would ask that you focus your questions on our quarterly performance and our progress on our strategy. With that, Gary and I look forward to taking your questions.\n\nOperator\n\n[Operator instructions] And our first question today goes to Michael Montani of Evercore ISI. Michael, please go ahead. Your line is open.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nGreat. Thank you for taking the question. Just wanted to follow up on two fronts. One was into the fourth quarter guide, it appears that ID sales could be up around 4%.\n\nI just wanted to understand the deceleration there. Was that predominantly inflation and/or the Express Scripts? Or is there anything else to note? Can you share any start to the quarter information? And then, I had a follow-up.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. I'll start and let Gary finish it. Part of it is just cycling inflation from a year ago. We are beginning to now cycle the higher inflation a year ago.\n\nGary, with that, I'll let you get into a little bit more asset specific.\n\nGary Millerchip -- Chief Financial Officer\n\nThanks, Rodney. And maybe just to confirm, so the trend in the early part of the fourth quarter has continued consistent with how we're performing in the fourth quarter -- I'm sorry, is continued consistent with outperformance in the third quarter. Michael, as to one part of your question there. I think the other piece is, Michael, yes, I think you captured them well is, as Rodney mentioned, we do believe this recycle higher inflation in the final quarter of 2021.\n\nWe expect that to have some impact on the overall year-over-year growth in food at home during the fourth quarter. And obviously, we'll all see how that plays out. And then secondly, we have factored in the impact of the Express Scripts contract termination as well for January. So overall, I think if you kind of take our full year guidance, we'd be guiding between 4% and 5% IDs for the final quarter of the year.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nGot it. And then, just a follow-up on the margin implications. It looks like those could be flat to down slightly in the fourth quarter. So I just want to understand how do you see the competitive environment evolving? And then, any cost initiatives that you could share with us there?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nRelative to the competitive environment, we continue to see it pretty similar to how it's been throughout the year. all retailers are doing everything they can to minimize the impact on inflation to customers the best you can do. And we obviously would use our personalized and promotions that are directly focused on individual households because of things we know they love to try to help people stretch their budget. We're also, as I mentioned in the prepared remarks, seeing customers continuing to move to Our Brands.\n\nAnd in the past, what we find is when customers move to Our Brands, that's very, very sticky because the high quality of the product and the satisfaction there. So what we find is even when things are getting normalized, Our Brands come out of that at a higher penetration level than going in, which is long term good for our business as well. With that, Gary, I'll let you get into.\n\nGary Millerchip -- Chief Financial Officer\n\nYes. Thanks, Rodney. Just a couple of bits of extra color, Michael, on the fourth quarter for you. As you probably gathered from the guidance, it would be a lowest quarter for year-over-year growth in what we shared for EPS.\n\nI think a few things to bear in mind there. First of all, we'll be cycling the strongest quarter from last year. Last year's EPS growth in Q4 '21 was the highest growth that we had during the year. So we're cycling higher growth from prior year.\n\nWe'd assume fuel margins will be flat during the fourth quarter. So no real headwind or tailwind there, where, as you know, fuel has been a tailwind for us in the last couple of quarters. And of course, as I mentioned in my prepared remarks, year over year, LIFO will be around $100 million headwind in the fourth quarter of EPS because you may recall again that LIFO was only $20 million last fourth quarter. when we finalize the calculations.\n\nSo there would be factors to bear in mind when you think about our EPS guidance. The only other thing I might mention is that you've heard me talk about on this call in previous quarters that when you look at our rolling four quarter sort of gross margin investment, somewhere between 10 and 20 basis points and OG&A leverage of 10, 20 basis points similarly to keep the business in balance. I would say that because we're cycling Q4 last year gross margin was relatively flat, and OG&A was relatively flat. So I would say you should probably expect our gross margin investment will be a little bit north of the 10 to 20 basis points in Q4, but our OG&A leverage should also be north of that 10 to 20 basis points as well.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nThank you.\n\nGary Millerchip -- Chief Financial Officer\n\nThanks, Michael.\n\nOperator\n\nThank you. And the next question goes to Chuck Cerankosky of Northcoast Research. Chuck, please go ahead. Your line is open.\n\nChuck Cerankosky -- Northcoast Research -- Analyst\n\nGood morning, everyone. Nice quarter. If you could talk a little bit about which categories did worse than inflation in terms of unit growth in which we're stronger on managing a lot of that was in the general merchandise. And also, Gary, could you comment on why identical sales growth, ex fuel was better than total sales growth ex-fuel?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. In terms of the categories, the one you identified definitely would be the weaker category in terms of general merchandise. And that would be true at the Fred Meyer division, it would also be true across the rest of the organization as well. We continue to do well in those categories relative to the market.\n\nOur teams have done a great job of making sure they've been managing inventories relative to where the expectations themselves. The other categories that would be weaker than the total would be categories where we continue to have supply chain disruptions. Gary and I both mentioned, overall supply chain is getting better, but we still have categories like cat food, dog food, baby formula some of those types of cold remedies, some of those areas continue to have some supply chain issues as well. With the identicals, Gary, go on.\n\nGary Millerchip -- Chief Financial Officer\n\nYes. Thanks, Rodney. Thanks for the question, Chuck. Yes, the biggest part of that, in fact, pretty much all of it, Chuck, would be -- you may recall at the start of the year, we shared that we've made the decision to stop dispensing certain drugs in our specialty pharmacy business because it didn't really tie to overall customer loyalty in our broader business, and it isn't profitable business for us.\n\nSo we made that decision at the start of the year, and we adjust that out of our ID. So it's a like-for-like comparison, but it does create a disconnect between total sales and identical sales. One of those examples is actually helping gross margin, as well as we're making those decisions to make sure we're optimizing the balance of the business.\n\nChuck Cerankosky -- Northcoast Research -- Analyst\n\nThank you.\n\nGary Millerchip -- Chief Financial Officer\n\nThanks, Chuck.\n\nOperator\n\nThank you. And the next question goes to Ed Kelly of Wells Fargo. Ed, please go ahead. Your line is open.\n\nEd Kelly -- Wells Fargo Securities -- Analyst\n\nHi. Good morning, guys. Thanks for taking my question. Gary, I'd like to ask you about the dynamic between the LIFO charge and the FIFO gross margin going forward.\n\nThere's -- the FIFO gross margin have been good. And this year, there's probably $0.50 a share or more, I guess, in the LIFO charge in terms of the headwind. I mean, assuming inflation eases, you get much of that LIFO charge back. Do we just add that back to earnings? Or is there a dynamic to consider when we think about the FIFO gross margin? Presumably, some of this probably still needs to be priced.\n\nI'm just kind of curious, is the FIFO gross margin performance that we've seen, can you sustain that when the LIFO charge eases next year?\n\nGary Millerchip -- Chief Financial Officer\n\nYes. Thanks for the question, Ed. I think as you heard as mentioned on the call, we probably won't get into a lot of detail around 2023 guidance because we'd rather put it into context of the full picture for next year. As you might imagine, there'll be a lot of moving parts as we sort of bridge to share that color with you when we get to March next year.\n\nI think overall, though, certainly, some of the elements that you talked about are going to be key factors when you think about what will be at play as you think about 2023, if I kind of talk more in general themes. I think overall, I would say we feel good to answer your question about gross margin that we are very focused on and I think are proven for our model, but there are levers that we can pull to manage costs and sourcing effectively to improve mix over time with some of the momentum in our brands and the opportunities continue to accelerate fresh performance and innovation. So there are a number of areas when we look at the balancing gross margin that we believe we would expect there to be longer-term stability and our ability to manage that. I think when you look specifically at the moving parts for next year, I think there's going to be a lot of factors that will come into play as you think about next year.\n\nYou're right in terms of if inflation normalizes and your numbers certainly correct around the $500 million in this year, which would be a $300 million year-over-year headwind because last year's LIFO was also inflated as inflation started to rise in quarter four last year. If you remember, our LIFO charge is calculated at a very specific week of the year, even though we try and estimate it throughout the year. So we would believe that as we'll get into guidance next year, obviously, when we share our earnings, and we're still sort of forming views around what we think will happen with inflation, but we're probably looking at most of the external views that you are and most of the analysts' reports that we can look at in the USDA, etc., would be in that sort of more of that 2.5% to 3-or-so percent inflation for next year. We'll obviously provide more color on what we believe, but that's sort of where most of the data that we see tend to be pointing toward.\n\nEd Kelly -- Wells Fargo Securities -- Analyst\n\nOK. And then, just a quick follow-up. Fuel margins have been really strong. I mean, there's been -- some of your peers in the industry have talked about that moderating next year? I'm just kind of curious as to whether you share that view and how we should be thinking about modeling that going forward?\n\nGary Millerchip -- Chief Financial Officer\n\nYes. I think again, I'll maybe just broaden it because again, I think it's a little bit dangerous to pick on one element of the model for next year. I do think that fuel margins have had obviously a very good run. And generally, I think margins are improving over time, but there is there has been in the last two years, some major volatility in shocks in the market.\n\nI think it's hard to see those being cycled. So you look at margins earlier in this year, and I think that's likely to be a headwind next year in looking at the fuel profitability. But again, I think you mentioned LIFO, another example for us would be -- as you look at our incentive plan, obviously, we're having a very strong year versus our expectations, having raised our guidance every quarter. So you get to more of a normalized incentive plan next year, assuming the budgets kind of your expected payout.\n\nWe continue to take costs out of our business and find new ways to improve leverage in the model. It has been five years, as you know, journey for us. We believe supply chain and alternative profits are potential tailwinds next year as we continue to improve efficiency in supply chain and all profit continues to grow. So I think there's a lot of moving parts.\n\nAnd again, rather than sort of trying to bridge you to how all those play out. I think that's going to be a balance of puts and takes. And obviously, we're looking forward to sharing a lot more color when we get to March next year.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. I think when you look at Gary's points overall, it's one of the things that's so important about our overall business model because we do have a lot of moving parts, and we've invested a ton of work and effort our whole team has over the last several years to reinvent the business model and make sure the business model can be successful in every economic environment. And to me, Gary's point that he was sharing really highlight that as we look forward.\n\nGary Millerchip -- Chief Financial Officer\n\nThanks, Ed.\n\nEd Kelly -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And the next question goes to Scott Mushkin of R5 Capital. Scott, please go ahead. Your line is open.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nHey, guys. Thanks. Thanks for taking my questions. So the first thing I wanted to -- so the first thing I wanted to get some answers to a little bit is the market share, you guys market share.\n\nIt seems to have stabilized, maybe even growing a little bit. Do you agree? And what do you think is leading to that?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. If you look at market share, the trends continue to improve, and we feel good about where we are, but we're not satisfied with where we are. We believe the work that we're doing on Fresh is a key part of driving that. And obviously, just the continued personalization and making sure that we have a customer experience for its household to household type relationship.\n\nAnd then, our brands always shines when an economic environment gets a little tougher. So it's really those things working together. And then, our store teams continuing to do a good job of improving on friendliness. And I make that comment based on what customers tell us how we're doing, not just my opinion of how we're doing.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nGreat. And then, my second question is a little bit more short term. I mean, we've heard some retailers, not necessarily in the food industry, but some retailers that the consumers behave or kind of changed somewhat abruptly as we work through the fall. I mean, is that something you guys have seen? And if yes, do you think it's started to leak into the competitive environment?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. It's a great question, Scott. And when we talk to our customers, they're telling us they're changing. But so far, they're changing on purchases other than food.\n\nSo it's -- they are still prioritizing food. It gets a little bit back to one of the comments I made. It's still three times or four times cheaper to eat at home versus going out to a restaurant and so many more people have learned how to cook. So if you look at the behavior changes other than the movement to our brands and being much more aggressive on downloading digital coupons and engaging with some of our promotional offers.\n\nThat's really the only behavior we've seen in our business outside of the comment I made earlier on our general business, but that's a much smaller part of our business than many of our competitors.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nAnd the competitive environment, has it changed?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nNo. It's all -- as you know, it's any place you look across the country, you'll see it in different stages. And -- but overall, what we see is pretty similar to what -- how it's been.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nAll right. Thanks, guys. Appreciate it.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Scott.\n\nOperator\n\nThank you. And the next question goes to John Heinbockel of Guggenheim Partners. John, please go ahead. Your line is open.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nSo Rodney, I want to start with a big picture here. When do you guys think about -- because you've got the data, if you think about growth in households, right? So if you're going to comp, let's say, I don't know, 3% or 4% longer term, household growth would be what of that and comp growth with comp households would be what? How do you think about that? And then, when you -- is there any way for you to dive into your penetration right with your deciles and where the biggest opportunity is?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nI will start and then Gary, please add any color you want. But if you look long term, we always build our business model around 1% to 2% inflation. And if you -- as you know, any given year will be different than that. But longer term, we've always felt that that's kind of where fundamental inflation will be.\n\nObviously, over the last couple of years, it's been completely different than that. As I shared in my prepared remarks, our oil household growth was very strong this quarter, and it's been moving in the right direction. When customers first become a loyal household, what we find is, over time, we get a higher share of that household growth. And we really are seeing that what we define as our seamless experience where a customer can engage with us where we deliver where they pick up in store and shop in store, it's that combination together that earns us the right.\n\nSo as our loyal household grows, we get a higher share and that should be a tailwind to our identical sales growth over time. And that was the reason that we talked about it, and it's something, internally, we spend a lot of energy on it. And I know, Gary, is there any other color that you think would be helpful for people to understand.\n\nGary Millerchip -- Chief Financial Officer\n\nI think you covered it well, Rodney. I guess the only couple of extra points, John, I would maybe add, I do think, as you know, our core strategy is to grow existing loyal customers and what was really pleasing in the quarter as we saw 2.5% growth in loyal customers. So we're seeing customers move through the loyalty curve, and that's always been carry the strategy to really deeply reward customers and grow that relationship. I think what we're also seeing though is that as Rodney mentioned, we're building that seamless capability with digital, we are starting to now attract a larger number of households too and the investments we're making in digital are creating that capacity to grow households as well.\n\nI think the one thing on the loyal house, as I would say, too, is what we saw during the quarter have seen the last couple of quarters is that maybe that more affluent customer that has shopped maybe a larger number of retailers before that's consolidated more of their trips and total basket with Kroger as they may not need to adjust their budget because of inflation, but they feel it's the sensible and responsible thing to do, and they see Kroger as a great place to get the right quality at a great value as well, and we're seeing that consolidation happen.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nAnd just one more quick thing. Just conceptually, I know you don't want to talk about anything beyond this year, but right? You've raised the EBIT guide quite a bit right now you're up in the high fours. When you look at '22, what was in there, maybe the good guys and the bad guys that kind of work against each other. I'm sort of wondering how sustainable is that new level of profitability grant, the margin is not up as much as the dollars are.\n\nHow do you think about that in terms of how representative of that performance is and what goes and comes next year off the P&L from this year?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nJohn, as you know, we manage our business on dollars. And for us, growing dollars is what creates a sustainable business model long term. And we always view that the better offer that we can be able to afford to give to our customers the more sustainable that is, and the only way we can do that is by managing our costs and continuing to find and identify areas of waste so that we can reduce that and fund that. Fundamentally, as you look at Kroger, we still would have that same strategy and we'd still expect that over time because what we find is that really connects well with the customers.\n\nWe -- that allows us the capacity to continue to invest in our associates and support our communities. And when we do those three things right, the shareholders benefit. So I know broad picture, that's what we would do, the way we look at things. And obviously, with everything we do, we try to make sure we're doing it in a way that's sustainable long periods of time.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nOK. Thank you.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, John.\n\nGary Millerchip -- Chief Financial Officer\n\nThanks, John.\n\nOperator\n\nThank you. And the next question goes to Kenneth B. Goldman of J.P. Morgan Chase.\n\nKenneth, please go ahead. Your line is open.\n\nKenneth B. Goldman -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. It's important to list my little initial [Inaudible] I'm just curious, the -- it's the second quarter in a row that you've lowered your capex guidance. I understand why you've been clear about that.\n\nAnd as Rob Moskow pointed out last quarter, you're not the only company to feel that pressure. I'm curious though, at what point is it reasonable for us to not be concerned, but sort of be aware of the potential impact on your growth from not being able to expand in a way that you'd like. I'm just curious how it affects anything in the near term, if at all?\n\nGary Millerchip -- Chief Financial Officer\n\nYes. Thanks, Ken. For us, I don't think it's really something that we're concerned about. We obviously did have very ambitious plans for capex this year, playing some catch-up from last year.\n\nAnd we still believe the projects that we have on the horizon are going to be generating significant value for the company in the future and support our growth plans. But when we looked at the expectations for the rest of the year, there are a number of large projects, whether it's in supply chain or some of the stores, just where it's just taking longer to get them completed or there are some costs where it just makes sense to pause for a period of time and reintroduce when we believe that those costs will be more rational. So from our perspective, we don't look at it as having a major impact on our growth model. As you know, we kind of historically were at sort of that $3.2 billion to $3.3 billion of capex spend a year.\n\nWe've moved it up to $3.5 billion, being our sort of target range. And I would still say that's probably directionally where we'd want to be long term, to be pushing to the top end of our TSR model. So we do believe it's important to be investing in the business, and we can still see plenty of opportunities to support that growth, but we just thought it was based on how long it's taking with certain things to get projects completed with supply availability that we think it's going to be a -- some of those projects will now blend into 2023, but we don't have a concern today about it impacting our growth algorithm.\n\nKenneth B. Goldman -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then Rodney, I very much respect your request for us not to ask about the transaction. I won't ask about it. But I am curious, is there a plan ahead to sort of have give updates to investors on a separate kind of form just because it's obviously such a big part of the story from here.\n\nI think people don't want a black hole or a vacuum of news. So I'm just curious what the plan is to kind of update investors on progress? Is it just you'll let us know during each quarter what's new and that's kind of it. And then, we won't have any Q&A around that. I'm just trying to get a sense of that kind of news flow from here.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes, it's a great question, Ken. And it's something that we're going to obviously manage in a very transparent way. And we wanted to go ahead and include it in this quarter, just the context of what is new, and that's what we've shared. If there was something material, we would share it between quarters.\n\nBut in all likelihood in the foreseeable future updates would be on a quarterly basis. But if it was something material, what we try to do on disclosure is if our wells were reversed, what is it that we think it would be helpful for someone to know, and that's what we always try to do. So -- and obviously, feel free to give us feedback when that doesn't feel right to you because we appreciate the feedback.\n\nKenneth B. Goldman -- JPMorgan Chase and Company -- Analyst\n\nThanks, Rodney.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Ken.\n\nOperator\n\nThank you. And the next question goes to Michael Lasser of UBS. Michael, please go ahead. Your line is open.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. Rodney, why wouldn't the grocery sector being more competitive and see more price competition in 2023 given that the consumer is going to be under pressure there's going to be your competitors who are going to want to try and gain some share given the potential distraction from the uncertainty of the merger with Albertsons? Many consumable retailers will have this LIFO gross margin benefit into '23, and there's going to be disinflation where at times, it could be easier to make price investments in an environment of disinflation than it is when there is an inflation.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. It really gets back to overall. I think it's incredibly important to understand that we connect with the customer in multiple ways, and Fresh is a critical component of that. We fundamentally assume over time, the market is going to get more competitive.\n\nWe've done that for 25 years. We'll continue to do that. And that's the reason why we put so much investment energy on personalizing experiences, supporting our associates in ways any way we can, pay, continue in education, even additional support on mental health and especially in today's environment. And what we have found in every environment by supporting and connecting with the customer from a full fresh and friendly experience and then having good prices and very aggressive promotion and then personalizing the experience, we're able to support the customer.\n\nOne of the things that also supports gross margin as we continue to expect larger growth in our fresh departments, which have higher margins in center store. And then, when you look at our alternative profit businesses and some of those businesses have margins better than what the center store would be. So for us, it's -- you really have to look at all of those things together and look at those things over time, and we feel really good about the business model that we continue to develop and grow at our company.\n\nMichael Lasser -- UBS -- Analyst\n\nUnderstood. And my follow-up question is on the outlook for inflation. What are you hearing right now from your vendor TV about their desire to raise prices into 2023. Gary, you said previously that there will be -- or some of the prognostications are for 2.5% to 3% food at home inflation next year.\n\nIf you were to not raise another price from here, how much inflation benefit would Kroger experienced in 2023 just from the wraparound effect of what you've already raised this year? And then, when you meant to 2.5% to 3%, would it be another 2.5% to 3% on top of that?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nWell, I'll make a couple of comments, and Gary, you can think about some of the specifics. If you look at in our fresh departments, clearly, inflation is slowing down in many categories. Chicken would be an example. You're starting to see that in some of the other categories as well.\n\nAnd I always make the comment high inflation solves high inflation because farmers produce more when their margins improve. If you look at on CPG companies themselves, right now, it's kind of mixed. Some CPG companies are willing -- much willing to have higher prices and give up growth. And what we find is when CPGs do that, our brand is so strong, we really gained share.\n\nAnd that helps the customers budget and it also improves the stickiness and the loyalty of that customer as well. So it's -- what do they always say, all short statements and economics are wrong. And I really think you have to look at all the moving parts. I don't know, Gary, anything else you want to add to Michael's inflation?\n\nGary Millerchip -- Chief Financial Officer\n\nYes, I think you covered it well, Rodney. I think Michael, as Rodney mentioned, we're seeing that fresh is certainly starting to see some change in trajectory on inflation. So I think it is the grocery category that's the most stubborn if you like, in terms of where it's holding in inflation at the moment. And as Rodney said, I think from -- as we look forward from our perspective, if that were to continue without being sort of supported by true cost increases, then that creates an opportunity for us with our brands to improve margin and grow share over time.\n\nSo I think that's the way we think about it in general.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Michael.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much. Have a great holiday.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYou too.\n\nOperator\n\nThank you. And the next question goes to Kelly Bania of BMO. Kelly, please go ahead. Your line is open.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi. Good morning. Kelly Bania from BMO. Thanks for taking our question.\n\nJust a couple of simple questions. I guess, as we think about the comp here or the IDs in the back half, can you just help us understand how much inflation drove the upside there versus tonnage or -- you talked quite a bit about your fresh initiative. Is it those stores? Just helping us understand where the upside is coming from? And then on top of that, we often talk on the food service side of the industry about volume and tonnage, I guess, is the way you talk about it relative to 2019. And I'm just curious if you can help us understand where you are in terms of volume or tonnage, however you think about that relative to 2019 levels at this point?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nGary, I'll let you talk about the -- a little color on the IDs and then on the foodservice after you finish Health. I share some things there.\n\nGary Millerchip -- Chief Financial Officer\n\nOK. Great. Kelly, I think overall, we mentioned it in their prepared remarks somewhat as well. We've seen inflation starting to level.\n\nIt's still obviously a very heightened levels. But if you look at the trend quarter over quarter, it really narrowed down to less than increase in inflation in our Q3 versus our Q2. So what we were pleased about was in that context, the continued momentum in our overall ID sales when we look at our Q3 performance versus our Q2, and I think a lot of that ties to some of the prepared remarks that Rodney also shared around household growth that we're seeing and really some defying more share of wallet from loyal customers and seeing lower customer growth. So that's the piece that I think we've been the most pleased around.\n\nAnd we continue to perform really well with winning that first large basket with customers. We continue to see strong momentum there. And even as customers have continued to adjust their behavior as they kind of wrestle with inflation and decide how to balance budgets, we've been really pleased with how our overall pinning that first basket has continued to maintain strong momentum.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. On foodservice, volume would actually be above where we would have been in 2019. For us, when we look at foodservice or food -- we are always -- I never know quite what to call it other than it's a great meal, easy to cook, easy to heat up, easy to assemble. It was the reason why strategically we merged with Home Chef because we thought home chef on its own had great trends and could continue to grow.\n\nWe also felt like their capabilities we could leverage back into Kroger to further improve our mill pit and a great restaurant quality meals would be an example. If you look at sushi, we're the largest sushi restaurant in the United States as an example. Obviously, we partner with a lot of third parties and local entrepreneurs on that, sandwiches and all those things. So we see food service as an important component of our growth, not so much relative to 2023.\n\nBut as you start looking out at, say, 2025 and beyond, and being -- having an amazing quality meal that's easy and leveraging our delivery network or pickup network is an important part of the growth as you look longer term. Thanks, Kelly, for the questions.\n\nOperator\n\nThank you. Our last question goes to Rupesh Parikh of Oppenheimer. Rupesh, please go ahead. Your line is open.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood morning. Thanks for taking my questions. I just had one question just on OG&A leverage. So this quarter, there was minimal leverage on a very strong comp, and that appears to be driven by wage pressures.\n\nSo as you look forward to next year, just any insight in terms of how you guys are thinking about wage crushers at this juncture and whether you think the OG&A leverage point could be lower?\n\nGary Millerchip -- Chief Financial Officer\n\nYes. Rupesh, thanks for the question. Maybe just a little bit more color on Q3 and Q4 as well because I think there's a little bit more to the story there as well that's worth understanding. I would say that certainly, you're right, the -- we saw a lot of benefit from sales leverage and productivity improvements during the quarter.\n\nThe team did a great job in really managing costs, considering the inflation that we're facing in some of those cost areas. We would have also had higher incentive plan costs year over year in quarter higher technology costs. We're investing in a number of areas that we're seeing growth in year over year. And some of that is maybe flipping from capital to operating expense because as you move more to cloud-based activity.\n\nIt just -- it does change the mix there as well. And we also invested, as we did in Q2 in some consultants and some advisory work to help build future momentum in the growth. So I would say the underlying improvement in productivity was stronger than the quarter would have suggested, and we feel good about the ability to leverage OG&A and fund the average hourly rate increases that we're seeing. In fact, as I mentioned earlier, the Q4 number as we're cycling a fairly flat OG&A rate in Q4, we would expect to be north of 20 basis points of leverage in the fourth quarter this year as we head into next year.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nThanks, Rupesh.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. And the next question is our final question to Robert S. Ohmes of Bank of America Merrill Lynch. Robert, please go ahead.\n\nYour line is open.\n\nKendall Toscano -- Bank of America Merrill Lynch -- Analyst\n\nHi. This is Kendall Toscano on for Robbie. Thanks for taking my question. I just wanted to see if you could give any more color on how traffic looked during the quarter.\n\nwhat kind of trends you're seeing with items in the basket and number of trips to the store? And then, I guess, as you're expecting inflation to moderate a little bit in the fourth quarter, what you would expect on those items going forward?\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. If you look at the overall trends in traffic, it continues to be improving. Obviously, the overall basket itself is heavily driven by inflation. But as I mentioned earlier, our trends on market share are moving in the right direction and continue to go in the right direction.\n\nIn terms of the last part, I don't know, Gary, on inflation?\n\nGary Millerchip -- Chief Financial Officer\n\nI think probably similar to what we shared earlier, I think overall, as we're looking at the way the customer is changing behavior, as Rodney mentioned, trips improving, generally fairly consistent, I would say, over the year, but we are seeing higher trips from those loyal shoppers that have traditionally shopped in many different retailers for different categories and now seeing that trip consolidate to Kroger. I think is an important trend that we've seen throughout the year and continue to accelerate in the third quarter.\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nYes. Gary, I think that's a great point, and thanks for the questions. And for everyone, thank you for joining us today. As always, I always like to share a few comments directly with our associates listening in because so many of our associates take the time to do that, which we appreciate.\n\nThis is the time of year we truly shine. Our special holiday film made clear. We create the opportunity for our customers to transform today's holiday moments into tomorrow's memories. We've had the pleasure to hear from countless associates former associates and customers about just how touching this film has been.\n\nI know I can't watch it without getting a tear in my eye. And just reminding all of us how special it is to share favorite meals with those we love most. Thank you to our teams who put this together. Thank you for our teams who make the memories happen.\n\nIt's a wonderful way to kick off the holiday season. As we all prepare together with our loved ones, I am so incredibly proud of our associates across the Kroger family of companies. We have accomplished so much this year. Thank you for the many ways you serve our communities and uplift our customers and each other.\n\nThis concludes our call for today. We wish everyone a happy holiday season. Merry Christmas, Happy New Year and encourage you to stay safe. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRob Quast -- Director, Investor Relations\n\nRodney McMullen -- Chairman and Chief Executive Officer\n\nGary Millerchip -- Chief Financial Officer\n\nMichael Montani -- Evercore ISI -- Analyst\n\nChuck Cerankosky -- Northcoast Research -- Analyst\n\nEd Kelly -- Wells Fargo Securities -- Analyst\n\nScott Mushkin -- R5 Capital -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nKenneth B. Goldman -- JPMorgan Chase and Company -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nKendall Toscano -- Bank of America Merrill Lynch -- Analyst\n\nMore KR analysis\n\nAll earnings call transcripts"
}