{
  "companyName": "Lexinfintech Holdings Ltd.",
  "companyTicker": "LX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/lexinfintech-holdings-ltd-lx-q2-2022-earnings-call/",
  "content": "Lexinfintech Holdings Ltd. (LX -1.04%)\nQ2 2022 Earnings Call\nAug 16, 2022, 9:30 p.m. ET\n\nOperator\n\nThank you all for standing by, and welcome to the LexinFintech second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there'll be a question-and-answer session. [Operator instructions] Please be advised that today's conference is being recorded.\n\nAnd I'd now like to hand the conference over to your speaker, Ms. Echo Yan, IR Director of LexinFintech. Thank you. Please go ahead.\n\nEcho Yan -- Investor Relations\n\nThank you, operator. Hello, everyone. Welcome to LexinFintech's second quarter 2022 earnings call. With us on the line today are CEO Jay Xiao; CFO Sunny Sun; and CRO Jayden Qiao.\n\nBefore we get started, I'd like to remind you that the call and presentation contain business outlook and forward-looking statements, which are based on sections as of today. The actual results may differ materially, and we undertake no obligation to update any forward-looking statements. Jay will first provide an update on our performance, Sunny will cover the financial results in more detail; and lastly, Jayden then will discuss risk management. I'll hand over to Jay, key remarks will be in Chinese and English translation will follow.\n\nJay, please.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nHello, everyone. It is my pleasure to talk to you again and share our second quarter 2022 earnings performance.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nIn the second quarter, total loan originations reached RMB 49.1 billion, up 13.9% quarter over quarter. Total operating revenue was RMB 2,413 million, up 40.9% quarter over quarter. Net profit was RMB 157 million, up 105.5% quarter over quarter. Numbers of both active users and the new active users were higher than those in the first quarter.\n\nFunding costs continued to decrease and the risk indicators remain stable. Our CFO and CRO will provide more details later.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nThe growth in the second quarter was mainly due to the recovered performance of our business in June. In June, the company delivered RMB 18.4 billion in loan originations. The contribution percentage of loan originations from low-risk trading customers increased by 16% in June compared with that number in March. While the risk of new loans was continued to be improved, by the end of the second quarter, the percentage of 24 weeks was over 80%, and we are capable to meet all relevant compliant rules and regulations.\n\nThe data in June has shown that we have returned to a steady growth trajectory and the growth trends will continue.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nThe growth in June is mainly due to the timely adjustment of our business strategy. In the first five months of this year, with the resurgence of the pandemic and associated macroeconomic pressure, we did not only pay attention to the sale of but adopted a more prudent business strategy. At the end of May, with adjustment of pandemic prevention policies and social and economic recovery, we gradually adjusted our strategy and further support the credit potential of our existing high-quality customers. Based on our huge user base, we achieved notable results.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nBusiness strategy adjustments can be summarized as three major initiatives. The first is to increase the proportion of high-quality customers while decreasing high-risk customers. In the past few months, especially in April and May, when the pandemic was severe and the macroeconomy was under pressure, we were prudent in loan originations and took the initiative to control the scale. Although the impact of the pandemic was in fact greater in the second quarter than in the first quarter, our risk performance was generally stable and the quality of new loan originations was better.\n\n90 days delinquency rate was 2.63%. The overall day 1 delinquency rate has continued to decrease last December. And in July, it dropped 11% compared with the average number in the first quarter. The 30-day collection rate was consistently above 90% compared with May, early indicators of new loan originations in June have decreased by over 15%.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nBesides, we further improved the quality of customer acquisition, number one, we have launched targeted high-quality customer acquisition programs for young professionals, multiuse and urban white collars. Number two, most employee team has leveraged the strength of its offline staff to attract more high-quality customers for multiloan with that product. Number three, we have upgraded the co-modeling capabilities with partner institutions to further improve the quality of our applicants. And at the same time, we have introduced more high-quality data sources to strengthen our ability to identify those platform users.\n\nNumber four, we adjusted the customer acquisition spend based on demographic differences into the impact of pandemic resurgence. These are the main measures that we respond to the resurgence and have made us better prepared to cope with challenges in the future.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nThird, we strengthened the segmentation operation of existing high-quality customers. Based on the user data accumulated by Lexin and external data sources, we've divided the customer into several fronts and have conducted several benches of AB to fully validate the effectiveness of the operational strategy of the sub-customer groups, which helped us to significantly improve operating decisions. For example, the per capital contribution of the premium customer group was 60% higher and ARPU was 20% higher.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nSpecific initiatives include number one, in terms of data, we have comprehensively strengthened the coverage and application of the PBOC credit modeling, through which we were able to establish a new model that contains more complex label dimensions and improved accuracy of identifying high-quality customers by more than 25%. Number two, in terms of technology, we have improved our user identification capabilities and operational efficiencies through various models. We upgraded our profitability of before risk model and thanks to more precise customer segment management, also optimization, and the introduction of more data sources, the accuracy of model identification was improved by more than 20%. We expanded the applications of external data with financial institutions in various ways.\n\nfederated learning and the joint model and improved the identification ability of made bucket customer groups through model integration and strategy application. So together, developing user willingness, marketing strategy model, etc., we can more actually identify high-readiness and high-quality users. Thus, we were able to save voicing costs by 50%, while achieving same loan volume.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nThe business strategy adjustment in June was with good results, mainly due to the four core capabilities we have accumulated in the past nine years. First, user operation capability is mainly reflected in other actuals and identification of high-quality custom and segmentation operations, which allows us to meet at different stages through different products and services.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nSecond, the ability of risk control is mainly reflected in our ability to continuously improve our user identification and operations. We have introduced more high-quality external data, further analyzed internal user behavior, the risk control model other pay, and continuously improve the efficiency and accuracy of hypothetical testing.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nThird, the ability of funding is reflected in our funding cost control and the partner expansion. The corresponding costs continued to decrease since February of this year. And over the past one year, the number of our financial partners has continued to expand. Currently, we have cooperated with more than 130 financial institutions.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nFinally, I would like to elaborate on data and the technology capability. Lexin's R&D investment has been industry leading. In the second quarter, we invested RMB 150 million in R&D, up 18.5% year over year. We have integrated the technical capabilities we have accumulated over the years and upgraded them into Lexin's smart business engines.\n\nIt not only provides a full set of intelligent analysis in the decision-making team, but also helps the business to [Technical difficulty] rapid operations and iterations and greatly improves the efficiency of decision-making and the business operations. Smart business engine has already taken effect in other daily operations. In addition to the aforementioned customer segment operation strategy, the smart business engine also brought great efficiency improvements to our Puhui team. With help of the digital operation tools of the engine, the contribution of each employee of our Puhui team has increased by 30% and the sale of SMEs has increased by 50%.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nLexin's strength in consumption scenarios, customer segment, and full profitability are integrated into our business, which forms our self-reinforcing loop that we call it Lexin's ecosystem.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nLexin's unique high frequency and high repeat rate in consumption scenarios such as Sentinel and Maiya, our installment payments, e-commerce platforms put Puhui teams in the advantage of having more high-quality customers. Our high-quality customer base will continue to increase the scale and the profit of Lexin's core business. The increase of scale and the profits of core business allows [Technical difficulty] our data launch, first, to improve the model and technical capabilities. The advanced technology and the risk control capabilities allow Lexin to further provide services to our financial institutions and the merchants.\n\nSharing capabilities with financial institution partners and merchants then allow Lexin to connect with more funding pools and scenarios. The advantage of abandoned scenarios allow us to gain more high-quality customers and the cycle starts again. This is also our unique and long-term competitive advantage.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nWe are confident in our business strategy and long-term development. The company and the management team's share repurchase programs remain in execution. The CFO will provide more details later.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nFinally, I would like to talk about Lexin's corporate social responsibility initiatives. In response to the pandemic resurgence in the second quarter, we launched a specific program, [Inaudible] to help SMEs to deal with their cash liquidity challenges. In the second quarter, the amount of small and micro loans was RMB 5.4 billion. For SME more affected by the fanatic resurgence, we also took a number of measures to help them tide over the difficulties.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nThe recovery trend in June continued in Q3. And our loan origination guidance in Q3 will be RMB 53 billion. All above, this guidance reflects the company's current expectation, which is subject to change.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nLet me now hand over the call to our CFO for a financial update. Thank you.\n\nSunny Sun -- Chief Financial Officer\n\nThank you, Jay. Good morning and good evening, everyone. It's my pleasure to speak to you again. Our business was under pressure due to unforeseen regional COVID surge in April and May.\n\nBut thanks to the determination and effective measures taken by the government and the society as a whole, the pandemic has been contained gradually. In addition, we are also encouraged and inspired by multiple macro stimulus adapted by various government bodies that will boost consumption and [Inaudible] We stay committed to our strategic priorities of enhancing and diversifying the revenue structure while strengthening operational efficiency and optimizing our risk assessment capability. Our sustained efforts on technology innovation and digital transformation have shown more visible results this quarter. Let me now go through some key financial performance of the second quarter.\n\nI'm delighted to report that total loan origination in the second quarter was RMB 49.1 billion, representing a 13.9% increase quarter over quarter. The outstanding loan balance stood at RMB 86.6 billion, representing a 3.3% increase compared with last quarter. While the management team is not completely satisfied with this top-line result, we are encouraged by the positive momentum. Total operating revenue was RMB 2.4 billion, representing a 40.9% increase quarter over quarter.\n\nRevenue from new consumption-driven location-based services was RMB 538 million, an increase of 69% from the first quarter of 2022 and an increase of 32.2% from the same period of 2021. Revenue from technology-driven platform services was RMB 436 million, representing a 12.3% decrease quarter over quarter. Revenue from credit-driven platform services was RMB 1.4 billion, representing a 60.4% increase quarter over quarter. As you might have noticed, we reorganized our revenue segmentation since Q1 this year.\n\nThis is a better reflection of the quality of our revenue and the diversified nature of our businesses. The contribution from noncredit-driven services was more than 40% of the total revenue this quarter at RMB 974 million, having grown at 19.4% quarter over quarter. This is in line with our long-term strategic goal of building up a more risk-tolerant and high-quality revenue structure. In compliance with government guidance, loan pricing in Q2 continued to fall and got closer to 24%.\n\nTill the end of June, mix within 24% APR reached 81.1%, a 3.3% increase quarter over quarter. Let me move on to the expense side of the second quarter. Sales and marketing expenses increased by 32.5% quarter over quarter but decreased by 3% year over year to RMB 477 million. As you know, in Q1, guided by our quality-over-quantity operational priority, we scaled back our advertising costs, especially in areas that were likely affected most by COVID.\n\nThis quarter, together with gradual improvement on the macroenvironment and the containment of COVID situation, we increased our marketing promotion expenses at certain level compared with previous quarter to drive future growth, but still take higher overall spending. Research and development increased by 1.3% quarter over quarter and 18.5% year over year to RMB 555 million, reflecting our continuous investments and upgrading of our technology capability. G&A expenses went down by 3.3% quarter over quarter and 6.4% year over year to RMB 130 million. Just like the third quarter, it went down both year over year and quarter over quarter, demonstrating the continuous improvement of our operational efficiency.\n\nNet profit was RMB 167 million in the second quarter. This is a 105% increase quarter over quarter. Since we have taken a more prudent approach to reflect risk in the first quarter by stepping up the day 1 provision, based on the current external situation, we expect that our profit will continue to follow an upward trend in the second half of this year. Next, a quick update on our share repurchase program.\n\nOn March 16, 2022, the company's board of directors authorized a $50 million share repurchase program. As of June 30, 2022, the company had repurchased approximately 30 million ADS for approximately $31 million under this program. The share repurchase program demonstrated our confidence in serving long-term potential and the management team remains open-minded about expanding the share buyback program in the future, should we deem appropriate and as a way of giving back to shareholders. I'd like to emphasize our unwavering determination to see through both the current execution and the long-term strategy of adequate investments in technology and operational optimization as priorities to drive long-term sustainable business development.\n\nFinally, as we mentioned earlier, and also mentioned by Jay, even though we have experienced some headwinds in the first few months this year due to the resurgence of COVID, we never stopped our efforts of advancing our capabilities in better serving our customers and advancing our business model. Looking ahead, based on the current information at hand, we are cautiously optimistic about the performance of the second half. We expect the loan originations for the third quarter to reach RMB 53 billion. We will continue to pursue a sustainable and resilient business approach and we'll also be alert of any material signs of external changes that might impact our business and we'll reflect -- and we'll react quickly and responsibly.\n\nWith that, I will turn the call over to our CFO, Jayden. Jayden, please.\n\nJayden Qiao -- Chief Risk Officer\n\nThank you, Sunny. Good morning and good evening, everyone. Let me elaborate more on the risk management upfront. In this quarter, we remain cautious on our credit risk approach with several major cities and their surroundings hit by COVID for the first half of the quarter.\n\nOn our customer acquisition side, we have prioritized the quality-over-quantity tactic by adopting a more comprehensive and robust monitoring system, which allowed us to adjust our strategy in response to COVID more dynamically throughout the process from acquisition to portfolio management. We have been seeing positive results from such actions as our risk level was controlled to a rather small rise compared with our peers. The overall day 1 delinquency rate has been down for 17 consecutive months and down by 11% compared with the first quarter this year. Our customer portfolio has grown stronger as a 24% adjustment in progress.\n\nMoreover, as Jay mentioned earlier, the enhancement in customer segmentation and risk assessment model enabled us to focus on high-quality customer segments and increased loan volume contribution from lower risk borrowers. The 30-day collection rate has recovered since May from a modest decline in March and April as the impact of the COVID hit subsided. We have been making advancements in our customer behavior analysis model to provide higher collection efficiency while simultaneously carrying on with the practice of more spread-out collection team to reduce the impact brought by potential regional COVID surges in the future. We are in a solid position to respond more rapidly and accurately with fewer possible obstructions.\n\nIncrease in 30-plus delinquency was within the range of expectations to 4.5% versus 4.4% at the end of March. It was mainly due to the impact of COVID-related circumstances in April and May and a more prudent credit policy leading to modest growth of the outstanding loan balance compared with the first quarter. But as Jay mentioned earlier, we are putting more effort and resources into existing customers, of whom we have a clear credit performance record. To strengthen our resilience, early indicators have already demonstrated that our risk level on new loans has been lowered by over 15% and the trend is expected to continue in August.\n\nWe expect the 30-plus delinquency to have peaked in the second quarter. Finally, I'd like to stress that we have evolved with a more sophisticated risk management system from our experience dealing with the COVID outbreaks and economic fluctuations. We are now better prepared for any external uncertainty and complexity that should happen in the future. Thank you.\n\nEcho Yan -- Investor Relations\n\nThis concludes our prepared remarks. Operator, we are now ready to take questions. Thanks.\n\nOperator\n\nThank you. We will now begin the question and answer session. [Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from Yada Li at CICC.\n\nPlease go ahead.\n\nYada Li -- CICC -- Analyst\n\n[Foreign language] OK, then I will do the translation part. So the first one is about our new consumption services and I was wondering how to view the development so far in 2Q '22 and going forward. And could you please give us more color about the business model of Maiya? And I'd like to know like how much it will contribute to our total revenue in the future? And the second question is about the change of our operational data this quarter, for example, the total GMV. And I was wondering if you could elaborate more about it.\n\nAnd what are the main drivers of this management?\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nLet me try to translate. In the first half of this year, it was very true that we are experiencing some headwinds of the COVID, which definitely bring some pressures to the new consumption business. However, meanwhile, in the first half months with our investment and strategy adjustment, we actually drive our consumption business quite well. And we can see that even under some pressure, our [Inaudible] and Maiya business have delivered some quarter over quarter -- both quarter-over-quarter and year-over-year increase.\n\nEspecially during the midyear promotion of June '18 compared with the same period last year, our performance actually increased by 30% to 40%. So, with our continued investment and in-time adjustment of our strategy to this new consumption business, we definitely see our performance increased gradually. And if we look at our Maiya offline business, we are not only providing services offline to the stores, and we actually issued and launched our [Technical difficulty] to help with brand as well. And in the second quarter, our Maiya APP after it was launched, it was well received.\n\nAnd with this both offline and online capabilities, we can provide more diversified and better services to our merchant accounts. And we have seen that after the launch of our Maiya APP, our -- over 50% of our transactions have been delivered by online. And we are also seeing that this model is welcomed by our current customers, and we can meanwhile also see that [Inaudible] paying is also very encouraging. And actually, we can charge a 30% take rate.\n\nAnd with the current progress, we are fully confident with our new consumption business growth in the future.\n\nSunny Sun -- Chief Financial Officer\n\nThank you. [Foreign language] So let me translate this myself. I think the question earlier was about the new disclosure approach toward the GMV -- e-commerce GMV. And this is a reflection of our reorganization of our revenue.\n\nAnd that this is -- this new disclosure approach reflects only our new consumption-driven LBS services. So GMV and also our revenue disclosure, the adjustments are the same and the approach are the same.\n\nEcho Yan -- Investor Relations\n\nThank you. Operator, the next question, please.\n\nOperator\n\nCertainly. Our next question comes from Alex Ye from UBS. Please go ahead, Alex.\n\nAlex Ye -- UBS -- Analyst\n\n[Foreign language] I'll translate for my question. First one is on the sales and marketing expenses. So the new borrower sales and marketing expense has increased quite significantly compared to the previous two years, almost at doubling growth. So I'm wondering what are the key drivers behind.\n\nIs it more due to fierce competition or due to a tightened credit approval? Or is there any other more of a one-off reason? And looking ahead, what should be the kind of a normalized level we should expect? And second question is on the asset quality. So, the company has been focusing on quality for a while. And management has mentioned about some improvement in day 1 delinquency. So far, we haven't seen much improvement from the vintage curve or your disclosed FPDs [Technical difficulty] delinquency chart.\n\nSo I'm wondering when could we start to see this kind of asset quality improvement starting to be reflected into your financials, including your take rate and your top line? Thank you.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nLet me take the first question in terms of the sales and marketing acquisition cost. There are mainly two reasons of the increase of customer acquisition costs. The first one is definitely the macroeconomy pressure associated with the COVID resurgence. During the period, we were taking a prudent approach to control the scale and be more prudent in terms of the approval rate that we can further improve and manage the quality of our newly originated loans.\n\nAnd the second, as you all know, we are adjusting our pricing from 36% to 24%. And during the process, we are in the progress of optimize our model and RTA. And the third, in a certain period of the process, the acquisition cost also increased.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nI'd like to take the opportunity to share the trend and several opportunities we are going to -- has taken and going to take in the future. First of all, we will definitely increase our capabilities of infiltration and the pre-recognition of our customers. And we are continuously increase our RDA model. First, we can more accurately to identify our customers' quality and behaviors.\n\nAnd second, through our segmentation management of our customers, we can provide better services to our high-quality customers. And as we just mentioned that we have divided more precisely of our current customers into several [Technical difficulty] such as the town use, the urban white collars. And comparatively speaking, these customer groups, their quality is good, while the computation environment is relevantly stable. So, it will also help us to control the cost.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nSo the second initiative we are taking is to leverage our offline Puhui team. Currently, each offline Puhui team employee -- the average Puhui one or two customers. And if we calculate the cost per person, the cost is actually lower than the online cost. And the third, besides continued optimization of our online investment, we are also seek the opportunities to develop some nonstandardized channels to acquire traffic.\n\nAnd these nonstandardized of more traditional channels to get traffic is not that much impacted by the bidding policy. Short term, the increase of our customer acquisition cost is still mainly due to our modeling adjustments to better understand customers and to pursue the high customers. From the long-term perspective, after we [Technical difficulty] together with our process of optimizing our relevant model and approaches, we believe our customer acquisition costs will decline in the future.\n\nJayden Qiao -- Chief Risk Officer\n\n[Foreign language] OK. I'm going to translate what I just said. As Jay mentioned in his presentation, all our early indicators in -- toward the end of the second quarter, especially in June and August -- July and August have indicated a downward trend. So basically, all the early indicators of the risk performance indicators have pointed to an improving credit quality.\n\nHowever, for these early indicators to translate into a longer-term, more stable indicator, it takes time. For example, what we released in our FPD 30 indicators is with the number that has full performance period only showed the performance in May. If you look at the May performance compared with March -- end of March, the improvement is around 10%. But if you look at the June performance, even though the FPD 30 has not yet fully reviewed, the improvement is close to 18%.\n\nSo, what I'm saying is for the FPD 30 indicator and the vintage loss numbers to fully reflect our recent quality improvement, it takes time. So, in the next one or two quarters, you can see -- you can expect to see the improvement. Thank you.\n\nEcho Yan -- Investor Relations\n\nNext question, please. [Technical difficulty]\n\nAlex Ye -- UBS -- Analyst\n\nThat's good for me. Thank you.\n\nOperator\n\nThank you. Our next question comes from Hans Fan at CLSA. Please go ahead, Hans.\n\nHans Fan -- CLSA -- Analyst\n\nHi. [Foreign language] So I got two questions regarding the regulation. The first one is on the APR cap. Management just mentioned that the APR less than 24% accounts for more than 80%, which is good.\n\nBut just wondering when are we targeting to achieve full compliance in terms of all the existing loans priced below 24%. So that's the first question. And second question is more about the decoupling of direct link. I mean the data feeds from Lexin to the banks.\n\nThe progress we learned from peers looks like it's pretty slow. So just wondering what's our plan. And when do we expect to complete or at least have some kind of practice regarding the decoupling of direct link? And how is the regulator viewing our plan? That's our question. Thank you very much.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nSo talking about the 24 pricing policy, we do say it's rather a guidance from government instead of requirements or law. Currently, the difference of local authorities have different directions in terms of this policy. And you can see that in the second quarter, we have already had more than 80% of our pricing is within 24%, which demonstrates our capabilities to digest our pricing further. Currently, we still keep a small amount of the business.\n\nThe pricing is above 24%, it's still due to some local demand. So, as we just mentioned that the company is capable enough to further adjust our pricing to 24% or within 24%, but currently, we have no very targeted timeline of that. And in terms of the impact to the take rate, I'd just say there is no much difference of the take [Technical difficulty] of process of -- the performance of being above 24% or below 24%. And the impact to profit is also kind of stimulus.\n\nIn Q2, we -- our pricing is already very close to 24% and in the future, we definitely have the capabilities to further adjust it to 100%. But currently, we have no timeline for that.\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEcho Yan -- Investor Relations\n\nThe regulation in terms of the disconnection, I want to emphasize is that our progress is actually very fast, and the impact is now slower than our peer companies in the industry. And to be honest, as everybody knows, that there are two partners or bureaus that can provide relevant cooperation with us. We actually already have cooperation with them and have a different plans ready to connect if the official requirement is issued. However, if we have look at the recent issue, the 14 documents by the authorities, actually, the discussion is -- connection policy is actually being extended for more than one year, and we actually interpret this policy as positive [Technical difficulty] To be honest, currently, there is no official requirements or instructions have been issued by the authorities.\n\nWe believe that the authorities and the relevant government bureaus are also considering this kind of requirement [Inaudible] and considering the impact to the players in the industry, especially the medium and small banks, as well as the impact to the economy of China, especially during such a special period. However, as I just mentioned, we integrate this policy from a positive perspective, and we are fully prepared to corporate with the partners in the future. And our current plans and policies are actually ready in place to go if this requirement is issued.\n\nOperator\n\nThank you. That's all the time we have for questions today. I will hand back to management for closing comments. Thank you.\n\nEcho Yan -- Investor Relations\n\nThanks, again, everyone, for joining us today. If you have further questions, please contact us with our contact information available from [Inaudible] Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEcho Yan -- Investor Relations\n\nJay Xiao -- Founder, Chairman, and Chief Executive Officer\n\nSunny Sun -- Chief Financial Officer\n\nJayden Qiao -- Chief Risk Officer\n\nYada Li -- CICC -- Analyst\n\nAlex Ye -- UBS -- Analyst\n\nHans Fan -- CLSA -- Analyst\n\nMore LX analysis\n\nAll earnings call transcripts"
}