{
  "companyName": "United Parcel Service",
  "companyTicker": "UPS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/united-parcel-service-ups-q3-2022-earnings-call-tr/",
  "content": "United Parcel Service (UPS -1.09%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Stephen, and I will be your facilitator today. I would like to welcome everyone to the UPS investor relations third quarter 2022 earnings conference call. [Operator instructions] It is now my pleasure to turn the floor over to your host, Mr.\n\nKen Cook, investor relations officer. Sir, the floor is yours.\n\nKen Cook -- Investor Relations Officer\n\nGood morning, and welcome to the UPS third quarter 2022 earnings call. Joining me today are Carol Tome, our CEO; Brian Newman, our CFO; and a few additional members of our executive leadership team. Before we begin, I want to remind you that some of the comments we'll make today are forward-looking statements within the federal securities laws and address our expectations for the future performance or operating results of our company. These statements are subject to risks and uncertainties, which are described in our 2021 Form 10-K, subsequently filed Form 10-Qs, and other reports we file with or furnish to the Securities and Exchange Commission.\n\nThese reports, when filed, are available on the UPS Investor Relations website and from the SEC. Unless stated otherwise, our discussion refers to adjusted results. For the third quarter of 2022, GAAP results include after-tax transformation and other charges of $27 million or $0.03 per diluted share. A reconciliation to GAAP financial results is available on the UPS Investor Relations website, along with the webcast of today's call.\n\nFollowing our prepared remarks, we will take questions from those joining us via the teleconference. [Operator instructions] And now I'll turn the call over to Carol.\n\nCarol Tome -- Chief Executive Officer\n\nThank you, Ken, and good morning. I'd like to begin by thanking all UPSers for their hard work and dedication to service. I'm proud of the unstoppable spirit of UPSers everywhere and how they leverage the agility of our global integrated network to deliver outstanding service for our customers and strong results for our shareowners. In the third quarter, the global economy softened, especially outside the United States.\n\nInternational and freight forwarding volumes were challenged, but we quickly responded. We adjusted our network to match volume levels and continue to win in the most attractive parts of the market. For the third quarter, consolidated revenue rose 4.2% from last year to $24.2 billion, and operating profit grew 6% to $3.1 billion. Consolidated operating margin expanded to 13%, a 20-basis-point improvement from last year.\n\nThis was our highest third quarter consolidated operating margin in 15 years. Turning to our strategic update. The execution of our customer-first, people-led, innovation-driven strategy has fundamentally improved to nearly every aspect of our business, causing better revenue quality, higher operating margins, and improved bottom-line results. Building on the strong foundation created by our better not bigger approach, we are moving to the next phase of our strategic framework, better and bolder.\n\nWhat do we mean by better and bolder? First, the better part of our framework is not changing. We will continue to focus on growing value share, improving the customer experience, and driving higher productivity from the assets we own. Bolder is about moving faster to grow in our targeted market segment. It's also about combining digital solutions with our global integrated network to create more value for our customers and new revenue opportunities for UPS.\n\nWe plan to combine the capabilities of our strong stand-alone digital services, including Roadie, Coyote, delivery solutions, UPS Capital, and our partnership with CommerceHub, to create a powerful offering of logistics as a service. And when we combine logistics as a service with our integrated physical network, we believe we will be unstoppable. We will share more detail about better and bolder in the coming quarters, but let me give you two examples of what we are doing. On our second quarter earnings call, I introduced our upstream delivery density solution.\n\nHere we are building a digital platform that goes upstream to look at orders, in other words, packages, at the shopping cart level. We then match this new order with other orders that have the same delivery day commitment, which creates delivery density. We've gone live with one customer, and we're delighted with the results we've seen. In fact, we're currently onboarding several new customers to the platform.\n\nAnother example of better and bolder is our pending acquisition of Bomi Group, whose network of healthcare facilities in Europe and Latin America and expertise in cold chain will help accelerate growth in complex healthcare. Along with our recent expansion of UPS Premier in Europe, we are on track to generate at least $10 billion in healthcare revenue in 2023. Now let's look at the three legs of our strategy, starting with customer-first. Customer-first is about creating a frictionless customer experience targeted at the parts of the market where we want to grow, including SMBs, healthcare, international and certain large enterprise accounts.\n\nGiven global economic softening, we are convinced that a relentless focus on customer first matters now more than ever before. And we believe our strategy is working because we've continued to gain share. For example, we are leveraging our time in transit and visibility advantages in Europe to win. In fact, we grew Europe export volume in the third quarter.\n\nAnother example is the growth we are seeing in our digital access program, or DAP. In the third quarter, we grew U.S. SMB average daily volume, including platforms, by 1.9%, and SMBs made up 28.3% of our total U.S. volume in the quarter, an increase of 90 basis points from last year.\n\nDAP continues to add partners and revenue. With more than 3 million merchants shipping with DAP in the first nine months of this year, we generated over $1.6 billion in DAP revenue, and we expect to exceed our $2 billion DAP revenue target in 2022. Moving to the people-led part of our strategy, our people are our most valuable assets, and it's important to us that every UPSer views our company as a great place to work. We know that when we take care of our people, they will take care of our customers.\n\nRecently, UPS reached contract extension agreements with the Independent Pilots Association and our aircraft maintenance technicians. Both contracts continued to reward these UPSers with industry-leading pay and benefits and will help ensure the company's future success. And we are making other changes to improve our employee experience and satisfaction. For example, through what we call our operator experience program, we recently worked with our U.S.\n\ndrivers to create individual lives' dispatch plans, giving them more choice over the hours they work. We also automated tasks and reorganized our operations team to improve work-life balance for our operating supervisors. And for our management employees globally, we are evaluating our overall pay mix composition. While total compensation compares favorably with the market, we may have some opportunities to rework the pay mix to make our compensation even more attractive.\n\nNow to the last leg of our strategy, innovation-driven, this is about driving more productivity from the assets we own. Our integrated network is the best in the industry, but we are leveraging data and technology to make it even smarter, more automated, and more efficient. In the third quarter, our productivity improvements continued to deliver benefits. In the U.S., we optimize trailer loads by eliminating nearly 1,000 loads per day compared to the third quarter of last year, and we successfully managed hours in line with volume level.\n\nWe also launched total service plan, which is about running a predictable on-time network. Execution is going as planned. And as of last week, our on-time computer departures and arrivals improved 6.5% compared to last year, reducing idle time in the network. Additionally, this month, we completed the initial rollout of our smart package, smart facility, which enables RFID label technology in 101 buildings in our network.\n\nFurther, we opened our eighth regional hub in the United States. Located in Harrisburg, Pennsylvania, this 800,000-square-foot automated hub provides significant processing horsepower to better serve the Northeast corridor and helps enable greater network flexibility across the U.S. This hub is also home to UPS' largest natural gas fueling station within our network. This fueling station will remove 8 million gallons of diesel fuel per year.\n\nThat's equivalent to removing more than 17,000 gasoline-powered passenger cars from the road. Turning to peak. For the last four holiday season, UPS has been the industry leader in on-time delivery performance, and we intend for that to continue. This outperformance doesn't happen by accident.\n\nWe built our integrated network to flex with volume. And our investments in our people, automation, and technology enable greater agility. To prepare for peak, we made enhancements to all of the areas of our business that delivered a great peak last year. Let me share a few details about our peak plans for this year, starting with volume.\n\nThis year, we anticipate our volumes will peak later in December compared to last year, as we expect consumers will return to more pre-pandemic shopping behaviors. While we will continue to use technology to match daily capacity with customer demand, we're also optimizing air and ground volume to make room for new customers where we can add the most value. While we will have a peak, as Brian will detail, overall volume in the fourth quarter is expected to decline from last year due to contractual agreements. In terms of labor, we'll bring on more than 100,000 seasonal hires this year.\n\nRelated to hiring, we're ahead of where we were this time last year. One reason is because we've made the digital hiring process even faster and easier this year. We've also improved training for our new driver helpers, which shortens the amount of time from hire to dispatched. Newly hired driver helpers can complete training on their phones and begin work on day one.\n\nBottom line, we are ready to deliver another successful peak. Let me end by reaffirming our 2022 targets of consolidated revenue of around $102 billion, consolidated operating margin of about 13.7%, and return on invested capital greater than 30%. In the face of a very dynamic macro environment, we are demonstrating more agility than ever before. We are focused on controlling what we can control.\n\nAnd under our better and bolder framework, we are combining digital capabilities with our global integrated network to continue winning in the most attractive parts of the market, driving operational excellence and delivering best-in-class service for our customers. So thank you for listening, and now I'll turn the call over to Brian.\n\nBrian Newman -- Chief Financial Officer\n\nThanks, Carol, and good morning. In my comments, I'll cover four areas, starting with the macro environment, then our third quarter results. Next, I'll cover cash and shareowner returns. And lastly, I'll wrap up with some comments on our outlook for the rest of the year.\n\nIn the third quarter, the macro environment remained dynamic. In the U.S., we continue to see crosscurrents, driven by the strong job market and healthy consumer spending, despite higher inflation and interest rates. Internationally, the macro environment weakened more than we expected due to high inflation, volatile energy prices, lockdowns in Asia, and the war in Eastern Europe. We responded quickly to the changing market conditions by leveraging the agility of our global integrated network to provide excellent service to our customers and deliver our bottom-line commitments to shareowners.\n\nIn the third quarter, consolidated revenue increased 4.2% to $24.2 billion. Consolidated operating profit totaled $3.1 billion, 6% higher than last year. Consolidated operating margin expanded to 13%, which was 20 basis points above last year. For the third quarter, diluted earnings per share was $2.99, up 10.3% from the same period last year.\n\nNow let's look at our business segments. In U.S. domestic, our revenue quality efforts and the execution of our planned cost initiatives drove third quarter results above our expectations. In the third quarter, average daily volume was down 1.5% versus the same time period last year, but the growth rate was an improvement over the first half of 2022, as new volume from the record number of wins we had in the second quarter came into the network.\n\nIn the third quarter, the gap between year-over-year B2C and B2B average daily volume growth rates narrowed, as we lapped more normalized consumer shopping behaviors. B2C average daily volume declined 2.2%, driven by contractual agreements we reached with certain enterprise customers. B2B average daily volume was down 0.5% year over year due to declines in manufacturing volumes, which was partially offset by growth in retail B2B, driven by returns volume. In the third quarter, B2B represented 42.8% of our volume, which was up slightly from the 42.4% in the same period last year.\n\nLooking at customer mix. The execution of our strategy is continuing to drive improvement. In the third quarter, we grew SMB average daily volume, including platforms, 1.9%, and SMBs made up 28.3% of our total U.S. domestic volume in the quarter, an increase of 90 basis points from one year ago.\n\nFor the quarter, U.S. domestic generated revenue of $15.4 billion, up 8.2%. Revenue per piece increased 9.8%, more than offsetting the decline in volume. Our revenue quality efforts continue to deliver results.\n\nIn the third quarter, about one-third of the revenue per piece growth rate increase came from continued strength in base pricing. Another third of the revenue per piece growth rate increase came from changes in fuel price per gallon, and the final third came from the combination of mix and our fuel pricing actions. Turning to costs. Total expense grew 7%.\n\nWages and benefits contributed about 310 basis points of the increase, driven by the annual increase for our Teamster employees that went into effect in August. Fuel drove 220 basis points of the expense growth rate increase due primarily to the rise in price per gallon compared to last year. And the remaining variance was driven by multiple factors, including maintenance and depreciation. Cost in U.S.\n\ndomestic came in as we expected due to our planned productivity initiatives, which drove our cost per piece growth rate to be lower in the third quarter than it was in the second quarter and partially offsetting wage and benefit increases. We are continuing to see the benefits of our cube utilization and other productivity efforts, including total service plan, which launched on July 11. I'll share more about our productivity initiatives in a moment. To sum it up, revenue growth was above expense growth, which created positive operating leverage for the seventh consecutive quarter.\n\nThe U.S. domestic segment delivered $1.7 billion in operating profit, an increase of $272 million or 19.2% compared to the third quarter of 2021, and operating margin expanded 100 basis points to 11%. Moving to our international segment. The global macro environment continued to soften, but we remained agile and flexed our network in response to changing market conditions and delivered excellent service to our customers.\n\nAt the beginning of the quarter, we expected the international average daily volume growth rate to improve compared to the first half of 2022, and it did. However, it did not improve as much as we anticipated due to continued macro softening. In the third quarter, international average daily volume was down 5.2%. Total export average daily volume declined 0.6% on a year-over-year basis.\n\nChina export volume declined due to lockdown and disruptions to manufacturing output. In response, we quickly adjusted the network and canceled 75 China and Hong Kong origin flights, and rerouted 27 flights to other gateways in support of our customers. These changes enabled us to move volume for our customers where it was available, maintain high levels of service and achieve a payload utilization of over 98% on our Asia outbound intercontinental flights in the third quarter. Looking at Europe.\n\nWe continue to win on our speed and service advantages at strong revenue quality, despite softer market conditions. We grew transborder average daily volume 2.6%, and total Europe export average daily volume grew 0.6% in the third quarter. In the third quarter, international revenue increased 1.7% to $4.8 billion, which included a negative currency impact of $335 million and a fuel benefit of $363 million. Revenue per piece increased 6.4%, which included the fuel and currency impacts I just covered and a 510-basis-point increase from the combination of product mix and revenue quality actions we took.\n\nOperating profit in the international segment was $1 billion, which included an $82 million negative impact from currency. There was no year-over-year impact from fuel on international operating profit. Operating margin in the third quarter was 20.9%, which was down from the same period last year due to the delevering of our fixed costs and the impact of a stronger U.S. dollar.\n\nNow looking at supply chain solutions. Our teams continue to navigate a dynamic macro environment in the third quarter and did an excellent job serving our customers and managing costs to deliver year-over-year operating margin expansion. In the third quarter, revenue was $4 billion, down $268 million year over year, which included a $92 million negative impact from currency. Looking at the key drivers.\n\nIn freight forwarding, declines in volume and market rates reduced revenue and operating profit. However, the team was able to effectively manage buy/sell spreads and continued supporting our customers. Within forwarding, our truckload brokerage unit delivered strong operating profit growth, driven by revenue quality initiatives, and logistics delivered strong top and bottom-line growth, driven by our complex healthcare business from cold chain, clinical trials, and medical device customers. In the third quarter, supply chain solutions generated operating profit of $459 million and delivered a record third quarter operating margin of 11.5%, an increase of 100 basis points over last year.\n\nWalking through the rest of the income statement, we had $177 million of interest expense. Our other pension income was $297 million, and our effective tax rate for the third quarter was 21%, which was better than we expected due primarily to discrete items. Let's turn to cash and shareholder returns. Year-to-date, we've generated $10.8 billion in cash from operations, and free cash flow was $8.5 billion.\n\nAnd so far this year, UPS has paid $3.8 billion in dividends and completed $2.2 billion in share buybacks. Now I'll make a few comments regarding our outlook. According to IHS, full year global GDP is expected to grow 2.8%, and U.S. GDP is expected to grow 1.7%.\n\nBoth are lower than their forecast at the beginning of the year. We are continuing to pay close attention to macro elements, including lockdowns in Asia, inflationary pressures, the health of the consumer, and the geopolitical environment. Needless to say, the macroeconomic environment is much different now versus our expectations when we started the year. But by controlling what we can control, quickly adjusting the network to match changes in volume levels, and delivering excellent service to our customers, we are still on track to deliver our full year financial targets.\n\nWe expect consolidated revenues to be around $102 billion. Consolidated operating margin is expected to be about 13.7%, and return on invested capital is anticipated to be above 30%. Now let me give a little color on the fourth quarter. Starting with U.S.\n\ndomestic, we anticipate fourth quarter 2022 revenue growth of around 4.5%, driven by strong revenue quality, and we expect fourth quarter operating margin to expand year over year to around 12.4%. Looking at peak in the U.S., we expect peak volume to come in heavier later in the peak period, and we have one additional delivery day compared to last year, which gives us more flexibility. As you update your models for U.S. domestic, there are a few things to keep in mind.\n\nWe anticipate the average daily volume growth rate will be lower in the fourth quarter of 2022 than in the third quarter due to contractual agreements we have reached with certain enterprise customers. Second, we expect increases in wage and benefit rates will be higher than the same time period last year due to the annual increase our Teamster employees received in August. And third, we are continuing to execute our productivity initiatives to help offset wage and benefit rate increases. Our biggest productivity initiative is total service plan, which is performing as planned.\n\nSince the launch on July 11, we've improved our driver dispatch timeliness by 13%. This is about getting our drivers out of the building on time, which creates a more predictable environment for our employees and better service for our customers. Also in regard to productivity in the third quarter, we brought on additional automation in the network prior to peak, including automated bagging, robotic small sort induction, and autonomous irreg vehicles. As a result of all these efforts, we expect the U.S.\n\ndomestic fourth quarter 2022 cost-per-piece growth rate to be lower than it was in the third quarter of 2022. Moving to international. We expect revenue in the fourth quarter of 2022 to be relatively flat to the fourth quarter of last year. We anticipate our share growth and revenue quality initiatives will offset the weaker macroeconomic environment and negative currency impacts.\n\nAnd we expect international operating margin to increase sequentially in the fourth quarter of 2022 to around 21.5% as we continue to respond to market changes with agility. In supply chain solutions, we expect revenue in the fourth quarter to be above $4 billion as we partially offset declines in the air and ocean freight forwarding revenue, with continued growth in logistics and our healthcare business. Operating margin for supply chain solutions in the fourth quarter of 2022 is expected to be around 11.4%, as we continue to effectively manage the buy/sell spreads in a dynamic environment. Turning to capital allocation for the full year.\n\nIn 2022, we expect free cash flow to be above $9 billion, including pension contributions to fund annual service costs. Capital expenditures are now expected to be about $5 billion, which is $500 million less than our original plan. The largest driver of the variance is the result of our decision to lease certain facilities, instead of purchasing them. This approach enables us to maintain higher levels of agility and further improve our overall capital structure.\n\nWe plan to pay out around $5.2 billion in dividends, subject to board approval. We have repaid $2 billion in debt this year as planned, including $1 billion in October. We expect to complete at least $3 billion in share repurchases for the year. And lastly, we expect the tax rate for the full year to be around 22%.\n\nBefore I wrap up, last week, we announced our U.S. general rate increase. The 2023 increase will be 6.9%, reflecting the value of the services we offer and cost inflation in the market. The details have been posted to ups.com.\n\nExecuting our strategy under better, not bigger, has led to a greater agility across our business and stronger financial performance. Our move to better and bolder enables future growth in revenue and margin. By combining the strength of our physical network with new digital capabilities, we will continue providing excellent service to our customers, win in the most attractive parts of the market, increase the efficiency of our operations and create value for our shareowners. Thank you.\n\nAnd operator, please open the lines.\n\nOperator\n\nThank you. [Operator instructions] Our first question will come from the line of Allison Poliniak of Wells Fargo. Please go ahead.\n\nAllison Poliniak -- Wells Fargo Securities -- Analyst\n\nGood morning. Just want to talk to the total service plan and some of the automation you put through. Brian, I think you had talked to $300 million of productivity. It sounds like you're on your path there.\n\nDo we start to see that accelerate into Q4? Are these trending better than maybe you would have thought originally? Just any color there. Thanks.\n\nBrian Newman -- Chief Financial Officer\n\nAllison, good morning. So we had talked about driving productivity of about $300 million in the back half of the year. A little more than half of that is going to come in the fourth quarter relative to the third quarter, and TSP is one of the largest drivers of that. We're actually on track, and we're seeing the system running more on time.\n\nI called out in my prepared remarks 13% increase in terms of the efficiency in the drivers. So the idle time is decreasing, and we're very pleased with the performance.\n\nCarol Tome -- Chief Executive Officer\n\nMaybe just a little more color there. Our overtime hours were down 1 million hours in the quarter. Our bench has dropped from 29% to 20%, and we reduced fluctuations in driver paydays by 39%. So the plan is working, and we just got started with it on July 3.\n\nAllison Poliniak -- Wells Fargo Securities -- Analyst\n\nYeah, great. Thank you.\n\nOperator\n\nOur next question will come from the line of Amit Mehrotra of Deutsche Bank. Please go ahead.\n\nAmit Mehrotra -- Deutsche Bank -- Analyst\n\nThanks, operator. Hi, everyone. Congrats on the results. I just -- I guess, I had a quick two-parter.\n\nCarol, can you talk about market share trends? UPS has obviously been investing in time in transit. I think you said, when we met after Labor Day, that UPS is maybe at parity or better on 17 of the top 25 lanes in the U.S., so obviously, there's some room for improvement there. But can you just talk about what you're seeing on market share trends, both driven by what you're investing in times in transit and, obviously, some of the challenges in your direct competitor? And then, Brian, there's obviously a lot of uncertainty beyond our borders. You have a massive -- your road business -- over-the-road business, ground business in Europe, the international profits have held in there remarkably well.\n\nThere's obviously some cracks and concerns on that market. Can you just talk about your confidence in being able to kind of maintain this level of earnings cadence in the international business given all the uncertainty out there? Thank you very much.\n\nCarol Tome -- Chief Executive Officer\n\nWell, starting with the question on market share, a big turning point for our company is when we invested in fastest ground ever, improving our time in transit. And yes, we are advantaged or at parity in 17 of the top 25 markets. We offer seven-day residential service, Saturday pickup for our business customers. So this has made a significant difference in our business.\n\nAnd if you look at it through the lens of market share, just looking at SMB in the United States, we've seen that we've grown both revenue and ADB market share ahead of our competitors. And when we look at it through the lens of enterprise, we've grown revenue share. So we're delighted with the share gains that we've sustained in the United States. But the share gains continued outside of the United States as well.\n\nSuper pleased of the time-in-transit advantage that we have in Europe, and what that's meant for share gains in Europe despite the very uncertain market.\n\nBrian Newman -- Chief Financial Officer\n\nYes, Amit. In terms of the international side, it is a challenging macro environment out there, but we expect total volume levels in Q4 will actually be higher than Q3, improving utilization from an ADB perspective. Growth rates, we expect to improve. We're looking to win share in Europe, execute on the initiatives to grow the U.S.\n\nexport lane, which, going into the peak season is helpful. So there are lots of cost initiatives that Kate and the team are executing real time. I think you saw that in sort of the flexibility with taking down flights in Asia and rerouting to where the customer needs were. So we feel great about the agility of the international business.\n\nAmit Mehrotra -- Deutsche Bank -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question will come from the line of Chris Wetherbee of Citi. Please go ahead.\n\nChris Wetherbee -- Citi -- Analyst\n\nYeah, thanks. Good morning. I want to look a little ahead to 2023 and maybe think a little bit more on the cost side. Obviously, the macro is challenging.\n\nAs you noted, there's crosscurrents in the U.S., but it seems like we're in a decelerating demand trend. So wanted to get a sense of sort of the big-picture initiatives you guys are working on from a cost perspective in 2023. And I think I've asked you this before, but as you think out to '23, assuming we are in a more cautious sort of potentially negative volume environment, are we still confident that we have the ability to sort of grow the domestic margins, as well as domestic profit, next year?\n\nCarol Tome -- Chief Executive Officer\n\nWell, maybe I'll start with just a philosophical approach to building a plan for '23, and then we can have both Brian and Nando talk about some of our cost initiatives, and Kate can join in, too. So first, this is a very interesting time to be building a financial plan because there is so much uncertainty. There's economic uncertainty, there is geopolitical uncertainty. We do have a contract that's coming up for renewal next year as well.\n\nSo there's a lot of uncertainty, but here's our philosophical approach to building the plan. One, we're going to stay on strategy because we believe that we should invest through whatever comes our way, so that we can continue to improve the customer experience, as well as the employee experience. So we're going to stay on strategy. We're going to build more agility into our plan than we've seen before, and I would say we're pretty agile today.\n\nWell, we're going to -- we have to be able to turn on a dime, and so we're going to build agility into the plan. We're going to build a plan of conservatism because if you're too optimistic, then your expenses are too high and then there's a whole bunch of wood you have to chop to get those expenses out. So we'll plan conservatively, and we'll factor into the plan some of the challenges that will come our way as a result of higher interest rates and what that may mean to our [inaudible] pension. But I'm super excited about what I'm seeing in terms of momentum on the productivity initiatives inside of the business.\n\nAnd if I could just talk about one, and then I'll turn it over to Brian and the team to talk. About a year ago, we talked to you about smart package, smart facility, and how we were going to introduce RFID labeling onto our packages. We said we'd get it done this year in about 100 of our buildings. We did.\n\nIt's live now in 101 of our buildings. Let me share with you some of the results that we're seeing because this is pretty cool. On average, one out of every 400 packages is misloaded onto a package car. That means that it cannot be delivered because it's misloaded.\n\nIt has to come back into the center, go through the sorting process again, and get reloaded the next day for delivery. Talk about productivity bleed-out. That is not a good way to operate a business. With RFID labels, we now see that the misloads are one in 800, moving to one in 1,000, which is Six Sigma levels.\n\nSo as I think about how we're going to invest through, we are definitely going to invest in accelerating smart package, smart facility because of the benefits that we're seeing inside of our business. And it's not just the misloads, although it's pretty cool. Imagine the elimination of all those manual scans by our pre-loaders every day. It's pretty doggone exciting.\n\nSo what are the productivity initiatives that we're working on?\n\nBrian Newman -- Chief Financial Officer\n\nSo, Carol, thanks. And I just go back to this control what we can control, and a lot will happen with the macros on the top line. But we had guided to a 13.7% on the UPS operating profit margin. Embedded underneath that was a 12% domestic margin and a 21.5% international.\n\nSo Nando and the team have got a lot of initiatives from total service plan to what Carol talked about, smart package, smart facility, pushing out automation. Nando, do you want to offer a little bit of color?\n\nNando Cesarone -- Executive Vice President and President, US\n\nYeah, sure. So I'll just quickly discuss the total service plan. And while we kicked that off mid-July, we are building muscle, and it's also allowing us to look at other activities that occur within the network that aren't perfectly aligned with that -- the total service plan. And so as we start to refine those areas, such as our administrative and clerical areas for packages that are undeliverable and other activities that were closely linked to things like cube utilization, where quality becomes much easier to first visualize and then improve the cost structure as a result.\n\nAnd then I think one of the bigger unlocks for us is to really manage our demand through day of week, and we start to flatten the demand curve for the week. We see some really impressive cost results there as we start to achieve some of those moves.\n\nCarol Tome -- Chief Executive Officer\n\nSo we'll give you our thoughts on '23 when we release our fourth quarter earnings call because we're still in the middle of building the plan, but we've got a lot of initiatives underway. It doesn't stop just in the United States, but there's some interesting initiatives underway outside of the United States, too. Kate?\n\nKate Gutmann -- Executive Vice President and President of International, Healthcare, and Supply Chain Solutions\n\nYes, absolutely. For international, as you can imagine, the complexity of it, we are all about matching the network through demand. And in some markets, that's very good because of the record competitive wins we're having. As you heard Brian talk about shifting 27 of our flights to Europe for that export growth at the same time, in the moment, pulling on the throttle when we saw the lockdowns for energy in China and pulling down the 75 flights that didn't match with demand.\n\nBut on top of that, we run a significant ground network in Europe, for instance, and it's all about utilization on the ground in the trailers to cut back on trailers. And we've cut hundreds of trailers by driving the highest production rates within that cube so that you get more. You sweat the asset of the feeder network and therefore reduce cost of rentals, as well as drivers and trailers, all the while maintaining best-in-class, on-time service performance at 98%. And it's resonating with customers.\n\nI mentioned the growth. We're seeing, again, that competitive win that we expect to play out in the upcoming quarters as well.\n\nChris Wetherbee -- Citi -- Analyst\n\nThank you very much for the comment.\n\nOperator\n\nThank you. Our next question will come from the line of Tom Wadewitz of UBS. Please go ahead.\n\nTom Wadewitz -- UBS -- Analyst\n\nYeah. Good morning, and congratulations on the strong results. Wanted to see if you could offer some thoughts about sensitivity to lower international air freight rates. I think your comment on 3Q sounds like currency was a bigger effect.\n\nI don't think you mentioned the impact of lower rates. But how should we think about that impact on international margin if international airfreight rates keep falling? Does that flow through to your international export? Or do you have some resiliency relative to that? And then also if you kind of look back at, I think, at your analyst meeting and you had talked about, I don't know if it was 21% or 21.5%, but some type of a margin level where you say after the belly space capacity comes back, this is what we get to. So a couple of questions for you on international margin. Thank you.\n\nBrian Newman -- Chief Financial Officer\n\nSo, Tom, from a service perspective, Kate and the team are doing an outstanding job in terms of managing the international freight. The air freight decline over the rates that you mentioned, those will bleed through a bit, but the reality is the margin in the third quarter, it was really all about 80%-plus was due to currency, and then some of it on the U.S. export lane, which we don't control as much. So that's where we delevered.\n\nWe expect that volume to go up in the fourth quarter. So we'll be able to pass some of the leverage through. So I think we have a line of sight to manage that.\n\nCarol Tome -- Chief Executive Officer\n\nOur international margin will increase sequentially Q3 to Q4, and part of that is because of the great work that Kate and team are doing to move off of charter on to brownfields. Brownfields are just a better economic equation for us, and we're utilizing the aircraft that we own, which will certainly help that margin pressure. In terms of what a good operating margin is for international, well, we love what we've got. We want to continue to grow it.\n\nSo Kate has declared that we're going to be No. 1 in the premium international logistics market. So that means higher margins.\n\nTom Wadewitz -- UBS -- Analyst\n\nGreat. Thank you.\n\nCarol Tome -- Chief Executive Officer\n\nThanks, Tom.\n\nOperator\n\nOur next question will come from the line of Brian Ossenbeck of J.P. Morgan. Please go ahead.\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nGood morning. Thanks for taking the question. So, Carol, just wanted to get your thoughts on durability of pricing in the industry, especially U.S. domestic.\n\nIs there a longer-term trend here to reset expectations around service levels, as you kind of alluded to, coming from historical thought process that shipping is supposed to be free? And maybe you can offer some comments around price elasticity in some of your target markets and if you see any demand destruction yet. And then, Brian, just a quick one. You don't want to give too much on 2023, but it's hard to ignore the move on interest rates. So maybe you can just -- back on pensions, both above the line when it comes to U.S.\n\ndomestic margins and perhaps overall sensitivity for the whole company. Thank you.\n\nCarol Tome -- Chief Executive Officer\n\nSo in terms of pricing durability, value is defined by what a customer is willing to pay, and the customer is willing to pay for the service that we provide. So the new business that we've won and we've been winning new business has come in at very, very solid revenue quality. Now as I look back over the past several years, from 2019 to now, we've grown our RPP in the United States by 23%. And we did that through a number different ways by renegotiating on longer-term contracts, by leaning into the parts of the market that really value our end-to-end network through some demand surcharges, a little bit of help from fuel.\n\nIt's been a real success story. We've also driven productivity during that time frame, but the margin expansion has been really driven by the RPP growth. Looking ahead, we will continue to have RPP growth. You heard Brian talk about the GRI that we just announced.\n\nBut there will be more of a balance between RPP and productivity to enable our margin expansion going forward. We think that's just the right thing to do. In fact, as we continue to drive productivity inside of our business, we're willing to give some of that back to our customers through a revenue share, because why not? If we can increase delivery density, and we're seeing some good proof in our pilots and now our live case, we'll give some of that back because we should. I think about a third, a third, a third, a third for the customer, a third for the shareholder, and a third for UPS.\n\nSo we have not seen any demand destruction at this point because value is defined by what the customer is willing to pay for, and service matters.\n\nBrian Newman -- Chief Financial Officer\n\nI'll pick up the second part of the question in terms of the pension, and Carol alluded to it in early answer this morning that rates are moving. And pension in '23, it's going to be determined by discount rates and asset performance actually on December 31. So it's too early to get into specifics, but I think the gist of your question is if the year ended today, I would expect higher discount rates, would actually reduce service costs and increase off profit in the domestic business above the line. But that's unfortunately going to be probably more than offset by higher interest expense and lower pension income below the line.\n\nSo I think net-net, in the P&L, it will be a net headwind, some favorability above the line, offset by some headwinds below the line.\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question will come from the line of Ravi Shanker of Morgan Stanley. Please go ahead.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nThanks. Morning, everyone. A couple of questions on peak. I think you mentioned the kind of 4Q volume decline is due to some contractual agreements with enterprise customers.\n\nI think you said that in 3Q as well. Can you detail that a little bit more and maybe kind of what the kind of Amazon run rate looks like by the time you exit the year? And also just broadly on peak, why are you -- why is your peak season hiring flat when volumes are lower and your -- and then you have more automation than last year? We've seen some other kind of peak season hiring kind of be materially lower, so kind of maybe some rationale there would be great.\n\nCarol Tome -- Chief Executive Officer\n\nSo, first, on peak volume, if you go over last year, it is the easy way to think about it, between Q3 and Q4, the volume grew 25%. And then obviously, during the peak time, which is Thanksgiving through Christmas, it's even higher than that. As we look to this year, we expect to see the similar surge Q3 to Q4, but maybe more in the 24% area. Why? Because we have, as we shared with you, reached agreement with our largest customer about the volume that we will take into our network and the volume that they will deliver.\n\nSo it's just a function of that contractual arrangement. And what that does for us, actually, it gives us room to invite additional customers into our network and give them great service during peak, which we are doing. In terms of the hiring question, Ravi, there is turnover in the numbers because we don't keep everybody that we hire. It's also just a nice round number, so I wouldn't read anything into that, other than it's just a nice round number.\n\nWhat I'm super pleased about is how we've changed some of our processes to make it easier to hire people into UPS for peak. For example, we have a QR code. If you open up the QR code on your phone, you can apply for a job and get a job offer in less than 30 minutes. That's way cool.\n\nWe have shortened the time it takes to onboard a driver into our company. Last year, it was eight weeks. This year, it's 11 days. That's way cool.\n\nWe really put the pedal to the metal on our social messaging, if you will, our social campaign. So by amplifying our social messages, we saw that we had 1.4 million impressions in the month of September. That's up 60% year on year. We had a very successful October job fest, and Brown Friday is coming up on November 4.\n\nWe're really excited about Brown Friday. Last year, we had 85,000 applications on Brown Friday. So we're expecting a similar amount this year. So we are ahead of where we were a year ago on the hiring front, feeling very good because we've got to get a lot of people in to manage the surge.\n\nBrian, do you want to add something?\n\nBrian Newman -- Chief Financial Officer\n\nI would just add, Carol, Ravi, we're sort of executing the play. We had called -- we had guided what does it mean at the bottom line, an 11.6% full year, and that was an 11.6% 1H and 11.6% 2H. We're actually delivered the first half of the year. Obviously, a lot of changes in dynamics in the market, but we're on track to deliver an 11.7% in the back half of the year.\n\nSo net-net, Ravi, I think we're delivering what we said we would do, slightly different playbook in terms of volume price cost. But at the end of the day, executing on those contracts. It was part of the original plan.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nOur next question will come from the line of Jordan Alliger of Goldman Sachs. Please go ahead.\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nYeah, hi. Just sort of curious on peak. I know you mentioned higher ships or maybe back toward December. Sort of what gives you confidence in that? And does that sort of imply that maybe things have started a little slower, but you're hearing from your customers that it's going to do that shift back to sort of traditional patterns -- pre-COVID patterns?\n\nCarol Tome -- Chief Executive Officer\n\nRemember last year when there were all these supply chain dams, and inventory was at very low levels, everyone was saying shop early, shop early, shop early. So we just believe that the inventory levels are in much better shape than they were a year ago. So we're going to return to a more normalized shopping pattern for peak. And if we can just talk about the tone of business, the current business, here it is, it's almost Halloween, October was good.\n\nBrian Newman -- Chief Financial Officer\n\nYes. We've got an extra delivery day, Jordan, in December, so feeling good. We expect the peak to be a little bit later, and we're ready for it.\n\nOperator\n\nOur next question will come from the line of Todd Fowler of KeyBanc Capital Markets.\n\nTodd Fowler -- KeyBanc Capital Markets -- Analyst\n\nGreat. So, Carol, in your prepared remarks, you talked about logistics as a service. And I was just curious if you could expand a little bit on that and kind of how you see that unfolding and if there's any external benchmarks that we should be looking at to kind of mark the progress on that.\n\nCarol Tome -- Chief Executive Officer\n\nSo we're building logistics as a service, and it's very early days, but it includes components of what we've talked to you about in the past. One of the pillars of logistics as a service is improving delivery density. And as you know, we've been partnering with CommerceHub to go upstream in the cart to improve delivery density with our live used case. It's going very well, so we're adding additional customers on to that platform.\n\nThe second pillar of logistics as a service is improving visibility end to end. And we've talked to you about this in the past. I think we called it Project Evolve or Project Symphony, but it really is providing visibility from the manufacturer all the way to the end distribution point; so that's part of logistics as a service. The third pillar is providing financial solutions.\n\nWe do that today through UPS Capital, where we had a very robust insurance product. We're looking at adding some additional financial products to that filler. We then move to, I will say, advanced capabilities, which is including technology to help you understand how to optimize your supply chain, the warehousing fulfillment, or shipping. And then lastly, while we have a very good returns business, we think we could have a robust reverse logistics business, and all of this will be powered by technology.\n\nSo the way to measure this in the future will be in a number of different ways. But basically, this is going to create new revenue streams for us. So as we build this out, we will put these new revenue streams into our plans, and then we will share those with you. And then you can hold us accountable to those plans.\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nOur next question will come from the line of David Vernon of Bernstein. Please go ahead.\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nGreat. Thanks, and good morning. Two quick ones for me. Brian, you mentioned, you quantified the productivity tailwind sort of accelerating into the fourth quarter.\n\nShould we be expecting that same sort of order of magnitude productivity on the domestic side as we go through the next couple of quarters here, as you annualize the impact of the total service plan and the RFID tracking and that kind of stuff? Just wondering whether how much of that is sensitive to overall volume levels or should we expect that same sort of dollar value on productivity in the first half of next year. And then with respect to the union agreements you guys have reached with the pilots and the machinists, can you talk a little bit about kind of the level of adjustments that were made there and whether there's any read across to the broader negotiation for next year?\n\nBrian Newman -- Chief Financial Officer\n\nHappy to take the cost question. So look, the momentum with Nando and the team, they're really just getting started. We saw CPP growth about 20 -- about double digit in the first half. That will be high single digit in the second half of the year.\n\nWe would probably expect to see that trajectory continue to next year. I don't want to get ahead of my skis, though, so we'll come out at the end of the fourth quarter and give you some guidance for RPP and CPP for next year.\n\nCarol Tome -- Chief Executive Officer\n\nWe were pleased with the contract extensions that we had both with our pilots, as well as our aviation mechanics. The terms of those contract extensions were in line with the longer-term financial plans that we had already built, so we felt very good about that. But more importantly, with the percentage of the UPSers who voted in favor of the contract extension, I was delighted with that. It exceeded our expectations, and it speaks volumes to the relationships that we have with our employees and the fact that these are really great jobs.\n\nSo the only read-through to the upcoming Teamsters contract negotiation would be that we've got a great relationship with our employees, and these are great jobs.\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nAll right. Thanks for the time.\n\nCarol Tome -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question will come from the line of Bruce Chan of Stifel. Please go ahead.\n\nBruce Chan -- Stifel Financial Corp. -- Analyst\n\nHi. Good morning, everyone, and thanks, operator. Just want to touch on equipment and capacity quickly. Brian, you mentioned higher maintenance costs.\n\nIs that just a function of inflation? Or is that fleet age, too? And if it's fleet age, when do you think that starts to normalize? And then maybe just to follow up quickly on the aircraft fleet side. You had some other providers out there that are looking to reduce capacity. Any plans for you to do the same as we look at reducing in '23? Thank you.\n\nBrian Newman -- Chief Financial Officer\n\nSo from a maintenance perspective, we've actually gone to a very systematic, programmatic approach and gone out with multiyear. On the airline, for example, we now have a 10-year maintenance program to manage the fleet age of the equipment. It is going up in terms of age. And we factor that in on more of a normalized run rate over the next decade.\n\nBruce Chan -- Stifel Financial Corp. -- Analyst\n\nOK. And then just as far as capacity on the fleet side, any plans to reduce or you're going to keep things fairly static?\n\nBrian Newman -- Chief Financial Officer\n\nSo right now, we announced some recent acquisitions with Boeing, and so we have the next several years outlined. We'll remain fluid on that as we track volumes and shift the aircraft around.\n\nCarol Tome -- Chief Executive Officer\n\nI guess part of the advantage of having an aging fleet is that we can retire, if need be.\n\nBrian Newman -- Chief Financial Officer\n\nThat's right.\n\nCarol Tome -- Chief Executive Officer\n\nBut the best news is actually replacing the aircraft with better energy-efficient aircraft and more -- and actually take our cost down.\n\nBrian Newman -- Chief Financial Officer\n\nAs we set down some of the MD11s from a sustainability standpoint, that's a positive thing. And from an operating -- productivity standpoint, that's also a positive thing. So that's part of the overall strategy that we've run over the next 10 years. And, Stephen, we have time for one more question.\n\nOperator\n\nOur final question will come from the line of Stephanie Moore of Jefferies. Please go ahead.\n\nStephanie Moore -- Jefferies -- Analyst\n\nHi. Good morning. Thank you. I wanted to touch on the upstream delivery density pilot, Carol, that you mentioned.\n\nMaybe if you could share any KPIs from that pilot, what you saw that gave you confidence to expand it with other customers, and kind of what we should be looking for in terms of the eventual rollout of that platform.\n\nCarol Tome -- Chief Executive Officer\n\nYes. So it's still early days, Stephanie, but we're pleased with what we're seeing. We were in pilot, then we went live with one of our customers, and we started to see good matches. But to get that one-tenth improvement in delivery density, you really need a 5% match.\n\nAnd we weren't seeing 5%. So what we just did is we increased the whole time. We had been holding the orders in the cart for an hour. We increased the whole time to six hours.\n\nAnd now we're starting to see it creep up to that 5% match. That's cool because the 5% match, then if you translate it out to our opportunity set, that's a one-tenth improvement in delivery density, which is a $300 million value unlock. So early, early days, but really like what we're seeing.\n\nKen Cook -- Investor Relations Officer\n\nExcellent. All right. Well, thanks, everybody, for joining us today. We look forward to talking to you all next quarter, and that concludes our call.\n\nDuration: 0 minutes\n\nKen Cook -- Investor Relations Officer\n\nCarol Tome -- Chief Executive Officer\n\nBrian Newman -- Chief Financial Officer\n\nAllison Poliniak -- Wells Fargo Securities -- Analyst\n\nAmit Mehrotra -- Deutsche Bank -- Analyst\n\nChris Wetherbee -- Citi -- Analyst\n\nNando Cesarone -- Executive Vice President and President, US\n\nKate Gutmann -- Executive Vice President and President of International, Healthcare, and Supply Chain Solutions\n\nTom Wadewitz -- UBS -- Analyst\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nTodd Fowler -- KeyBanc Capital Markets -- Analyst\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nBruce Chan -- Stifel Financial Corp. -- Analyst\n\nStephanie Moore -- Jefferies -- Analyst\n\nMore UPS analysis\n\nAll earnings call transcripts"
}