{
  "companyName": "Mission Produce, Inc.",
  "companyTicker": "AVO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/09/mission-produce-inc-avo-q3-2022-earnings-call-tran/",
  "content": "Mission Produce, Inc. (AVO -1.11%)\nQ3 2022 Earnings Call\nSep 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Mission Produce fiscal third quarter 2022 conference call. All participants are in a listen-only mode. After today's presentation, there will be an opportunity to ask questions. Please also note today's event is being recorded.\n\nAt this time, I'd like to turn the conference call over to Jeff Sonnek, investor relations at ICR. Sir, please go ahead.\n\nJeff Sonnek -- Investor Relations\n\nThank you, and good afternoon. Today's presentation will be hosted by Steve Barnard, chief executive officer; and Bryan Giles, chief financial officer. The comments during today's call and the accompanying presentation contain forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical facts are considered forward-looking statements.\n\nThese statements are based on management's current expectations and beliefs, as well as a number of assumptions concerning future events. Such forward-looking statements are subject to known and unknown risks and uncertainties that could cause actual results to differ materially from the results discussed in the forward-looking statements. Some of these risks and uncertainties are identified and discussed in the company's filings with the SEC. We'll also refer to certain non-GAAP financial measures today.\n\nPlease refer to the tables included in the earnings release, which can be found on the Investor Relations website, investors.missionproduce.com, for reconciliations of non-GAAP financial measures to their most directly comparable GAAP measures. With that, I'd now like to turn the call over to Steve Barnard, CEO.\n\nSteve Barnard -- Chief Executive Officer\n\nThank you for joining us for our fiscal 2022 third-quarter earnings call. We produced strong revenue growth at 27% to $313.2 million, and we generated $31.6 million in adjusted EBIDTA for the third quarter, which was supported by sustained strength in pricing amid a lower industry supply backdrop. Additionally, our per-unit margins performed well in the third quarter, which have remained at the high end of normal historical ranges and demonstrates the flexibility of our diversified global sourcing platform. Even in periods where we experienced volatility from the large Mexican-sourced market and capacity absorption headwinds that we are incurring from our new Laredo facility.\n\nOn the Laredo point, we continue to feel great about the flexibility that this 261,000-square-foot mega facility will provide us in the future to drive volume efficiency throughout North American markets. We made substantial investments in our network over the past several years, including Laredo, and we feel great about the capacity we have in place to support our anticipated growth over the next several years. While we've been absorbing those incremental overhead costs over the past year, they are largely fixed and have stabilized, which provides us with an opportunity to leverage those investments as utilization rates improve and we move more volume through the facility. To that end, earlier this week, we announced a long-term third-party logistics partnership with NatureSweet, which is one of the largest growers and marketers of tomatoes, bell peppers, and cucumbers in North America.\n\nGiven the size and scale of our business, Mission is uniquely positioned to offer 3PL services that streamline operations and create logistical efficiencies for complementary products. This 3PL deal will leverage our state-of-the-art Laredo forward distribution center in Texas to handle approximately 70% of their Mexican volume that's destined for the Southwest, Midwest, and Eastern regions of the United States. We designed our Laredo mega facility to serve as a major hub for U.S. avocado imports.\n\nAnd we are leveraging the facility size and advanced technology to drive volume and generate additional revenue through synergistic partnerships with produce importers. While enabling those partners to benefit from economies of scale, this business model allows us to maximize utilization of the facility, especially in times of lower avocado supply. And speaking of supply, the ongoing inconsistency of Mexican supply continued during the third quarter. And the harvest ended more abruptly than what we expected.\n\nFor context, only about one-third of U.S.-distributed volume was Mexican fruit in the fiscal third quarter. Nonetheless, we were very well-positioned to fill the gap with alternate sources such as California, which was especially strong, and our own Peru production and other emerging global source markets such as Colombia. As compared to the prior year, our Mexican volume was down over 40% in the third quarter. But by leveraging our global sourcing advantages, we offset the vast majority of this shortage by generating over 25% volume growth in other source markets, much of which we own.\n\nWith respect to Mexico, we are looking forward to the production from the Jalisco growing region this coming season, which, on a relative basis, is about 10% to 15% the size of Michoacan's annual production but one that presents an opportunity for long-term growth with younger plantations and more organized and sophisticated operators. Mission immediately capitalized on the opportunity to import Jalisco fruit following the recent USDA certification for that fruit's entry into the U.S. market. It is a region we know well, having established a presence there with some of the largest regional growers and packers in 2009 to service other global export markets.\n\nAside from the additional volume to the large U.S. market, Jalisco provides other important benefits, including the high-quality fruit and serving as an alternate supply to fill gaps during the season, complementing our already existing source from Michoacan very nicely. This product will also go through our Laredo facility, where we can ripe and bag and go straight to our customers. While Mission's global footprint provides sourcing advantages relative to the industry as a whole, there are not enough ample sources of fruit available to meaningfully offset the impact of the Mexican supply shortages.\n\nThis resulted in persistently high pricing this year, which were approximately 45% higher year to date versus the prior year. Despite these higher prices, we remain encouraged by the resilient demand in the core U.S. market. Food inflation has been intense, and yet consumers are continuing to consume avocados on a regular basis, which speaks to the broader health and wellness trends that underpin the avocado industry, elevating the avocado to a must-have staple in many households.\n\nOur goal is to access globally with consistent year-round supply. This is the key to supporting long-term consumption growth and is the catalyst to drive new market development. Mission has played a critical role in the industry's growth. It has required foresight and a constant focus on continuously assessing opportunities to optimize our sourcing capabilities with third-party growers, as well as investing in our own farms to ensure that we can control the quality and supply that our customers have come to expect.\n\nTo this end, I'm excited to have Tim Bulow, our new president and chief operating officer, join our executive team in August. Tim is a versatile and results-driven executive who has a great appreciation for global commerce and the development of new growth markets through his 30-year career working for large, multinational enterprises. With Tim's operational and commercial expertise, I'm confident that we will expand upon our industry-leading market share and meet our long-term strategic growth plans. Our strategy is to invest in vertical integration.\n\nThat's proven to be an unparalleled competitive advantage. Specifically, our own Peruvian production gives us reliable access to fruit to meet customer needs on a scale and at volumes that only Mission can deliver. In fact, approximately 25% of our total distributed volume in the third quarter was from our own production. Our Peruvian farming operations are performing well this season, and we expect to produce approximately 15% more volume than what we achieved in fiscal 2021.\n\nAs of the end of the third quarter, we distributed about one-third of the season's harvest, with the balance of the harvest being sold primarily in the fiscal fourth quarter. Reliable access to our own fruit during the transitional Mexican season and the ability to commit to long-term programs with retailers and foodservice customers demonstrates the strategic advantages we have over our competitors. In summary, Mission continues to be in a great position with strategic assets to provide value-added supply and services to our customers. We are focused on our long-term strategy of generating consistent growth and enhancing market share by increasing capabilities and capacities while continuing to adapt to industry dynamics.\n\nWe're excited about what's ahead and believe we have an undisputed advantage that will drive sustainable long-term shareholder value. With that, I'll pass the call over to our CFO, Bryan Giles, for his financial commentary.\n\nBryan Giles -- Chief Financial Officer\n\nThank you, Steve, and good afternoon to everyone on the call. I'll start with a brief review of our fiscal third-quarter performance ended July 31st, 2022 and touch on some of the drivers within our three reportable segments. Then I'll provide a snapshot of our financial position and conclude with some thoughts on some of the current industry conditions that we are seeing. Total revenue for the third quarter of fiscal 2022 increased 27% to $313.2 million.\n\nGrowth was driven by a 42% increase in average per-unit avocado sales prices due to lower industry supply out of Mexico following a smaller Mexican harvest, as well as inflationary pressures. As a result of the smaller industry harvest, avocado volume sold decreased 11%. Domestic volumes declined 6%, which was a lower rate relative to export markets during this period, demonstrating the resiliency of demand for avocados amid higher price points in the U.S. market.\n\nThird-quarter gross profit increased $1.7 million or 4% compared to the same period last year to $42.6 million, and gross profit percentage decreased 300 basis points to 13.6% of revenue. The increase in gross profit was primarily driven by higher per-unit margins during the quarter. Strength in margin was partially offset by the impact of lower avocado volume sold and its related impact on fixed cost absorption in our marketing and distribution segment. Gross profit in the international farming segment was essentially flat with the prior year, and I'll discuss these dynamics later in my remarks.\n\nThe lower gross profit percentage was driven by higher per-unit sales prices as per-unit margin represents a lower proportion of the sales value. Margin is primarily managed on a per-unit basis in our marketing and distribution segment, which can lead to significant movement in gross profit percentage when sales prices fluctuate. SG&A for the third quarter increased $3.4 million to $20.6 million due primarily to higher employee-related costs, driven by higher stock-based compensation expense and labor inflation, as well as noncapitalizable costs associated with the implementation of our new ERP system in our marketing and distribution segment. Additionally, we realized the $0.5 million impact in the third quarter to SG&A from the consolidation of Moruga, which is our Peruvian blueberry operation that I'll speak to in a moment.\n\nAnd finally, I'd note that in the prior-year period, we recorded a gain on insurance settlement that influences the year-over-year changes. The noncomparable items I just noted account for approximately $3 million of the year-over-year increase, which isolates labor inflation as the primary item that drove an approximate 2% increase on a normalized basis versus the prior year. Net income for the third quarter of fiscal 2022 was $18.4 million or $0.26 per diluted share, which was essentially flat with the prior-year period. Similarly, adjusted net income for the third quarter of fiscal 2022 was consistent with the prior year at $18.9 million or $0.27 per diluted share.\n\nAdjusted EBITDA increased 5% to $31.6 million for the third quarter of fiscal 2022. The drivers of the increase are similar to those of gross margin, with higher per-unit gross margins being partially offset by the impact of lower avocado volume sold. In terms of our segments, I want to point out a change in our segment presentation, which now includes a third reportable segment titled Blueberries. On May 1st, 2022, we obtained a controlling interest in Moruga, which is an entity that farms blueberries in Peru, for which we own a 60% equity interest.\n\nFollowing this event, Moruga was prospectively consolidated into our results of operations and was the basis for the new reportable segment. I'd simply note that the integrity of the prevailing marketing and distribution segment and the international farming segment remain intact. Prior to the third quarter, Moruga was accounted for under the equity method as an investment and, as such, did not impact sales or adjusted EBITA. With that, our marketing and distribution segment net sales increased 29% to $308.9 million for the quarter, and segment adjusted EBIDTA was $15.5 million, an 18% increase from prior year.\n\nThe drivers for the marketing and distribution segment are similar to those that I described for the consolidated results. Our international farming segment primarily represents our own farms that we manage in Peru. Substantially, all sales of fruit from the international farm segment are to the marketing and distribution segment, with the remainder of revenue largely derived from services provided to third parties in the blueberry segment. Affiliated sales are concentrated in the second half of the fiscal year in alignment with the Peruvian avocado harvest season, which typically runs from April through August of each year.\n\nAnd as a result, you see the international farming segment emerge in the third and fourth quarters and contribute to adjusted EBITDA in a significant fashion. So, with this in mind, total segment sales in the international farming segment decreased $1.5 million or 2% for the quarter compared to the same period last year due primarily to lower third-party service revenue. Affiliated sales were slightly higher due to increase in avocado volume harvested and sold. Segment affiliated sales reflects the consideration returned to the international farming segment, net of logistics costs, the most significant of which is ocean freight.\n\nThe higher average per-unit pricing that was realized in the third quarter was offset by these higher logistics costs. Segment adjusted EBITDA was $16.3 million, a 4% decrease from prior year primarily due to inflationary pressures on input costs in our farming and packing operations in Peru. Our new blueberry segment reflects the results of Moruga's farming activities, which includes cultivating early stage blueberry plantings and harvesting mature bushes. Although relatively small in size, the blueberry harvesting season is asynchronous with the avocado harvesting season, allowing us to leverage our resources in Peru during the off season for avocados.\n\nSales in our blueberry segment are concentrated in the first and fourth quarters of our fiscal year, in alignment with the Peruvian blueberry harvest season, which typically runs from July through January. I'd also note that the product is marketed globally by our partner in the Moruga joint venture. For the third quarter, our blueberry segment net sales were $0.3 million, and segment adjusted EBITDA loss was $0.2 million. Shifting to our financial position, cash and cash equivalents were $43.8 million as of July 31st, 2022, compared to $84.5 million as of October 31st, 2021.\n\nThe company's operating cash flows are seasonal in nature and can be temporarily influenced by working capital shifts resulting from varying payment terms to growers in different source regions and prevailing market prices. In addition, the company is building its growing crops inventory in its international farming segment during the first half of the year for ultimate harvest and sale that will occur during the second half of the fiscal year. Thus, when looking at operating cash flow on a three-month period for the fiscal third quarter, we generated approximately $34 million in operating cash. However, on a year-to-date basis, given the seasonal nature of our working capital, net cash used in operating activities was $3 million for the first nine months of fiscal 2022, compared to cash provided of 15.2 million in the same period last year.\n\nThe $18.2 million change versus prior year reflects lower net income in fiscal 2022, primarily offset by favorable change in working capital year over year. Within working capital, the favorable change in grower payables was partially offset by unfavorable changes in inventory and accounts receivable. Changes in grower payables and accounts receivable were due to increases in per-unit fruit pricing compared to prior year. Changes in inventory were due to increased per-unit value of fruit on hand in North America and higher growing crop inventory in Peru, driven by inflationary pressures on farming costs and additional productive acreage compared to last year.\n\nCapital expenditures were $42 million for the first nine months of fiscal 2022, compared to $61.3 million in the same period last year. Current-year expenditures were concentrated in the purchase of farmland in Peru, as well as land improvements and orchard development in Peru and Guatemala. Capital expenditures within our marketing and distribution segment are much lower following the completion of our Laredo facility in the prior year. On a full-year basis for fiscal 2022, we expect to come in below full-year 2021 spend of approximately $73 million.\n\nIn regards to our near-term outlook, we are providing some context around our expectations for industry conditions and production from our own farms to help inform your modeling assumptions. The industry is expecting fourth-quarter volumes to increase sequentially primarily due to ample Peruvian product in the supply chain and the transition to the new Mexican crop, which is expected to be larger than the prior year. With this expectation for improving volumes, we believe that the pricing environment should continue to soften during the fiscal fourth quarter. We expect avocado production volumes from our own farms in the range of 110 million to 120 million pounds for the full harvest season, of which approximately 38 million pounds was sold through as of the end of our fiscal third quarter.\n\nThis compares to 101 million pounds for the full harvest season in fiscal 2021. We continue to battle the same inflationary pressures that have been well-documented. These include freight, labor, and packaging costs, among others, which, in a lower volume environment, creates additional headwinds to our ability to drive higher per-unit margins and adjusted EBITDA. That concludes our prepared remarks.\n\nOperator, now over to you. Please open the call to Q&A.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] Thank you. Our first question comes from Ben Bienvenu with Stephens.\n\nPlease proceed with your question.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nHey. Thanks. Good afternoon. I was hoping to put a finer point on your commentary around volumes in the fourth quarter.\n\nYou said higher sequentially. Should our inference be that's lower year over year or higher year over year but higher sequentially? Just to put a finer range on things if that's possible.\n\nSteve Barnard -- Chief Executive Officer\n\nYou know, at this point, we don't have a specific number that we've communicated. What I would say is that we generated about -- we had about 6 million leg equivalents, and I apologize for speaking in legs as opposed to pounds, but roughly 6 million leg equivalents that we sold during Q3. We did roughly 6.3 million legs last year during Q4. So, there wasn't a big gap from that perspective.\n\nWe do expect to be higher in Q4 than in Q3, probably numbers that aren't too far off from what we saw in Q4 last year, probably a comparable year-over-year numbers.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. Fair enough. And then thinking about the International Farming business, the volumes are quite strong. When we think about pricing, I know you, guys, price a portion of that earlier in the year.\n\nHow should we think about the exposure of that business in the fourth quarter, the volume there to market pricing versus prices you might have locked in earlier in the year\n\nSteve Barnard -- Chief Executive Officer\n\nWell, I'll take the first shot again. We locked up as many retailers as we could on a fixed volume, fixed price for the entire season, which includes the fourth quarter. So, there's a little bit of pressure on the market today or this week with a little more Mexican fruit coming in. But so far, everyone's sticking to their guns and doing what they said they do.\n\nWe do remind them that they were getting a heck of a deal about 90 days ago. And it's worked out well for them. They've had great movement. And I think -- it's steady as she goes as far as we can tell from this side of it at least for the Peruvian fruit.\n\nBryan Giles -- Chief Financial Officer\n\nYeah. I would kind of agree with that, Ben. Certainly, with these program sales that we put in place with our customers, we weren't necessarily selling Peruvian fruit in Q3 at what you'd consider like a spot market rate because we knew we were negotiating with these customers to sell over the entire season, and we wanted to make sure we had a home for all the fruit. So, whereas you may have seen pricing in our Peruvian product, it was maybe a little bit lower than, let's say, Mexico, California was selling spot marketing in Q3.\n\nI think that you would -- that gap is going to be much smaller in Q4 because even as that market price declines, our prices should hold up relatively stable. To your point, it's not all sold through on long-term contracts and the portions of that fruit that are sold in the spot market will likely be lower in Q4 than they were in Q3. Most certainly, I think we are expecting kind of lower average sell-through prices in Q4 than what we saw in Q3.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. And then one more if I could. Just thinking about this 3PL relationship that you have through your Laredo facility, how much of the kind of slack capacity in that facility does that arrangement shop up? And are there other opportunities that you all have to maximize that capacity utilization of that asset as we think about kind of other periods of the year?\n\nSteve Barnard -- Chief Executive Officer\n\nWell, we're kind of taking them one step at a time. This is a pretty substantial volume we're talking about on these tomatoes and cucumbers and whatnot. On a year-round basis, it's pretty consistent throughout the entire year. So, what we hope to do is not only leverage our facility, but our personnel and one of the things right around the corner is the logistics side of it because we compare customers -- customer list, a lot of them are the same.\n\nSo, I think we'll be able to synergize on freight down the road also. So, we're going to start with basically the transfers and then build from there.\n\nBryan Giles -- Chief Financial Officer\n\nYeah, Ben. I think this is absolutely going to help in the near term. I think that this business is going to need to ramp up a little bit over time. It's not going to start at full capacity from Day 1.\n\nI think there's real strong opportunities here over the course of the next year to build this up. But on Day 1, it is going to consume some of that flat capacity that we have in that facility today. If I had to guess, maybe it's 20% to 25% of the capacity, particularly in like cross-stocking and the docking area. I think that, again, I'd remind everybody that the long-term purpose facility is to support the growing Mexico supply of avocados that we see happening over the long haul.\n\nThis year, we were down. I think we know it's well documented across the industry, but we don't -- when we look at that, it doesn't take away from the fact that we expect Mexico to still be a strong contributor to the overall supply of avocados that are consumed here in the U.S., and this facility keeps us well-positioned for that.\n\nSteve Barnard -- Chief Executive Officer\n\nAnd that opening of [Inaudible] will help, too, because that product will go through there also.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nGot it. Got it. OK. Thanks so much.\n\nSteve Barnard -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. [Operator instructions] Our next question is from Tom Palmer with J.P. Morgan. Please proceed with your question.\n\nTom Palmer -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for the question. I wanted to ask -- I know it's a little early to think about next fiscal year, but we are approaching it. How do you think about volume growth when you're lapping a challenging supply year? How do you plan for your business? Do you think about just returning to your target high single-digit total sales growth, which is really volume-driven? So, you're kind of approaching high single-digit volume growth a year, and that's what you planned for.\n\nOr when you're lapping such a challenging year such as this, do you kind of inherently assume you get a little bit extra because of the catch-up?\n\nSteve Barnard -- Chief Executive Officer\n\nWell, on the volume side of it, the Mexican crop is expected to be up. I can't give you an exact percentage because I don't know, but it's going to be higher than it has been this past year. And then when you look at say the Peruvian crop, a lot of those trees are younger trees, they haven't bloomed yet or some of the earlier mains are just starting blooming. So, it's hard to tell what the crop will be, but the trees will be bigger.\n\nSo, generally, you would think the crop will be larger there also. So, too early to tell, but that's looking at history and looking at how the Mexican crop looks and what we know about Peru, it should be a higher number.\n\nBryan Giles -- Chief Financial Officer\n\nYeah, I would agree with that, Tom. I would say that Mexico is going to be the big driver here. I mean, historically, it's provided 65% to 70% of the fruit that we've sold. So, when Mexico moves, Mission moves, the whole industry moves.\n\nWe are -- the data we're seeing so far would indicate that the crop is going to be much larger next year than it was this year. I don't know, to Steve's point, an exact percentage on that, but our volume growth is going to be driven by the fact that there's going to be a greater supply of fruit out there. What that means on top line revenue is, a lot of it will depend on how the additional volume, what that does to average selling prices. We know this year, a year where supply was constrained, prices reached record levels, and we're seeing revenues that are higher than we've ever seen historically.\n\nSo, certainly, the higher volumes are going to have an impact in the other direction, the extent to which we don't yet know.\n\nTom Palmer -- JPMorgan Chase and Company -- Analyst\n\nUnderstood. Thank you for that. And then I wanted to ask on the blueberry side. I noticed in the Q, it looks like a pretty substantial build-out over the next few years in terms of acreage more than doubling it.\n\nHow do you think about returns for blueberries compared to similar investments you're making in your farming operations? And then is the grow-out period quicker and so you get perhaps a faster return on those investments?\n\nSteve Barnard -- Chief Executive Officer\n\nSure. I'll take a stab at this one, Tom. I'll start with the second part of your question. Absolutely, the return is faster on blueberries than it is on avocados.\n\nGenerally, a lot of these plants are grown in pots ahead of time, so -- and then put in the ground. So, you can develop them in the nursery. And from the time you get them in the ground, you can start having a crop with a decent-size crop within one to two years of planting, like avocados, it may take four to five years. So, it definitely comes to market quicker.\n\nCertainly, we evaluate the ROI on these types of projects. And we look at it as having a return that's comparable to what we'd be looking at and investing in avocado farming. Certainly, with blueberries, we would likely expect a slightly higher return from the standpoint that we're not marketing the fruit like we do with avocados. So, on that side, we're making money not only on the farming of the fruit, but on the sell-through as well.\n\nWith the blueberries, our partner in the JV is actually marketing the fruit. So, it really is just looking at a farming asset but there are a lot of other costs down in Peru that are leveraged through our Blueberry operation because of being in a different time of the year, whether it be labor, whether it be facilities. So, there are advantages that we benefit from by having this production in place. And I think we're excited about what we think it will deliver to the bottom line going forward.\n\nTom Palmer -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you. And then just any idea of -- I see the total capital cost is about $50 million. Is that mainly going to be based on partner contributions? Or I don't think there's a kind of cash out from the business.\n\nSteve Barnard -- Chief Executive Officer\n\nYeah. I mean, our expectation is that most of that's going to be funded through operating cash flows within the joint venture itself. I mean, with the 360-some-odd hectares that we already have planted today that are in a mature production. We're generating strong cash flow from that operation.\n\nAnd over the next couple of years, which we'll be doing these planning, that's where the majority of the funding is going to come from. The balance will come from partner contributions of which we'll be providing 60% of those. But we don't -- we view that number to be a small fraction of the $50 million.\n\nTom Palmer -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you for all the detail.\n\nSteve Barnard -- Chief Executive Officer\n\nYou're very welcome.\n\nOperator\n\nThank you. Our final question will be from Gerry Sweeney with ROTH Capital. Please proceed with your question.\n\nGerry Sweeney -- ROTH Capital Partners -- Analyst\n\nHi. Good afternoon. Thanks for taking my call. Just start with the -- with Mexico and Laredo.\n\nAnd granted, there's probably a ton of variables in this question, but just trying to frame it out a little bit. But if you look at Laredo, the size of the facility, it's built for the future. How big does the Mexico harvest have to be to really start to sort of leverage that facility? And granted, I know you have Jalisco, and you're not taking -- there's going to be variables as to how much of that fruit you get. But I think there is some type of relationship there and I was just curious as to what it may be.\n\nSteve Barnard -- Chief Executive Officer\n\nWe did build it for the future. There's no question about that because I'm glad we did it then looking at the cost of things to build today. But I think between some outside third-party logistics, such as we've just talked about, and then Jalisco opening up, that will help and improve volume coming across on the avocado space. I think it will also add efficiencies, as I said, where we can hopefully minimize a step or a stop or a leg on the transportation going forward by being able to ripen and bag or do whatever you're going to do right there in Laredo or straight into a customer rather than stop at another distribution center.\n\nSo, the volume, I think, will continue to increase year-to-year. Not quite sure what the crop in Mexico is yet or what to expect, but the demand continues to be good. So, I think as soon as Peru gets out of the way here in a few weeks, that volume should pick up substantially going through Laredo.\n\nBryan Giles -- Chief Financial Officer\n\nAnd, Gerry, I'd supplement that with -- certainly, there's peak times of the year when Mexico products coming across the border that probably runs from kind of January leading up to the Super Bowl through maybe late April, clearly that with Cinco de Mayo. So, we've certainly designed capacity around of that facility to be able to handle volumes that kind of come off within that window. And we know that at other times of the year, we're going to be looking for 3PL opportunities like this NatureSweet one to be able to kind of fill up capacity in that facility. I would say today, I don't have a precise number as to what that volume needs to get to during those times of the year to where we're running at peak capacity.\n\nBut I can say that we have ample room for growth at this point. I will also say, though, that that facility is set up in a way to backfill our capacity at our other distribution centers throughout North America. So, utilizing, particularly with Mexican fruit, which is running year-round, utilizing that fruit to hold fruit at the border as opposed to, in the old days, having to make decisions immediately when we only had a cross-stocking facility. It enables us to kind of delay making decisions on where that fruit goes and supplement capacity at those other locations.\n\nAnd I think you can kind of see some of that in how our capex and our marketing and distribution has come off as much as it has this year, kind of that lack of need to continue building out our North American infrastructure.\n\nGerry Sweeney -- ROTH Capital Partners -- Analyst\n\nGot it. No, it gives you some more flexibility as to where to send the fruit and why and which -- got it. Speaking about the additional infrastructure, is there an opportunity on the -- with NatureSweet to use any of your other facilities? Or is this specifically for Laredo?\n\nSteve Barnard -- Chief Executive Officer\n\nWell, it's primarily for Laredo. They have talked about utilizing some other ones in strategic locations, probably not all of them but possibly the Pacific Northwest where they need to be there more just in time and inventory some product there. So, I think there's some more opportunities down the road as we get in and learn about each other's business.\n\nGerry Sweeney -- ROTH Capital Partners -- Analyst\n\nGot it. And then switching gears to the international side. It sounds as though the good grew harvest. Just curious as to how much of that was acres coming on trees maturing versus maybe just a good or better crop year over year? And I guess what I'm really trying to get at is, obviously, you do have more acreage coming on, and I think you're expecting 110 million to 120 million pounds out of Peru.\n\nWhat that could be as some of these acres mature over the next -- how many years?\n\nSteve Barnard -- Chief Executive Officer\n\nYeah. Well, I don't know the exact acreage that is not mature compared to mature.\n\nBryan Giles -- Chief Financial Officer\n\nYeah. Maybe I can --\n\nSteve Barnard -- Chief Executive Officer\n\nYeah. Bryan [Inaudible] because he's depreciating it.\n\nBryan Giles -- Chief Financial Officer\n\nYeah. We had a little more acreage that came into production this year up at our Northern crew farms. Most of it in the southern area [Inaudible] was already in what we'd consider production. But we did have a small amount up north that came in this year.\n\nMost of the improvement in production though was driven by yields per hectare. I think that we saw numbers that looking at the overall production that we're estimating provided by the kind of the acreage is in production, we're probably going to see yields of around 18,000 kilos per hectare this year, so which -- that's continuing to climb from -- I think we've seen continued improvement in that each year. So, I think we're pleased with the production that we've seen. And yes, I think we'll have a little -- as we look forward, we have some additional acreage in the southern part of Peru that we've planted over the last year or two, that's probably a couple of years out from coming into production.\n\nI think we probably have about 600 hectares there. And then similarly, we've got our planning in Guatemala that will be coming on. We'll get a very small amount of production probably this next year and then in '24, it will become a little bigger and then continue to ramp up from there. So, really, kind of the long-term strategy of kind of filling in the calendar throughout the year, I think it takes time because for the trees to grow and to mature.\n\nBut I think we're seeing that it's coming to -- it's going to be coming to fruition.\n\nGerry Sweeney -- ROTH Capital Partners -- Analyst\n\nGot it. OK. That's it for me. I appreciate it.\n\nThank you.\n\nSteve Barnard -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. There are no further questions at this time. I'd like to end the question-and-answer session and turn the conference call back over to management for any closing remarks.\n\nSteve Barnard -- Chief Executive Officer\n\nGreat. Thank you for your interest in Mission Produce, and we look forward to speaking with you again soon. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Sonnek -- Investor Relations\n\nSteve Barnard -- Chief Executive Officer\n\nBryan Giles -- Chief Financial Officer\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nTom Palmer -- JPMorgan Chase and Company -- Analyst\n\nGerry Sweeney -- ROTH Capital Partners -- Analyst\n\nMore AVO analysis\n\nAll earnings call transcripts"
}