{
  "companyName": "Atea Pharmaceuticals, Inc.",
  "companyTicker": "AVIR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/atea-pharmaceuticals-inc-avir-q2-2022-earnings-cal/",
  "content": "Atea Pharmaceuticals, Inc. (AVIR 3.00%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Welcome to the Atea Pharmaceuticals second quarter 2022 financial results conference call. [Operator instructions] Please note that today's conference is being recorded. I would now like to turn the call over to Jonae Barnes, senior vice president of investor relations and corporate communications at Atea Pharmaceuticals.\n\nPlease proceed.\n\nJonae Barnes -- Senior Vice President of Investor Relations and Corporate Communications\n\nGood afternoon, everyone, and welcome to Atea Pharmaceuticals second quarter 2022 financial results conference call. Earlier today, we issued a press release which outlines the topics we plan to discuss. You can access the press release, as well as the slides that we'll be reviewing today by going to the investors section of our website at ir.ateapharma.com and go to the Events & Presentations section. With me today from Atea are chief executive officer and founder, Dr.\n\nJean-Pierre Sommadossi; chief development officer, Dr. Janet Hammond; chief financial officer and executive vice president of Legal, Andrea Corcoran; and our chief commercial officer, John Vavricka. They will all be available for the Q&A portion of today's call. Before we begin the call, as outlined on Slide 2, I would like to remind you that today's discussion will contain forward-looking statements that involve risks and uncertainties.\n\nThese risks and uncertainties are outlined in today's press release and in the company's recent filings with the Securities and Exchange Commission, which we encourage you to read. Our actual results may differ materially from what is discussed on today's call. With that, I'll now turn the call over to Jean-Pierre.\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nThank you, Jonae. Good afternoon, everyone, and thank you for joining us today. I was going to start with our bemnifosbuvir program where there is much to report as you can see summarized on Slide 3. It is now evident that, as detailed on Slide 4, COVID-19 will likely remain a global concern for a very long time.\n\nIndeed, we see new variants and subvariants emerging in shorter time intervals and the rate of infection is increasing. The changing characteristics have caused the existing antibody treatment to fail and have reduced the efficacy of vaccine-induced immunity, creating the need for frequent and early engineered booster to combat the emerging variants. Pandemic surges can be life-threatening to those at high risk over 65 years old, particularly those with risk factors, causing increased hospitalization and death. Right now, BA.5 accounts for the vast majority of infections.\n\nIt's highly infectious and new variants are expected to fuel a surge at this fall. New oral antivirals with improved profiles are urgently needed due to the limitations of the current antiviral treatment options. These limitations include the issue of relapse, which was experienced by both President Biden and Tony Fauci, among others, after taking Paxlovid. Relapse can lead to a rebound of symptoms, as well as transmission of infection to others.\n\nOther limitations include drug-drug interactions with many commonly prescribed life-saving drugs. These drugs are frequently used among those that are the most vulnerable to COVID-19, limiting the ability for Paxlovid to be prescribed and raising treatment dilemma for patients and prescribers. With bemnifosbuvir, we have the potential to address many of these limitations, and we are working diligently to deliver improvements over the current standard of care. Moving to Slide 5.\n\nWe recently had an end of phase 2 meeting with the FDA and met with the European Medicines Agency Emergency Task Force to review the bemnifosbuvir data package to date, including the MORNINGSKY results. Let me remind you that in the MORNINGSKY study, which we reported in May, the risk of hospitalization was 71% lower in the bemnifosbuvir 550-milligram BID arm versus placebo with a p-value equal to 0.047, unadjusted and exploratory. Obviously, we are very encouraged with this outcome. And the results were consistent in both standard and high-risk patients as well.\n\nWe are now in the process of finalizing the design of global late-stage clinical trial for the treatment of mild-to-moderate COVID-19. [Inaudible] will evaluate bemnifosbuvir 550-milligram dose twice daily for five days in high-risk patients, including those who are immunocompromised regardless of vaccination status. The primary endpoint will be hospitalization and death. Operational planning is currently underway for this global trial, and we expect to initiate this study in the fourth quarter of this year.\n\nTurning to Slide 6. We are confident that bemnifosbuvir will remain fully active against future variants. This is based on the consistent potent antiviral activity that we continue to generate as newer variants of concerns emerged as a [Inaudible]. Our most recent data set confirms antiviral activity against Omicron surveillance similar to the potency demonstrated with Alpha, Beta, Gamma, Epsilon and Delta.\n\nThis data reinforced our understanding of bemnifosbuvir potent inhibition of the two functional domains of the highly conserved viral RNA polymerase. Let me remind you that details related to the molecular mechanism were published in Nature Communications early this year. Moving to Slide 7. Based on the evolving nature of COVID-19 variants and unmet medical needs, we are pursuing a multipronged approach, which place us at the forefront of developing a combination regimen to fill the treatment gaps of COVID-19.\n\nIn the future, we see a growth of bemnifosbuvir as monotherapy, as well as in combination regimens. Right now, as previously noted, there are treatment gaps with first-generation protease inhibitors, including drug-drug interactions and relapse [Inaudible]. Also, we can anticipate resistance to emerge with broad use, prolonged treatment and retreatment when protease inhibitors are administered as monotherapy. With bemnifosbuvir's attractive profile, we believe that it has the potential to become the cornerstone therapeutic for both monotherapy and in combination therapy.\n\nThis is our rationale for pursuing in parallel to our late-stage monotherapy trial a second generation protease inhibitor with an improved profile to be used in combination with bemnifosbuvir in specific patient population. On Slide 8, as part of this effort, our target profile for second-generation protease inhibitor is a highly potent drug, but there's a good safety profile with limited drug-drug interaction and does not require ritonavir or any other booster. And I'm pleased to recall today that we have made significant progress with our internal program. Indeed, in a short time period, we have achieved two essential properties with potency at nanomolar and subnanomolar levels and good metabolic stability, leading to a highly promising compounds.\n\nWe are now working to combine this potency and metabolic stability in a clinical candidate, which we hope to select later this year. Moving to Slide 9. The antiviral effect of bemnifosbuvir in combination with the protease inhibitor Paxlovid was examined in vitro in an HCoV-229E surrogate model, and the results indicate an additive antiviral effect. So not only we are encouraged by this data, also this data support the potential benefit of the combination of bemnifosbuvir with a protease inhibitor for the treatment of COVID-19.\n\nI would turn the call over to Janet for a review of our dengue fever and hepatitis B program. Janet?\n\nJanet Hammond -- Chief Development Officer\n\nThank you, Jean-Pierre. Turning to Slide 11. I'll begin with a review of our program to treat dengue fever. In recent weeks, hundreds of thousands of cases of dengue have been reported across Southeast Asia, owing to the flooding and other climate-related issues experienced there.\n\nIn the United States, in Miami Dade County, a mosquito-borne illness advisory was issued for dengue in late July after the first case was confirmed this year in a Florida resident. There are no treatments for dengue. Dengue is the most prevalent mosquito-borne viral disease and affects almost 400 million individuals on an annual basis. Dengue is endemic in over 100 countries, and more than half of the world's population is at risk for it.\n\nThere is a significant unmet medical need and the global economic burden is estimated to be between $8 billion to $9 billion annually. As noted on Slide 12, we continue to enroll patients in the DEFEND-2 trial, which is a randomized phase 2 proof-of-concept study in patients with dengue fever. The study is designed to assess antiviral efficacy, safety and the pharmacokinetics of multiple doses of AT-752 with a primary endpoint of change in dengue virus viral load from baseline. AT-752 or placebo will be administered orally for five days in up to 60 patients with dengue infection.\n\nWe expect to report initial results from the study later in the year. We also initiated a second dengue study, which is a human challenge model in the United States. In this study, healthy volunteers are dosed with AT-752 or placebo and then administered a live dose of dengue virus. The subjects are closely monitored within a very controlled setting, allowing for the assessment of viral load and the viral kinetics between the treatment groups.\n\nWe also expect to report the preliminary results from this study later in the year. Turning now to our hepatitis C program. As shown on Slide 14, our HCV combination development plan looks very promising, and we believe that there is still room to improve upon the standard of care for hepatitis C. Our HCV combination profile includes convenient and short treatment duration with the potential for the first ribavirin-free therapy for decompensated disease.\n\nWe believe ruzasvir in combination with bemnifosbuvir provides the opportunity to create a best-in-class pan-genotypic HCV therapy. We're continuing to make progress with our program and have completed a required combination preclinical toxicology study. We are currently manufacturing ruzasvir clinical trial supplies and are finalizing the phase 2 clinical trial design. We expect the phase 2 combination program to evaluate convenient and short treatment durations in both noncirrhotic and compensated patients with cirrhosis.\n\nWe anticipate initiating the study later this year. With that overview, I will now hand the call over to Andrea to review our financial information.\n\nAndrea Corcoran -- Chief Financial Officer and Executive Vice President of Legal\n\nThank you, Janet. As Jonae mentioned in her introductory remarks, earlier today, we issued a press release containing our financial results for the second quarter of 2022. The statement of operations and balance sheet are on Slide 16 and 17. For the second quarter of 2022, the decrease in R&D expenses in comparison to the second quarter of 2021 was driven principally by the discontinuation of our cost share arrangement with Roche.\n\nThis cost share arrangement ceased when the collaboration with Roche ended earlier this year. The decrease was partially offset by an increase in R&D employee payroll and personnel-related expenses. The nominal increase in G&A expenses in the second quarter 2022 over the second quarter 2021 was primarily due to an expansion of our organization and reflects an increase in payroll and personnel-related expenses. We ended the quarter with a strong balance sheet, including cash resources in the amount of $684.5 million to support our clinical development programs.\n\nThe cash expenditures during the quarter were $21.1 million. We are reiterating our cash guidance with a runway through 2025. I'll now turn the call back over to Jean-Pierre for closing remarks.\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nThank you, Andrea. Throughout the first half of 2022, we made considerable progress advancing our oral antiviral platform with the aim of transforming the treatment of severe viral diseases. As the global demand for COVID-19 treatments continue and abated, we remain confident in the opportunity for Atea to deliver a multipronged approach with best-in-class oral antivirals to treat COVID variants as the virus continues to evolve. On Slide 19, as we look to the balance of the year, we expect to build on this momentum by achieving a number of value-creating milestones, including the initiation of our late-stage clinical trial of bemnifosbuvir for COVID-19, reporting preliminary clinical data from our dengue fever program and the initiation of our phase 2 combination program in HCV.\n\nIn addition, our goal is to select the second-generation protease inhibitor clinical candidate for COVID-19 combination therapy with bemnifosbuvir. These programs have the potential to provide global solutions for patients suffering from severe viral diseases. And I look forward to reporting our progress in the months ahead. With that, operator, we will now turn the call up to your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Tim Hugo -- Lugo from William Blair. Your line is now open.\n\nTim Lugo -- William Blair -- Analyst\n\nThank you for the taking the question, and congrats on the progress in the quarter. I guess from a 10,000-foot level, it seems like there might have been a bit of a regulatory shift at the agency where maybe they're now more open to the monotherapy trial, whereas maybe at the beginning of the year, that wasn't the case. Can you talk about -- is it just the updated MORNINGSKY data, which impressed them? Or is it just, I guess, the issues with the PI? Or is it all of the above?\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nJanet, would you like to address the question?\n\nJanet Hammond -- Chief Development Officer\n\nThank you. Yes, JP, and thanks, Tim. No, I think to clarify, we have not had discussions about combination therapy versus monotherapy with any agency. So these were in the phase 2 discussions that we reported now.\n\nAnd so I don't believe there was any issue one way or the other with that. And I think they see a path forward for us both as monotherapy and then potentially as combination therapy also.\n\nTim Lugo -- William Blair -- Analyst\n\nOK. Fair enough. And is there any -- and can you just talk of thinking about using your own PI versus partnering with one of the other PIs, obviously, with Paxlovid, but there are other kind of development stage candidates out there? Is there something that just makes those not quite right for combination?\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nLook, we'll see in the next six to 12 months. As you know, the issues with Paxlovid are going to remain whether monotherapy or combination, and mostly, it's drug-drug interaction. And very likely, we foresee that the combinations are very likely. When we are talking about specific population, we are talking about immunocompromised patient transplant where you can have long-term bioreplication.\n\nSo already, you start with a major limitation, which is the drug-drug interaction issues of Paxlovid. So as you have seen, we are moving very fast with our second generation. Our goal is to have, like we said, a highly potent drug, which will lead to a low dose. We foresee potential co-formulation with bemnifosbuvir.\n\nLet's not forget, we have a low pill burden with bemnifosbuvir. It's two pills twice a day. If you combine with Paxlovid, you're talking about five pills twice a day. That's quite a bit.\n\nSo we keep in mind of this. But we believe that we will have a best-in-class. You see that, to my knowledge, this is the first time reporting sub-nanomolar potency. We start to see even binding at the picomolar level, which this is what we would like to see as we have in HIV and HCV.\n\nSo not to talk about nanomole or the picomoles. So let's see where we stand in the next six to 12 months. But we believe that our combination -- proprietary combination will lead and help and create major benefits to patients, especially in those very high-risk patients with COVID-19.\n\nTim Lugo -- William Blair -- Analyst\n\nThank you for the color.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Umer Raffat from Evercore.\n\nUnknown speaker -- Evercore ISI -- Analyst\n\n[Audio gap] for Umer. I would love to get a little bit more color about your expectations for the continuing market for antivirals. I mean, obviously, there's still unmet need in COVID, but by the time your either monotherapy or proposed combination is eligible for launching, what do you think the ongoing COVID market is going to look like at that stage?\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nSure. John, do you want to address the question?\n\nJohn Vavricka -- Chief Commercial Officer\n\nYeah, sure, JP. Yes. I understand your question. We believe that the COVID-19 endemics will really continue throughout the world.\n\nAnd right now, recently, you've seen the multibillion-dollar opportunity, and that's just for treatment. There's no [Inaudible] stockpiling there. But even if you look at the current landscape that you have, which the dominant player, at least in the United States, is Paxlovid, as JP said, that due to the drug-drug interactions with many commonly prescribed medicines, that is not going to go away. And these drugs are frequently used among those who are the most vulnerable to COVID-19.\n\nAnd unfortunately, it's limiting the ability of Paxlovid to be prescribed and really raising treatment dilemmas for both patients and prescribers. And just to reiterate, I think we always have seen that the commercial opportunity for COVID will really come from two areas. One will be from the active disease, which is what you see now. And then once NDA approval comes, that the government will stockpile that, and the stockpiling will likely be similar to other type pandemics that we've seen before, which was usually a percentage of the population that will be ongoing.\n\nSo we don't see anything really changing at least on the current landscape that you see right now. The liabilities of those assets we see are continuing.\n\nUnknown speaker -- Evercore ISI -- Analyst\n\nOK. Great. That makes sense. I guess maybe one more.\n\nAnd apologies if this is -- if you already discussed this, but can you talk a little bit about viral rebound and whether the risk of that will be different in combo and mono?\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nViral rebound and the risk, say again, please?\n\nUnknown speaker -- Evercore ISI -- Analyst\n\nI'd love to talk a little bit about the expectations that other antivirals have had with viral rebound. And obviously, it's not just Paxlovid, you've seen similar reports from [Inaudible], although it's not as widely used. So I'm wondering what you think about the risks there and whether combo will meaningfully address that.\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nWell, look, we will have to conduct the study to see if this benefit can be realized, right? We just see recently potential for a rebound of [Inaudible] although we have really not really been, I will say, documented just in this review paper recently. Paxlovid is clear. And I think that it's really related to the mechanism of action. When we talk about protease inhibitors, we are talking about there likely incomplete suppression, incomplete viral replication.\n\nLet's not forget that Paxlovid does an off-rate of one hour. That means that basically when the clearance occurred within one hour, you're back on full viral replication. That's the major difference with a nucleoside analogue where you have chain termination, you have an irreversible process. So again, we need first to have a good hand on real absolute.\n\nThere are several reports that talk about 2%, 5%, 10%. It would be very important to know exactly where we are targeting. Some even mentioned 20% or 30%. I say very likely, if there is, among different patient population, very likely immunosuppressed patients, for example, immunocompromised, where you are potentially long-term viral replication, may occur at the highest rate.\n\nAnd combination, you will expect should led to those benefits. But obviously, the studies will have to be conducted.\n\nUnknown speaker -- Evercore ISI -- Analyst\n\nAll right, thanks. Makes sense.\n\nOperator\n\nThank you. Our next call comes from the line of Nik Gasic with SVB Securities.\n\nNik Gasic -- SVB Securities -- Analyst\n\nHey, good afternoon. This is Nik Gasic on for Roanna Ruiz. Maybe first off on bemnifosbuvir. How might lower hospitalization and death event rates impact primary endpoint data for bemnifosbuvir in phase 3?\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nJanet?\n\nJanet Hammond -- Chief Development Officer\n\nI'm sorry, Nik. I just couldn't clearly hear your question. How might hospitalization and death rates impact bemnifosbuvir? Was that your question?\n\nNik Gasic -- SVB Securities -- Analyst\n\nHey, Janet, yeah. I'm just curious, how might lower hospitalization and death event rates impact the primary endpoint data in phase 3?\n\nJanet Hammond -- Chief Development Officer\n\nSo I think, obviously, as an endpoint, it may mean that we will need to explore more patients. But I think one can also probably enrich for patient populations where these events are more likely to occur. So we -- once we have a final study design and we are on our way, we'll give you some idea of what we're anticipating to do. But I think just at a broad level, that would be how we hope to address that.\n\nNik Gasic -- SVB Securities -- Analyst\n\nGot it. That's very helpful. And I think you previously mentioned potentially optimizing 527, the compound itself, to get better exposures with a lower cost of goods. Curious if you're moving forward with those plans and with the optimized molecule in phase 3.\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nYeah. Basically, we are moving forward with the new formulation and improved API. And the API is just an improved production process to be able to synthesize multipronged level. And the formulation actually is also a much more straightforward formulation process.\n\nSo we're actually just in the process to complete phase 1 with this formulation. So we will basically include the new CMC in the package for the global trial as well.\n\nNik Gasic -- SVB Securities -- Analyst\n\nGot it. So this new compound won't be assessed in the phase 3, it will still be the prior 527 compound?\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nCorrect. Exactly the same.\n\nNik Gasic -- SVB Securities -- Analyst\n\nGot it. And then lastly, on potency data for bemnifosbuvir against BA.4 and BA.5 variants, when do you expect to share this data? And how do you expect bemnifosbuvir's durability to hold up against future variants of concern?\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nLook, as you have seen in the slide, the -- regardless of the variant, and we search major differences in the sequence, especially when we compare the Omicron with the Alpha, the Beta, the Delta, there is no difference at all. Not surprising as the RNA polymerase is highly concerned. I'd like to remind you that any surveillance of exactly 100% homology in the RNA polymerase sequence and only if you have a difference in the spike protein. So it's going to take a couple of months, again, to develop with especially BA.5.\n\nWe have activity against BA.1, now against BA.2. I think that I can tell you already the data that we are going to get with BA.5. And when we see the future, again, it's important to note that we have not seen any significant mutation in the RNA polymerase. The only one, as compared to the original Wuhan strain, is the 323 mutation, which is at the interface between the new variant and the polymerase.\n\nAnd actually, we have reported that in one of our clinical trials, we have 98% of these patients had that mutation. So this is why the nucleoside analogue, especially -- and I'd like to make a difference with specifically targeting the RNA polymerase with a chain termination mechanism. We don't anticipate that we may see any difference regardless of the future variant.\n\nNik Gasic -- SVB Securities -- Analyst\n\nGot it. That's helpful. And then lastly on 752 in dengue, maybe I'm just curious, what are you hoping to see in the phase 2 data set in terms of efficacy? And are there any particular safety signals you're watching for closely?\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nJanet, would you like to address the question?\n\nJanet Hammond -- Chief Development Officer\n\nSo we're looking -- in the treatment trial, we're looking primarily to see a decline in viral load. This happens naturally fairly quickly, but we believe that with clinical effect, you should see a more rapid and more deep drop in viral load. And so that would be the primary endpoint. We'll also be looking at symptoms.\n\nWe have a fair amount of experience in our phase 1 trials with the drug. So we are confident in its profile. It's actually being well tolerated and safe. And so we will obviously be monitoring for that and also looking at the pharmacokinetics.\n\nBut the viral kinetics are really the primary endpoint and the main aspect that we're attempting to evaluate. And also, we're going to look potentially at a couple of different doses and dosing regimens, depending on how we go from cohort to cohort. But those will be the things that we'll be looking for.\n\nNik Gasic -- SVB Securities -- Analyst\n\nGot it. Super helpful. Thank you, Janet. I'll hop back in the queue.\n\nJanet Hammond -- Chief Development Officer\n\nThank you, Nik.\n\nOperator\n\n[Operator instructions] If there are no further questions at this time, I'd like to hand it back to Jean-Pierre for closing remarks.\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nThank you again for joining us today, and we look forward to report more progress in the fall. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJonae Barnes -- Senior Vice President of Investor Relations and Corporate Communications\n\nJean-Pierre Sommadossi -- Chief Executive Officer and Founder\n\nJanet Hammond -- Chief Development Officer\n\nAndrea Corcoran -- Chief Financial Officer and Executive Vice President of Legal\n\nTim Lugo -- William Blair -- Analyst\n\nUnknown speaker -- Evercore ISI -- Analyst\n\nJohn Vavricka -- Chief Commercial Officer\n\nNik Gasic -- SVB Securities -- Analyst\n\nMore AVIR analysis\n\nAll earnings call transcripts"
}