{
  "companyName": "Hewlett Packard Enterprise Co",
  "companyTicker": "HPE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/hewlett-packard-enterprise-co-hpe-q3-2022-earnings/",
  "content": "Hewlett Packard Enterprise Co (HPE 0.25%)\nQ3 2022 Earnings Call\nAug 30, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the third quarter 2022 Hewlett Packard Enterprise earnings conference call. My name is Chuck, and I'll be your conference moderator for today's call. [Operator instructions] As a reminder, this conference is being recorded for replay purposes. I would now like to turn the presentation over to your host for today's call, Mr.\n\nAndrew Simanek, vice president of investor relations. Please proceed, sir.\n\nAndy Simanek -- Vice President, Investor Relations\n\nGreat. Thank you. Good afternoon, everyone. I'm Andy Simanek, head of investor relations for Hewlett Packard Enterprise.\n\nI'd like to welcome you to our fiscal 2022 third quarter earnings conference call with Antonio Neri, HPE's president and chief executive officer; and Tarek Robbiati, HPE's executive vice president and chief financial officer. Before handing the call over to Antonio, let me remind you that this call is being webcast. A replay of the webcast will be made available shortly after the call for approximately one year. We posted the press release and the slide presentation accompanying today's earnings release on our HPE Investor Relations web page at investors.hpe.com.\n\nAs always, elements of this presentation are forward-looking and are based on our best view of the world and our businesses as we see them today. For more detailed information, please see the disclaimers on the earnings materials relating to forward-looking statements that involve risks, uncertainties and assumptions. For a discussion of some of these risks, uncertainties and assumptions, please refer to HPE's filings with the SEC, including its most recent Form 10-K and Form 10-Q. HPE assumes no obligation and does not intend to update any such forward-looking statements.\n\nWe also note that the financial information discussed on this call reflects estimates based on information available at this time and could differ materially from the amounts ultimately reported in HPE's quarterly report on Form 10-Q for the fiscal quarter ended July 31, 2022. Also, for financial information that has been expressed on a non-GAAP basis, we have provided reconciliations to the comparable GAAP information on our website. Please refer to the tables and slide presentation accompanying today's earnings release on our website for details. Throughout this conference call, all revenue growth rates, unless noted otherwise, are presented on a year-over-year basis and adjusted to exclude the impact of currency.\n\nFinally, after Antonio provides his high-level remarks, Tarek will be referencing the slides and our earnings presentation throughout his prepared remarks. As mentioned, the earnings presentation can be found posted to our website and is also embedded within the webcast player for this earnings call. With that, let me turn it over to Antonio.\n\nAntonio Neri -- President and Chief Executive Officer\n\nWell, great. Thank you, Andy, and good afternoon, everyone. Thank you for joining today's call. As we have demonstrated throughout 2022, HPE is delivering for our customers and our shareholders.\n\nIn the third quarter, HPE grew revenues, increased profits and strengthen gross margins through steady operational focus and execution and despite continued tight supply conditions and unfavorable foreign exchange. In our results, you will see the customer demand for our industry-leading portfolio. We continue to accelerate our recurrent revenue this fiscal year, which validates the compelling value proposition we offer our customers, and the long and the strong response to HPE GreenLake, our unified Edge-to-Cloud as a service platform. Customers continue to prioritize investments in IT.\n\nThey find HPE's technology solutions to be particularly relevant in today's complex macroeconomic environment where technology innovation is critical to accelerate business transformation and deliver important business outcomes. In the third quarter, total HPE revenue increased 4% year over year to $7 billion, which was also above the sequential outlook we have given. New orders exceeded our expectations despite finally starting to decelerate the growth rates, bringing our quarterly exit backlog to another record level. That is significant, considering that for the previous four consecutive quarters, we have grown orders 20% or more year over year.\n\nWe continue to see robust customer demand in the market and a high-quality, durable sales pipeline. Our HPE GreenLake customer base is growing, and our customers are voting for the workloads and data. In Q3, we doubled HPE GreenLake new level of growth year over year, and our existing HPE GreenLake customers continue to renew and expand contracts with us. The HPE GreenLake platform has an exabyte of data under management and customers worldwide connect more than 2 million devices to it.\n\nThe momentum is reflected on annualized revenue run rate up 28% and total as-a-Service orders were up 39% year over year, bringing our year-to-date orders growth to 86%. These indicators show enduring demand for our as-a-Service solutions, even while supply constraints limited some installations. Once again, we expanded gross margins in the quarter. Non-GAAP gross margin of 34.7% was up half a point sequentially and matched the highest we have ever generated since we began our as-a-Service in 2019.\n\nWe improved non-GAAP operating margin even more than gross margin to 10.5% this quarter, up 120 basis points sequentially and 70 basis points year over year. Non-GAAP diluted net earnings per share was $0.48, a 9% sequential rise and 2% year over year. Our cash flow from operations was $1.3 billion, and our free cash flow in the quarter was $587 million. This is in line with our typical seasonality as we improve cash conversion cycles in the second half.\n\nFrom a supply chain perspective, the dynamics remained largely unchanged from the last few quarters, with certain components still in tight supply, which limited shipments. However, we have made progress in proactive measures we have taken to enhance the resilience of our supply chain, including still in demand to products that do not require supply constrained components, offering new multi-sourcing options and implementing program design changes to our world-class engineering capabilities. We could also see some easing in supply condition if consumer demand continued to slow and component capacity shift toward enterprise customers. Overall, we expect supply chain to remain challenged, supply to remain challenged into next year, although with some very early signs of potential easing in the near term.\n\nWe remain focused on translating customer demand into profitable revenue growth, as shown in our Q3 results. Customers continue to tell us that they need to drive their important digital transformation work while managing costs. And it is clear we commit those needs with our Edge-to-Cloud portfolio delivered through the HPE GreenLake platform. HPE GreenLake brings a unified hybrid cloud experience to our customers' data and workloads, enabling them to consume IT as utility.\n\nIn June, I was thrilled to joined 80,000 customers and partners, again, in person in Las Vegas at HPE Discover. We unveiled a series of new cloud services and enhancements for the HPE GreenLake platform to further advance the hybrid cloud experience for customers. We were particularly excited to announce HPE GreenLake for private cloud enterprise, which addresses customers' desire for their own automated, flexible enterprise-grade private cloud. We recognize the important role our partner ecosystem plays in our success and the success of our customers.\n\nTo continue to expand our growing partner ecosystem and enable them to adapt to customers' evolving requirements, we launched a new program that helps partners build their business on top of our HPE GreenLake platform. Customers are entrusting HPE GreenLake with their most critical workloads and applications. Japan Card Network, Japan's leading credit card payment network and an existing HPE GreenLake customer expanded its contract in Q3 to add a 100% fault tolerance platform running on HPE NonStop servers, with an integrity -- with an integrated software. The new implementation will power the card net systems demanding, transaction-intensive applications as Japanese consumers rapidly increased use of credit cards and cashless payments.\n\nIn India, the country's largest public sector steel producer also expanded adoption of the HPE GreenLake platform to increase productivity and reduce energy consumption. By modernizing its critical S&P environment with HPE GreenLake, the organization can respond more quickly to business demand and help reduced its data center footprint by over 16% to help reach sustainability goals. These are just two examples of existing customers doubling down on HPE GreenLake platform to address new needs. We see this as an important endorsement of the valuable role HPE GreenLake plays in our customers' IT strategy.\n\nAt the Edge, we continue to drive innovation with our solutions. Aruba had an impressive quarter with revenue rising 12% year over year and orders increasing more than 15% for the seventh consecutive quarter. In Q3, Aruba announced new AIOps capabilities to reduce the time IT teams spent on manual tasks like network troubleshooting, performance tuning and security enforcement. These new AI-based insights leverage Aruba's industry-leading data lake from more than 120,000 Aruba users who are now on the HPE GreenLake platform to enhance visibility, operations and the user experience.\n\nOur Edge technology was on display early this month as we created a secure network to power the Birmingham Commonwealth Games 2022 in the U.K. Aruba provided the games network connecting thousands of staff and volunteers and over 4,400 athletes across 20 venues and 38 concurrent events to ensure smooth execution of the games. Committed to leaving a legacy of digital sustainability in the region, HPE is now working with the local organization to make the technology used for the event available to the community, including schools and hospitals. As data continues to grow and evolve rapidly, we are seeing customers use our technology to allow data in incredible ways.\n\nCatharina Hospital, one of the largest hospital and leading centers for heart diseases in the Netherlands is using HPE Ezmeral software to build a cloud native data lake house that security collects and analyzes anonymized patient data from internal and external sources. This will accelerate mobile training and tech anomalies among the 500,000 electrocardiograms already available for data analysis with higher precision to identify the correct diagnosis and treatment. And in one of the most exciting breakthroughs to showcase the power of AI at scale, earlier this month, I was pleased to visit the Oak Ridge National Laboratory to celebrate Frontier, the world's first fastest and greenest exascale supercomputer that HPE built for the lab. Frontier represents a new area of scientific discovery and innovation that will strengthen U.S.\n\nnational security and industrial competition. HPE has a long history of industry first and one-of-a-kind innovation that advances societal progress. We see this as a part of our purpose to advance the way people live and work. We also delivered on our purpose through our commitment to create a more equitable and sustainable world.\n\nEarly this summer, we took the bold step of accelerating our net zero carbon emission target by 10 years to 2040. Effective strategy to achieve net zero carbon emissions are a cornerstone of corporate longevity, and we continue to help customers drive their own sustainable transformation. I'm proud of HPE's Q3 performance and the progress we are making to cement our position as the leading Edge-to-Cloud company. When I speak to customers, it is very rewarding to hear how they are using our differentiated portfolio to solve their most critical business problems.\n\nEvery day, we are proving how essential HPE is to the customers and communities we serve. We couldn't do this without the dedication of our 60,000 team members who impress me every day with their bold innovation and disciplined execution. We have crafted a strategy at HPE that is winning in the marketplace, and I'm confident in our ability to execute on our commitments with strong demand, a solid pipeline and a unique Edge-to-Cloud offering that is delivering revenue growth and expanded gross margins and operating margins for our company. I look forward to updating you about our strategic priorities and outlook when we host our Security Analyst Meeting in late October.\n\nI hope you will join to hear how we plan to continue to generate value for HPE's shareholders. Let me now ask Tarek to discuss our performance in detail and go through our business segment results. Tarek, over to you.\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nThank you very much, Antonio. I'll start with a summary of our financial results for the third quarter of fiscal year 2022. As usual, I'll be referencing the slides from our earnings presentation to guide you through our performance. Antonio discussed the key highlights on Slide 1.\n\nSo now let me discuss our Q3 performance details, starting with Slide 2. We continue to see healthy demand across our differentiated Edge-to-Cloud portfolio. As expected, year-over-year order growth rates moderated to down 9% this quarter as we begin to lap challenging compares. As a reminder, orders were up 29% year over year in Q3 of fiscal year '21.\n\nWe continued to grow our backlog sequentially this quarter to a new record level that is up 96% year over year. Our backlog is also expected to be roughly flat next quarter and remains firm with no meaningful cancellations. This maintains our confidence in achieving both our fiscal year '22 revenue outlook of 3% to 4% growth adjusted for currency and our longer term 2% to 4% revenue CAGR outlook provided at our 2021 Securities Analyst Meeting. In Q3, we delivered revenue of $7 billion, up 4% year over year and above our outlook of up low single digits sequentially despite an ongoing challenging supply environment and greater currency headwinds.\n\nBased on current rates, we now expect currency to be a 2.5-point headwind to revenue for the full year as opposed to the 50 basis points expected at the start of our fiscal year. We continue to be very pleased with the resiliency and expansion of our non-GAAP gross margins despite the inflationary environment and ongoing supply chain disruptions that are driving up material and logistics costs. We delivered non-GAAP gross margin of 34.7%, up 50 basis points sequentially and flat year over year driven primarily by strong pricing discipline and our continued mix shift toward higher-margin software-rich offerings. Non-GAAP operating margins were 10.5%, up 120 basis points sequentially and 70 basis points year over year, reflecting operating leverage from strong gross margin and opex savings from our cost optimization actions taken during the pandemic.\n\nWe expect to gain further operating leverage in the short term as we drive more revenue growth and benefit from investments in the high-growth, margin rich areas of our portfolio. With our better-than-guided revenue growth, we delivered non-GAAP diluted net earnings per share of $0.48, up 9% sequentially despite elevated input costs from the ongoing industrywide supply constraints and foreign exchange impact. As previously indicated, cash flow from operations is following our normal seasonality this year, and working capital has also turned into a tailwind in the second half. In Q3, we generated $1.3 billion of cash flow from operations and free cash flow of $587 million.\n\nWe continue to make further investments in strategic inventory to navigate the current supply environment, and we are now at peak inventory levels. We will begin to work our inventory balance down next quarter and into the following year, and I'll touch more on that shortly in our outlook. Finally, we continue to return substantial capital to our shareholders. We paid $156 million of dividends in the current quarter and are declaring a Q4 dividend today of $0.12 per share payable in October.\n\nWe also repurchased $197 million in shares on track toward our goal of at least $500 million of share buybacks executed this fiscal year and bringing our year-to-date total capital returns to $851 million, reflecting our confidence in future cash flow generation. Slide 3 highlights key metrics demonstrating our progress in our as-a-Service business with more recurring revenue at higher margins. Total as-a-Service orders remained robust, up 39% year over year as we begin to lap more challenging compares. Our year-to-date as-a-Service orders are up 86%, which is the best indicator of the long-term health of this business and supports our confidence in achieving our three-year ARR CAGR target of 35% to 45% from fiscal year '21 to fiscal year '24.\n\nOur ARR growth rate improved from last quarter and was up 28% year over year to $858 million, but still face supply constraints continuing to limit some installations. We also continue to expand our as-a-Service margins as our mix of both software and services continues to increase to 64% in Q3, up six points year over year with our expanding cloud and SaaS offerings, particularly in Edge and Storage. Let's now turn to our segment highlights on Slide 4. Our growth businesses continue to show improving top line momentum and record levels of backlog fueled by strong demand.\n\nIn the Intelligent Edge, we achieved both a record level of orders and revenue in the quarter. We grew orders double digits for the seventh consecutive quarter and have roughly 20 times our normal levels of backlog. Revenue growth accelerated to 12% year over year, outperforming the competition and demonstrating particular strength in Silver Peak, and our Edge-as-a-Service offerings, both up strong double digits. We delivered operating margins of 16.5%, up 390 basis points sequentially and 40 basis points year over year, reflecting the improving operating leverage in this business and this despite higher component and logistics costs.\n\nIn HPC & AI, revenue grew 15% year over year and backlog of awarded contracts remained robust at just under $3 billion. Our Q3 operating profit margin was 3.4%, up nine points sequentially and is expected to increase further next quarter with the recognition of large deals. In Compute, demand remained robust with backlog growing sequentially to another record and is now at five times normal levels. Revenue was down 1%, reflecting a continued difficult supply environment with some improvement expected next quarter with new multi-sourcing options for certain components and demand steering toward new solutions.\n\nWe also continue to be very focused on executing our dynamic pricing strategy that has been effective in managing the increased supply and logistic costs and gives us a very high-quality backlog. The results are showing up in our operating margin performance at 13.3%, up 210 basis points year over year and still well above our long-term target set at SAM 2021 of 11% to 13%. Within Storage, we achieved another record level of backlog and revenue was up 1%. We continue to emphasize our own IP margin reach products that were up double digits, including nimble and hyper-converged.\n\nOur as-a-Service offerings within Storage like Block are also leading order and ARR growth among our business segments. With the favorable mix shift, our operating margins improved to 14.7%, up 210 basis points sequentially. With respect to Pointnext operational services, combined with Storage services, orders grew again and are up year-to-date mid-single digits in constant currency, similar to levels for total fiscal year '21 despite the exit of our Russia business. As you know, this is a key component of recurring revenue and profits for each of our segments.\n\nWithin HPE Financial Services, volume increased 4% year over year in constant currency with strong performance in GreenLake and revenue rose 1%. It's worth noting that our leasing business is well insulating from rising interest rates over time as we price based on a spread and customers often choose to extend their leases during uncertain macroeconomic conditions. Our profitability also continues to benefit from higher residual value realization and bad debt write-offs have returned to pre-COVID levels. Our operating margin was 11.8%, up 70 basis points from the prior year, and our return on equity at 19.5% remains well above the 18% plus target set at SAM 2021.\n\nSlide 5 highlights our revenue and EPS performance where you can see our revenue and EPS continue to grow despite the difficult supply environment, the exit from our Russia business and increasing headwinds from currency. Year to date through Q3, we have already experienced a headwind of $0.05 from currency and $0.03 from exiting Russia. In spite of these headwinds, we delivered a better mix of higher-margin earnings across our portfolio as we continue to execute our Edge-to-Cloud strategy. This improvement can be seen on Slide 6, where we delivered non-GAAP gross margins in Q3 of 34.7%, up 50 basis points sequentially and flat year over year, showing their resilience in spite of the increased component and logistics costs.\n\nThis was driven by both our strategic pricing actions and the favorable mix shift we have been driving to edge, on IP storage and our as-a-Service business. Moving to Slide 7. You can see our non-GAAP operating margins this quarter of 10.5%, up 1.2 points sequentially and up 70 basis points year over year. This reflects revenue growth combined with both gross margin expansion and opex savings to give us strong operating leverage across the business.\n\nThis has also been achieved while continuing to invest more in both R&D and our go-to-market in strategic areas of the business for future growth. On Slide 8, let's spend some time reminding everyone about the status of our unique setup in China through H3C. As disclosed in late April, we have extended our existing put option that is stuck at 15 times trailing 12-month earnings through to October 31, 2022. We did this to enable the new investors at the Unigroup level to complete their restructuring and are now determining the longer-term path forward for our stake.\n\nWe value our presence in China, the second largest and fastest-growing IT market, although prior to the execution of any extension, we will balance the strategic and financial benefits of a continuous involvement in China with rising risks, including geopolitical risk. H3C makes up a significant portion of our P&L and cash flow, and you can see that we are generating growing value to shareholders with our unique setup. Our equity interest rose 21% in fiscal year '21 and has grown another 9% in this Q3. Needless to say, we will keep you up to date as we arrive at a longer-term solution for this valuable asset.\n\nTurning to Slide 9. Our cash flow from operations was $1.3 billion in Q3. This is aligned to our normal pre-pandemic seasonality and our expectations of working capital tailwinds in the second half. We have been strategically building inventory throughout this year to navigate the supply chain environment.\n\nWhile we still expect to start working down inventory levels in Q4, it will take longer than expected and into fiscal year '23 but still puts us in a better position to convert the continued order demand into revenue and cash in future quarters. Now turning to our outlook on Slide 10. As discussed, Antonio and I are very pleased with the continued demand strength and growing backlog that gives us confidence in achieving our original SAM revenue guidance in fiscal year '22 for growth of 3% to 4% adjusted for currency that now includes a 2.5-point headwind from foreign exchange rates on a full year basis. More specifically for Q4 '22, we expect revenue to be up at least 5% sequentially as reported, which includes the larger currency headwind.\n\nThis is still above our normal seasonality to reflect some improvements in supply due to the full resumption of factories activity in China and our actions to multisource more components and steer the demand. From an EPS perspective, we are tightening our fiscal year '22 non-GAAP outlook range as we move toward the end of the year to $1.96 to $2.04. This reflects the impact from the supply environment, which we expect to sustain into Q4 and further appreciation of the U.S. dollar since last quarter.\n\nAs a result, this implies that for Q4 '22, we expect GAAP diluted net EPS of $0.32 to $0.40 and non-GAAP diluted net EPS of $0.52 to $0.60. Furthermore, our free cash flow is also being impacted by exiting our Russia business, as well as headwinds from unfavorable currency movements that were previously absorbed in our prior outlook. As a result, we now expect to deliver fiscal year '22 free cash flow of $1.7 billion to $1.9 billion. So overall, I am very pleased with our results in the quarter that can be characterized by sustained demand and very solid execution, navigated a continued challenging supply environment.\n\nWith record levels of high-quality backlog, we are very well-positioned to capitalize on the ongoing Edge-to-Cloud opportunity and close out a strong fiscal year '22. We look forward to seeing you at our next Securities Analyst Meeting in October to provide our outlook for the fiscal year and beyond. Now with that, let's open it up for questions.\n\nOperator\n\n[Operator instructions] And the first question will come from Shannon Cross with Credit Suisse. Please go ahead.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much. I wanted to talk a bit about the relative strength in your guidance and how you're thinking about your backlog and that, obviously, contrasting that with your competitor that reported last week who had much more conservative or dire outlook on demand, frankly. So I'm curious, how have you stress tested the backlog? I mean what gives you confidence in coming out and effectively taking up guidance because there's more of a currency hit now. So just any color you can give us maybe even on a geographic basis or a vertical basis in terms of what you're hearing and seeing.\n\nThank you.\n\nAntonio Neri -- President and Chief Executive Officer\n\nSure. Thank you, Shannon, for the question. I may start, and then Tarek, please feel free to add your comments. I mean I will say this quarter, Shannon, was characterized, in my mind, by enduring customer demand.\n\nAnd you see what the backlog is now. I mean, it's a record level, more than 3x normal historical seasonality in some segments. It's just amazing to see the demand momentum, think about the Aruba 20 times historical levels and even Compute five times historical levels. So that's very pleasing.\n\nAnd I think it's a testament of our value proposition because GreenLake is a pull-through platform for us across every aspect of our portfolio. As we said on the supply chain, the supply chain dynamics remain largely unchanged. But what has changed for us is that over the months and the quarter, we have taken actions to dual source or to steer demand in our products and then obviously implement design changes. I think because of our combination of our portfolio and customer segments, we believe we are very well-positioned to move forward through this challenge as we go into next quarter and into 2023.\n\nBut we expect supply to remain challenged as we get into 2023. That said, I mean, the fact of the matter is that we believe that, ultimately, we're going to see easing signs because of the -- of what we see in the consumer space and even in automotive and industrial, which are a conversation with the suppliers as they start thinking now how to balance that supplier substrate and then obviously, enterprise is well-positioned. In terms of clearing the backlog, this is going to still take quite a bit of time, and that's a good news for us because it gave us momentum in Q4 in 2023 which is great because remember, two things have happened in that backlog. Number one is price for a strong gross margin as Tarek just went through.\n\nSo in many ways, it's protected for that gross margin. And number two, we have not seen any meaningful cancellation at all.\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nYes, Shannon, if I can add on a couple of comments. What we're doing is we are engineering new solutions that are less dependent on components that are experiencing shortages. We're steering demand toward those solutions, and this is across every facet of our portfolio. We are also multisourcing the most constrained components, and this is helping working through the backlog.\n\nBut as Antonio said, this will remain a challenged environment into next year. And that is actually for us an opportunity to continue to drive revenue with high-quality margins into fiscal year '23. I do want to pick up on your point that you made very rightly about the guidance and having absorbed 200 basis points incremental in foreign exchange terms. This is a very important point.\n\n200 extra basis points of headwind is about $580 million of revenue. You multiply this by the OP margin, and you can really look at what impact would that have had on EPS. So we are very pleased with the performance of our business. And the fact that in spite of substantial foreign exchange headwinds, we are able to maintain the revenue guide of 3% to 4% in constant currency and therefore, our EPS guide as a result.\n\nSo thanks for pointing that out.\n\nAntonio Neri -- President and Chief Executive Officer\n\nYeah. One more thing, Shannon, is for you to also understand is that as we continue to grow the as-a-Service component of this, the solutions for Storage, Compute, Private Clouds and the like are more standardized, which give us a better predictability on that front. So that will also help us move through this supply tight environment.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you.\n\nAndy Simanek -- Vice President, Investor Relations\n\nGreat. Thanks for the question, Shannon. Can we get the next one, please, operator?\n\nOperator\n\nThe next question will come from Meta Marshall with Morgan Stanley. Please go ahead.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Maybe building upon that question. The opex or kind of your EPS commentary would indicate maybe slightly higher opex into Q4, particularly given kind of the gross margin levers that you saw in the last quarter. So you noted some of that is FX adjusted, but I would think that there's kind of an FX tailwind on the opex piece.\n\nAnd so I just wanted to get a sense of is it -- are you seeing larger-than-expected expenses and opex? Is there less gross margin leverage as maybe we recognize some higher-priced inventory? Just anything to kind of note there into Q4 would be helpful. Thanks.\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nOf course, Meta. Thanks for asking the question. So FX is obviously a headwind to revenue because 55% of our revenue in the company is denominated in non-U.S. dollar currencies.\n\nBut it's -- as you point out, a tailwind to opex to some degree. Some of the cost that we incur is therefore lower on a dollar basis. Net-net FX is a headwind to operating profit and EPS. And so we started our cost containment in the middle of the pandemic, as you may recall, in April, May 2020.\n\nAnd we stay disciplined on opex moving forward. And this is shown to you by our gross and operating margin performance. We feel comfortable about our gross margin trend, and we believe per my script, that there is further opportunity to extract operating leverage in Q4 and beyond, thanks to the growth in high-margin areas of our portfolio such as the Edge. I feel pretty comfortable about the situation.\n\nIf you look at our gross margins, to add more color, they're up 50 basis points sequentially and flat year on year. And this is in spite of an inflationary environment that would put a lot of pressure on supply chain, logistics costs and material costs, obviously, but also on labor costs. So on the whole, look for our margins and where they stand relative to those headwinds that we just discussed.\n\nAntonio Neri -- President and Chief Executive Officer\n\nI will add, Meta, a couple of things. First of all, year over year, you see a slight decline in opex as a percent of revenue, but that opex that we report, obviously, large maturities, R&D and FXD. But when you look at that opex as a productivity lever against our orders and what we have done, you can see with the backlog we have, we have improved our productivity, particularly on the sales force side. And then in R&D, to Tarek's point, we started this program in Q2 2020 at the beginning of the pandemic.\n\nIn fact, I will say we were the first company to come out with a resource allocation and optimization program that allow us to manage cost in a discipline way but reposition resources in the areas of growth we want to drive going forward. And so, Tarek rightfully so said, we will continue to see operating leverage as we convert the backlog and we scale that revenue, which obviously, we have a significant backlog. But as a percent of the order momentum, the productivity has significantly improved.\n\nAndy Simanek -- Vice President, Investor Relations\n\nGreat. Thanks, Meta, for the question. Operator, can we go to the next one, please?\n\nOperator\n\nThe next question will come from Toni Sacconaghi with Bernstein. Please go ahead.\n\nToni Sacconaghi -- Bernstein Research -- Analyst\n\nYes. Thank you for taking the question. I'm wondering if you could just comment on linearity throughout the quarter in terms of orders and whether you saw any degradation. And then I was hoping you could just maybe help quantify sort of the aggregate backlog because, as you noted, your order compares are very difficult going forward, 20% plus for the last four quarters.\n\nSo if orders end up being down 10% a year for the next three or four quarters, that's $2.8 billion less in orders. My sense is you may have $3 billion or $4 billion in incrementally higher backlog than normal. So that would still suggest reported revenue growth could grow. But I'm wondering, if you can also just sort of talk to that dynamic of the tough order comps and likely facing negative order growth and whether the backlog ultimately measures up according to the math that I outlined that should make everyone feel good about continued revenue growth.\n\nThank you.\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nSure. So it's a great question, Toni. So first and foremost, I want to point out to you that our -- we don't comment and give a specific figure on the backlog. But suffice is to say that it's close to double what it used to be last year this time of the year.\n\nThat's the first point to take away, and we're working through it and it's firm. There are no meaningful cancellations. So that's a tailwind to revenue generation, and we are executing better and better in our global operations team to convert that backlog into revenues. Orders are there.\n\nAnd they are there when you really look at segment by segment, we give you in our presentation, the detail of the order growth. So you can see the order growth in the Edge, for example, which has been on relentless, we've had seven quarters in a row of substantial order growth at the Edge in double digits. And the same holds true for other parts of our portfolio. the HPC & AI has its own dynamics with futures and a substantial order book north of $3 billion.\n\nSo demand is not slowing to the point where this affects our fiscal year '23 guide that we gave you at SAM last year, and we reiterated during the course of this year. We still see continuous demand. Even in Q3, the demand was sustained across the portfolio in Compute, in Storage, in HPC & AI and at the Edge. It's probably lower than what it used to be four quarters ago for obvious reasons.\n\nThese are tough compares. But the way to think about it is that the tide has come up. And maybe now the tide is a little bit catching its breath, but it's still there relative to where we were at the pandemic data point.\n\nAntonio Neri -- President and Chief Executive Officer\n\nI will say, Toni, just to add on that, we use the word steady because obviously, you can't use the word growth in the context of the compares here. But steady, steady. And then within the steadiness, we have growth in some unique segments that continue. And Tarek talked about the Edge, we have a 20 times backlog in that business.\n\nAnd even on Compute, we still have five times. So -- and the other thing to remember here is that GreenLake is an accelerator of orders intake because that creates us momentum in renewing and expanding and cross-selling across the business. So I think the original guidance we gave us at SAM last year, which was 2% to 4% over the long-term period, still absolutely true. And then when we get together at SAM here at the end of October, we're going to tell you what we're going to do specifically for '23.\n\nBut I sit here today and I feel pretty good about the momentum we have because demand is steady, and our strategy is resonating with the people, too, as a service.\n\nToni Sacconaghi -- Bernstein Research -- Analyst\n\nThank you.\n\nAndy Simanek -- Vice President, Investor Relations\n\nPerfect. Thanks, Toni. Next question, please. \n\nOperator\n\nThe next question will come from Tim Long with Barclays. Please go ahead.\n\nTim Long -- Barclays -- Analyst\n\nThank you. Yeah, I wanted to get back to the kind of as-a-Service and ARR businesses. You guys are sticking to the longer-term guide here a little acceleration from what we've seen this past quarter. Could you just kind of dig into that a little bit? What are you seeing that's going to sustain that level of high growth over multiple years of the new programs or new products that are going to maybe transition the model so that we can keep that 25 to -- I'm sorry, 35% to 45% growth rate for ARR? Thank you.\n\nAntonio Neri -- President and Chief Executive Officer\n\nSure. Well, our as-a-Service transformation through Edge-to-Cloud platform, GreenLake, is my No. 1 priority and it's central to our strategy to bring that unified hybrid cloud experience that everybody is talking in the market. Ultimately, customers want to consume IT solutions in different ways.\n\nAnd this IT utility model is growing very, very rapidly. And I'd add here, we were the first with that strategy. And so we have a little bit of head start here. And you see that in our order momentum, right, year to date.\n\nWe grew the as-a-Service bookings by 86%. And so clearly, that gives you the confidence that the 35% to 45% is absolutely achievable. But what it gives me more confidence, honestly, Tim, is the fact that when I was at Discover just two months ago and you look at the breadth of our solutions through the platform, and the experience that we provide, whether it's to deploy connectivity anywhere in your enterprise or where to deploy a private cloud that we came out with the new private cloud enterprise solutions, where you can run any type of workload, whether it's virtualized, containerized or bare metal or whether to deploy data solutions to extract value from the data is growing. And that platform today has now more than an exabyte of data under management and 2 million devices under management as well.\n\nSo our confidence to deliver the 35% to 45% is absolutely there. And remember that at the last Security Analyst Meeting, we guided by the end of 2024 to have an ARR close to $2.3 billion, and we believe we are on track to do that. Tarek, do you have any comments on that?\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nNo, I think you said very well, Antonio. We simply -- we emphasize one thing strategically is, clearly, the word is now hybrid. Our customers have spoken, the market has spoken, the world is hybrid. For us to scale an as-a-Service business in a hybrid world for any player to do so, you need to build a platform.\n\nWithout the platform, you cannot scale, durably scale and take advantage of the hybrid world. And when you really look at what that means, it translates into higher margins in this business over time. The margins of this business are getting richer and richer as we add more services onto the platform and more software content onto the offerings. And we've made meaningful progress increasing our software and services mix by six points year over year to the current level of about 64%.\n\nAnd we are targeting over 75% by fiscal year '24 as we add more and more software content with storage data services such as Zerto. So we add more softer content with networking services such as Silver Peak and new workloads. So we believe that our ARR is already well above corporate average gross margins, and we are driving it to even higher levels by adding more and more software, high-value content.\n\nTim Long -- Barclays -- Analyst\n\nOK. Thank you very much.\n\nAndy Simanek -- Vice President, Investor Relations\n\nGreat. Thanks for the question, Tim. Next one, please?\n\nOperator\n\nThe next question will come from Amit Daryanani with Evercore. Please go ahead.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nYup. Thanks for taking my question. I guess I was hoping you could talk a little bit about the October quarter guide and what you're implying here. I think the implication is marginal and will be up about 100 basis points, if not more sequentially.\n\nAnd Tarek, I know you talked about better mix potentially there. But maybe you can just help us understand how do you think revenues could look like sequentially versus historical seasonality in October? And then as you think about this 100 basis plus margin expansion, on the operating line sequentially, what are the big enablers of that? If you kind of call this out, that would be helpful.\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nYeah. OK. So let me try and break that down for you through the P&L, Amit. We're entering Q4 with, as Antonio said, enduring demand and a record backlog.\n\nAnd yes, there are still uncertainties in supply chain and the macroeconomic environment with FX. In spite of this, we believe we can grow revenue -- by at least 5% on an as-reported basis. And this reflects above normal seasonality with some supply improvement, but we will still face also a greater currency impact. And so if you take that 5% revenue growth on an as-reported basis and you assume that gross margins will be down modestly quarter over quarter, you have to make that assumption because Compute margins will return to more historical ranges.\n\nYou combine that with the fact that opex should be down modestly because of the measures we're taking and the pause we're putting on hiring and expenses that are discretionary in nature, or any will probably remain flat to slightly down quarter on quarter given the higher interest expense that we are seeing due to interest rates increasing. Tax rate will remain stable. You can assume a 14% effective tax rate as guided at SAM. You take all of that math of revenue, gross margin, opex or I&E and tax and you get to the guide that we gave you of $0.52 to $0.60 non-GAAP EPS for Q4 '22.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nPerfect. Thank you for running the whole model to what we have.\n\nAndy Simanek -- Vice President, Investor Relations\n\nAppreciate it. Thanks for the question, Amit. Next one, please?\n\nOperator\n\nNext question will come from Aaron Rakers with Wells Fargo. Please go ahead.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYeah. Thanks for taking the question. I wanted to go back to kind of the operating margin sustainability and particularly around the Compute segment. If we look back over the past several quarters, you've seen anywhere from high single-digit to kind of high teens declines on a unit basis.\n\nHowever, ASPs have been up 10% to 20% year over year. So I guess my question is, how are you thinking about the durability of that profitability given that ASP uplift that we've seen over the past several quarters. And can you kind of separate the pricing uplift that you've seen between mix versus the pass-through of increased component pricing over the past few quarters? Thank you.\n\nAntonio Neri -- President and Chief Executive Officer\n\nYeah. Maybe I'll start and then I'll give it to Tarek. Thank you for the question. I mean, obviously, we are managing our -- the Compute business very different than our competition.\n\nAnd you see that in our operating margin performance, right, 13.3%, which is over 200 basis points year over year up. But we always guided you and the rest of the Street on an 11% to 13%. So we expect that over time to return to those levels, somewhere in that range. But at the same time, we continue to be incredible discipline in pricing.\n\nAnd that backlog that we have, which is now five times historical levels. Has been priced with that in mind, with that pricing discipline. And so that's why it gives us the confidence that as we go through the next handful of quarters here, we continue to see solid performance. But in the end, we will see obviously the balance between units and AUPs because particularly, memory pricing will start taking effect.\n\nBut at the same time, we are focusing also on profitable growth units in different segments of the market. And one strategy to do so is our GreenLake platform because we are able to reach different customers with different configs with a margin that's more accretive, particularly because all the GreenLake's deals comes with the attach of Pointnext XOS. And one area you're going to see us also shifting is the software that comes with our Compute platform will be delivered also as a SaaS offering on the GreenLake platform as we have now entered or soon to be entered Gen11. So there is that dynamic of unit pricing and then offer configuration with SaaS that we're going to drive through the next generation here.\n\nBut that 11% to 13% is more reasonable in our mind. And clearly, we are doing so by managing our backlog and new orders intake. Tarek, do you have any comments on that?\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nCan I just add a little bit more color on the revenue AUP units dynamic here, right? So I want to flag that our backlog consists of very healthy increases in both units and AUPs, right? The revenue is -- in every quarter is more and more coming from the backlog. And specifically for Q3, regarding units and AUPs, units were down in high teens because of supply chain tightness, but AUPs rose also in the high teens because of richer configs and the pricing actions that we've taken place. So it remains a very dynamic business to watch for. Antonio flagged the need to monitor RAM prices, which we're doing on a daily basis.\n\nAnd we can be very quick at flipping our pricing strategy the other way should the market realign. But I think the longer-term trend that I would like you to focus on is the richer configs. These are the lead driver and the more structural driver of AUP increases rather than the pricing tools and measures that we can take. And we are very, very pleased overall with the way we're driving price, margin, units and mix in this Compute business.\n\nAnd as Antonio pointed out, at 13.3% OP margins, this is by far the most profitable Compute server business in the industry.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYup. Thank you.\n\nAndy Simanek -- Vice President, Investor Relations\n\nGreat. Thanks for the question, Aaron. Next one, please?\n\nOperator\n\nThe next question will come from Wamsi Mohan with Bank of America. Please go ahead.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nYes. Thank you so much. Tarek, maybe just to follow up on that pricing commentary. When you think about the structural versus the cyclical impacts, any way you can parse that on how much of that pricing you're seeing is structural versus cyclical? And as you're talking about the supply improvements how should we reconcile that with the backlog remaining elevated? If we look into fiscal '23 and we start to see moderation over there in unit growth and AUP soften, can you just help us think through the impact to cash flows as well? Thank you so much.\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nYeah. So it's hard to really parse out what is structural by way of configs and/or pricing related with respect to what drives our overall AUP in the Compute business. And the reason for it is our own actions. We have started to steer the demand toward new configs where we do have the supply and particularly the Gen10 plus servers are very successful in the market today.\n\nAnd these are, by definition, higher config relative to the Gen10. And so I would say a large chunk of the success that we have there is driven by our own engineering and the steering of the demand to be able to fulfill the orders that we have in the backlog. And then specifically for cash flow, overall, at the company level, the dynamic that you all need to take into account is starting from the revenue growth that we flagged, which would be at least 5% on a revenue basis, reported basis, applying the margins commentary that we discussed, you're going to have a certain amount of cash earnings growth in Q4 sequentially relative to Q3. But the most important driver of free cash flow in Q4 is our cash flow conversion cycle.\n\nWe already started to see in Q3 as foreshadowed the working capital becoming a tailwind. And in Q4, as we turn through our backlog, and we drive, therefore, higher revenues, we're also going to drive inventory levels down. And our overall cash conversion cycle will move from a positive 18 today to a negative figure, which is favorable to free cash flow generation in Q4. That's the key dynamic that I want you to take away as we work through the inventory, the inventory has peaked in Q3, it will take longer than expected to work through that.\n\nBut overall, our focus is on managing our cash flow conversion cycle, taking it back down to a negative number, which is good for free cash flow, and we're going to start doing so with our team immediately in Q4, and we'll keep it there for the upcoming quarters.\n\nAntonio Neri -- President and Chief Executive Officer\n\nSo Wamsi, just a comment on the question around structural and units and the like. We have talked about this now for a number of years, I will say. And every generation that we introduced in the Compute business, call it Gen10, Gen10.5, soon Gen11, you see that, generally speaking, the rule of two-third, one-third stays through over time, right? Two-third is structural, meaning it's related to the number of options you can attach to the server platform, and that's driven by more memory and more storage and different class of storage because obviously, as you go to NVMe and then go NVMe over Fabrics and others, including SmartNIC, the content of the service becomes richer and richer and therefore, the content of Pointnext XOS also becomes richer because now you have different quantities to support. So over time, when I look at the trends, it's still kind of the same two-third, one-third.\n\nAnd this business continue to be over $12 billion, no matter how you look at it. But I'm confident, as we go through here with GreenLake, the type of configuration becomes richer as well because the cloud experience that we built around it.\n\nAndy Simanek -- Vice President, Investor Relations\n\nGreat. Thanks for the question, Wamsi. Operator, I think we have time for one more, please.\n\nOperator\n\nThe last question will come from Rod Hall with Goldman Sachs. Please go ahead.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nYeah, hi, guys. Thanks for the question. Thanks for squeezing me in. I guess most of my questions have been answered.\n\nI thought maybe I would ask about financial services. That number has been down the last three quarters. Just curious whether you guys are seeing anything within that from an origination point of view or anything else that might give us some hint as to what is going on with different -- various parts of that business. We know there are businesses outside of your own that are in there.\n\nFor comparison, by the way, Dell said they saw increased originations there because of what they're seeing in the broader macro. And I just wondered kind of whether you had any more color on that.\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nYeah, certainly. So yes, similarly to our competitors we're seeing originations or what we call financing volume up. It has increased 4% year over year. And this is driven by strong performance in GreenLake, but also whatever else we decide to finance in HPEFS financial services.\n\nSo the $13 billion lease portfolio is continuing to produce a substantial amount of profits and the profits come from two sources. One, it's a money-over-money business as all their financial services are, it's about spread and making sure that the spread is unaffected by rising interest rates. This continues unabated. And we also are seeing the second profitable driver of growth in HPEFS, which is the fact that in this macroeconomic environment, customers tend to use their equipment for longer, which improves the realization of residual values.\n\nAnd so this is all ticking in the right direction. We're very pleased with this. And if you look back at the quality of the returns from HPEFS, it's extremely high. Bad debt has returned to pre-COVID levels, which is remarkable.\n\nIt shows the resilience of the portfolio and quality of the portfolio. And this is what stands behind a high return on equity of 19.5%, which is up 1.3 points from the prior year, and this is well above my long-term guidance for this business for an ROI of 18% plus and well above pre-pandemic levels. So very happy with the performance of HPEFS.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nThat's great. Thanks a lot, Tarek. Appreciate it.\n\nAndy Simanek -- Vice President, Investor Relations\n\nThanks, Rod, for the question. Antonio, maybe I'll turn it over to you for any final remarks.\n\nAntonio Neri -- President and Chief Executive Officer\n\nYeah. I would just make one point on the last question, which is important that you understand as well. HPEFS is very strategic when you pivot to as-a-Service because as the business grows, you're going to manage a lot of assets. And fleet management is an essential component of the strategy.\n\nAnd that gives us a huge advantage when you have an asset life cycle management set of capabilities and scale because in some cases, customers will say, hey, I'm OK, we're using that solution, and we will have ability to deliver faster for our customers. So I don't want to lose that point from a strategic perspective. Now just to closing, I know some of you have to go probably to the HPQ call, but I will wrap it up saying we had another solid quarter performance as we have done throughout 2022. I think our focus on the strategy, operational execution is absolutely delivering for shareholders, and that's reflected in our results and guidance.\n\nOur pipeline is incredibly strong and our backlog is now record breaking. And that gives us the confidence to deliver against our '22 commitments and the guide that we just provided today. But what I'm really more pleased about is HPE is becoming more and more relevant to our customers because of our approach. And so we have crafted a unique, differentiated strategy that address, what I call, the data first modernization challenges and the opportunity we see in the market, and that's resonated with HPE GreenLake.\n\nSo very confident in our ability to deliver what we discussed today in Q4 and into 2023. And we have a very talented management team and 60,000 employees that really driven by this purpose to pivot the company and deliver for our shareholders. So thank you for your time, and we hope to see you at the Security Analyst Meeting in late October. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAndy Simanek -- Vice President, Investor Relations\n\nAntonio Neri -- President and Chief Executive Officer\n\nTarek Robbiati -- Executive Vice President and Chief Financial Officer\n\nShannon Cross -- Credit Suisse -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nToni Sacconaghi -- Bernstein Research -- Analyst\n\nTim Long -- Barclays -- Analyst\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nRod Hall -- Goldman Sachs -- Analyst\n\nMore HPE analysis\n\nAll earnings call transcripts"
}