{
  "companyName": "MacroGenics",
  "companyTicker": "MGNX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/macrogenics-mgnx-q2-2022-earnings-call-transcript/",
  "content": "MacroGenics (MGNX 3.23%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. We will begin the MacroGenics 2022 second quarter corporate progress and financial results conference call in just a moment. [Operator instructions] At this point, I will turn the call over to Chris James, vice president of investor relations and corporate communications of MacroGenics.\n\nChris James -- Vice President of Investor Relations and Corporate Communications\n\nThank you, operator. Good afternoon, and welcome to MacroGenics' conference call to discuss our second quarter 2022 financial and operational results. For anyone who has not had the chance to review these results, we issued a press release this afternoon outlining today's announcements, which is available under the Investors tab on our website at macrogenics.com. You may also listen to this conference call via webcast on our website, where it will be archived for 30 days beginning approximately two hours after the call is completed.\n\nI would like to alert listeners that today's discussion will include statements about the company's future expectations, plans and prospects that constitute forward-looking statements for purposes of the safe harbor provision under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the Risk Factors section of our annual, quarterly and current reports filed with the SEC. In addition, any forward-looking statements represent our views only as of today and should not be relied upon as representing our views as of any subsequent date. While we may elect to update these forward-looking statements at some point in the future, we specifically disclaim any obligation to do so even if our views change, except to the extent required by applicable law.\n\nAnd now, I'd like to turn the call over to Dr. Scott Koenig, president and chief executive officer of MacroGenics.\n\nScott Koenig -- President and Chief Executive Officer\n\nThank you, Chris. I'd like to welcome everyone participating via conference call and webcast today. This afternoon, I will provide key updates on our clinical programs as well as our restructuring plan intended to extend our cash runway. But before I do so, let me first turn the call to Jim Karrels, our chief financial officer, who will review our financial results.\n\nJim Karrels -- Chief Financial Officer\n\nThank you, Scott. This afternoon, MacroGenics reported financial results for the quarter ended June 30, 2022, which highlight our financial position as well as our recent progress. As described in our release this afternoon, MacroGenics total revenue consisting primarily of revenue from collaborative agreements was $26 million for the quarter ended June 30, 2022, compared to total revenue of $30.8 million for the quarter ended June 30, 2021. Revenue for the quarter ended June 30, 2022, included Margenza net sales of $4.7 million, compared to $3.2 million for the quarter ended June 30, 2021.\n\nAs a reminder, Margenza was launched in the U.S. in March 2021 in coordination with our commercial partner, Eversana. Our research and development expenses were $51.7 million for the quarter ended June 30, 2022, compared to $55.8 million for the quarter ended June 30, 2021. The decrease was primarily related to decreased retifanlimab manufacturing costs for Incyte and decreased costs related to discontinued studies.\n\nThese decreases were partially offset by increased development cost of discovery projects and preclinical molecules, increased clinical expenses related to lorigerlimab and increased costs related to MGC018. Our selling, general and administrative expenses were $13.7 million for the quarter ended June 30, 2022, compared to $50.2 million for the quarter ended June 30, 2021. The decrease was primarily related to decreased Margenza selling costs as well as decreased consulting expenses. Our net loss was $41.3 million for the quarter ended June 30, 2022, compared to a net loss of $39.9 million for the quarter ended June 30, 2021.\n\nOur cash, cash equivalents and marketable securities balance as of June 30, 2022, was $133.7 million, compared to $243.6 million as of December 31, 2021. The June 30, 2022, balance did not include $34.5 million subsequently received from the collaboration partners in July 2022. Finally, in terms of our cash runway, we anticipate that our cash, cash equivalents and marketable securities balance as of June 30, 2022, the $34.5 million in payments subsequently received from collaboration partners, projected and anticipated payments from partners, product revenues plus anticipated savings from our corporate restructuring plan announced today, which Scott will walk through momentarily, should extend our cash runway into 2024. This updated cash runway guidance now reflects anticipated expenditures related to the planned Phase 2 portion of the MGC018 Phase 2/3 study in metastatic castration-resistant prostate cancer as well as MacroGenics other ongoing studies.\n\nAnd now, I'll turn the call back to Scott.\n\nScott Koenig -- President and Chief Executive Officer\n\nThank you, Jim. We made important progress in the second quarter with regard to multiple investigational molecules. Before I walk through the progress we made on our pipeline, let me update you on MacroGenics restructuring plan that we are announcing today. Listeners will recall that over the past several quarters, we have prioritized our pipeline of product candidates and discontinued certain studies to reduce our spending.\n\nWe have initiated additional cost-saving measures to extend our cash runway with the goal of delivering value-creating data with our existing and anticipated financial resources. The additional decisive actions we have announced today should put MacroGenics in a stronger position to execute on our prioritized programs. The cost-saving measures included an approximate 15% workforce reduction in full-time employees and closure of two of our satellite facilities, including a Brisbane, California-based research site and the smaller-scale non-commercial GMP manufacturing site in Rockville, Maryland. We believe these measures will provide resources to advance our pipeline of innovative product candidates.\n\nThe reduction in workforce announced today will be implemented immediately in some areas and completed over time as certain projects are wound down and sites are closed. The decision to reduce our workforce and close two sites was not taken lightly, and we are grateful to every MacroGenics employee who has helped advance our company. With these actions, we believe our updated cash runway should enable the delivery of interim data from the Phase 2 portion of the MGC018 prostate cancer study by the end of 2024, data from the Phase 1 dose expansion of lorigerlimab by early 2023 and data from the dose escalation of MGD024 in AML patients as well as execution of our other ongoing clinical and preclinical studies. In terms of our pipeline, since our last quarterly update, we completed enrollment of the Phase 1/2 dose expansion study with lorigerlimab, a bispecific DART molecule targeting PD-1 and CTLA-4 in advanced solid tumors.\n\nAlso in July, we dosed the first patient in the Phase 1 study of MGD024, our next-generation CD123 x CD3 DART molecule in patients with CD123-positive hematologic malignancies. In addition, we continue to dose patients in the dose escalation combination study of MGC018, our B7-H3-directed antibody-drug conjugate with lorigerlimab in patients with advanced solid tumors. Also, I'm happy to announce that our planned Phase 2/3 study of MGC018 in patients with metastatic castration-resistant prostate cancer has a name, which is Tamarack. We continue to expect to start the Tamarack study by year end.\n\nIn addition to these programs, we and our partners continue to progress our other clinical and preclinical candidates and expect to provide further updates as the data matures. With that backdrop, let me use our remaining time to walk through our updates on our portfolio of investigational clinical molecules starting with MGC018, our ADC designed to deliver DNA- alkylating duocarmycin cytotoxic payload to tumors expressing B7-H3. B7-H3 is a member of the B7 family of molecules involved in immune regulation. MGC018 was designed to take advantage of this antigen's broad expression across multiple solid tumor types.\n\nWe continue to make progress as we operationalize the Tamarack study. After constructive interactions with the FDA and EMA, we provided key details about the design of the Tamarack study during the first quarter conference call. As a reminder, during the Phase 2 portion of the study, approximately 150 patients will be randomized 1:1:1 to receive either two mgs per kg or 2.7 mgs per kg of MGC018 every four weeks in the experimental groups or physician's choice of an androgen receptor axis-targeted, or ARAT, agent such as abiraterone, enzalutamide or apalutimide, not previously received in the control group. Following completion of the Phase 2 portion of the study, an interim analysis of the data will be performed to further inform the Phase 3 portion in which we plan to randomize additional patients one-to-one to receive either MGC018 at the recommended dose or the ARAT agent for the control group.\n\nWe continue to expect to start the Tamarack study by year end and anticipate delivery of interim data from the study by the end of 2024. Next, let me update you on lorigerlimab. We continue to dose patients in the Phase 1 dose escalation combination study of MGC018 with lorigerlimab in patients with advanced solid tumors, including renal cell carcinoma, pancreatic cancer, ovarian cancer, hepatocellular carcinoma, metastatic castration-resistant prostate cancer and melanoma. Based on data from our preclinical studies, antitumor activity with MGC018 may be enhanced by combination therapy with an anti-PD-1 agent without significant incremental toxicities.\n\nDuring the second quarter, we completed enrollment in a Phase 1/2 dose expansion study with lorigerlimab as monotherapy in cohorts of patients with microsatellite stable colorectal cancer, mCRPC, melanoma and checkpoint-naive non-small cell lung cancer. We expect to provide a data update from this study by early 2023. Next up, I'll discuss our efforts to advance treatment of patients with CD123-positive hematological malignancies. MGD024 is our next-generation bispecific CD123 x CD3 DART molecule that incorporates a CD3 component designed to minimize cytokine-release syndrome, while maintaining antitumor cytolytic activity and permitting intermittent dosing through a longer half-life.\n\nWe recently dosed the first patient in a Phase 1 study of MGD024 in CD123-positive relapsed or refractory hematologic malignancies, including patients with acute myeloid leukemia and myelodysplastic syndromes. Enoblituzumab is an investigational FC-engineered B7-H3-directed monoclonal antibody created using our Fc optimization platform being evaluated in solid tumors. In July, we issued a press release announcing the closure of the Phase 2 study evaluating the investigational regimen of enoblituzumab in combination with retifanlimab, an anti-PD-1 monoclonal antibody or tebotelimab, or PD-1XLAG-3 bispecific DART molecule in the first-line treatment of patients with recurrent or metastatic squamous cell carcinoma of the head and neck. The decision to discontinue the study was based on an internal review of safety data and a risk-benefit analysis in frontline patients with squamous cell carcinoma of the head and neck.\n\nWe don't believe this decision has any impact on our other B7-H3 directed programs or our ability to develop enoblituzumab in other indications. At ASCO in June, investigators from Johns Hopkins presented a poster with encouraging clinical activity from an ongoing Phase 2 study of enoblituzumab in patients with localized prostate cancer in a neoadjuvant setting. Enoblituzumab showed encouraging clinical activity with 66% of patients having PSA 0 at a one-year post-app, which correlated with peripheral expansion of tumor-associated T cell clones. The published data from the ongoing investigator-sponsored trial to-date provide rationale for further evaluation of the enoblituzumab in prostate cancer.\n\nNext, I will provide an update of our product candidates being developed by our collaboration partners for which we retain certain economic rights. Our second investigational ADC, IMGC936, which targets ADAM9, a cell surface protein over-expressed in several solid tumor types is being advanced under a co-development agreement with ImmunoGen. Under our 50-50 collaboration, ImmunoGen is leading clinical development and has indicated our plan to complete dose escalation in the Phase 1 study evaluating IMGC936 in multiple solid tumors with initial data anticipated before year end. Teplizumab is an anti-CD3 monoclonal antibody that Provention Bio acquired from us under an asset purchase agreement in 2018.\n\nProvention is developing teplizumab for the treatment of Type 1 diabetes. On June 30, Provention announced the FDA has extended its review period by three months for the BLA for teplizumab. The extended PDUFA target action date is November 17, 2022. MacroGenics is eligible to receive royalties on net sales of teplizumab, if approved, in addition to milestone payments, including $60 million upon BLA approval in the United States.\n\nRetifanlimab is an investigational anti-PD-1 mAb that we exclusively licensed to Incyte Corporation. MacroGenics is eligible to receive royalties on net sales of retifanlimab, if approved, in addition to milestone payments. In July 2022, MacroGenics received $30 million in milestone payments from Incyte as part of its collaboration agreement. Retifanlimab is currently being studied as monotherapy or in combination with other agents across multiple studies.\n\nIn conclusion, we continue to believe 2022 will be another important year for MacroGenics. During the first half of the year, we initiated two clinical studies, and we expect to start Tamarack, a registration-directed study of MGC018 in mCRPC by year end. We remain committed to developing and delivering life-changing medicines to cancer patients. We would be now happy to open the call for your questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] OK. Our first question comes from Jon Miller from Evercore. Please go ahead.\n\nJon Miller -- Evercore ISI -- Analyst\n\nHi, guys. Thank you for taking the question, and congrats on restructuring, a little bit and extending the runway a little bit further. I'd love to get a sense of exactly what the new guidance is though, precisely because it seems like there were two different languages being used into '24, I think, was mentioned in the press release. But then also, Scott, you mentioned having runway through year-end '24 where the Tamarack data was expected.\n\nSo can you just remind me what the exact guidance is, what the language you're going with?\n\nJim Karrels -- Chief Financial Officer\n\nYeah. Thanks, Jon. I'll start, and I think Scott will probably finish this. So the exact guidance is that our cash runway, which reflects not only the $134 million that we had at June 30, but the additional $34.5 million that we received subsequently in the month of July, plus product revenues and other anticipated payments from partners pushes our cash runway into 2024.\n\nScott Koenig -- President and Chief Executive Officer\n\nYeah. And just further on, Jon, obviously, we can get more precision on this when the study starts and how quickly these patients get enrolled. But given where we are right now in that process, we are confident that we'll be able to start this study before the end of the year, getting enrolled during '23 and have the readout by the end of the year. So we think that without exact precision right now because in addition to the milestone payments, which obviously we can never guarantee, we have a considerable amount of BD activity ongoing, which could obviously extend runway further.\n\nWe should be able to provide further precision in the future with regard to how far into '24 that goes.\n\nJon Miller -- Evercore ISI -- Analyst\n\nRight. And one -- maybe one or two more, if I may. I'm curious now at this point about enobli versus MGC018 overlap. And I think maybe it made sense to have them separate before, but I'd love in light of the prioritization for you to tell me a little bit about how you're feeling about having both of these -- having studies ongoing for both these programs? Are they differentiated enough to justify keeping both active, especially as MGC018 sort of advances to later-stage trials? And then, not exactly the same, obviously, but a little bit related.\n\nShould we expect similar dynamics for MGD024 as we had from flotetuzumab? So should we be looking for the same sort of signals in terms of patient subpopulations, refractory versus relapsed patients, that sort of thing as we look forward to early data there?\n\nScott Koenig -- President and Chief Executive Officer\n\nGreat questions. So we were very excited about the updates that the Johns Hopkins Group was able to provide at ASCO. So as you know, that has received a lot of positive feedback in a neoadjuvant setting, which, as you know, is either not or very little efforts are being conducted there in that early setting. Despite the fact of the head and neck setback with regard to the stopping the study for enoblituzumab, the safety profile for enoblituzumab in the early adjuvant prostate setting was excellent.\n\nAnd based on both the encouraging data, the biomarker data and the patients' responses the group that conducted that study and an expanded group are very enthusiastic to look at a very early setting for prostate cancer and enoblituzumab. As you know, our current efforts right now with regard to MGC018 is in the later-line metastatic setting. And so we're, again, focused on both patients that have been experienced with ARAT agents as well as taxane agents, still opportunities to move up the line. But given that we need to have a very clean drug for treating patients with localized disease -- we think enoblituzumab is better set up for pursuing that indication.\n\nNow, I should also indicate that we are looking at other possibilities of the enoblituzumab beyond that of early stage prostate cancer. And of course, as you know, we have the ongoing combination studies of MGC018 on lorigerlimab in seven different tumor types. And based on the results of those studies can guide us in other solid tumor indications going forward with MGC018. And now with regard to the question you had about the MGD024, with respect to flotetuzumab and its use in refractory disease.\n\nAs we've outlined at the last ASH meeting, we are very encouraged that the use in MGD024, both based on the better profile in reducing cytokine release as well as intermittent dosing will allow a much broader application of MGD024, beyond what we were able to do with flotetuzumab, both in late-line refractory patients as well as patients with early disease. In particular, we are extremely encouraged by the combination studies we had with MGD024, and other standard therapies and look to using this quite broadly after we initially do the dose escalation studies in patients with relapsed refractory disease. We're also looking at the opportunity of MGD024, beyond AML, using it in tumor settings where CD123 is overexpressed, including myelodysplastic syndrome and other indications. So there is certainly a differentiation and an expansion of our intended use for MGD024, provided some of the rationale of why we stopped -- pursuing flotetuzumab development.\n\nOperator\n\nOur next question comes from David Dai from SMBC.\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nGreat. Thanks for taking my questions. So I have a couple of questions as well. So first question is just around MGC018.\n\nSo when we look at the Phase 1 dose expansion study that was presented at ESMO last year, we saw that about 30% of patients were dose reduced, and 55% of the mCRPC patients were dose interrupted. So could you provide some color on what was the lowest dose level that was dose reduced? And how long were the duration of dose interruptions for these patients? And then how should we think about the potential read-through to the reduced dose regimen for the Tamarack trial, the Phase 2/3 Tamarack trial?\n\nScott Koenig -- President and Chief Executive Officer\n\nDavid, thank you very much for that question. And obviously, we've been spending a lot of time of analyzing the data that we extracted from the study, not only in patients with prostate cancer, but those that we tested in other solid tumor indications. Again, just to refresh everyone's memory, the expansion cohorts for these studies started out with a 3 mig per kig dosing on a Q3 week level. It turns out the majority of patients had either dose reductions or holding doses with a longer period before the patients were restarted in dosing largely due to side effect profiles.\n\nWe took this into account. We looked at the full data set from all patients treated with MGC018 and identified the ultimate dose that every patient was ultimately treated with during their course therapy and came out with an average amount of drug that was delivered to those patients. We sized up that result with their clinical responses, both in terms of side effect profiles as well as responsiveness. And by doing this, we were highlighting particular side effects that seem most problematic to the continued treatment of patients, ones that we highlighted before was hand-foot syndrome, where while the majority of patients had only grade 1 or grade 2 side effect profiles, very few grade 3s, it turned out a significant number of patients who had grade 2s, which was manifested by the appearance of pain in those patients.\n\nOf course, many of those patients has stopped continuing treatment. And so when we did an analysis of the actual dose that was both effective in inducing responsiveness as well as reducing the incidents and severity of side effects, we saw a difference that fell in that range that we ultimately decided on treating these patients, 2 migs per kig on a Q4 weekly basis up to 2.7 migs per kig on a Q4 weekly basis. So we boxed in that dosing range to ultimately move forward in this now Phase 2 component of the Phase 2/3 study.\n\nOperator\n\nOur next question comes from Stephen Willey from Stifel.\n\nStephen Willey -- Stifel Financial Corp. -- Analyst\n\nGood afternoon. Thanks for taking the questions. Maybe just with respect to MGD024, is there anything that you can say about, I guess, how you're dosing this drug during cycle one? Is it just a flat dose that you're administrating? Is there going to be some attempt to migrate over to some kind of titration regimen? And then if you could speak to the premedication that you're using as well, that would be helpful. And then I just have a quick follow-up on Tamarack.\n\nScott Koenig -- President and Chief Executive Officer\n\nYes. Thanks, Steve. Based on interactions with the FDA, we started out with naval dosing of this drug. This was a requirement and as you know, we spend a lot of time with flotetuzumab, ultimately getting a dose escalation and an increase, particularly on the flotetuzumab in the first week.\n\nWe ultimately believe on the dosing that this can be based on either weight -- body weight or on a flat dosing regimen going forward. So we'll have to see how that goes. But particularly at the lower doses, we expect those to move up quite quickly, but we'll have to see as we move up the line.\n\nStephen Willey -- Stifel Financial Corp. -- Analyst\n\nOK. And then just with respect to Tamarack, can you, I guess, speak to the number of sites that you're hoping to enroll these 150 patients across? And should we just expect that interim analysis of, I guess, efficacy data, what is the trigger for the presentation of that interim data on the efficacy side? Is it going to be based upon some threshold number of radiographic progression events, if there's, I guess, anything that you can say to that, that would be helpful?\n\nScott Koenig -- President and Chief Executive Officer\n\nSo with regard to number of sites, we haven't come up with a final number. We're obviously starting given the regulatory timing of things in U.S. sites. Our plan is to have this as a worldwide study in U.S., Europe and Asia.\n\nSo the -- I can't come up with a specific number that we will ultimately end up with. Obviously, it will be a large number of double digit initially as we do the Phase 2 study, then we'll expand -- the intent would be to expand as we move over from Phase 2 to Phase 3. And we hope by the time we start the enrollment at the end of the year, we'll be able to give a little bit more precision on site engagement and plans for expansion, especially when we get the feedback from the European sites. With regard to the analysis of the data we have, predefined analysis, defined in our protocol that is being given to the DSMB.\n\nAgain, we're not at liberty right now to disclose what those specific -- which will include, obviously, response rates going forward. We obviously have also had the ability to amend that at any particular time during that course of that Phase 2 study. There will be a futility analysis that is incorporated in this during the course of enrollment. Again, the plan is to enroll 150 patients in those three groups to two experimental groups and one control group.\n\nOperator\n\nOur next question comes from Etzer Darout from BMO Capital Markets.\n\nEtzer Darout -- BMO Capital Markets -- Analyst\n\nGreat. Thanks for taking the question. Just again on MGC018. Just wondered if you could speak to a little bit about perhaps the population of patients that you'll look at in the metastatic castration-resistant prostate cancer cohort? Should we think about it similar to what you looked at in the Phase 1/2? And then maybe if you can, again, speak to any appropriate benchmarks we should think about now for that study in terms of how to kind of compare responses that we'll see at interim analysis?\n\nScott Koenig -- President and Chief Executive Officer\n\nSo thanks so much for that question or sets of questions with regards to Tamarack. So again, very similar to what we had enrolled in the expansion cohort of the 40 patients. These will be metastatic castration-resistant prostate patients that had one prior androgen-receptor targeting agent. They can have -- they will have on prior docetaxel regimen.\n\nAnd we will also allow up to one prior cabazitaxel regimen, obviously, in optional but no other prior chemotherapy. The patients will be stratified based on visceral disease, whether they've had cabazitaxel and also regional analysis of the drug. Again, I think the benchmarks differ depending on lines of therapy. And I mean, you're very well aware that, that has a wide range of baseline responses of overall response rates in the two to three months to up to four months baseline depending on the previous lines of therapy.\n\nSo for that reason and obviously, the changing landscape of what these patients are now receiving and obviously, introduction of new agents into the metastatic market, we have included a control group. So we'd be able to do a very good job of benchmarking to the current status of patients.\n\nOperator\n\nOur next question comes from Jim Masaga from FactSet. Your line is open. Please go ahead.\n\nScott Koenig -- President and Chief Executive Officer\n\nWe can skip to the next one.\n\nOperator\n\nOur next question comes from Jonathan Chang from SVB Securities.\n\nFaisal Khurshid -- SVB Securities -- Analyst\n\nHi, guys. Thanks for taking the question. This is Faisal Khurshid on for Jonathan. I wanted to ask for the MGC018 plus lorigerlimab combination.\n\nCan you remind us the study design here, in particular, what dose of MGC018 is being used? And then also, when we might be able to see data for that combination?\n\nScott Koenig -- President and Chief Executive Officer\n\nYeah. Thanks very much. So the starting dose for MGC018 is 1 migs per kig on I think it's Q4 weekly basis now. And lorigerlimab is at 6 migs per kig on the same dosing regimen.\n\nThe plan would be to dose escalate the MGC018. We're going to -- the expected next dose would be 2 migs per kig, and we have other interval dosing. There can be modifications based on side effect profiles, etc. But right now, we're targeting the lorigerlimab dose we like to take forward both as monotherapy in combination and slowly titrate up the MGC018 dosing.\n\nOperator\n\nOur next question comes from Charles Zhu from Guggenheim.\n\nUnknown speaker\n\nHi. This is Edward on for Charles. Maybe regarding MGC018 and apologies if I missed this, but are you planning to present some of the expansion data that you had on the old dosing regimen? I think you talked about last time about maybe later this year, having some prostate and melanoma data.\n\nScott Koenig -- President and Chief Executive Officer\n\nYeah. So thanks very much for the question. At the time we discussed this, we were intending to add an expansion cohort for melanoma. And as you've heard today, with regard to the prioritization program, one of the things we said we're going to hold off on was adding additional patients to the melanoma cohort at this time, despite encouraging data that we had seen.\n\nSo our plans right now on updates on this program, it will depend on when we are going to initiate additional studies with other indications. And at that time, we've got to update everyone regarding our experience with these other indications. So for the prostate, we have our feedback from the key experts, from the regulators and the plan going forward with regard to the Tamarack study. So right now, further updates on this will come in some sort of scientific publication at a future date.\n\nOperator\n\nOur final question comes from Peter Lawson from Barclays.\n\nUnknown speaker\n\nThis is Shay on for Peter Lawson. With the restructuring, could you help us -- how we should be thinking about the opex for the remainder of 2022 and through 2023?\n\nJim Karrels -- Chief Financial Officer\n\nYeah. We're not providing specific guidance today, Shay, with regard to the expenses. What we are providing, as you've heard us say, is the cash runway. I'll note that the anticipated savings from headcount on a steady-state basis should be approximately $10 million annually.\n\nNow that's not -- this year, obviously, because we're more than halfway through the year but in full -- the full amount of the savings from the approximate 15% of reduction in force.\n\nOperator\n\nWe do have a final question from Jim Masaga from FactSet. Your line is open. Please go ahead. At this time, I would now like to turn the call over to Dr.\n\nScott Koenig for closing remarks.\n\nScott Koenig -- President and Chief Executive Officer\n\nThank you, everyone, for joining our call today. We look forward to updating you on the progress of our various programs in the near future. We hope you have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris James -- Vice President of Investor Relations and Corporate Communications\n\nScott Koenig -- President and Chief Executive Officer\n\nJim Karrels -- Chief Financial Officer\n\nJon Miller -- Evercore ISI -- Analyst\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nStephen Willey -- Stifel Financial Corp. -- Analyst\n\nEtzer Darout -- BMO Capital Markets -- Analyst\n\nFaisal Khurshid -- SVB Securities -- Analyst\n\nUnknown speaker\n\nMore MGNX analysis\n\nAll earnings call transcripts"
}