{
  "companyName": "Li Auto",
  "companyTicker": "LI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/09/li-auto-li-q3-2022-earnings-call-transcript/",
  "content": "Li Auto (LI 4.67%)\nQ3 2022 Earnings Call\nDec 09, 2022, 7:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen, thank you for standing by for Li Auto's third quarter 2022 earnings conference call. At this time, all participants are in listen-only mode. Today's conference call is being recorded. I will now turn the call over to your host, Janet Chang, investor relations of Li Auto.\n\nPlease go ahead, Janet.\n\nJanet Chang -- Investor Relations\n\nThank you, Matt. Good evening and good morning, everyone. Welcome to Li Auto's third-quarter 2022 earnings conference call. The company's financial and operating results were published in the press release earlier today and are posted on the company's IR website.\n\nOn today's call, we have our president, Mr. Kevin Yanan Shen, and our CFO, Mr. Johnny Tie Li, to begin with prepared remarks. Our founder and CEO, Mr.\n\nXiang Li, together with our senior management, Mr. Donghui Ma and Mr. Yan Xie, will join for the Q&A discussion. Before we continue, please be reminded that today's discussion will contain forward-looking statements made under the Safe Harbor provisions of the U.S.\n\nPrivate Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's actual results may be materially different from the views expressed today. Further information regarding risks and uncertainties is included in certain filings of the company with the U.S.\n\nSecurities and Exchange Commission and the Hong Kong Stock Exchange. The company does not assume any obligation to update any forward-looking statements except as required under applicable law. Please also note that the Li Auto's earnings press release and this conference call include discussions of unaudited GAAP financial information, as well as unaudited non-GAAP financial measures. Please refer to Li Auto's disclosure documents on the IR section of our website, which contain a reconciliation of the unaudited non-GAAP measures to comparable GAAP measures.\n\nWith that, I will now turn the call over to our president. Please go ahead, Kevin.\n\nKevin Yanan Shen -- President\n\nThank you, Janet. Hello, everyone, and thank you for joining our call today. I will review our third quarter key highlights. In the third quarter, we navigated our model succession and launch cycle, as well as a challenging macro environment and supply chain constraint.\n\nAgainst this backdrop, we delivered 26,524 vehicles, up 5.6% year over year. Despite a supply chain bottleneck, we delivered over 10,000 Li L9s in September, the model's first full month of production. This marked the first time that a Chinese-branded premium model priced over RMB 400,000 achieved monthly sales of more than 10,000 vehicles, demonstrating Li L9 as a topic among full-size SUVs for family users. This success was due to the exceptional strength of our team, their outstanding management of the Li L9 ramp-up process and their skillful collaboration with our supply chain partners.\n\nAs Li L9 continues to surpass user expectation with class-leading features in drivability, safety, interior, space, passenger experience, and smartness, demand remained robust, providing constant -- constantly strong order inflow for the model. Li L9 has been the sales champion among full-size SUVs in China since its delivery started. Benefiting from a Li L9 strength, our total delivery in October reached 10,052, representing a 31.4% year-over-year increase. This, followed by a record-breaking 15,034 vehicle deliveries in November.\n\nAs always, we would like to extend the sincere gratitude to our over 200,000 Li ONE users. We will continue to adhere to higher the industry service standards and continue to improve the performance of Li ONE through OTAs. On September 30th, we launched Li L8, a six-seat premium family SUV that succeeded Li One. We also unveiled Li L7, a seven-seat flagship family SUV on the same day.\n\nWe commenced the deliveries of Li L8 in November. Let me provide more details of this vehicle. Li L8 employs our new-generation all-wheel drive range extension system and boasts over 100 features in their standard configurations. It's available in two trims, Pro and Max, providing users with flexible choices of smartness.\n\nThe two trims are harnessed, respectively, with the Li AD Pro and Li AD Max autonomous driving systems. Pro is powered by the Horizon Robotics Journey 5 chip with 128 TOPS of computing power, while Max is powered by the dual Orin-X chips with 508 TOPS of computing power. In addition, the two trims are equipped with innovative, smart space systems, SS Pro and SS Max, featuring a first-row four-screen interactive system and a five-screen, three-dimensional interactive system, respectively. These packages bring a new level of driving and entertainment experience to smart electric vehicles.\n\nWe are pleased that Li L8 numerous class-leading feature have delighted its first batch of users, and we believe that their satisfaction for the vehicle has broadly exceeded their expectations. We are confident that Li L8 will stand among the finest options for six seaters priced over 3,000 -- RMB 300,000, and together with Li L9, the sales champion of full-size SUVs in China, and the Li L7, which we believe will be a top choice among five-seat SUVs priced over RMB 300,000. We expect it to captivate a broader range of family users with differentiated needs and to gain a larger market share in the RMB 300,000 to RMB 500,000 price segment. We are encouraged by Li L9's continued strong sales performance and the solid demand for Li L8.\n\nBut considering the ongoing supply chain uncertainty, we expected fourth quarter deliveries to be in the range of 45,000 to 48,000 vehicles. We will continue to collaborate closely with our supply chain partners to react quickly to changes and to mitigate potential risks. During the third quarter, we continue to demonstrate our strong commitment to vehicle safety. According to the vehicle safety evaluation results released on November 4th by the China Insurance Automotive Safety Index, or CIASI, Li L9 obtained the G rating, the highest safety rating, in three out of four evaluation categories: occupant safety, pedestrian safety, and assistance safety.\n\nIn the category of crashworthiness and repair economy, Li L9 received an M rating, one of the top results received by premium vehicles tested by CIASI since 2017. In addition, it was the first domestic full-size SUV tested for 25% frontal offset impact on both the driver and passenger sides and achieved the G rating for both tests. Thanks to its ultra-high-strength body structure, Li L9 also demonstrated class-leading performance with the ability to withstand a peak force of 116,475 Newtons in the roof strength test. Its roof can withstand a weight of 11.8 pounds on the side, effectively preventing cabin deformation and the safeguard of relatively large head space for drivers and passengers to survive in case of accidents.\n\nWe continue to -- we continually improved our vehicles' performance and features through OTA after their delivery. In early November, we released our OTA 4.1 upgrade for Li L9, further enhancing user experience with our upgraded Li AD autonomous driving system and smart in-car voice assistant, Li Xiang Tong Xue, as well as improve the smart space interactions and entertainment experiences. In particular, the vehicle's three 15.7-inch 3K automotive grid OLED screens can now project the same events and all game from the three different camera angles, transforming Li L9 into a great sports lounge for families and friends to watch games such as the ongoing FIFA World Cup. To create successful products, we have two core goals.\n\nFirstly, for consumers, we choose to exceed their needs rather than merely meeting them. Secondly, as a company, we aim to achieve healthy gross margin and self-sustaining cash flow, which will allow us to continually invest in our dual growth engine of R&D and the business capabilities. Especially, our R&D efforts will be directed more comprehensively across products, platforms, and systems with a long-term goal of growing into a world-class technology company. Our business capability, including the commercial supply and organization capabilities with continued investment in R&D and business capability, supported by our healthy gross margin, we will continue to pursue product and commercial success and to foster a healthy long-term development model.\n\nThis flywheel has been the strategic focus since our founding and we believe will remain our strategy going forward. By understanding this business model, you will understand Li Auto more. Our supply chain remains one of the most significant variables with respect to our deliveries. We are accelerating supply chain deployment and optimization to build our resistance for fluctuations and to support our rapid growth sales.\n\nImportantly, we are committed to extending our in-house development and manufacturing capability vertically along our supply chain. Through our forthcoming self-owned manufacturing base and the majority-owned JVs, we expect to be able to self produce both range extenders and the five-in-one electric drive unit that can support our EREV delivery targets. On the BEV side, we have commenced construction of a semiconductor manufacturing base in high-tech zone of Suzhou, Jiangsu province in the third quarter. It will focus our R&D and production of automotive-grade power module based on third-generation semiconductor material, silicon carbide.\n\nThe power module is a core component of our self-developed eight-volt electric drive system. Alongside our dedicated investment in supply chain, we continue to expand our direct sales and servicing network and increase our brand awareness with upgraded brand image to view our business expansion. As of November 30th, 2022, we have 276 retail stores covering 119 cities, as well as 317 service centers and Li Auto-authorized body and paint shops operating in 226 cities. During the third quarter, we also started to open retail stores in places other than shopping malls, such as automotive theme parks, to diversify our locations and reach more varied target users.\n\nThe retail stores we opened at Hangzhou [Inaudible] Auto Theme Park in September is a good example, featuring our new design language and warm colors. It creates a welcoming, interactive space for visitors. It also enjoys strong food traffic due to its excellent location and word-of-mouth publicity. In addition, this store also offers customers a comprehensive and convenient experience with combined showroom and delivery center functions.\n\nThe expansion and upgrade of our direct sales and servicing network have boosted both our brand recognition and our ability to fulfill user demand for our compelling products, which we are confident will drive meaningful sales growth going forward. We will continue to innovate new retail formats, finding new ways to attract more users while providing them with better services and experiences. Moving to R&D, we believe R&D capability lies at the core of product competitiveness as we scale our company from one to 10. Therefore, we insist on full stack self-development of core technologies such as electric drive, intelligent space, and autonomous driving systems.\n\nWe have spared no effort in solidifying our leadership in the EREV space with continued investment in our new-generation range extension system. In addition, we are actively self developing the key building blocks of our eight-volt HPC BEV platform, including the power chip, power module, electronic control unit, electric motor, and transmission system, aiming to be one of the first automaker to roll out HPC BEV vehicles. We are also proud to lead the industry in smart space R&D. For example, we self-developed our smart space Li AI system powered by MIMO net, a six-zoom human voice enhanced network and the MVS net, a multi-view vision confusion network.\n\nLi AI can help create accurate sound perception in a complex acoustic environment and identify complicated gestures, enabling an unparalleled in-car entertainment and interactive experience. With respect to autonomous driving, as of November 30th, more than 170,000 family users have enjoyed our highway [Inaudible] feature. We have further enhanced our vehicles' ability to perceive dynamic obstacles and the static road structures in a complex environment, as well as their ability to forecast traffic participants' action. We were the first in the industry to extend the concept of 3D hypothesis, 2D verification to multimode sensor, and Li L9 was the first to to realize highway and away based on an NVIDIA Orin SoC chipset.\n\nMeanwhile, we have partnered with Qinghai University and MIT to complete the world's first public project to construct high-precision maps in real time. Intelligent manufacturing is another core competency for our -- for any successful automaker and another area in which we excel. First, we have industry-leading manufacturing equipment. Our fully self-developed manufacturing manual -- management software, Li MOS, can greatly improve production efficiency and quality with precision control during the entire automotive manufacturing process.\n\nThis system will be implemented in all our future factories, shortening new factories' deployment cycle by more than three months. Our R&D efforts are not limited to building a great car but also how to make it. We use vision sensors and algorithms to precisely control the workflow of hardware equipment in order to realize flexible production and intelligent inspection. As we strive to enhance our R&D and manufacturing capabilities, we also aspire to make a positive environmental and social impact through our sound governance structure and dedication to sustainable development.\n\nIn September 2022, we received an MSCI ESG rating of AA for the second year in a row, maintaining our leadership position in the automotive industry in terms of ESG performance. Moreover, following the earthquake in Luding County, Sichuan province on September 5th, we made a donation to help the affected people and to support disaster relief efforts. We hope to play our part as a corporate citizen and a member of the community by helping people in need. We look forward to sharing more of our ESG endeavors in our next ESG report, which we expect in the first half of next year.\n\nIn addition, we have -- we are pleased to be included as a constituent stock in the Hang Seng China Enterprises Index effective December 5th. This is a strong recognition of our underlying strength and investment value. Lastly, as you may have seen from today's press release, from January 1st, 2023, I will no longer serve as the company's president. I will spend more time to support the company's new round of organizational upgrade to prepare for its future.\n\nIn the future, our CEO, Li Xiang, will take over the responsibility of sales and services. Our newly appointed president, Mr. Ma Donghui, will be responsible for the overall closed-loop management from product R&D to procurement and supply, production, and manufacturing, and quality. Xie Yan, our new CTO, will lead the company's R&D team to explore the most advanced underlying technologies in the smart electric vehicle industry.\n\nI would like to thank our investors for the support and trust they have placed in Li Auto and myself. I firmly believe that Li Auto will continue to achieve great results under the leadership of the new management team and continue to lead the smart new energy vehicle industry in China. With that, I will turn the call over to our CFO, John, for a closer look of our financial performance. Please go ahead.\n\nJohnny Tie Li -- Chief Financial Officer\n\nThank you, Kevin. Hello, everyone. I will now go over some of our financial results for the third quarter of 2022. Being mindful of the length of this call, I will address financial highlights here and encourage you to refer to our earnings press release, which is posted online for additional details.\n\nOur total revenue -- revenue in the third quarter of 2022 were RMB 9.34 billion, or USD 1.31 billion, representing a increase of 20.2%, from RMB 7.78 billion in the third quarter of 2021. This included RMB 9.05 billion, USD or 1.27 billion, of vehicle sales in the third quarter of 2022, up 22.5% year over year and 6.6% quarter over quarter. This increase was mainly due to our delivery of Li L9 starting in late August, which raised our average selling price in the third quarter of 2022. Revenues from other sales and services were RMB 296.4 million, or USD 41.7 million, in the third quarter of 2022, representing a decrease of 23.9% from the same period last year and an increase of 19% from the second quarter of this year.\n\nThe year-over-year decrease was attributable to the sales of automotive by regulatory credits in the third quarter of 2021, which didn't recur in the third quarter of 2022. The quarter-over-quarter increase in revenue from other sales and services was mainly due to the increased sales of accessories and the services in line with higher accumulated vehicle sales. Cost of sales in the third quarter of 2022 was RMB 8.16 billion, or USD 1.15 billion, representing a increase of 36.8% year over year and the increase of 19.1% quarter over quarter. The increase in cost of sales was mainly driven by higher average cost of sales due to our delivery of Li L9 starting in late August and a provision related to Li ONEs as we lower its order forecast considering the stronger-than-expected market demands for Li L9 and our accelerated launch of Li L8.\n\nThe provision in the amount of RMB 802.8 million, or USD 112.9 million, was made based on our updated order forecast for Li ONE after the launch of Li L9 and Li L8. Gross profit in the third quarter of 2022 was RMB 1.18 billion, or USD 166.2 million, decreasing 34.8% year over year and 37.1% quarter over quarter. Vehicle margin in the third quarter of 2022 was 12%, compared with 21.1% in the third quarter of 2021 and 21.2% in the second quarter of this year, mostly due to the provisions related to Li ONE I just mentioned. Excluding this impact, the vehicle marking was 20.8% in the third quarter of 2002.\n\nGoing forward, with our production ramp-up and responsible cost management, we expect to realize greater economy of scale and to drive costs down further, putting us back on track to hit our profitability inflection point. Gross margin in the third quarter of 2022 was 12.7%, compared to 23.3% in the third quarter of last year and 21.5% in the second quarter of this year. Operating expenses in the third quarter of 2022 were RMB 3.31 billion, or USD 465.6 million, increasing 73.4% year over year and 15.9% quarter over quarter. R&D expenses in the third quarter of 2022 were RMB 1.8 billion, or USD 253.6 million, up 103.1% year over year and 17.8% quarter over quarter.\n\nThe year-over-year increase was primarily driven by increased expenses associated with future models, as well as increased employee compensation as a result of our growing number of R&D staff. The quarter-over-quarter increase was primarily driven by increased expenses associated with future models. Selling, general, and administrative expenses in the third quarter of 2022 were RMB 1.51 billion, or USD 211.9 million, up 47.6% year over year and 13.8 quarter over quarter. The year-over-year increase was primarily driven by increased employee compensation as a result of growth of the growth in our staff, as well as increase in rental expenses associated with the expansion of the company's sales network.\n\nThis quarter-over-quarter increase was primarily driven by increased marketing and promotion activities and increased employee compensation as a result of the growth in our staff [Inaudible]. Loss from operations in the third quarter of 2022, was RMB 2.13 billion, or USD 299.4 million, compared to a loss of RMB 97.8 million in the same period last year and a loss of RMB 976.5 million in the second quarter of this year. Net loss was RMB 1.65 billion, or USD 231.3 million, in the third quarter of 2022, comparable with RMB 21.5 million in the third quarter of last year and RMB 641 million in the second quarter of 2022. And now, turning to our balance sheet and the cash flow.\n\nOur cash and cash equivalents, restricted cash, time deposits, short-term investments, long-term time deposits and long-term financial instruments that were included in long-term investments total RMB 55.83 billion, or USD 7.85 billion, as of September 30th, 2022. Net cash used in operating activities in the third quarter of 2022 was RMB 508.3 million, or USD 71.5 million. The change in net cash used in operating activities over both the third quarter of last year and the second quarter of this year was mainly due to the increased impairment related to inventory purchase, partially offset by the increase in cash received from the customer. Free cash flow was negative RMB 1.96 billion, or negative USD 275.3 million, in the third quarter of 2022.\n\nAnd now, for our business outlook. For the fourth quarter of 2022, the company expects deliveries to be between 45,000 and 48,000 vehicles, representing a increase of 27.8% to 36.3% from the fourth quarter of last year. The company also expects fourth quarter total revenues to be between RMB 16.51 billion and RMB 17.61 billion, or USD 2.32 billion and USD 2.47 billion, representing an increase of 55.4% to 55.6% from the fourth quarter of last year. This business outlook reflects the company's current and preliminary view on the business situation and the market condition, which is subject to change.\n\nGoing forward, we believe our nimble and [Inaudible] corporate culture, execution discipline, and strong balance sheet will allow us to face challenging markets head on and continue to deploy capital and resources efficiently to focus on our products and innovation initiatives and drive our long-term growth. I will now turn the call over to the operator and to start the Q&A session. Thank you.\n\nOperator\n\nThank you. [Operator instructions] Please ask your question in Chinese first, then follow with the English translation. And our first question will come from Tim Hsiao with Morgan Stanley. Please go ahead. \n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So, my first question is about vehicle cells. So, how should we think about the stable monthly run rate of the cells of L7, 8, 9 in aggregates next year? Could the cells of the whole L family models stay at around, like, 25,000 to 30,000 level on a monthly basis as previously expected? And in the meantime, considering the declining store traffic in October, November due to the COVID, does [Inaudible] so far remain strong and adequate enough to bolster the delivery momentum into first quarter 2023? [Inaudible]\n\nKevin Yanan Shen -- President\n\nYeah. Tim, you want me answer your first question first, right? OK. About the outlook of L9, 8, and L7, so, we can only make a judgment based on the competitiveness of this -- this product and also then outlook based on the -- the market size of each of these products, this segment. So, our outlook is that L9, the stabilized, the monthly US sales should be around 8,000 to 11,000.\n\nThat's our estimation. And for L8 will be 10,000 to 15,000, yeah -- 14,000. And L7, now it's quite early to to do estimation. Yeah.\n\nSo, basically, the -- the -- for the Q1 outlook, we believe the beginning of Q1, well, our backlog will continue to drive strong delivery performance. And of course, after Chinese New Year, we need to bring more order in. We have strong confidence that, in Q1, we'll continue to beat the overall PV market performance. But, Tim, as you mentioned, there are some factors that beyond our control, like COVID, but we believe we'll beat the overall PV market performance.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nThank you. [Foreign language] So, my second question is about the battery EV, the BEV. With the current update on BEV pipeline, will the company follow its original plan to launch two BEV models next year, in 2023? [Foreign language]\n\nUnknown speaker\n\nHmm. [Foreign language] So, we we're pretty certain that next year we'll be releasing our first electric vehicle. And so, the two big events for next year was the release of the first electric vehicle, and the other one is the delivery of -- delivery of L7.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] Thank you very much for the updates.\n\nOperator\n\nOur next question will come from Olivia Xu with Goldman Sachs. Please go ahead.\n\nOlivia Xu -- Goldman Sachs -- Analyst\n\n[Foreign language] Now, let me translate my two questions. The first question is about the pricing and competition. Recently, Tesla has announced a meaningful pricing cut in Chinese market. What is Li Auto's reaction to that? And how should we examine such pricing competition next year as it's expected to be more severe? The second question is on the supply chain management.\n\nAs Kevin mentioned in the briefing, there exist supply chain uncertainties. Could you please clarify what's the key bottleneck for now? And as the COVID-related policies change a lot recently, what is the extent of the impacts on the outlook for production in the next several months? Thank you.\n\nKevin Yanan Shen -- President\n\nThank you, Olivia. Let me take your question. Your first question about the price cut from the Tesla side, actually, we see a little impact on order flow because of our product right now, L9 and L8, is the -- is the -- the price segment is higher than Tesla's main selling model. Yeah.\n\nAnd we would expect the -- the same --same kind of situation next year. So, yeah, we -- we still have a strong confidence that in this industry turmoil -- turmoil, we'll continue to lead. Yeah. For your second question about the supply chain, yeah, of course we -- we -- we are glad to see the -- the -- the new COVID policy that, ultimately, the -- the -- with the -- with the pandemic, will result actually the supply chain get back to normal.\n\nBut as we should all know that for the next two, three months, based on the trend we see in other foreign countries, that once the policy change, we -- we may see here and there the manpower shortages. Yeah. Right now, we already see some of this kind of manpower shortages impact our production, especially in our suppliers side. Yeah.\n\nSo, we are working closely with our supply chain partners, try to mitigate all these risks, and we even start to prepare some of the workforce ourselves. Whenever there is a shortage, we'll send the workforce to help our supply -- supply partners. Yeah.\n\nOlivia Xu -- Goldman Sachs -- Analyst\n\nGot it. That's very clear. Thank you.\n\nKevin Yanan Shen -- President\n\nThank you.\n\nOperator\n\nOur next question will come from Ming Hsun Lee with Bank of America. Please go ahead.\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] My first question is regarding your decision to make a silicon carbide by yourself. And compared to your peers, some choose to build internal capacity production. Some decide to design chips by themselves, quality decision -- quality decision is made for this capacity field. Thank you.\n\nKevin Yanan Shen -- President\n\nThank you, Ming. This is Kevin. Let me take this question. Actually, just to clarify, we are not the [Inaudible] -- not manufacturing the silicon carbide chipset.\n\nActually, we're making the power drive module with the chipset. So, why we choose to design our own power module is because the power module is closely integrated into our five-in-one electric motors and also three-in-one electric motors. So, therefore, the -- the thermal solution and the the size of this module are very important for our competitiveness and the energy efficiency. That's why we choose to build this module by our design and build these modules by ourselves.\n\nYeah. Just to clarify.\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\nYeah, thank you, Kevin. My second question, the new energy vehicle policy will change in Shanghai in 2023. So, could you remind us what is the current contribution from Shanghai area? And how do you see that impact after the policy change? Because that will speed up your -- actually, the EV launch in order to meet the potential orders after the policy change. [Foreign language]\n\nKevin Yanan Shen -- President\n\nThank you. So, Shanghai come for 6% to 5% of our sales volume. Yeah. So -- so, of course, the policy change, of course, will have some impact on our -- our sales in Shanghai.\n\nBut actually, as we should all know, most of the auto customer are not buying a new car. They are kind of upgrading their car. So, in theory, they already have the car plate. So, therefore, we are actively working with our design team to build a new sales strategy for next year, yeah, to mitigate the impact of this policy change.\n\nBut again, overall, Shanghai's only like 6% of our sales total volume. Yeah. And about the BEV actually are just now -- these are in this course next year. We're going to have a launch of our first BEV.\n\nYeah.\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language]\n\nOperator\n\nAs a reminder, please first ask your question in Chinese and then translate into English. Our next question will come from Xu Yingbo with CITIC. Please go ahead.\n\nYingbo Xu -- Citic Group -- Analyst\n\n[Foreign language] My first question is about, Li ONE has come some costs about 80 million -- 800 million -- cost [Inaudible] 80 billion. So, what is the principle for this cost and how can we expect for the future potential cost of produced ONE? And my second question is about matrix organization. Could you please talk about more about that? Thank you.\n\nJohnny Tie Li -- Chief Financial Officer\n\nI will take your provision question. This is Johnny. And for this provision, it's always related to the raw materials, which means the products already in our inventory or the purchase commitment we made to our suppliers for those inventory and the parts commitment we don't want -- we don't plan to make it into vehicles in the future. So, the provision was based on the lower of cost and the net realizable value based on our estimate and negotiation with the vendors.\n\nSo, it's our estimate for when I finally realized in the next two quarters there will be some minor adjustment to the final amount. Comparative with quarterly gross margin, it's not very significant.\n\nKevin Yanan Shen -- President\n\nYeah. Second question, I think [Foreign language]\n\nUnknown speaker\n\n[Foreign language] Actually, since we founded Li Auto, we've always dreamed of becoming a $1 trillion -- or RMB 1 trillion company. And as you can see, next year, we're expecting to become a RMB 100 billion company already. So, personally, I have never run a -- built a company from zero one -- $100 billion company from scratch. And most of my colleagues have not had that experience either.\n\nMost of my colleagues either they come from companies that are smaller than that or they come from companies that became that large years ago, or they they work off of remote office. They are not headquartered in China. So, we have seen this issue a long time ago. So, since 2019, we've been starting to study software and hardware companies that have reached the size of RMB 1 trillion very, very deeply to see how they manage their business at different stages and what we can learn from them.\n\nAnd one thing in common that we've seen is that they've all transformed to a matrix organization wen they reached the level of about RMB 10 billion. And so, for Li Auto, when we started from zero one -- speed one efficiency, speed meant everything. But as time went on, we saw that in a very long value chain where quality and efficiency is very important in our one to 10 stage, quality of efficiency. So, a successful enterprise will need to be able to -- for their internal purposes, we need to have a very robust planning perception, execution process.\n\nAnd for their customers, they need very strong R&D, strong product, sales, and services. So, the matrix organization was the only way to manage this entire process end to end. To make an analogy, the horizontal teams make sure that they built the roads, they maintain the roads, and the good -- the roads are good to run for vehicles. And the vertical teams are the ones that build cars, maintain the fleet, and make sure the cars run smoothly on the road, and these cars on the well built and maintained roads are responsible for delivering goods, services, and products to our -- our consumers, which forms a very healthy cycle.\n\nSo, we first started piloting this thought in what we call IPD, integrated product development. And the process has actually been validated by the success of L9, L8 and 7, where you might have seen the success of Li ONE which, you know, in certain view, could be a coincidence. But through the application of IPD, we've made that a certainty so that we can replicate the success with our current and ongoing future product development. So, we are now in the process of applying our pilot process in a much larger scale to make sure that our -- our company can continue to churn out successful products and services to our customers.\n\nOperator\n\nAnd our last question will come from Jing Chang with CICC. Please go ahead.\n\nJing Chang -- CICC -- Analyst\n\n[Foreign language] So, my first question is about the effect of [Inaudible] R&D [Inaudible] to increase to 1.5 billion [Inaudible]. So, can you give us more [Inaudible] value for next year [Inaudible]. And consumers expect we will have a brand-new BEV platform model in the market, and a more complex, complicated [Inaudible] and a multichannel network layout. So, you know, [Inaudible] R&D, so this part mainly through -- mainly through our in-house research.\n\nJohnny Tie Li -- Chief Financial Officer\n\nHello, this is Johnny. I will take your first question about R&D expenses. This year, R&D expenses will adjust as we guided, will be around USD 1 billion, which is RMB 7 billion for the whole year, so, as expected. And for next year, currently, we see over RMB 10 billion to RMB 12 billion, depending on our final decision on some of our investment.\n\nIt will start next year or in 2024. So, it will be, yeah, RMB 10 billion to RMB 12 billion for next year.\n\nKevin Yanan Shen -- President\n\nYeah.\n\nUnknown speaker\n\n[Foreign language] If we look back to 2020, until now, our R&D spending mostly fall into three areas. The first area is product development, which you see similar exercises in traditional car OEMs. The second one is technological platforms, including our REV platform, our high-voltage BEV platform, our smart space platform, autonomous driving platform. These are shared platforms that all of our vehicles use.\n\nThe platform innovation allow us to maximize cost -- or the cost efficiency, R&D efficiency, and user experience, and make sure that they're consistent across all products of our company. The third one is new and fast growing is our system development, which includes supercomputing, typically in platform -- cloud computing platform on our IT infrastructure. These are very long term but crucial, important investments for our company. And in terms of organization, our product and technological platforms are run by Mr.\n\nMa Donghui, and system development is run by our CTO, Xie Yan. And in terms of spending level, we spend the most today in technical platforms, followed by product, and then, thirdly, system infrastructure. And going forward, we expect to see more spending in system and infrastructure, which might eventually overtake technological infrastructure because we think, in the longest term, our -- the most crucial investment or our competitive advantage lies in our system and infrastructure capability.\n\nJing Chang -- CICC -- Analyst\n\n[Foreign language] My second question is about product and design planning. Any add to the family car market segment? How can you keep [Inaudible] product differentiation in your different models, such as SUV or MPV, and also different number of the seats? What can be looking forward to get greater differentiation?\n\nUnknown speaker\n\n[Foreign language] Our philosophy is the same as before. We still believe that price and seat configuration is the best way to segment the market. And this has been partly tested by the success of L9 and 8 and 7, which is soon to start delivery, in that these three cars actually have attracted three very different user groups. If you look at L9, it's pretty much attractive to premium car buyers at the same price point or even higher than the current price level of L9.\n\nAnd L8 pretty perfectly replaced Li ONE and has shared a very similar customer base as Li ONE. And L7 has been attracting a lot of young family users aged between 25 and 35. So, as you can see, pricing and seat arrangements have allowed us to very efficiently cover the market and different user groups. And there have even been some surprises, in the case of L7, where we've been able to tap into new age groups that we hadn't -- we weren't expecting before.\n\nJing Chang -- CICC -- Analyst\n\n[Foreign language]\n\nOperator\n\nAs we're reaching the end of our conference call, I'd like to turn the call back over to the company for closing remarks. Ms. Janet Chang, please go ahead.\n\nJanet Chang -- Investor Relations\n\nThank you once again for joining us today. If you have further questions, please feel free to contact Li Auto's investor relations team. Then that's all for today. Thank you and have a good weekend.\n\nOperator\n\nThe conference is now concluded. Thank you for attending today's presentation. You may now disconnect.\n\nDuration: 0 minutes\n\nJanet Chang -- Investor Relations\n\nKevin Yanan Shen -- President\n\nJohnny Tie Li -- Chief Financial Officer\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nOlivia Xu -- Goldman Sachs -- Analyst\n\nMing Lee -- Bank of America Merrill Lynch -- Analyst\n\nYingbo Xu -- Citic Group -- Analyst\n\nJing Chang -- CICC -- Analyst\n\nMore LI analysis\n\nAll earnings call transcripts"
}