{
  "companyName": "Walt Disney",
  "companyTicker": "DIS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/walt-disney-dis-q4-2022-earnings-call-transcript/",
  "content": "Walt Disney (DIS -0.34%)\nQ4 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to The Walt Disney Company's fiscal full year and Q4 2022 earnings results conference call. [Operator instructions] At this time, I'd like to turn the floor over to senior vice president of investor relations for The Walt Disney Company, Alexia Quadrani. Ma'am, please go ahead.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nGood afternoon. It's my pleasure to welcome everybody to The Walt Disney Company's fourth quarter 2022 earnings call. Our press release was issued about 25 minutes ago and is available on our website at www.disney.com/investors. Today's call is being webcast, and a replay and transcript will also be available on our website.\n\nJoining me for today's call are Bob Chapek, Disney's chief executive officer; and Christine McCarthy, senior executive vice president and chief financial officer. Following comments from Bob and Christine, we will be happy to take some of your questions. So, with that, let me turn the call over to Bob to get started.\n\nBob Chapek -- Chief Executive Officer\n\nThank you, Alexia, and good afternoon, everyone. Fiscal 2022 was a strong year for our company as we continued our journey of telling incredible Disney stories, utilizing groundbreaking technology in order to further develop our brands and franchises while customizing and personalizing experiences to make magical memories that last a lifetime. Those efforts resulted in truly phenomenal storytelling, record annual results at our parks, experiences, and products segment, and outstanding growth at our direct-to-consumer services, which added nearly 57 million subscriptions this year to reach a total of more than 235 million. We are particularly pleased with growth in the fourth quarter, which saw the addition of 14.6 million subscriptions across our suite of services, including 12 million Disney+ subscriptions, over 9 million of which were Core Disney+.\n\nIt has taken just three short years for Disney+ to transform from a nascent business to an industry leader. That transformation is the direct result of the strategic decision we made at launch to heavily invest in our direct-to-consumer offering, a decision made knowing that achieving rapid growth would result in short-term losses. Building a streaming powerhouse has required significant investment. And now, with scale, incredible content pipeline, and global reach, Disney+ is well-situated to leverage our position for long-term profitability and success.\n\nOur financial results this quarter represent a turning point as we reached peak DTC operating losses, which we expect to decline going forward. That expectation is based on three factors: first, the benefit of both price increases and the launch of the Disney+ ad tier next month; second, a realignment of our cost, including meaningful rationalization of our marketing spend; and third, leveraging our learnings and experience in direct-to-consumer to optimize our content slate and distribution approach to deliver a steady state of high-impact releases that efficiently drive engagement and subscriber acquisition. With these factors, we believe we are on a path to profitable streaming business that generates shareholder value long into the future. And assuming we do not see a meaningful shift in the economic climate, we still expect Disney+ to achieve profitability in fiscal 2024, as losses begin to shrink in the first quarter of fiscal 2023.\n\nChristine will go into more detail on the drivers of our direct-to-consumer operating performance and provide more insight into our expectations going forward and some of our key assumptions. But first, I'd like to share a few highlights from the quarter. Q4 was another strong period for parks, experiences, and products, which continue to deliver phenomenal results despite the impact of Hurricane Ian. I want to thank the amazing cast members in Orlando who went above and beyond to help keep our guests safe and entertained during the storm.\n\nFrom protecting the many animals at Disney Animal Kingdom, to packing thousands of meal kits, to donating and delivering emergency supplies to the community, I am so proud of how our team came together to support our guests, our neighbors, and each other. Our parks team is laser-focused on enhancing the guest experience and creating those magical memories I mentioned at the outset. This focus, along with the investments we made to bringing new attractions and experiences to our domestic parks, is generating consistently strong demand, which, on many days, exceeds our current capacity. And we continue to manage attendance levels with a focus on providing guests with the highest quality experience and enhancing our park's overall financial performance.\n\nOne of the things that guests loved most is the opportunity to celebrate at our parks as evidenced by the post-pandemic return and sell-out of special ticketed events like Oogie Boogie Bash and Mickey's Not-So-Scary Halloween Party. I visited Disneyland with my family just before Halloween, and the celebration was phenomenal. Tickets for Mickey's Very Merry Christmas Party at Walt Disney World have now officially gone on sale, and over half of all dates have already sold out. As you know, we are about to embark on the company's 100th anniversary celebration.\n\nThe fun kicks off in our parks on January 27th at Disneyland, where we'll unveil new platinum-infused decor, premier two all-new nighttime spectaculars, and open the highly anticipated Mickey & Minnie's Runaway Railway attraction. This is only one part of what will be the largest cross-country celebration at Disney's history with activations around the world. And we're so excited for fans and families to join us. At our international parks, Disneyland Paris is enjoying a great resurgence.\n\nOur fantastic new Marvel Avengers Campus opened on July 20th, and guests love the highly immersive and dynamic environment of the first ever Marvel-themed land in Europe. Prior to the recent closure of Shanghai Disney Resort, we are seeing positive momentum there and at Hong Kong Disneyland. We are hopeful that the situation will improve and are thinking of all of our employees there as we manage through the challenging COVID environment. Our Disney Cruise Line is showing strong signs of recovery.\n\nThe new Disney Wish is in high demand, and we've seen a ramp-up in bookings for our base fleet. This quarter was also exceptionally strong in terms of creative excellence across our content engines. Our teams received 57 Emmy Awards, spread across a remarkable 37 different titles, emanating from a wide range of brands, franchises, and distribution channels. ABC ended the season as No.\n\n1 in entertainment programing for the third consecutive year, and ABC News continues to be the most trusted source of news with No. 1 positions across all dayparts. Theatrically, \"Thor: Love and Thunder,\" the characters for a stand-alone film, earned over $760 million worldwide. This is our first time we released a fourth film based on a single Marvel character, and Thor's longevity is a great sign for Marvel and our ability to tell stories based on its characters long into the future.\n\nThe fourth quarter was also the first time in Disney history that we released tentpole original content from Disney, Marvel, Star Wars, Pixar, and National Geographic, an indication that we are now a full cadence of new releases as we hit our steady state. As evidenced, \"Hocus Pocus 2\" was a smash hit, becoming not only the most watched premiere on Disney+, but also a Nielsen record-setting streaming movie with 2.7 billion minutes viewed in its first weekend. And Marvel Studios' \"Ms. Marvel\" completed its run in July, and \"She-Hulk: Attorney at Law\" debuted in August, contributing to subscriber growth and driving substantial engagement.\n\nLucasfilm's \"Andor,\" a spy thriller that explores the backstory of Cassian Andor, a popular character from \"Rogue One,\" earned rave reviews and showcases our ability to extend stories from the big screen to our streaming services. Turning to general entertainment, the critically acclaimed \"Prey\" from 20th Century Studios was Hulu's biggest premiere ever across all films and series, and was the most watched film premiere on Star+ in Latin America and Disney+ under the Star banner in all other territories. Looking ahead, we are thrilled that audiences are returning to the box office for blockbuster films, and we have big plans for the big screen in the fiscal year 2023. \"Black Panther: Wakanda Forever\" opens this Friday, and Ryan Coogler has delivered yet another culture-defining powerful film.\n\nThe reaction to this film's premiere a few weeks ago was incredible. And fan anticipation is very high, as indicated by the strength of attendance ticket sales. Up next is \"Strange World\" from Walt Disney Animation Studios, which opens in theaters this Thanksgiving. The highly anticipated \"Avatar: The Way of Water\" opens on December 16th and is the sequel to the highest grossing film of all time.\n\nJames Cameron and his team have once again created something truly magical using groundbreaking technology. Audiences are as excited as we are to return to Pandora. And given the strong performance of September's rerelease of the original \"Avatar,\" we can't wait for the film to hit screens. Our Searchlight studio continues to deliver critically acclaimed films, and three fantastic titles will be in theaters this quarter: \"The Banshees of Inisherin\", which has earned critical acclaim since its Venice premiere; \"The Menu\" starring Ray Fiennes and Anya Taylor-Joy; and the \"Empire of Light\" from Academy Award winner, Sam Mendes.\n\nLooking even further into 2023, we'll see theatrical releases of three highly anticipated Marvel films, \"Ant-Man and the Wasp: Quantumania,\" \"Guardians of the Galaxy Vol. 3,\" and \"The Marvels.\" And we could not be more excited about Disney's live actions \"The Little Mermaid,\" a reimagining of one of the most popular animated films of all time, starring Halle Bailey, whose rendition of \"Part of Your World\" has already lit up the internet. We're also bringing 999 happy haunts to life with the hilarious new live action \"Haunted Mansion\" featuring an all-star cast. Pixar will debut an all-new original feature, \"Elemental.\" And Harrison Ford is back in the eagerly awaited fifth \"Indiana Jones\" film, which is going to be spectacular.\n\nOf course, all of our theatrical titles will eventually make their way onto our streaming platforms, complementing our robust slate of original content. \"Zootopia+,\" a new series from Disney Animation, debuts tomorrow, along with \"Save Our Squad,\" an original series from the U.K. that sees soccer superstar, David Beckham, return home to mentor a grassroots team of young boys struggling to survive in their league. On November 18th, Disney+ will release \"Disenchanted\" based on the successful \"Enchanted\" that came out 15 years ago.\n\nMarvel's \"Guardians of the Galaxy Holiday Special\" will follow right after. And \"Willow,\" another long awaited sequel from Lucasfilm, will premiere the following week. We are so fortunate to have an abundance of content from all of our creative engines paired with a wealth of knowledge and insight into what resonates with our fans. As we move forward, we will increasingly leverage that knowledge to refine our distribution decisions in order to best serve our audience and maximize the return on our content investments.\n\nTurning to sports, ESPN was the No. 1 cable network in total day and prime viewing among audiences aged 18 to 49 in Q4. And the Walt Disney Company was responsible for 40% of sports hours watched among that age bracket, the biggest share of any family of networks. ESPN continues to lead with its multi-platform sports ecosystem, with reach across linear, streaming, digital, and social media, serving fans at massive scale, with the power and support of the Walt Disney Company behind it.\n\nESPN is an unequaled reach machine. And the business is well-positioned through our strategic portfolio of long-term rights agreements, with an eye to remaining disciplined in our approach. We recently announced an extension with Formula 1 through 2025, which is one of the fastest growing sports properties and is on pace to surpass last year's record audience on ESPN. The 2022 college football season is off to its best nine-week start in five years across our networks.\n\nAnd thanks to our incoming SEC agreement in 2024, we will remain the leading college football platform with over 60% of the college football market. And our new long-term NFL agreement includes Super Bowls, an annual ESPN+ exclusive match up and more regular season and playoff games and better scheduling. On October 30th, we marked another milestone moment in our DTC streaming services and the growth of ESPN+, when the Broncos versus Jaguars NFL game from London became our most viewed ESPN+ event ever. Finally, we are exactly one month from the U.S.\n\nlaunch of Disney+'s ad-supported subscription offering, which is a win for audiences, advertisers, and shareholders. The launch will bring fans a new slate of subscription plans across Disney+, Hulu, ESPN+, and the Disney Bundle, getting viewers flexibility in choosing an option that suits their needs. The offering also adds a key component to our total company advertising portfolio, and advertiser interest has been strong. We have been a leader in streaming advertising for some time and are bringing our years of experience leading ad tech and relationships to this important opportunity.\n\nDisney+ has secured more than 100 advertisers for our domestic launch window, spanning a wide range of categories. And our company has over 8,000 existing relationships with advertisers who will have the opportunity to advertise on Disney+. Strong base pricing reflects the value advertisers put on our audience, our brand-safe environment for their messages, and our sales experience. We also have proven technology to deliver a great advertising experience on day one.\n\nAnd importantly, we have the ability to scale and innovate for audiences and advertisers alike. We are incredibly excited about the launch of our new ad-supported subscription offering for Disney+, which rolls out on December 8th. 2022 was an important year of recovery coming out of the pandemic, as we made foundational investments in our long-term success. As we celebrate the three-year anniversary of Disney+ this week, I can't help but reflect upon how our commitment to and substantial investment in our DTC business has helped create the world's most powerful suite of streaming services with the ability to reach hundreds of millions of viewers around the world with must see content, services which aren't just content delivery systems but platforms that bring us closer to audiences than ever before and enable consumers to access more of The Walt Disney Company's total offering.\n\nWith our unmatched brands and franchises, robust pipeline of content capable of filling all of our distribution channels, unique experiences, and strong connections to audiences around the world, I believe we are well-positioned for future long-term growth, and I'm confident in the path forward. With that, I'll turn it over to Christine to talk in greater detail about our quarter and the year ahead.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nGood afternoon, everyone. We have wrapped up another dynamic fiscal year. And as we enter into fiscal 2023, I will be diving a bit deeper than usual today into the results of our businesses, and we'll give some additional color on where we expect to go from here, especially given the inflection point that we believe we have now reached in our direct-to-consumer business. Excluding certain items, our company's diluted earnings per share for the fourth fiscal quarter was $0.30.\n\nAnd for the full fiscal 2022 year, diluted EPS, excluding certain items, was $3.53. Our parks, experiences, and products segment had another stellar quarter, with DPEP operating income in the fourth quarter more than doubling versus the prior year to $1.5 billion. Our domestic parks delivered significant year-over-year revenue and operating income growth despite an adverse impact of approximately $65 million to segment operating income from Hurricane Ian. And per-capita spending remained strong, increasing 6% versus Q4 of fiscal 2021 and nearly 40% versus fiscal 2019, reflecting the continued popularity of premium offerings, including Genie+ and Lightning Lane.\n\nWe are also making meaningful progress on the return of international visitors to our domestic parks, particularly at Walt Disney World, where the mix of international attendance in the fourth quarter was roughly in line with pre-pandemic levels. Looking toward fiscal 2023, while we continue to monitor our booking trends for any macroeconomic impacts, we are still seeing robust demand at our domestic parks and are anticipating a strong holiday season in Q1. Disney Cruise Line was also a meaningful contributor to the year-over-year increase in domestic parks and experiences' operating income in Q4, reflecting the successful launch of the Disney Wish in July and continued recovery of the existing fleet coming out of the pandemic. Order to date, occupancy for the Wish continues to exceed 90%, while we have also seen a meaningful pickup in the rest of our fleet with booked revenue up versus pre-pandemic levels.\n\nAt international parks, fourth quarter results also improved significantly year over year, driven by continued strength at Disneyland Paris, partially offset by a decrease at Shanghai Disney Resort. As Bob mentioned, the situation in Shanghai has recently been challenging. The park is currently closed, and we do not yet have visibility to a reopening date. Q4 results at consumer products also increased versus the prior year, driven by higher merchandise licensing results across several of our key franchises, including Mickey and Friends, Encanto, and Toy Story.\n\nMoving on to media and entertainment distribution. Operating income in the fourth quarter decreased by $864 million versus the prior year as a modest increase at Linear Networks was more than offset by wider losses at direct-to-consumer and, to a lesser extent, at content sales, licensing, and other. At Linear Networks, operating income in the fourth quarter increased 6% to $1.7 billion, driven primarily by growth at domestic channels. The increase at domestic channels primarily reflects higher results of cable, driven by lower programing and production costs, partially offset by a decrease in advertising revenue.\n\nCompared to the prior-year fourth quarter, cable programing and production costs benefited from the timing of the NBA Finals, which were in Q4 of fiscal 2021 versus Q3 of fiscal 2022, as well as from lower costs for Major League Baseball programing due to fewer games under our new contract. These impacts were partially offset by higher NFL programing costs as a result of one additional game aired versus the prior year quarter. The decrease in cable advertising revenue versus the prior-year fourth quarter also reflects a timing impact of the NBA Finals. ESPN advertising revenue in Q4 was down 23% year over year.\n\nHowever, adjusting for the timing impact of the NBA finals, it was down roughly 2%. Note that in Q1 of fiscal 2023, we also expect to see a timing impact versus the prior year from two college football playoff games that are shifting into the second fiscal quarter this year versus the first quarter last year. Order to date, ESPN domestic cash advertising sales are pacing down, reflecting, in part, the absence of these two CFP games. The advertising landscape remains fluid.\n\nThe sports marketplace, in particular, is delivering strong audiences across our platforms, with marketers looking to take advantage of live events and several categories, including political, pharma, insurance, and restaurants, have continued to show relatively stable demand, while others remain cautious in anticipation of potential economic softness. Total domestic affiliate revenue in the fourth quarter increased by 2% from the prior year, driven by 5 points of growth from contractual rate increases, partially offset by a 4-point decline due to a decrease in subscribers. Looking ahead, we expect to see Linear subscriber declines accelerate more, in line with industry trends. International channels' operating income decreased by $25 million in the fourth quarter versus the prior year, reflecting lower results from our ongoing channels and operation, partially offset by a benefit from channel closures.\n\nAt content sales, licensing, and other, results decreased versus the prior year by a little over $100 million, in line with guidance, due to lower TV/SVOD and home entertainment results, partially offset by higher theatrical results and an increase at our stage play business. While difficult comparisons may persist in the intermediate term at our TV/SVOD and home entertainment businesses, results will vary quarter to quarter. And we currently expect content sales, licensing, and other operating results to improve slightly in the first fiscal quarter of 2023 on both a sequential and year-over-year basis. Finally, I'd like to spend some time talking about our fourth quarter results at direct-to-consumer, where our losses peaked in the fourth quarter at approximately $1.5 billion.\n\nHulu and ESPN+ added approximately 1 million and 1.5 million subscribers, respectively, during the quarter, while Disney+ added over 12 million global subscribers, of which a little less than 3 million were at Disney+ Hotstar. Core Disney+ added over 9 million subs in Q4, accelerating as expected versus the 6 million net ads we saw in the third quarter, reflecting the success of Disney+ Day and our tentpole content releases, in addition to continued growth from third quarter market launches. Nearly 2 million of these net ads were from the U.S. and Canada, and a little over 7 million were international Core editions.\n\nAt the same time, Core Disney+ ARPU decreased by 5% between Q3 and Q4, reflecting an adverse foreign exchange impact and, to a lesser extent, a slightly higher mix of subscribers from lower-priced international markets. ARPU at each streaming service is also impacted by the mix of subscribers to the bundle. Our bundled and multi-product offerings now account for over 40% of our fiscal year-end domestic Disney+ subscriber count. This shift has been purposeful as the bundle drives higher total company subscription revenue and higher long-term subscriber value due to notably lower churn.\n\nLower pay-per-view revenue at ESPN+ and slightly lower advertising revenue at Hulu and Disney+ Hotstar also impacted direct-to-consumer revenue in the fourth quarter relative to the third quarter. With our expectation that peak losses are now behind us, DTC operating results should improve going forward as we lay the foundation for a sustainably profitable business model. In the first quarter of fiscal 2023, we expect direct to consumer operating results to improve by at least $200 million versus the fourth quarter of fiscal 2022, with larger improvement expected in Q2, reflecting a couple of key factors. First, our recently announced price increases across our direct-to-consumer offerings in the US should begin to modestly benefit ARPU and subscription revenue in the first quarter.\n\nHowever, given that the Disney+ price increase will not go into effect until toward the end of Q1, this benefit will be realized more fully in the second quarter. Similarly, we do not expect the launch of the advertising-supported tier of Disney+ in December to provide a more meaningful financial impact until later this fiscal year. Additionally, our commitment to cost rationalization will allow us to scale effectively against our investments. In particular, while DTC programing and production costs will increase from Q4 to Q1 over the course of the year, content expense and opex growth should slow as we approach steady state.\n\nAnd marketing costs should decline, as we continue to focus on aligning our costs with our dynamic business models. As it relates to subscribers, we expect ESPN+ and Hulu will continue to add new subscribers in Q1. And we expect Core Disney+ subscribers to increase only slightly in the quarter, reflecting tougher comparisons against Disney+ Day performance. As we've mentioned before, subscriber growth will not be linear each and every quarter, and the trend is driven by several factors, including content releases and promotions.\n\nWe expect Disney+ Core subscriber growth to then accelerate in the fiscal second quarter, largely driven by international markets. And at Disney+ Hotstar, we are currently expecting that subscribers will decline in Q1 due to the absence of the IPL, but we do expect to see some stabilization in Q2. I'll note that our direct-to-consumer expectations are built on certain assumptions around subscriber additions based on the attractiveness of our future content, current expectations for upcoming price increases, the financial impact of the Disney+ ad tier and price increases, and our ability to quickly execute on cost rationalization while preserving revenue. All of which while based on extensive internal analysis, as well as recent experience, provides a layer of uncertainty in our outlook.\n\nBefore we conclude, there are a couple of other items I would like to mention around our fiscal 2023 expectations. Cash content spend totaled $30 billion in fiscal 2022, and we continue to expect it to be in the low $30 billion range for fiscal 2023. Capital expenditures totaled nearly $5 billion in fiscal 2022, in line with our expectations. And we currently expect that capex will increase in fiscal 2023 to a total of $6.7 billion, driven by higher spend across the enterprise.\n\nPutting this all together, assuming we do not see a meaningful shift in the macroeconomic climate, we currently expect total company fiscal 2023 revenue and segment operating income to both grow at a high single digit percentage rate versus fiscal 2022. We are confident about the opportunities we see to continue to transform our business for the next 100 years and look forward to sharing our progress with you all throughout 2023. And with that, I'll turn it back to Alexia, and we would be happy to take your questions.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nThanks, Christine. As we transition to Q&A, we ask that you please try to limit yourself to one question in order to help us get to as many analysts as possible today. And with that, operator, we're ready for your first question.\n\nOperator\n\n[Operator instructions] Our first question today comes from Ben Swinburne from Morgan Stanley. Please go ahead with your question.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThanks. Good morning -- or good afternoon, sorry. Two questions. Bob, you talked a little bit about how -- what's the consumer experience going to be like as you roll out this price increase here in a month? You've got -- you've got customers on lots of different plans, different distributors.\n\nCan you talk a little bit about your confidence that it's going to be seamless and that consumers will have the ability to choose the plan that works best for them? And then, Christine, on the parks margins, U.S. margins this quarter, I think through the first three quarters of fiscal '22, margins were up pretty nicely versus '19. And they were actually down, I think, this quarter. It didn't sound like there was anything in your prepared remarks that sort of commented on that.\n\nThere was a mention of cost inflation in the release. But I just wonder if you could spend a little bit of time talking about some of the cost drivers in the U.S. parks business in the quarter. Anything unusual that you would want to call out and how we might want to think about that heading into '23.\n\nThank you.\n\nBob Chapek -- Chief Executive Officer\n\nAll right. Thank you, Ben. In terms of, you know, trying to communicate to consumers the multitude of options we're getting them, we believe that more choice is actually good. And you're right, it's predicated upon our ability to communicate the options to the consumer.\n\nBut we've got so many years of history with Hulu, where we've given them options between advertising and nonadvertising, Hulu plus Live TV, without Hulu plus Live TV, that we believe that we've got a pretty good formula for how we could communicate. And that formula has worked very well domestically. And so, we believe it'll work as well internationally, as well as across both Hulu, Disney+, and ESPN+. I think it's important to keep in mind that, you know, we've got unmatched brands.\n\nAnd as we continue to go ahead and, you know, extend our reach, and there are different business models, different pricing models for consumers, that that choice itself will really enable us to have maximum penetration regardless of the brand under which the option is given to consumers. But also, at the same time, as our platforms become just that more and more platforms and less and less just distribution options, we've got a pretty good formula, I think, for making that simple for the consumer, but also enabling for the consumer to go ahead and subscribe in a way that suits them best.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nOK, Ben, on your question about the parks margins, so DPEP's segment margin came in around 20.4% for this quarter, and that is lower than previous quarters this year. Let's remember that Q4 is historically the lowest quarter of the year for margins. And there's two things going on here, both on the revenue and the expense side. On the revenue side, it is primarily driven by traditional seasonality, you know, back-to-school time, and, to a lesser extent, as I called out in my comments, the impact of Hurricane Ian, that was a $65 million drag on the quarter.\n\nWe have been using 2019 as our base for comparison, you know, pre-pandemic. So, when you compare it to fiscal '19 Q4, the lower margin is driven by international parks performance. And then if you flip to the expense side, the increase in quarter-over-quarter expenses is the continued effect of bringing on some more guest offerings. Those are things like nighttime spectaculars.\n\nWe also have park ticket events. And they have a lot of cost, you know, just in terms of setup and breakdown. We also, remember, have a new ship, the Wish, that just started operations. And there's some other smaller one-time items.\n\nBut those are the real drivers of that lower margin this quarter.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nAll right. Thank you. Next question.\n\nOperator\n\nOur next question comes from Philip Cusick from JPMorgan. Please go ahead with your question.\n\nPhilip Cusick -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. Turning to DTC, I guess let's focus on the profit in '24 guidance. You know, we've talked in the past that this means probably a quarter or two in '24 and not for the full year.\n\nIs that still the way to think about it? And I did notice the comment about, you know, assuming the economy maybe doesn't get worse or something like that, can you just talk about what drove you to add that language?\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nI'll take that, Phil. So, direct-to-consumer for '24 profitability, you should be thinking about it as a quarter, not a year basis. And then, on some of the profitability drivers that we talked about that I think answered the question about the economy, you know, we do have things like the steady state of content on the service. That's independent of the economy.\n\nWe are focusing on bundled offerings as we refine our value proposition. There's also increasing international core market penetration. Once again, that is somewhat reliant on a stable economy. And increasing ARPU through the pricing increases would also, I think, be something that could be sensitive to the economic environment.\n\nWe do have the Disney+ ad tier launch and ad monetization growth. And the indications that we have so far is that those are very strong. So, we really are looking at, you know, sort of the puts and takes on what's going to be economically sensitive. But we just think, in an abundance of caution, we really have to keep the health of the consumer in mind when we think about achieving all of our goals this upcoming year.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nThank you. Next question.\n\nPhilip Cusick -- JPMorgan Chase and Company -- Analyst\n\nThank you. I do have a follow-up.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nOK. Go ahead, Phil.\n\nPhilip Cusick -- JPMorgan Chase and Company -- Analyst\n\nI was going to say, you called out a few -- both you and Bob called out G&A and marketing savings on the call. How is Disney thinking about just cost in general? Is there a process going on today to cut costs across the board? And what might the timing of that be? Thanks again.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nYeah, Thanks for that question and follow-up, Phil. We are actively evaluating our cost base currently, and we're looking for meaningful efficiencies. Some of those are going to provide some near-term savings, and others are going to drive longer-term structural benefits. You know, I just would point to what we did in the parks during the pandemic.\n\nWe did some structural changes, and the parks is better off because of that. But those were structural benefits that did not flow back into their cost base. We will update you with more information as our plan evolves.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nThank you. Next question.\n\nPhilip Cusick -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Michael Nathanson from MoffettNathanson. Please go ahead with your question.\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nThanks. I have two. One is on the parks in '23, I was trying to understand, what levers can you pull, do you think? If there is a slowing U.S. consumer, what can you do to kind of maintain the revenue growth? I guess the revenue that we've seen.\n\nSo, in other words, what can be different this time versus previous downturns? And then, Christine, I just have to come back to that operating profit guide, which you never give. So, I appreciate the fact that you did it. I'm just trying to get the piece parts right. You know, DTC is going to get better.\n\nParks is showing a weakness. But can you hone in a bit on the outlook for the rest of DMED in '23? Is that what you see is kind of, you know, the slower OI growth next year? Thanks.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nSo, you're talking about parks, Michael. What is different is, compared to the last time we had a slowdown in the economy for managing our parks business, we have more commercial tools and levers available to us. One of the ones that's quite obvious is discounting. That's something that we have used in the past, and we will continue to use it because it is an effective lever for managing your yield.\n\nBut we're not going to use it to the extent to which we used it during the last recession. Some of the other things that are new would be the reservation system. So, you know, we manage attendance now. We can track it real time.\n\nOn many days, we are fully booked now. But we can adjust that and be very flexible in real time on adjusting it, if we if we so choose. The other thing is we have a tiered pricing structure that gives us a lot of flexibility. And we also have reimagined our annual pass business model.\n\nAnd we could also have some more flexibility in using our annual pass program. We also have technology advancements, and this is more on the expense side. That provides us opportunities for cost flexibility. So, we have things like mobile ordering, contactless check-in.\n\nSo, those kinds of things give us levers on the expense side. But we do feel that we have -- you know, once again, hearkening back to the opportunity we took during the pandemic, we did permanently remove a significant amount of operating expense at the parks. And that better positions us right now as we go into an uncertain economic environment.\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nOK.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nMichael, do you have a second question?\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nWell, it was on the OI guide, right, which you don't usually give. So, trying to dig into the DMED outlook, given what you said about the other businesses at this point.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nYeah, we gave the outlook that was more for the company as a whole. But, you know, we're still looking at DPEP being a strong -- continuing its strong growth. DMED, we're looking at it in three components, the direct-to-consumer. We're looking at improving profitability as we've mentioned.\n\nWe believe that this quarter that we're reporting is the low point, and it will improve from here. CLS&O that will have some challenges, as we said. So, that'll be variable quarter to quarter. And then, we have to look at our linear business.\n\nAnd we do have some declines that are in line with the industry, and that's one that is just an industry issue that we're all going to be managing through.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nAll right. Thank you. Next question.\n\nOperator\n\nOur next question comes from Kannan Venkateshwar from Barclays. Please go ahead with your question.\n\nKannan Venkateshwar -- Barclays -- Analyst\n\nThank you. Maybe, I guess, you know, if you look at the streaming business as a whole and if you step back and look at the strategy going forward, we'll see a price increase next quarter. And of course, that is also the ad-supported tier that could help manage some of the churn. But as an offset, it seems like some of the marketing expense will be optimized along with some content spending.\n\nSo, you know, Bob, if we look at the guidance right now, your subscriber growth needs to accelerate going forward in order to get to the guidance. But a lot of the levers, like pricing, may actually force churn to be higher and marketing cost may actually trend a little but lower. So, when we think about this, how do we reconcile the subscriber guidance with the financial model of the business? And does it make sense to maybe, you know, focus more on profitability rather than some growth from our perspective going forward?\n\nBob Chapek -- Chief Executive Officer\n\nOur approach going forward is going to be focused largely on profitability, keeping in mind, though, that the revenue growth that we have is also going to be a key component toward the overall profitability. If we look at the content that's going to actually fuel our subscriber growth and our engagement, we're obviously managing that very carefully. Christine talked about some cost management initiatives that's not only across marketing, but also on the content spending itself as well. But we've also got an opportunity, I believe, to manage our profitability through that pricing power that we believe we have here.\n\nWe launched these services at tremendous values to the consumer. And everything that we've got shows us that we still have some opportunity for continued price value exploration on all of our services. So, we believe that. And our history shows that when we've taken price increases across our streaming businesses, that we don't meaningfully increase churn or cancellations.\n\nSo, we believe we've still got some headroom there. So, whether it's cost management or attention to revenue growth through sub ad, through our great content additions or through ARPU, we believe that we've got a formula that gives us great confidence that we're going to achieve the guidance that we communicated.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nGreat. Thank you. Next question, please.\n\nOperator\n\nOur next question comes from Steven Cahall from Wells Fargo. Please go ahead with your question.\n\nSteven Cahall -- RBC Capital Markets\n\nThanks. So, Bob, I think you called ESPN a rich machine, and Christine talked about the cord cutting and how that's something that everybody's going to be managing through. So, as you look to expand the reach of ESPN, I know we've had this question before, but how do you think about starting to make a lot of the marquee streaming rights -- or sorry, marquee sports rights also available on the streaming services, whether that's ESPN+ or others? And how do you think about monetizing in a streaming world with a lot more of those expensive rights available? And then, Christine, just on the capex, it's moving up, you know, a 1.5 billion or so this year. I know some of that is maybe a shift of about 500 million from last year, but it's still a little more elevated than history.\n\nYou said it was enterprisewide. So, I'm wondering if the increase is more capital projects on the parks side, or if it's other things like technology or studio expansions. Thank you.\n\nBob Chapek -- Chief Executive Officer\n\nOK. In terms of ESPN growth, I think we all have to keep in mind that, number one, ESPN is that powerhouse brand. And we certainly, over time, have been able to enjoy the benefits of that brand in a linear world. However, going forward, we've got the ability not only to continue to enjoy those benefits in a linear world, but also begin to grow our opportunities in the digital realm and leverage that brand's growth into other avenues that, heretofore, we've not been able to necessarily tap into.\n\nI think it's also important to look at ESPN in terms of an important part of the overall Disney portfolio or synergy. It is an integral part of the bundle itself. So, when you take the fact that it's a great brand, we have the opportunity to grow it into different avenues. And as I've said before, sort of put one foot on the dock, one foot on the boat, and be flexible in terms of our speed of evolution.\n\nI think it's going to be an important part of our business going forward. Live advertising continues to be a really important benefit that we sell into our advertising community. We've got multiple platforms, and I believe that it's going to be a very robust part of our company going forward, whether or not it's linear or whether it's digital, or somewhere in between.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nSo, on capex, Steve, yes, you're right. It is up. That was in my comments, As you -- for those who have followed the company for a while, we usually give you a capex number for the beginning of the year. And by the end of the year, we haven't spent it all.\n\nSo, there is some slippage that goes from one year into the next. And also, just with supply chain and labor shortages in various parts of the world, where we are having projects, that slippage is probably a little more amplified. We do have some technology spend both at the enterprise level, as well as in DMED. Some of it is consumer-facing.\n\nSome of it is more internal to, once again, deliver longer-term efficiencies. And we have DPEP projects pretty much everywhere around the globe. So, we're continuing to build out those projects either on schedule or with some slippage that is slipping into 23.\n\nSteven Cahall -- RBC Capital Markets\n\nThank you.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nAll right. Thank you. Operator, I think we have time for one more question.\n\nOperator\n\nAnd our next question comes from Michael Morris from Guggenheim. Please go ahead with your question.\n\nMichael Morris -- Guggenheim Partners -- Analyst\n\nThanks for taking my question. Good afternoon, guys. Two for me. One, Christina, I'm hoping you can give us a little more detail on the sequential revenue decline at the D-to-C segment.\n\nYou talked about foreign exchange. Could you quantify how much of it came from foreign exchange? Because as I'm looking at, you know, ARPUs the AAP, who's on the domestic business, domestic Disney+, in particular, they have sequentially come in as well. So, maybe how much was FX, and a little bit more detail on kind of at the core, you know, what's driving that Disney+ ARPU compression. My second question is on sports rights.\n\nThere was an article out today about Netflix potentially looking at some sports rights. Amazon seems to have had success with their Thursday night football package. So, Bob, I'm curious how you see the landscape changing as these new entrants come in, if you see it changing at all and how it impacts the environment. Thank you.\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nWell, I'll take the first one, Mike, on the revenue decline. So, there are a couple of things. One is that on the ARPU, the impact of foreign exchange on ARPU was about half of the decline. And we do hedge, and we have very successfully managed through this year a strong dollar for the most part.\n\nHowever, as you know, we are in markets all over the globe. And some of the markets in which we have launched, their currency. We do not hedge for either extraordinarily high costs or illiquidity. So, that foreign exchange impact is about half of the impact.\n\nThe other one is lower pay per view. And this was at ESPN+, you know, we have UFC, but we had a different game set of different match schedules. You can tell I'm not a UFC fan when I call them games, but a different match schedule and the omission of a key personality in McGregor. So, that actually were the two primary factors lowering that year-over-year revenue.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nBob, you want to take the second one?\n\nBob Chapek -- Chief Executive Officer\n\nOK. Yeah. In terms of the sort of, is the landscape changing with new entrants, you know, we really like our strong position that we've got going forward, not only in terms of the breadth of the sports that we're engaged in, but also the terms of the deals that we have. So, you know, we've exercised with discipline.\n\nI think the college conferences, in terms of our negotiation, making sure that, you know, we recognize that we don't need everything. We just need the right things. But also making sure that, you know, as we go forward, we're looking at multi-platform rights. We will not do deals where we don't get multi-platform rights that give us that very flexibility that we talked about, toggling between sort of the more linear, traditional legacy distribution channels, and that of the more, you know, digital of forward-looking platforms.\n\nThe big one that's coming up, obviously, for us would be the NBA. We'd love to be in business with the NBA. But again, we're going to do it in a fiscally responsible way and seeking multi-platform rights. So, we feel really good about our position going forward with the rights that we've already gotten and the one or two that are still in play.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nThank you.\n\nMichael Morris -- Guggenheim Partners -- Analyst\n\nThank you.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nI think with that, we conclude the call. I think we are out of time.\n\nOperator\n\nAnd, ladies and gentlemen, with that, we'll conclude today's conference call. Thank you for joining. You may now disconnect your lines.\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nOK. Thanks. Note that -- I have to read a statement here for those of you who are still on. Note that the reconciliation of non-GAAP measures that were referred to on this call to equivalent GAAP measures can be found in our investor relations website.\n\nLet me also remind you that certain statements on this call, including financial estimates or statements about our plans, guidance, expectations, beliefs, or business prospects, or other statements, are not historical in nature, may constitute forward-looking statements under the securities laws. We make these statements on the basis of our views and assumptions regarding future events, business performance at the time that we make them. We do not undertake any obligation to update these statements. Forward-looking statements are subject to a number of risks and uncertainties, and actual results may differ materially from the results expressed or implied in light of the variety of factors, including economics or industry factors or execution risks, including the connection with our DTC business plans relating to content creation and future subscriber growth churn, financial impact of Disney+ ad tier, and our new pricing model and cost realization.\n\nFor more information about key risk factors, please refer to our investor relations website, the press release issued today, the risks or uncertainties described in the Form 10-K, Form 10-Q, and other filings with the Securities Exchange Commission. And we want to thank you all for joining us today and wish you a great rest of the day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlexia Quadrani -- Senior Vice President, Investor Relations\n\nBob Chapek -- Chief Executive Officer\n\nChristine McCarthy -- Senior Executive Vice President and Chief Financial Officer\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nPhilip Cusick -- JPMorgan Chase and Company -- Analyst\n\nMichael Nathanson -- MoffettNathanson -- Analyst\n\nKannan Venkateshwar -- Barclays -- Analyst\n\nSteven Cahall -- RBC Capital Markets\n\nMichael Morris -- Guggenheim Partners -- Analyst\n\nMore DIS analysis\n\nAll earnings call transcripts"
}