{
  "companyName": "Livent Corp.",
  "companyTicker": "LTHM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/livent-corp-lthm-q3-2022-earnings-call-transcript/",
  "content": "Livent Corp. (LTHM 0.35%)\nQ3 2022 Earnings Call\nNov 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the third quarter 2022 earnings release conference call for Livent Corporation. Phone lines will be placed on listen-only mode throughout the conference. After the speaker's presentation, there will be a question-and-answer period. I will now turn the conference over to Mr.\n\nDaniel Rosen, investor relations and strategy for Livent Corporation. Mr. Rosen, you may begin.\n\nDan Rosen -- Investor Relations\n\nThank you, Dennis. Good evening, everyone and welcome to Livent's third quarter 2022 earnings call. Joining me today are Paul Graves, president and chief executive officer; and Gilberto Antoniazzi, chief financial officer. The slide presentation that accompanies our results, along with our earnings release, can be found in the investor relations section of our website.\n\nPrepared remarks from today's discussion will be made available after the call. Following our prepared remarks, Paul and Gilberto will be available to address your questions. Given the number of participants on the call today, we would request a limit of one question and one follow-up per caller. We would be happy to address any additional questions after the call.\n\nBefore we begin, let me remind you that today's discussion will include forward-looking statements that are subject to various risks and uncertainties concerning specific factors, including but not limited to those factors identified in our release and in our filings with the Securities and Exchange Commission. Information presented represents our best judgment based on today's information. Actual results may vary based upon these risks and uncertainties. Today's discussion will include references to various non-GAAP financial metrics.\n\nDefinitions of these terms as well as a reconciliation to the most directly comparable financial measure, calculated and presented in accordance with GAAP, are provided on our investor relations website. And with that, I'll turn the call over to Paul.\n\nPaul Graves -- President and Chief Executive Officer\n\nThank you, Dennis, and good evening, everyone. Livent had another very strong financial performance in the third quarter as the business continues to achieve record levels of profitability. Q3 adjusted EBITDA of $111 million, compared to $15 million, one year ago, to $95 million last quarter. And what remains a very strong market, Livent has continued to achieve high realized prices, while also delivering increased volumes to customers in the third quarter.\n\nAs we approach the year-end, Livent has narrowed the ranges of its full-year 2020 to financial guidance, while increasing projections for adjusted EBITDA at the midpoint. This is underpinned by higher realized pricing in the second half than previously expected. I think we'll go into in further detail, Livent continues to make considerable progress on its expansion projects and remains on track with all projected timelines and capital plans. Construction of our 5,000 metric ton lithium hydroxide expansion investment city was completed in the third quarter and we're now in the early stages of producing and qualifying this product with customers.\n\n2023 will be a landmark year for Livent, as we expect to fully ramp up the Bessemer City hydroxide expansion. Complete two phases of lithium carbonate expansion in Argentina, totaling 20,000 metric tons in nameplate capacity and add a new 15,000 metric ton hydroxide facility in China all by year-end. Given the time required to ramp up the new Argentina expansions Livent expects to produce roughly 6,000 metric tons of incremental LCE volume in 2023, or roughly 25% annual increase starting in the second quarter, and we expect to further increase our production in 2024 and the years to follow. 2023 will also be a pivotal year for the Nemaska project, as it begins construction and critical decisions regarding project financing and commercial pathways are made and executed on.\n\nAll of these capacity expansion efforts continue to progress as expected, and as previously communicated. I'll now turn the call over to Gilberto, to discuss our third quarter performance and our updated 2022 financial guidance.\n\nGilberto Antoniazzi -- Chief Financial Officer\n\nThanks, Paul. Good evening, everyone. Turning to Slide 4, Livent reported third quarter revenue of $232 million. Adjusted EBITDA of $111 million and adjusted earnings of $0.41 per diluted share.\n\nThis was another record-quality financial performance for Livent, as we continue to execute well, operationally, in a strong market environment. Versus the prior quarter revenue was up 6%, with higher total LCE volume sold complemented by slightly higher realized prices and a favorable product mix. Third quarter adjusted EBITDA was 70% higher than the prior quarter and over seven times higher than the prior year. This was due to continued strong pricing across all products, and our ability to take advantage of a favorable market conditions.\n\nAdditionally, we saw a small improvement in sequential costs. As we sold the bulk of our remaining higher-cost third-party carbonate materials from inventory in the second quarter. There was also an FX benefit to adjusted EBITDA, as a result of the strengthening of the U.S. dollar versus some of our foreign-denominated costs.\n\nFrom a balance sheet perspective, we finished the quarter with $212 million of cash, inclusive of the receipt of 198 million prepayments from general motors. As a reminder, this prepayment is related to a six-year battery-grade lithium hydroxide supply agreement, beginning 2025 which was announced by Livent and GM last quarter. During Q3, Livent also announced the renew of its revolving credit facility for five years to 2027, while upsizing it by $100 million. As a result, and due to continuous strong cash generation, Livent is now $500 million facility remain undrawn at quarter end.\n\nAs we look to the remainder of 2022, you will see the Livent has updated its full-year guidance, as shown on Slide 5. We have narrowed the ranges of our guidance while increasing the midpoint of our projected results for adjusted EBITDA by $10 million. For the full year 2022, Livent now projects revenue to be in the range of $850 million to $845 million, and adjusted EBITDA to be in the range of $350 million to $370 million. This improvement is largely underpinned by expectations for slightly higher realized pricing.\n\nData demand has been exceptionally strong throughout this year. And published lithium prices in all forms have continued to move higher, reflecting very tight market conditions. Livent has been able to take an advantage of this by realizing higher prices on a subset of its volumes that are exposed to market prices. We are confident in those environment not changing for the rest of the year.\n\nIn light we will continue to take advantage of this. However due to customer mix, we will have a larger portion of sold volumes in the fourth quarter. There are contracted as previously said lower fixed price. As a reminder, we expect 2022 total volume sold on an LCE basis to be roughly flat versus 2021.\n\nAs no meaningful volumes from our capacity expansions are expected to be commercially available until 2023. The revised guidance does not assume any change in total volumes compared to last guidance, although we do expect to sell slightly higher volumes sequentially in the fourth quarter. With that said, given some of the regional supply chain disruptions, we continue to see effect in many industries, including our own, there is a potential for some year-end volumes to be pushed into the beginning weeks of 2023. Livent significantly improve profitability and cash flow will be further enhanced by additional production volumes coming online over the next few years.\n\nThis much-improved cash generation provides Livent with ample liquidity to continue advancing in where possible, accelerating its expansionary investments. Additionally, we will continue to level it other forms of funding, such as the prepayment received from GM, that provide additional flexibility and are only available to proven reliable producers such as Livent, with credible expansion projects. The focus from customers on security supply of battery-grade lithium from proven producers remains as strong as ever. Livent's projection for 2022 capital spending of $300 million to $340 million remains unchanged.\n\nOur pace of spending pick it up in the third quarter, and this will continue in the fourth quarter, as we approach permission of our first 10,000 metric ton phase of carbonate expansion Argentina, and each other key milestones across our projects. I will now turn the call back to Paul.\n\nPaul Graves -- President and Chief Executive Officer\n\nThanks, Gilberto. Turning now to several market observations on Slide 6. Despite some near-term supply chain disruptions, particularly in China, with energy curtailments and zero-tolerance COVID-19 policies, lithium demand has continued to be incredibly strong. For the first nine months of 2022, China EV sales reached 4.5 million units.\n\nAnd based on most full-year estimates, sales in China were more than double versus 2021. EV battery sales in China show similarly impressive growth up roughly 245% through Q3 year-to-date versus 2021 and BEV registrations in Europe, reached an all-time high in the month of September, a feat that was not expected until the typically higher year-end push in December. The lithium market has continued to be extremely tight, as evidenced by the lack of inventory building throughout the supply chain and the continually higher bid prices set for the limited uncommitted feedstock material that is available. We believe that Australian spodumene-based LCEs which make up close to half of the total market did not increase in the third quarter versus the prior quarter.\n\nWhile demand continued to grow. There are few credible data points to suggest this pressure will abate as we move through the remainder of this year as we go through a period of seasonal slowdown for higher cost to Chinese grain producers. And as automakers supply chains ramp up production to meet higher anticipated year-end demand. It's also hard to make a strong case for meaningful shift of supply demand balances as we look out over the foreseeable future.\n\nOn the supply side, there are several expansions on new projects that are stated to bring incremental volumes to the market over the next few years. But the challenges in doing so obviously to increase. There are multiple reasons for this, ranging from permitting challenges to difficulties in procuring long lead time equipment, to difficulties in finding sufficient labor, expansion projects, and especially Greenfield developments that are becoming more critical and very complex undertakings and a time intensive by the very nature. On top of this, the cost of these projects is moving higher due to inflationary pressures, backlogs of the contractors, and especially tight labor markets.\n\nAnd of course, pressure from local communities to participate in these projects means that a longer, more extensive engagement than many new entrants expect is typically required The complexities of integrated lithium production are matched downstream as qualification standards for some battery grade material and not getting easier, and even incumbent producers such as Livent require time to ramp up new production lines to meet the tightening specifications of customers. None of this is to say that there will not be some supply relief in the coming years, although there is any long-term cost curve out there to justify current market prices. But it's hard to see a probable scenario where the lithium market does not remain structurally tight to varying degrees, or one way or our industry returns to prior tough pricing levels. On the other side, it's important to acknowledge just how resilient lithium demand has been.\n\nDespite having gone through a global pandemic, when no industry regional consumer was left unaffected, forecasted lithium demand growth has not only not slowed down, but it's exceeded just about every published forecast available. The latest cautionary flag has been waived point to fears among commentators that high lithium prices will be demand destructive, or to the negative impact of a potential global economic slowdown, especially on consumer demand. While we do not intend to dismiss the likelihood of either, there are so many reasons to remain bullish around lithium. With respect to lithium prices from the recent historical highs we've seen over the last few months, there's been little to no evidence of a resulting slowdown in demand.\n\nAnd even at these higher price levels, lithium so represents a relatively low percent of the total cost of an electric vehicle. Additionally, we're seeing many examples record profitability from consumers of lithium and putting major EV and battery producers. A broader or sustained macro weakening could ultimately have an impact on the end consumer. However, there is merit to a recent EV players classification of the industry as being somewhat recession resilient.\n\nCritical reason for this is just how strongly the shift to electrification is supported by various regions and governments that continue to reinforce their own low to zero carbon commitments, policy incentives, and emissions regulations remains hugely influential. And we've seen stepped-up efforts in recent months, particularly in the U.S. As we will discuss this as the development that we believe is hugely beneficial to Livent and one we have been preparing for. On Slide 7, I'd like to provide some more Livent-specific comments, and why the company is so well positioned as we move into 2023.\n\nAs we said earlier, this is a business that will continue to generate meaningfully higher cash flow. Our growth is supported by being able to sell an incremental 6,000 metric tons of internally produced LCEs in 2023, or a roughly 25% year-over-year increase. Additionally, a large portion of these incremental volumes are uncommitted today from a pricing standpoint. So if market prices remain resilient in 2023, which is in line with our and apparently most other observers expectations, we will achieve higher average realized prices versus 2022.\n\nWe are therefore confident that we will generate meaningfully higher cash flow and a wide range of scenarios. While it may be somewhat premature to speak to cost trends, it is fair to say that we're not projecting a material improvement in raw materials and other input costs in a broad-based high inflationary environment. But with that said, as an integrated producer, our exposure to third-party costs is much lower than those who have to source their lithium inputs externally. And we've shown an ability to pass through certain key costs to customers in 2022.\n\nWe're projecting capital spending in 2023 to be higher than 2022. This is not a change to our previous expectations, as we continue to execute on our roughly $1 billion investment plans from 2022 through 2024, excluding the Nemaska. We will begin to see the initial benefits of these efforts in early 2023, when we ramp up our first 10,000 metric ton phase of carbonate expansion in Argentina, something we can do relatively quickly given the unique nature of our daily based processes. Given some of the recent announcements in the U.S.\n\nfrom the current administration, I want to spend some time on Slide 8, highlighting Livent's regionalization efforts and why the company is so well positioned to take advantage of a growing government and industry focus on developing a comprehensive North American energy storage supply chain. As mentioned earlier, we completed a 5,000 metric ton battery grade hydroxide expansion in the third quarter and have begun the process of ramping up production and qualifying with customers. We expect this ramp-up to be completed in the first quarter of 2023 aligning with the completion of our first carbonate expansion in Argentina which will provide the feedstock for the plant. This additional capacity builds on Livent's position as the largest producer of lithium hydroxide in the U.S., and one of the few hydroxide producers outside of China today.\n\nWe also want to provide an update on Nemaska, as the project is now reaching the conclusion of its detailed engineering phase. Having done this work, we remain as committed as ever to help in bringing Nemaska into production. We continue to believe that Nemaska will be critical to a future North American supply chain and we are excited to be a part of it. As a reminder, Nemaska is a fully integrated lithium hydroxide project located in Quebec, Canada, in which Livent is a 50% and equal partner today alongside investment Quebec and Investment Group owned by the government of Quebec.\n\nNemaska plans to have 34,000 metric tons of nameplate capacity of battery-grade lithium hydroxide and will have over 30 years of mine life as a very large and cost-competitive asset. It will have access to zero-carbon hydroelectric power and will be strategically located close to regional shipping ports at an industrial park being developed in beck and call. This is expected to become a global battery materials hub. And they've already been multiple announcements to produce cathode active materials at the site alongside Nemaska.\n\nCreating a model for localization that we believe is essential to the sustainable development of our industry. Total capex is currently estimated to be around $1 billion, which is consistent with the capital costs of similar integrated projects being developed globally. Mechanical completion for Nemaska remains on track for the end of 2025, with the first meaningful production beginning in 2026, the team has already begun ordering important long-lead equipment that is required for construction, which we expect to begin in early 2023. With respect to financing, Nemaska is evaluating a number of attractive options.\n\nThe resulting structure is likely to include a combination of third-party debt financing, including potential low-cost government funding, financing or pre-payments from future customers, and some funding from the existing shareholders that is IQ and ourselves. We expect to have more to share and comprehensive plan in the first half of next year. It is important to reiterate that 100% of future Nemaska volumes remain uncommitted to customers today. Livent will play a major role in helping Nemaska to identify an appropriate commercial strategy and to manage commercial decision-making.\n\nIt should come as no surprise that Nemaska is looking for us to help them in these areas, given our expertise in qualifying and selling battery-grade lithium products to leading customers globally and especially in North America. We expect to help Nemaska seek a few initial customers that will be both credible and committed to supporting a North American and especially Quebec-centered, localized supply chain. Livent recently hired a new senior executive, who joins us for a major EV-focused OEM, and will lead our efforts in Canada, as well as our expansion strategy more broadly. Regionalization of supply chains, both the security of supply and sustainability reasons has become a growing focus for our industry.\n\nRecent actions taken by the U.S. Government led by the inflation Reduction Act, have provided commitments and incentives to encourage the strengthening of a domestic energy storage supply chain. Given the importance of domestically mined or processed lithium supply and these efforts, we believe Livent is extremely well positioned to take advantage of a number of additional long-term regional growth opportunities. We expect the operations in Bessemer City and at Nemaska to qualify the downstream EV credits under the critical minerals requirement for the sourcing and processing of lithium.\n\nWe also believe there could be cost and capital-saving opportunities for Livent via the advanced manufacturing production tax credit portion of the IRA. We will continue to grow our production capabilities in North America and build on our leading domestic footprint. Both the Bessemer City and Nemaska projects are designed with significant scope and space to build additional production capacity as we continue to grow alongside our customers. Additionally, Livent is advancing designs that will allow any future production lines to be much more flexible in their ability to utilize a wider variety of lithium feedstock material, including various recycling-producing lithium streams.\n\nWith the passage of time, we continue to have increased confidence in the decisions we are making to invest in an America-based supply chain. I want to conclude with a few ESG-related updates. On the back of our annual sustainability report published in the second quarter, we have continued to make meaningful strides on a number of fronts. As one of the first lithium producers in the world, to become a full member of the initiative for responsible mining assurance.\n\nWe are leading by example in our industry, and helping to drive an agenda for increased transparency, stakeholder engagement, and responsible growth. By the end of November, Livent will advance to the next stage of the IRMA process by beginning a voluntary and comprehensive on-site assessment of our Phoenix operations in Argentina. During the onsite review, independent third-party auditors will evaluate our claims and seek direct feedback from various stakeholders including members of local communities. Our participation sends a strong signal that we welcome input from our stakeholders and are committed to responsible growth and continuous improvement in all aspects of our operations.\n\nLivent's long-standing commitment to sustainability and the progress we're making across ESG is increasingly being recognized by both our customers and independent organizations that evaluate sustainability credentials, most recently Livent was placed in the highest tier of sustainable lithium producers in the inaugural ESG report from benchmark mineral intelligence. This is another testament to Livent's leading sustainability profile and the progress we continue to make as we work to deliver on our 2030 and 2040 sustainability commitments. I will now turn the call back to Dan for questions.\n\nDan Rosen -- Investor Relations\n\nThank you, Paul. Dennis, you may now begin the Q&A session.\n\nOperator\n\n[Operator instructions]. And your first question is from the line of Chris Kapsch with Loop Capital Markets. Please go ahead.\n\nChris Kapsch -- Loop Capital Markets -- Analyst\n\nYes. Good afternoon. So you dress this somewhat in your formal comments about the industry dynamics, but just obviously demand outstripping supply. In fact, one consultancy, we talked to, it's pointing to more, I think -- more than I think 800,000 metric tons of demand this year.\n\nSo obviously, this is underpinning a strong pricing cycle, or maybe even paradigms a better word. I'm just curious if this dynamic, most recently is influencing the procurement strategy of any major OEs that you're engaged with. Or is it giving you any thoughts on just revamping your commercial strategy? Just your thoughts on that?\n\nPaul Graves -- President and Chief Executive Officer\n\nHey, Chris, good question. Yes, and no, I think -- I think those of you, including yourself, who followed us for many years know that we -- we've always tried to be commercially focused. We don't think the outside is just producing and selling the product into the market. If you're not engaged with your customers, particularly when you are making hydroxide, you can get really blindsided by changes in battery technology or changes in who's making buying decisions in the supply chain.\n\nAnd so I think it's fair to say that our commercial engagement has allowed us to constantly sort of look forward and have a reasonably accurate view as to what dynamics are coming. And we've largely been kind of not surprised. I think what we're seeing today, I think the interesting dynamic that I see today is I'm not sure it's necessarily driven by the high prices, although I think it gets a bit more attention this way. I think it is the OEM, realizing that they're ultimately paying for the lithium, and it is, they're the ones that in the end are going to suffer if they don't have enough access to the lithium.\n\nAnd so to varying degrees, they're looking around and saying, what role do we play, they can't be zero in most cases. Some -- even people that have been 100%, we will buy all the lithium are backing away from that lithium, say that's maybe not possible anymore. And we're going to have to let other parts of the supply chain, see if they can source the lithium to I mean, ultimately, if you're a cathode producer, or maybe a cell producer, it's up to you as to what grade of lithium you can use. It's up to you to develop a process if you can to make it easier to acquire different grades of lithium.\n\nI don't see a massive trend in that, in fact, my conversations with our customers is frankly advising them that they are crazy to keep tightening the specifications because they're just making it harder and harder for themselves. But I do think there's going to have to be more flexibility on the part of the OEMs. But I also think that today there are maybe three or four guys in the world that have actually engaged with actual really credible lithium supply contracts in the OEM world and it's going to have to go broader than that. I think allowing agents or your supply chain to source everything for you it's going to be really difficult for them.\n\nNow, are they acting any differently today? No, I think it's an evolution, I think the shortness of supply rather than the prices, and maybe they see the prices as a perfect indicator of the shortness of supply is really what's triggering their behavior, which, go back and read our scripts from a year and a half ago, we predicted this, this was going to happen, right, there's going be a look forward. And someone's going to realize they just don't have the raw materials secured. And so I think there's desperation is a strong word, but certainly a lot more concern among the auto manufacturers today about whether they will have enough material.\n\nChris Kapsch -- Loop Capital Markets -- Analyst\n\nI appreciate that. And so my follow-up question. And I think you touched upon this, you mentioned, a strategic hire. And I did pick up on this in the public domain that, I believe this hire is referred to as your now your chief strategy officer, this person that she was formerly had a battery material materials procurement, as she put it in major EV company.\n\nAnd so I'm just wondering if you could just elaborate a little bit more on the rationale for the higher and what her mandate will be. Thank you.\n\nPaul Graves -- President and Chief Executive Officer\n\nYes, sure. That's not really pretty straightforward. We've obviously had a huge amount of engagement with her. She's incredibly talented, she knows the industry probably better than anybody else.\n\nAnd it's a great cultural fit with Livent. And she also brings some other specific skills and qualities that lend herself, for example, to operate in Quebec, which is where we have certainly tasked her with taking the lead on everything Canada, related to us, we see Canada and particularly Quebec as being the second hub for Livent after Argentina, and frankly, probably surpass Argentina with time. And there are opportunities broadly, a view across Canada that she will take the Livent. But I think also she can help us with just a whole range of different areas of where we take the business, what we do in recycling, for example, what our strategy will be there, how large we go, and how big we go, in terms of product mix, carbonate versus hydroxide, even in metal space.\n\nSo it really reflects the fact that Livent is growing, we can't keep pretending that with a company we were five years ago, or even three years ago, and in three or four years' time, I think will be unrecognizable. And to get there, we need more time, we need people with capabilities, and we need to invest not just in assets and resources, but in the people that we have. I believe that people we have in our areas of expertise are the best in the entire industry. And that is a source of competitive advantage.\n\nAnd we're going to keep adding talent, particularly talent, like this person as much as we can to be honest, Chris.\n\nOperator\n\nYour next question is from the line of David Deckelbaum with Cowen and Company. Please go ahead.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nThanks for taking the time, Paul. My first question was just a follow-up on Nemaska. Just wanted to understand the timing. One, I think the last update was estimated capex at a 100% level is $1 billion.\n\nIs that still subject to final feasibility studies? And then I guess, would that capex begin already in the first half of '23? Would that just be early works construction before you might be announcing some sort of holistic financing plan and structure?\n\nPaul Graves -- President and Chief Executive Officer\n\nIt's -- that capital number is to what we call an L3 level which is essentially we're confident of it to plus or minus 10%, which is the level we insist and the so the investment Quebec insist we get to, in order to give construction approval, too many projects. You've seen numbers out there where there are FEL 1 or FEL 2 level, which is plus or minus 30% 40% 50%, you can't make investments. So the comps are ordering items and starting construction that way. So it is absolutely a definitive number of how as far as we will go in terms of the engineering.\n\nSo it's a pretty solid number for sure. The spend is frankly already started remembering we -- this is an integrated project as corporate mine and as the hydroxide plant. But other spending at the mine, actually already took place in the previous incarnation and it's spending that doesn't have to be repeated. So at the mine level, frankly, the minus sort of sat waiting for the chemical plant, we could certainly start -- we could bring the mine up and running much more quickly, probably sometime maybe in late '23 early '24 if we really wanted to, but we haven't -- we're not going to sell spot concentrate, we're not going to export spot concentrate.\n\nI don't think the government of Quebec wants us to do that. We don't want to do that. So we will defer additional spending at the mine until closer to the point at which the chemical plant is built. The chemical plants take two or three years to build.\n\nPeople can tell you whatever they wish but unless they've got special magic into some of the long lead item producers, the crystallizes and some of the -- and by the way, we compete for parts with like copper projects, for example. It's not like everything's unique to lithium, we just can't get this stuff inside two or three years, you shouldn't order this stuff until you're at the L3 level anyway. So this is just the nature of why it takes so long to build these things. Maybe somebody has a magic path in China, but in the West, that's just how long it takes.\n\nThe groundbreaking to start construction and beck and call will start in January, February, still was a little more difficult in Canada because it gets so cold in winter. So we have to sort of phase when we start the construction. But the construction itself is not frankly, the item that pushes out or 25 26, it's these long lead items.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nFair enough. Thanks for the color, Paul. And then my second question, was hoping to take a stab at the percentage of volumes on market-based pricing. Maybe if you want to stick the high level, you can walk us through the evolution of contracting, which this year I think was around 70% of your volumes were one fixed price arrangement.\n\nAnd that's evident and kind of the guidance that you're giving through 4Q. One, I guess what those contracts becoming up for review in '23. And then certainly, I guess with the expansion, it's a large number, I assume that the incremental volumes would be under new contracts, maybe you can give us a high-level sense of just that mix shifts and when that would be occurring?\n\nPaul Graves -- President and Chief Executive Officer\n\nIt's really straightforward. I think those contracts we said this year roll forward into next year, those volumes are still under a fixed price next year. The additional volumes haven't, when they come up with a few, a few adjustments here and there, largely we're free to sell at whatever price we wish. We may do them under contract, we may just sell them, frankly, at $79.15, or whatever the latest realized price in China is.\n\nThat's a decision we'll make later in the year as those products come online. But we will almost certainly, even if we contract them, they will be market-exposed prices. I think as you look forward a little bit further, you should assume that as we go to '24 and '25. I personally believe the day of the fixed price contract has been killed by the last 12 months.\n\nI don't think anybody's renewing their contract and fixed prices. I think cash and collars will have a bigger role to play. But there'll be a lot of flexibility of market price movements within caps and colors. And the reason for that is very simple.\n\nYou can get away with a fixed price, when sort of the tension over that price was never too great, the market price is $3 higher or $3 lower. But when the market price is 10s and 10s of dollars higher, you just have too much tension around a fixed price contract. So whichever way you look at it, fixed price contract probably are no longer going to be part of our industry, generally speaking, is my own view. And so as fixed price contracts, do roll over, they're all going to roll over into some form of market-based pricing.\n\nOperator\n\nYour next question is from the line of Steve Richardson with Evercore ISI. Please go ahead.\n\nSteve Richardson -- Evercore ISI -- Analyst\n\nGood evening. Thanks for the time. Paul, I wonder if you could address, last quarter, we talked about the GM transaction and the three sell or however you want to categorize it. I'm wondering if you could talk a little bit about conversations with your other customers, and how that may have kind of changed the tenor of conversations with other your potential customers and your existing customers.\n\nKnowing that you have this longer-term commitment and tie-up with GM?\n\nPaul Graves -- President and Chief Executive Officer\n\nYes, it's an interesting model. I think there were I'm going to describe the three different types of customers, there's the customer that has kind of had the market for themselves for many years. And their reaction, which I think is largely, as you would expect, no surprise, I mean, the market is evolving. There's a lot more competition coming in and when the relationship that we've had with customers, it goes back so far, and so long, it's an honest, open conversation about where are we with each other.\n\nWhat does it mean, and what is expected of that customer as we go forward? And what's expected of us, by the way with that customer as they move forward. Because the customers that are contracted with us relatively early in their relationship, frankly, get a little nervous that does this mean there won't be more volumes for them in the future. And so there's a, it helps our engagement with that customer because it forces them to come and really understand what our investment plans are, where they fit in those investment plans. And equally, what they can do to be more prominent in our future supply chain plans, which is they're all keen to do.\n\nAnd then there's the customers that we don't supply today that have been wanting to be supplied by us. And frankly, I think it creates a little bit of panic and uncertainty on their part. Again, I don't want to use the word desperation because that's not actually a valid word for what is going on out there. But it's created, I think, more concern that, people like Livent and I think others in the industry aren't going to have 10 major customers, I think we're going to be serving three or four and we're going to pick the customers that fit best with us on multiple different parameters.\n\nAnd so there comes a bit of a dating game going on, I think among the uncontracted customers as to who do they want to try and persuade to partner up with them.\n\nSteve Richardson -- Evercore ISI -- Analyst\n\nThat's great. Very helpful. One thing I was wondering, if you could just clarify or give us your read on is the tax credit element on critical minerals as part of the IRA, the language around U.S. sourced and FTA sourced.\n\nCould you just clarify your ability to meet that and your customer's ability to meet that requirement with material sourced from Argentina. Sounds like there'll be a pretty broad reading of that. And it really just means not China sourced but I was wondering if you could just clarify because --\n\nPaul Graves -- President and Chief Executive Officer\n\nI don't -- I actually think it's going to be a very narrow reading. If you look at the comments that the treasury secretary made recently. I don't think the interpretation is going to be of the wording is going to be a broad one, I think is going to be quite a narrow one. I think what is interesting, I think most people's reading of it is not just ours, but obviously, our customers read it very carefully too which is, if the final product coming in is from a country with a free trade agreement, then it's going to be eligible, frankly in lithium to that's only one place that's Chile, carbonate coming from Chile.\n\nIf the product is processed into a secondary product, a usable product in the U.S., that will also qualify. So lithium carbonate from Argentina, into Bessemer City converted to lithium hydroxide that lithium hydroxide is processed in the U.S. that will qualify. Spodumene concentrate coming out of Australia, processed into carbonate or hydroxide in China will not qualify even though Australia does have a free trade agreement.\n\nSo it's not always as clear and as simple as you might think, in terms of lithium because you think this benefit for Australia, but the product Australia produces can't be used in the U.S., so won't come here. The product in Argentina made by us at least can be processed into a usable product. And so although there's no free trade agreement with Argentina, that actually will be OK, provided it runs through additional value-added processing in the U.S.\n\nSteve Richardson -- Evercore ISI -- Analyst\n\nIt's a really helpful clarification. Thank you very much.\n\nOperator\n\nYour next question is from the line of Christopher Parkinson with Mizuho, please go ahead.\n\nChristopher Parkinson -- Mizuho Securities --Analyst\n\nAwesome, thank you very much. Paul, can you just quickly run through just the various projects and expansions and just kind of say, where you are, where you expect to be. And just anything that can instill further confidence and getting these up and running for over the next year or two, that'd be very helpful. Thank you.\n\nPaul Graves -- President and Chief Executive Officer\n\nSure. So first 10,000 pump in Argentina, all carbonate, it will be mechanically complete with four pieces to it, three of them will be mechanically complete in the next few weeks, the last one just after the New Year, which means that we can start feeding that plan and getting it up and running, it'll start producing, as we said sometime in the second quarter. The second 10,000-tonne expansion, which was sort of linked to the same infrastructure as this one, which is so much quicker, will be mechanically complete problems later. So it'll go up and running again.\n\nAnd then we have another 20,000-tonne expansion coming that will follow that which will be mechanically complete by the end of 2024. So, we've got big chunks coming on at the end of '22, end of '23, and end of '24 in Argentina. We just mentioned Nemaska, that'll be done by the end of '25 and producing in 2026. We have Bessemer City expansion is already complete by 1,000 tons that will be up and running and producing and shipping to customers sometime early next year.\n\nAnd then we have a 15,000-tonne expansion in China for hydroxide, which will be completed by the end of 2023. And also no doubt commercially contributing sometime early mid-2024.\n\nChristopher Parkinson -- Mizuho Securities --Analyst\n\nGot it. And just as a quick follow-up, I mean, you and others have been funding a plethora of strategic partnerships. I'm sure you're happy with those, but kind of now that you've had a chance to kind of take a step back and see what you've already been accomplishing. Is there anything else on the horizon which the street should be considering in terms of that? Are you kind of happy with the ones you've already done over the last 12 to 18 months? Any color would be helpful.\n\nThank you.\n\nPaul Graves -- President and Chief Executive Officer\n\nAre you talking customer commitment or --\n\nChristopher Parkinson -- Mizuho Securities --Analyst\n\nYes, commitments, if the customer's like that.\n\nPaul Graves -- President and Chief Executive Officer\n\nYes, yes, our customer commitments and the ones we've made are nowhere near big enough to keep us happy. We just don't have any more supply to sell anymore. And so we're very happy with the customers that was lined up with it. I think our engagement with them their engagement with us that openness.\n\nIt's just been -- it's been really great to see and we're very happy with it. We would like to sell them more products. Our aim is to get them a lot more product. Our aim is to add maybe one more, maybe two more major customers, but we need to expand our supply first.\n\nSo it's a good chicken and egg. I think it's why we've hired somebody to help us as quickly as we can expand our production footprint. Also, that we can meet the supply requirements to our existing and one or two new customers.\n\nOperator\n\nYour next questions from the line of Graham Price with Raymond James, please go ahead.\n\nGraham Price -- Raymond James -- Analyst\n\nHi, good afternoon. Thanks for taking the question. Just following up on the previous question, I guess the first, pass the expansion in Argentina, once that comes online early next year, how long does that take to ramp up -- to reach kind of steady state?\n\nPaul Graves -- President and Chief Executive Officer\n\nYes, it's a bit of a -- it depends on time of year frankly, luckily, for us, it's coming on in that summer, which means we can usually move the material through the process and a month rather than four or five months, that doesn't mean it'll take a month, just making sure nothing leaks, and everything works takes a couple of months. So my expectation of the team is that they will be producing material that is capable of being used in a hydroxide plant before the end of the second quarter.\n\nGraham Price -- Raymond James -- Analyst\n\nGot it. That makes sense. And then looking to Bessemer City, you mentioned that there's additional capacity for expansion there. Just wondering, ultimately, what the maximum capacity there would be, and if you decided to expand it at the timeframe?\n\nPaul Graves -- President and Chief Executive Officer\n\nI think I'm not sure there is a limit, it's a massive site. I mean, we used to mine there, and so 200-something acres, and we put room down for a second 5000 online to sit next to the first one. But frankly, I don't think it would take a huge leap to add multiples of that in Bessemer City if we could try to the biggest issue is just expensive to do it in the U.S. It's all very well, wanting U.S.\n\nbase production, but someone has to pay for that. It's probably 10 times the capital of doing it in China. And when you actually think back that the nature of that particular beast is that it requires carbonate and so you also have to source the carbonate in Argentina spent significant capital commitment to expand. So it really comes down to whether customers are willing to pay to make it worthwhile.\n\nI mean, we can keep doing it. I wouldn't say all day, all year, but we can certainly do multiple iterations and Bessemer City if the customers are there for us.\n\nGraham Price -- Raymond James -- Analyst\n\nGot it. That's helpful. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Joel Jackson with BMO. Please go ahead.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nHey, Paul, how're you doing? I'll try this question, and maybe we'll run with it or not. Well, let's say that spot prices kind of stay where they are, for the next couple of years, OK. What would you think would be your average selling price like so you got your fixed pricing locked in for next year, you've got new tons of uncommitted ones, what would kind of Livent's realized price gain kind of the year-over-year in '23 versus '22? Like maybe you can ballpark, give us a range to the spot stay where it is, please?\n\nPaul Graves -- President and Chief Executive Officer\n\nI know you want to want me to run with that. I'm going hold up running with it. But I will answer it next quarter when we do guidance for '23. It's going to be higher, one way, that it's going to be higher.\n\nBut that's not necessarily about the pricing environment, it's about us having more volume able to sell at a higher price. And I think over time, I don't think I really don't think that price you see in China is going to be the benchmark price for lithium pricing in the long run. I really don't -- I just -- it's too volatile, it's too variable. And I think too much of the supply chain now is pulling yourself out of China for the long run.\n\nBut for the next three or four years, everything's going to change. Forget that there are no capital plants in North America, there's limited capital capability in Europe. The lithium is going into China today, largely. So that's why it's such an important price.\n\nAnd why if you are in China with uncontracted volumes, it's a fantastic market to be in, but never where we've been and I think if we were to turn around to all of our customers today, and so that says we're locking you in, you're going pay whatever the China price was, I think we lose a lot of what we offer to these customers in terms of reliability, predictability, partnering, and I think that that carries with it pretty big penalties for a business like ours that requires great visibility as to whether the electrification roadmap is of our customers because it impacts what we do, what we make where we invest. So I think it will certainly push up average prices in our industry realized prices next year, for those of us that are -- have a multiyear kind of portfolio of customer contracts. But I don't think anybody I don't think anybody's going to reach an average realized price that is close to that China price.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nOK. I got a two-part of my second question just on Nemaska. I think you said earlier, you're looking at financing options. I mean, do you need to start raising capital in Q1, how is the capital-intensive vision pick up? And the second question is there's a lot of feedback from investors as you know that OK, it's as good as it gets in lithium, right? It can't get better 70,000 tonne, lithium, there's a reason why people say that, OK.\n\nAnd a lot of things that people will cite, as here's what's coming next, whether it be battery inventories, cabinet inventories, European EV demand elasticity, China, it's over, it's over. What would be your answer to that?\n\nPaul Graves -- President and Chief Executive Officer\n\nYes, so look, I think we deal with that one. May answer is pretty straightforward. I don't think in terms of average realized prices for Livent, is anything close to as good as it gets not even close. And United spoke about this.\n\nIf the price of China dropped from the $80, that people are quoting today to half that much next year, our average realized price would still significantly go up. And likely, if it stayed there for a few years, our average realized price is going to go up for two or three more years. This is just a function of us, A, bringing on more volume. And that volume is going to go out the door at a higher average realized price than we saw in 2022, plus these fixed price contracts I mentioned expiring and being replaced with floating price contracts.\n\nSo I don't know that for actual earnings delivery for profitability for cash flow generation, I really don't think this is as good as it gets. Is $80 as good as it gets, our internal prediction is it's going much higher in Q4 that $80. We'll see because, as a former boss of mine said, trees don't grow to the sky. At some point, it has to stop at some point this has to have baked.\n\nAnd I think it's sort of somewhat masked a little bit, the moment the strengthening of the U.S. dollar means that the prices are relatively constant in USD terms as it continues to climb in RMB terms. There comes a point that's got to stop, but it probably isn't Q4 this year. And your question on Nemaska, I forgot what it was already.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nIt was, well, you got the capital, not the capital call, it's going to start coming quickly to lot, right?\n\nPaul Graves -- President and Chief Executive Officer\n\nIt'll be the backend the next year with the earliest one but the first half of next year. We don't expect to have to with some, I don't think we have a capital raising requirement for Nemaska period at any point during the project, we won't see a big Livent kind of market corporate capital to fund Nemaska, it's going to come out with existing cash flow, or more importantly, there are other sources of financing, I mean Nemaska stand-alone still, it'll sort its own financing out as an IQ as the shareholders will dictate whether what their financing looks like, it's not just going to be every dollar that gets provided $0.50, that they need gets 50% IQ. That's how I would finance those.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nMay I ask one more on that. I think you guys are going to account for Nemaska on what do you call it like an equity investment kind of basis? Will it be like the Albemarle Greenbushes JV. Are you going to -- how you're -- it's going to be after tax that income before EBITDA? Can you tell us how you're going to do it on the Nemaska?\n\nPaul Graves -- President and Chief Executive Officer\n\nIt's really simple. Unlike other situations, there will be no supply arrangement between Nemaska and Livent. Nemaska is a stand-alone company. And so we'll just represent our share of the profits of Nemaska until we consolidate it, we will consolidate it at some point in the future.\n\nBut until that point, it'll just be we'll just capture 50% of the net income of Nemaska, in a single line item.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nSo not EBITDA? So it won't be an EBITDA, it'll just be a net income and EPS, correct?\n\nPaul Graves -- President and Chief Executive Officer\n\nIt's achieved mutual accounting is net income, it's not going to be a proportionate consolidation down the ballot than the income statement, it's going to be straight single line sensitive net income.\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nOK. Thank you very much.\n\nPaul Graves -- President and Chief Executive Officer\n\nBut that doesn't really matter to all businesses that Nemaska is not producing or selling at in the next two or three years. So it's kind of irrelevant, to be honest. It's only when it's up and running, at which point I would hope we're consolidating by that point, I would hope.\n\nOperator\n\nYour next question is from the line of Kevin McCarthy with Vertical Research Partners. Please go ahead.\n\nKevin McCarthy -- Vertical Research -- Analyst\n\nYes. Good evening. Paul, the theme of reshoring is gained a lot of traction over the last year or two. You've added five kilotons of hydroxide in North Carolina and you're adding triple that amount or 15 kilotons in China, maybe a year from now.\n\nI guess my question would be, how do you think the IRA will impact capital allocation moving forward? Seems you've got new credits stateside. But I think you also commented, the capital differential is 10x. So you as you look at future needs, how do you weigh those countervailing pros and cons in determining where to add capacity?\n\nPaul Graves -- President and Chief Executive Officer\n\nNow, let me start by saying I don't think there'll be no response to the IRA in other parts of the world. I suspect that maybe the IRS itself is the response to actions and incentives given in China. I don't know whether Europe is going to have to sort of really take a long hard look at itself and decide what it wants to be I am sure, to what it doesn't. It doesn't seem to have a particular coherent policy and certainly doesn't seem to have a particularly well-thought-out incentive structure to onshore in Europe, but that may happen as well.\n\nI think it's a really difficult question because I think, people ask, well, you get reasonably differentiated pricing per product. And that's quite possible. I think you may have regionally different expectations about how much capital a customer is forced to give you in order to incentivize you to produce, it's a big difference, though, it's a big difference that's going to have to be, it's going to have to be resolved. I think, in lithium, and especially in areas like nickel, it'll be interesting to me, because some of the big producing areas may actually make them double down and focus on China more and say, look, we just can't meet that it's either too much capital or because we don't have a free trade agreement.\n\nAnd China actually may get a short-term big advantage out of this. And there may be more investment in China and around China and processing. Because bluntly, if you're producing Australian spodumene, and you read together, keep shipping it to China, or you got to build onshore hydroxide capability, we know how hard that is in Australia, in order to serve the U.S. I don't know many Australian miners are quite emotional about the investment decisions they make.\n\nI think they're quite hard-headed about it. And I suspect they're going keep shipping to China.\n\nKevin McCarthy -- Vertical Research -- Analyst\n\nThanks, I appreciate the thoughts.\n\nOperator\n\nYour next question is from the line of Jeff Zekauskas with J.P. Morgan. Please go ahead.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nThanks very much. Your sequential price mix in the quarter was zero. Is it the case that the 70% of fixed price contracts that you have that you were that are longer extended? Are such that as a base case, that revenue effect on those tons should be zero for the next five quarters? And for the 30%? That's not fixed. How long? Should it remain zero? That is, you must have sold forward, I guess, at a certain price or made some commitments.\n\nCan you explain that?\n\nPaul Graves -- President and Chief Executive Officer\n\nLook into the cold dress. I'm not quite sure I understand your point about sell forward. Look, it's really straightforward. Let's take a really simple example, if our mix of customers between Q2 and Q3 was exactly the same, and I sold exactly the same proportion to my fixed price contract, and I have different ones.\n\nSo these proportions are the same quarter to quarter, my volume and the amount that goes into the market is also the same. Q2 to Q3 realized pricing wasn't massively, definitely a little bit higher in Q3, but not much. So you would expect price mix in that situation to not be massively different. If for whatever reason, and you may see this in Q4, the amount going to fixed price contracts relative goes up, my preference is going to be down unless there's a massive jump in the market base piece of it to offset, it's going to go down, right, because the mix works against me at that point in time.\n\nIt's frankly, just math. I mean, I think it's the danger of looking at as on a quarter-by-quarter basis. Why we don't guide on a quarter-by-quarter basis don't really run the business on a quarter-by-quarter basis, we run out on an annual basis. And so I tend to encourage people to not get too hung up on that piece.\n\nWhile ever we're still on track for full-year guidance, while over all of our kind of predictions as to average realized pricing and mix et cetera, for the full year, or what we said and advise and ask you to not get too hung up or get or read too much into quarterly movements, I noticed a tendency to do that. To try and get more data, more data doesn't necessarily give you a better decision or a better understanding in our industry.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nOK. Well, then I'll try a longer-term question. And I apologize if it's too naive. What you said is that the costs with construction in North America are sometimes 10 Act, what they are in China.\n\nAnd when you look at your lithium hydroxide expansion in China, where you're expanding 15,000 tonnes for 25 million if we scaled that up to 34,000 tonnes, that would be 56 million. And at the Nemaska plant for the hydroxide plant, the capital spending is 650 to 750. So, do we get for 650 to 750 in Canada, what we get for 56 in China, or we get something more?\n\nPaul Graves -- President and Chief Executive Officer\n\nFundamentally different projects. Fundamentally different projects. You could not build the Quebec, the Canada that Nemaska spodumene to hydroxide plant for $56 million in China. I mean, it's a different scale.\n\nIt's a different complexity. Our carbonate to hydroxide plants bluntly are quite simple processes they shouldn't cost as much as they do in the U.S. They just do their work in Europe too. So you can't compare those two, you can compare, essentially the Bessemer City plant versus a China plant.\n\nAnd that's when I talk about, an eight to 10 times difference. And it's probably come down a little bit lately, China has got a bit more expensive, and we have found more efficient ways to do it in the U.S. But it's still five, six, seven times as much and it's exactly the same plant, exactly the same capabilities. But like I said, don't compare with Canada fundamentally different time.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nYour next question is from the line of Corrine Blanchard with Deutsche Bank, please go ahead.\n\nCorinne Blanchard -- Deutsche Bank -- Analyst\n\nHey, good afternoon. Thank you for taking the time. My first question, I would actually be able to interpret North Korea on the implied for Q. So the guidance was narrow up.\n\nBut I think in one of the last slide in your presentation, pricing what cited in 3Q and you mentioned expecting increased pricing going into focus. I am just trying to reconcile, which kind of one-share goals we can expect for EBITDA. Are we looking at a flattish EBITDA quarter-over-quarter?\n\nPaul Graves -- President and Chief Executive Officer\n\nYes. Look, I think it's guidance range. And you know what our year-to-date EBITDA is and so clearly to me, our guidance range EBITDA is going to be lower in Q4 than in Q3. It reflects a bunch of different stuff.\n\nIt reflects mix differences in Q4, it reflects -- we've seen increasingly, end of Q4 shipping logistics gets difficult. And so we don't recognize revenue until the project product arrives. If the product stays on the watch for an extra week, over a year or two weeks, can impact revenue for sure. We're expecting that to happen.\n\nSo there's a whole bunch of different things going on in Q4 which bluntly, sort of reflect the specifics of us, they will reflect the specifics of the way our customers are taking products where they're taking the product, what product it is. And also, the fact that it is the end of the year. So it's -- I would describe Q4 the broad environment to be probably slightly stronger than it was in Q3. I think the opportunity in Q4 for us is slightly stronger than it was in Q3.\n\nBut we are more constrained into how much we can take advantage of that opportunity in Q4 versus Q3.\n\nCorinne Blanchard -- Deutsche Bank -- Analyst\n\nOK. Thank you. And then maybe just the follow-up question. I'm going to switch.\n\nOn the demand side, I think we're starting to hear more and more concerned about China EV demand going into 2023. And, pretty much on macro, I know you've commented a little bit, but anything else you kind of had or have you seen any sign of softness going into the end of this year and next year?\n\nPaul Graves -- President and Chief Executive Officer\n\nMy only comment on this is when you have lithium growth being -- I don't know 5% 10%, quarter over quarter and you have battery demand or battery production levels between Q2 and Q3 double it in China, I think yes, you got a lot of room for softening of demand, in my view of EVs in China, particularly without making a slightest dent on the excess of demand over supply. I haven't seen any evidence of slowdown in China, I think with a lot of expectation that it's going to come I think there's a lot of nervousness in China about what COVID policies and others are doing to a lot of general levels of industrial production. EVs haven't been hit anywhere near as hard battery production has not been hit anywhere near as hard. There are more and more contracts being signed in Chinese battery companies to export into western vehicles.\n\nSo it's not just the EV market in China that's driving battery production activity in China. So it's just one factor, it's a complicated market. There's a lot of pieces moving around. We've yet to find many examples of a single metric, having a clearly determinative effect on lithium demand.\n\nIt tends to be a bunch of different factors that are happening that will drive the impact on our industry.\n\nCorinne Blanchard -- Deutsche Bank -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThis concludes the Q&A portion of today's call. I will now turn the call over to Dan Rosen for any closing comments.\n\nDan Rosen -- Investor Relations\n\nThanks a lot. That's all the time we have for the call today. We will be available following the call to address any additional questions you may have. Thanks, everyone, and have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDan Rosen -- Investor Relations\n\nPaul Graves -- President and Chief Executive Officer\n\nGilberto Antoniazzi -- Chief Financial Officer\n\nChris Kapsch -- Loop Capital Markets -- Analyst\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nSteve Richardson -- Evercore ISI -- Analyst\n\nChristopher Parkinson -- Mizuho Securities --Analyst\n\nGraham Price -- Raymond James -- Analyst\n\nJoel Jackson -- BMO Capital Markets -- Analyst\n\nKevin McCarthy -- Vertical Research -- Analyst\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nCorinne Blanchard -- Deutsche Bank -- Analyst\n\nMore LTHM analysis\n\nAll earnings call transcripts"
}