{
  "companyName": "Block, Inc.",
  "companyTicker": "SQ",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/block-inc-sq-q3-2022-earnings-call-transcript/",
  "content": "Block, Inc. (SQ -0.13%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Block third quarter 2022 earnings conference call. I would now like to turn the call over to your host, Nikhil Dixit, head of investor relations. Please go ahead.\n\nNikhil Dixit -- Head of Investor Relations\n\nHi, everyone. Thanks for joining our third quarter 2022 earnings call. We have Jack and Amrita with us today. We will begin this call with some short remarks before opening the call directly to your questions.\n\nDuring Q&A, we will take questions from our customers, in addition to questions from conference call participants. We would also like to remind everyone that we will be making forward-looking statements on this call. All statements other than statements of historical fact could be deemed to be forward-looking. Actual results could differ materially from those contemplated by our forward-looking statements.\n\nReported results shall be considered as an indication of future performance. Please take a look at our filings with the SEC for a discussion of the factors that could cause our results to differ. Also, note that the forward-looking statements on this call are based on information available to us as of today's date. We disclaim any obligation to update any forward-looking statements, except as required by law.\n\nDuring this call, we will provide preliminary estimates of gross profit growth performance for the month of October. These represent our current estimates for October performance as we have not yet finalized our financial statements for the month of October, and our monthly results are not subject to interim review by our auditors. As a result, actual October results may differ from these estimates. Moreover, this financial information has been prepared solely on the basis of currently available information by and is the responsibility of management.\n\nThis preliminary financial information has not been reviewed or audited by our independent public accounting firm. This preliminary financial information is not a comprehensive statement of our financial results for October or the fourth quarter. Also, we will discuss certain non-GAAP financial measures during this call. Reconciliations to the most directly comparable GAAP financial measures are provided in the shareholder letter, Investor Day materials, and investor presentation on our investor relations website.\n\nThese non-GAAP measures are not intended to be a substitute for our GAAP results. Finally, this call in its entirety is being audio webcast on our investor relations website. An audio replay of this call and the transcript for Jack and Amrita's opening remarks will be available on our website shortly. With that, I would like to turn it over to Jack.\n\nJack Dorsey -- Chief Executive Officer and Chairman\n\nThank you all for joining us. As we've discussed before, we are building multiple ecosystems to serve different audiences, Square for sellers, Cash App for consumers, TIDAL for musicians, and TBD for developers. What makes Block unique is our ability to connect all of these together. We've made a lot of progress on each and I'll share some highlights from Square and Cash App before Amrita's remarks and your questions.\n\nWe'll start with Square. We realized there are some significant challenges all businesses are facing today, and so giving sellers simple and intuitive tools to remove complexity from running their business is critical. We're focused on three priorities to achieve this, enabling omnichannel capabilities, growing upmarket and expanding internationally. Core to our strategy is building integrated solutions that give larger sellers a cohesive view of their operations so that they can easily manage every aspect of running a business.\n\nOur developer platform extends our software capabilities by allowing integrations with hundreds of third-party products built by developers and partners using our open platform. We enable customized solutions for sellers with more complex needs and provide a single platform for developers to take payments from Square across mobile, in-person, and web.  We're also continuing to build our vertical point-of-sale solutions that serve our largest verticals of food and drink, retail, and services, with Square for restaurants, Square for retail, and Square appointments. Together, gross profit from these solutions grew 45% year-over-year, much faster than Square overall in the quarter. In Q3, we also expanded the payment message we support.\n\nIn the U.S., we launched Apple's tap to pay on iPhone, giving Square sellers a simple way to accept contactless payments with no hardware needed and customers a convenient way to pay. In Japan, sellers can now accept PayPay QR code payments, the most popular QR code wallet in the country. And now for Cash App. As we shared during our Investor Day earlier this year, we are focused on building seven development pillars to drive Cash App's business.\n\nI'll touch on progress we made this quarter in financial services and commerce. Within financial services, we want to strengthen our relationships with customers through a full suite of banking products. This starts with customers being able to easily fund their Cash App accounts. Over time, we've expanded the ways customers can do this, whether through direct deposit, paper money, check deposits or bank transfers.\n\nCash App Card and direct deposit are two of our most important banking products, and we're focused on growing usage of both. Cash App card is usually our first financial services product that customers try and often their introduction to banking with Cash App. As of September, there were nearly 18 million actives using Cash App card, making up more than 35% of our monthly actives and bringing in half of all inflows across our platform. In Q3, we made it easier to bank with us.\n\nCustomers can now receive an account and routing number instantly when ordering a Cash App card, which reduces friction for those who need banking services and has driven meaningful growth in direct deposit customers. As we continue to deepen the connections between our ecosystems and undertake the complex integration of Afterpay, one of the long-term opportunities we are most excited for is in commerce. In Q3, we completed the rollout of our first iteration of the new discover tab, making it seamless for customers to search for people and businesses and find offers, including instant discounts from merchants who accept Cash App pay. Cash App pay lets customers check out through a simple QR code payment, whether online or in person.\n\nAfter testing Cash App pay at Square sellers over the past year, we're beginning to broaden Cash App pay acceptance outside of the Square ecosystem, starting with select Afterpay merchants. We're still early in our journey to transform Cash App into a commerce destination that bridges our seller and consumer ecosystems. We believe it will take some time to achieve this vision and doing so will bring us back to our original mission to help sellers make more sales. Finally, we know a lot has changed in our business over the last year, including with the acquisition of Afterpay.\n\nAnd we recognize that understanding our business today may seem complex, especially in a changing macro environment. We're working to distill how we invest and operate into a clearer and more cohesive framework to help you better understand our business in 2023 and the longer term. Amrita will be addressing some of our current thinking for 2023 today in her remarks, but we plan to do so more comprehensively in our fourth quarter call in February. And with that, here's Amrita.\n\nAmrita Ahuja -- Chief Financial Officer\n\nThanks, Jack. There are three topics I'd like to cover today: first, an overview of our third quarter results; second, trends we've seen across our business in October; and third, our discipline around expenses. In the third quarter, we delivered strong growth across our ecosystems with gross profit of $1.57 billion, up 38% year-over-year and 46% on a three-year CAGR basis. Gross profit includes a $90 million impact from the amortization of acquired technology assets, primarily related to Afterpay, and excluding these noncash expenses, gross profit was $1.59 billion.\n\nWe delivered strong profitability during the quarter with adjusted EBITDA of $327 million. In the third quarter, our BNPL platform, which we acquired through the acquisition of Afterpay, contributed $150 million of gross profit, split across Square and Cash App. And excluding this, gross profit for the quarter was $1.42 billion, up 25% on a year-over-year basis and 42% on a three-year CAGR basis. Cash App generated $774 million of gross profit in the third quarter, an increase of 51% year-over-year and 84% on a three-year CAGR basis.\n\nExcluding our BNPL platform, Cash App gross profit was $700 million, up 37% year-over-year and 78% on a three-year CAGR basis. This quarter, overall inflows in the Cash App totaled $52 billion for growth of 19% year-over-year and represented our highest quarterly inflows into Cash App. Let's look into the drivers using our inflow framework across actives, inflows per active, and monetization rate. First, our network reached 49 million transacting actives in September, up 20% on a year-over-year basis, with daily and weekly actives growing even faster.\n\nWith Cash App's community pillar, we remain focused on enhancing the viral growth of peer-to-peer with complementary marketing programs that target new audiences. Second, inflows per active averaged $1,046 in the third quarter, which was relatively consistent with the first and second quarters and was also stable on a year-over-year basis. Inflows per active has been driven by continued product adoption, with Cash App card and direct deposit, as Jack mentioned, and by expanding our inflow channels. We believe driving inflows per active starts with customers' ability to easily fund their Cash App accounts through a variety of channels.\n\nTogether, direct deposit and paper money deposits have made up a growing share of overall inflows, reaching 14% of inflows in the third quarter, up from 9% a year ago. In September, customers received more than $2 billion in direct deposits into their Cash App accounts, driven by strong growth in direct deposit actives and direct deposit inflows per active compared to the prior year. Paper money deposits crossed nearly $3.5 billion in cumulative deposits through September, only a year since launch.  Square generated $783 million of gross profit in the third quarter, an increase of 29% both year-over-year and on a three-year CAGR basis. Excluding $75 million of gross profits from our BNPL platform, Square gross profit was $708 million, up 17% year-over-year and 25% on a three-year CAGR basis.\n\nSquare GPV grew 20% year-over-year in the quarter or 22% on a constant currency basis with a two-point headwind to growth from foreign exchange rates. Looking at our cohort economics, we continue to see healthy retention trends across our existing seller base. In the third quarter, we achieved positive GPV and gross profit retention for our Square business. Looking into the drivers of Square's third quarter performance.\n\nFirst, we continue to drive growth with larger sellers. Gross profit from mid-market sellers was up 22% year-over-year and 39% on three-year CAGR basis. Our developer tools have helped us serve the needs of larger, more complex sellers, allowing us to grow up-market. During the third quarter, nearly 50% of mid-market GPV was generated by sellers connected to our open developer platform.\n\nSecond, we continue to expand globally. In the third quarter, GPV from our markets outside the U.S. grew 40% year-over-year or 55% on a constant currency basis as foreign exchange was a significant drag on year-over-year growth across all international markets. Looking at volume trends by market in the quarter.\n\nGrowth in Australia and Canada remained strong while we saw a macro-related slowdown in the U.K. Now to provide an update on our BNPL platform, which we acquired through the Afterpay acquisition. In the third quarter, GMV for our BNPL platform was $5.4 billion, up 10% year-over-year or 60% on a three-year CAGR basis. For overall growth trends, we've experienced an impact from spend shifts from online to in-person, competitive dynamics as well as foreign currency, which slowed year-over-year GMV growth by five points in the third quarter.\n\nAs we integrate Afterpay, our teams are focused on bridging commerce across Cash App and Square and are making steady progress toward our longer-term vision. On a GAAP basis, revenue for our BNPL platform was up 6% year-over-year, growing slower than GMV, given mix shift to enterprise sellers and newer markets. Gross profit was down 3% year-over-year, impacted by $12 million in amortization of intangibles within cost of sales. Without this impact, gross profit would have been more in line with revenue growth.\n\nLosses on consumer receivables were 0.96% of GMV during the third quarter, an improvement quarter-over-quarter compared to 1.02% in the second quarter and an improvement year-over-year, driven by mix shifts as well as enhancements to our risk models and processes during the first half of the year. We continue to see healthy consumer repayment behavior with more than 95% of installments paid on time. As we enter into 2023, we intend on simplifying many of these disclosures, we don't intend on speaking to our BNPL performance separately once we anniversary the acquisition of Afterpay. And we'll also shift our focus away from three-year CAGRs and toward year-over-year growth rates as we lap the onset of the pandemic three years ago.  Next, an update on recent trends.\n\nOn both a year-over-year and three-year CAGR basis, October total gross profit growth is expected -- is estimated to be relatively consistent with the third quarter. In October, we estimate overall company gross profit growth of 37% on a year-over-year basis, including our BNPL platform, or 24% excluding our BNPL platform. We expect fourth quarter gross profit growth to remain relatively consistent with third quarter growth rates on both a year-over-year and three-year CAGR basis at the total company level. Now let's dig into some of the dynamics by ecosystem.\n\nFor Cash App, we expect the year-over-year gross profit growth rate to improve in the fourth quarter compared to the third quarter. We saw this play out in October, where we estimate Cash App gross profit growth, excluding our BNPL platform, improved on a year-over-year basis compared to 37% in the third quarter. On a three-year CAGR basis, we expect to see a slight decrease in Cash App's gross profit growth in the fourth quarter relative to the third quarter as we lap the launch of tabs in 2019. Cash App's gross profit growth in October was driven by growth in actives and monetization rate, while inflows per active was relatively consistent on a year-over-year basis.\n\nCash App card continued to have strong momentum on active and spend per active, which both increased on a year-over-year basis. For Square, we expect the year-over-year growth rate for gross profit, excluding our BNPL platform, to moderate in the fourth quarter compared to the third quarter. Given we are now lapping $59 million of nonrecurring PPP gross profit recognized in the fourth quarter of 2021. Excluding PPP and our BNPL platform, we expect year-over-year gross profit growth for Square in the fourth quarter to be relatively consistent with the third quarter, which had a 19% year-over-year growth rate with the same exclusions.\n\nOn a three-year CAGR basis, we expect gross profit growth, excluding our BNPL platform, to decrease slightly in the fourth quarter relative to the third quarter. Looking at recent volume trends, we estimate Square GPV in October was up 16% year-over-year, compared to 20% growth in the third quarter, and on a constant currency basis, 19% year-over-year as compared to 22% in the third quarter. Trends on a three-year CAGR basis were more stable as we estimate GPV grew by 21% in October compared to 22% in the third quarter. By region, growth in the U.S.\n\nremains relatively stable through October. However, we've seen a meaningful slowdown in year-over-year GPV growth in our international markets, primarily driven by foreign exchange rates and, to a lesser extent, the ongoing macro-related slowdown in the U.K. In October, we estimate that international GPV was up 23% year-over-year or 44% on a constant currency basis. Moving to our planned investments for the fourth quarter of 2022.\n\nWhile our business trends have remained stable through October, we have been increasingly focused on our spend amid an uncertain macro environment. We plan to reduce our investments for the full year 2022 by an additional $140 million, which brings the total pullback on our planned non-GAAP operating expenses on the year to $590 million or approximately 25% of our expected step-up entering the year. For the fourth quarter, we expect to increase non-GAAP operating expenses by $206 million compared to the third quarter. Looking ahead to 2023, we are still in the process of finalizing our plans for next year.\n\nAnd while we aren't quite ready to share specifics, we wanted to give you a sense of how we are thinking about next year. Over the past several years, we've significantly grown our business and our expense base. Looking to 2023, we're focused on operating more efficiently, and we expect a slower pace of expense growth meaningfully compared to prior years.  Based on our preliminary plans, our outlook includes a slowdown across several areas of our discretionary expenses, a continuation of the discipline we've seen from us in recent quarters, in particular, two areas to underscore: first, hiring. Headcount makes us the largest driver of our expense base.\n\nIn 2023, we expect to significantly moderate our pace of hiring compared to recent years, which will benefit our financial results on a lag, with greater leverage on headcount costs expected in the back half of 2023 and into 2024. Second, sales and marketing. In 2023, we intend on pulling back on lower ROI, more experimental areas, including brand and awareness spend across both our Square and Cash App ecosystems, and continue investing in channels with more proven ROI. Outside of these, one-third of our non-GAAP operating expenses include variable expenses, which has historically grown more in line with overall gross profit, including transaction and loan losses, peer-to-peer costs, Cash App card issuance costs, and expenses related to data and our platform infrastructure.\n\nWe continue to see a compelling opportunity for long-term growth, and we're prepared to be dynamic with our spend as we see the macro environment play out, both investing more when we see returns and pulling back with lower or uncertain returns as we've done in the past. We'll look to share more on our approach for the coming year in our fourth quarter earnings call in February. Ultimately, we remain focused on balancing growth and profitability in this environment. We want to operate with efficiency and agility in 2023 and beyond, with an increasing focus on not only top-line growth, but also profitability across both adjusted EBITDA and profit metrics that factor in stock-based compensation, where we intend on driving leverage over time.\n\nTo conclude, as we enter an uncertain macro environment, our agility means we can track our business trends in real-time across a diverse set of products and customers and make strategic decisions quickly to support our customers and adapt to the changes we observed. With that, we'll open it up to your questions.\n\nOperator\n\n[Operator instructions]. Your first question comes from the line of Tien-Tsin Huang with JPMorgan. Your line is open.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nThank you. It's nice to see the strong revenue, gross profit, and EBITDA here. So just wanted to build on what you just talked about there. I'm just thinking ahead, I know you're not going to give too much specific guidance for fiscal '23 but is it reasonable to expect that Block is now in a position to show some operating leverage in '23, given the less certain macro and you've invested quite a bit.\n\nIt looks like you're getting good returns since the bottom of the pandemic here. But can we get back to operating leverage when we get back to '23? Thank you.\n\nAmrita Ahuja -- Chief Financial Officer\n\nThanks for the question, Tien-Tsin. We are focused on driving long-term profitable growth at scale. And what that means for us is that we're going to balance growth and margins in our investment framework. As you note, given the significant growth of our business, we've grown our investments over the past few years to create products and marketing engines that help us drive that top-line growth paired with profitable unit economics across both of our ecosystems.\n\nOur preliminary 2023 plans really significantly moderate those expense -- that expense growth as we focus on balancing growth and profitability. Longer term, we do -- we will continue to moderate that expense growth to drive increased operating efficiency, profitability. And specifically for Cash App, we do expect to see operating leverage next year. We'll have more to say in February, of course, as we're still in our planning stages across the business.\n\nOur focus ultimately is on agility. As the environment continues to evolve here, we want to remain agile and be able to adapt to what we're seeing. And we intend on maintaining the discipline that you've seen so far this year with the pullback in discretionary, operating expenses, particularly in those areas that are less efficient or conversely lean into areas where we are seeing attractive returns and that enable us to grow our business in a profitable way over time. We've proven that ability to kind of dial back expenses in real-time.\n\nSo far this year, we pulled back almost $600 million, about 10% of our planned opex space or 25% of the step-up where we haven't seen returns or where the returns are less certain in order to deliver more near-term profitability. That gives us confidence in our ability to continue to invest and help us determine how much is needed to drive that next incremental dollar of growth and where we should be prioritizing our investment over time.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thanks [Inaudible].\n\nOperator\n\nYour next question is from the line of Lisa Ellis with MoffettNathanson. Your line is open.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nThanks for taking my question. I just wanted to follow up that call out in your shareholder letter in the prepared remarks about the 18 million monthly Cash App card users. You now have 35% of total monthly active. Can you elaborate a bit on the nature of the cash card users? So for example, do you have a sense for how many cash card users you now have using the cash card as their primary debit card.\n\nOr like are these banks consumers? Or is this their primary bank accounts? And what steps are you taking to kind of keep building out the wallet share of those cash card users? I think you had highlighted that Investor Day, they drive something like five times as much gross profit as a non-cash card user. Thank you.\n\nAmrita Ahuja -- Chief Financial Officer\n\nLisa, thanks for the question. I can kick off here. Driving product adoption for us across our banking products is one of our primary focus areas within our Cash App pillar around financial services. And we've experienced strong attach rates here.\n\nThese financial services products allow us to really deepen our relationship with our customers beyond just peer-to-peer and serve them more holistically related to their finances. So specifically for Cash App card, as you know, 18 million monthly actives in September, growing 20% -- or sorry, growing strongly and then now growing in terms of attach at 35% of our monthly actives during the month. And also, with strong engagement in September, Cash App card actives made 16 purchases during the month on average. So we're seeing our customers using their card on average every other day.\n\nAnd really with broad-based utilities, with customers spending across a diverse range of use cases, gas and utilities, restaurants and grocery, various retailers, and with a spend that's increased over time on a per-user basis. So in the third quarter, spend per active grew on a year-over-year basis, bringing -- as we see our customers bringing more of their spend to Cash App card. And as Jack noted, Cash App card customers accounted for about half of overall inflows in the Cash App, to your point about the importance of this customer base to our ecosystem. And these customers have also significantly higher monetization rate, compounding together as they bring more inflows and a higher monetization rate to drive even greater gross profit from this Cash App card customer cohort.\n\nMaybe the final thing that I'd say here is that Cash App card is an important way for us to bring Cash App to greater top of mind from a financial services perspective, certainly top of wallet for our customers, bigger part of the core offering as we graduate our customers from peer to peer into the ease of use of our financial services products. And we see that really resonating with younger demographics, but also as a way to drive greater adoption into other banking products like direct deposit, where we've now eliminated the friction of allowing customers to create a direct deposit account at the moment, they sign up for Cash App card and which has -- though it's still early days, has meaningfully increased the adoption of direct deposit as well for us. So it's important in and of itself, but also important as the gateway to adopting other banking products within Cash App.\n\nJack Dorsey -- Chief Executive Officer and Chairman\n\nI'll just say to your question, we don't have the data on whether we're primarily against other cards or other banks, but that is certainly our goal. And I think we have a better strategy over the long term in that we are not just a card, we are not just savings or other features that we offer, including the discover tab to find commerce, equine, stocks, deposits, people, peer-to-peer, obviously, which is the easiest way to send money to anyone. People come in for various different reasons, and they will find our other services -- and ideally, those services resonate even more. And our goal at first is to be first consideration for any one of these services, including the Cash App card.\n\nBut over time, we want to work toward being primary because everything that you need in your financial life, you can find within Cash App. So that is the goal. That's what we're focused on, and I think we have the best strategy to get there.\n\nOperator\n\nWe have Ali Kenis, Square seller, dialing in to ask a question. Please go ahead, your line is open.\n\nAli Kenis -- Square Seller\n\nHi, Jack. Thanks so much for taking my question. My name is Ali, and I own Sugar Lab Bake Shop in Ventura, California. We've been using Square to run operations at Sugar Lab for the last 10 years, which is as long as we've been in business.\n\nWe've grown to over 45 employees over the years, not currently, but we do use several Square software and hardware products, including stand, point-of-sale marketing, loyalty, savings, payroll, and more, pretty much everything. And then I'm also a Square super seller. So my question is, as the tight labor market continues in the food industry, we have fewer bakers and kitchen staff this year. How can Square help us prepare to handle the seasonal rush? And what are ways in which I can attract talent in time for the holidays, especially given that we're competing with larger businesses?\n\nJack Dorsey -- Chief Executive Officer and Chairman\n\nThank you. Congrats on your business. I think the biggest thing here is anything that we can do from a technology perspective to give you time back. First and foremost, to make sure that you're not wasting a bunch of time hooking up different systems and billing with interface, that all the solutions we provide are intuitive and they get easier and easier and potentially even more automated, so that you can focus more on what you have and doing a whole lot more with less.\n\nSo that is the first part. And we're focused a lot on that internally, but there are also products that will take some of the workload off you such as self-serve ordering and Square payrolls on-demand pay. And also making it much more efficient for your employees. So our team management product, I don't know if you've used that yet.\n\nWe focused a lot of energy on making sure that the team and the employees, and you have 45 Sugar Lab in a state where it could be quite useful, that they have all the information they need to help you operate and run the business very efficiently. All of these things that we're doing today, we're going to continue to improve with more automation, more artificial intelligence that you can turn on and off, and really make informed decisions around how you run your business. And as you continue to grow your business, it becomes more and more attractive to more people. So by focusing on your customers and making sure that you have your time focused entirely on that instead of all the operational capacities or needs of your business, which is where we come in, your business gets more successful, and more people want to join.\n\nSo thank you for using Square and we'll keep at it.\n\nOperator\n\nYour next question comes from the line of Darrin Peller with Wolfe Research. Your line is open.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, guys. Thanks. Look, just following up a little more on Cash App. The combination of monthly active user strength continues as well as the gross profit.\n\nIt looks like attach rates, the card was a key part. But if you could just remind us on what you see as the real opportunity there in terms of attach rates on different products? And what really what the path is for ARPU when layering in, not only what you've already done on the sort of the financial-services side, but also what kind of opportunity pay with cash can be and how the progress is going there, too?\n\nAmrita Ahuja -- Chief Financial Officer\n\nDarrin, thanks for the question. So let me start with kind of where we are in terms of ARPU, which is another metric you can measure along with the overall inflows framework, and then talk about where some of our product priorities sit, based on where we're driving key elements of the inflow framework forward. So from an ARPU perspective, gross profit per active, excluding the BNPL platform, was $57 in the third quarter, up from $53 in the second and $50 in the first quarter. So we are continuing to see growth there, in part driven by our monetization rate and part driven by the increased utilization of the platform, strong engagement on the Cash App platform.\n\nIf you break that down across our inflows framework, what we look at is active where we've continued to see strong growth; inflows per active, which we've seen continued stability despite now lapping some of the significant government disbursements and even some of the seasonal tax benefits from the first half of this year; and then monetization rate, where, as I said, we have some products where we can flex our pricing and some products where we are driving engagement and driving utilization. That inflows framework is really clarifying for us in terms of our product roadmap and where we see the traction across each of those variables. And so these three top product development pillars that I'd call out are financial services, network growth, and trust in terms of being able to continue to drive the Cash App platform forward. From a financial services perspective, as you've noted, we've seen growing adoption here, and that's a key top priority for us into 2023 to see continued adoption of these products across not only Cash App card and direct deposit, where there's a lot more for us to do there.\n\nStrong traction but continued runway ahead, but also through some of the newer products that are continuing to take hold like Cash App pay, as you noted, where we see 60% of Cash App pay volumes are now from customers who aren't active in Cash App card, showing that strong brand affinity for our products beyond even a strong attach product like Cash App card. And also for products like Cash App borrow, which we're still in the early days of ramping and where we've seen strong growth with profitable unit economics. From a network growth perspective, our priorities here is using our core differentiator, which is the network effects inherent in Cash App to really bring customer engagement out and enable our customers to engage more with their network and with each other, including bringing others from their network into Cash App.  And then from a trust perspective, we've evolved relatively quickly from a peer-to-peer app into a financial services app, and trust in our platform is extremely important as customers bring more of their money into the app. And so that's another key focus for us as we drive our inflows framework forward, and ultimately, as we drive ARPU forward as well.\n\nOperator\n\nYour next question is from the line of Timothy Chiodo with Credit Suisse. Your line is open.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nGreat. Thank you for taking the question. I want to talk a little bit about Cash App customer acquisition costs. So taking this back actually to a comment that you made last quarter.\n\nYou mentioned that CAC was relatively stable versus 2021, which was, at the time, you had mentioned the $10 blended CAC number. So we were a little bit surprised to hear that simply because you've been moving more toward building density with higher-income customers and making the direct deposit push. And we would have expected that to maybe come up a little bit. If you could just talk about what some of the offsets have been, how you've been able to contain those customer acquisition costs.\n\nClearly, the peer-to-peer network is a part of it, but maybe some of the other drivers, Boost, Afterpay? And then broadly, to the extent you can, if you could give us an update on gross adds and churn trends for the Cash App base overall?\n\nAmrita Ahuja -- Chief Financial Officer\n\nTim, I can kick us off here. Thanks for the question. We've continued to see relative efficiency in terms of our sales and marketing spend here with the cost of acquisition for net new actives in line -- continue to be in line with what we saw in 2021, as you noted in that $10 sort of customer acquisition cost range. We are looking to drive new demographics.\n\nWe are looking to drive higher product adoption at the start with our new customers, and we are looking to bring in higher lifetime value customers. We're seeing some of that play out now in some of the trends that you've seen today, including across the financial services offerings, Cash App card, and some of those core offerings that have become a bigger part of our product adoption earlier on in the customers' life cycle. We're pairing that with being disciplined in our spend. We're focused on the channels that we have the most confidence in and in driving the greatest returns and are prepared to be flexible on that moving forward.\n\nUltimately, we think there's a tremendous opportunity from an actives perspective to continue our growth here. If you think about digital natives, Gen Z, millennial customers, though they make up a significant portion of Cash App customers, we are still only penetrated into 20% of Gen Z, millennial customers as of the U.S. population as we shared at our Investor Day in March. This is the fastest-growing demographic for us and monthly actives over the past few years, but there's still much more we can do here to bring the other 80% in the Cash App over time, too.\n\nOperator\n\nYour next question is from Michael Ng with Goldman Sachs. Your line is open.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nGreat. Thank you very much for the question. I was just wondering if you could expand on the inflow strategy for Cash App. It was really encouraging to hear the stable inflows per active despite the tough comps and I believe the year-over-year declines in July.\n\nSo could you talk a little bit about things on the roadmap to drive inflows and direct deposit actives for next year, for instance? Are there any meaningful improvements to drive engagement on Cash App taxes for next spring? And then as a quick follow-up, I was just wondering if you could update us on the direct deposit monthly actives number. I think that was one and a half at the beginning of the year. Thank you.\n\nAmrita Ahuja -- Chief Financial Officer\n\nSure. I'm happy to get started maybe with framing up our inflows framework, and then we'll dive into some of the greater detail on direct deposit. So the inflows framework, again, active -- inflows per active monetization rate. You can think of the key drivers of inflows per active being the spending power of our customers and then our share of wallet of our customers.\n\nAnd so there's sort of two variables for us to think about there, both in terms of the customers that make up the mix of customers on our platform and then our ability to engage those customers across our products. What we've seen in the third quarter at continued stability in inflows per active at over $1,000, but growth on a three-year CAGR basis at 17%, which we've seen for most of this year as that growth in the mid-teens is really encouraging healthy trends across our Cash App customer base, even as we move past those periods of stimulus and tax refunds. We think ultimately, there's so much more room to grow, this inflows per active number by having multiple inflow channels, and cross selling more of our products to our customers, specifically the financial services products like Cash App card and direct deposit. And with direct deposit, as we noted $2 billion in September of direct deposit volumes, those volumes grew by more than 65% year-over-year in September as we've begun to reduce the friction on account creation after customers sign up for their Cash App card.\n\nSo this is a key focus for us as we continue with our strategy of enabling our banking products to our customers. Cash App card's a big part of it, direct deposit another key part of it. And as a result, direct deposit plus paper money deposit, which is another info channel we've opened up growing as a share of total inflows, making up more than 14% of inflows in September versus 9% a year ago.\n\nJack Dorsey -- Chief Executive Officer and Chairman\n\nAnd in terms of -- sorry. Sorry, I just wanted to follow up there. In terms of the road map ahead, a lot of what you saw with what we did over the past year was the navigation is meant to exactly bring more of this to life so that it's even more accessible and easier to find how to turn on direct deposit, for instance. If you get a Cash App card now, you instantly have a direct deposit number.\n\nSo there's a number of things we can do to optimize for what we're doing in the interface itself. So that people are more aware that we have this offering in the first place. And we will continue to add features and products that also coexist with existing ones that people are using. We have to keep in mind that a lot of people in catch-up start with this very simple -- I receive money from a friend or a family member or I want to send money to a friend or family member.\n\nAnd then it's our opportunity to really showcase everything else we have to offer including the Cash App card, including direct deposit, including Cash App taxes. And the easier we make that and the more tips we add in the interface, the more compelling the outcome we will have.\n\nOperator\n\nYour next question comes from the line of Rayna Kumar with UBS. Your line is open.\n\nRayna Kumar -- UBS -- Analyst\n\nGood afternoon. Thanks for taking my question. I'm curious to understand the progress you've made in combining two powerful ecosystems, Cash App pay, and Afterpay. How has organic growth of Cash App pay trended? And what are the next steps for a full integration here?\n\nJack Dorsey -- Chief Executive Officer and Chairman\n\nYes. So our big focus here is on commerce. And linking our two ecosystems through Afterpay is the most compelling option that we found in the market. We believe that this is a perfect blend of everything that we can offer to sellers, including a way for them to drive more sales and also new discovery and new opportunities for customers, which also helps them discover Square merchants and merchants all around the world, especially when you consider online commerce and digital commerce.\n\nSo our long-term vision is to build a more dynamic checkout experience, which enables a much more fluid checkout than what you see today. We recently introduced the discover tab in the Cash App. See this as a complete start. Our goal here was to introduce people to the concept.\n\nWe're not there yet with the experience. Think of this as more of a search engine that we're trying to optimize and iterate super-fast on to make sure that when people go there, they're looking for something or we can display relevant content based on their location. And it gets more and more efficient, more effective, and ultimately leads to a purchase. So that is our goal.\n\nWe're just starting a lot of that work right now. And we intend to make it a place that is instantly relevant over time. And this will take some time, but this is -- this will really unlock a lot of what we hope to unlock in both the Cash App ecosystem and the Square ecosystem and be beneficial to our Square sellers but also more broadly for the Cash App customers as well.\n\nOperator\n\nYour next question is from Trevor Williams with Jefferies. Your line is open.\n\nTrevor Williams -- Jefferies -- Analyst\n\nGreat. Thanks. Good afternoon. I wanted to ask a follow-up on margins, particularly in seller or Square just with more of the growth there coming from larger merchants and then international, which I think both are higher CAC.\n\nHow should we think of the growth versus margin trade-off there if there is one? Is there still more that you need to do to invest behind either of those markets, whether it's the force or brand marketing? Just trying to get ultimately what you expect the margin impact to be over time as the mix continues to skew more toward international and larger sellers. Thanks so much.\n\nAmrita Ahuja -- Chief Financial Officer\n\nTrevor, I can kick off here. So look, our Square business is a fairly high structural margin business as we shared at Investor Day at a 69% structural margin in 2021. So you can think of a significant portion of every dollar of top-line growth drops down to profitability. Where we are orienting our priorities is where we are seeing the strongest returns in terms of our growth, whether it's omnichannel products, moving upmarket with larger sellers.\n\nOur mid-market sellers are now 40% of our GPV growing at 22% year-over-year. And international, which also growing 40%. And some of the key products that underpin growth with larger sellers like vertical points of sale growing at 45% year-over-year. So each of those strategic priorities for our Square business that we're investing behind are driving stronger growth than the overall base.\n\nNow we expect in 2023 to moderate the pace of some of our investments across sales and marketing and product development in order to continue that balance, that growth and profitability as we spoke about earlier, whether it's across hiring, sales, and marketing, where we would be pulling back on some of that brand marketing and have a stable to increasing mix of our investments on things like sales teams, as we focus on optimization, and as we focus on building with our upmarket sellers, bringing more of those larger sellers onto our platform as well as our product development investments where we are really expanding the reach of our platform and the cohesiveness of our platform so we can take the work of our sellers' plates and focus on some of the key products that are truly resonating. As you hear today, the vertical solutions, the developer platform our omnichannel software. So those are some of the key focus areas for us. Of course, we want to remain agile with our spend and be responsive to what we see in a potentially changing macro environment.\n\nBut we are seeing traction in the areas where we are most strategically oriented.\n\nOperator\n\nYour next question is from the line of Josh Beck with KeyBanc. Your line is open.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThanks for taking the question. I have actually a follow-up along those lines as well for the Square seller business. Obviously, you made a pretty substantial investment last year in outbound sales. You've obviously had more time to see the payback and obviously blend that with the other go-to-market strategies.\n\nSo as you look forward to '23 based on kind of the lessons that you've learned how important is that outbound motion within the Square good market?\n\nAmrita Ahuja -- Chief Financial Officer\n\nJosh, happy to double-click on this and maybe I'll address more broadly our go-to-market approach for the Square business. So our focus, maintaining target paybacks of about a six-quarter payback and target returns of about 3x ROI as we evolve our go-to-market strategy to support the growth up-market. Throughout 2022, we've pulled back on some of the lower ROI areas and recalibrated our spending mix to the channels with more proven ROI. So what does that look like across each of the areas? From a sales perspective, we're focused on optimizing our sales channel, which was more predictable returns and where we have the ability to measure performance.\n\nWe believe our sales team, it will ultimately be a long-term core engine of growth for the business. And there's kind of three key strategies for enhancing our growth upmarket using our sales team. One is the verticalization of the team, so creating pods around specific verticals, retail, restaurant services, where you see we're gaining traction with our vertical points of sale today to enable those account executives to go deeper and the needs that are specific to each of those verticals. Second, expanding our outbound sourcing capabilities so that we can reach out and make sure that these larger sellers have a better understanding of all the many things that Square can do for them today.\n\nAnd then third, introducing more automation into our tooling to enable our sales team to have better information as they're reaching out to these sellers, which ultimately then can help drive greater efficiency. From an international perspective, our foremost tenured international markets are pacing at these healthy payback periods that we're targeting. Our three more recently launched markets in the last 18 months do have longer payback periods, whether we're looking at it in marketing or sales, as we're introducing our ecosystem into those markets and building our awareness. From a performance marketing perspective, this is really the core engine, which continues to drive stable proven returns and historically has been a significant driver of acquisition.\n\nSo that's really giving you an orientation of our overall go-to-market efforts, sales is a key piece of that.\n\nOperator\n\nYour next question is from Ramsey El-Assal with Barclays. Your line is open.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thank you so much for taking my question tonight. I wanted to ask about vertical solutions and whether there is a long-term road map to expand the number of verticals that you support. And then separately, I just wanted to ask Amrita about the potential to maybe more actively leverage the customer account balances to drive more float income.\n\nIt looks like you guys used to keep more cash, more funds in the money market versus sitting in cash. I'm just curious if that's something that we could see more of in the future to drive some interest income. Thanks.\n\nJack Dorsey -- Chief Executive Officer and Chairman\n\nSo yes, our three vertical point of sales right now and services are Square for restaurants, Square for retail and appointments. We're always looking for opportunities to, first and foremost, expand these and add more features, add more services to each one to continue to make sure that we're serving the need for the particular service but also looking for other opportunities for more vertical services. But first and foremost, it's making sure that we remain competitive and we're ahead in terms of our feature set and making sure that we're continuing to work to optimize these services for our customers. The other thing that we've talked about in the past on these calls is one trend we continue to see is that the vertical aspects of these things tend to blur a little bit.\n\nWe see restaurants adding retail-like services, and appointment-type businesses adding or merging with like restaurant-type services or retail as well. So the benefit of our ecosystem is we're not focused on just one. We're focused on all three, and more generally, how you operate a business, how you operate a team, and ensuring that we're giving you tools no matter what business you choose to be in to make a sale and make more sales ultimately. So that is our goal.\n\nEvery day, answering the question, how do we help sellers make more sales? In some cases, these vertical efforts make more sense. But the most compelling trend that we continue to see is the blending of all these things. And that's where our ecosystem mindset really shows the strength.\n\nAmrita Ahuja -- Chief Financial Officer\n\nAnd, Randy, just to follow up on your question on float or interest income, the majority of our cash in our customer funds is variable to interest rate fluctuations via a pretty diversified portfolio of accounts, the vast majority of which are relatively short term, which allows us to capitalize on increasing the yields. So in the third quarter, interest income increased as a result of, obviously, higher interest rates. And we expect to continue to benefit of some of -- as many of our investments lag on interest income pickup. Just to maybe break that down for you across our corporate balance sheet and customer funds, from a corporate balance sheet standpoint, interest income was $15 million in the third quarter.\n\nThat's up from $9 million in the second, $8 million in the first. Majority of our cash here is variable, as I said, to interest rate fluctuations either via fixed income, T-bills, government money market accounts or noninterest-bearing accounts that earn an earnings credit rate. And much of this interest income. This interest income flows through to the interest income and expense line, which is below the EBITDA line.\n\nFrom a customer fund standpoint, Cash App customer funds does generate interest income as well. We had 7 million in the third quarter, up from less than $1 million in each of the first and second quarters. Majority of these funds are invested in very short-term accounts or money market accounts, and they flow through Cash App revenue and gross profit line.\n\nOperator\n\nYour final question comes from the line of Andrew Jeffrey with Truist Securities. Your line is open.\n\nAndrew Jefrrey -- Truist Securities -- Analyst\n\nHi. Good afternoon. I appreciate you squeezing me in here toward the end. I wanted to ask about the Square business and the competitive environment.\n\nAnd how much of the growth is coming from competitive takeaways? Who are the companies that you generally see at the point of sale? How much is net new business creation? Just trying to get a sense of kind of the way the market's evolving competitively and how you think you're positioned.\n\nAmrita Ahuja -- Chief Financial Officer\n\nAndrew, maybe I can kick us off here. What we see is stability in our trend lines. It will depend on each product as to who our competitors are. We don't see a competitor out there who has the breadth that we have across our ecosystem.\n\nAnd really, it's that diversity of products, verticals, channels, and customer types that we have that we believe is the most resilient, particularly as we may be entering a volatile time from a macro perspective. So what we saw in the Square ecosystem through October was relative stability from Q3 in October or into Q4, with GPV through October in the U.S., in particular for some of those discretionary verticals, which we're paying particularly close attention to, retail, restaurant, services, on a three-year CAGR basis with stability. Now of course, from an international perspective, we don't see this as a necessarily competitive issue. But from an FX perspective, we're seeing some headwinds there as are many other companies.\n\nAnd from a macro perspective, as we noted in the U.K. But more broadly, when you look at the Square ecosystem ex PPP, as we noted, which is a nonrecurring benefit in Q4, and ex BNPL, we see stable rates of year-over-year growth in Square gross profit from Q3 into Q4. And again, from a competitive perspective, we believe we're fairly differentiated, given the diversity of customer types and product types that we serve.\n\nJack Dorsey -- Chief Executive Officer and Chairman\n\nYes. I would say that generally, there are certain areas across our verticals or across some of our products where we're behind competition and somewhere we're ahead. But on the net, I think, as Amrita said, we're much further ahead over the long term because of that ecosystem mindset and because of the breadth of the tools that we offer and, most importantly, how easily they integrate together. It's literally a button push to turn things on or off, and that includes a wide array of services from lending to customer relationship management to vertical points of sale to hardware.\n\nSo this is where I think things really matter is a business no longer has to go vendor to vendor to vendor, but they can come to one place. They can come to Square, and they see pretty much everything they need. It does mean that we are going to be slightly slower in rolling out all the features for each one particular vertical, but it also balances that with a much higher quality of integration, which ultimately ends up taking a whole ton of -- it gives a whole ton of time back to the seller so that we see much, much better retention than a lot of our peers.\n\nOperator\n\nAt this time, I'd like to turn the call back to the company for closing remarks.\n\nNikhil Dixit -- Head of Investor Relations\n\nThank you for joining. That concludes our call. We will see you for our fourth quarter 2022 earnings call on February 23. You can now disconnect.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNikhil Dixit -- Head of Investor Relations\n\nJack Dorsey -- Chief Executive Officer and Chairman\n\nAmrita Ahuja -- Chief Financial Officer\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nAli Kenis -- Square Seller\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nRayna Kumar -- UBS -- Analyst\n\nTrevor Williams -- Jefferies -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nAndrew Jefrrey -- Truist Securities -- Analyst\n\nMore SQ analysis\n\nAll earnings call transcripts"
}