{
  "companyName": "JetBlue Airways",
  "companyTicker": "JBLU",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/jetblue-airways-jblu-q3-2022-earnings-call-transcr/",
  "content": "JetBlue Airways (JBLU 0.47%)\nQ3 2022 Earnings Call\nOct 25, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. My name is Anthony. I would like to welcome everyone to the JetBlue Airways third quarter 2022 earnings conference call. As a reminder, today's call is being recorded.\n\n[Operator instructions]. I would now like to turn the call over to JetBlue's director of investor relations, Jose Caiado. Please go ahead.\n\nJose Caiado -- Director, Investor Relations\n\nThanks, Anthony. Good morning, everyone, and thanks for joining us for our third quarter 2022 earnings call. This morning, we issued our earnings release and a presentation that we'll reference during this call. All of those documents are available on our website at investor.jetblue.com and have been filed with the SEC.\n\nIn New York to discuss our results are Robin Hayes, our chief executive officer, Joanna Geraghty, our president and chief operating officer, Ursula Hurley, our chief financial officer, and also joining us for Q&A are Dave Clark, head of revenue and planning, and Andres Barry, president of JetBlue Travel Products. This morning's call includes forward-looking statements about future events. All such forward-looking statements are subject to certain risks and uncertainties, and actual results may differ materially. Please refer to our most recent earnings release and our recent Form 10-Q or 10-K for a more detailed discussion of the factors that could cause the actual results to differ materially from those contained in our forward-looking statements.\n\nIncluding, among others, the COVID-19 pandemic, fuel availability and pricing, the outcome of the lawsuit filed by the DOJ related to our Northeast alliance, the occurrence of any circumstances that could give rise to the right of JetBlue or Spirit Airlines or both to terminate the merger agreement, failure to obtain applicable regulatory approval in a timely manner or otherwise and the potential financial consequences thereof, failure to satisfy other closing conditions or a failure of the parties to consummate the transaction and the possibility that JetBlue may be unable to achieve expected synergies and operating efficiencies within the expected timeframes or at all and to successfully integrate Spirit's operations with those of JetBlue. The statements made during this call are made only as of the date of the call, and we undertake no obligation to update the information. Investors should not place undue reliance on these forward-looking statements. Also during the course of our call, we may discuss several non-GAAP financial measures.\n\nFor a reconciliation of these non-GAAP measures to GAAP measures, please refer to the tables at the end of our earnings release, a copy of which is available on our website. And now I'd like to turn the call over to Robin Hayes, JetBlue's CEO.\n\nRobin Hayes -- Chief Executive Officer\n\nThanks, Joe. Good morning, everyone, and thank you for joining us today. Our thoughts are with all of those affected by the recent hurricanes in the Southeast and the Caribbean, including many of our crew members, customers and their loved ones. As always, supporting our crew members and the communities is a top priority after devastating events like these, and we know it's going to be a long road to recovery for several impacted regions.\n\nJetBlue is working with non-profit partners such as World Central Kitchen, to ship supplies and assist with relief efforts. And alongside our JetBlue Crewmember Crisis Fund, we're working to provide support for our crew members who were hardest hit, and we're going to stay with them every step of the way. I'd like to thank our more than 24,000 crew members for their dedication, patience and service. I am always amazed at how our crew members step up in these challenging times to care for each other and the communities we serve, prioritizing safety above all else.\n\nOur crew members also helped deliver another record quarter of revenue, resulting in our first quarterly profit since the start of the pandemic. Despite the macroeconomic uncertainty, we are building momentum in the second half of the year, and I'm confident that we're on a path to continue increasing our margins as we bring our low fare, award-winning JetBlue experience to more customers. Let's now turn to our quarterly results on slide four of the deck. For the third quarter, we reported an adjusted pre-tax income of $118 million, adjusted pre-tax margin of 4.6% and an adjusted earnings per share of $0.21.\n\nThe changes we made earlier this year to enhance operational resourcing and the resilience of our schedule resulted in strong operational performance over the summer peak despite significant weather and air traffic control challenges and record customer demand. We've made excellent strides on hiring, and we're now at a point where we believe we are appropriately resourced from a staffing perspective, which in turn should translate to improved productivity. Looking ahead, we expect our momentum to continue through to another solid quarter of mid-single-digit pre-tax margins in the fourth quarter. We'll look to build margins further in 2023 as we continue to restore our pre-pandemic earnings power.\n\nWe continue to see a very healthy revenue environment with no signs of slowing demand for air travel. Moving now to slide five. Our teams are diligently working on the strategic initiatives driving our earnings recovery and enhancing our business for the long term. We're fortifying our unique business model to more effectively compete within trenched Big Four carriers and deliver significant consumer benefits as we continue to disrupt the market.\n\nIt starts with our network. Our Northeast Alliance, which has been up and running for more than a year and a half years is fundamentally about growing capacity in consumer choice, and it has promoted competition in both New York and Boston. By all measures, JetBlue and American are delivering substantial consumer benefits with the launch of dozens of new routes, increased frequencies on over 100 additional routes and improved schedule offering and reciprocal frequent flyer benefits for our customers. Again, this growth would not be possible without the NEA, and consumers are further benefiting from the clear, competitive response that we have stimulated.\n\nThe NEA is doing what it set out to do, giving consumers more choice and better value. And we look forward to continuing to expand these benefits. Outside of the NEA, I'm extremely pleased with the recent Spirit shareholder approval for our combination, which will create value for all of our stakeholders. Together, we'll build a low fare challenger to the dominant Big Four airlines on a national scale and expand our compelling combination of award-winning service and low fares to more customers across more destinations.\n\nOn the transatlantic front, by the end of this week, we'll offer five daily flights between the Northeast and London. And we look forward to taking delivery of a handful of Airbus 321LR aircraft next year to support our expansion to Europe, notwithstanding some modest delivery delays. Stay tuned for an announcement in the near future. Customer engagement with JetBlue remains at record levels, and we continue to see healthy spend on our co-branded credit cards.\n\nOur loyalty program is producing record cash flows, which is a testament to our customer value proposition. Separately, our JetBlue Travel Product subsidiary continues to innovate with the launch of Troupe, a free group planning app to help groups decide when to travel, where to go and what to do, building on efforts to make the travel experience more seamless. JetBlue Travel Products is on track to generate close to $100 million of EBIT this year compared to $15 million in 2019. We also continue to make great progress on the structural cost program we announced last quarter, which Ursula will discuss shortly in more detail.\n\nWe made further progress on the ESG front, with an agreement to purchase 25 million gallons of sustainable aviation fuel starting in 2027 from Air Company, one of the JetBlue Ventures investments. We're committed to growing and diversifying our SAF supply as we progress toward our goal of converting 10% of our jet fuel usage to SAF by 2030. We also appalled the International Civil Aviation Organization, or ICAO, for endorsing a net zero by 2050 goal for international aviation emissions, an important milestone that US airlines had already voluntarily committed to. We expect this will continue to drive the investments in technological innovation needed to enable our industry to continue to grow sustainably.\n\nI'll close with another huge thank you to our crew members. Thank you for all of your hard work, your patience. We're building strong momentum, and I'm excited about the journey that lies ahead. With that, over to you, Joanna.\n\nJoanna Geraghty -- President and Chief Operating Officer\n\nThank you, Robin. I'd like to also add my thanks to our fantastic team for their dedication and delivering for our customers through a very challenging summer and the most recent hurricanes. I'm extremely proud of how they've stepped up to support each other and our impacted communities as we recover from the recent storms. Turning to capacity on slide seven.\n\nIn the third quarter of 2022, our capacity was down 0.5% year over three, compared with our most recent guidance for flat capacity. Hurricanes Fiona and Ian impacted our flown capacity by roughly 0.7% point. Throughout the quarter, our teams executed well, particularly in the context of significant ATC constraints, resulting in a strong completion factor. For the fourth quarter, we expect capacity to be up 1% to 4% year over three, a modest sequential step up versus the third quarter.\n\nFull year 2022 capacity growth is now expected to be up 0% to 2% year over three. Looking ahead, we expect the aviation ecosystem to continue to remain fragile, given supply chain challenges and ATC staffing headwinds. Therefore, we are maintaining a continued bias toward more conservative planning assumptions in the medium term, such as carrying higher levels of reserves versus 2019 to ensure that we are set up for operational success. During the third quarter, we expanded our transatlantic service with new daily service between Boston and London.\n\nAnd we plan to add a third frequency between JFK and London later this week. As we think about our growth plans for 2023, we expect to return to our historical growth rate of mid- to high single-digit growth year-over-year. As Robin mentioned, we will soon be announcing our next European destination as we build even more relevance in our largest Northeast-focused cities. And we also expect to grow our other focus cities as we take delivery of next-generation Airbus 220s and 321neo aircraft and replace our older E190s.\n\nTurning to slide eight. In the third quarter, we delivered the highest quarterly revenue result in JetBlue's history. Our revenue per available seat mile increased 23.4% year over three, at the high end of our original expectations. Hurricane Ian was a net neutral impact to our unit revenues in the third quarter as revenue was offset by reduced capacity.\n\nThroughout the quarter, we saw strong leisure and VFR demand trends. We were particularly pleased to see load factor in the off-peak month of September increase approximately three points above 2019 levels. We see these positive trends continuing here in the fourth quarter, and we are confident strong demand will continue through the upcoming holiday peaks. As a further proof point, ancillary revenue per customer grew over 50% year over three in the third quarter as our varied product offerings and low prices continue to resonate extremely well with our customers.\n\nFor the fourth quarter, we expect unit revenue to increase between 15% and 19% year over three. This includes a five-point impact from hurricanes Fiona and Ian, the placement of the holidays this year and tough loyalty comps. Our strong revenue performance continues to be bolstered by our commercial initiatives. We've unlocked immense consumer benefits through our Northeast Alliance, which is rooted in providing customers with more choice as a true third competitor in the Northeast.\n\nCrucially, we're growing supply in the Northeast with NEA growth well outpacing overall domestic industry capacity, launching new destinations, adding flights to others, enhancing our schedules and allowing our loyalty customers the ability to benefit from two different programs. In addition, we've seen the entrenched carriers respond by matching our new destinations, as well as expanding their own service, boosting competition in the region and benefiting consumers. The Northeast Alliance also enables JetBlue to provide another compelling option for business travelers, with the best network and schedules in the region. We were pleased to see business travel step up again post Labor Day following the typical summer lull in July and August and continue to recover toward pre-pandemic levels.\n\nOur contracted corporate revenue bookings are now roughly 90% recovered compared with roughly 80% at the end of the second quarter, aided by our Northeast Alliance, which is helping us capture a greater share of corporate customers in the Northeast, which is yet to be fully recovered. On the loyalty front, I'm pleased to see program engagement at record highs, as evidenced by spend growth persistently well above pre-pandemic levels. Last month, we hit a new record in co-brand acquisitions, and our portfolio of accounts is set to expand by over 25% year-over-year. As a testament to the outstanding traction we've made in closing the revenue gap to peers, loyalty revenue now represents roughly 10% of our total revenue compared to approximately 7% in 2019.\n\nAs I've said before, we are in the early innings of the multiyear evolution of our loyalty program, and we could not be more excited for its growth. Before closing, I would like to highlight that although we are seeing no indications of any type of drop-off in air travel demand, we are keeping a very close eye on the macroeconomic environment. As we look to 2023, we take comfort in the fact that the US economy is much larger than it was prior to the pandemic, while industry capacity is still below pre-pandemic levels, suggesting that our industry's experience with a potential 2023 economic downturn could look quite different than historical downturns. For JetBlue specifically, our business model has evolved significantly since the last downturn as we have built a more segmented strategy that appeals to a wide spectrum of customers.\n\nOur ancillary revenue base has also grown and proved stable even through the pandemic. And of course, capacity is the biggest lever we have. Thank you again to our crew members for all of the hard work during an exceptionally busy summer and for taking care of our customers and each other. Now, I'll turn the call over to you, Ursula.\n\nUrsula Hurley -- Chief Financial Officer\n\nThank you, Joanna. I'd also like to thank our incredible crew members for always stepping up to tackle the numerous challenges that arise in our industry and safely delivering the JetBlue experience for all our customers through it all. Despite all of the challenges from extreme weather events to external staffing pressures to record fuel prices, we've remained focused on what we can control, and we are taking action to forge a strong cost trajectory that supports our margin expansion and value creation over the long term. I'll start on slide 11 with a brief overview of our financial results for the quarter.\n\nRevenue per available seat mile was up 23.4% year over three. Cost per available seat mile was up 32.4% year over three. CASM, excluding fuel and special items, was up 16.3% year over three, and GAAP earnings per share was $0.18 and adjusted earnings per share was $0.21. I'm very proud of the team's execution in delivering a profitable third quarter, a very important milestone for us.\n\nWe exceeded our original revenue guidance, maintained CASM ex-fuel in line with our initial outlook despite the impact from hurricanes and continued pressure tied to ATC staffing challenges, and we delivered a solid pre-tax margin result in our first quarter of profitability since the pandemic. We've overcome many hurdles in our past, improved our operational performance, generated record revenue and laid plans to improve our cost trajectory. Looking ahead, we expect to build on our momentum and deliver another profitable quarter in Q4. Turning to slide 12.\n\nDuring the third quarter, CASM ex-fuel increased 16.3% versus 2019. The impact from the hurricanes was roughly one point to CASMx in the third quarter. In addition, we continue to build more resiliency into the operation, which pressured CASM. Separately, ongoing Spirit-related transaction expenses, combined with E190 fleet transition costs, were approximately $13 million in the third quarter, which we exclude from CASM ex-fuel.\n\nFor the fourth quarter, we are forecasting CASM ex-fuel to increase 8.5% to 10.5%. The year over three growth rate in CASM ex-fuel is improving by seven points sequentially from Q3 to Q4 or five points after adjusting for capacity as we peel back some of the operational investments from the summer while maintaining a conservative approach to planning as we enter 2023. We're also benefiting from early progress on our structural cost program and savings from early E190 retirements. We're tightening our full year 2022 CASM ex-fuel forecast to an increase of 13% to 14% year over three versus our prior guidance of an 11% to 14% increase.\n\nTurning to slide 13. Last quarter, we announced two initiatives designed to help us deliver a flattish unit cost trajectory. First, our structural cost program, which we expect to drive $150 million to $200 million of cost reductions through 2024. And secondly, the acceleration of our E190 retirements.\n\nToday, we're deep into our annual planning cycle. And as we look ahead to 2023, we remain committed to keeping our nonfuel unit cost flat or better year over year in support of our continued margin recovery. You'll recall that next year, we're facing several cost headwinds as we manage through the timing of a number of expensive heavy maintenance visits, as well as airport cost pressures related to upgrading to new terminals across our network. These major headwinds are in part what the new structural cost program was envisioned to help offset in addition to the three years of inflationary pressures currently in the cost base.\n\nWe're driving a strong sequential improvement in ex-fuel unit costs in the fourth quarter with some benefit from maintenance timing, but most importantly, due to the early returns we're seeing from our new structural cost program. Specifically, we're gaining traction with our enterprise planning effort, producing crew efficiencies and improvements in soft time without sacrificing operability and with our maintenance optimization initiative, as we work to minimize the investment in some of our older engines in our fleet. In addition, we're seeing savings from the accelerated retirement of our E190 fleet having already parked five of these aircraft to date. Turning to the balance sheet on Slide 14.\n\nIn the third quarter, we paid down $66 million of debt, funded $260 million in capital expenditures and paid a $25 million break fee related to the Spirit transaction. At the end of September, our adjusted debt to cap was 53%, and we closed the quarter with liquidity of $2.3 billion or 28% of 2019 revenue. This excludes our revolving credit facility, which we recently increased to $600 million, ensuring JetBlue has the flexibility to navigate in uncertain environments. Separately, we've also layered on fuel hedges for roughly 27% of our consumption for Q4 to protect against oil exceeding $100 a barrel.\n\nWe view these hedges as a form of insurance to help mitigate financial risk and we'll continue to monitor the market regularly to help derisk our earnings profile. Our full year 2022 capex forecast remains unchanged at approximately $1 billion. Looking ahead to 2023, we expect our capex to increase consistent with our order book as we work through renewing our fleet over the next several years. While we recognize that aircraft deliveries are a moving target given OEM production challenges and delays, we believe our mid- to high single-digit growth target next year is achievable based on what we know today.\n\nAs Robin mentioned, we're thrilled that Spirit shareholders overwhelmingly voted for our proposed transaction with Spirit last week, which triggered the prepayment of $272 million to Spirit shareholders here in the fourth quarter. We're making good progress on the regulatory front, and we expect to receive regulatory approval and close the transaction by the first half of 2024. Finally, our balance sheet today remains one of the strongest in the industry, enabling us to pursue the acquisition of Spirit to create a national low-fare challenger to the Big Four. Post-closing, we expect a very manageable leverage position, and we expect the enhanced pro forma earnings and cash flow generation to help us quickly delever again.\n\nTo close, I'd like to thank our teams once again for taking care of all of our stakeholders and for helping steer JetBlue toward sustained and growing profitability. With the game-changing moves we've made, including the Northeast Alliance, our evolving loyalty program, our new structural cost program and a planned combination with Spirit, I could not be more excited about our future. We are on the right path to transform our long-term earnings power and create value for all of our stakeholders. With that, we will now take your questions.\n\nOperator\n\n[Operator instructions]. Our first question will come from Savi Syth with Raymond James. You may now go ahead.\n\nSavi Syth -- Raymond James -- Analyst\n\nHey, good morning, everyone. Can I ask if you can provide an update on kind of the staffing levels here in 2022? And what you're seeing in terms of attrition? And maybe what your plans are for 2023, given it seems like you're taking maybe two to three times more aircraft in 2023 than you did this year?\n\nJoanna Geraghty -- President and Chief Operating Officer\n\nSavi, thanks for the question. It's Joanna. So in terms of overall staffing, we're pleased with the progress we've made. We're actually seeing, I think, some good normalization of staffing levels overall across most of our work groups.\n\nWe are also seeing attrition across most of our the -- most of our other work groups slow in the last several months, which is also fantastic. Maybe I'll do a double click on pilots because I think that's probably where folks want to hear us offer a view or two. So with regard to pilots, we have a very strong pipeline, but we continue to plan for elevated levels of pilot attrition and for excess reserves so that we can ensure we're protecting the operation during what we believe will continue to be a constrained ATC environment. For 2022, we're tracking to hire close to 1,000 pilots.\n\nThat number remains largely unchanged for 2023. That is inclusive of attrition. And then, obviously, we're in the midst of moving the 190 fleet out, so that also drives some incremental pilots as we transition fleets. So we think from an opportunity perspective on the cost side, this is where as ATC, hopefully, over the next year or so begins to normalize.\n\nAnd hopefully, as attrition begins to normalize, there'll be some opportunity here in terms of slowing that hiring pace. But again, we're on track to hire on the pilot front at least 1,000 for this year and into next.\n\nSavi Syth -- Raymond James -- Analyst\n\nThat's super helpful color, Joanna. And Ursula, maybe just on that, if I may follow up on your capex comment, will you able to provide a little more color on capex given I don't think there were as many deliveries this year as next year. So do you expect like a big step up? Or how should we think about the capex?\n\nUrsula Hurley -- Chief Financial Officer\n\nSure, Savi. As we're all well aware, the OEMs are struggling with challenges in terms of ramp-ups and manpower and supply chain. So we've been working hand-in-hand with Airbus on staying close to any delivery delays. As you've seen in our update today in regards to next year, contractually, we're supposed to take 29 deliveries.\n\nFrom a planning assumption perspective we're expecting 22. So in terms of capex, this year, we're expecting $1 billion. Next year, I think a logical assumption is we'll be anywhere between $1.5 billion and $2 billion. However, I think this is going to continue to remain fluid as we work with Airbus over the next 18 months or so in managing the delays.\n\nI also want to reiterate, even with the planning assumption, with the 22 aircraft, we still believe that we can achieve our mid- to high-single growth rate in 2023.\n\nSavi Syth -- Raymond James -- Analyst\n\nPerfect. Thank you.\n\nOperator\n\nOur next question will come from Scott Group with Wolfe Research. Go ahead.\n\nScott Group -- Wolfe Research -- Analyst\n\nHey, thanks. Good morning.So the TRASM guidance implies a pretty big drop on an absolute basis. Just any color there? Is that just seasonality? Are you seeing anything in terms of -- I know you said demand, you're not seeing any changes there, but anything with fares or cancellations? Just any color on the sequential drop in TRASM?\n\nJoanna Geraghty -- President and Chief Operating Officer\n\nThanks for the question. So maybe a little color. First and foremost, we're not seeing any cracks in underlying demand, extremely strong as we step into Q4 across all geographies, led by our VFR markets followed by Mint and transcon, all of which are performing very well. We're seeing both positive load factors and positive RASM as well in all of those and then obviously positive fare.\n\nSo we're really pleased with the underlying demand environment. What you're seeing from Q3 to Q4 are a few things. And I'll flip it to Dave to walk through the specifics. But you're seeing the December holiday shift, specifically with a shorter peak period for that Christmas holiday.\n\nYou're also seeing a modest impact from Hurricanes Fiona, Ian, on Puerto Rico, the DR and Florida. And then, you're seeing a comp issue with regard to loyalty. We had a very, very strong loyalty number in Q4 of 2019. So you're seeing a slight decrease there, but loyalty, as we noted in the script, remains extremely strong in absolute terms.\n\nSo there's a 5-point difference, Q3 to Q4. But other than that, the demand trends underlying all of that remain extremely strong, just these three items that are bit of a put and take. Dave, maybe you want to give a little color to the three?\n\nDavid Clark -- Head of Revenue Planning\n\nSure. And I think you covered it well. Demand very strong, just three transitory items here that are pushing a headwind of about five points for Q4, and they're all roughly the same size in terms of the magnitude. As you mentioned, loyalty, some choppiness from 2019.\n\nThere were some one-timers there in Q4 of 2019 and then just some ongoing choppiness in the sort of ongoing strength as we continue to build our loyalty, but extremely happy with how loyalty is performing. We continue to have very high growth both on a quarter-over-quarter basis and a year over three. So no concerns at all, just a hard comp in 2019. On the holiday placement, I think some other airlines have called this out as well with regards to the weekday placements with Christmas on a Sunday leads to an outbound about three days later than you've had in 2019 given school calendars in the Northeast, which is where the largest chunk of our customers originate from.\n\nAnd then, lastly, on the hurricanes, it was actually both Ian and Fiona. Obviously, Fort Myers was the most impacted from a revenue perspective, but we had the opportunity to redeploy some of that capacity for the Q4 peaks. And we did set some capacity for the troughs in Q4. And then, Puerto Rico and the Dominican Republic did have some lingering effects from Fiona, which passed in late September.\n\nThe volumes are completely back, but we have seen, especially in Puerto Rico, a lower fare trajectory than we're seeing before the hurricane. It's improving week on week, and Puerto Rico is fully open for business and a great experience for a tourist. So no concerns here. But we have seen that fair sort of creep back a little bit each week, but it's still about 10 and 20 points below where it was.\n\nSo all transitory items and no concern at all with the underlying demand.\n\nScott Group -- Wolfe Research -- Analyst\n\nOK. And just secondly, the fuel hedging, just the rationale on why you're starting it, is it just Q4 or is some of this -- are you hedging anything for '23 at this point?\n\nUrsula Hurley -- Chief Financial Officer\n\nThanks for the question, Scott. So we're constantly monitoring the market. Over the last 18 months or so, it's been pretty costly to enter the hedging market. And we saw a window of opportunity a few months back to layer in some hedges to protect against fuel volatility here in the fourth quarter.\n\nIt's something that we'll continue to monitor going forward. As a reminder, we view fuel hedging as insurance, and we utilize hedging to protect against extreme volatility in oil prices. So as we enter 2023, you can expect us to continue to monitor the market and potentially layer in future hedges.\n\nScott Group -- Wolfe Research -- Analyst\n\nBut at this point, is there anything for '23 hedged?\n\nUrsula Hurley -- Chief Financial Officer\n\nWe do not have any hedges for 2023 at this point.\n\nScott Group -- Wolfe Research -- Analyst\n\nThank you, guys. Appreciate it.\n\nOperator\n\nOur next question will come from Jamie Baker with J.P. Morgan. You may now go ahead.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nHey, good. Good morning, everybody. Sorry, if I missed this, I fell off the line. But when does your locked-in deal financing expire? I'm just trying to understand if there's a delay with the deal, at what point would you be exposed to current rates?\n\nUrsula Hurley -- Chief Financial Officer\n\nSo the bridge financing that we currently have in place has the current expiration of mid-2024. As a reminder, we're not currently drawn on the bridge. We are paying a small commitment fee for that bridge. And as you recall, when we receive regulatory approval, at that point in time, we will look at the potential takeout financing markets.\n\nAnd so, I remind everyone, the financing markets at that point in time could look very different compared to where we sit today.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nOK. That's helpful. And then, for 2023, ex-fuel CASM, flat or better, I assume there's no specific allowance in there for any movement on the pilot contract. If I just look at Alaska's fall 2023 rates, looks like it's about 12% higher than your current rates, recognizing that other deals may be struck between now and then?\n\nUrsula Hurley -- Chief Financial Officer\n\nSo our flat-to-better CASM ex-fuel guidance for next year for planning purposes, does not assume any change to our current CBA. And unlike a lot of the contracts that are currently open ours actually just opened. And we are at the negotiation table, working through the complexity of a potential update to the CBA. And so, from a planning perspective, as of right now, we're assuming the CBA -- no changes to the current CBA for next year.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nGot it. OK. Thank you very much.\n\nOperator\n\nOur next question will come from Andrew Didora with Bank of America. You may go ahead.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning, everyone. Just a follow-up to that last question. Does your 2024 CASM assumption assume any change in the CBA?\n\nUrsula Hurley -- Chief Financial Officer\n\nSo we haven't provided any CASM ex-fuel guidance yet for 2024.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nOK. I thought the flattish -- I thought, in the presentation, you said flattish CASM ex-fuel through 2024. So I was just wondering if there's anything in pilots for two years out.\n\nUrsula Hurley -- Chief Financial Officer\n\nGot it. So our structural cost program, we've committed -- as a result of the structural cost program, our intent is to deliver flattish CASM ex-fuel over the next multi-year period. So as I mentioned, 2023 does not include a change to the CBA. And in addition to that, we have not yet provided 2024 guidance.\n\nBut our goal is to get back to that flattish on a multiyear -- over a multiyear period.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Robin, just strategically, how do you think the competitive dynamics change on the transatlantic over the next several years? I ask because I think the CEO of the US ULCC said that he's considering transatlantic flights as the XLR is delivered, I would think other ULCCs may do the same. Just curious to get your thoughts on how you think the transatlantic evolves here.\n\nRobin Hayes -- Chief Executive Officer\n\nNo. I think certainly, I think the first thing to say that we are a relatively small player on the transatlantic. I mean, we are pleased to be starting our fifth flight. But as you know, that represents a very tiny percent of the market and probably around 2% to 3% of our ASMs in total.\n\nWe see an opportunity out of New York and Boston to fly to a number of European markets, and we are confidently progressing with those plans. When I think about the transatlantic historically, it's always had a mix of legacy and low-cost carriers. And so, I think that's going to continue. I mean, we saw with Norwegian, a large number of low-cost carrier seats come out of the market.\n\nWe've seen a new entrant called Norse there. And I think you're going to continue to see that. But what we believe with the LR and the XLR is we have the right airplane to serve these markets and carrying our mix of both low-cost premium travel because what we're doing with our transatlantic Mint product is appealing to a segment that has been grossly overcharged and gauged by legacy carriers for many years, while also making a competitive offering for our core or coach customers, which includes a combination of low fare and a great product. We think that's a great niche.\n\nWe think that's a niche that most customers want to be in. And so, we feel very confident that we have the right plan to continue to serve these markets.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nThat's great. Thank you for your thoughts.\n\nOperator\n\nOur next question will come from Conor Cunningham with Melius Research. You may now go ahead.\n\nConor Cunningham -- Melius Research -- Analyst\n\nGood morning, everyone. Thank you. When you think about 2023, what do you think is the best opportunity for outsized revenue production? Like so historically, I think pre-pandemic, you would think that there's -- JetBlue had a bunch of levers that would generate above-average unit revenue outperformance. Just curious if there's anything else that's out there that could juice those numbers higher.\n\nAnd I know you spoked of loyalty, but is there anything else that you're thinking about into next year?\n\nDavid Clark -- Head of Revenue Planning\n\nThanks, Conor. This is Dave. I'll take that one. As we look ahead to revenue levers for next year, a lot of it is the continued strong performance of the initiatives that we've already outlined, things like the very strong growth we're seeing in loyalty, as well as in JetBlue Travel Products.\n\nI do want to go deeper on a couple of them, though, that we haven't talked about yet. So one is our customer segmentation strategy, which has really seen excellent buy-up with customers choosing premium leisure products. Things like Mint is having a RASM improvement about 10 points better than the core system. And you'll see next year, all of our Airbus 320 family deliveries will come with a Mint configuration given the strength we've been seeing there.\n\nBut also within the core cabin, seeing very strong buy-up numbers to our Blue and our Blue Extra fair. It's now well above 50%, which is really strong and has made a lot of progress in the last year or two. So very pleased there. And then, secondly, the Northeast Alliance, we're thrilled to be in this area to be offering more choices to customers and more low fares, and we're seeing our customer response there really pick up.\n\nSo for example, in the third quarter, our revenues and profit margins in the NEA accelerated more quickly than the rest of our network. We're seeing really good code share growth sort of quarter-over-quarter and remain above our targets there. And then, the corporate response is really improving. As our seamlessness continues to improve and our loyalty benefits roll out, we're seeing more corporations booking the code share.\n\nWe're seeing some additional accounts signed because of the NEA. And then, lastly, and this really points to the future stickiness, our co-brand card account growth in NEA geographies has been faster and greater than the non-NEA geographies. So we think really continuing to execute and ramp up these revenue initiatives that we've been speaking of should help give us a good tailwind as we go through 2023.\n\nConor Cunningham -- Melius Research -- Analyst\n\nOK. That's helpful. And then, on the buckets of your structural cost program, I'm just curious on what's taken hold a lot quicker than you would have expected? And then maybe what's your biggest focus into next year as we start to work through that?\n\nUrsula Hurley -- Chief Financial Officer\n\nThanks for the question. So we've started to see meaningful progress in our enterprise planning. And as a reminder, what we're doing here is optimizing how we're building schedules around our existing work rules. And we're planning smarter, and we're building more resilient pairings.\n\nWe're collectively identifying any hidden inefficiencies, and we're reducing structural operability risks. So in the sequential improvement between Q3 and Q4, we've actually seen a point of improvement associated with our enterprise planning work. So that is going to continue to ramp up as we enter next year. In addition to that, we're also going to make meaningful progress on our maintenance opportunities entering next year.\n\nSo we moved to a phase in which we're retiring airplanes. And so, we've strategically been making decisions on what level of investments we do or do not make in certain airframes and engines. So next year, you will continue to see enterprise planning benefits, as well as maintenance benefits. In addition to that, as I mentioned in my remarks, we have actually started the retirement of our E190 airplanes.\n\nSo we actually have a point of savings -- sequential savings between Q3 and Q4 associated with that, and that will continue to ramp up. So as a reminder, in 2023, we've assumed the structural cost program will deliver between $60 million and $80 million, and the E190 retirements will drive $45 million of savings next year. I want to reiterate, in terms of structural costs, those are structural savings that will carry through. In regards to the E190 retirement, think of these as onetime cost avoidance items.\n\nSo the $75 million isn't necessarily run rate, but it's onetime savings that will be achieved over the next two years.\n\nConor Cunningham -- Melius Research -- Analyst\n\nAppreciate it. Thank you.\n\nOperator\n\nOur next question will come from Duane Pfennigwerth with Evercore ISI. You may now go ahead.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nHey, thanks. So I think a piece of the CASM guidance improvement sequentially is peeling back on reliability investments that you made over the summer. I wondered if you could just expand on that a little bit. What specifically are you kind of loosening? And what are you seeing that kind of gives you confidence to do that? Or is it really just a function of it's kind of a less peaky time and there's more kind of slack in the system, which enables you to do it?\n\nUrsula Hurley -- Chief Financial Officer\n\nThanks, Duane. So between Q3 and Q4, we are peeling back 2.5 points of summer investments, and the majority of that is related to internal and external labor. As you recall, we are operating in somewhat of a challenging environment throughout the network, given ATC delays. And so, we naturally built a level of resiliency into our planning around labor to ensure that we can deliver and operate.\n\nSo Joanna, I don't know if you have anything else to add?\n\nJoanna Geraghty -- President and Chief Operating Officer\n\nYes, a couple of things maybe. I think the biggest investment we made this summer was pulling back the schedule. And so, I think as you see Q3 to Q4, we're adding more capacity back into the schedule. So I think that's showing some of these investments have paid off.\n\nIn terms of things that we're peeling back, obviously, slowing the pace of hiring across our in-flight and airport teams. We're actually, in some cases, offering some rest and relaxation program this fall, which is more of a trough, which is in a great -- that's a great place to be, given where we were a year ago on sort of a higher, higher, higher framework. And then, the other piece is pilots, which I mentioned before. We're actually seeing even Q3 to Q4, a slight ease up on some of our reserve levels.\n\nWe will continue to plan to have greater reserves in 2019, but I would not expect 2023 to have as high a reserve level as 2022. And so, you'll see, I think, some meaningful improvements there over time. We are being careful though, because the ATC environment remains fragile. The FAA has been a great partner, bringing a ton of transparency around what they're seeing in terms of staffing challenges.\n\nWe know N90 is particularly challenged, and we don't think this is going to course correct in the next few months. So we are working closely with them to ensure that we are aligned in our planning assumptions and what we expect to see how they handle some of these programs and some of the irregular operations days. So continuing some investments there, but there remains opportunity in pilot reserve levels.\n\nDavid Clark -- Head of Revenue Planning\n\nAnd this is Dave. Duane, one thing I'll note as well is our aircraft utilization on a year-over-three basis improved several points as we moved from Q3 to Q4, so that helps as well. And we'll continue to see that in 2023 as we continue to ramp back toward our pre-COVID utilization.\n\nRobin Hayes -- Chief Executive Officer\n\nAnd Duane, this is Robin, you're going to win the award because you're the only person so far to get four leaders to answer your question.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nIt's a very comprehensive answer, which is appreciated.\n\nRobin Hayes -- Chief Executive Officer\n\nBut I do think that we're confident in the -- so first of all, you're going to see more of -- buffer the peaks more in future years as well. We're not going to go back to where we were in 2019. If we think about the sort of the -- if we think about pilots, and Joanna talked about that. We've been -- if we look at sort of November, for example, we're going to be -- we're going to have about 14% more pilots flying about the same capacity than we did in 2019.\n\nSo it's still a significant step up. What we don't know fully is -- we know we will unpeel those investments over time. What we don't quite know is how quickly we can do that because it's going to be very driven by, as Joanna said, the external environment and some of the issues that we've seen this year. But clearly, there's a significant opportunity there to reduce cost as we unpeel it.\n\nAnd so, if I look at -- if I was to kind of take a sort of a crystal ball into next year, as Joanna said, we will have lower reserve coverage than we had this year, but we won't be back to 2019 levels. I just don't know yet, until we get into planning cycle, how big a step down that would be.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nI do have a quick follow-up, hopefully quicker. Just with respect to routes that -- as you build out LaGuardia, right? So as you have markets that maybe historically served from JFK and now you've built that out from LaGuardia, has anything surprised you in terms of very different demand set, very different pricing? Are there markets that look, in essence, completely different from LaGuardia?\n\nDavid Clark -- Head of Revenue Planning\n\nThanks, Duane. I'll take that. This is Dave. I'd say there's nothing that has completely surprised us or looks a lot different than we thought, but we've certainly been learning a lot over the past several months here, especially since LaGuardia went up to 52 flights a day in July.\n\nAnd the team is sort of constantly reworking the capacity plan into schedules so that not only does this capacity naturally improve as it ramps over time, but that we accelerate that improvement and raise the ceiling by improving the schedule to more closely align with customer demand. So no big surprises, but lots of tweaks and refinements that we'll be rolling out over the next months and year to continue to improve our New York performance.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nOur next question will come from Helane Becker with Cowen. You may now go ahead.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThanks very much, operator. So has the change in IATA designation for Newark changed the way you have to respond to the government on the NEA alliance?\n\nRobin Hayes -- Chief Executive Officer\n\nHelane, I'll take that. No, absolutely not. The change that IATA has proposed or made really relates to fare construction only. It doesn't relate to what we call sort of multi-airport city codes.\n\nAnd so, if you go into a GDS, if you go into Expedia-type NYC, you're going to get all airports come up, including Newark. Everyone who lives or works in New York clearly knows Newark is part of the New York airport system managed by the same authority as LaGuardia and JFK. And we see customers move between those airports pretty regularly as well. So no, it has not -- I mean, no impact on the NEA, but also no impact on JetBlue's business or any other airline's business.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThat's very helpful. And then, just a point of clarification. In terms of aircraft in and aircraft out, can you just say of the 22 aircrafts you're planning for next year, what percent are replacement and what percent are growth?\n\nUrsula Hurley -- Chief Financial Officer\n\nHelane, so next year, we take -- we're expected to take delivery of -- well, contractually, we're supposed to take 18 A220s. Our planning assumption is that we take 14, so you can consider those replacement. We're contractually retiring six E190s. And then, of the 30 that we own, we will also be retiring some of those as well.\n\nSo in summary, the 14 airplanes A220 that we take next year, the margin-accretive aircraft that we take next year will be replacement.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question will come from Mike Linenberg with Deutsche Bank. You may go ahead.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nOh, hey, good morning, everyone. Ursula, just a question on capex. The $1 billion this year, just to remind us, that's predominantly airplanes, and that's being out of -- paid out of cash. Your $1.5 billion to $2 billion of capex that you sort of guided to earlier on the call, is that -- presumably, that's going to be a mix of cash and debt given the size? And, I guess, as an add-on, have you gotten actually any commitments for aircraft finance for aircraft-s that are coming in 2023?\n\nUrsula Hurley -- Chief Financial Officer\n\nSo you're correct, Mike. The $1 billion this year will be -- completely be funded by cash. The estimated capex range next year of $1.5 billion to $2 billion, none of that is currently financed. We're going through the 2023 planning process at the moment.\n\nAnd so, we'll share color with you in January around the baseline assumptions between cash and financing.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nOK. Great. That's helpful. And then, there's a question, I don't know if it's Robin or Joanna, just the news at a week or two ago, Delta making an investment in Joby.\n\nI read somewhere something about an exclusivity. And I know that you guys also have an investment in Joby. Does that preclude you from doing anything with them down the road? I'm not sure if it was like geography specific or airport specific, the exclusivity. Just any comments, I know I'm sort of jumping ahead a few years.\n\nRobin Hayes -- Chief Executive Officer\n\nYes. No. Mike, I'll take that. No, I mean, we were an early investor in Joby.\n\nWe had a great partnership with them, really appreciated seeing that business grow and develop. And yes, the partnership they announced with Delta does provide exclusivity period of five years. But I think we are very focused right now on executing the initiatives that we have. We're very focused on getting the Spirit transaction done because this is a very important strategic priority for our airline.\n\nAnd our JTV subsidiary has dozens of investments and ventures, and we have many opportunities across the spectrum there.\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nYeah, that's what I thought. All right, great. Thanks.\n\nOperator\n\nOur next question will come from Chris Stathoulopoulos with Susquehanna International Group. You may go ahead.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nGood morning, everyone. So Robin or Ursula, could you give a little bit more color on the modest aircraft delays that you mentioned in your prepared remarks for next year? Is that five or seven? And do you think that you can still grow capacity in mid- to single digits with the modest delays? And I guess, said another way, if it's easier to just answer it this way, could you fly the schedule that you're planning for 2023 with the aircraft that you have in the fleet now with the CASMx down that you're looking for?\n\nUrsula Hurley -- Chief Financial Officer\n\nSo, as I mentioned, so contractually, Airbus is supposed to deliver 29 airplanes to us next year. I think we're all well aware that they're struggling from ramp-up challenges driven by manpower and supply chain. So we are seeing delivery delays. We're working hand-in-hand with them to manage through those.\n\nFrom a planning assumption perspective, contractually, we're supposed to get 29. We're assuming we get a minimum of 22 next year. And with those 22 airplanes, we believe that we can deliver the mid- to high single-digit growth rate that we're planning for next year. And in turn, we also believe that we can deliver the flat or better CASM ex-fuel.\n\nOur utilization continues to be down here in the fourth quarter by a handful of points. As we enter next year, our fleetwide utilization, we expect to increase a couple of points as well. So again, we feel confident based on what we know today and the assumptions that we've been working with Airbus on we can deliver that mid- to high single-digit growth rate.\n\nRobin Hayes -- Chief Executive Officer\n\nYes. And if I can just add to that, we also have the option of delaying retirements if we need to. And I think we're trying to give as much color on 2023 as we can based on what we know today. We accept there is a macroeconomic question mark out there that people have.\n\nWe're not seeing any signs of concerns around that today, but we also recognize it could be in the future. And so, we will ultimately take decisions next year driven around by margin. And so, we also have flexibility to adjust capacity down, if that's what we need to do because of the economic environment. So we have a lot of flexibility to delay retirements, increase utilization.\n\nWe've taken our spare count up significantly this year to derisk the operation, we'll bring that down next year. Ursula talked about some of the flavor around the delivery days. But I think at the end of the day, our capacity is going to be governed by what we see in terms of the economic environment as we go into next year. And clearly, CASM forecast built off the capacity assumptions that we're making today.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nOK. And a follow-up, Joanna, so in your comments, you spoke about potential cyclical slowing and some cautious planning around that. What are the key data points you're watching every day with respect to that? An obvious one being, I'm guessing, daily bookings, cash intake, but what are some of the more nuanced data points that you believe might signal a slowing?\n\nJoanna Geraghty -- President and Chief Operating Officer\n\nYes. Just to be clear, we didn't signal any cyclical slowing, quite the opposite, actually. It's very strong. We're not seeing any slowdown.\n\nSpecifically, we did speak to if there is one down the road, we think we're well positioned with the number of levers we have to pull, capacity being the largest. But we are not seeing any slowdown in terms of underlying demand. In terms of things we look for: bookings, fare, load, things of that nature. But beyond that, we're not seeing anything in terms of any kind of slowing or signs of it.\n\nRobin Hayes -- Chief Executive Officer\n\nYes. I think in addition, there's a number of other metrics that we can look at in terms of credit card data is also a good sort of indicator. Again, no concerns at this point. And I think what we're all struggling with here is the economy has grown significantly since 2019.\n\nCapacity has not kept up with that growth. If we think about -- for those who have been in the industry a long time, GDP and capacity growth was probably -- one of the linker between capacity and GDP was probably the best correlation you could have. And so, we have a lot of GDP growth that has occurred since 2019. And so, the question is if we have a recession and how much of that eats into that sort of higher base that we've already got.\n\nAnd again, we continue to see a lot of pent-up demand, people who haven't flown for a period of time. We continue to see very high load factors on days where we haven't historically seen high load factors, which suggests to me there's still a lot of pent-up demand that we're still eating into.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question will come from James Hollins with BNP. You may go ahead.\n\nJames Hollins -- Exane BNP Paribas -- Analyst\n\nHey, thanks. Just I wanted to come back on corporate travel. I mean, the 90% recovered from pre-COVID, it looks pretty good to me, I'm maybe just an idiot. But I mean perhaps I think conspicuous by its absence is really talking up the corporate travel either in your release or your presentation.\n\nMaybe you could run through the thoughts on sort of how you're seeing corporate travel, how it's trending into the current season?\n\nDavid Clark -- Head of Revenue Planning\n\nSure. Thanks, James. This is Dave. I'll take that.\n\nWe're certainly pleased with the corporate travel trends we've seen in the last four to six weeks here. There is still some choppiness. So I don't think we want to completely declare success and it's still being about 90% bookings. It's clearly below the 2019 levels, whereas the rest of our revenue is up more than 20%.\n\nSo relative to that, it's still got a long way to go. But we're seeing a number of things we're seeing not only the bookings, but the travel, obviously, which follows on a few weeks lag. We actually did have one week earlier this month where we had a higher flown revenue, so higher travel revenue this year than we did the same week in 2019. So that was a new record, which is very helpful.\n\nAnd the big thing for us too is, as mentioned before, the NEA is really accelerating for us in the past quarter. And we see -- the lion's share of our corporate happens in New York and Boston. So as the NEA ramps up with seamlessness, as we continue to layer in the loyalty benefits, it is very heartening to see how the corporates have responded with additional code-share bookings, additional accounts, things like that. So we feel very good about just the general corporate recovery, as well as the NEA benefits that it's driving.\n\nJames Hollins -- Exane BNP Paribas -- Analyst\n\nAnd then just, I mean, from a far, I'm getting a lot of headlines on your court case, obviously, on the Northeast Alliance. I was wondering if you're having any traction in court of the idea that it's not a merger with American Airlines?\n\nRobin Hayes -- Chief Executive Officer\n\nYes. I'll take that, and thanks for the question, James. The court -- yes, the trial is wrapping up soon. I believe that we put on a really compelling case.\n\nWe have a lot of conviction about the NEA. The consumer benefits are there for everybody to see. Everyone in New York loves having more JetBlue flying, everyone in Boston loves having more JetBlue flying. They don't want to go back to how it was.\n\nAnd so, we have a -- we're confident that at the end of the day, it's a process. The judge will make the decision. And we are -- we'll wait to hear on that. But I'm very pleased with the case that our team have put forward.\n\nJames Hollins -- Exane BNP Paribas -- Analyst\n\nThanks very much.\n\nOperator\n\n[Operator instructions] Our next question will come from Dan McKenzie with Seaport Global.You may now go ahead.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nOh, hey, thanks for squeezing me in here, guys. Robin, to put a ball on the revenue cost and utilization comments, for 2023, I'm guessing you could drive a Mack Truck through how you're thinking about the business and what the Street is modeling. And you've shared in the past, the pieces are in place to drive $3 a share more in earnings at some point and the Street seems to be dismissing that. So I guess the question is, do you continue to have confidence in that outlook? And given that would you say consensus embedding a recession next year based on what you know today? And the point, of course, is not early to tell us what's the model.\n\nIt's just, again, going back to the conviction in your ability to drive sustainably higher margins from here.\n\nRobin Hayes -- Chief Executive Officer\n\nYes. No, Dan, I mean, thanks for the question. I mean, we have a lot of conviction, a lot of confidence as we -- we had a deeper hole than some to climb out of because of COVID. We were in geography that, I think everyone accepts, was some of the most impacted.\n\nWe didn't have the diversification in some revenue streams like cargo during COVID that others had. We had a bump this April as we had to pull down capacity to reflect, I think, a different planning assumption around some of the external constraints that we made in the system and some of the hiring challenges that we have. Of course, others have also had to course correct. And I think we have good momentum now.\n\nWe continue to see strong revenue performance, notwithstanding some of the one-off headwinds that Dave and Joanna walked through from Q3 to Q4. We're executing on CASM. We have a new structural cost program underway. We have the fleet modernization going on as well.\n\nOur revenue initiatives around Travel Products and loyalty are doing exactly what we've said we've been doing for the last couple of years now, and we're pleased with those. And let's not forget that geography like New York is still not fully recovered to the same degree as other geographies in the US, and we're seeing that recovery now. And then, on top of that, we're seeing all the benefits from the NEA. So we have a lot of conviction.\n\nWe recognize that that has confidence has to be earned quarter-by-quarter on delivering on the results and that's exactly what we are intending to do.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nOK. Second question here, regulatory approval for the Spirit merger by early 2024, I think is -- kind of the messaging, that seems pretty specific. And, I guess, is that -- are there some outside data points that give you certainty around that? Or is that simply a legal guess by your counsel? And I'm just wondering from where you sit, is there anything that -- what might cause that time frame to slip?\n\nRobin Hayes -- Chief Executive Officer\n\nNo. Thanks, Dan. No, I mean, I think we laid out a pretty conservative timeline there. I mean, if you look at historically, and previous precedent transactions in the space, they've been decided more quickly than that.\n\nI think we recognize, as we've been through this, that this transaction will face a lot of regulatory oversight and overview. And we wanted to lay out a pretty cautious timeline and hopefully beat it. So right now, we're not changing anything. We're very excited about the prospect of creating this true national low-fare challenger to bring the JetBlue effect to more geographies and more markets and speeding up our organic plan by several years.\n\nAnd I've been spending quite a bit of time recently down in Orlando and Fort Lauderdale and there's a lot of excitement down there around this merger. And so, we are very excited to get on with it, but we're going to fully respect the regulatory process that's under way, comply with the requests that are being made by the Department of Justice and hopefully get to a regulatory approval as quickly as time permits.\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nVery good. Thanks for the time, you guys.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Jose Caiado for any closing remarks.\n\nJose Caiado -- Director, Investor Relations\n\nThanks, Anthony. That concludes our third quarter 2022 conference call. Thanks for joining us. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJose Caiado -- Director, Investor Relations\n\nRobin Hayes -- Chief Executive Officer\n\nJoanna Geraghty -- President and Chief Operating Officer\n\nUrsula Hurley -- Chief Financial Officer\n\nSavi Syth -- Raymond James -- Analyst\n\nScott Group -- Wolfe Research -- Analyst\n\nDavid Clark -- Head of Revenue Planning\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nConor Cunningham -- Melius Research -- Analyst\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nHelane Becker -- Cowen and Company -- Analyst\n\nMike Linenberg -- Deutsche Bank -- Analyst\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nJames Hollins -- Exane BNP Paribas -- Analyst\n\nDan McKenzie -- Seaport Global Securities -- Analyst\n\nMore JBLU analysis\n\nAll earnings call transcripts"
}