{
  "companyName": "Intuitive Surgical",
  "companyTicker": "ISRG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/18/intuitive-surgical-isrg-q3-2022-earnings-call-tran/",
  "content": "Intuitive Surgical (ISRG -0.91%)\nQ3 2022 Earnings Call\nOct 18, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to the Intuitive third-quarter earnings release call. At this time, all participants are in a listen-only mode. Later, we will conduct a question-and-answer session.\n\n[Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to our host, head of investor relations, Mr. Brian King. Please go ahead.\n\nBrian King -- Treasurer and Head of Investor Relations\n\nGood afternoon, and welcome to Intuitive's third-quarter earnings conference call. With me today we have Gary Guthart, our CEO; and Jamie Samath, our CFO. Before we begin, I would like to inform you that comments mentioned on today's call may be deemed to contain forward-looking statements. Actual results may differ materially from those expressed or implied as a result of certain risks and uncertainties.\n\nThese risks and uncertainties are described in detail in our Securities and Exchange Commission filings, including our most recent Form 10-K filed on February 3, 2022, and Form 10-Q filed on July 22, 2022. Our SEC filings can be found through our website or at the SEC's website. Investors are cautioned not to place undue reliance on such forward-looking statements. Please note that this conference call will be available for audio replay on our website at intuitive.com on the Events section under our Investor Relations page.\n\nToday's press release and supplementary financial data tables have been posted to our website. Today's format will consist of providing you with highlights of our third quarter results as described in our press release announced earlier today, followed by a question-and-answer session. Gary will present the quarter's business and operational highlights, Jamie will provide a review of our financial results, then I will discuss procedure and clinical highlights and provide our updated financial outlook for 2022. And finally, we will host a question-and-answer session.\n\nWith that, I will turn it over to Gary.\n\nGary Guthart -- Chief Executive Officer\n\nThank you for joining us today. Our business fundamentals strengthened in Q3 with 20% procedure growth in da Vinci procedures compared with Q3 of last year and solid performance in each of our global regions. Our capital placements reflected 13% growth in our installed base to meet procedure demand accompanied by continued increases in utilization per system per year, healthy indicators for our customers and for us. Ion also experienced increases in installs, procedures performed, and annualized system utilization.\n\nSupply chain challenges, while still present, are abating from their pandemic peaks. Looking more closely at procedures, 20% growth is up from 14% last quarter and above our three-year compound annual growth rate of 16% during the pandemic. General surgery, our largest procedure category is growing at the fastest rate of any category fueled by bariatric surgery, cholecystectomy, hernia repair, and other foregut procedures in the United States. In Europe, several countries are growing nicely with diversified use beyond urology.\n\nGermany, the U.K. and Ireland, Italy, and Spain stood out in the quarter. In Asia, Japanese procedure growth accelerated relative to Q2, and Korean growth remained solid. Procedures in both countries are also diversifying beyond urology.\n\nIn China, procedure growth was just above our global average, hampered in part by regional rolling lockdowns that continue to impact procedures and utilization. Turning to capital. We placed 305 systems in the quarter compared with 336 in Q3 a year ago and 279 last quarter. Strong procedure demand is supporting da Vinci installed base growth of 13% in the quarter.\n\nPer-system utilization grew 7% in the quarter, up from our three-year compound annual growth of 5% over the pandemic. Utilization was aided by recovery from a softer U.S. procedure quarter last year, as well as customer performance of more types of procedures and higher volume categories and increases in customer efficiency. Si trade-ins continued to slow given the decline in remaining trade-in opportunity.\n\nIon placements grew to 50 this quarter, up from 28 last year and 41 last quarter, reflecting continued growth in an early market. Overall, our customers are acquiring systems where there is opportunity for procedure growth. On the investment front, we continue to focus on our platforms in multiport endoluminal, single port, and digital through indication and regional regulatory expansions, innovation in products and services that meet customer needs, and product quality and cost refinements. We expect our new platforms to approach our historical levels of contribution margin over time.\n\nProgress year to date has met our expectations. With regard to our expenses this quarter, we moderated headcount growth to focus on deeply integrating those employees who joined us in the past several quarters. Going into 2023, we expect the rate of growth in fixed expenses to slow as we pursue leverage in our enabling functions and sequence some of our forward investments. We've had a solid quarter achieving product and services milestones.\n\nWe continue to expand access to our multiport products, training, and services globally. Standouts in the quarter include record global quarterly new surgeon training completions to first case and accreditation of our technology training pathway by the Royal College of Surgeons in the U.K. For Ion, we submitted our registration application in China, and we obtained German regulatory clinical study approval for ion ablation technology, which starts our clinical journey toward enabling interventions beyond biopsy. Ion procedures grew 211% in the quarter.\n\nTurning to our single-port platform, da Vinci SP. Procedures grew 46% year over year, with particular strength in Korea, where our SP team launched next-generation SP instruments and our Firefly enabled endoscope. We also received PMDA clearance in the quarter, market SP in Japan across a broad set of clinical indications similar to the indications SP has in Korea. In our digital portfolio, our My Intuitive app and PORTaL are being adopted broadly in regions in which they are released as the go-to digital portal for da Vinci customers.\n\nInstalls of our in-room computing platform, Intuitive Hub grew 21% over the third quarter last year and software updates to our hub installed base improved usability and enabled telepresence. In summary, our core business strengthened in the quarter as acute pandemic impact softened. We are managing spend growth while investing in core growth opportunities for the future. I'll now pass the time over to Jamie to take us through our finances and some persistent macroeconomic issues in greater detail.\n\nJamie Samath -- Chief Financial Officer\n\nGood afternoon. I will describe the highlights of our performance on a non-GAAP or pro forma basis. I will also summarize our GAAP performance later in my prepared remarks. A reconciliation between our pro forma and GAAP results is posted on our website.\n\nIn Q3, growth in procedures, the installed base of da Vinci systems, and average system utilization was healthy. The strength of these key business drivers resulted in a pro forma operating margin of 36% and pro forma EPS of $1.19. Simultaneously, we saw headwinds from the strong U.S. dollar, lingering supply chain issues, and inflation, which together negatively impacted pro forma operating margin by approximately two percentage points compared to the third quarter of last year.\n\nI will take you through these details. Q3 procedure growth of 20% reflected an increase in U.S. procedures of 18% and OUS procedure growth of 24%. U.S.\n\nprocedure growth reflected a favorable comparison to the year-ago quarter given the impact of the delta variant last year. On a three-year compound annual growth rate basis, U.S. procedures grew approximately 13%. In China, our second largest market during the quarter, procedures continued to recover from the impact of COVID-related lockdowns that we described on last quarter's earnings call.\n\nHowever, we continue to see regional lockdowns occur as COVID cases rise. Turning to capital. We placed 305 systems in the third quarter, 9% lower than the 336 systems we placed last year. Third quarter system placements included approximately 15 systems that were delayed at the end of last quarter due to component supply delays.\n\nThere were 71 trading transactions in the quarter as compared to 136 in Q3 of 2021, reflecting the decline in the number of Si remaining in the installed base. As of the end of Q3, there were approximately 739 Sis remaining in the installed base, of which 191 are in the U.S. Excluding trading transactions, global system placements grew 17% from last year. The installed base of da Vinci systems grew approximately 13% year over year, consistent with recent trends.\n\nThe utilization of clinical systems in the field, measured by procedures per system, increased almost 7% compared to last year. Using a three-year compound annual growth rate, third-quarter utilization was consistent with historical averages, increasing almost 5%. Average system utilization in the U.S. grew 6% year over year, an improvement from the 1% decline in utilization in Q2.\n\nAs a result of our procedure and capital performance, Q3 revenue was $1.56 billion, an increase of 11% from the third quarter of 2021. On a constant-currency basis, third-quarter revenue grew approximately 15%. In the third quarter, revenue denominated in non-USD currencies represented 22% of total revenue. On a revenue-weighted basis, using current exchange rates, net of hedges in place for Q4, the U.S.\n\ndollar is approximately 3% stronger than the rates realized in Q3. Additional revenue statistics and trends are as follows: In the U.S., we placed 175 systems in the third quarter, lower than the 227 in Q3 of 2021, reflecting a decline of 66 systems associated with trade-in transactions and a challenging macroeconomic environment. Outside the U.S., we placed 130 systems in the third quarter compared with 109 last year. Current-quarter system placements included 54 into Europe, 32 into Japan, and 14 into China compared with 47 into Europe, 20 into Japan, and 17 into China in the third quarter of 2021.\n\nAs of the end of Q3 2022, there were 40 systems remaining under the current quota in China, which is also available to the three domestic competitors that have completed local registration with NMPA. Markets that are served through distributors have represented approximately 10% of system placements so far this year. Our distribution partners purchased product from us in U.S. dollars and sell in their local currencies.\n\nWhile we have not experienced a significant impact so far, the strengthening of the U.S. dollar reduces distributor margins and may cause delays in capital purchases. Leasing represented 37% of Q3 placements compared with 42% last quarter and 41% in the third quarter of 2021. The lower lease mix is a function of customer and regional mix.\n\nAnd while leasing will fluctuate from quarter to quarter, we continue to expect that the proportion of placements under operating leases will increase over time. Third quarter system average selling prices were $1.5 million, consistent with last quarter. System ASPs were negatively impacted by a higher trade-in mix and the impact of FX, offset by a higher mix of Xi dual console placements. We recognized $17 million of lease buyout revenue in the third quarter compared with $22 million last quarter and $25 million last year.\n\nLease buyout revenue has varied significantly quarter to quarter and will likely continue to do so. Instrument and accessory revenue per procedure was approximately $1,800 compared with approximately $1,900 for both last quarter and last year. On a year-over-year basis, FX negatively impacted I&A per procedure by approximately $50. The remainder of the year-over-year reduction was primarily a result of customer ordering patterns.\n\nDuring the quarter, our distributors and customers in certain OUS markets reduced their inventory as supply chain predictability moderately improved. We placed 50 Ion systems in the quarter as compared to 28 in the third quarter of last year. The installed base of Ion systems is now 254 systems, of which 112 are under operating lease arrangements. Third quarter Ion procedures of approximately 6,400 increased 211% on a year-over-year basis.\n\nIon is in the new MDR regulatory review process in Europe, and during the quarter, we submitted Ion into the regulatory process in China. As a reminder, regulatory review timelines in China are lengthy. Moving on to the rest of the P&L. Pro forma gross margin for the third quarter of 2022 was 69.8% compared with 71.3% for the third quarter of 2021 and 69.2% last quarter.\n\nQ3 pro forma gross margin included a one-time benefit of approximately 50 basis points relating to the favorable conclusion of certain indirect tax matters. Pro forma gross margin was lower than last year primarily due to the stronger U.S. dollar, manufacturing and logistics inefficiencies as a result of the supply chain environment, higher component pricing, and increased fixed costs relative to revenue. Indicators of supply and inventory held modestly improved in the quarter but remained well below pre-pandemic levels.\n\nPro forma operating expenses increased 24% compared with third quarter of 2021, driven by increased headcount, higher R&D-related project costs, and higher travel costs. Growth in operating expenses has been primarily in support of our Ion platform, next-generation robotics capabilities, our digital capabilities, and expansion of our infrastructure to allow us to effectively scale. We are also seeing higher regulatory costs as a result of increased regulatory requirements globally and expansion of our new platforms into OUS markets. As Gary mentioned earlier, during the quarter, we slowed our hiring pace, adding approximately 530 employees lower than the 700-plus employees we have added per quarter in the last three quarters.\n\nAs we look forward to 2023, we expect our operating expense growth will be lower than the growth for this year. The slowing growth rate of operating expenses reflects the completion of some of our infrastructure and business process improvement investments and planned leverage in our enabling functions. As part of our planning process, we are also conducting a review of our capital expenditure priorities and we'll provide an update as to the outcome of this review on the next call. Within this framework, we will continue to invest in our new platforms, in NSP, next-generation capabilities, and our digital ecosystem given the return profiles we see for those investments.\n\nPro forma other income was $7.2 million for Q3, lower than $10.4 million in the prior quarter primarily due to the impact of foreign exchange losses from remeasurement of the balance sheet resulting from the continued strengthening of the U.S. dollar. Our pro forma effective tax rate for the third quarter was 23.4%, in line with our expectations. Third quarter 2022 pro forma net income was $429 million or $1.19 per share compared with $435 million and also $1.19 per share for the third quarter of last year.\n\nCapital expenditures in Q3 were $153 million primarily comprised of infrastructure investments to expand our facilities footprint and increase manufacturing capacity. I will now summarize our GAAP results. GAAP net income was $324 million or $0.90 per share for the third quarter of 2022 compared with GAAP net income of $381 million or $1.04 per share for the third quarter of 2021. The adjustments between pro forma and GAAP net income are outlined and quantified on our website and include excess tax benefits associated with employee stock awards, employee stock-based compensation, amortization of intangibles, litigation charges, and gains and losses on strategic investments.\n\nWe ended the quarter with cash and investments of $7.4 billion compared with $8.2 billion at the end of Q2. The sequential reduction in cash and investments reflected share repurchases and capital expenditures, partially offset by cash from operating activities. During the quarter, we completed a $1 billion ASR in addition to the $607 million of shares repurchased in the first half. Since the end of 2021, our diluted share count has decreased by approximately 7 million shares or 2%, and we have a remaining authorization to repurchase our shares of $2.5 billion.\n\nAnd with that, I would like to turn it over to Brian, who will discuss clinical highlights and provide our updated outlook for 2022.\n\nBrian King -- Treasurer and Head of Investor Relations\n\nThank you, Jamie. Our overall third-quarter 2022 procedure growth was 20% compared to 20% for the third quarter of 2021 and 14% last quarter. The three-year compound annual growth rate between the third quarter of 2019 and third quarter of 2022 was 16%. In the U.S., third quarter 2022 procedures exceeded our expectations with growth at 18% year over year compared to 16% for the third quarter of 2021 and 11% last quarter.\n\nProcedure growth reflects a positive impact relative to Q3 last year, which was impacted by the delta variant. On a three-year compound annual growth basis, U.S. procedure growth was 13%. Third-quarter procedure growth continued to be driven by general surgery with strength in bariatrics, cholecystectomy, and hernia repair.\n\nTrends in malignant procedures, namely colorectal and lobectomy procedures were also strong. Growth in gynecology, our second largest procedure category in the U.S., also experienced double-digit growth while more mature urologic procedures grew in the high single digits. Outside of the U.S., third quarter procedure volume grew approximately 24% year over year compared to 30% for the third quarter of 2021 and 22% last quarter. On a three-year compound annual growth basis, procedure growth was 21%.\n\nTurning to Europe. Procedure growth was led by strong growth in Germany, U.K., Italy, and Spain. In all of the regions noted, procedure growth outside of urology was strong in general surgery and gynecology categories. Specifically in Germany, we experienced early stage growth in benign hysterectomy and colorectal surgery.\n\nIn the U.K., growth was led by benign hysterectomy, colorectal, and cholecystectomy procedures. While still early stage, year-over-year procedure growth in these nonurology procedures was almost four times higher than urology. Turning to Asia. In Japan, growth in general surgery and gynecology continued to be strong.\n\nWe experienced robust growth in these categories led by gastrectomy, rectal resection, and benign hysterectomy. Further contributing to strong procedure performance was continued early stage growth in newly reimbursed procedures, namely colon resection, and nephrectomy procedures. In China, we continue to see a recovery in the first couple of months of the third quarter as COVID cases began to decline and lockdown restrictions were lifted. Procedure growth was driven by urologic procedures, specifically prostatectomy and partial nephrectomy, along with strong growth in colon resection within general surgery.\n\nLater in the quarter, we began to see procedures start to moderate as COVID began to reemerge in various regions and rolling lockdowns were implemented. Korea procedure growth was also solid in the third quarter. Growth in procedures continued to be broad-based with strong growth in SP procedures. Now, turning to the clinical side of our business.\n\nEach quarter on these calls, we highlight certain recently published studies that we deem to be notable. However, to gain a more complete understanding of the body of evidence, we encourage all stakeholders to thoroughly review the extensive detail of scientific studies that have been published over the years. Earlier today at the Annual CHEST conference in Nashville, Tennessee, Dr. Eric Folk from Massachusetts General Hospital presented preliminary performance updates from the PRECIsE study.\n\nResults were consistent with data released last year and demonstrated encouraging results for diagnostic yield and sensitivity of malignancy for samples obtained through an Ion procedure with a strong safety profile. We anticipate the final data from PRECIsE to be published in the first part of next year. Continuing with Ion, a group from the Mayo Clinic in both Rochester, Minnesota and Jacksonville, Florida, led by doctors Alejandra Yu Lee-Mateus, Janani Reisenauer, and Sebastian Fernandez-Bussy published a retrospective case series in respirology, comparing the performance of the Ion endoluminal system with the CT guided transthoracic approach for pulmonary lesion biopsy. A total of 225 patients were included in this study.\n\n113 who underwent an Ion procedure with a median nodule size of 18 millimeters and 112 who underwent a transthoracic biopsy with a median nodule size of 16 millimeters. Within the Ion group, the overall diagnostic yield and sensitivity for malignancy reported was 87.6% and 82.1%, respectively, which were comparable to the same outcomes from the transthoracic approach. Importantly, the rate of complications was significantly lower for the Ion approach with a 13% difference relative to the transthoracic approach. Further analysis demonstrated an approximately 80% reduced chance of pneumothorax associated with the Ion procedure.\n\nThe authors concluded in part that robotic-assisted approach with Ion can be as accurate as the transthoracic approach for sampling pulmonary nodules with similar or reduced complications and should be considered as a means for nodule biopsy. Turning to the surgical side. Dr. Leonardo Solaini from the University of Bologna and colleagues published a systematic review and meta-analysis comparing the robotic-assisted and laparoscopic approaches for left colectomy procedures in the International Journal of Colorectal Disease.\n\nData from 11 different articles, including over 52,000 patients were included in this analysis, with over 13,500 in the robotic arm and over 39,000 in the laparoscopic arm and with no difference in preoperative characteristics reported. With regard to perioperative outcomes, a 4% lower conversion to open rate was reported for the robotic-assisted approach compared to the laparoscopic approach. Further analysis demonstrated the risk of conversion to open for the robotic-assisted approach was approximately half the rest of the laparoscopic approach. In addition, the analysis showed a higher risk of postoperative complications after a laparoscopic left colectomy, as well as a lower rate of superficial wound infections for the robotic-assisted approach.\n\nThe analysis also showed anastomotic leak was 30% less likely with the robotic-assisted approach compared to the lap group. The authors concluded in part that robotic left colectomy requires less conversion to open surgery than the standard laparoscopic approach and more studies are warranted to highlight possible advantages in using the robotic platform for left colectomy. I will now turn to our financial outlook for 2022. Starting with procedures.\n\nOn our last call, we forecast full-year 2022 procedure growth within a range of 14% to 16.5%. We are now increasing our forecast and expect full-year 2022 procedure growth of 17% to 18%. This range continues to reflect the uncertainty associated with the course of the pandemic. The low end of the range still assumes increasing COVID hospitalizations, regional lockdowns, and staffing pressure at hospitals for the remainder of the year.\n\nAt the high end of the range, we assume COVID-19-related hospitalizations around the world continue to decline throughout the remainder of 2022, and there are no additional significant impacts from further resurgences. The range does not reflect significant material supply chain disruptions or hospital capacity constraints similar to what we have experienced at the start of the pandemic. Turning to gross profit. On our last call, we forecast our 2022 full-year pro forma gross profit margin to be within 69% and 70.5%, expected to be toward the lower end of that range.\n\nWe are now refining our estimate of pro forma gross profit margin to be within 69% and 69.5% of net revenue, given the ongoing impact of higher input costs related to supply chain and the impact from a stronger U.S. dollar. Our actual gross profit margin will vary quarter to quarter depending largely on products, regional and trade-in mix, fluctuations in foreign currency rates, and the impact of new product introductions. With respect to operating expenses, on our last call, we forecast pro forma operating expense growth to be between 23% and 25%.\n\nWe are adjusting our estimate and now expect our full-year pro forma operating expense growth to be between 21% and 23%. We are narrowing our estimate for noncash stock compensation expense to range between $520 million to $530 million in 2022. We are also updating our estimate for other income which is comprised mostly of interest income to total between $40 million and $50 million in 2022, a decrease from our previous estimate of $60 million and $70 million. The decrease primarily reflects lower interest income on cash that was used to repurchase shares and also the net impact of certain foreign exchange gains and losses.\n\nOn last quarter's call, we forecast 2022 capital expenditures within a range of $700 million to $800 million. We are now lowering our estimate for capital expenditures for 2022 to be in the range of $600 million to $700 million. With regard to income tax, we continue to estimate our 2022 pro forma tax rate to be between 22% and 24% of pre-tax income. That concludes our prepared remarks.\n\nWe will now open the call to your questions. Maggie, I think we'd like to go ahead and lead the Q&A to the --\n\nOperator\n\nAll right. Yes. Thank you. [Operator instructions] And first, we have a question from the line of Travis Steed with Bank of America.\n\nPlease go ahead.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nHey, thanks for taking the questions, and congrats on the good quarter. All right. Maybe, Gary, on the capital selling funnel, just maybe you could comment how the funnel has changed since the beginning of the year when you initially highlighted a slower funnel. And just trying to square away the 13% installed base growth with the slower funnel and if that's being offset by the 7% higher utilization and how to think about capital in the double placements moving forward.\n\nGary Guthart -- Chief Executive Officer\n\nWhat we're seeing on that side, on the capital side, is that where we see healthy procedure growth, the installed base growth is keeping pace. And you're absolutely right in your question to kind of link utilization growth with installed base growth. On the utilization side, the 7% is higher than the norm. It's got a little artifact in it, we think, which is a year ago, third quarter was a little bit suppressed because of the delta variant.\n\nSo, I think it's hard to keep doing 7% quarterly. If the customers could do that, we'd be delighted. It's -- utilization is good for them. It's good for us, and it's fine.\n\nIt's just hard to move in a durable way because of all the workflow issues in the hospital at large, not just robotics but just across the system. So, we're seeing both. I think the capital side, what we've seen here is that capital is available to be competed for if you can become a high priority within the hospital to get it. So, it's not so much that the capital environment is easy as it is competitive.\n\nAnd if you can rise on the party list, then we'll find that the loop, and we're seeing that in installed base growth in greenfields and in Ion.\n\nOperator\n\nThank you. And next question from the line of Amit Hazan with Goldman Sachs. Please go ahead.\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nThank you. A couple of questions if that's OK. First, I think maybe just to ask about how you're thinking about the pipeline for more mature procedures. If I heard you right, you were urology and gynecology up high single digits, double digits in the U.S., pretty good numbers.\n\nJust want to make sure those are clean. And then just kind of the typical question about your own sources, external internal customer discussions, just how you're thinking about the diagnostic pipeline for those slower growing cancer procedures and kind of where we are or where we're heading relative to the trough levels that were observed last year.\n\nGary Guthart -- Chief Executive Officer\n\nOK. On the issue of kind of the quality of growth on urology and gynecology, Brian, I'm going to kick that to you.\n\nBrian King -- Treasurer and Head of Investor Relations\n\nSure. And I think Gary touched on it on the previous answer, an element of that being just a comparison period from last year. But still seeing really healthy growth in those particular categories. As I called out, growth in gynecology, which is our second largest procedure category, did have, I'd say, double-digit growth probably in the lower end there and then those more mature urologic procedures being those high single digits, but it's really favoring from the comparison from last year but still doing really well.\n\nJamie Samath -- Chief Financial Officer\n\nOn the diagnostic pipelines, what we continue to see for the most part is relatively steady in terms of the tests that are occurring mostly a little below the volumes that we saw pre pandemic. The one exception that we've seen in the U.S. in kind of recent trends is a tick-up in colonoscopies. I wouldn't say that this evidence that that's impacted da Vinci procedures yet as that's a recent trend.\n\nObviously, we're encouraged by the fact that more patients are able to get back to having those diagnostic tests, and we'll see how that plays out in terms of surgery.\n\nGary Guthart -- Chief Executive Officer\n\nOn just a follow-up point to Brian, your answer, I think the other thing is that while we're mature in urology and gynecology in the United States, there's still a little growth there, too. But outside the United States and Europe and Asia, we are still relatively early, and we think that in those two categories, we'll continue to see growth. Jamie, just a follow-up point on your answer on the diagnostics side. You were saying it started to come back, and we're seeing a little bit of an uptick.\n\nIt is absolutely clear that there's been a trough or a bolus of people who stayed out of diagnostic pipelines, and that hasn't fully recovered. And their disease is progressing. That is also absolutely clear in the literature. So, how big that is and what that looks like as they come back into the health system in terms of surgery and da Vinci surgery, you're just going to have to wait and see.\n\nIt's a hard thing to measure. But I think there's a bolus out there, and it's unfortunate given disease progression.\n\nOperator\n\nThank you. And next, we have a question from the line of Larry Biegelsen with Wells Fargo. Please go ahead.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nGood afternoon. Thanks for taking the question and congratulations. Just two for me. I wanted to start, Gary, with the color commentary you gave on opex spending next year.\n\nIf we look at the last five years, you grew EPS faster than sales -- or pre COVID, I'm sorry, four to the five years, this year, it looks like earnings will probably be down. How much of a priority is EPS growth? And what would need to happen for you to get back to the algorithm where you grew EPS faster than sales? And I have one follow-up.\n\nGary Guthart -- Chief Executive Officer\n\nYou know, we watch it. We want to make sure that we're efficient stewards of our expenses and our capital. And where we see an efficiency, we'll pursue it. That's what I've been messaging and that's what I was talking about here in the script.\n\nWe think there are opportunities for us to increase our productivity and to do a better job onboarding from the staff we've brought in, helping them become more productive more quickly. We think there are really good opportunities in our new platforms, the things we've been talking to you about. Ion is growing nicely. SP, as we pursue additional indications, I think will be quite strong and we're pleased with multiport currently what's in the market, the things we're working on, as well as our digital tools.\n\nSo, we think those things are important. We don't want to starve them, but we will sequence them. So, it's a balanced approach. Some of it is making sure that our growth engines remain intact, and we continue to innovate.\n\nOther parts are just making sure that we're being efficient with our use of capital and that we're building a lean organization as we grow. Jamie, you can speak a little bit to the expense characterization as you see it.\n\nJamie Samath -- Chief Financial Officer\n\nThere's just a couple of framing comments I'd make, Larry. If you look at the midpoint of the procedure guidance we provided, on a three-year CAGR basis, that's procedure growth of about 15%. Just over 15%. You do the same for our opex guidance, that's just under 15%.\n\nSo, kind of back to 2019 on a three-year CAGR basis, procedure growth and spending growth relatively in line. Just one other thing I'd highlight to make a point. If you look at the reported revenue growth for Q3 and 11% year over year, if you look at our recurring revenue growth, that's about 80% of our total revenue, 16%. If you adjust that on a constant-currency basis, it's 20% revenue growth.\n\nAnd so, comparable with the 20% procedure growth. When you look back at '18, '19, generally, procedure growth and revenue growth are relatively similar. You're seeing a disconnect right now for the reasons we've described the lower trade-in volumes, trade-in volumes so far this year are down 40% from the prior year, and you're seeing the impact of FX, as we've described. And so, there are some macro and secular level impacts on what's happening in the P&L this year.\n\nSpecifically, on spending, we kind of described it in the script. There are some infrastructure investments that we've been making that start to complete, and that creates the opportunity for us to spend at a lower growth rate. And given the work that we've done and the investments that we've made, we are going to look for some leverage in our enabling functions, particularly as we get into next year. Final thing that Gary mentioned was as you look at kind of our pipeline, there's some natural sequencing that you'll do with respect to some of our programmatic spending next year.\n\nAnd those factors play into the slowing operating expense growth rate that we've described.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nThat's super helpful. If I could sneak one in -- one more in. Gary, you've talked about a huge amount of variation in surgery around the world. You've talked about developing tools to identify best practices to reduce the variation and improve outcomes.\n\nWhere are you in that process? And what are the capabilities you still need to develop to make that a reality? Thanks.\n\nGary Guthart -- Chief Executive Officer\n\nYeah. I love that question. There's a couple of things. On the kind of the baseline, you need to gather enough of the right data to characterize variability of care teams and variability of patients.\n\nSo, there's a patient population, it's got variability, and you've got care team or physician variability as well. And getting the right data streams, getting them stored and figuring out how to do the right kind of assessment or analysis on them, curating that data, making sure it's annotated properly. Some basic stuff that you have to do to be able to look for meaningful sources of variation. We're well down that pathway in terms of getting the right data streams, having the right conversations with our customers, and starting to do the analysis.\n\nSo, I'm excited by it. As we look at how to deliver that, we're still in a, I think, surgical science discovery phase. We are partnered with many of the top hospitals, academic hospitals around the world looking at surgical data science, starting to figure out sources of variation, and drawing it back to causality, not just correlation. So, I think -- the baseline is there, the ability to collect and gather that data.\n\nI think our relationships with top-tier researchers are in place, and we're starting to see early signals that look really good. Final point I'd make is there are some basic things we can do that are logical and not extraordinarily complicated that can help personalized learning pathways and training pathways, and we're starting to work through that now. That's kinds of technologies that will come out into the field first. So, I think it was a long-term journey.\n\nSome of the things we talked to you about Intuitive Hub or some of the baseline capabilities there in terms of the right data collected, annotated the right way, and shared with the right hospital customers to get us good outcomes.\n\nOperator\n\nThank you. Next, we have Robbie Marcus with JPMorgan. Please go ahead.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for taking the question and my congratulations on a nice quarter. Maybe just to dial in a little bit more on the capital equipment environment. You touched on this, and it's great to see procedures driving placement volumes.\n\nBut are you seeing any changes, whether it's in the U.S. or Europe as we're in an uncertain economic environment around the world, it's clearly not showing up in the numbers yet, but just seeing if there's any rate of change or if the outlook is any different than the current environment? Thanks a lot.\n\nJamie Samath -- Chief Financial Officer\n\nJust a couple of things I'd highlight. As we've spoken to customers, and this is mostly anecdotal, you do see some input that staffing pressures are easing a little bit, particularly with respect to vacation rates and labor costs. Those two factors are still way above pre-pandemic levels, but you see a little bit of improvement in the quarter, at least based on both those anecdotes and the survey work that we've seen. In Q2 and Q3, you saw customers going through the process of reexamining their capital budgets, and that causes some delays in capital investments and obviously, they reprioritize what they invest in.\n\nI think robotic surgery is still an area of potential value for customers. That does cause some delays. On the OUS side, we haven't seen a significant impact yet so far in terms of capital spending by those customers. Generally, we are at earlier stages of adoption.\n\nThe payer structures are different. And so, so far, at least, what we've seen is kind of nice capital numbers in the OUS markets, as you can see from the kind of comparisons. If you look at European placements in Q3, they were up 15%. Placements in Asia were up 36% year over year.\n\nSo, we haven't seen anything so far. I would say there are obviously economic risks, particularly in Europe with the energy situation there, the situation with Ukraine and Russia. We haven't seen those manifest yet.\n\nOperator\n\nThank you. And next, we have a question from the line of Richard Newitter with Truist. Please go ahead.\n\nRichard Newitter -- Truist Securities -- Analyst\n\nHi. Thanks for that. Thanks for taking my question, and congratulations on the quarter. Just with respect to the spending sequencing comments that you made, what should we be thinking about that with respect to implications or kind of a next-gen console system and some of the other types of iterative technology advancements you've talked about in the pipeline? Is there any implication for a new system, if you will, or extend console in the cadence of the spending you're talking about [Inaudible]?\n\nGary Guthart -- Chief Executive Officer\n\nYou know, across the platforms, we work on improvements to the robot system side or full innovation there. We work on instruments and accessories and software updates and sometimes partnered product. In general, we maintain our priority and our cadence on those things that we think are going to have the biggest impact to our customers that allow them to get better outcomes or to address new opportunities that they're not addressing today. We continue to invest and have a high priority on quality improvements and things that will make our customers more satisfied.\n\nSome other things that tend to be great ideas, but perhaps are not highly urgent, then those things will sequence out. And that's a conversation we routinely have. What do we have to do at high priority and do it at high quality quickly? What are the things that can sequence after that? So, hard to answer your question in detail from a process point of view. If it matters a lot to our customers, if it's a high dissatisfier or high opportunity, those things get put in line first.\n\nOperator\n\nThank you. And next, we have the line of Jayson Bedford with Raymond James. Please go ahead.\n\nJayson Bedford -- Raymond James -- Analyst\n\nHi. Good afternoon. Thanks for taking the question. One topic that I thought was interesting.\n\nYou mentioned ablation technology with respect to Ion and starting a trial in Germany. Can you talk a bit more about the technology and the size and scope of the trial and maybe any type of timeline you can offer in the U.S. in terms of starting a trial?\n\nGary Guthart -- Chief Executive Officer\n\nWell, I'll talk a little bit about the motivation. In terms of the details of the trial, I don't have them at our fingertips, but our team can respond to that in a future call. Here we know that Ion can navigate in deep into the lung, we know that surgeons and interventional pulmonologists want to treat tissue there. They want to be able to engage with it one way or another.\n\nSo, ablative technology can be used for a couple of different disease states, and we have high interest in that, whether it's inoperable cancer or whether it's something for emphysema or chronic bronchitis. So, being able to navigate there with an energy source will ultimately be important. The first one that we're talking about here, I believe, is a microwave energy source. There are some other energy sources that people are interested in.\n\nIn some cases, we're developing it ourselves. And in several other cases, we're partnering with others. And we think that will open the door to additional indications for Ion in the lung and elsewhere. We're pretty excited about it.\n\nApologies for not having the details of the trial at our fingertips, but I imagine our team will get that to you in the future.\n\nOperator\n\nThank you. And next, we have the line of Matt Taylor with Jefferies. Please go ahead.\n\nMatt Taylor -- Jefferies -- Analyst\n\nHi. Thanks for taking the question, and congrats on a nice quarter. I wanted to get some updated thoughts. You've been asked a little bit about this in the recent past and on this call, but maybe you could give us some feedback on how you're thinking about capital spending from hospital customers going into recession and thinking about how this one could compare to what you've seen in the past with some of the different cycles that the company has gone through over a longer period of time? Maybe do some compare and contrast and talk about the demand environment that you see out there and how you're going to compete for other priorities for capital.\n\nJamie Samath -- Chief Financial Officer\n\nJust with respect to prior cycles, and this one actually, Matt, is a little interesting in so far as we indicated in Q1, we saw some softness in the capital pipeline in Q1 and Q2, and to some extent, that continued in Q3. If I look back at prior cycles in 2008, you saw three quarters of a year-over-year decline in capital placements. 2013, I think we saw five quarters in a row of declining capital placements. And then when COVID hit in 2020, again, three quarters in a row.\n\nI only give those as reference points. I don't think we can say that those are indicative as to what may happen if and when there's a recession in the U.S. or beyond. So, I think, honestly, if you look at the progression of the economic projections, it's pretty complex and hard to call at this point.\n\nSo, we just give those historical reference points.\n\nGary Guthart -- Chief Executive Officer\n\nTwo comments for me. Of course, the occurrence, the depth, and the shape of a recession, impossible for us sitting at this table to predict. What I can talk about is how the conversations with hospital executives have gone. I think in general, their perspective is to serve their patient population as best they can with technologies that will get the outcomes they want at the price points they want.\n\nI think we've been doing well with that. I think both on the product side and our ability to demonstrate economic viability and contribution margin gains for hospitals has been powerful. And I think that gives us some strength going into the future. That said, depending on how hard and deep it is, then it becomes a question of what they want to offer their patient population and what kind of decisions they're going to have to make.\n\nI also think that relative to past cycles, Intuitive has a couple of more tools in the toolbox in terms of leasing portfolios and some other things. Hard to predict where it will go. I think our ability to both demonstrate value and adjust to capital placement models, it's a little stronger than it was in past years.\n\nOperator\n\nThank you. And next, we have Adam Maeder with Piper Sandler. Please go ahead.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nHi. Good afternoon. And thank you for taking the question, and congratulations on a nice quarter. I wanted to ask about Ion, which if I'm looking at it correctly, had a record placement for installs with also some very nice volume trends.\n\nSo, Gary or Jamie, can you just talk about kind of what's driving that inflection in system placements? And then you referenced the PRECIsE data that was presented at CHEST, I think, earlier today, as well as the journal publication coming next year. Just talk about any potential impact to adoption looking forward. Thank you.\n\nGary Guthart -- Chief Executive Officer\n\nI'll jump in and Jamie, you can help. I think we're still in the early market. We're pleased with the growth and the customer feedback that we've been getting the -- and when we talk to them and survey our customers, their satisfaction levels are very high with the Ion product. I think it's driven by a couple of things.\n\nThe preliminary data that's come out of the PRECIsE trial that's already been talked out and now the later data, I think, was attractive to the customer base. I think the other thing going on is that as we've installed additional sites and helped them bring their programs up, I think they're able to replicate that data. I think that it's being commonly adopted. And I think that is having a compounding effect.\n\nThe idea that the early publications are being repeated in the hands of new teams that are coming on board gives them confidence. And this is a little bit of word of mouth among the pulmonology community, gives them confidence that they can get what's being published. And I think that's been strong for us. Jamie, any comments?\n\nJamie Samath -- Chief Financial Officer\n\nI would just say there's some endorsement of the architectural choices that we made with respect in particular to the diameter of the catheter, which makes a real difference to diagnosis of smaller lesions, and you see that in the clinical data. I think that the engineering and the commercial teams have really executed really well through the period since we launched the product. And I do think that there's a halo effect of kind of word of mouth across IPs and users of the product. And I think in combination with clinical data, that's had a positive effect on our progress so far.\n\nI wouldn't characterize how we've progressed so far as an inflection specifically. I think we've made continued progression.\n\nOperator\n\nThank you. Next, we have the line of Matt Miksic with Barclays. Please go ahead.\n\nMatt Miksic -- Barclays -- Analyst\n\nGreat. Thank you so much for taking the question. And, you know, it is a progressive quarter, so congrats on that as well. I just wanted to follow up on a couple of things you talked about in terms of the macro factors kind of affecting the market and your customers and your business a little bit, one being kind of the staffing challenges that some of these centers are facing.\n\nCurious how that is at all is affecting the way either procedures are coming back or demand for system is evolving here. And then into '23, just curious some of the costs that you've talked about, everyone's talked about -- I know it's early to ask this kind of question, but your thoughts at this point as to how we should think about those costs evolving in '23, it's either sort of rising and staying or rising and then being able to be managed down or just in terms of your cost structure and how it's increased? Any thoughts you have would be greatly appreciated.\n\nJamie Samath -- Chief Financial Officer\n\nMaybe the second part of the question, I'll take, Matt. So, we're not going to give anything specific with respect to '23 numbers. We'll wait until January to do that when we conventionally provide guidance. I think what we've said with respect to operating expenses in 2023 for the reasons Gary described, the growth rate for that spending will be lower than the growth rate that we experienced in 2022.\n\nAnd a significant component of that is the number of people that we will hire next year. And again, what Gary described was given the employees that we've hired, there's a period here where we're going to ensure that we effectively onboard those new hires and get them to a state of productivity, and this will be a period for us to go through that kind of absorption phase. I'll let Gary respond to the first part.\n\nGary Guthart -- Chief Executive Officer\n\nYes. Matt, could you -- I'm sorry, I just missed a little bit of that first part of the question. Can you just restate that one?\n\nMatt Miksic -- Barclays -- Analyst\n\nSure. Just in the context of factors affecting the -- you have some flows recovery, what have you of procedures and system -- new system trends, how staffing -- hospital staffing or challenges there are affecting those trends in your business, if at all?\n\nGary Guthart -- Chief Executive Officer\n\nYes, fair question. It's interesting. I think there's a put and a take there. On the tough side, of course, if hospital staffing is really challenged, particularly as it relates to OR staff, that can limit procedures that they'll perform.\n\nIn general, I think that folks are paying more to get OR staffed, recognizing they want to both treat those patients and it's important to the revenue line of the hospital. So, it's primarily inflationary pressure as it relates to what's happening in the OR in our space. The interesting part is that high-quality MIS, minimally invasive surgery, of which we enable helps to offset some of the staffing requirements post-surgery. It's quite clear, actually.\n\nSo, if they can do the procedure then the types of surgeries we do, it will save them some back-end costs in staffing. So, there's a little bit of a seesaw there. So, far, I don't think it's improving in terms of staffing constraints very quickly. It does sound like it's stabilized and maybe on the slight upside of improvement.\n\nOperator, we have time for one more question.\n\nOperator\n\nAll right. We have the line of Drew Ranieri with Morgan Stanley. Please go ahead.\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nHi. Thanks for taking the questions. Gary, just maybe on Ion. Can you -- I know it's early days as you're kind of building the cells commercially, but a couple of questions.\n\nOne is, are you supply constrained at all from meeting demand? And then can you just give us a sense of maybe where you are in account penetration for Ion, whether it's to interventional pulmonologist or at a hospital level? Thank you.\n\nGary Guthart -- Chief Executive Officer\n\nOn the supply side, we are working extremely hard to meet demand on the capital side. I think we're about there. We're pretty close, pretty close to balanced. I don't think we're way ahead or way behind.\n\nAnd likewise, on the consumable or per procedure side, we are working extremely hard to meet demand. And I think we're slightly behind, not way ahead and not way behind. We're probably running close but pushing hard to keep growing. So, on the penetration side, I think we're a little bit early to go into share mix and things like that, I think we're not quite ready to describe where we are either on the account side or on the pulmonology side.\n\nSo, we'll save that for a future call. Anyway, thank you. That was our last question. In closing, we continue to believe there is a substantial and durable opportunity to fundamentally improve surgery and acute interventions.\n\nOur teams continue to work closely with hospitals, physicians, and care teams in pursuit of what our customers have termed the quadruple aim: better, more predictable patient outcomes, better experiences for patients, better experiences for their care teams, and, ultimately, a lower total cost of care. We believe value creation in surgery and acute care is foundationally human. It flows from respect for and understanding of patients and care teams, their needs, and their environment. At Intuitive, we envision a future of care that is less invasive and profoundly better, where diseases are identified earlier and treated quickly so patients can get back to what matters most.\n\nThank you for your support on this extraordinary journey. We look forward to talking with you again in three months.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian King -- Treasurer and Head of Investor Relations\n\nGary Guthart -- Chief Executive Officer\n\nJamie Samath -- Chief Financial Officer\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nRichard Newitter -- Truist Securities -- Analyst\n\nJayson Bedford -- Raymond James -- Analyst\n\nMatt Taylor -- Jefferies -- Analyst\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nMatt Miksic -- Barclays -- Analyst\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nMore ISRG analysis\n\nAll earnings call transcripts"
}