{
  "companyName": "Paycor HCM, Inc.",
  "companyTicker": "PYCR",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/paycor-hcm-inc-pycr-q1-2023-earnings-call-transcri/",
  "content": "Paycor HCM, Inc. (PYCR -0.20%)\nQ1 2023 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to Paycor's first quarter fiscal year 2023 earnings call. [Operator instructions]. As a reminder, this conference is being recorded. I'd like to turn the call over to Rachel White, vice president of investor relations.\n\nPlease go ahead, ma'am.\n\nRachel White -- Vice President, Investor Relations\n\nGood afternoon, and welcome to Paycor's earnings call for the first quarter of fiscal year 2023, which ended on September 30. On the call with me today are Raul Villar, Jr., Paycor's chief executive officer, and Adam Ante, Paycor's chief financial officer. Our financial results can be found in our press release issued today, which is available on the investor relations section of our website. Today's call is being recorded, and a replay will be available on our website following the conclusion of the call.\n\nStatements made on this call include forward-looking statements related to our financial results, products, customer demand, operations, the impact of COVID-19 on our business and other matters. These statements are subject to risks, uncertainties and assumptions and are based on management's current expectations as of today and may not be updated in the future. Therefore, these statements should not be relied upon as representing our views as of any subsequent date. We also will refer to certain non-GAAP financial measures and key business metrics to provide additional information to investors.\n\nDefinitions of non-GAAP measures and key business metrics and a reconciliation of non-GAAP to GAAP measures is provided in our press release on our website. With that, I'll turn the call over to Raul.\n\nRaul Villar -- Chief Executive Officer\n\nThank you, Rachel, and thank you all for joining us to discuss Paycor's fiscal first quarter results. Revenue growth reached 28%, the highest level in over five years as we expand our go-to-market motion. We also continue to scale our operations and delivered more than 500 basis points of margin improvement year over year. Based on this strong momentum, we are once again raising our guidance, which Adam will cover in more detail.\n\nWe are executing against our go-to-market strategy and continue to make significant progress expanding our sales coverage and growing platform. Competitive dynamics have been consistent, demand remains strong, and we had our best Q1 on record. We continue to target increasing sales head count over 20% for the fiscal year. With established sellers in all Tier 1 markets today, our ongoing focus is on expanding coverage in Tier 1 markets.\n\nWith the opportunity more than triple our sales team, we have significant runway to add sellers for the foreseeable future. While it's still early, we are really pleased with how both the Bengals and Pac-12 sports sponsorships are increasing brand awareness and ongoing new business development. Paycor's modern open platform is purpose-built for leaders and configured by industry, a combination that continues to win in the market. A recent Gartner survey identified leader and manager effectiveness as a top priority among CHROs for 2023.\n\nThis quarter, we are excited to announce two key differentiators for leaders, the COR leadership framework and Talenya's award-winning candidate sourcing technology. The COR leadership framework empowers organizations to transform frontline managers into effective leaders. The framework is built on the understanding that effective leaders focus on coaching employees, optimizing performance and retaining top talent. We provide organizations with the means to evaluate the efficacy of their frontline leaders and the tools and thought leadership needed to improve leader performance.\n\nWe continue to add leapfrogging innovation to our HCM suite and are thrilled to have acquired Talenya's intelligent candidate sourcing technology to enhance our industry-leading talent solution. The AI-powered recruiting technology will be unified into our platform, making it easier for frontline leaders to find skilled and diverse talent quickly and at significantly lower cost. Talenya's solution stands out in that it is fully automated and easy for frontline leaders to use. In today's war for talent, Talenya not only sources candidates that are actively looking to change jobs, but more impressively, passive candidates that are not actively seeking a new role.\n\nThe technology will also help companies execute against their DE&I strategy by placing an emphasis on diverse candidates that are often overlooked by traditional recruiting systems. This acquisition builds on our successful track record of rapidly integrating best-in-class point solutions that provide a competitive advantage and expand our PEPM opportunity. These advancements showcase the versatility of our product strategy. Our modern platform enables us to select whether to build, buy or partner to add valuable functionality, options that are increasingly valuable as focused on leapfrogging technology to further differentiate Paycor in the market.\n\nAs further proof of our product differentiation, we are in the Platinum 2022 TITAN Business Award in the Business Intelligence Solution category for Paycor Analytics. We are increasingly focused on providing leaders with intelligent analytics that deliver valuable insights to drive business performance. For example, predictive resignation provides leaders with the insights to identify the top drivers of employee resignation and potential at-risk employees to help prevent turnover. In addition, we provide many analytics that are critical to helping our key industry to manage time and labor, such as over time or scheduled analysis by tenure.\n\nIn September, we published our first ESG report describing Paycor's commitment to sustainable business practices and ongoing efforts to address material ESG topics. I am particularly pleased we increased the representation of females in leadership and ethnic diversity among our associates by 8% and 13%, respectively. And reduced our Scope 1 and Scope 2 emissions by 14% year over year. We are incredibly proud Paycor won 2022 Top Workplaces Culture Excellence Awards in diversity, equity and inclusion practices, innovation, and compensation and benefits categories by Energage.\n\nThis is the second consecutive year Paycor has been recognized for DE&I excellence. Over the past fiscal year, Paycor has continued to advance its DE&I strategy, enhanced associate rewards, expand benefit options and have innovation. In terms of the labor market, dynamics remain unchanged. Nonfarm payrolls have slowly risen to pre-COVID levels.\n\nJob openings remain at elevated levels. And the labor market continues to be tight. Modest changes in unemployment or job openings are unlikely to materially impact our business as most of our revenue growth is derived from new logo additions and the market is still very early in adopting modern cloud-based HCM solutions, plus HCM is highly defensible as our value proposition is mission critical to attracting paying and retaining great talent. Lastly, I would like to thank all the amazing PayCornians who are the foundation of these amazing results.\n\nWith that, I'll turn the call over to Adam to discuss our financial results and guidance.\n\nAdam Ante -- Chief Financial Officer\n\nThanks, Raul. I'll review our first quarter results, then share our outlook for the second quarter and fiscal year. As a reminder, my comments related to financial measures are on a non-GAAP basis. Total revenue for the quarter was $118 million, increasing 28% year over year, our highest and recent record.\n\nExcluding the impact of interest income, recurring revenue grew by 24%. We exceeded the top end of our revenue guidance by 4% and significantly outperformed our adjusted operating income guidance through diligent investment management. Revenue growth was primarily driven by new business and cross-sales, PEPM expansion, strong execution of pricing initiatives and growth of our partner program. Pricing initiatives include conversion of clients to our newest product bundles and continued higher adoption of our bundles at the point of sale.\n\nThe number of employees on our platform increased to more than 2.3 million, up 10% over the prior year. Our average customer size increased to 78 employees at the end of Q1 compared to 73 a year ago as we continue to focus our investment in the mid-market and accelerate growth among clients with more than 100 employees. Net retention trended favorably, benefiting from price initiatives and continued cross sales. Adjusted gross profit margin improved to 66.3% versus 65.2% a year ago.\n\nAdjusted gross margin, excluding depreciation and amortization was 76.8%, an increase of nearly two points year over year. The expansion was a result of increased scale across our support team and lower third-party costs. Sales and marketing expense was $40 million or 34% of revenue, slightly below 35% a year ago. Based on the continued demand and attractive returns we're seeing, we continue to invest in our sales expansion strategy and marketing programs to drive new business growth and capture market share, primarily in Tier 1 markets.\n\nOn a gross basis, we invested $19 million in R&D or 16% of revenue, slightly lower than 17% a year ago and in line with our long-term targets. Our team continues to efficiently add new functionality through organic development, partnerships and best-in-class product tuck-ins that create value for our clients and expand our PEPM opportunity. G&A expense was $18 million or 15% of revenue, down from 18% in the first quarter of '22. We intend to progressively drive G&A down as a percentage of revenue as we scale the business, consolidate our facilities footprint and anniversary public company costs.\n\nWhile our primary objective remains sustainable 20% plus revenue growth, we intend to steadily expand margins as we scale the business. This quarter, we increased operating income to $10.4 million or an 8.8% profit margin, more than double the 3.7% last year. The greater-than-500-basis-point expansion enabled us to deliver adjusted EBITDA margins of 24%. And when combined with our 28% revenue growth exceed the rule of 50 this quarter.\n\nShifting to the balance sheet and cash flow. This quarter, free cash flow was a negative $30 million compared to a negative $24 million last year. The first quarter tends to have the largest use of cash due to the timing of our annual bonus payment. In addition, this quarter, we made our first naming rights payment, which covered the full year and will be made quarterly moving forward.\n\nHowever, we plan to be free cash flow positive for the full fiscal year and going forward. We ended the quarter with $98 million in cash and no debt. This quarter, we generated $4 million of interest income on average client funds of approximately $920 million. As overnight rates began benefiting from recent Fed rate increases, our overall effective rate more than tripled to 178 basis points this quarter compared to 52 basis points last quarter.\n\nInterest income exceeded our expectations as overnight rates reflected Fed fund raises faster and more completely. Turning to our outlook for fiscal 2023. We continue to be positive about the momentum in the business, strong demand environment and Paycor's leadership position in the HCM market. The labor market has remained tight.\n\nAnd while we continue to closely monitor the macro environment, we have not seen any material impact to our business. Our guidance assumes these trends continue for the remainder of the year. While we are enthusiastic about integrating Talenya's innovative technology into our platform and expanding our PEPM opportunity, we expect it to be immaterial to the financials this fiscal year. We generated about 180 basis points of interest income in the first quarter and expect that rate to increase further in the second quarter.\n\nAt today's rates, we anticipate interest income will be in the range of $20 million to $24 million for the full year on average client fund balances of just under $1 billion. We currently plan to reinvest about half of interest income and to either accelerate our product road map or expanding our marketing programs to support our sales expansion. For the second quarter, we expect total revenue of between $126 million and $128 million or 24% growth at the high end of the range and adjusted operating income of between $12.5 million and $13.5 million. For the full year, we expect revenue of $528 million to $534 million or 24% growth at the top end of the range, and we anticipate adjusted operating income of $65 million to $68 million.\n\nIn summary, we continue to deliver strong top line growth while expanding profitability. We are winning share in the SMB segment through our differentiated platform focused on leaders and industries. Our team is laser-focused on execution, Tier 1 market penetration and continued PEPM expansion. With less than 2% share of our $29 billion total addressable market, we have significant runway for continued growth and remain enthusiastic about the trajectory of the business.\n\nWith that, we'll open the call for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question is from Gabriela Borges of Goldman Sachs. Please go ahead.\n\nUnknown speaker\n\nThis is Kevin on for Gabriela. Thanks for taking my question. I wanted to ask about ramping up sellers hired last fiscal year. What are you seeing in terms of early trends in terms of the time to ramp, particularly in the Tier 1 market? Thanks.\n\nAdam Ante -- Chief Financial Officer\n\nYeah. Hey, thanks. We're seeing -- what we like to track is we like to track those sellers on a cohort basis and look at the sellers who've been here for four quarters or five quarters to compare them to previous cohorts. And it's still really early, but we're adding closer to 70-plus sellers in each of those cohorts, and they continue to perform like they have historically.\n\nWe'd love to always -- there's always room for improvement, but we've seen good performance out of those larger cohorts that we've been hiring more recently for sure.\n\nUnknown speaker\n\nThat's helpful. And then, Adam, can you talk a bit of the levers for gross margin expansion going forward, particularly as you broaden the HCM suite and as PEPM continues to increase?\n\nAdam Ante -- Chief Financial Officer\n\nYes. One of the things that we see is that when you add additional products and when clients are buying more products from us, they're more effective in the gross margin increases. So we just, for new products, like our talent management solution, you just don't have to put the same level of service in terms of calls and callbacks in management and service operations that you do with payroll. Payroll is the largest part of our service and service operations.\n\nAnd so when we add these additional products, it really helps to drive additional margin, and as well as we continue to into the larger segments out of the micro segment, we do see that those clients, they tend to buy a little bit more. They tend to be more effective in the way that they use the product. And so the margins tend to come on a little bit better. That's going to be the primary driver.\n\nUnknown speaker\n\nGreat. Thank you.\n\nOperator\n\nOur next question is from Terry Tillman of Truist Securities. Please go ahead.\n\nRobert Dee -- Truist Securities -- Analyst\n\nGreat. Thanks so much for taking the questions. This is Robert Dee on for Terry. Hoping to get a little more detail and an update into the micro segment.\n\nCan you remind us on the mix of business there? Is that segment to hold steady or perhaps becoming smaller from growth with bigger mid-market customers? And how are you all thinking about the segment in terms of overall economic sensitivity? And then I have one follow-up. Thanks.\n\nAdam Ante -- Chief Financial Officer\n\nYes. I mean it's really just not material, a move, marginal moves in that micro segment. It represents about 5% of our total portfolio in terms of revenue. And we have seen that that's slowed down in terms of the growth of the companies in that segment as we are intentionally not investing quite as much in that under 10 segment.\n\nBut we do continue to drive revenue growth actually in that segment. It's held fairly steady in terms of that 5% of total revenue or so. I'd say in terms of the sensitivity, we do expect that sort of in the larger ends, the micro segment and then the large enterprise segment is where we would see maybe more sensitivity to macro changes. But again, it's just so marginal in terms of its overall impact on our portfolio.\n\neven large swings wouldn't really impact us.\n\nRobert Dee -- Truist Securities -- Analyst\n\nMakes sense. And then just as a quick follow-up. Last quarter, I believe you'll mention strong across industries, particularly in the restaurant and food services segments. Is that momentum still continuing? Or have any other specific verticals taken more of the spotlight this quarter?\n\nAdam Ante -- Chief Financial Officer\n\nYes. No. I mean that trend has continued. It is sort of dependent on -- we don't seasonally adjust our hiring or employee count.\n\nSo you do see slightly more growth in sort of the seasonal peaks and whatnot. But those trends have continued and they have outperformed sort of outsized and in line with what you'd see in the broader market, as well as hiring has continued to be tight in the labor market more broadly.\n\nRobert Dee -- Truist Securities -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nOur next question is from Brian Bergin of Cowen. Please go ahead.\n\nJared Levine -- Cowen and Company -- Analyst\n\nIt's actually Jared on for Brian tonight. In terms of the 1Q adjusted gross margin, it flows there, it looks like it was flat year-on-year. Was that in line with your expectations? And what are you expecting for the full year for adjusted gross margin?\n\nAdam Ante -- Chief Financial Officer\n\nYes. We haven't guided to adjusted gross margin on a full year basis, but we actually did drive some expansion if you back out interest income and look at it on a recurring basis. We did still drive some expansion across the board. So across adjusted gross margin, as well as adjusted operating income.\n\nAnd again, I really think the best metric to look at for our gross margin is excluding depreciation and amortization, and we drove multiple points of expansionary without the benefit of interest income. And that is our long-term goal is to continue to drive expansion across the business. So like I said, we haven't guided specifically to gross margin improvement, but we're going to continue to look at that as an opportunity.\n\nJared Levine -- Cowen and Company -- Analyst\n\nOK. Great. And then in terms of that updated full year flow revenue guidance, does that include the most recent Fed funds rate hike from today or any additional rate assumptions there?\n\nAdam Ante -- Chief Financial Officer\n\nNo, it includes the 75 basis points from today and it doesn't include any potential future raises.\n\nJared Levine -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nNext question is from Mark Murphy of J.P. Morgan. Please go ahead.\n\nArti Vula -- JPMorgan Chase and Company -- Analyst\n\nHey, guys. Thanks for taking the question. This is Arti on for Mark Murphy. Just a quick question on Talenya, it looks like an interesting acquisition.\n\nIn terms of the focus of the company there, is that kind of focused toward any particular customers or maybe frontline workers, blue collar, white collar, etc.?\n\nRaul Villar -- Chief Executive Officer\n\nYes. It's primarily today focused on professional services. And so I think we'll continue to leverage that in our professional services and healthcare verticals. I think over time, we'll be able to also identify more use cases for hourly employees, to identify hourly employees more effectively.\n\nArti Vula -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then in terms of the NRR, you guys said that kind of moved favorably. Any commentary on gross retention? Is that something you guys expect to improve as you move up the market?\n\nAdam Ante -- Chief Financial Officer\n\nYes. I mean I definitely think that we expect gross retention to continue to improve. It's been relatively stable for some time now and even while we've been driving that retention improvements. So those have been continuing and remain strong coming into '23 now.\n\nArti Vula -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Bhavin Shah of Deutsche Bank. Please go ahead.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nGreat. Thanks for taking my question. A couple of quick ones for me. Just first on the sales front.\n\nI mean you guys talked about adding another 20% growth in sellers, how should we think about the linearity of sales hires over the course of the year? And what does the hiring environment look like today in terms of finding talent?\n\nRaul Villar -- Chief Executive Officer\n\nYes. So we map out hiring. We obviously will hire the majority of the people in the first half of this fiscal year that are in our planned budget growth. And that will enable us to get some minor contribution in the fourth quarter, but to have those people fully ramped up for FY '24.\n\nAnd we've seen no issues identifying, recruiting and hiring sales associates. And so we feel really good about our staffing position in sales today.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nThat's very helpful. And then just on some of your recent sponsorships, you kind of noted increasing top of funnel, what types of customers and perspective customers are you able to bring in? Are there certain types of size customers? Are they more regional focused? Any kind of additional insight there? And kind of how are you thinking about this kind of avenue of marketing going forward?\n\nRaul Villar -- Chief Executive Officer\n\nYes. I think there's two key elements to consider. First is just overall brand awareness. Obviously, we're still trying to build brand awareness nationally as we expand our sales coverage.\n\nAnd in the first quarter alone, we had more digital impressions, over 1 trillion than we did last year as a company. So I think the sponsorships are serving their purpose and really creating air cover for our sales team as we continue to build awareness and expand coverage. And as far as the actual conversion, I think what we've done a great job of is leveraging both sponsorships with game day activations. And so what we're doing is we're seeing significant presence of bringing large prospects in influence centers to the activities, and that's proven to be a winning formula for us.\n\nSo we're really optimistic about the opportunity to continue to drive bookings growth based on these sponsorships. And our early indicators are really favorable, and we're excited to finish both the Pac-12 football season and the Bengal season. And we're leveraging both home games and away games for the Bengals. So it's more than just the Midwestern influence, and I think that's been exciting for us as they've had games this year in New York and Dallas and some of the large Tier 1 markets that we're trying to further penetrate within.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nMakes kind of sense. A quick follow-up on that for Adam, in terms of the cash flow dynamics. So if I'm clear, you have an annual payment this year and then every other year on the more quarterly? Or are there sub-quarterly payments to be paid this fiscal year?\n\nAdam Ante -- Chief Financial Officer\n\nWe made the payment for the first full year for the fiscal year already. And then beginning in '24, they will be quarterly going forward.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nThat's what I thought. I just wanted to clarify my question.\n\nOperator\n\nOur next question is from Scott Berg of Needham. Please go ahead.\n\nScott Berg -- Needham and Company -- Analyst\n\nThanks for taking my questions. Congratulations on the quarter. I wanted to start on the sales environment. As you look back at the new sales in the quarter, is there any difference in, I don't know, maybe the composition of those deals in Q1 this year versus last year, maybe customer size, types of modules they're buying, etc., that might kind of highlight an environment that may or may not be changing?\n\nRaul Villar -- Chief Executive Officer\n\nNo, the environment, Scott, has been really steady. So we're seeing consistent production in our Tier 1 markets from our broker partners and our industry go-to-market strategy. So nothing has changed. We're still running the same plays and winning at an outsized rate in all markets.\n\nSo we feel really good about the -- about our go-to-market motion. And no macro impacts whatsoever in the size of our deals or the number of modules people are purchasing at point of sale.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Helpful. And then a follow-up question on your sales investments for this year. Obviously, a big focus for the company in the last two years is putting new sales heads in these Tier 1 cities.\n\nHow do you think about cross-sells or upsell over time in staffing, maybe further staffing a team or head count in that area versus just adding new heads going after for net new logo acquisition?\n\nRaul Villar -- Chief Executive Officer\n\nYes. We have a centralized team that handles cross-selling, and we continue to invest in that team and continue to drive cross-selling against the legacy base. Obviously, our new clients are coming aboard with two or three modules attached already. So a lot of it is cross-selling back into the legacy base or following up.\n\nAs an example, when we are fully unified to Talenya, we'll be able to cross-sell 20 into the entire client base of 30,000. So we're with you. We're continuing to invest in the cross-selling team, and we're seeing really good results there. And I think you'll see us continue to generate somewhere between 15% and 20% of our bookings will come from cross-sells.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. Thanks for taking my question.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I would like to turn the call back over to Raul Villar for closing comments. Please go ahead.\n\nRaul Villar -- Chief Executive Officer\n\nThank you again for joining us tonight. We're enthusiastic about the accelerated momentum in the business and look forward to connecting with you again soon. As always, feel free to reach out if you have any questions and have a great night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRachel White -- Vice President, Investor Relations\n\nRaul Villar -- Chief Executive Officer\n\nAdam Ante -- Chief Financial Officer\n\nUnknown speaker\n\nRobert Dee -- Truist Securities -- Analyst\n\nJared Levine -- Cowen and Company -- Analyst\n\nArti Vula -- JPMorgan Chase and Company -- Analyst\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nMore PYCR analysis\n\nAll earnings call transcripts"
}