{
  "companyName": "Toro",
  "companyTicker": "TTC",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/21/toro-ttc-q4-2022-earnings-call-transcript/",
  "content": "Toro (TTC -0.05%)\nQ4 2022 Earnings Call\nDec 21, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to The Toro Company's fourth quarter and full-year fiscal 2022 earnings conference call. My name is Josh, and I will be your coordinator for today. At this time, all participants are in a listen-only mode. We will be facilitating a question-and-answer session toward the end of today's conference.\n\nAs a reminder, this conference is being recorded for replay purposes. I would now like to turn the presentation over to your host for today's conference, Julie Kerekes, treasurer and senior managing director of global tax and investor relations. Please proceed, Ms. Kerekes.\n\nJulie Kerekes -- Treasurer and Senior Managing Director of Global Tax and Investor Relations\n\nThank you and good morning, everyone. Our earnings release was issued this morning, and a copy can be found in the investor information section of our corporate website, thetorocompany.com. As a reminder, we have introduced a quarterly earnings presentation, as well as an updated general investor presentation, both of which are available on our website. On our call today are Rick Olson, chairman and chief executive officer; Renee Peterson, vice president and chief financial officer; Angie Drake, vice president, finance; and Jeremy Steffan, director, investor relations.\n\nWe begin with our customary forward-looking statement policy. During this call, we will make forward-looking statements regarding our plans and projections for the future. This includes estimates and assumptions regarding financial and operating results, as well as economic, technological, weather, market acceptance, acquisition-related, and other factors that may impact our business and customers. You are all aware of the inherent difficulties, risks, and uncertainties in making predictive statements.\n\nOur earnings release, as well as our SEC filings, detail some of the important risk factors that may cause our actual results to differ materially from those in our predictions. Please note that we do not have a duty to update our forward-looking statements. In addition, during this call, we will reference certain non-GAAP financial measures. Reconciliations of historical non-GAAP financial measures to reported GAAP financial measures can be found in our earnings release and on our website, in our investor presentations, as well as in our applicable SEC filings.\n\nWe believe these measures may be useful in performing meaningful comparisons of past and present operating results and cash flows to understand the performance of our ongoing operations and how management views the business. Non-GAAP financial measures should not be considered superior to, or a substitute for, the GAAP financial measures presented in our earnings release and this call. With that, I will now turn the call over to Rick.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nThanks, Julie, and good morning, everyone. We were pleased to close our fiscal 2022 with record top- and bottom-line results for both the fourth quarter and the full year. Throughout the year, we benefited from our pricing actions supported by strong demand for our innovative products, especially in our key professional markets. Importantly, we began to see improvements in our supply chain and in our manufacturing efficiency in what remains a very dynamic operating environment.\n\nOur entire organization executed extremely well. We drove operational improvements with lasting benefits and collaborated with our channel partners to support the needs of our customers. For the fourth quarter, net sales were up 22% over last year, and adjusted diluted earnings per share were up 98%. Our revenue and profit growth were driven by pricing, volume gains, and improved productivity.\n\nFor the full year, our top line exceeded $4 billion for the first time, with net sales of 4.5 billion, up 14% year over year. Our adjusted diluted earnings per share were $4.20, up 16%. I'll now highlight our full-year results by segment. For fiscal 2022, on a year-over-year basis, professional segment net sales were up 17%.\n\nWe capitalized on continued broad-based demand and drove pricing actions to mitigate inflationary pressures. We closed the year with substantial backlog levels, most notably in our underground and specialty construction and golf and grounds businesses. With this heightened order book, our top-line results were driven by our ability to produce in what remained a constrained supply environment. Residential segment net sales were up close to 6%.\n\nThis was on top of two prior years of incredible net sales growth, up 23% in fiscal 2021 and up 24% in fiscal 2020. Our actions to introduce innovative new products, refresh brand marketing, and expand distribution have fundamentally reset this business and have positioned it well for the future. Across our organization, we delivered strong performance this year. We executed on key strategic initiatives to capitalize on very positive secular trends in markets where we have leadership positions.\n\nFirst, we strengthened our innovation leadership with technology-forward product introductions. This includes the expansion of our no-compromise battery, electric, and smart-connected offerings across our portfolio. We also introduced autonomous products with industry-first features in our golf and residential businesses. We're excited to develop next-generation solutions to help customers achieve their emission reduction goals while addressing their labor challenges and increasing productivity and precision.\n\nSecond, we prudently deployed capital for sustained long-term growth. This included prioritized investments in research and development and key capital projects, as well as our Intimidator Group acquisition. This acquisition expanded our geographic reach and leadership position in the large and rapidly growing zero-turn mower market. It builds on our history of successful acquisitions enabled by our effective capital allocation and strong balance sheet.\n\nThird, we focused on driving the best outcome for all stakeholders. Our team and channel partners served our customers, supported each other and our communities, and did business the right way. We delivered record net sales and earnings while investing in future growth, returning capital to shareholders, and maintaining financial flexibility. We also continued to live our long-standing commitment to ESG as we established performance goals in our most recent sustainability report.\n\nWe are starting the new fiscal year with great momentum and will continue to execute against our enterprise's strategic priorities of accelerating profitable growth, driving productivity and operational excellence, and empowering people. I'll discuss our outlook further, following Renee and Angie's more detailed review of our financial results and guidance. With that, I will turn the call over to Renee.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nWell, thank you, Rick. And good morning, everyone. As Rick said, we delivered record results for the quarter and full year. These results were driven by continued strong demand, especially across key professional markets, as well as pricing benefits and disciplined execution in what remains a very dynamic operating environment.\n\nWe grew fourth-quarter net sales by 22% year over year to a record $1.17 billion. Reported EPS was $1.12 per diluted share, and adjusted EPS was $1.11 per diluted share, both up from $0.56 in the prior year. For the full year, net sales increased 14% year over year to a record $4.51 billion. Reported EPS was $4.20 per diluted share, up from $3.78 last year.\n\nFull-year adjusted EPS was also $4.20 per diluted share, up 16% from $3.62 last year. Now, to the segment results. Professional segment net sales for the quarter were $944.7 million, up 29% year over year. This increase was primarily driven by net price realization, incremental revenue from our acquisition of the Intimidator Group, and higher shipments of zero-turn mowers, golf and grounds equipment, and snow and ice management solutions.\n\nFor the full year, professional segment net sales increased 17.1% to $3.43 billion and comprised 76% of the total company net sales. Professional segment earnings for the fourth quarter were up 58% to $159 million, and when expressed as a percentage of net sales, 16.8%, up from 13.8% last year. This increase was primarily due to net price realization, net sales leverage, and productivity improvements, partially offset by higher material freight and manufacturing costs and the addition of the Intimidator Group at a lower initial margin relative to the segment average. For the full year, professional segment earnings were $584 million, an increase of 15.1% compared to fiscal 2021.\n\nAs a percentage of net sales, segment earnings were 17%, down slightly from 17.3% last year as a result of the Intimidator acquisition in the first quarter. Residential segment net sales for the fourth quarter were $223.5 million, down about 1% year over year. This was primarily due to lower sales of walk-power and zero-turn riding mowers and portable power products, largely offset by net price realization and higher shipments of snow products. For the full year, residential segment net sales increased 5.8% to $1.1 billion and comprised 24% of the total company net sales.\n\nResidential segment earnings for the quarter were $17.5 million, and when expressed as a percentage of net sales, 7.8%, up from 5.3% last year. The year-over-year increase was primarily driven by net price realization, productivity improvements, and favorable product mix, partially offset by higher material freight and manufacturing costs. For the full year, residential segment earnings were $112.7 million, a decrease of 7.2% year over year. On a percentage-of-net-sales basis, segment earnings were 10.5%, down from 12% in fiscal 2021.\n\nTurning to our operating results. Our reported and adjusted gross margin were 34% and 34.1%, respectively, for the fourth quarter. This was up from 30.1% for both in the same period last year. The increases were largely due to net price realization, productivity improvements, and product mix.\n\nThis was partially offset by higher material freight and manufacturing costs and the addition of Intimidator Group at a lower initial gross margin relative to the company average. For the full year, reported and adjusted gross margin was 33.3% and 33.4%, respectively. This was down slightly from 33.8% for both in fiscal 2021. SG&A expense as a percentage of net sales for the quarter was 21.2%, compared to 22.4% in the same period last year.\n\nThis positive performance was primarily driven by net sales leverage and lower incentive costs. For the full year, SG&A expense as a percentage of net sales was 20.5%, a slight improvement compared to 20.7% last year. Operating earnings as a percentage of net sales for the fourth quarter were 12.8%, compared to 7.7% in the same period last year. For the full year, operating earnings as a percentage of net sales were 12.8%, down from 13.1% in fiscal 2021.\n\nAdjusted operating earnings as a percentage of net sales for the full year were 12.8%, the same as a year ago. Interest expense for the quarter was $11.5 million, up $4.5 million year over year. Interest expense for the full year was $35.7 million, up 7 million. These increases were driven by incremental borrowings to fund the Intimidator Group acquisition and higher average interest rates.\n\nThe reported and adjusted effective tax rates for the fourth quarter were 17.9% and 18.5%, respectively, and for the full year, 19.8% and 20.2%, respectively. Turning to our balance sheet and cash flows. Accounts receivable were $332.7 million, up 7% from a year ago, primarily driven by organic net sales growth and our acquisition of the Intimidator Group. Inventory was $1.05 billion, up 42% compared to last year.\n\nThis increase was driven by higher finished goods, work in process, and service parts. In addition, this includes impacts of inflation and incremental inventory from our Intimidator Group acquisition. We expect our inventory composition and turnover to improve during fiscal 2023 as we manage through this unique environment. Accounts payable increased 15% from last year to $579 million.\n\nThis was primarily due to higher purchase activity and inflation, improved payment terms, and the Intimidator Group acquisition. Free cash flow was $154 million, with a conversion ratio of 35% of reported net earnings. This conversion came in under our expectation largely due to the current supply chain environment, which drove higher investments in work in process and service parts as we focused on putting ourselves in the best position to produce equipment and serve our customers. During fiscal 2023, we intend to improve our work-in-process levels and return to a more normalized inventory composition.\n\nImportantly, our balance sheet remains strong, and our gross-debt-to-EBITDA leverage ratio is well within our target range of 1 to 2 times. We continue to allocate capital with our disciplined approach and the same priorities which include making strategic investments in our business to support long-term, profitable growth, both organically and through acquisitions; returning cash to shareholders through dividends and share repurchases; and maintaining our leverage goals to support financial flexibility. These priorities are highlighted by our actions this year, including our deployment of $143 million in capital expenditures to fund new product investments, advanced manufacturing technologies, and capacity for growth; our $400 million acquisition of the Intimidator Group; the return of $266 million to shareholders through regular dividend payments of 126 million and share repurchases of 140 million; and the paydown of $100 million in debt. These actions, along with our focus on operational execution, continue to position us well for the long term.\n\nWe are pleased to share that our board recently approved a 13% increase in our regular quarterly dividend for the first quarter of fiscal 2023 and added 5 million shares to our repurchase authorization. With that, I'll turn the call over to Angie to discuss our guidance.\n\nAngie Drake -- Vice President, Finance\n\nThank you, Renee, and hello, everyone. Looking ahead to 2023, I'd like to start with some commentary on our $2.3 billion order backlog. Our backlog has remained elevated the past two years, driven by the strong demand we've experienced, coupled with a challenging supply chain environment. In fiscal 2022, we started to see some improvements in our supply chain and continue to adjust our production and operations for efficiencies.\n\nMost of our current backlog consists of orders for underground and specialty construction and golf and grounds equipment. This is where we had the highest level of supply chain disruption. We continue to take measures to ensure pricing is current at the time of order fulfillment, and this provides a strong base for 2023. With that background in mind, along with our current visibility in this dynamic and evolving environment, we're providing the following guidance for fiscal 2023.\n\nFor the full year, we expect net sales growth in the range of 7% to 10%, and we anticipate the return to a more typical quarterly sales cadence with Q2 and Q3 being our larger quarters. For the professional segment, we expect a net sales growth rate higher than the company average. For the residential segment, we expect net sales to be relatively flat. Looking at profitability, for the full year, we expect improvement in overall adjusted operating earnings as a percentage of net sales compared to last year, driven by higher earnings margins in both segments.\n\nWe expect net price realization and productivity improvement to drive year-over-year improvement in gross margin and a higher gross margin in the second half of the fiscal year compared to the first half. With this backdrop, we anticipate full-year adjusted EPS in the range of $4.70 to $4.90 per diluted share. This adjusted EPS estimate excludes the benefit of the excess tax deduction for stock compensation. Turning to the first quarter.\n\nWe anticipate a total company Q1 net sales growth rate that is meaningfully higher than our full-year expectations. We expect this to be driven by our professional segment, which will include the impact of incremental revenue from our 2022 acquisition of the Intimidator Group. We expect residential segment net sales to be relatively flat. Looking at profitability.\n\nFor the first quarter, we expect modest improvement in gross margin and a similar SG&A rate, both compared to last year. We also expect higher interest expense in the quarter year over year, given the incremental debt to fund the Intimidator Group acquisition and higher interest rates. Looking at segment profitability for the first quarter. We expect the professional margins to reflect an incremental expense of about $5 million as a result of our inventory valuation methodology and the timing of inflation.\n\nWith this, we expect the professional margin to be down sequentially compared to the fourth quarter of fiscal 2022, but still higher year over year. We expect the first-quarter residential earnings margin to be similar year over year. Overall, we expect our first-quarter fiscal 2023 adjusted EPS per diluted share to be higher than last year, but down sequentially from the fourth quarter of fiscal 2022. As Renee mentioned earlier, we are focused on improving our inventory position.\n\nAs a result, we expect to return to a normalized free cash flow conversion of approximately 100% of adjusted net earnings in fiscal 2023. Additionally, for the full year, we expect capital expenditures in the range of $150 million to $175 million, depreciation and amortization of about $130 million, interest expense of about $55 million, and an adjusted effective tax rate of about 21%. Fiscal 2022 was a record-setting year for The Toro Company and reinforce the agility and resiliency of our teams. We are focused on operational excellence and will continue to build on incremental supply chain improvements.\n\nWe remain confident in our long-term strategies and look forward to building on our positive momentum in fiscal 2023. I'll now turn the call back to Rick.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nThanks, Angie. As we head into fiscal 2023, we are well positioned with innovative products, trusted brands, and extensive distribution and service networks. We expect to benefit from our well-established market leadership, along with the essential nature and regular replacements of our products. On top of that, we are entering the year with an order backlog of over $2 billion, a majority of which is for products in the areas of underground and specialty construction and golf and grounds.\n\nFrom a broader perspective, we're keeping an eye on overall business confidence, as well as consumer sentiment and spending patterns. We're also monitoring inflation, monetary policy actions, and the geopolitical environment. We believe we are well prepared to navigate this heightened level of macro uncertainty. I'll now comment on the macro factors we are seeing in our end markets, which could impact future results.\n\nStarting with our professional segment. For underground and specialty construction, we expect the current robust demand to continue with public and private infrastructure investments providing a multi-year tailwind. Utility construction and rental markets currently show no signs of slowing down, driven by the need and support for broadband and alternative power buildouts, along with the aging infrastructure. For example, the American Society of Civil Engineers estimates that a water main breaks every 2 minutes, and there are 6 billion gallons of treated water lost each day in the U.S.\n\nalone. With the most comprehensive equipment lineup in the industry, including the solutions for new installations, repair, rehab, and replacement, we are actively addressing the serious environmental and economic issue. For golf, we expect strong demand to continue as course budgets are healthier than ever. In the U.S., rounds played in 2022 are on track to once again end the year well above pre-pandemic levels, and the overall participant base is expected to exceed 40 million for the first time in history.\n\nAs the only company to offer both equipment and irrigation solutions and is the market leader in both, we are extremely well positioned to build on our momentum and long-standing relationships. For example, we were recently named the official equipment and irrigation partner for Asian Tour Destinations, an exclusive network of world-class golfing venues. We were selected because of our high-quality products, exemplary service and support, and legacy of trusted relationships. For municipalities and grounds, we expect to continue to see healthy budgets and the prioritization of green spaces, along with increasing interest in zero-exhaust emission products.\n\nFor customers seeking sustainable solutions, we are well positioned with our growing suite of no-compromise offerings geared to professionals. For snow and ice management, the season is off to a good start with record pre-season bookings and storm activity driving healthy contractor revenue. In addition, we have a steady cadence of new product launches to enhance our leadership in this space. This includes the versatile new Snowrator MAG.\n\nThis system allows one operator to do the work of eight shovelers on a job site. And our new liquid deicing solutions significantly reduce the amount of salt required. For landscape contractors, we expect to see a more normalized seasonal cadence with some degree of influence from weather patterns. This large growing market remains extremely attractive.\n\nOur extensive channel, plus three brands, Exmark, Toro, and Spartan, position us well to increase our leadership in the space. Customers are seeking solutions that drive productivity and efficiency, and there is growing interest in options that reduce exhaust emissions. This includes our Exmark and Toro commercial-grade battery-powered stand-on and zero-turn mowers. These mowers last the entire workday on a single charge with no sacrifice in performance.\n\nWe also expect demand for certain of our battery and hybrid electric offerings to get a boost from tax credits included in the U.S. Inflation Reduction Act. If applicable, these credits could drive a faster payback period for qualifying customers when considering the total cost of ownership. For residential, commercial, irrigation, and lighting, we are watching for any shifts in consumer spending patterns, as well as housing market trends.\n\nSustainability is ingrained in our approach to this business. We were honored to receive our eighth consecutive EPA WaterSense Award in October for our outreach and education around efficient water use. For agricultural micro irrigation, we expect a normalized year for purchasing patterns and are monitoring drought conditions in key regions. Our customers remain focused on solutions that drive efficiency and precision to grow more food with less water.\n\nMoving to the residential segment. We continue to see demand return to more typical seasonal trends. With this normalization, we will be watching weather patterns, including snow activity, the timing of spring, and the extent of any drought conditions. More broadly, we will be watching consumer confidence.\n\nImportantly for us, we benefit from regular replacement cycles. In addition, the current demand normalization is on top of the higher base we have built over the past few years with our expanded channel partners. We've also grown our addressable market with the ever-increasing number of tools and attachments in our Flex-Force 60-volt battery lineup, and we will be entering the autonomous space for homeowners with our robotic mower that was announced earlier this year. We've entered the new year with an outstanding team of employees and channel partners and strong momentum.\n\nWe believe we are well positioned to build on our market leadership across our broad portfolio as we continue to prioritize technology investments in alternative power, smart, connected, and autonomous solutions. Importantly, we plan to leverage these investments across our businesses to drive value for all stakeholders. We believe we have a unique competitive advantage driven by our innovation and market leadership, prudent capital allocation, enterprisewide operational excellence, and valued network of deep relationships. On that note, I would like to thank our employees and channel partners for going above and beyond every day to support our customers and deliver great results.\n\nYou are the key to The Toro Company's success. I would also like to extend my gratitude to our customers and shareholders for your continued support, and I wish everyone a fantastic holiday season. With that, we will open up the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Tom Hayes with Northcoast Research. You may proceed.\n\nTom Hayes -- Northcoast Research -- Analyst\n\nHey, good morning. Thanks for taking my question.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nMorning, Tom.\n\nTom Hayes -- Northcoast Research -- Analyst\n\nGood morning. I guess for you, Renee, you guys hold out through the prepared remarks your price realization in '22, and you don't provide a lot of detail at all. Maybe throw it out there anyway. So, anyway, can you kind of shape it up? And your expectations for '23, you know, how much price realization is in your expectations or the more or less about the same? Anything you provide on the color would be great.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah. Looking at price for '23, Angie, do you want to maybe cover that one?\n\nAngie Drake -- Vice President, Finance\n\nYes, we expect to see our demand continue to be solid for our products. We're going to continue with pricing to the market as we have typically done. And we do expect to see, you know, 7% to 10% sales growth in -- in the year for our full -- full-year guidance. We will probably see more price than volume, but it will be a mix really of both price and volume.\n\nAnd I think, you know, we just continued, Tom, to -- to feel like we're going to be agile and focus on productivity and adjust where we need to.\n\nTom Hayes -- Northcoast Research -- Analyst\n\nOK. Thanks. And then, just maybe as a follow-up, Rick, you talked about supply chain getting a little bit better. I think last time we spoke, you said maybe, you know, upwards of 50% of the items that at the worst of the supply chain issue may be getting a little bit better.\n\nIt sounds like it's continuing to get better. Just how do you see that progressing through this year?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nYou're right, we are seeing improvement -- steady improvement in the supply chain. I think, especially if you benchmark last year at this time, as I look back at my notes, if we had an assembly line that was not running and I called one of our plants and asked why that was, they would say, you know, \"We don't know where to start. We've got so many supply issues and suppliers that they can't give us dates.\" Today, that's a much different picture. We're down to a more discrete group of suppliers that are still challenged and a more discrete group of components that are challenging.\n\nThere's the categories you probably hear from others, everything electronic. So, chips, wiring, harnesses, some hydraulic components, and a few -- a few engines. But it's a much more definable group than it was a year ago at this time. And it's -- it continues to show steady improvement.\n\nTom Hayes -- Northcoast Research -- Analyst\n\nOK. I appreciate the color. I'll be back in the queue.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Sam Darkatsh with Raymond James. You may proceed.\n\nSam Darkatsh -- Raymond James -- Analyst\n\nGood morning, Rick, Renee, Angie, how are you? Good morning [Inaudible]\n\nRick Olson -- Chairman and Chief Executive Officer\n\nGood morning, Sam. Happy holidays.\n\nSam Darkatsh -- Raymond James -- Analyst\n\nHappy holidays to you as well. Got like two or three questions. I'll try and make them real quick. So, I think I heard you say that you're looking to work your inventories lower as the year progresses.\n\nCan you add a little bit of color or quantification to that in terms of what's a realistic goal from a dollar perspective that you can get inventories by fiscal year-end versus the $1 billion here? And then, same question. How much of that 2.3 billion in backlog are you looking -- or you -- are you including within your 7% to 10% sales growth guidance that -- that would be worked lower?\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nRick, maybe I'll take the first question if you want to talk about the backlog. I guess, looking at free cash flow generation, inventory was the driver for our conversion rate within fiscal 2022, which was lower than our historical average. Important to note that we did come off of two very strong years of free cash flow conversion at 140% in fiscal '20 and 110% in '21. As we look forward, Sam, we don't have a specific guidance number related to inventory because we'll manage all of the variables that impact our cash flow.\n\nBut we do feel that we'll can -- we'll return to a more normal level of free cash flow conversion. And as Angie talked about, we expect that to be about 100% for the year. So, that's embedded in that guidance.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nAs you look at the backlog going forward, Sam, the bulk of the backlog, of largest portions that are coming in from underground and specialty construction, golf and grounds has been -- has been consistent in our conversations previously. And we will -- we will be working to bring down the backlog. In some cases, that can be done more quickly because of the, you know, supply chain constraints get resolved more quickly. Others will extend out throughout the year, but we know we're going to be managing the backlog throughout the year.\n\nFrom a capacity standpoint, we will -- we're adding capacity in areas that, you know, have long-term growth and capacity needs beyond the short term. And the areas that are more of a short-term issue, we're looking to double down on our existing operations, whether we're using other facilities to make some of the products or the opportunity to add shifts and so forth. That's really subject to the -- to the availability of components still at this point. So, as the supply chain gets healthier, we'll look for options to continue to bring the backlog down as quickly as possible.\n\nAnd, you know, we're working with our -- with our channel partners and our customers to make sure we support our customers, which is our -- our top priority in this environment.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nAnd just adding to that, you know, going back to the inventory question there, they're really related too as we've looked at trying to serve our customers to the best of our ability. Given the demand that Rick was just talking about, we have made some strategic decisions to bring in some key components, and we think that served us well. But we'll -- we'll continue to manage that inventory as the supply chain normalizes.\n\nSam Darkatsh -- Raymond James -- Analyst\n\nSo, could I infer then -- or could one infer that based on the improvements you've been seeing in supply chain and the fact that the -- you know, the season is -- is going to be starting in the next few months or so, that backlog would be worked lower, perhaps as soon as -- as this existing quarter? Or is it going to be more of a springtime thing when we should see sequential backlog declines?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nI think we're looking at over the course of the year. So, you know, our best estimate is built into our guidance. And certainly, the spring is an opportunity with the natural flow for demand for that -- for that to come down. But again, you know, the bigger spring push is really on our residential side.\n\nAnd most of the backlog, in this case, is really on the professional side.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah, [Inaudible] add to that. \n\nSam Darkatsh -- Raymond James -- Analyst\n\nWhich leads me to -- oh, I'm sorry. Yeah.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nSorry, Sam, I was just going to add to that to say, you know, we'll -- we'll really kind of return to a more normal cadence of -- of sales per quarter and seeing our larger quarters be in Q2 and Q3 of '23 [Inaudible]\n\nSam Darkatsh -- Raymond James -- Analyst\n\nAnd so, I guess my final thought, as it relates to resi, there's clearly a lot of moving pieces here in the channel with respect to channel inventories and weather normalization and maybe some -- some push-ahead demand from -- from prior periods. How do you characterize the sell-through expectations, both from a volume and pricing standpoint this coming year that informs your expectations for flat resi sales growth? Thanks.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nYeah, I think, Sam, we've described it as a more normalized situation. So, we've got better field inventory positions than we've had the last couple of years in residential. We're still short in a few key product categories that we're looking to sell in -- in the field. And then, it will be subject to the normal -- you know, the timing of spring, the weather patterns, and so forth.\n\nAnd 2022 is not a great year for residential from an external perspective with a very late spring and a drought in the summer. So we've already kind of seen somewhat of a return to more normal, excuse me, patterns in -- in '22. And we did grow the business by 6% in that circumstance. And residential has been an absolute superstar, you know, '23, '21, and '20, growing more than 20%. So, we're really talking about, you know, normalizing on a new plateau of that business based on additional channel partners, the reboots of the product line, marketing, and merchandise positioning, etc.\n\nBut it's a different business than it was a few years ago.\n\nSam Darkatsh -- Raymond James -- Analyst\n\nThank you. Thank you all.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nThank you, Sam.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Tim Wojs with Baird. You may proceed.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nHey -- hey, everybody. Good -- good morning. Happy holidays. Maybe just on -- on the guidance around -- around margins.\n\nI mean, it sounds like you'll actually have less expansion in the first half of the year than the second half of the year, even though I think that the comps in the first half are easier than the second half. So, just maybe walk us through what specifically is kind of driving that. Just I would have thought it would have been a little bit better in the first half just given the timing of price cost.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah. I think what you'll see there is that we -- we do expect pro to be higher year over year but down sequentially from Q4. Part of that is the inventory -- inventory adjustment that we had to make in Q1, which is just kind of part of a normal process that we do. But this quarter, it was a bit higher, significantly higher than we -- we've had to do in prior years really related to the increased inventory and the inflationary environment.\n\nBut we did that just to call that out really to help you guys in your modeling. But that will affect our pro margin a bit. And res will be similar year over year. We do expect that this will kind of normalize as we -- as we go into Q2 and Q3.\n\nAlthough interest expense is also a piece of that, and it will be higher year over year. And then, finally, you know, when we look at our adjusted EPS, it's higher year over year too. And, you know, our range is going to be 12% to 17% higher year over year for the total year -- for the total year, yes.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nThe total year, OK. Yeah. I mean, I guess maybe -- maybe -- maybe ask a different way, like, I guess your implied incrementals are kind of mid-20%, you know, for '23. And I don't think that's much different than your kind of normal incrementals.\n\nAnd I would think you'd have, you know, more productivity and kind of better price cost as being kind of tailwinds. I guess just kind of -- I guess what are you baking in for kind of the net price cost, you know, kind of tailwind, you know, on the margin side for '23?\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah, we're -- we're continuing to see, you know, positive price realization. We're still in an -- in an inflationary environment, though, Tim. What we're seeing, we are seeing some favorable trends from a commodity standpoint. But all of that, you know, we're certainly not, you know, seeing in our P&L as of today.\n\nIt's also important to consider, in Q1, when you're looking at just Q1, we did have the Intimidator Group acquisition, which is an impact in -- in Q1 that we wouldn't have had last year. And we talked about that is just at a lower initial gross margin than the segment average. That would be the only other thing I would mention.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nOK. OK, good. And then, I guess from a, you know, landscape contractor perspective, you know, it sounds like you're expecting kind of more normalized demand patterns in fiscal '23 in that business. I mean, does that imply that the channel from kind of an inventory and, you know, kind of floor planning perspective is kind of return to normal?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nI think, in general, it is a little bit more returning to normal. As I said -- expanding on what I said before, when you have key product categories and especially on the -- the more higher end of LCE, the more professional, higher horsepower products, we still are short products in the field for those categories. So, certainly, much more demand even to put the field inventory in the right place for those. But good -- good flow-through still from the professional contractors.\n\nI would just say for -- some portion of that business also goes to homeowners with acreage. So, that's another factor that's a little bit more closely aligned with residential.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nOK. OK. And then, just last one, on the golf and the underground businesses, are you effectively sold out for this year or, I guess, fiscal '23? And I guess I'm looking at the backlog and trying to think about how big those businesses are from a revenue perspective. And I think the -- I think the backlog is probably bigger than what those -- those two businesses generate on an annualized basis.\n\nSo, I guess I'm just curious if you're already booking those businesses out to kind of fiscal '24 and what the lead times look like in kind of golf and underground today.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nIt's not -- it's not true universally across those categories, but it's true in some key categories, yeah, that we're booked out through the year.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nOK. OK. Sounds good. Thank you.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nTo the earlier comments, we're working on how we can overdrive production in some of those areas as components become available without adding, you know, regrettable capacity that we'll -- we'll have to deal with in the future.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nOK. And when you think about capex, I mean, is it really devoted to -- to those two businesses on a go-forward basis?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nNot -- not universally. It's overweighted to those areas as -- especially in the underground, especially construction side that has, you know, long opportunities going forward here relative to the secular trends and the drivers of infrastructure spending and investment. So, that would have more capital investment, long-term perspective.\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nOK, great. Thanks, guys. Happy holidays and good luck on '23.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nThank you.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. One moment for questions. Our next question is from Eric Bosshard with Cleveland Research. You may proceed.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nThank you. Good morning. \n\nRick Olson -- Chairman and Chief Executive Officer\n\nGood morning.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOn backlog, a couple of -- a couple of points of clarification. The 2.3 billion number, that -- that number a year ago was 1.5 billion, is that correct? \n\nRick Olson -- Chairman and Chief Executive Officer\n\nRoughly, yeah, 1.6. Correct.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nAnd that -- and normalized, if we go back to 2019, that number in a more normal period is roughly what?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nIf you look at the average over a number of years prior to -- or including 2019 and before, it's more in the 150 range, a hundred -- it's roughly, you know, 10x last year at this time.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOK. And so, the growth in '22, I guess what I'm trying to figure out, is the number grew 700 million or 40% this year. And your supply chain improved, back-end loaded, it sounds like, within the year. But the further growth of that number, is this -- can you just give us a sense -- I mean, obviously, backlog is -- is the sum or the difference between demand and supply.\n\nBut can you just help us understand what contributed to that growth this year and in those metrics?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nYeah, it's really the -- the narrative on the backlog for 2022 is that our supply chain got better. We were able to fulfill a lot of the backlog that was there when we started, and the demand was even more than what we could fulfill. So, basically, the answer is incredibly strong demand in those areas, underground specialty construction and the golf and grounds market. So, we've got better -- the supply chain got better.\n\nWe were able to ship more, and the demand came in at a faster rate.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah, really strong end markets and very healthy, and customers as well.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOK. And then, related to that, secondly, the revenue guide for '23 of up 7 to 10, I guess as I look at the backlog number relative to last year, relative the historic context, with incremental supply, is -- the limiting factor to this is supply, it's not demand by -- by -- feels like multiples. Or am I thinking about backlog wrong?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nGeneral -- generally, that is true. Yes, it's a supply driven constraint, rather, we have -- as you can see, we have a lot of demand. And that's -- that's been really our theme for the last -- throughout the last year plus.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nAnd then, the last question I have relates to inventory. The -- your directional comment that you would make progress on inventory in '23 is -- in terms of operating rates or utilization rates, there's a lot of other companies in your neighborhood that have too much inventory and they'll solve it by producing less. Is -- is your inventory more a function of shipping more? Or are there -- you know, you have to -- and I believe my question, do you have the idle capacity? Or is this just there's enough supply we can complete product and then get it out the door? Like, does the improvement in inventory have any impact on operating rates or incremental margins, or is it -- is it the alternative?\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah. No, I -- I don't think we'll be producing less. It's really more weighted, Eric, toward work in process in service parts because, again, we intentionally brought in some of those components to try to get more efficiency out of our production facilities. So, I think we'll be producing at a -- at a high rate.\n\nWe actually are a little light unfinished goods in a number of areas. As Rick was talking about, where we very strong demand, we're not holding a lot of finished goods. We're shipping that, you know, out as soon as we can make it so that when we talk about normalizing the mix, it's really, you know, normalizing, bringing down work in process and, you know, finished goods up as a percentage, total inventory down.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\n OK.\n\nAngie Drake -- Vice President, Finance\n\nAnd I would just add to that we are -- today, we are a larger company. And so, you know, we've also got inflationary rates a bit in our inventory. But we do believe inventory is good. We're not seeing a lot of excess, and, obviously, that's good inventory.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOK. That's helpful. Great. Thank you very much.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from David MacGregor with Longbow Research. You may proceed.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nYes. Good morning. Thanks for taking the questions. I guess, first of all, thanks for the additional guidance around first quarter.\n\nSo, if I were to think that you were going to provide that quarterly guidance on a consistent basis going forward, that would be a huge help. So, thanks for that. But it's likely to be a base case, right? So, I guess I'm just trying to understand, if we end up with a slowdown in demand in 2023, and it doesn't play out in accordance with the base case but rather comes in later than that, Rick, where in the P&L are your greatest opportunities to flex in order to protect margins?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nI think this is -- this is something that The Toro Company has done just by nature of our markets and our businesses. We know that some of our businesses are affected by weather cycles and so forth. So, we stay very agile in the way that we do our planning for the year and our budgeting. So, we tend to -- we tend to budget in a way that, you know, significant investments are held until we can see how the year is starting to play out.\n\nWe leave flexibility in some of those investments as we go through the year. We have -- we have flex opportunities with our suppliers and so forth as well. So, we -- that's the way that we build our plan for the year to be able to flex, should the conditions change, and we stay current with a level of demand. So, that's -- that's how we do our business.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah. And I would just say, from a professional standpoint, there's a lot of our professional customers have not been able to get the products that they need and they want. So, we do have kind of a bit of pent-up demand on the professional side. Certainly some of it constrained by supply chain, but -- but also just the fact that -- that people have been wanting to get that product.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nAnd that's probably the key point is most of our products are used for essential tasks, they're not discretionary. So, especially in the context of a business, many of our professional customers are -- have delayed purchases through the early part of the pandemic, and they're already behind. And our products are consumed when they're used. So, if they're being used, then they're being consumed, and they need to be replaced.\n\nBut also say we're just -- we're off to a really good start with snow, as you can imagine, both on the professional and the residential side. We've activated the emergency response system with our channel to ship products to the areas that are going to be affected by the storms coming up. And we've been off to a good start so far this year as well. So, it's -- you know, even in our residential business, that's a really nice way to start out the year as well from a product standpoint.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nYeah. Just to follow up on your answer, when you talk about investments, you're really referencing new product development investments, or is it something else?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nNew -- new product Investments are usually the last to go, to be honest. It's more -- it could be systems investments, those types of things that don't affect our product. Product development is extremely high priority because innovation is so key to who we are so that we don't give those up easily if -- if ever.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nRight. Thanks. I guess, secondly, just to reference back to an answer you gave earlier with regard to landscape contractor, some portion of that obviously does sell into residential markets. Are you able to quantify that for us or give us some sense of how likely that -- that segment is to correlate to residential?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nI don't think we have quantified that in the past, but especially customers that are looking for professional products or they have properties that -- that justify having professional-level products. So, large acreages, it could be farms, it could be estates, those types of things that may be buying professional products. So, I just didn't want to imply that -- those all go-to landscape contractors. There are other customer types in that category, and they are affected differently by economic conditions.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nOK. And finally, I guess, just from a profitability standpoint, just curious, your thoughts around Intimidator. And I realize it's a high single-digit percentage of the pro segment, but still relatively small, but it keeps coming up in terms of discussion of -- of the dynamics around the margins. So, is there any way to sort of help us understand just what the progression plan is there in terms of profitability and how much longer you expect it to be dilutive to the pro segment?\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah, and we've called it out because, of the first year, it has more of an impact on the financial performance versus when it's in the base comparing year. \n\nDave MacGregor -- Longbow Research -- Analyst\n\nSure. \n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nAs far as the acquisition itself, it has been a great acquisition. It is performing in line with our expectations and with the models that we had upon the acquisition. We're realizing the synergies that we had anticipated at this point in time and getting leverage, especially related to some of the technology areas over the broader three brands that we now have within the zero-turn mower market. So, we feel really good about the acquisition.\n\nWe are seeing improvement in their profitability. But, you know, really we -- we didn't expect all of that to happen all in one year, especially given the supply chain challenges. You know, initially, we wanted to make sure we got off to a strong start with the brand and maintained the momentum that they had. And we'll work over time to -- definitely to improve their profitability.\n\nAngie Drake -- Vice President, Finance\n\nAnd I would just add to that, in Q1, we expect them to add about $60 million in net sales as part of that net sales increase in the pro segment.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nYour backlog in that business as well is 60 million. Sounds like it doesn't grow much.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nBacklog would be similar to other LCE at this point. So, some on key product categories, but the field inventory is in better -- better position there than it would be on the other categories of pro that we talked about.\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nYeah, and I think the 60 million is consistent, from a run rate standpoint, with -- with what we've been seeing in the prior quarters as well. It has a little more of the normal cadence to it. So, Angie's quoting the number for Q1.\n\nAngie Drake -- Vice President, Finance\n\nRight. \n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nAnd that they weren't in our Q1 F '22. Yeah. And I think, pre-acquisition, they were about 200 million. So, they are growing.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nYeah. OK. Thanks very much, and happy holidays, everyone.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nOK. Thank you. Happy holidays.\n\nOperator\n\nThank you. This concludes the question-and-answer session. Ms. Kerekes, please proceed to closing remarks.\n\nJulie Kerekes -- Treasurer and Senior Managing Director of Global Tax and Investor Relations\n\nThank you, Josh, and thank you all for your questions and interest in The Toro Company. We look forward to talking with everyone again in March to discuss our fiscal 2023 first-quarter results. Happy holidays.\n\nOperator\n\nThank you for your participation in today's conference. This concludes the presentation. You may now disconnect. Good day.\n\nDuration: 0 minutes\n\nJulie Kerekes -- Treasurer and Senior Managing Director of Global Tax and Investor Relations\n\nRick Olson -- Chairman and Chief Executive Officer\n\nRenee Peterson -- Vice President and Chief Financial Officer\n\nAngie Drake -- Vice President, Finance\n\nTom Hayes -- Northcoast Research -- Analyst\n\nSam Darkatsh -- Raymond James -- Analyst\n\nTim Wojs -- Robert W. Baird and Company -- Analyst\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nDave MacGregor -- Longbow Research -- Analyst\n\nMore TTC analysis\n\nAll earnings call transcripts"
}