{
  "companyName": "Marqeta, Inc.",
  "companyTicker": "MQ",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/marqeta-inc-mq-q2-2022-earnings-call-transcript/",
  "content": "Marqeta, Inc. (MQ 1.50%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Thank you for standing by. Welcome to the Marqeta second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference call is being recorded.\n\nI would now like to turn the conference call over to Stacey Finerman, vice president of investor relations, to begin. Please go ahead, ma'am.\n\nStacey Finerman -- Vice President, Investor Relations\n\nThanks, operator. Before we begin, I would like to remind everyone that today's call may contain forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties, including those set forth in our filings with the SEC, which are available on our Investor Relations website, including our annual report on Form 10-K for the period ended December 31, 2021, and our subsequent periodic filings with the SEC. Actual results may differ materially from any forward-looking statements we make today.\n\nThese forward-looking statements speak only at the time of this call, and the company does not assume any obligation or intent to update them, except as required by law. In addition, today's call includes non-GAAP financial measures. These measures should be considered as a supplement to and not a substitute for GAAP financial measures. Reconciliations to the most directly comparable GAAP measures can be found in today's earnings press release or earnings release supplemental materials, which are available on our Investor Relations website.\n\nHosting today's call are Jason Gardner, Marqeta's founder and CEO; and Mike Milotich, Marqeta's chief financial officer. With that, I'd like to turn the call over to Jason to begin.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nThank you, Stacey. Good afternoon, everyone, and thank you for joining us for Marqeta's second quarter of 2022 earnings call. I'll start with an overview of our results for the quarter, and then I'll discuss an update on our three strategic priorities. Total processing volume, or TPV, was $40 billion in the quarter, representing a 40 -- 53% increase in alignment with the rise we posted in the first quarter.\n\nThe scale of our platform continues to increase dramatically. Our TPV for the three months ending June of 2022 exceeds our TPV for the 12 months ending June of 2020. Our net revenue of $187 million in the quarter represents a 53% increase from the previous year. The main drivers of growth throughout 2021 and into the start of 2022 continue to propel our business.\n\nPayment habits that gained traction during the pandemic are still popular with consumers and driving our top-line growth, including digital banking; buy now, pay later; and on-demand delivery. Expense management continues to scale as businesses look for efficiencies and business travel returns. Block accounted for 69% of our net revenue, up from 66% in the first quarter, with Afterpay included in the entire quarter and Cash App volumes continuing to grow meaningfully post-tax season. This percentage represents a decline in concentration from 72% of net revenues in the second quarter of 2021.\n\nTPV from customers outside our top five grew at three times the pace of our top five customers. The revenue associated with customers outside the top five more than doubled compared with the comparable quarter of 2021. This continues to be a testament to the impact of the Marqeta platform enabling business growth for our customers. We have again made significant progress on our three critical growth pillars in the quarter: fueling our customers' success; broadening the ways we support our customers; increasing our global platform's resiliency, reliability, and scalability.\n\nFirst and foremost, we want our customers to succeed. We are always looking to support our customers' businesses as they grow and diversify revenue -- diversify their revenue streams. In June, we announced our partnership with Western Union, a global leader in cross-border, cross-currency money movement and payments in Europe, demonstrating again the appeal of our offering for established market leaders looking to innovate at scale. Marqeta's modern card issuing platform will allow funds held by Western Union's digital banking customers to be available via a physical or virtual debit card.\n\nThis will enable Western Union to extend its relationship with its customers with additional flexibility to roll out new features and deliver a wide range of digital banking services. We look forward to growing our partnership with Western Union. We see its scale and commitment to digital banking innovation as a strong match for Marqeta. We continue to leverage an innovative ecosystem of partners to unlock value for our customers' businesses.\n\nLast October, we announced a partnership with our customer, Branch, to power faster payouts for Uber Freight carriers, serving as a connection between our customers to help power net new payments innovation. After a successful launch, we've shown the potential for what we can build together and are excited to work alongside Branch to support the launch of the Uber Pro card for drivers. We see the combination of Marqeta's modern card issuing platform and Branch's digital wallet as a natural fit to bring faster payments and flexible rewards to Uber drivers. Enabling Branch to unlock this innovation is another excellent example of how Marqeta adds value for a customer of Uber's scope as they launch new card programs with us across the breadth of their business.\n\nProviding customer support, our second focus area, means expanding the Marqeta platform to support our customers with new products, services, and geographies. Marqeta initially prioritized debit and prepaid innovation to help commerce disruptors bring new offerings to the market, ushering in a wave of innovation for these card types. Credit, which represents the other half of total card spend in the market, has not yet experienced the same amount of modernization. Given the massive opportunity to modernize credit, this is a logical step for our product road map.\n\nOur goal is to enable our customers, leading fintechs, consumer brands and banks to offer their end consumer experiences that are currently unavailable. We initially launched our credit platform in 2021, allowing us to support any card type through our modern card issuing platform. And we recently launched more than 40 new credit APIs, which will power innovations in credit and enable our customers to more quickly design, test and launch new card experiences. Our flexible rewards engine allows our customers to create programs that reimagine hyper-customized rewards based on merchant category spend and various cardholder behaviors.\n\nFor example, our customers can offer instant gratification to their end users by supporting the ability to provide the reward as soon as the transaction is cleared rather than at the end of a billing period. Our customers can now provide their users with an instant credit decision via Marqeta's API connection to FPO's decisioning engine. In other words, when a user applies for a card, they will get a decision instantly rather than waiting days for the bank to access their credit history. This encourages users to apply and start using their card immediately, helping card programs cement coveted top-of-wallet status with their customers.\n\nWe have deepened the capabilities of our credit platform, and that in turn has deepened the experiences that our customers can create. We have also broadened the verticals we support by expanding into transit for the first time. Recently, the New South Wales government in Australia announced its commitment to upgrade its transit card system. Marqeta was named the payment processor of choice for Opel Plus, the new transit program for transport for New South Wales in partnership with Mastercard.\n\nThe result will be a Mobility-as-a-Service app, allowing subscribers to plan, book and pay for a tailored commuter experience directly from their mobile devices. This deal is another example of our platform's adaptability to service an ever-broadening array of use cases. Our third focus area, increasing our global platform's resiliency, reliability, and scalability, is critical given the increased demand placed on our platform year after year with exponential growth. As a significant area of investment, we want our platform to keep pace with our growing customers to also provide strength and support for our customers' future business goals and innovations.\n\nOur resiliency at scale is a key differentiating factor when customers choose the Marqeta platform. Uptime and latency are of the utmost importance in our business. We have delivered at least four nines across all of Marqeta's customers weekly this year. This is even more impressive given that our volume increased 50% year over year.\n\nWe also worked diligently in the first half of 2022 to bring faster API connections to our customers and partners to improve their platform experience further. As a result of scalability and resiliency improvements made in May, we saw our API latency improve up to 60% across all endpoints of the Marqeta platform in the following months. In conclusion, our Q2 results demonstrate the increased breadth and depth of the Marqeta platform. We continue to enable this digital disruption and modern money movement with a base of customers who work on the cutting edge of payments.\n\nWe believe we are the go-to choice for payments innovation at scale. When paired with our solid financial footing, we are very well-positioned to capitalize on the market opportunity and modern money movement in the coming years. I will now turn the call over to Mike.\n\nMike Milotich -- Chief Financial Officer\n\nThank you, Jason, and good afternoon, everyone. We had a great Q2 with TPV and net revenue growth of 53%, which is in line with last quarter. The strong net revenue growth was broad-based with 20 of our top 30 customers growing at least 40% and the customers outside the top 30 as a group growing much faster. Gross profit and adjusted EBITDA margins were above our expectations as a result at 42% and negative 5.5%, respectively.\n\nThe net revenue and gross profit outperformance was primarily driven by three factors where results exceeded our expectations for the quarter: first, higher TPV across customers of all sizes; second, higher net revenue take rate due to favorable volume mix both in terms of merchant mix, as well as PIN versus signature debit mix; and third, more robust usage of additional services not directly tied to TPV, such as card fulfillment. Favorable volume mix and additional services also lifted the gross profit margin since they don't drive a corresponding increase in our cost of revenue. Adjusted EBITDA also benefited from timing delays in hiring and investments, which will push a few million dollars of expenses into Q3. Let me provide more color on the items that drove our quarterly results.\n\nQ2 TPV was $40 billion, growing consistently with last quarter at 53%. Growth accelerated in expense management and on-demand delivery, offset by tough year-over-year comparisons in financial services and BNPL that were helped by the U.S. government stimulus in March of 2021. Although TPV growth was similar to Q1 overall, it did differ on a category basis.\n\nIn categories that are less discretionary, such as supermarkets, drugstores, fuel, and utilities, which make up roughly one-third of our Q2 TPV, growth accelerated meaningfully versus Q1. In more discretionary categories, such as retail, travel, entertainment, and home improvement, which make up roughly one-sixth of our Q2 TPV, growth decelerated significantly from Q1. While Q2 TPV growth in highly discretionary categories did decelerate, it is still growing more than 15 points faster than medium- and low-discretionary categories. Let me also highlight TPV performance in our top verticals.\n\nThe financial services vertical continued to grow strongly, slowing only a few points from Q1 despite tough comps due to stimulus and delays in the tax season last year. Spending in less discretionary categories grew more than twice as fast as medium- and high-discretionary categories in this vertical. On-demand delivery accelerated by almost 10 points due to increasing consumer demand and our customers' expansion into new merchant categories. Lending, including buy now, pay later, is still growing very fast.\n\nBut growth did fall below 100% for the first time this quarter as we begin to lap the incredible ramp in BNPL spending last year. The robust growth is driven by both consumer and merchant adoption and usage. Actual TPV this quarter exceeded Q4 2021, which obviously benefited significantly from holiday spending. Expense management TPV more than tripled year over year again this quarter with eight of our top 10 customers growing over 100%.\n\nSpending growth is highest in more discretionary categories, fueled by the rebound in travel. Net revenue was $187 million and grew 53% in the quarter, in line with TPV growth. Our net revenue take rate was in line with last year but improved 1 bp versus last quarter. On a sequential basis, the improvement was driven by favorable business mix and strong growth in additional revenue streams not directly tied to every dollar of TPV, such as card fulfillment, KYC/KYB services, dispute handling and cross-border premiums.\n\nThese benefits were partially offset by the impact of Powered by Marqeta TPV growing faster than the rest of the business. As a reminder, in our Powered by Marqeta business, we primarily have a processing relationship with our customer. Therefore, the take rate is typically lower than in our Managed by Marqeta business. Gross profit grew 66%, 13 points faster than revenue due to a combination of factors.\n\nIn Q2 last year, we had unusually high network fees, creating an easier comp. Contract amendments in Q3 2021 reflected our increased scale. Therefore, fees to our bank partners are growing significantly slower than TPV and network incentives are growing a little faster than TPV. We will start to lap these benefits next quarter.\n\nWhile Powered by Marqeta increasing its share of TPV negatively impacts the revenue take rate, it does not have the same impact on gross profit because the Powered by Marqeta gross profit take rate is similar to many of the verticals in our Managed by Marqeta business. Lastly, the favorable volume mix and stronger usage of additional services also contributed. Our Q2 gross profit margin was 42%. As a reminder, Q2 is typically our lowest gross profit margin quarter due to the timing of our network incentive contracts.\n\nQ2 adjusted operating expenses were $88 million, growing 53%. Roughly two-thirds of the growth comes from increased technology and product investment focused on broadening our capabilities and increasing our platform's resiliency, reliability, and scalability. About 45% of the growth is driven by technology and product headcount, and about 20% is cloud and software tool-related expenses. Go-to-market headcount, both business development and customer support, drove approximately 10% of the adjusted expense growth.\n\nCosts associated with becoming a public company, such as insurance and audit fees, also drove approximately 10% of the growth. This should not be a driver of future expense growth as we will be lapping these costs going forward. The remaining 15% to 20% of expense growth is mostly driven by all other headcount-related increases in support functions. Because so much of our adjusted operating expenses are headcount-driven or tied to business growth via our cloud costs, we consider only a very small portion of our expenses to be discretionary.\n\nTherefore, we try to be both thoughtful and thorough in our investment planning. Adjusted EBITDA for the quarter was negative $10 million, resulting in an adjusted EBITDA margin of negative 5.5%. We had positive free cash flow this quarter both in actual terms, as well as when you consider the amortization of expense for significant annual cash payments that may occur in other quarters during the year. The Q2 GAAP net loss was $45 million.\n\nNow let me share our perspective on the full year. Our business has significantly outperformed in the first half of the year. Many of our top customers expanded their business into new areas with us and are defying the tough comps driven by government stimulus early last year. Smaller customers across several industry verticals and geographies are utilizing our capabilities with great success to expand their businesses rapidly.\n\nWhile our top 10 customer TPV grew about 40% in the first half, which is excellent given their size, our remaining customers grew nearly four times faster. We are also getting more traction with additional services we offer, such as card fulfillment, authentication, and dispute management. All of these factors are helping to diversify our business. As we look ahead to the second half of the year, given the current macroeconomic uncertainty, as well as fintech-specific challenges with significant declines in valuation and increasing difficulties in raising capital, we feel it is prudent to be cautious about the next several months.\n\nMany fintechs are being less aggressive about their investments in expansion. Therefore, our expectations for the second half of the year remain unchanged from when we last spoke in May. Many of the tailwinds that drove our first half upside should continue. However, we also believe that many of the customers signed in the last 12-plus months, as well as crypto customers, will ramp their businesses more slowly than we expected a few months ago.\n\nBecause these are newer customers ramping up, the impact of less investment by our customers and their programs is more significant in Q3 and Q4 than it was in the first half. Our Q3 quarter-to-date performance is consistent with this perspective. As such, we expect Q3 net revenue growth to be between 36% and 38%. In addition to lower contribution from new customers, the growth is lower than the first half due to much tougher comps, particularly in BNPL and expense management, where those verticals were ramping significantly last year.\n\nQ3 gross profit margin is expected to be in the 43% to 44% range, consistent with the first half. Q3 adjusted EBITDA margin is expected to be negative 8% to 9%. This should be our most negative margin quarter. The expense growth will be driven by planned investments shifting from Q2 to Q3; continued hiring, particularly in our technology, product, and go-to-market teams, as well as a charge tied to international processing.\n\nWe reduced our hiring plans back in February when the macroeconomic warning signs were already evident, and we intend to continue with that revised plan. Our expectations for the full year 2022 have improved a little as a result of our outperformance in Q2. Since we are more than halfway through the year, we can also be more definitive about our expectations. 2022 net revenue growth is expected to be 39% to 40%.\n\nGrowth should step down in Q4 as we lap the incredible performance in Q4 2021 when year-over-year growth in dollars was almost $15 million higher than the average of the first three quarters, fueled by a robust holiday season and BNPL growth. Full year gross profit margin is expected to be 43% to 44%, consistent with the first half and Q3. 2022 adjusted EBITDA margin is expected to be negative 7% to 8% as adjusted expense growth steps down from Q2 to Q3 and again, more significantly from Q3 to Q4. In the future, we remain confident the business will operate at a 20%-plus adjusted EBITDA margin once we have captured more of the market opportunity.\n\nTo wrap up, Marqeta had an excellent Q2 to cap off a strong first half of 2022 as we continue to have success scaling the business. We had almost 20 days in Q2 where we processed over $500 million in TPV. We continue to diversify the business with new products, services, geographies and use case verticals while maintaining our net revenue take rate and gross profit margins. Although we are cautious about the coming months given the level of macroeconomic uncertainty and the implications for our customers, we are investing prudently in the growth to ensure we capture the modern money movement opportunities ahead of us.\n\nI will now turn the call back over to Jason.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nThanks, Mike. My highest aspiration for Marqeta is to fulfill our vision, defining and powering the future of money movement for the world's leading innovators. While I've succeeded in leading Marqeta to its present state as the founder and CEO to maximize the next stage of growth as we diversify the business and the capabilities we offer in the geographies we serve, we want to be very proactive and begin our succession planning process by looking for the next CEO to lead Marqeta. I always knew this time would come.\n\nWhen we went public in 2021, I promised to hand leadership to the best person at the appropriate time. After thoughtful consideration of what the next phase of growth will require, I've concluded that now is the time to begin the search for this person. We will search for a CEO with deep experience scaling an innovative, high-growth business. I have led Marqeta from zero to one, and soon it will be time to pass the baton to the best person to lead it from one to infinity.\n\nI'm sharing this with you because I've always valued thoughtful transparency and because this transparency will allow me and the board to attract, select and hire the best CEO to drive even higher levels of success for our customers, employees, and shareholders. Once we hire the next CEO, I will become executive chairman. As executive chairman, I plan to spend my time in the three areas I can contribute the most: our people, our products, and our customers. I'm entirely committed to Marqeta and our overall success forever.\n\nAlong with the CEO succession plan, Vidya Peters, our chief operating officer, is leaving the company. Vidya has contributed greatly to the company over the past three years, and we wish her only the best in her future pursuits. Simon Khalaf, our newest executive and our chief product officer, will assume Vidya's go-to-market responsibilities on an interim basis, and we will begin a search for a chief revenue officer. Simon joined Marqeta from Twilio, where he led their core communication products, including the messaging, sales organization focused on strategic accounts.\n\nI am as excited as ever about the massive opportunities ahead for Marqeta and very confident we're on a path to sustainable, profitable growth. I firmly believe that these changes will help maximize customer, employee, and shareholder value. With that, I will turn it over to the operator to start Q&A.\n\nOperator\n\nThank you, sir. [Operator instructions] The first question we have is from Tien-Tsin Huang from J.P. Morgan.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nThank you so much, Jason. I appreciate your comments there in the interim succession. You sound quite at peace with that, and I admire you for that. So I just want to say that upfront.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nThank you.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nIf you don't mind, I wanted to ask about -- we got a little bit of a scare from FIS when they talked about working with the cash card or Block on the network side. So would you mind just commenting on if there's any implications to Marqeta and if there's any update on the relationship in general and the timing of the renewal, etc., given the scare that we got? Thanks.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYes. There's -- thanks, Tien-Tsin. There's no implication for Marqeta. That was just an unfortunate thing that was said, and it doesn't affect the cash card or our relationship specifically with Block.\n\nI mean, issuing processing is an incredibly complex industry. You know that. We work very closely with Block to provide a wide variety of services and support to fuel their growth. And just as a reminder, we have multiple contracts with Block and Afterpay that go throughout 2024.\n\nOur relationship has only grown since we started working with Cash App. We provide a wealth of services to Block across our platform. So to point those out specifically is within Cash App is direct deposit, ATM, Cash App Card and Tencor and on the seller card is cards in the U.S. and Canada and bank account services.\n\nAnd obviously, we power Afterpay. So we're very uniquely positioned to power this business while legacy processors are not. Marqeta was built for developers. We're built for innovation.\n\nWe're cloud-based. It's a single platform. So you integrate once, you can launch everywhere. And everything is in one place.\n\nSo we're very, very flexible in regards to how we can support not only Block but really all of our customers. You also asked about the renewal. So we understand that the market is eagerly waiting a renewal, and we'll share updates when we have them. As everyone knows, this is a critical relationship for both Block and Marqeta, and our two companies work closely together in service to our important relationship.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nPerfect. I appreciate that.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThe next question we have is from Rayna Kumar from UBS.\n\nRayna Kumar -- UBS -- Analyst\n\nHi. Thanks for taking my question. You mentioned that you have some investments that moved from Q2 to Q3. Could you specify what types of investments those are that's your top priorities of investments for '22? Thank you.\n\nMike Milotich -- Chief Financial Officer\n\nSure. So it's really just the timing of some technology-related investments, as well as the timing of hiring. So we have a lot of pending starts. So they're just people who have been hitting the P&L in the second quarter but are about to start, and so it really is as simple as that.\n\nThe focus of our investments this year are really, I would say, three primary things, and most of it is almost all geared around product and technology. So one is just the increasing the reliability and resiliency that Jason touched on in his remarks. The second is continuing to expand our credit capabilities and launching with more and more customers, which, again, Jason also highlighted. And then the third area is expanding our Banking-as-a-Service-like capabilities.\n\nSo more cash in, cash out, money in, money out type capabilities in support of our customers is we're just finding more and more of our customers and potential customers are -- have some aspect of a neo bank-like aspirations in their business, where they're taking deposits of multiple forms and then want to offer their customers flexibility to use those in different ways. And so those are really the three primary focus areas of our investment. We're also investing in additional go-to-market resources both in sales in North America, as well as Europe. But I would say the bulk of it is mostly geared at product and technology.\n\nRayna Kumar -- UBS -- Analyst\n\nVery helpful. And just touching on your credit platform announcement, you mentioned 40 new credit APIs. Do you expect that to help Marqeta gain traction with more traditional financial institutions? And any key milestones we should watch out for?\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. So thanks, Rayna. So given the massive opportunity to modernize credit, this is a consistent investment in our product road map. And you're right, as we recently launched more than 40 new credit APIs, it really enables our customers to more easily design, test and launch new card programs.\n\nAnd the two, obviously, the aspects of the program is really the flexible rewards engine and the newly announced instant credit decisioning. We also recently announced the GreenLight Family Card, which is an expansion our FNBO relationship. So I'd say we're still in the early days of our credit journey, but it's important for us to build trust within the space. And then when it comes to large FI progress, they want similar capabilities to the disruptors, I mean, making them really a great potential partners for Marqeta.\n\nOur level of engagement there has increased. Large FIs typically have long-standing partnerships that will take time for establish ourselves. Our goal with these programs to get a foot in door and expand over time and that we can help them in areas that we want to -- where they want to be more innovative. So currently, revenue is not a big driver of our growth.\n\nI mean, really, the platform puts us in a great position as FIs look to build for the future. And we can do this faster. We can do this with a shorter time to market for a large FI. And I think most importantly is lower total cost of ownership to our highly configurable cloud-based platform.\n\nSo while making inroads will take time in these sales cycles with the large FIs, we're encouraged by the fact that these conversations have increased greatly over the last year and many of them specifically around credit and other issuing processing capabilities of Marqeta.\n\nRayna Kumar -- UBS -- Analyst\n\nGreat. Thank you.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThe next question we have is from Darrin Peller from Wolfe Research.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, guys. Thanks. When we look at the actual results this quarter, they were very strong across volume, gross profit. Really, it underscores the trends you're having with your core customers, as you mentioned.\n\nBut what's interesting is when we hear your guidance, it really does imply an element of conservatism that doesn't seem to be showing up in the data from the past quarter. I guess, first of all, are you seeing anything in the current trends themselves in terms of a change in behavior from your current customers? Or are you just trying to be conservative given what you hear in -- or what we're all hearing about in the market about different end markets you service? And then more importantly, if you could just give us a sense of what are the top couple of verticals that you are really most excited about having sustainability. Expense management has been one, obviously. And I mean, there's been a handful of really great new places you've got.\n\nSo if you could just give us some color. Thanks.\n\nMike Milotich -- Chief Financial Officer\n\nYeah. Sure. So Darrin, I feel we are not being, I guess, conservative, which assume that we're maybe sort of being a little bit biased. I would say we really feel like we're being cautious and sort of really assessing what's happening in the market and sort of pausing for now to see how it plays out.\n\nSo it's not anything specifically in our numbers. It's more that we are hearing from some customers. So there -- we really have two types of customers, if I step back. There are customers where our card value proposition is sort of integral to their core business.\n\nAnd then we have customers where they're using the card program more for an increased engagement and maybe an additional monetization play. And what we're hearing from some customers is where it's core to their business, there were areas where they were maybe going to launch another product with us or expand to another geography. And they're saying, I'm going to pause and wait a little bit and see what happens. And then customers where it's more of a monetization play and maybe not central to their business, they're saying, well, we're scaling back on some investment, and a lot of that is going to be directed at the core business and not some of the additional new things we're going to try to do.\n\nSo it's not broad-based yet, but we have heard it from a few customers. And so we really just want to be cautious right now. And then certainly, we did expect a decent amount of growth from these newer customers, as I mentioned. So people that have signed in the last 12 months or so, as well as some of the new crypto customers.\n\nIf you went back a few months, we were really expecting a nice ramp on those customers similar to what we've seen in the past. But what we now feel is going to happen is it's going to move a little bit more slowly as people are not going to invest quite as much in the launch of their programs because the launch of a new card program typically requires a good amount of upfront investment to drive that usage. And so that's really what we're cautious about is to see how it plays out over the next couple of months. And hopefully, the pausing that we're maybe hearing from some people will pass, and we'll get back to performing as we have earlier in the year.\n\nThe only other thing I would point out about Q3, Darrin, is just that if you -- we just have some very tough comps as well, and that's the reason for the lower growth. So BNPL, if you look back at last year, the Q4 revenue was higher than all of the first half, so higher than Q1 and Q2 overall last year. So that's a tough comp. In expense management, Divvy flipped their business to us from a competitor, and that started in late 2021 and sort of scaled through the first half.\n\nSo it was sort of on full blast, if you will, by the second half. And so those are just some of the factors that are informing our guide.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nThat's really helpful. Jason, just one quick follow-up. I mean, from all the deals you've been winning, it does seem like you guys are pulling ahead of even the neo issuer processor competitors out there that we were -- we would hear more about a year ago, let's say. I mean, are you seeing any real changes from a competitive standpoint where it's -- you pulled ahead of the pack in some ways or any other nuances?\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. So we have a proven scaled platform and are in a very strong financial position to continue to invest. So in regards to kind of the small folks that you referred to -- and we have significantly more experience and scale. I mean, these competitors aren't even close to the same proven track record that we have.\n\nTo win large volumes, we need to be able to show both. I mean, we've had 20 days -- 20% of the days in Q2 of '22, we processed over $500 million in TPV. That's an average of more than once a week. Marqeta has taken companies from start-up to enterprise.\n\nWe have involved early with household names like DoorDash, Instacart, Block, multiple BNPL players. When customers are choosing critical platform/partner experience, an expertise will matter. So running their core operations or revenue-generating businesses on our platform, we have a first-mover advantage in modern card issuing. I would also say, specifically within issuing and processing, smaller competitors may need to start preserving cash to extend runway.\n\nWe have $1.7 billion in liquidity. We're cash flow-positive in this quarter. We can invest in our platform and maintain our financial position. So we are hiring.\n\nWe're going to hire the same amount of people we did in 2021. We're investing in product. We're investing in technology. We're spreading our wings even further and allows us basically -- because our scale, our size, our expertise, and liquidity really make us the preferred partner for companies seeking modern card issuing.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nGreat. Thanks, guys.\n\nOperator\n\nThe next question we have is from Ramsey El-Assal from Barclays.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Jason, I was wondering if you could elaborate a little bit on your rationale and sort of timing of kind of transitioning right now out of the role that you're in. I'm just curious as to sort of what is the -- some of the deeper reasoning and maybe what your future plans might be.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nRamsey, we're having real difficulty trying to hear you. You talked about transition out of?\n\nRamsey El-Assal -- Barclays -- Analyst\n\nLet me -- is that any better?\n\nJason Gardner -- Founder and Chief Executive Officer\n\nMuch better.\n\nMike Milotich -- Chief Financial Officer\n\nMuch better.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nSorry, my apologies. I wanted to ask Jason to elaborate a little bit on the -- his reasoning for transitioning out of the CEO role at this point and maybe any commentary on what the future plans might be. Just curious sort of the timing and the reasoning.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. So it basically came down to when I kicked off the succession planning process, I recognized that it will be a better CEO to lead Marqeta at this upcoming stage of growth. I mean, really, I'm not the best person to execute at this upcoming stage of growth. I am just getting way ahead of this.\n\nAnd really, this is what is best for Marqeta. I'm being proactive in the decision making, looking at the future growth and how the business will become more complex as we diversify. And Ramsey, to be clear, I am starting our succession planning, not leaving the CEO job for several months at least and then to be very active as executive chairman. So I would say, too, is that I will entirely support Marqeta as executive chairman once we hire the CEO.\n\nAnd also, it's like in the past few years, I've come to realize that I'm a pretty good entrepreneur. I'm a gold medalist, a professional athlete when it comes to building a business. And in the time since we've gone public, I have also begun to realize that I am not the best person to execute at this stage of growth. I want to hire the best person for this stage.\n\nPeople, products, and customers is where I'm going to spend my time and my scale on behalf of Marqeta, our customers and our investors. I'm entirely committed to this company's success. This is where I'll be the best for Marqeta will benefit from the focus. As an entrepreneur, Marqeta is my baby, kind of my youngest child.\n\nI care deeply for it. I'm its founder and its largest shareholder. So it's my duty as the Founder, chairman, CEO, and largest shareholder to make the best, most prudent decisions in service to Marqeta, our people, our customers, and our shareholders.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nI appreciate that. That's a great and honest response.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nThank you.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nMaybe I can ask a quick follow-up then, which is on the additional services, meaning the services not tied to TPV, can you give us a little more sense of the opportunity to kind of expand that part of your business for that to become kind of a bigger long-term driver when we think about how revenues will trend over time?\n\nMike Milotich -- Chief Financial Officer\n\nYeah. Sure. So where we're seeing the benefits there, Ramsey, is just the expertise and the scale with which we can do things on behalf of our customers, particularly if they're newer to the space. It's just they would much rather buy those services from us, where not only can we pass on some of our scale to them, but we can just -- we're already experts at it.\n\nSo when it comes to if you're launching a new consumer program and you need to handle disputes, if you want to do know your customer, know your business-type checks, right, you need to order cards for your program. Like these are things that aren't necessarily going to be core to an innovator's business. And we just have rich experience and expertise there that they can leverage. And so what we're finding over time as we keep growing into new verticals and expanding our customer base that more and more people are taking it up -- taking us up on it to say, it would be nice if you would just handle that aspect of it.\n\nAnd it's relatively small in terms of the overall size of our revenue, but it is growing faster. And because it doesn't come with the same cost of revenue dynamics, then it's helpful to the gross margin.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGreat. Very helpful. Appreciate it.\n\nOperator\n\n[Operator instructions] The next question we have is from Sanjay Sakhrani from KBW.\n\nSanjay Sakhrani -- KBW -- Analyst\n\nThank you. A couple of follow-ups. One to Darrin's question, another one. Mike, just a follow-up.\n\nHave you now sort of taken -- given all the fintech caution, have you taken out growth that you were expecting in the second half before out of the equation? And then how does this cycle into next year? And then maybe just a follow-up question for Jason. What exact attributes are we looking for this new person that might come in to take the company in the direction you intend it to go?\n\nMike Milotich -- Chief Financial Officer\n\nYeah. So to answer your first question, Sanjay, so what we're doing is this is mostly the impact of much newer customers who would be very small revenue in the last couple of quarters, but we were expecting to ramp significantly. So if you think about the way our business works, right, once we sign a deal that might take a customer six months to connect to the platform and then anywhere from one to three quarters to really ramp their business to scale before it gets -- it starts to hit a nice run rate. And what we're really saying is for those newer customers, we don't think it's going to be one to three quarters.\n\nIt might take longer because they're not going to invest behind it like they have in the past. And so it could have some implications for '23. But right now, I would say, minor unless we really go into recession and things -- that investment doesn't become a pause but becomes more of a permanent decision. But right now, what we're hearing from customers is that everybody is a little bit in a wait-and-see mode or they're saying, well, I'm going to invest, but less than I was originally planning.\n\nAnd so I might ramp over a longer period of time. At this point, we don't think it has significant implications for '23. But obviously, we'll see what happens over the next couple of months, and that will be a bigger determining factor.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. And Sanjay, so being transparent is a core tenet. It was actually one of the core tenets when I started the business. And I felt really strongly about telling what our plan is today because I felt it just will allow us really to attract, select and hire the best CEO possible.\n\nSo the next stage is really as we begin to diversify our business, we head into more geographies, we add more products and features and functions. To start the succession process now and get sort of way ahead, which is even more complexity in the business in the coming years, I thought was really the right thing to do, right thing to do for the business. And I felt, as I mentioned, it's kind of like my duty as the founder and CEO to make sure that we're setting ourselves up for success in the future. And I want that as the chairman, the founder, and the largest shareholder in the business.\n\nSo as I think about what's next in regards to the attributes of this person, it's really experience, experience running a large public company or being involved with an executive team of a large public company, understanding the complexities of running a business-like payment, really seeing around corners and what's next. And for me, too, is I love our people, I love our products, and I love our customers. I can be far more effective by focusing on those three things and not focusing on the day-to-day duties of running a public company if I can work with somebody in full support of them to go really build for the future with those attributes with that expertise of running a type of business at scale like Marqeta, then we'll all be successful in that process. So that really comes down to as far as the attributes.\n\nBut I thought the transparency was really important because that really allow us to have really open conversations with a whole host of people out there. And I think there's a lot of great people out there who would be very interested in being the CEO of an amazing business like Marqeta. And I'm really looking forward to having a lot of those conversations in the coming weeks and months.\n\nSanjay Sakhrani -- KBW -- Analyst\n\nThanks. Appreciate it.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThe next question we have is from Ashwin Shirvaikar from Citi.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nJason, happy for you that you have the choice to do what you're doing. That's great.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nThank you.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nSo because you mentioned sort of the pacing of client decisions and decision-making and ramps and things like that, I just wanted to get more color on a couple of different lines. One is, would you expect sort of more traction with, say, Powered by versus Managed by in terms of your offerings? And then the second thing I want to ask is maybe younger, smaller fintechs are worrying more about their cash flow and stretching out their ramps, but you do have a very large component of clients, such as Block, JPMorgan, Goldman, that don't necessarily worry about that. I wanted to kind of clarify how widespread the concern or caution is from your perspective.\n\nGot it. A quick clarification. Square, 69%. If you remove Afterpay, are you able to comment the sort of apples-to-apples, how it used to be with and without Afterpay? I don't know if you are --\n\nMike Milotich -- Chief Financial Officer\n\nYeah. You -- yes, Ashwin, you don't miss much as usual. So yes, Afterpay is a factor. It was only in two months for last quarter, and it's in for the full quarter.\n\nSo that is one of the factors. The other factor is just really strong Cash App engagement, and you heard them talk a little bit about this last week. But they're just seeing strong engagement, in part due to more inflows from tax refunds. So it really is about the strength of Block and not that our all other customers are slowing because that's not really the factor here.\n\nAnd as we've always said, when it comes to this concentration, we obviously think it will go down over time. But we don't want it to go down because Block slows, right? We want it to go down because we're very successful in diversifying our business. And our customers outside of our top five, their TPV this quarter grew more than four times faster than our top five. So we are growing quickly and diversifying.\n\nBut Block not only acquired a company that we already had a strong relationship with, but they're just really executing well, and that's causing the percentage to increase on our side in terms of revenue concentration.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThe next question we have is from Timothy Chiodo from Credit Suisse.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nExcellent. Thanks a lot. So I think we've covered a lot of the main topics pretty well. So I want to go to something that's more of a product topic, which is around secured credit cards.\n\nSo Chime, a large neo bank, has had a lot of success with a secured credit card. And I wanted to see if you could maybe talk around your capabilities there, either an offering you might either have or could offer to either your existing neo bank customers or potentially bring on new neo bank customers. And then the subcomponent to that is maybe you could just talk about the complexity associated with the secured credit card relative to a regular credit card. In other words, would you be able to do program management right upfront for secured credit cards? Maybe it's slightly more similar to debit, maybe not.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nWell, sort of. So a secured credit card allows the consumer to actually build credit with that card. You're making an assumption, they don't have credit to actually go build that credit. So they -- it's basically a two-pronged approach to help the consumer, which is a secured credit card is they put, say, $500 or $1,000 upfront and then build credit by spending that money over time.\n\nIt's a fairly straightforward way of people who have no credit to basically go and build that credit. It's something that is a line item, I would say, on our product road map. I mean, like any great technology company, we'd love to go chase all the opportunities out there. And Chime has done an amazing job, and Chris is a great leader and they built a tremendous business.\n\nFor now, our customers are not asking for this. And we see it in regards to future is, yes, it's something that we think is important. It's something that we may invest in. As I mentioned, it's a line item on our road map.\n\nBut for right now, it's something that's not strategic in the present to all the things we want to do, especially within credit, and then focusing on the companies, whether it's disruptors, digital banks, tech giants and large financial institutions. So I like the product. It's just not something that we've thought about investing in today.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nOK. Excellent. Thank you for that, all that context. I appreciate it.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. The next question we have is from Bob Napoli from William Blair.\n\nBob Napoli -- William Blair -- Analyst\n\nThank you, and good afternoon. Jason, always knew you as a serial entrepreneur, a gold medal winner for sure. Should be -- good luck to you.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nThank you.\n\nBob Napoli -- William Blair -- Analyst\n\nOne thing we haven't touched on is your -- I mean, key focus for you is international. And I was just wondering if you could give an update there on international. And you do have a large war chest. Some of these fintechs and a lot of some of them are international maybe are hitting the wall a little bit from a liquidity perspective, maybe -- that Marqeta would use its balance sheet to add to its portfolio, if you would.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. So I think there's a -- there's two questions there. I think one is about international. So we definitely see a very strong appetite for Marqeta's modern card issuing platform globally.\n\nWe talked about a couple of things in our prepared remarks. Our partnership with Western Union, I mean, Western Union is a very large established money movement company leveraging our innovative platform in Europe. After years of strong traction and growth in Europe, we have great momentum and a growing reputation in the market. We had a meaningful-sized operation on the ground in Europe as well.\n\nAnd then also, we talked about is partnering with Mastercard in Australia to power the launch of Opal Plus for transport in New South Wales. This is a very innovative use case on our platform in the transport vertical. And this is -- this partnership is one of Marqeta's first in the transit vertical, showing the flexibility of our modern platform and the ability to support new use cases. So we're actively laying the groundwork to launch in many new markets.\n\nOur approach to those new markets will mirror approach in building our U.S. business. So our -- and our customers, too. We have a lot of customers in the U.S.\n\nthat want to go internationally. A true benefit of our platform is you integrate once and you can launch anywhere, and we think that's really important as our customers decide to focus around the world. So -- going to like investment strategy, I think number one is, and I said this a couple of times, is like we are hiring. We are investing more in the platform.\n\nWe're looking to build out more features and functions based on where we think the world is going and where our customers are telling us that we want to go. And then we also see great opportunity within the M&A space. So because of where we're at today in the sort of the macroeconomic environment and companies are -- and a lot of companies in fintech -- I mean, this has been published over the last couple of years. I mean, the amount of investment flowing into fintech is head-spinning.\n\nAnd they've broken down a lot of different pieces. There's a lot of great companies out there that are relatively small that could be very strategic to Marqeta. So we have been actively as a corp dev department really looking and scoping out like what is out there and how can we not only increase our road map but add new features and functions to our platform that allow us to grow, expand and build even deeper moats and taller walls around our technology. So we're pretty excited about what we're seeing out there.\n\nAnd obviously, more to talk about here in the coming quarters as we begin to execute on that plan.\n\nBob Napoli -- William Blair -- Analyst\n\nGreat. Thank you. Appreciate it.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThe last question we have is from Andrew Jeffrey from Truist Securities.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nHi. Good afternoon. Appreciate you squeezing me in. Appreciate all the color also on the vertical performance.\n\nJason, you highlight Western Union as a new customer. I wonder if you could comment more broadly on cross-border aspirations, thinking about some of the treasury management or cross-border capital providers, companies like Bakkt or dLo. Just generally, is that an area that you think offers fertile growth for Marqeta over time?\n\nJason Gardner -- Founder and Chief Executive Officer\n\nWell, specifically dLocal is an acquirer, mostly out of South America. I mean, we don't necessarily focus on the acquiring side of the payments ecosystem. There's thousands of companies that we talked about in that space. There's a few hundred within issuing and processing.\n\nIt's just orders of magnitude more complex. And then as customers like Bakkt and others, especially in the expense management space, begin to spread their wings globally, this is, as I pointed out several times, the real value proposition of what we provide. And this is a core tenet of how we go and build products, which is we want you to be able to integrate once and then launch anywhere versus the legacy providers. They might have a dozen different systems that you need to integrate with in different parts of the world.\n\nSo on the international strategy, when we go out and we talk to companies, especially scaled companies that are looking to grow internationally, this is something that we really, really talk about. I mean, we've announced that we're in 39 countries today. We operate businesses all over the world. Customers are building in Australia, coming to the United States, United States to Australia, Australia to Europe, I mean, this is really core to our platform.\n\nAnd our customers are just increasingly relying on the global functionality of our platform. And we see international markets as really a driver of our long-term growth. So we'll continue to invest in those areas as these companies want to build more in our platform. And I think we don't talk about this enough, which is just simply lowering total cost of ownership.\n\nTo have to go integrate with a dozen different platforms as a provider is very, very expensive. So when you do it once, that total cost of ownership or that soft dollar cost impact to your business is significantly less with Marqeta than anybody else.\n\nMike Milotich -- Chief Financial Officer\n\nAnd just -- if I could add just one thing, Andrew, I think that as we look to continue to expand our money movement capabilities, so even today, obviously, we do more than just card issuing. We support a lot of more Banking as a Service and money-moving capabilities. And as we continue to expand those, certainly, some of those opportunities will be in cross-border, and that is something I would say that we definitely are thinking about in the coming years.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nAppreciate it. Thank you.\n\nOperator\n\nThank you, sir. Ladies and gentlemen, we have reached the end of our question-and-answer session. I would like to turn the call back to Jason Gardner for closing remarks.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nThank you, everybody. As always, I appreciate everyone's time, especially joining us for this call. Very much looking forward for the updates in our next quarterly call. Everyone, stay safe and have a great rest of the day.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStacey Finerman -- Vice President, Investor Relations\n\nJason Gardner -- Founder and Chief Executive Officer\n\nMike Milotich -- Chief Financial Officer\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nRayna Kumar -- UBS -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nSanjay Sakhrani -- KBW -- Analyst\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nBob Napoli -- William Blair -- Analyst\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nMore MQ analysis\n\nAll earnings call transcripts"
}