{
  "companyName": "Lumentum Holdings",
  "companyTicker": "LITE",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/lumentum-holdings-lite-q4-2022-earnings-call-trans/",
  "content": "Lumentum Holdings (LITE 1.52%)\nQ4 2022 Earnings Call\nAug 16, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Lumentum Holdings fourth quarter fiscal year 2022 earnings call. [Operator instructions] Please also note today's event is being recorded for replay purposes. [Operator instructions] At this time, I'd like to turn the conference call over to Kathy Ta, vice president of investor relations. Ms.\n\nTa, please go ahead.\n\nKathy Ta -- Vice President, Investor Relations\n\nThank you, operator. Welcome to Lumentum's fiscal fourth quarter 2022 earnings call. This is Kathy Ta, Lumentum's vice president of investor relations. Joining me today are Alan Lowe, president and chief executive officer; Wajid Ali, chief financial officer; and Chris Coldren, senior vice president and chief strategy and corporate development officer.\n\nToday's call will include forward-looking statements, including statements regarding our expectations regarding our two recent acquisitions, including market opportunity, expected synergies, financial and operating results, and expectations regarding accretion, strategies of the combined company and benefits to customers in the markets in which we operate, as well as the impact of COVID-19 on our business and continuing uncertainty in this regard, including macroeconomic trends, trends, and expectations for our products and technology, our markets, market opportunity and customers, and our expected financial performance, including our guidance, as well as statements regarding our future revenues, our financial model, and our margin targets. These statements are subject to risks and uncertainties that could cause actual results to differ materially from our current expectations, particularly the risk factors described in our SEC filings. We encourage you to review our most recent filings with the SEC, particularly the risk factors described in the quarterly report on Form 10-Q for the quarter ended April 2, 2022, and those in the 10-K for the fiscal year ended July 2, 2022, to be filed by Lumentum with the SEC within 60 days of our fiscal year end. The forward-looking statements provided during this call are based on Lumentum's reasonable beliefs and expectations as of today.\n\nLumentum undertakes no obligation to update these statements, except as required by applicable law. Please also note, unless otherwise stated, all financial results and projections discussed in this call are non-GAAP. Non-GAAP financials are not to be considered as a substitute for or superior to financials prepared in accordance with GAAP. Lumentum's press release for the fiscal fourth quarter 2022 results and accompanying supplemental slides are available on our website at www.lumentum.com under the Investors section.\n\nThis includes additional details about our non-GAAP financial measures and a reconciliation between our historical GAAP and non-GAAP results. With that, I'll turn the call over to Alan.\n\nAlan Lowe -- President and Chief Executive Officer\n\nThank you, Kathy, and good morning, everyone. This is truly an exciting time for Lumentum. We have an expanding set of use cases for our market-leading photonics products. With the close of NeoPhotonics and yesterday's announced purchase of IPG's telecom transmission product lines, we have a more comprehensive product portfolio than ever before.\n\nWe expect fiscal '23 revenue to be up more than 25% from fiscal '22 at the midpoint of our outlook. And as I look ahead, we forecast healthy double-digit growth in our telecom and datacom business over a multiyear period. In fiscal '22, we achieved record revenue in datacom EMLs, coherent components, pump lasers, tunable products, and sub-sea components with company profitability above expectations. Fiscal fourth quarter revenue was above our midpoint with both operating margin and earnings per share exceeding the top end of our guidance.\n\nWe are well-positioned for double-digit growth into fiscal '23 and beyond due to strong fundamental drivers in our telecom and datacom businesses. On August 3, we completed our acquisition of NeoPhotonics, which increases Lumentum's exposure to the rapidly growing 400 gig and above optical communication opportunities, creates an even better partner for our customers and expands our photonics toolkit into areas, such as ZR and ZR+ modules, silicon photonics, high-bandwidth coherent components, ultra-narrow linewidth external cavity tunable lasers, and RF integrated circuits. The feedback from our customers on this transaction has been very positive, as they appreciate the logic of adding NeoPhotonics products and capabilities to our portfolio. I am also delighted to welcome the talented NeoPhotonics team to the company, and I can't wait to see what our combined innovation engine comes up with next.\n\nYesterday, we announced the purchase of IPG's telecom transmission product lines. As we have mentioned previously, there is a significant opportunity in providing tunable transceivers into the cable and wireless network operator market. This acquisition augments our product offering addressing this opportunity. This acquisition also brings a talented team developing communication ICs, including coherent DSPs, which complements the IC capabilities we obtained from the NeoPhotonics acquisition.\n\nThis brings vertical integration opportunities in future coherent transceivers in addition to our 400G ZR and ZR+ products, including those targeting opportunities within the data center and at the edge of the network. We are making progress to increase the supply of third-party materials and ICs that are limiting our ability to meet the very strong customer demand for our telecom products. The diligent work of our supply chain team enabled a 16% sequential growth in telecom, datacom revenue in the fourth quarter, but demand still exceeded supply by approximately $100 million. We expect sequential growth, again, in the first quarter.\n\nWe do, however, expect shortages to continue at least until the first half of calendar 2023. Now let me provide some detail on our fourth quarter and full year results. As I mentioned earlier, telecom, datacom revenue was up 16% quarter on quarter. In fiscal '22, our 10G tunable transceiver products achieved record revenues, with particular strength in metro access and fiber deep applications for cable and wireless networking customers.\n\nWe are investing to double our manufacturing capacity for our 10G and upcoming 25G tunable transceiver products in our wafer fab and our back-end assembly and test factories, supporting the rapid transition to our differentiated technology by cable MSO and wireless network operator customers to support their increasing needs for bandwidth. In fiscal '22, we also set new revenue records for our sub-sea components, which were up 65% year over year and for our terrestrial pump lasers, which were up 49% year over year. Typically, increases in sales of these products is a leading indicator of future demand, which adds to our confidence of continued growth in our telecom product lines. In the quarter, ROADM revenue grew 23% sequentially.\n\nWhile ROADM growth has been slowed by IC supply shortages, the mix continues to shift to newer, more advanced products. In Q4, high port count and MxN ROADMs comprised over 70% of the revenue mix. This richening of the mix toward newer and more advanced ROADMs is consistent with our customers being in the early phases of new network deployments. It is also another leading indicator of future demand for our telecom products, including transmission products, which we bolstered with the NeoPhotonics acquisition.\n\nIn Datacom, as expected, we grew EML revenue to a new quarterly record in the fourth quarter and achieved a new annual record for fiscal '22. We nearly doubled our internal manufacturing capacity for EML products in fiscal '22, enabling us to better support robust customer demand for 100G per lane solutions. We are also driving the next phase of datacom industry road map with our 200G per lane EMLs for 1.6 terabit per second applications. We expect these to enter production as we exit fiscal '23 and are engaged with multiple customers in design-in activities for these leading-edge chips.\n\nLooking ahead to our first quarter, we expect telecom and datacom revenue to be up sequentially due to strong demand and improvements in IC supply. While growth continues to be gated by IC supply, we believe that we will shrink the gap between supply and demand from the more than $100 million level in Q4 to approximately $75 million in Q1. Turning to industrial and consumer. Q4 revenue was down from Q3 due to normal seasonality in 3D sensing.\n\nWe are executing on our strategy to expand our 3D sensing and LiDAR platforms into applications beyond smartphones. As we've discussed previously, our product pipeline for automotive, industrial and consumer use cases is growing. In automotive, we are ramping production of multi-junction VCSEL arrays, long-range LiDAR products and products for in-cabin driver monitoring systems. We are also the supplier of record for building automation and occupant-sensing reference designs.\n\nIn the consumer space, we are working closely with multiple customers for developing extended reality solutions. While we execute on our long-term strategy in 3D sensing, as we have mentioned previously, we expect share normalization and normal price reductions in the coming smartphone cycle. We expect smartphone 3D sensing revenue in fiscal '23 to be reduced by approximately 40% to 50% from last year's run rate, starting from our first fiscal quarter. As such, we expect first quarter industrial and consumer revenue to be up only modestly from the prior quarter.\n\nWe are still optimistic about our 3D sensing business applications in automotive, the metaverse and industrial begin to ramp. Underscoring this, in the fourth quarter, we recognized approximately $2 million in revenue from automotive applications, and we expect this to grow in the first quarter. In fiscal '22, our commercial lasers revenue was up 59% from fiscal '21. In the fourth quarter, revenue was up 39% from the same quarter last year.\n\nApproximately half of the revenue was driven by fiber lasers serving industrial applications, with the other half derived from ultrafast lasers, solid-state lasers, gas lasers and our laser service business. These solid results reflect a growing set of applications, introduction of new products and growth into new markets and with new customers, such as in solar cell and EV battery processing. Looking ahead to the first quarter, we expect laser revenue to grow quarter on quarter to a new record level. To summarize, I am very excited about our future.\n\nWe are well-positioned to capitalize on the increasing use of photonics and growing use cases across multiple end markets. Over the coming years, our products are critical to multiyear cloud and network infrastructure expansion, and deployments are accelerating. Underscoring this at the midpoint of our revenue guidance, we expect first quarter telecom, datacom, and lasers revenue to be up over $130 million or 45% compared to the same quarter last year. About half of this growth is organic despite ongoing supply constraints.\n\nTo capitalize on these trends in communications, consumer and industrial end markets, we are accelerating R&D investments during fiscal '23, which we believe will accelerate top-line growth in fiscal '24 and beyond. These investments include coherent DSPs, 800G-and-higher-speed communication technologies, laser sources for high-performance computing architectures and the adoption of AI in data centers, industrial sensing and 3D imaging, LiDAR and in-cabin sensing for automotive and industrial lasers for electric vehicle and battery manufacturing. Wajid will quantify the impact of this on our fiscal '23 outlook. I would like to thank our employees around the world for all of their hard work and resilience that has put us in such a great position in our markets and to grow strongly over the coming years.\n\nWith that, I'll turn it over to Wajid.\n\nWajid Ali -- Chief Financial Officer\n\nThank you, Alan. Net revenue for the fourth quarter was $422.1 million, which exceeded the midpoint of our guidance range. Net revenue was up 6.8% sequentially and up 7.7% year on year. GAAP gross margin for the fourth quarter was 43%.\n\nGAAP operating margin was 13.1% and GAAP diluted net income per share was $0.49. Fourth quarter non-GAAP gross margin was 50.4%, which was up sequentially and year on year, primarily driven by higher revenue. During the quarter, we accumulated $8.2 million in extraordinary charges to acquire IC components from various brokers to satisfy customer demand. These incremental charges were excluded from the non-GAAP gross margin.\n\nFourth quarter non-GAAP operating margin was 28.8%, which increased sequentially and year on year due to higher revenue and was above the high end of our guidance range. Fourth quarter non-GAAP operating income was $121.6 million, and adjusted EBITDA was $142 million. Fourth quarter non-GAAP operating expenses totaled $91.1 million or 21.6% of revenue. SG&A expense was $41 million.\n\nR&D expense was $50.1 million. Other income and expense was a net income of $1.2 million on a non-GAAP basis. Fourth quarter non-GAAP net income was $105 million, and non-GAAP diluted net income per share was $1.47, which was above our guidance range provided on our last call. Our fully diluted share count for the fourth quarter was 71.5 million shares.\n\nOur non-GAAP tax rate remains 14.5%. Turning to the full year results. Fiscal '22 net revenue was $1.71 billion, which was down 1.7% from fiscal '21, primarily due to component shortages gating our ability to meet the strong demand, as Alan indicated earlier. GAAP gross margin for fiscal '22 was 46% and GAAP operating margin was 17.7% and GAAP diluted net income per share was $2.68.\n\nFull year fiscal non-GAAP gross margin was 51.6%, which was up 70 basis points relative to fiscal '21 due to product mix and lower relative manufacturing costs. Fiscal year '22 non-GAAP operating margin at 30.8% was flat from that of fiscal '21 and above our business model. Fiscal '22 non-GAAP operating income was $527 million and adjusted EBITDA was $608.6 million. For fiscal '22, our fully diluted share count was 74.2 million shares.\n\nNon-GAAP net income was $449.2 million and non-GAAP diluted net income per share was $6.05. Moving to the balance sheet. We generated $459.3 million in cash from operations in fiscal 2022, ending the year with cash and short-term investments at $2.55 billion. During the fourth quarter, we generated $114.3 million in cash from operations and purchased 1.3 million shares for $103.3 million.\n\nAs of the end of the fourth quarter, we have purchased a total of 9.1 million Lumentum shares in the last two fiscal years, reflecting our confidence in long-term growth. Turning to segment details. Fourth quarter optical communications segment revenue at $370.9 million increased 8% sequentially due to improved component supply and robust demand in our telecom business. Optical communications segment gross margin at 49.8% increased sequentially and year on year, primarily due to higher revenue.\n\nOur fourth quarter laser segment revenue at $51.2 million was flat sequentially and was up 39% year on year. Fourth quarter lasers gross margin at 54.5% was a new record for this business, driven by higher volumes and improved utilization. Before turning to our guidance, given the number of moving parts in our business, including the two acquisitions we just closed, I would like to add some color on our outlook for fiscal '23. Before synergies, these acquisitions are operating well below our target model, and we plan to accelerate our R&D spending to capture new opportunities that we have with our broader set of products and capabilities.\n\nWe also continue to experience supply chain challenges. And as previously discussed, we are experiencing share normalization in 3D sensing. Therefore, we would like to provide some expectations around the business and give a one-time fiscal 2023 financial outlook to aid investors in modeling the company. We expect that our largest 3D sensing customer will comprise between 10% to 15% of our company revenue in fiscal '23.\n\nAlso, we expect the second half of our fiscal year will have improved IC supply compared to the first half, which will allow growth to accelerate and result in second-half company revenue being larger than that of the first half. Based on all this, we expect fiscal '23 revenue to be in the range of $2.1 billion to $2.25 billion, with an operating margin in the range of 24% to 26% and earnings per share between $6 to $7. This fiscal '23 margin performance is below our target model due to acquisitions and accelerated R&D investments. However, our 50% gross margin and 30% operating margin model continues to be our target, as we execute on acquisition synergies and work down shortages in IC supply, and we begin to realize the benefits from the accelerated R&D investments, we expect to return to our target financial model.\n\nNow on to our guidance for the first quarter of fiscal '23, which is on a non-GAAP basis and is based on our assumptions as of today. We expect net revenue for the first quarter of fiscal '23 to be in the range of $490 million to $520 million. This includes approximately eight weeks of revenue from NeoPhotonics. As Alan indicated earlier, we are closing the gap between IC supply and our customers' demand for our products.\n\nOur Q1 guidance incorporates approximately $75 million of impact to revenue, driven by shortages of third-party components. Based on this, we project first quarter operating margin to be in the range of 25% to 27% and diluted net income per share to be in the range of $1.45 to $1.70. Our non-GAAP EPS guidance for the first quarter is based on a non-GAAP annual effective tax rate of 14.5%. These projections assume an approximate share count of 71.5 million shares.\n\nOur share count estimate of 71.5 million shares for Q1 non-GAAP EPS guidance utilizes the treasury stock method in deriving the number of shares. This reflects our intent to pay for the principal amount of our convertible debt in cash through operations or future financing. Given this is how we intend to operate the company, we will continue to use this method for the foreseeable future in deriving our non-GAAP EPS. For GAAP purposes, our Q1 EPS will follow accounting standard, ASU 2020-06 and the related if-converted method.\n\nWe expect this to result in a share count of approximately 96 million shares. Before wrapping up, I would like to offer some comments on the NeoPhotonics acquisition. Given the complementary nature of our business with that of NeoPhotonics, we expect to generate more than $50 million in annual run rate synergies within the next two years. Cost of goods synergies are expected to comprise more than 60% of the total, driven by manufacturing infrastructure and supply chain efficiencies.\n\nOperating expense synergies will be driven by aligning and integrating our organization and by serving a similar customer base. We are just two weeks into our integration work, and we'll provide updates on our progress in the coming quarters. With that, I'll turn the call back to Kathy to start the Q&A session. Kathy?\n\nKathy Ta -- Vice President, Investor Relations\n\n[Operator instructions] Operator, let's begin the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Alex Henderson of Needham. alex, your line is now open.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nThanks. Let me start off with just a clarification. I thought you said in the text of the presentation that you expected a 30% operating margin, yet your outlook for FY'23 is 24% to 26% operating margin. Is that the delta between the integration of NeoPhotonics and the acquisition from IPG that causes that? And could you clarify what you think these two acquisitions will do in terms of accretion or dilution to the FY'23 numbers?\n\nWajid Ali -- Chief Financial Officer\n\nSure. Hi, Alex. So the current year, we're going to be faced with some headwinds. Obviously, we had talked about the fact that we would go through a bit of a transition period with the acquisition of NeoPhotonics, and that would have a headwind on our overall operating model.\n\nNow in addition to that, with the latest purchase that we announced yesterday, that comes with increased R&D expenses as well as we invest in DSP technology. So the two of those things combined are having a headwind for fiscal year '23. Our 30% operating margin continues to be our target model. And as we work through the synergies from NeoPhotonics and as we get the benefit from the acquisition that we saw -- that we announced yesterday, we'll also see some incremental synergies within our NeoPhotonics product lines, specifically as we see ZR products ramp up.\n\nSo the two of those things combined should provide some leverage as well as bring in incremental earnings on a stand-alone basis as well. The NeoPhotonics acquisition is accretive day one. And so we're seeing some accretion even in our fiscal Q1 from that acquisition. The IPG acquisition is not accretive in Q1, and it will be a headwind during the year.\n\nI'd say, the two of them combined are still net accretive on a full year basis. Hopefully, that answers your question.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nYes. So I'm still confused. I thought you had said in the text of the presentation that you were expecting a 30% operating margin. Is that incorrect in the long-term target?\n\nWajid Ali -- Chief Financial Officer\n\nYes, yes. That continues to be our target model, yes.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nLong term?\n\nWajid Ali -- Chief Financial Officer\n\nSo we haven't changed our target model. It's our long-term target model, that's right.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nSo just going to the IPG stuff, and then I'll see the floor. Can you give us some sense of the scaling of that business? What kind of revenue base is attached to it or what kind of cost structure is attached to it?\n\nAlan Lowe -- President and Chief Executive Officer\n\nYeah, hi, Alex. Thanks for the question. The revenue is really not material at this point. We expect to be able to grow it with our salesforce and -- but it's still not going to move the needle much there.\n\nThe real gem there is the team and the progress that they've made on DSP technology. And so we're going to continue to make those investments. And in fact, ramp up those investments to be able to get out the first DSP, but also work with the team on the road map for future DSPs. So -- as with any kind of large-scale semiconductor development, it's not for the faint of heart.\n\nAnd there's incremental R&D needed to be able to develop leading-edge DSPs. And so we believe that we're positioned well to be able to make those investments and have those returns come in fiscal '24 and beyond.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nI see. So that's a fairly large investment in DSPs that you're making. OK. Thanks.\n\nAlan Lowe -- President and Chief Executive Officer\n\nYeah. Thanks, Alex.\n\nKathy Ta -- Vice President, Investor Relations\n\nThanks for the questions, Alex.\n\nOperator\n\nThank you. Our next question comes from George Notter of Jefferies. George, Your line is now open. Please go ahead.\n\nGeorge Notter -- Jefferies -- Analyst\n\nHi, guys. Thanks very much. I guess I wanted to ask about your comments on share normalization. If I look at the revenue guidance, it feels -- it layer in NeoPhotonics.\n\nIt feels like you're missing $55 million, $60-plus million in sales as we roll into the September quarter. Maybe talk about the impact on share normalization, what's going on there, what you expect, going forward, would be great. Thanks.\n\nAlan Lowe -- President and Chief Executive Officer\n\nSure, George. Thanks for the question. It's been -- I think we're on year six of smartphone ramps, and we've had a disproportionately very, very large share of that business. And we've been talking about share normalization for quite some time.\n\nIt's coming to that time. And as we said in the pre -- in the script, we expect the smartphone revenue for Lumentum to be down between 40% and 50% year on year, and we're starting to see that even in the first quarter. So we expect 3D sensing for smartphones to be up modestly in the first quarter. Whereas in prior years, this was the quarter where it would be dramatic, and so we're seeing share normalization starting as soon as this first quarter.\n\nGeorge Notter -- Jefferies -- Analyst\n\nAnd is this a permanent change in the business? And is there something just systematic to your products relative to your competitors that is creating that share normalization? Any more sort of root cause would be great.\n\nAlan Lowe -- President and Chief Executive Officer\n\nWell, I think root causes that any large-scale consumer electronics company wants to have diversity of supply. And they've been working on that for years. And I think finally, after six years, they've gotten more diversity of supply. That said, we are still working diligently with that customer, as well as other customers, to be the design partner of choice.\n\nAnd we expect that there will be fluctuations in share, and we expect to have moments of time where we gain a lot of that share back, but we'll have to see. I think what we've tried to do is provide the most likely outcome for not only Q1, but for the fiscal '23. And that's why we were very specific in that lower revenue from smartphones of 40% to 50% in the end.\n\nGeorge Notter -- Jefferies -- Analyst\n\nGot it. OK. Thank you very much. \n\nAlan Lowe -- President and Chief Executive Officer\n\nThanks, George.\n\nKathy Ta -- Vice President, Investor Relations\n\nThanks, George.\n\nOperator\n\nThank you. Our next question comes from Simon Leopold of Raymond James. Simon, your line is now open. Please go ahead.\n\nSimon Leopold -- Raymond James -- Analyst\n\nGreat. Appreciate you taking the question. First one for Wajid. You gave us, I think, some pretty good detail on what's going on with the convertible debt treatment and your commitment to settle in cash.\n\nCould you explain how it affects the balance sheet? I think it's my understanding that your debt also goes up higher. Just if you could walk us through that. And then I've got a follow-up on the telecom trend.\n\nWajid Ali -- Chief Financial Officer\n\nYeah. So the impact on the balance sheet will start to see less of an amortization of the debt discount back to the convertible debt. So that's certainly something that we'll call out in our fiscal Q1. I think the more important thing is, from a balance sheet standpoint, is that we'll start to -- we have a maturity in fiscal '24 -- March of '24 on the first $450 million of convertible debt.\n\nAnd so what you'll start seeing is us working our capital structure so that we can pay for that principal maturity by March of 2024. Now obviously, we have enough cash on the balance sheet to comfortably do that. And our expectation is that we should be able to generate sufficient cash in addition to what we currently have to be able to cover that. And then as you know, our next convertible debt isn't due until 2026, where we also have a similar commitment and similar plans.\n\nSo that's the reason we've chosen to take the accounting treatment the way that we have.\n\nSimon Leopold -- Raymond James -- Analyst\n\nAnd so the debt would go from about $1.9 billion to about $2.4 billion. Is that the right calculation?\n\nWajid Ali -- Chief Financial Officer\n\nThat's correct. That's about right, yeah.\n\nSimon Leopold -- Raymond James -- Analyst\n\nOK, great. Appreciate that. And then I wanted to see, Alan, you gave us some nice color on the ROADM trends, which happen to see that snapping back. Could you dig into a little bit about what you see going on in transmission? And then your views on the ZR market opportunities, now that you've got NeoPhotonics within the business.\n\nAnd I'm looking for this as more the sort of fiscal '23 longer-term outlook, not just next quarter.\n\nAlan Lowe -- President and Chief Executive Officer\n\nSure. Thanks, Simon. Yeah. I think ROADMs were up strongly, and we're probably the product line that were most constrained by IC supply.\n\nAnd so as that frees up, we should see continued growth in ROADMs. On the transmission side, the Coherent components -- high-speed Coherent components were up 250% year on year. We expect that to continue to grow as we come out with very high-performance modulators, tunable lasers and now with the addition of NeoPhotonics receivers and ultra-narrow linewidth external cavity tunable lasers. So pretty exciting times there on the transmission side.\n\nAnd as we talked about in the script, the 10 gig and soon-to-be 25 gig is really ramping steeply, and we're adding capacity to actually double that as the MSO market and wireless market is really adopting this for the higher bandwidth and the tunability of those products. On the ZR market, I think it's still fairly early days as we've been getting more and more into what the ZR and ZR+ products from NeoPhotonics into our portfolio, and we expect that to ramp up over the coming years. And then with the addition of the IPG acquisition from yesterday, our expectations are that we have the full portfolio of DSPs that then make us more competitive in that market. Again, though, we'll be relying on third-party suppliers for DSPs for quite some time, but we expect that that investment in DSP technology and the acquisition we've announced yesterday, will really put us in a very, very strong position in ZR, ZR+, and beyond.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you.\n\nKathy Ta -- Vice President, Investor Relations\n\nThanks, Simon.\n\nOperator\n\nOur next question comes from Tom O'Malley of Barclays. Tom, your line is now open. Please proceed.\n\nTom O'Malley -- Barclays -- Analyst\n\nHey, good morning, guys, and thanks for taking my question. I just wanted to dive back into the normalization of 3D sensing share. You guys have been pretty vocal about calling this out before. And you've also mentioned that in this coming year, you're going to be below that long-term guidance of kind of flattish, down 5%.\n\nBut in your prepared remarks here, you're saying that there's really no difference in terms of ASP degradation than normal. And when you just take where you guys have been historically from a share perspective down to even 50%, 50% share. You don't really even get close to that, debt down 40% or 50%. So could you just talk about any new trends that might be going on that may be weakening the coming year from a technology perspective? Or if there are potentially sockets that you had originally thought you would get that you're no longer in competition for or perhaps you've shipped in a little more than you would have thought originally? Just any color there just because that number is pretty extreme.\n\nChris Coldren -- Chief Strategy and Corporate Development Officer\n\nHey, Tom, thanks for the question. This is Chris. I guess I would roll back and say, if you look back a year or so, new chips were introduced that are smaller and lower priced, if you recall. And over the past year, though, we largely offset that reduction via share gains.\n\nSo over the past 12 months, I think we've had even higher than our historical outsized positions. So I guess I would argue that the share normalization effect is quite significant. And so if you layer on top of that a normal price reduction year over year for like-for-like type of chips, we end up with the kind of declines that we mentioned in the prepared remarks. There's nothing structural going on or changes that are impacting our outlook.\n\nIt really goes back to the share normalization combined with price reductions that are in the normal range for chips that have been sold, same year-over-year \"mature\" for a very rapid taste consumer electronics world.\n\nTom O'Malley -- Barclays -- Analyst\n\nHelpful. And then just on the supply chain, it seems like moving into September quarter, you're getting some ICs coming through the door that are loosening things up. Could you just talk to the cadence that you expect to see that loosen up through the December quarter? You're getting $25 million out of that $100 million right out of the gate, but do you see it further loosening into December? Or do you anticipate to continue carrying some of that constraint all the way through the end of the calendar year? Thank you.\n\nAlan Lowe -- President and Chief Executive Officer\n\nYeah, Tom. Our supply chain team has done a great job and has been relentless with our suppliers and has done a really great job. And I think one of the dynamics we have seen in the June quarter and even into the first half of the September quarter is less necessity for these broker spot buys. So the supply from the normal channel is getting better in many cases.\n\nNow that doesn't mean that we have all the ICs we need. We still are struggling for several of them, but I do expect that as the broker market becomes less relevant to us, we'll start seeing a better supply of chips. That said, we need to be getting chips in the next 30 days in order to impact our ability to produce product in the December quarter, and that's still constrained. And that's why we talked about having the supply shortages into the first half of calendar 2023.\n\nSo we do expect that the December quarter will be better than the September quarter but still highly constrained, given the strong demand we're seeing in our telecom products.\n\nTom O'Malley -- Barclays -- Analyst\n\nThank you, guys.\n\nAlan Lowe -- President and Chief Executive Officer\n\nThanks, Tom.\n\nKathy Ta -- Vice President, Investor Relations\n\nThanks, Tom.\n\nOperator\n\nOur next question comes from Meta Marshall of Morgan Stanley. Meta, your line is now open.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Maybe following up on the last question. Is kind of the loosening you're seeing of supply, is any of that from redesigns kind of coming into effect? Or is that mostly just from availability of kind of needed products becoming available? And then second question on -- just on the industrial lasers piece.\n\nYou noted some growth potential with growth in new markets, but just wanted to get a sense of is there any macro impact you're seeing just kind of on the core industrial lasers business. Thanks.\n\nAlan Lowe -- President and Chief Executive Officer\n\nSure, Meta. We -- as we talked about on prior calls, we have been doing some redesign work. So I'd say that that is helping. But I'd say, the general supply availability of semiconductors has gotten better, but still not where we need it to go.\n\nSo I'd say, it's a combination of both -- the heavier impact is the overall supply on some suppliers that were big problems for us six months ago that are really no longer a problem. And we're getting fewer surprises -- last-minute surprises that were very frequent in prior quarters. On the industrial lasers question, we are developing a lot of new lasers, both from fiber lasers -- higher-power fiber lasers, as well as ultrafast lasers, that allow us to get into new markets and new customers. And so what we're seeing is diversification of our customer base into new applications, and we mentioned the solar processing -- solar cell processing, as well as EV battery processing.\n\nAnd so those are big markets that are growing quickly that we believe we have a good inroad there that should lead us to continued growth through fiscal 2023 and beyond. As far as macro environment, we're not seeing any macro environment concerns, industrial production or lasers consumption. So far, so good on that front.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nKathy Ta -- Vice President, Investor Relations\n\nThanks, Meta.\n\nOperator\n\nThank you. Our next question comes from Christopher Rolland of Susquehanna. Christopher, your line is now open.\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nHi, guys. Thanks for the question. This one is probably for Wajid. Maybe if you can talk about some of the moving parts on gross margin opex into September.\n\nI know we have that combined op margin. But how that plays out? And then, I guess, the transaction closed at the beginning of August. So do we still have another third to embed into the December quarter? Thanks.\n\nWajid Ali -- Chief Financial Officer\n\nYeah, Chris. So moving into the first quarter from the fourth quarter, we're seeing modest improvements across all of our product lines. Now like Alan mentioned earlier, normally, we see a pretty big uptick moving into Q1 from Q4 with our 3D sensing business, we're not seeing as much of that. It is quite modest moving into Q1.\n\nOur gross margin profile, if you put aside NeoPhotonics for a moment, it's pretty similar to how we've been operating in fiscal Q4 with our business running right at our target model. Now once you layer in eight weeks of NeoPhotonics revenue, and as you know, the gross margins of that business is significantly lower than our target model, that is having an impact on the company, overall. The way to think about December, I think it's quite fair to say, yes, we would add in another one-third of revenue because we closed on August 3. So July revenues were not part of our fiscal Q1 guidance.\n\nSo that should certainly be there for fiscal Q2. So that is the right way to think about it.\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nOK, great. And then you guys talked about some broader opportunities for 3D sensing and investing there. Maybe you can talk about these opportunities, whether you think they can make a meaningful dent on what was left by your largest customer there? And then I think you also mentioned oxygen sensing as well. That sounds like a new market for me.\n\nI don't know if you can expand on that as well.\n\nChris Coldren -- Chief Strategy and Corporate Development Officer\n\nChris, this is Chris. Great questions. So I guess, starting off in terms of opportunities outside of our lead customer that we've -- has driven the majority of our revenue over the past several years. Certainly, the two big areas that always come up are extended reality and automotive.\n\nSo we play into extended reality, where eye tracking, gesture control, world-facing or for capturing the scene, those are all -- each of those separate uses requires a laser device. So that's expected to be a significant opportunity over the next several years. And as well in the auto space, where the dollar content is also significantly higher, we can capture perhaps tens of dollars per automobile, just at the laser level alone, and that number can be even higher in all solid-state LiDAR approaches, which we think believe -- will be the long-term winner in many LiDAR applications. I refer you back to, I think, earlier this year, we had an OFC analyst briefing.\n\nThe slides can be found on our Investor Relations website, where we highlight the dollar content opportunities in these applications, as well at that briefing, we highlighted that over the next -- in three years or so that we were expecting a minus 5% to plus 5% CAGR for this business. So as you can imagine, given the decline we're expecting this year that we do expect -- no crystal ball here, but a U- or V-shaped type recovery here in that business as these new applications start to ramp up and replace ultimately some of the lost revenue we have seen or expect in this coming year. Highlights, we said $2 million in the last quarter in automotive LiDAR at the laser chip level. And remember, laser chip level is much smaller than the modules that they go into.\n\nSo that's a reasonable chunk of market share, if you will, at the laser level. On the oxygen sensor, we're not participating in any chemical sensors or anything like that. What you may have heard is as you look to LiDAR as a form of imaging and industrial sensing that can be used in other applications in industrial settings, and we're investing in R&D to accelerate those kind of opportunities. I believe that answers the questions.\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nThat does. Thanks, Chris.\n\nKathy Ta -- Vice President, Investor Relations\n\nYes. Thanks, Chris.\n\nOperator\n\nThank you. Our next question comes from Samik Chatterjee of J.P. Morgan. Samik, your line is now open.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning. Thanks for taking my question. I guess for the first one, if I can increase as the long-term model, and you did reiterate the long-term model today.\n\nJust wanted to see if you can give us a sense of sort of the timing that you're thinking in terms of when you get back to the long-term model. The NeoPhotonics synergies that you've called out a $50 million over two years, but that doesn't get you all the way to the long-term model. So how should we be thinking? Is it a sort of a three-year plus target to get back to the long-term model? Any help there would be great. And then I have a follow-up.\n\nThank you.\n\nWajid Ali -- Chief Financial Officer\n\nYeah. So Samik, a couple of things. So first of all, thanks for the question. In terms of the long-term model, so if you take a look at what's happening this year versus where we were last year, so in last year, we ended up with gross margins at a company level above 51% and operating margins above 30%.\n\nAnd so as we called out this year, we actually expect our core business without NeoPhotonics to continue to operate within the 50-30 model at an approximate level, despite the fact that our largest customer is expected to be a 10% to 15% customer in fiscal year 2023. And that was primarily -- or all of it was a chip-based business, which has higher margins because of the way we service that market. And so the reason that's happening is because our lasers business and our telecom business and our datacom business are expected to improve in fiscal year 2023, and that's providing us with a lot of tailwind from an operating leverage standpoint over our fixed manufacturing costs. So that's one thing that we're expecting to continue into fiscal '24 and fiscal '25.\n\nIt's just that natural growth in that business will aid us just like it's helping us in fiscal year '23. So that's the first piece of it that I think we all should appreciate. The second part of it is, is the Neo synergies that you called out of $50 million, and we had said that we expect it to take us about two years to realize all those synergies through our P&L as we execute against some of the integration work that we're just starting right now, and we'll be providing updates on every single quarter. And then the third piece is the IPG purchase that we just did.\n\nAlan talked quite a bit about the DSP investments we're going to make. Those investments will have a very real benefit as we start shipping our own DSP into our ZR and our ZR+ products. I don't want to kind of get into the cost of goods sold and BOM cost benefits and having your own vertical integration of DSP, but I'm sure you can appreciate the type of gross margin benefit that we'll have as we start vertically integrating those two products. So I think those are the three things that really give us confidence in our ability to move back to the long-term model.\n\nWill it take 24 months or so to kind of realize all of that? Yes, probably. But that's how we're thinking about it. And I think that's what's important, given that our largest customer is not going to be a 10% to 15% customer versus what it was before.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nOK. Got it. That's helpful. And my follow-up, you talked about the vertical integration opportunity with IPGs, the acquisition of the IPG business or the DSP there.\n\nHow should we think about sort of milestones in terms of what's your expectation in getting the first DSP out? How should we think about sort of the opportunity on vertical integration and maybe more in the longer term become a merchant supplier of DSPs? How are you thinking about that?\n\nChris Coldren -- Chief Strategy and Corporate Development Officer\n\nHey, Samik. This is Chris. I would say a couple of things for that. First, maybe hitting the last point first.\n\nI mean, our focus is on internal supply vertical integration. We see Coherent technologies really proliferating beyond even the use cases we've just mentioned on ZR, ZR+ as we start talking about even opportunities within the data center or at the edge of networks. So that's why we feel this is a very important long-term investment. In terms of a timeline or milestones, maybe a little too early to set those in stone at this point, in that the acquisition just closed yesterday.\n\nBut I would say that we feel as we get out into the '24, '25 time frame, that's when we can have product not just developed, but designed into our -- or incorporated into our modules and starting to ramp that customers. There's a lot of milestones beyond just developing the chip. There's getting it into our modules and in customers to change, but it's a very exciting development. And also, I think something that maybe to highlight, it complements the IC capabilities that came over from NeoPhotonics as well, which were largely focused on drivers.\n\nSo when you look at it, and we end up with the silicon photonic, indium phosphide photonic integrated circuits, we end up high-speed drivers for those integrated circuits and now the digital coherent ASICs. It's really coming together the whole sort of control of both cost, vertical integration, supply chain and future transmission modules.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nOK, great. Thank you.\n\nKathy Ta -- Vice President, Investor Relations\n\nThanks, Samit.\n\nOperator\n\nThank you. Our next question comes from Rod Hall of Goldman Sachs. Rod, your line is now open. Please go ahead.\n\nAnmol Makkar -- Goldman Sachs -- Analyst\n\nHey, guys. This is Anmol on for Rod. I think most of the questions are answered, but I wanted to revisit and pick your thoughts about where are we in terms of ROADM and more probably the telecom cycle? And what innings do you think we are in terms of carrier investments? Thank you.\n\nAlan Lowe -- President and Chief Executive Officer\n\nYeah, good question. As we said in the script, there's a lot of leading indicators of our telecom business, one of which is our pump lasers and submarine components that are really the first things that needs to go into a network in order to start the deployment and then come ROADMs. And we're seeing, as we said, the advanced ROADMs, high port count and MxN being 70% of our revenue. ROADM revenue that is in Q4 as another leading indicator for telecom growth.\n\nAnd then you get the transmission products coming on, and we believe that we are in the early phases of these new network deployments, and there's quite a runway. And that's why we're confident not only in the growth rates we're expecting in fiscal '23, but our expectation is to have continued double-digit growth rates into the years beyond 2023. So I'd say, early stages, product development and product portfolio is better than it's ever been. And our confidence in the future growth is very, very high.\n\nAnmol Makkar -- Goldman Sachs -- Analyst\n\nAnd just a follow-up on that. So how flexible would you think you are in terms of tweaking the operational scale to preserve margins? I mean, should you see a normalization in demand since the space can be lumpy?\n\nAlan Lowe -- President and Chief Executive Officer\n\nYeah. Well, we haven't seen lumpiness in years, and I think that's really a result of the competitive dynamic being very, very different. And that is when one of our customers designed a new network or a new architecture for a network of their customers and they bet on a MxN, they buy it from us. And the dynamic is very, very different.\n\nSo we haven't seen that lumpiness for quite some time. I think as we free up supply of semiconductors, we'll see a smooth ramp-up, and that's why we talked about the second half of the fiscal year being stronger than the first half. As those ICs come free, we believe that our ROADM business will really thrive in the second half and continue to grow strongly as a result of new products and being in the early stages of deployments of these networks. Chris, do you have anything else to add on that?\n\nChris Coldren -- Chief Strategy and Corporate Development Officer\n\nYeah. I think the only thing I'd add is also our mix of customers in the networking space has evolved over time as well that this year, we have a lot of sales with the cloud customers, cable MSO, wireless operators directly. And so our leverage to specific carriers or network equipment manufacturers supplying to those carriers, has been a bit more diversified as well. So I think that adds to, as Alan said, there's a different competitive dynamic.\n\nSo you're not constantly worried about losing share on a very short-term basis to your competition, which can cause downward in your business. But also, there's a lot more smoothing or averaging out over end-network operators that we're now exposed to, that should provide a lot more stability than the last 10 years, if you will.\n\nAnmol Makkar -- Goldman Sachs -- Analyst\n\nGot it. Thanks, guys. Appreciate it.\n\nKathy Ta -- Vice President, Investor Relations\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Ananda Baruah of Loop Capital. Ananda, your line is now open. Please go ahead.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nYeah. Thanks, guys. Good morning. Lots of exciting stuff going on.\n\nJust a quick one, if I could. Could you give us a sense of how we should understand the ramping of conversations over time with the hyperscalers with regards to NeoPhotonics opportunity? And at what point do you believe these conversations can result in, I guess, an increased revenue scale in NeoPhotonics? And that is for me. Thanks a lot.\n\nChris Coldren -- Chief Strategy and Corporate Development Officer\n\nYeah, I think it's a lot broader than just cloud or cloud operators. But I would say, until August 3, we were separate businesses and operating completely separately. And at this point, we're very focused on getting in with the customers, as well as obviously integrating the business and really helping them understand the value proposition of the combined company. And we truly believe, whether it's the NeoPhotonics acquisition or the acquisition we announced yesterday, we're talking about smaller, in many ways, these days, subscale businesses, that being part of a larger entity, there's a lot more opportunities.\n\nAnd the kind of customers that you mentioned are very much worried about security of supply and the scale of their suppliers, and we think that's something that we can help both of the acquisitions that have closed off. Thanks for the question.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nDo you think it could be a '24 event? Is that unreasonable?\n\nChris Coldren -- Chief Strategy and Corporate Development Officer\n\nI think it does take a little bit of time. So I mean, I think there'll be benefits starting from day one, but we are really where it starts to accelerate, given the time to design-in and get design wins and how customers allocate share commitments to us and to competitors. Yes, I think it will accelerate through '24.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nThat's helpful. Thanks a lot, guys.\n\nOperator\n\nThank you. Our next question comes from Tim Savageaux of Northland Capital Markets. Tim, your line is now open. Please go ahead.\n\nTim Savageaux -- Northland Securities -- Analyst\n\nGreat. I made it in there. The question is also kind of around long-term modeling. Obviously, you've got a lot of moving parts this year.\n\nBut at least heading into the year, I think organically, you were looking at -- talking about double-digit growth rates over, I guess, multiple years. It looks like given what's happening in 3D, you wouldn't have gotten there this year organically. But as we look further out, especially with an eye toward Chris' comments about a potential V-shaped recovery in 3D, is that still a reasonable expectation for the combined company in terms of double-digit growth over the medium to long term? Thanks.\n\nWajid Ali -- Chief Financial Officer\n\nYeah, hi there. So I'll start off. And then certainly, Alan and Chris can jump in as well. So from a long-term model standpoint, yes, so this year, if you take a look at our stand-alone business, we're probably growing by 7% to 8% because we probably had more of a step-function drop in 3D sensing demand than we were expecting coming into the year, although we've been messaging it for quite some time.\n\nAs we saw Q1 revenues come in or forecast coming from our customer, we realized very quickly that it is dipping much faster than we expected. So that is impacting us. But if you take a look at our telecom and datacom business and our lasers business, even without the acquisition of NeoPhotonics, it's expected to grow over 25% in fiscal '23 versus fiscal '22. So certainly, NeoPhotonics, we're also expecting to have the type of tailwinds that will allow that business on a stand-alone business -- on a stand-alone basis to grow into fiscal year '24 as well.\n\nAnd as Chris mentioned, with the combined sales team, we should be able to do better than that as combined company. So with the rest of the business going into fiscal '24 at a double-digit growth rate and then some of the investments that we're expecting in 3D sensing to start paying off, we're certainly comfortable with the outlook on the business that we've provided in the past as it relates to long-term growth.\n\nTim Savageaux -- Northland Securities -- Analyst\n\nThanks very much.\n\nKathy Ta -- Vice President, Investor Relations\n\nThanks, Tim.\n\nOperator\n\nOur next question comes from Richard Shannon of Craig-Hallum. Richard, your line is now open. Please go ahead.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nHello, guys. Thanks for taking my question. I'm just going to ask one on 3D sensing and specifically the non-phone part of it. It sounds like you're getting some great activity there, Chris.\n\nAnd given that you talked about a three-year time frame at the OFC presentation earlier this year, I'll ask a question in that context, which is given the fairly big step down in your big customer here and the dynamics with other non-phone customers, is it reasonable to think about your non-phone 3D sensing or I don't -- we'll call it imaging or something like that, being at least as big as the phone market for you within that three-year period of time?\n\nChris Coldren -- Chief Strategy and Corporate Development Officer\n\nI think in terms of the market, probably. And certainly, whether it's in year three or year four, it's kind of in that time frame, given the time to ramp these applications. But certainly, I think as you talk about three years, four years, five years out, we expect the non-smartphone business to be as large or larger, ultimately, given the size of those opportunities. I think it's just a question of what year that crosses over.\n\nIt's probably in that -- that's why we can get the minus 5% to plus 5% because it's very sensitive to that final year. But certainly, in the years three or four absolutely.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK. Fair enough. That's all for me, Chris. Thank you.\n\nKathy Ta -- Vice President, Investor Relations\n\nThanks, Richard.\n\nOperator\n\nOur final question of the day comes from Michael Genovese of Rosenblatt. Michael, your line is now open. Please go ahead.\n\nMichael Genovese -- Rosenblatt Securities -- Analyst\n\nOK, great. Thanks a lot. First question, just to clarify on the sort of organic non-3DS guide. You threw lasers in there, expecting over 25% growth.\n\nBut is that just because it's included with telecom and datacom? Or is lasers itself growing that quickly?\n\nAlan Lowe -- President and Chief Executive Officer\n\nYeah. Lasers itself is growing very rapidly year over year. It was up 59%. We expect that to continue to grow.\n\nSo what we were trying to say was, a, putting aside the share normalization, the rest of the business is humming, and it's doing quite well: telecom, datacom, and lasers. And we expect lasers to produce record levels of revenue in Q1 and continue to grow through the calendar year -- through the fiscal year. So that was the reason for including them all together.\n\nMichael Genovese -- Rosenblatt Securities -- Analyst\n\nOK. Great. And then finally, can you flesh out a little bit more on the DSP strategy? From what I'm hearing here, it sounds like definitely, you plan to make ZR, ZR+ modules with an internal DSP. Do you then expect to have your own DSP in other kinds of transmission modules as well? Or should we think it would just be limited to or focused only on ZR?\n\nAlan Lowe -- President and Chief Executive Officer\n\nNo. I think you can think of it as being -- ZR being the first step. Given that we announced the deal 25 hours ago, we're still trying to determine do we need to shift the road map from the existing road map? Do we need to add resources or add spending? Or what is the one after that? And so I'd say that it's still early days, but we're not into the DSP business for one DSP, we're making this investment in acquisition for the long term. And I think it will position us quite well, especially as you put together the NeoPhotonics product and technology, IPG products and technology and then what Lumentum had.\n\nI think together, it really puts us in a solid position to vertical integration in coherent components and modules.\n\nMichael Genovese -- Rosenblatt Securities -- Analyst\n\nGreat. Thanks, Alan. Congratulations on the deals and all the exciting steps you have ahead.\n\nAlan Lowe -- President and Chief Executive Officer\n\nGreat. Thank you, Michael.\n\nKathy Ta -- Vice President, Investor Relations\n\nThank you, Michael. Hey, Charlie, I think that's all the questions that we have. So I'd like to pass the call back over to Alan for some concluding remarks.\n\nAlan Lowe -- President and Chief Executive Officer\n\nThank you, Kathy, and thank you, Charlie. I'd like to leave you with a few thoughts as we wrap up this call. We have significantly improved our access to third-party ICs and have increased our manufacturing capacity to support the ongoing demand strength. Our fourth quarter results and first quarter guidance certainly reflect the strength across our telecom, datacom, and commercial lasers business.\n\nI'm also very excited about our acquisition of NeoPhotonics and the purchase of the telecom transmission product lines from IPG and the breadth of the products and capabilities that we can now offer to our customers. Together, we have a broad portfolio of best-in-class products and technologies. We are committed to strongly invest in innovation and manufacturing capabilities to deliver on customer needs today and in the future. With that, I would like to thank everyone for attending, and we look forward to talking with you again during upcoming investor events, which you will find posted on our website.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKathy Ta -- Vice President, Investor Relations\n\nAlan Lowe -- President and Chief Executive Officer\n\nWajid Ali -- Chief Financial Officer\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGeorge Notter -- Jefferies -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nTom O'Malley -- Barclays -- Analyst\n\nChris Coldren -- Chief Strategy and Corporate Development Officer\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nChristopher Rolland -- Susquehanna International Group -- Analyst\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nAnmol Makkar -- Goldman Sachs -- Analyst\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nTim Savageaux -- Northland Securities -- Analyst\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nMichael Genovese -- Rosenblatt Securities -- Analyst\n\nMore LITE analysis\n\nAll earnings call transcripts"
}