{
  "companyName": "Appian",
  "companyTicker": "APPN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/appian-appn-q3-2022-earnings-call-transcript/",
  "content": "Appian (APPN -2.43%)\nQ3 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. And welcome to the Appian third quarter 2022 earnings conference call. I would now like to turn the call over to Sri Anantha, senior director of finance and investor relations. Please go ahead.\n\nSrinivas Anantha -- Senior Director of Finance and Investor Relations\n\nThank you, operator. Good afternoon, and thank you for joining us to review Appian's third quarter 2022 financial results. With me today are Matt Calkins, chairman and chief executive officer; and Mark Matheos, chief financial officer. After prepared remarks, we will open the call for questions.\n\nToday, you will want to follow along with our earnings presentation. You can download it from the main page of our investor site at investors.appian.com. During this call, we may make statements related to our business that are forward-looking under federal securities laws and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These include comments related to our financial results, financial results, trends, and guidance for the fourth quarter and full year 2022 and 2023, the impact of macroeconomic changes, the benefits of our platform, industry and market trends, our go-to-market and growth strategy, our market opportunity and ability to expand our leadership position, our ability to maintain and upsell existing customers, and our ability to acquire new customers.\n\nThe words anticipate, continue, estimate, expect, intend, will, and similar expressions are intended to identify forward-looking statements or similar indications of future expectations. These statements reflect our views only as of today. They do not represent our views as of any subsequent date. They are subject to a variety of risks and uncertainties that could cause actual results to differ materially from expectations.\n\nFor a discussion of the material risks and other important factors that could affect our actual results, refer to our 2021 10-K and other periodic filings with the SEC. These documents are available on our investor section of our website. Additionally, non-GAAP financial measures will be discussed on this conference call. Refer to the tables in our earnings release and the investor section of our website for a reconciliation of these measures.\n\nto their most directly comparable GAAP financial measures. With that, I would like to turn the call to our CEO, Matt Calkins. Matt?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nThanks, Sri. And thanks to everyone for joining us today. In the third quarter of 2022, Appian's cloud subscription revenue grew 30% year over year to $60.6 million. Subscriptions revenue grew by 29% to 86.5 million.\n\nTotal revenue grew 28% year over year to 117.9 million. Our cloud subscription revenue retention rate was 115% as of September 30th, and our adjusted EBITDA was a loss of $22.9 million. That last figure is outside of our guidance and will need careful explanation. I will spend much of my time today on that and a new set of charts that I want to share.\n\nBefore we dig into those deep topics, I have a few quick points of news. Number one, Appian recently closed a $150 million debt facility with a five-year term. The purpose of this facility is to remain strong and cash throughout the anticipated economic contraction. Number two, Appian opened our new dev center in Chennai, India ahead of schedule with a full complement of employees and a new office location.\n\nThis will help us with efficiency and access to talent. With those news items out of the way, let's get to the quarterly numbers. Revenue growth in every category is healthy. Revenue, in fact, has been setting records, with the last four quarters our strongest four growth quarters since the IPO.\n\nAnd that is despite the FX headwind. Foreign exchange rate fluctuation cost us several percentage points, as you will learn in the financial presentation, but it didn't stop our revenue momentum. Still, the adjusted EBITDA number is outside of expectations, and that is due to higher expenses. Those expenses were driven by hiring surge and a sharp drop in attrition.\n\nLet's discuss how we got there. Appian came to this quarter in an unusual situation. We expected a recession but hadn't felt any effects of it yet. We were enjoying our strongest revenue growth since our IPO in 2017.\n\nUsage in our product was increasing exponentially. That's a good proxy for value delivered. And customer satisfaction with our platform was at an all-time high. We decided to invest in growth.\n\nOur plan was and is to grow through the potential recession and be stronger at the other side of it. We set out to keep the team we had and build it bigger for next year. In Q3, our personnel plans succeeded beyond my expectations. Our attrition dropped all the way down to 3.2% companywide for the total quarter, which is to say that 97% of our team stayed.\n\nRecruiting, meanwhile, performed much stronger than I predicted. In Q3, we added 221 employees compared to 203 the prior three quarters combined. Seventy-seven percent of those people joined the sales, engineering, and consulting departments, our three areas of focus, in that order. We hired more than 100 people into the sales department alone, repairing a long-standing shortage of account executives.\n\nWe hired 56 engineers, many of them the founding cohort of our new dev center in Chennai. We hired 38 consultants addressing a scarcity of billable resources. This third quarter turned out to be an exceptionally advantageous time for finding elite new talent, as periods of economic turmoil often are. Without the effects of FX and the personnel surge, which is to say the cost of acquiring, retaining, training, and onboarding these employees, adjusted EBITDA would have been in range this quarter.\n\nWith this bountiful hiring, we staffed the team we need for 2023. And we did it in three months instead of three quarters like we'd expected. But we brought forward a lot of future expenses into the present quarter and exceeded our loss expectations. So, these are good expenses, though, they were incurred over quickly.\n\nI and we take seriously our commitment to operating in a predictable manner. So, I want to finish with a reassurance. Our adjusted EBITDA loss this Q3 is 19.4%, and Q4 looks to be a bit higher at 21.6%. Next year, we plan it to be much lower.\n\nWe intend to cut it in half over the next 12 months. We plan to reduce the loss to 10% by the second half of 2023. There will be more detail on our expenses situation when Mark discusses our finances. But there's another major topic I have to address, so I'll move over to that now.\n\nLast quarter, I predicted an economic slowdown and said we were not feeling it yet. This quarter, we did feel it. We were entering a period of uncertainty, and I like to respond to uncertainty with additional transparency. You may recall, I presented a special series of charts at the start of 2022 for a similar reason.\n\nI've assembled for you now a set of reports that target symptoms you'd expect to see in a recession. And I'm going to present the same reports every quarter from now until we're past whatever downturn occurs, whenever that may be. With these charts, you'll be able to see how the economic situation plays out at Appian from multiple camera angles. Please look at the packet of economic indicator charts as I explain this section.\n\nThey begin on Slide 4. Every chart will report data quarterly, generally starting with Q1 of this year and with Q1 value as a baseline. So, we're looking at relative movement, not absolute numbers. And one more thing, we do not consider these to be key performance indicators.\n\nThe first chart measures the reliability of our collections with a traditional stat, DSOs, or days sales outstanding. We believe there is no problem with the reliability of our collections. But this is a traditional indicator, so I'm including it. Second chart is gross renewal rate in the cloud.\n\nAppian's recent 98% to 99% GRR is awfully good compared to our industry. And we would expect to see at least some dip in that during a real downturn. When budgets get squeezed, how much will customers stick with us? This is a good place to keep watch. For now, though, we're still at 99%.\n\nThe third page shows our growth in ARR and several ARR cohorts. Here, you can see the growth in logos at the 250K range, the 500K, and the $1 million range. If a recession arrives, you might see ARR slow down, or the top dollar bracket grow more slowly than the lower brackets. This could show us how mission-critical our customers consider us to be and whether they're becoming reluctant to do big deals.\n\nWe'll keep a watch on it. The final chart shows the growth of the Appian community. How many people are choosing to register? This could be driven by opportunity since many of these people are looking to work as Appian and practitioners. Or it could be driven by interest in the market or our technology specifically.\n\nOr, you know, they could be spies sent by our competitors. But probably they're joining the Appian community because they like our technology and want to be affiliated with us. This state has been growing quickly lately. And if individual people start showing conservative economic behavior, it might plateau.\n\nIn addition to these charts, I want to add my reflection on sales cycle length. In Q3, we saw a mild lengthening, roughly 10%, which is consistent with a recessionary scenario. It might also, however, reflect that Q3 is characterized by federal business, and those deals have slightly longer sales cycles. Finally, I'd like to share a few win stories from this quarter.\n\nA U.S. national security agency purchased a seven-figure software deal and became a new Appian customer in Q3. The agency will digitize its business with Appian, starting with two use cases. First, they will use our Government Acquisition Management Solutions Suite to gather acquisition requirements and automate procurement processes.\n\nSecond, it'll use an Appian partner solution built on our low-code platform to manage its HR operations like onboarding employees and facilitating performance reviews. With Appian, the group will automate manual processes and improve its hiring timelines by 50%. Second, a story about a fast expansion. A space exploration company became a new Appian customer just a few quarters ago.\n\nOur platform unifies the company's existing data and systems into a single application so it can manage the assembly of space suits. In Q3, the customer bought an additional seven figures worth of Appian software licenses to add new user groups and functionality to the app. Hundreds of caseworkers will use Appian to reference the make of individual suits and troubleshoot malfunctions that occur while astronauts are deployed. We won this deal after demonstrating our platform's speed and flexibility during a comprehensive customer demo.\n\nFinally, a large bank in the Asia-Pacific region became an Appian customer a few years ago. It uses our platform to manage local bank operations, anti-money laundering, and consumer banking processes. With Appian, the bank opened 1 million digital bank accounts last year and reduced the time it takes to create new accounts from hours to minutes. In Q3, the bank upgraded its licenses with our newest features, like Appian Process Mining and RPA, increasing its total software spend by nearly $1 million.\n\nAppian has a strong market position. Our customer base is loyal. Our ecosystem is growing, and there's high demand for our product. Appian is an attractive destination in the current job market.\n\nWe have the team we need to win in 2023. We feel confident we can now limit our spending while extending our growth. Now, I'll hand the call to Mark for a deeper look at our financials. Mark?\n\nMark Matheos -- Chief Financial Officer\n\nThanks, Matt. I'll review the financial highlights for the quarter and then will provide guidance for Q4 and the full year 2022. We delivered another strong quarter driven by subscriptions revenue growth of 29% year over year. We also saw strong growth in key industry verticals in each of our geographical regions.\n\nLet's go into the details. Cloud subscription revenue was 60.6 million, an increase of 30% year over year and absorbed another 1% of incremental FX headwinds since we gave guidance on August 4th. Normalizing for FX headwinds, cloud subscription revenue was in line with our guidance. On a constant currency basis, cloud subscription revenue grew 33% year over year.\n\nTotal subscriptions revenue was 86.5 million, an increase of 29% year over year. Professional services revenue was 31.4 million, an increase of 25% year over year. FX changes negatively impacted professional services revenue by about 1 million. The year-over-year growth in professional services revenue was driven by the public sector, North America, and APAC.\n\nAs previously noted, Appian's professional services are complementary to partner offerings and, in certain cases, support large programs that are run by our partners. Long term, we continue to believe partners will drive most of our growth. As a result, we expect professional services revenue to continue to decline as a percentage of total revenue. Subscriptions revenue was 73% of total revenue, consistent with the year-ago period and 70% in the prior quarter.\n\nTotal revenue was 117.9 million, an increase of 28% year over year and above our guidance range. On a constant currency basis, total revenue grew 30% year over year. Our cloud subscription revenue retention rate at September 30 was 115% as compared to 116% last quarter. As a reminder, we continue to target a cloud subscription revenue retention rate of 110% to 120% on a quarterly basis.\n\nOur international operations contributed 31% of total revenue as compared to 32% in the year-ago period. The growth in international revenue was driven by continued healthy performance in both APAC and EMEA regions. Our cloud software net new HCV bookings were approximately 78% of the total net new software bookings during the nine months ending September 30, 2022 and consistent with 78% for the full year 2021. Now, I'll turn to our profitability metrics.\n\nNon-GAAP gross margin was 73%, consistent with a year-ago period, and up from 71% in the prior quarter. Subscriptions non-GAAP gross profit margin was 90%, consistent with the year-ago period, and up from 89% in the prior quarter. Professional services non-GAAP gross margin was 27% as compared to 26% in the year-ago period and 30% in the prior quarter. As noted on prior earnings calls, we continue to invest in customer success management.\n\nThese advisors help our customers achieve the most from our technology and increase adoption from our platform -- of our platform, rather. As a result, professional services non-GAAP gross margin should decline to the low 20% range in 2022 and beyond. Total non-GAAP operating expenses were 110.4 million, an increase of 37% from 80.5 million in the year-ago period. Due to these higher expenses, adjusted EBITDA loss was at 22.9 million versus a guidance of a loss between 15 million and 13 million, and compared to an adjusted EBITDA loss of 12 million in the year-ago period.\n\nWithout the effects of FX and the personnel search, including the costs of acquiring, training, retaining, and onboarding of these employees, adjusted EBITDA would have been in our guidance range this quarter. In the third quarter, we had approximately 6.1 million of foreign exchange losses compared to 2.3 million in foreign exchange losses in the same period a year ago. The primary reason for the increase in foreign exchange losses was the strengthening of the U.S. dollar against the British pound, euro, and Swiss francs.\n\nWe don't forecast movements in FX rates. Therefore, they aren't considered in our balance sheet. Non-GAAP net loss was 30.9 million or $0.43 per basic and diluted share compared to non-GAAP net loss of 15.9 million or $0.22 per basic and diluted share for the third quarter of 2021. This is based on 72.5 million basic and diluted shares outstanding for the third quarter of 2022 and 71.1 million basic and diluted shares outstanding for the third quarter of 2021.\n\nAs noted above, second quarter 2022 non-GAAP net loss was negatively impacted by 6.1 million in foreign exchange losses, or a loss of $0.08 per share, which was not included in our original guidance. Earlier today, we closed a $150 million senior credit facility considering a $100 million term loan facility and a $50 million revolving credit facility. This was closed on favorable terms. Additional terms of the financing can be found in the 8-K filing that we just filed.\n\nTurning to our balance sheet. As of September 30, 2022, cash and cash equivalents and investments were 92.7 million compared with 168 million as of December 31, 2021. For the third quarter, cash used by operations was 43.7 million, which is 25.1 million for the same period last year. Compared to the year-ago period, operating cash flow was negatively impacted by higher sales commissions, wage increases, and increased training and in-person events.\n\nTotal deferred revenue was 164.6 million as of September 30, 2022, an increase of 32% from the year-ago period. As we have stated on past calls, the majority of our customers are invoiced on an annual upfront basis. We also have large customers that are billed quarterly or monthly. Due to the variability or billing terms, changes in our deferred revenue are generally not indicative of the momentum in our business.\n\nWe continue to believe cloud subscription revenue is a better indicator of our business momentum than billings for remaining performance obligations, or RPO. The latter metrics can fluctuate based on the timing of invoicing, seasonality of term license revenue, and the duration of customer contracts. The scale of the business is represented by subscriptions revenue, which includes support and all software subscription revenue, regardless of whether the customer deploys Appian in the cloud or on-prem. Now, I'll turn to guidance.\n\nFor the fourth quarter of 2022, cloud subscription revenue is expected to be between $63.5 million and $64.5 million, representing a year-over-year growth of 24% and 26%. Total revenue is expected to be between $121 million and 123.5 million, representing a year-over-year growth of 16% and 18%. Adjusted EBITDA loss for the fourth quarter of 2022 is expected to be between $29 million and $24 million. The reason we're quoting such a wide range is due to a few large on-premise deals.\n\nNon-GAAP net loss per share is expected to be between $0.42 and $0.36. This assumes 73.5 million basic and diluted weighted average common shares outstanding. We are changing our full year 2022 cloud subscription revenue and total revenue guidance. The entirety of our change is for FX.\n\nUpdated cloud subscription and total revenue guidance absorbed currency headwinds of approximately 2 percentage points since our last earnings call on August 4th and approximately 5 percentage points since we provided initial 2022 guidance on February 17th. For the full year 2022, cloud subscription revenue is expected to be between 235 million and 236 million, representing a year-over-year growth of 31% to 32%. For the full year 2022, total revenue is expected to be between 461 million and 466 million, representing year-over-year growth of 25% and 26%. Adjusted EBITDA loss is expected to be between $80 million and $75 million.\n\nNon-GAAP net loss per share is expected to be between $1.36 and $1.30. This assumes 72.5 million basic and diluted weighted average common shares outstanding. Our guidance assumes the following. First, a high single-digit growth in professional services revenue on a year-over-year basis.\n\nWe continue to expect partners to perform more services work. In situations where they help us close a new logo, partners generally lead the projects. Second, greater expenses related to employee wages, overhead costs, in-person events, and T&E. Beginning the fourth quarter, we are capping any discretionary related expenses in the current macro environment.\n\nThird, capital expenditures between approximately 2 million and 3 million in the fourth quarter of 2022. This is primarily related to build-out of additional office space. Finally, our guidance assumes FX rates as of November 2, 2022. In summary, we're excited about the growth opportunities ahead of us.\n\nWe remain confident about the operating leverage and the business model. With that, let's turn it over to questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Steve Enders from Citi. Your line is open.\n\nSteve Enders -- Citi -- Analyst\n\nHey, great. Thanks for taking the question. I guess just a start. I just want to get it a little bit better clarity on what you are seeing in the macro currently.\n\nIs there anything in the pipeline that's been impacted? Or how should we kind of think about what's necessarily in there that you're calling it out but not necessarily seeing it seen in the guide, at least on the revenue impact for 4Q? \n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah. I'm glad you asked that because I want to clarify this, Matt. We're not seeing anything else, but I didn't put in those numbers. So, the evidence of an economic episode is really thin on the ground right now for us.\n\nMaybe there's a little bit there in sales cycle delays, or perhaps it's just the effect of a federal-dominated quarter. I mean, the effect, is pretty small. We saw a couple of deals slip, including one notable deal slip out of the past quarter. But no, there's no big factor that hasn't -- that doesn't come across in those charts.\n\nSteve Enders -- Citi -- Analyst\n\nOK. Gotcha. That's helpful clarity right there. And I guess for the investments that you did make in the hiring environment, it was particularly strong.\n\nAny big areas of focus that you would call out in where things would be in place on the sell side? Are there certain regions, certain verticals, certain roles that you were particularly hiring for on the sell side?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah, I'd be happy to speak to this. The No. 2 area we were pressing to hire for was to get a critical mass of engineers on the ground in Chennai so that it would appear to be a real office, you know, with a real location, a real team that was together from day one. That was a push.\n\nAnd that's our second priority. Our top priority, however, was to staff our account executives and SDRs. And we specifically wanted to have access to more accounts. I felt for a while we were understaffed in terms of account executives and that we were missing access to some transactions because we didn't have the time to show up.\n\nAnd so, this has been my big push all year. But it wasn't until Q3 that we really got it done.\n\nSteve Enders -- Citi -- Analyst\n\nOK. And just a quick clarification. I mean, is the hiring initiative, is that done at this point? Like, I don't want to call it a hiring freeze, but is this pretty much the end of those major investments there?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nThat's affirmative.\n\nSteve Enders -- Citi -- Analyst\n\nOK. Perfect. Appreciate the questions there.\n\nOperator\n\nYour next question comes from the line of Sanjit Singh from Morgan Stanley. Your line is open.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThank you for taking the question. Matt, I really want to talk about how you're thinking about the demand environment over the next 12 months. In the previous question, you're pretty clear that, you know, the data, in this case, you're looking at doesn't really signal any impending slowdown. But even you guys admit, like, the attrition, rather, that you're seeing in your organization is at an all-time low, which could be kind of a signal that -- you know, it's kind of an economic indicator that things are more uncertain if, you know, employees are staying at their jobs for longer.\n\nAnd so, in the context of the investments in sales and in R&D in Chennai, what's the risk that you're overstaffed relative to the demand environment that could ultimately materialize? And what are sort of the contingency plans if that scenario occurs?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah. OK. First of all, I think your observation about low attrition being an economic signal is perceptive. And I think that that reads as an economic signal to me as well.\n\nIt speaks more to the general technology job market than the demand for our products. However, the demand for our products has maintained its strength. All right? So, maybe some parts of the economy are showing that weakness and you could see it in the attrition figures. But our demand seems to be more resilient than that.\n\nAnd so, the pipeline, the sales, we see steadiness instead of decay. Let's say that, however, that there is some decay. Let's say that we hit a recession in the early part of next year and it lasts for two to three quarters, which I would not be at all surprised if that's what we get. That's what I'm expecting.\n\nI still think the other side of that -- OK. During that, we have a good ROI story and a good reliability story. So, I think we're kind of a good all-weather option during a recession. Our customers are happy.\n\nOur retention is strong. Our performance is notably, you know, better than our competitors in surveys and such. And our product is focused on determining the ROI that our customer is getting to be sure that the money they've already spent is spent well instead of spending new speculative funds. So, we're well-positioned during a period of turmoil.\n\nAnd then coming out the other side of it, I feel extremely confident that there is building demand for digital transformation and for process automation like we provide. We see that marketing opening up and we want to be ready for it.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMakes sense. And then, just a question on how the demand for your products is materializing, going potentially into a more uncertain IT budget environment. As you look across workflow process mining and RPA, are you seeing customers sort of, you know, be more conservative in terms of their ambitions around automation? Or are you seeing that accelerate within your existing customer base?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah, you know, the way I define automation is when software helps you do the work. And a recession is like the No. 1 time that you would want software to help you do the work. And so, this isn't the time to pull back on automation technology.\n\nIt's actually the time to rely on it. And if you can push more work to your robotic process automation or your artificial intelligence or intelligent document processing or process mining or workflow or rules, these are all natural ways to be more efficient. That's exactly the kind of thing that if you are comfortable with them as a tool, you'd want to double on in a recession. And we're seeing, you know, our new -- we have a new feature in process mining that allows you to introspect Appian data and render a scorecard to show how well you're optimizing your Appian processes, how efficient they are, especially relative to the past, and how you can tune them up.\n\nWe're seeing demand for that. We're seeing new deals come in and focused on that. So, I think that we've got a product that will be in harmony with economic disruption.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMakes a lot of sense. Thank you, Matt. Appreciate the color.\n\nOperator\n\nYour next question comes from the line of Kevin Kumar from Goldman Sachs. Your line is open.\n\nKevin Kumar -- Goldman Sachs -- Analyst\n\nThanks for taking my question. Matt, maybe going to the comment you said about lengthening deal cycles and maybe that some of that's related to government, maybe touch on kind of what you're seeing in the government sector in terms of demand, in terms of scale cycles, and kind of appetite in this environment. Thanks.\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah, I should speak to that. The lengthening deal cycle is -- it's not even clear to me that that's really happening because our data is a little dodgy out of the CRM system, and it's a minor change. So, it's well within the margin of error to which I would attach on that chart. However, I can speak with much more precision about the situation in the federal government.\n\nI can say that it had a strong quarter, that it is our second largest industry, and it grew by the second most behind, of course, financial services. And that that growth was solid across subs and on-prem and turned in a very solid result.\n\nKevin Kumar -- Goldman Sachs -- Analyst\n\nThat's helpful. And then, maybe a follow up on the partner ecosystem. You know, we've heard some positive comments on growth of the partner ecosystem. And just curious if you're seeing anything incremental in terms of contribution, new logo wins, kind of strength of that partner deal.\n\nIs that starting to become an incremental tailwind? Thank you.\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nI see an abnormally high level of enthusiasm among our partners. Maybe it's just because I'm on the road the last few weeks. I was at our Asia-Pac conference last week in Sydney, Australia. And then yesterday I spoke at our public sector conference in Washington, D.C.\n\nAnd in both cases, partners are everywhere, exceptionally enthusiastic, buying up all the space, all the sponsorships, making commitments. Right? A certain partner told us they wanted to make it $1 billion business. Another partner told us they wanted to go from a team of 10 to a team of 100 within a year. I can't say the names behind these partners, but these are serious organizations.\n\nThey're like top five partners for us, at least globally. Though, not necessarily in the region where they were speaking. But I'm seeing not just enthusiasm, but real excitement about jumping at the Appian opportunity. It makes me want to raise the price of sponsorships, actually.\n\nKevin Kumar -- Goldman Sachs -- Analyst\n\nThanks for taking my questions.\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah.\n\nOperator\n\nYour next question comes from Jake Roberge from William Blair. Your line is open.\n\nJake Roberge -- William Blair -- Analyst\n\nHey, thanks for taking my question. Just want to follow up on that public sector commentary. Forty percent growth in government agencies is pretty impressive. But given Q3 is the strongest spending period for the U.S.\n\ngovernment, were customers operating with a use-or-lose-it mentality? Or could we actually see some of that demand spill into Q4 in 2023?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nGreat. At the end of the federal fiscal year, there is often a little bit of a use-it-or-lose-it mentality, and that leads to the occasional large bluebird. Some years are characterized by a bluebird or two, which is to say a big deal that comes in unexpectedly because the agency had money burning a hole in their proverbial pocket. This year, we did not have that kind of a quarter.\n\nGovernment performed solidly but not randomly. So, that is not the explanation for the strength we saw this time. And as for whether deals can come in in other quarters, yes, they can. Public sector is not all Q3.\n\nThat's just the best quarter. But they buy all year round.\n\nJake Roberge -- William Blair -- Analyst\n\nGreat. Thanks. That's helpful. And then, could you give us an update on the lawsuit with Pega.\n\nOn the earnings call, it seemed like Pega may have been talking down the severity of the verdict. But given the size of the ruling, I'd love to get some more color from you on how that process is going.\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah, I heard that. In the statement that they -- they said it's just a lawsuit. Everybody gets sued all the time. Look, I don't want to say too much about this because we've been so discreet.\n\nWe've been very good about it. But I will at least mention a couple of facts. First of all, it's not just a lawsuit. It's a verdict.\n\nIt's a final judgment at this point because the judge entered it this past quarter. Pega violated the Computer Crimes Act. Full stop. They willfully and maliciously, as the judge says \"willfully and maliciously misappropriated Appian's trade secrets.\" So, I don't know what this means for their customers prospects, their partners, even their employees.\n\nEverybody's got to decide for themselves. But it's definitely not just another lawsuit.\n\nJake Roberge -- William Blair -- Analyst\n\nThat's helpful. Thanks for taking my question.\n\nOperator\n\nYour next question comes from the line of Joe Meares from Truist. Your line is open.\n\nJoe Meares -- Truist Securities -- Analyst\n\nGreat. Thanks for taking the questions. I'm just curious, on the 10% loss target for the end of next year, is that a function of revenue growth? Or do you plan to make any reductions anywhere in gross margin? And then, do you plan on kind of staying at that level after you get there, or start to try to drive that further down into 2024? Thank you.\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah. First of all, it's the second half. OK? We're going to do that in the second half. And we're not going to do it by shrinking.\n\nI want to be clear. We're simply going to constrain how much we need to spend in order to achieve the growth we know we can achieve. We've put in place a team that can win in 2023. We've got the team now.\n\nWe've got them faster than I expected. And that will give us a little bit of a dividend in that we will be more prepared to go into the new year. We are not going to shrink. We are not -- I mean, I expect great growth.\n\nWe're going to obviously see what happens with the recession and all. But we are in a good position to keep winning in this market. And we are not intending to freeze or to go backwards. Quite the contrary.\n\nWe believe that with this latest batch of personnel, we are in a situation where it is possible for us to both limit additional expenses and maintain strong growth. \n\nJoe Meares -- Truist Securities -- Analyst\n\nGot it. Thank you. I'm just curious on the additions to sales and marketing. Could you just remind us how long it typically takes to get those types of personnel ramped and when you would start to see the benefits of those hires? And then, just curious how demand has trended thus far in Q4 compared to Q3.\n\nThank you so much.\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah. First of all, with regards to your question about sales and marketing personnel and how long they take to get ramped, I want to first note that we did not hire for marketing hardly at all in the third quarter. We were targeting sales. We feel that we had an adequate marketing staff, and, therefore, that was not our area of focus.\n\nWe added -- we hired more than 100, 104? I think we hired more than 100 people into the sales department last quarter because it was our No. 1 area of focus and the place we most felt we needed to expand in order to deliver the 2023 results that we want. The reason why we're doing that is because we feel that there is an up-ramp of opportunity. And we mean to capitalize on that by showing up to those deals.\n\nAnd we needed a larger account executive team to do it. So, that is exactly -- to the second part of your question, that is exactly what motivated the sales up-ramp to the first part of your question.\n\nOperator\n\nYour next question comes from the line of Derrick Wood from Cowen. Your line is open.\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nOh, great. Thanks, guys. It's Andrew on for Derek. Mark, on the Q4 cloud sub guide, I may have missed this, but what's the FX impact to that? And maybe just walk us through your assumptions you've made there as far as macro, sales cycles, pipeline conversion, anything there would be helpful.\n\nMark Matheos -- Chief Financial Officer\n\nYes. So, the Q4 guide, we are factoring in an absorption of 2% since our last earnings call. So, that's the deterioration that we've seen that happened in some of the currencies flowing through. And that's a 2% impact.\n\nIn terms of the actual, you know, conservatism on the guide, it's basically, you know, not reflecting anything massively different than what we've seen in Q3. It's just ongoing, kind of same recipe for how we build up our guidance, which is to say we look at all the opportunities that we have out there and of course the backlog and just kind of assume the same level of traction in the macro environment that we've had. And no real further deterioration.\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nGreat. And, Matt, Appian Unlimited has been out for over a year. Can you talk about how this is trending versus your expectations and if you've had any renewals from those customers so far? Have you seen this driven some strong upsell activity?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nI love it as a way of aligning incentives. I continue to see interest in Appian Unlimited. It continues to be a minority purchase, which is to say an unusual method of sales because most of our customers like the normal ways by seat, that sort of thing. So, I am a price model enthusiast.\n\nI think you could say. I love construing pricing models that set everybody's expectations and incentives the right way. It doesn't mean that all of our customers do. It's definitely still in the mix.\n\nI don't see it growing as a share of the mix. It's the minority of our demand. We may try to give it another push forward next year, but it looks like it may stay in the distinct minority. And actually, maybe it makes more sense for customers -- I have always felt this, for customers who understand the value of our platform.\n\nAnd two things that will make them understand the value properly are the maturation of our sector and familiarity with us. And so, the more we can raise the profile of our market and ourselves, the more we're likely to get adoption of a novel pricing mechanism like that. But I don't have any news on growth in there. It remains a substantial but not majority way to purchase Appian software.\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nOK. Thanks, guys.\n\nOperator\n\nYour next question comes from the line of Fred Havemeyer from Macquarie. Your line is open.\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nHi. Thank you. I think the first question I'd like to head on is, in regards to hiring and just how you're thinking about managing toward your profitability guidance, when in the quarter was apparent that hiring was coming in much stronger and that your profitability was going to be looking like it was at risk of missing your guide?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYou know, that's on me. I did not notice until the quarter had concluded that we had that we had hired above our guide.\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nThank you. And then just one question to clarify on the lawsuit as well. Matt, does Pega have to pay anything at the moment? And typically, how long would you say these types of lawsuits tend to go on for?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nYeah. Pega is not obliged to pay anything right now. They are at liberty, instead, to contest the verdict. Now, the verdict has been entered, and the final judgment has been entered.\n\nAnd their arguments were heard and rejected by the judge. And interest is now accruing at the rate of about $122 million per year. So, they're at liberty to draw this out, if they wish, and it appears they do wish. But there is a consequence to that.\n\nOperator\n\nYour final question comes from Vinod Srinivasaraghavan from Barclays. Your line is open.\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nHi. Thanks for taking my question. I just want to talk about Appian Community Edition. I think that's been out for a year-plus now.\n\nYou know, is some of the sales hiring maybe related to some of the positive signals you're seeing from this kind of pool? Or is it more, I guess, related to kind of the existing opportunity within larger customers?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nI'm sorry. I couldn't hear all that. What's that again?\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nSorry. Is the significant sales hiring you're making related to signals that you're seeing from, you know, the pool of Appian community users? Or is it more related to just, you know, the opportunity within your existing clients to kind of just go deeper?\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nRight. Well, it actually has to do with opportunities that I see happening in the market that we are incapable of addressing because we don't have the sales staff to participate. Right? And so, knowing how much we get out of the customers we're capable of touching and knowing that the customers that we're not touching are not so terribly different from the ones that we are, we understand there to be a much larger opportunity and merely need the staff to participate in it. So, that's the rationale.\n\nThanks for the question.\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSrinivas Anantha -- Senior Director of Finance and Investor Relations\n\nMatt Calkins -- Chairman and Chief Executive Officer\n\nMark Matheos -- Chief Financial Officer\n\nSteve Enders -- Citi -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nKevin Kumar -- Goldman Sachs -- Analyst\n\nJake Roberge -- William Blair -- Analyst\n\nJoe Meares -- Truist Securities -- Analyst\n\nAndrew Sherman -- Cowen and Company -- Analyst\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nMore APPN analysis\n\nAll earnings call transcripts"
}