{
  "companyName": "The Geo Group",
  "companyTicker": "GEO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/the-geo-group-geo-q3-2022-earnings-call-transcript/",
  "content": "The Geo Group (GEO -0.81%)\nQ3 2022 Earnings Call\nOct 27, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, and welcome to The GEO Group third quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Pablo Paez, executive vice president for corporate relations. Please go ahead.\n\nPablo Paez -- Executive Vice President, Corporate Relations\n\nThank you, operator. Good morning, everyone. And thank you for joining us for today's discussion of The GEO Group's third quarter 2022 earnings results. With us today are George Zoley, executive chairman of the board; Jose Gordo, chief executive officer; Brian Evans, chief financial officer; James Black, president of GEO Secure Services; and Ann Schlarb, president of GEO Care.\n\nThis morning, we will discuss our third quarter results and our outlook. We will conclude the call with a question-and-answer session. This conference call is also being webcast live on our investor website at investors.geogroup.com. Today, we will discuss non-GAAP basis information.\n\nA reconciliation from non-GAAP basis information to GAAP basis results is included in the press release and the supplemental disclosure we issued this morning. Additionally, much of the information we will discuss today, including the answers we give in response to your questions, may include forward-looking statements regarding our beliefs and current expectations with respect to various matters. These forward-looking statements are intended to fall within the safe harbor provisions of the securities laws. Our actual results may differ materially from those in the forward-looking statements, as a result of various factors contained in our Securities and Exchange Commission filings, including the Form 10-K, 10-Q, and 8-K reports.\n\nWith that, please allow me to turn this call over to our executive chairman, George Zoley. George?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nThank you, Pablo. And good morning to everyone. Thank you for joining us on our third quarter earnings call. I am pleased to be joined today by our senior management to review our financial results for the third quarter, including the trends for our business segments, our guidance for the balance of the year, the successful completion of our comprehensive transaction to stagger our debt maturities, and our recent repayment of almost all of the remaining debt previously due in 2023 and 2024.\n\nOur diversified business units continued to deliver strong operating and financial performance during the third quarter. We are pleased to have achieved one of the highest quarterly revenues in our company's history, which grew 11% from one year ago to approximately $617 million, along with quarterly GAAP net income of approximately $38 million. Excluding one-time gains and losses during the quarter, we reported adjusted net income of more than $40 million. And our quarterly adjusted EBITDA reached a new all-time high of $136 million, growing 17% year-over-year.\n\nWe believe our strong performance is underpinned by the diversified nature of our business unit and services, which is the result of thoughtful investment and business strategy executed over multiple years with support from our board. Looking at the balance of the year, we expect full year net income attributable to GEO to be in a range of $160 million and $162 million. And we expect full year 2022 adjusted EBITDA to be in a range of $527 million to approximately $534 million, which would mark the first time of our full fiscal year adjusted EBITDA has exceeded $500 million. We have been able to achieve strong growth through this entire year despite continued challenges associated with the COVID pandemic, which have impacted some of our business segments and the federal policy changes that primarily impacted our Federal Bureau of Prisons contracts.\n\nLooking at current trends for each of our segments, our secure services owned and leased segment has historically been comprise primarily of facilities under contract with three federal agencies: the Federal Bureau of Prisons, the U.S. Marshals Service, and the U.S. Immigrations and Customs Enforcement. During the third quarter, our active facilities in this segment experienced a year-over-year increase in compensated occupancy rates of 4 percentage points to 88% of capacity.\n\nAs we have previously disclosed, our contract with the Bureau of Prisons for the 1,800-bed North Lake Correctional Facility in Michigan expired at the end of September 2022. As the end of the third quarter, we no longer have any contracts to the Federal Bureau of Prisons for secured correctional facilities. Turning to the U.S. Marshals Service, occupancy rates across our U.S.\n\nMarshals detention facilities have continued to be stable. We believe our U.S. Marshals facilities provide needed detention, bed space, and services for pre-trial federal defendants and are generally located near federal courthouses in areas, where suitable alternatives are typically not available. Turning to our ICE facilities, occupancy rates increased modestly during the third quarter.\n\nHowever, detaining population nationwide continue to remain below historical levels. Population levels at certain ICE facilities remain impacted by outstanding federal court orders related to the COVID pandemic, which restrict the full operational capacity of these facilities. In addition, COVID-related restrictions under Title 42, which were first enacted in March of 2020, continued to be in place today at the Southwest border. Our guidance for 2022 continues to assume only modest improvements in utilization rates across our ICE facilities.\n\nWhile ICE detaining populations remain below historical levels, the Department of Homeland Security's Intensive Supervision and Appearance Program, or is otherwise called ISAP, has continued to enroll new participants. Based on the latest publicly available data, the number of individuals enrolled in ISAP has grown to more than 300,000. Our BI subsidiary provides a full suite of monitoring and technology services under the ISAP contract to ensure compliance for individuals undergoing the immigration review process. With respect to funding levels, in late September, the U.S.\n\nCongress passed a continuing resolution funding the federal government through the middle of December of this year. Under the continuing resolution, ICE is funded at levels consistent with the previous fiscal year's budget, which included funding for 34,000 detention beds. Moving to our managed-only business, which is primarily comprised of state level correctional facilities, occupancy rates in our managed-only facilities remain relatively unchanged at 96% capacity during the third quarter of 2022. During the quarter, we successfully renewed two managed-only contracts in our secure services segment.\n\nIn Florida, our contract for the 1,948 bed South Bay Correctional and Rehabilitation Facility was renewed for a two-year term. In Arizona, we renewed our contract for the 500 beds Phoenix West correctional and rehabilitation facility for a five-year term. We remain focused on mitigating the challenges of the COVID pandemic, which, among other factors, has contributed to a difficult labor market across our state correctional facilities. But we are pleased that we have been able to work with our government agency partners and state legislative leaders to address staffing and wage inflation challenges.\n\nAs a result of these efforts, we have obtained additional funding to provide wage increases for our frontline employees across several states. Turning to our reentry services business. Our residential centers were impacted during the COVID pandemic, as governmental agencies opted for nonresidential alternatives, including furloughs, home confinement, and day reporting programs. While our occupancy rates remain below historical levels, we are encouraged by the recent trends.\n\nDuring the third quarter, we experienced a sequential increase of 5 percentage points in occupancy rates across our residential reentry centers and ended the quarter at 54% of capacity. We are also successfully renewed five residential reentry contracts, including three contracts with the Federal Bureau of Prisons. Additionally, our nonresidential day reporting programs continue to grow during the third quarter, with compensated mandates increasing by approximately 27% year over year. And consistent with our performance throughout the year, our electronic monitoring and supervision segment delivered strong revenue growth in the third quarter.\n\nThe robust performance throughout the year by our diversified business use strengthened our ability to successfully address our debt maturities through a series of comprehensive transactions, which we completed during the third quarter. The transactions stagger the substantial majority of our debt maturities over a longer period of time, which will allow us to continue to allocate excess cash flow toward debt reduction. After closing on the transactions, we also completed the sale of our equity investment interest in the government-owned Ravenhall Correctional Centre in Australia for approximately $84 million in pre-tax proceeds. And we repaid the remaining $147 million of our 2024 term loans and redeemed the remaining $126 million of our 2023 senior notes.\n\nAs a result of these important steps, we have now been able to reduce our outstanding debt maturities prior to 2026 from $2 billion to just under $23 million. We believe that GEO is materially stronger financial position as a result of all these efforts. We've reduced our total net recourse debt to approximately $2 billion, down from approximately $2.4 billion less than three years ago. We believe that we have made substantial progress toward our goal of reducing our net leverage to below 3.5 times adjusted EBITDA by the end of 2023 and to below three times adjusted EBITDA by the end of 2024.\n\nGoing forward, we remain focused on allocating most of our free cash flow toward meeting our goal of further reducing net recourse debt by at least $200 million annually. Once we achieve our stated debt and leverage reduction goals, we expect to explore options to return capital to our shareholders. We remain optimistic that all of these efforts have the potential to unlock additional equity value. Before I turn the call over to Brian, I'd like to highlight another important milestone we achieved this month with the publication of our fourth annual human rights, environmental, and social governments report.\n\nThis important milestone highlights our continued commitment to respecting the human rights and improving the lives of those entrusted to our care. The report includes enhanced disclosures related to our board oversight of human rights and ESG matters, employee diversity and training programs, corporate governance, and environmental sustainability. Our fourth quarter annual ESG report also reinforces our commitment to providing enhanced rehabilitation and post-release support through our award-winning GEO Continuum of Care program. In an effort to continue to advance our ESG objectives, our board committee structure was recently enhanced by adding two new committees: one, dedicated and committed to oversee criminal justice rehabilitation and human rights; and another dedicated and committed to oversee cybersecurity and environmental sustainability matters.\n\nWe also undertook a human rights risk assessment and due diligence process, which included interviews with end feedback from a diverse group of internal and external stakeholders. The result of this due diligence process has been incorporated in our ESG report. We remain committed to advancing our ESG goals throughout our organization, and we look forward to continued engagement with our shareholders and other stakeholders as we pursue additional initiatives in the future. At this time, I will turn the call over to Brian Evans to address our financial results and guidance in more detail.\n\nBrian Evans -- Chief Financial Officer\n\nThank you, George. Good morning, everyone. For the third quarter of 2022, we reported GAAP net income attributable to GEO of approximately $38 million. During the third quarter, we had a one-time loss on the extinguishment of debt, as well as nonrecurring expenses related to our recently completed debt transactions.\n\nAnd we also had a one-time gain on the sale of our equity investment interest in the Ravenhall Centre in Australia. Adjusting for these offsetting items we reported adjusted net income of $0.33 per diluted share on revenues of approximately $617 million for the third quarter of 2022, which represents one of the highest quarterly revenues in our company's history. And our adjusted EBITDA for the third quarter 2022 increased by 17% to approximately $136 million, which is an all-time high in quarterly adjusted EBITDA for our company. As a reminder, our third quarter 2022 results also reflect one and a half months of higher interest expense as a result of our completed debt restructuring.\n\nOur overall strong financial performance continues to be driven by growth in our electronic monitoring and supervision segment, increases in compensated mandates in our nonresidential reentry business, and improvements in occupancy rates in our active owned and leased secure facility. Our consistent growth throughout the year strengthened our ability to comprehensively address the substantial majority of our debt maturities through a series of transactions, which we successfully closed in August. The completed transactions staggered our debt maturities over a longer period of time, significantly reducing our near-term debt maturities to less than $300 million at closing. Following the closing of the transactions, we redeemed the remaining $126 million of our outstanding 2023 senior notes using available cash on hand.\n\nSubsequent to that, we completed the sale of our equity investment interest in the Ravenhall Centre in Australia for approximately $84 million in gross proceeds pre-tax. And we use those proceeds along with available cash on hand to repay the remaining $147 million of our outstanding 2024 term loans. As a result of all these steps, we have reduced our outstanding debt maturing prior to 2026 from $2 billion to just $23 million. And overall, we have reduced our net recourse debt to approximately $2 billion, which represents a reduction of approximately $400 million, since the beginning of 2020.\n\nWe have been focused on reducing our debt for the last three years, and we believe that our efforts have placed GEO in a materially stronger financial position. Assuming our financial performance remains consistent with our current run rate, we expect to be able to further reduce debt by at $200 million annually. At this rate of debt reduction, our goal would be to decrease leverage to below 3.5 times adjusted EBITDA by the end of 2023 and to below 3 times adjusted EBITDA by the end of 2024. After achieving our stated leverage targets, our hope is to be able to explore options to return capital to our shareholders and unlock additional equity value.\n\nTo complement our debt reduction efforts, we have also been exploring opportunities to sell company-owned assets and businesses over the last two years. With the sale of our equity investment interest in the Ravenhall Centre, we have now completed sales totaling approximately $154 million in proceeds, exceeding our previously articulated goal of between $100 million and $150 million in proceeds. Moving to our guidance for the balance of the year. This morning, we updated our guidance for the fourth quarter and the full year 2022.\n\nWe expect our fourth quarter 2022 net income attributable to GEO to be between $30 million and $32 million on quarterly revenues of $600 million to $605 million. And we have increased our fourth quarter 2022 adjusted EBITDA guidance to a range of $133 million and $140 million. Our fourth quarter 2022 guidance reflects the previously announced nonrenewal of our contract with the BOP for 1,800 beds North Lake Facility in Michigan effective September 30, 2022 and higher interest expense as a result of our completed debt transactions. We expect full year 2022 net income attributable to GEO to be between $160 million and $162 million on annual revenues of approximately $2.36 billion.\n\nAdjusting for unusual or nonoccurring items, we expect full year 2022 adjusted net income to be in a range of $1.30 to $1.32 per diluted share. And we have increased our full year 2022 adjusted EBITDA guidance to a range of $527 million to approximately $534 million. We expect our effective tax rate for the year to be approximately 28%, exclusive of any discrete items. At this time, I'll turn the call over to James Black for a review of our GEO Secure Services segment.\n\nJames Black -- President, GEO Secure Services\n\nThank you, Brian. Good morning, everyone. It is my pleasure to provide an update on GEO Secure Services. During the third quarter of 2022, our employees and facilities achieved several important milestones.\n\nOur facilities successfully underwent 54 audits, including internal audits, government reviewed, third-party accreditations, and certifications under the Prison Rape Elimination Act. Eight of our secure services facilities received accreditation from the American Correctional Association during the third quarter with an average score of 99.4%. And two of those facilities achieved a perfect accreditation score of 100%. Additionally, four of our secure services facilities received U.S.\n\nDepartment of Justice certification under the Prison Rape Elimination Act, with all of these facilities exceeding standards in several areas. Our GTI transportation division safely completed approximately 5.6 million miles driven in the United States and overseas during the third quarter of 2022. Every quarter, our secure services facilities and divisions achieved several important milestones, which are underpinned by the dedication and professionalism of our employees and their commitment to achieving operational excellence. With respect to the trends impacting our government agency partners, at the federal level, our BOP contract for the 1,800-bed North Lake Correctional Facility in Michigan was not renewed at the end of September 2022, consistent with our prior expectations.\n\nWe have enjoyed a decade-long partnership with the BOP. And our facilities have provided high quality support services at times when the agency needed capacity to address overcrowding across the federal prison system. However, over the last 10 years, BOP populations have declined. And this trend was accelerated during the COVID pandemic.\n\nWith the activation of our North Lake Correctional Facility, we now have six idle secure services facilities, totaling approximately 10,000 beds that were previously under contract with the BOP. We are focused on marketing these facilities to other government agencies at the federal and state level. And we hope to be able to reactivate, leased, or sell these important assets in the future. Turning to our U.S.\n\nMarshal Services contract, populations at U.S. Marshals detention facilities have remained stable over the last several years. The U.S. Marshals have custody responsibility for pretrial detainees facing federal criminal proceedings.\n\nAs we noted last quarter, our 770-bed San Diego facility for the U.S. Marshal Service recently received a contract extension through September 30, 2023. We have two other direct contracts with the U.S. Marshal Service in Georgia and Texas, with current option periods that run through February 2023 and September 2023, respectively.\n\nWe remain optimistic regarding the continued utilization of these important facilities, which we believe provided needed bed space and services near federal courthouses, where there's generally a lack of suitable alternative detention capacity. With respect to the U.S. Immigrations and Customs Enforcement, several ICE facilities continued to face operational restrictions resulting from the court orders related to the COVID pandemic. In addition to this court mandated limits, COVID-related restrictions first implemented in March of 2022 under Title 42 remain in place at the Southwest border.\n\nWhile we have recently experienced a modest increase in occupancy rates at some of our facilities, ICE detainee populations continue to be well below historical levels. With respect to the current funding levels for the agency, the U.S. Congress passed a continuing resolution at the end of September, which funds the federal government through the middle of December of this year. Under the continuing resolution, ICE is funded at the same levels provided in the prior fiscal year's budget, which includes funding for 34,000 detention beds.\n\nWe will continue to monitor the congressional appropriations process after the midterm elections. And we remain focused on providing high quality support services at our facilities and being prepared to respond to our government agency partner needs. The ICE processing centers, where we provide support services, offer 24/7 access to quality healthcare, access to legal counsel, culturally sensitive meals approved by registered dieticians, access to faith-based and religious opportunities, and enhanced amenities, including artificial turf soccer fields, covered pavilions, exercise equipment, multipurpose rooms, legal and leisure libraries. Our ICE processing centers help fulfill an important mission, with special purpose built facilities, amenities, and services in key geographical areas of the country where suitable alternatives are not often available.\n\nWe are therefore pleased with the recent favorable ruling by a non-BOP panel of the U.S. 9th Circuit Court of Appeals in relation to the state of California's AB 32 law, which would have prohibited the operation of detention facilities in the state of California by private contractors. The 8-3 decision by the en banc panel vacated a prior District Court decision that had denied request by GEO and the United States for declaratory and injunctive relief, barring application of the AB 32 law to federal immigration processing centers. The en banc panel rule that AB 32 would give California a virtual power review over detention decisions made by ICE in violation of the constitution supremacy clause, and that the state of California cannot exert such control over the federal government's detention operations.\n\nThis important ruling by the en banc 9th Circuit Court allows the continuation of our California civil detention support services contracts for the U.S. Department of Homeland Security. Moving to our state government agency partners, we recently entered into contract renewals for two manage-only state correctional and rehabilitation facilities. In Florida, our contract for the 1,948-bed South Bay Correctional and Rehabilitation Facility was renewed for a two-year term.\n\nAnd in Arizona, our contract for the 500-bed Phoenix West Correctional and Rehabilitation Facility was renewed for a five-year term. Both facilities deliver high-quality support services on behalf of our government agency partners, including enhanced rehabilitation programs and post-release services under our GEO Continuum of Care. Across all of our state facilities, we continue to focus on addressing the challenges we are facing as a result of a difficult labor market. We have worked closely with our state government agency partners and state legislative and executive branch leaders to address staffing shortages and wage inflation.\n\nAnd we have been able to receive additional funding under our contracts to support wage increases for our employees across several states. We are continuing to monitor opportunities at the state level. And several of our state government agency partners are considering initiatives, which could involve the use or purchase of contractor-owned facilities to address challenges presented by older state prison infrastructure and correctional officer shortages. Internationally, we recently completed the sale of our equity investment interest in the Ravenhall Centre in Australia.\n\nThis sale does not affect our management of the center, which we will continue to operate under our existing long-term contract. Finally, I'd like to briefly address our ongoing efforts to mitigate the impact of the COVID pandemic. While we are currently experiencing relatively low levels of COVID cases, we remain vigilant in the implementation of our mitigation strategies, which are consistent with the latest guidance issued by the Center for Disease Control and Prevention. At this time, I will turn the call over to Ann Schlarb for a review of GEO Care.\n\nAnn Schlarb -- President, GEO Care\n\nThank you, James, and good morning, everyone. I'm pleased to provide an update on our GEO Care business unit. Starting with our reentry services segment, our residential centers experienced a meaningful sequential increase in occupancy rates of 5 percentage points. However, residential reentry population continued to be well below historical levels and across our active facilities, our occupancy stands at 54%.\n\nOur residential reentry centers have been impacted throughout the COVID pandemic, as government agencies have prioritized nonresidential alternatives, including furloughs, home confinement, day reporting, and electronic monitoring programs. Despite these challenges, we have continued to successfully renew our existing contracts, and we are encouraged by the recent trends in occupancy rates. During the third quarter, we renewed five residential reentry contracts, including three contracts with the Federal Bureau of Prisons. During the quarter, we also made the decision to consolidate some of our residential reentry populations in New Jersey, which resulted in a discontinuation of our Bo Robinson facility, but increased our occupancy rates at our Harbor facility.\n\nWe are continually evaluating occupancy trends in order to optimize the utilization of our residential reentry assets. Additionally, nine of our residential reentry centers, recently received accreditation from the American Correctional Association with an average score of 99.9%. And we are very proud that eight of the nine centers received perfect accreditation scores of 100%. Seven of our residential reentry centers received U.S.\n\nDepartment of Justice certification under the Prison Rape Elimination Act with all these facilities exceeding standards in several areas. These important milestones are the results of the daily commitment and dedication of our frontline employees for whom we are very grateful. Looking at our nonresidential programs and services, we continue to experience strong growth during the third quarter. Compensated mandates for our nonresidential reentry business increased by 27% year over year with quarterly revenues now topping $24 million.\n\nOur Electronic Monitoring and Supervision segment also continued to deliver strong revenue growth during the third quarter with our quarterly revenue run rate increasing to approximately $137 million. Our BI subsidiary provides a full suite of electronic monitoring and supervision solutions, products, and technologies on behalf of federal, state, and local agencies across the country. At the federal level, BI provides technology solutions, holistic case management, supervision, monitoring, and compliance services under the Intensive Supervision and Appearance Program, or ISAP, on behalf of ICE and the U.S. Department of Homeland Security.\n\nBI has been the incumbent service provider under ISAP since 2004, and we are currently delivering these comprehensive services under a five-year contract, effective through July of 2025. Over the years, the ISAP program has grown steadily. And since the beginning of 2021, this growth has accelerated. Based on the latest publicly available data, the number of individuals enrolled in ISAP exceeds 300,000.\n\nUnder BI's tenure, the ISAP program has achieved high levels of compliance for participants going through the immigration review process. For instance, between August of 2021 and May of 2022, 99.6% of ISAP participants attended required meetings with their case specialists, and 99.3% of ISAP participants attended all of the required immigration court hearings. We believe that the high success rate under the ISAP program is underpinned by our partnership with ICE and the BI's ability to continually innovate. Our team at BI is constantly working on new and innovative solutions, ranging from cutting-edge technologies, to enhanced case management services.\n\nEarlier this year, BI hosted hundreds of government agency partners at our annual customer technology and training forum, where we showcase our new state-of-the-art wrist-worn monitoring device. We believe that this new technology has the potential to drive additional growth opportunities for BI in the delivery of monitoring solutions for both immigration related services and the criminal justice space. With respect to the recent procurement issued by ICE for a case management program with no technology component for approximately 16,000 young adults, this contract was awarded to a different service provider. Turning to our GEO Continuum of Care division, our employees have continued to deliver enhanced in-custody rehabilitation, reentry programming, and post-release support services to an average daily population of approximately 31,500 participants.\n\nOur GEO Continuum of Care integrates enhanced in-custody rehabilitation, including cognitive behavioral treatment, with post-release support services that address community needs of relief individuals, including housing, food, clothing, transportation, and employment assistance. During the third quarter of 2022, our post release support services allocated over $240,000 to support individuals released from GEO facilities as they return to their communities. This funding brings the total spending on post release expenses to more than $7.4 million, since we began providing support grants for released individuals in 2016 to assist them with their community needs. We believe that the scope and substance of our award-winning GEO Continuum of Care program is unparalleled.\n\nAnd it provides a proven model on how the 2.2 million people in the U.S. criminal justice system can be better served and changing their lives. Finally, our GEO Care facilities and programs continue to focus on implementing COVID mitigation steps that are consistent with the latest guidance issued by the CDC. And at this time, I'll return the call to Jose Gordo for closing remarks.\n\nJose Gordo -- Chief Executive Officer\n\nThank you, Ann. Our diversified business units have continued to deliver strong financial results and achieve important operational milestones during the third quarter. This robust performance allowed us to achieve one of our highest quarterly top-line revenues and a new top -- and a new all-time high in quarterly adjusted EBITDA. Our consistently strong performance throughout this entire year position our management team to be able to successfully complete a series of comprehensive transactions to address the substantial majority of our debt maturities.\n\nThese transactions, coupled with our efforts to sell noncore assets, have allowed us to reduce our overall net recourse debt to approximately $2 billion and have staggered our remaining debt maturities further out into the future. Importantly, we have significantly reduced our near-term maturities from approximately $2 billion to just $23 million in remaining outstanding debt due between now and 2026. As a result of these efforts, we believe GEO is now in a materially stronger financial position. While we continue to focus on reducing our net recourse debt and our net leverage over the next two years, our hope is to be able to explore options to return capital to shareholders at the earliest possible time.\n\nWe hope that all these efforts will unlock additional equity value for our shareholders. We are pleased with the continued growth across our business segments. However, we also recognize the staffing shortages and wage inflation are posing a difficult challenge for companies across diverse industries. And we have proactively address these challenges, working closely with our government agency partners to secure additional funding to support wage increases for our employees across several states.\n\nWe are grateful for the continued dedication and commitment of our front-line employees who make daily sacrifices to deliver high-quality services on behalf of our government agency partners, and provide safe and compassionate care to all those entrusted to our facilities and programs. Our cash flows are supported by valuable company-owned real estate assets and diversified business units entailing essential government services, ranging from secure residential care to community based and technology solutions. We believe that our continued strong financial and operational performance, which is underpinned by these diversified business units, sets GEO apart in our industry. That completes our remarks, and we will be glad to take questions.\n\nOperator\n\n[Operator instructions] The first question today comes from Joe Gomes with Noble Capital. Please go ahead.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nThank you. Good morning. Congrats on the quarter.\n\nGeorge Zoley -- Executive Chairman of the Board\n\nThank you.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nJust wanted to start off with BI today. Again, really strong numbers, really positive growth. Also saw that they recently renewed an agreement with OMNIA Partners. And they're just trying to get a little more color detail as to what that could possibly mean for maybe even an additional growth at the BI business?\n\nAnn Schlarb -- President, GEO Care\n\nThank you for your question. This is Ann. And we've had our contract with OMNIA Partners for several years now. So, as you stated, this was a renewal.\n\nAnd that allows individuals in the criminal justice market our customers to use that contracting platform to provide services -- BI technology services through that platform. So, we continue to grow through that platform with the pricing that's set through the contract that we negotiated.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nOK. And switching gears to ICE. You know, you talked a little bit about it. You know, if I look at the ICE daily populations, they've grown to about 26,000 by the end of September from roughly 20,000 earlier in the year.\n\nJust wondering, you know, how much of that increase are you guys seeing? You know, where do we stand on reaching or exceeding hopefully some of the contract minimums? Any thoughts you may have on, you know, Title 42 and when we think that might finally be rescinded?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nWe don't have any unique insight as to when Title 42 may be rescinded. But we have seen fairly steady growth in our ICE occupancy during the fourth quarter so far. It was more modest in the third quarter. But during the fourth quarter, we have seen a more significant increase in occupancies, particularly in those facilities in the southern border space.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nAny comment on when you might be exceeding some of your contract minimums?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nNot at this time. No.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nOK. OK. Is there any impact on the financial statement here from the sale of the Ravenhall equity interest that we need to be aware of?\n\nBrian Evans -- Chief Financial Officer\n\nWell, I think in the earnings release, it's in the gain-on-sale that's reported in the income statement. And then going forward, there is an impact to the -- I think it's the net income and the revenue line a modest amount. The annual impact is probably between $7 million and $8 million a year in pre-tax earnings.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nOK. Thank you for that color. On the idle beds, idle facilities, we've talked a lot here, partly because we've had some of the nonrenewals on the BOP side. You know, your idle beds are now exceeding 13,000.\n\nJust trying to get a little more color as to in the marketing those, when we might be able to see some of those facilities, back online and contributing again in terms of the top line. I know it's difficult to project. But just trying to get a little better feel for how negotiations are going or, you know, how other parties -- how interested other parties are actually in some of these facilities?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nWell, given -- we are less than two weeks from election, the fourth quarter of an election year usually results in federal and state organizations, you know, deferring any new contract projects. So, I wouldn't expect any new decisions until early next year possibly the first quarter.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nOK. And one more if I may and then I'll pass it on. Obviously, a big win in the legal -- on the legal side in California. Just wondering, are there anything -- is there anything else out there in the legal front that is significant that you're dealing with today?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nWell, I think it's publicly known that we're in litigation regarding the volunteer work program in ICE facilities in several states. And there's a challenge to the compensation, which is established by Congress in the contract, which is establishes as $1 per day. And some states are challenging that, some plaintiffs are challenging that and asking for the state minimum wage. So, we're in litigation on that matter.\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nOK. Great. Again, congrats on the quarter. You guys continue to knock the cover off the ball here operationally.\n\nVery impressive. And I'll get back in queue. Thank you.\n\nGeorge Zoley -- Executive Chairman of the Board\n\nThank you.\n\nOperator\n\nThe next question comes from Mitra Ramgopal with Sidoti. Please go ahead.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nYes. Hi. Good morning. Thanks for taking the questions.\n\nFirst, I just want to touch on the margins really nice margin improvement this quarter and obviously helped by the improved top line. But I was just wondering more on the cost side, especially given the tight labor market environment that a lot of companies have having difficulty with. You know, any specific thing is you're able to do on the operating side to also help in terms of the margin improvement?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nWell, dividing our business between federal and state. At the federal level, we really haven't -- had problems with recruitment because the compensation in federal facilities is usually at a higher level, and we don't. And it's adjusted periodically by the Department of Labor. So, we're almost, you know, pretty insulated from recessions, or problems with labor compensation.\n\nBut at the state level, because our state clients are in the same situation as we are regarding the historically high vacancy rates, they have gone to the legislatures to ask for additional funding. And along with their requests, we've made similar requests, and they've been approved. So, we've both been able to simultaneously, on a staggered step-by-step basis, increase the compensation at our state facilities progressively. And we -- although it may be a continuous process because the labor market is still fairly tight, but we've been very much encouraged and because of this success that's occurred by our state clients on their behalf, as well as ours, to increase the wages at state correctional facilities.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nThanks. And I take it, you know, the ability to be able to increase the wages, you're not seeing any noticeable change in turnover?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nWell, the turnover reduces. As you increase the wages, there's greater stability in the labor force.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nThanks. And regarding the ICE facilities, you mentioned the COVID restrictions still having an impact in terms of occupancy there. Just curious if you're hearing anything on that front as to when these restrictions might ultimately get lifted?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nThere hasn't been any change in the COVID restrictions for several months now. And, you know, we don't expect there to be a change for the balance of the year. So, we'll see what happens next year.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nAnd then just coming back on the BI business and the omni renewal, just curious, if I believe it given the increased the technology capabilities you have as related things like GPS tracking, smartphone applications, etc. Do you think that has a chance of maybe even accelerating the growth you're seeing now in terms of more parties willing to come on board and adopt this technology?\n\nAnn Schlarb -- President, GEO Care\n\nI think it allows another vehicle for them to use the technology. The agencies can put things out to bid, or they could go straight to using this procurement vehicle. So, it gives them another avenue to access the technology that they're looking for. But I do think that as we expand our suite of products and services to the customer, it allows them to have more diversity and how they're looking at managing their population.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nOK. Thanks. And as we look out to 2023, clearly, this has really been nice, a very strong year. And some of the metrics you've highlighted in terms of the adjusted EBITDA, even the revenue run rate, etc., we're seeing themes like level -- put them on top of the significant progress you made, restructuring the debt, extending the maturity, etc.\n\nAs you look out to 2023, what do you see as sort of like maybe the biggest headwind for you? Because it just seems like everything is starting to come together here. Obviously, the political environment is still very much an unknown, but in terms of what you can control.\n\nGeorge Zoley -- Executive Chairman of the Board\n\nI really don't see any big headwinds. I see big opportunities for next year, actually. I see continued improvement in our state wages. I see continued improvement in our occupancy levels and our federal facilities.\n\nAnd I see opportunities for reengagement of our idle facilities by either state or federal organizations.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nOK. That's great. Thanks again for taking the questions.\n\nOperator\n\nThe next question comes from Jay McCanless with Wedbush. Please go ahead.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nHey. Good morning. Thanks for taking my questions. Just a couple of questions around electronic monitoring and the growth you've seen there.\n\nIs that mostly driven by the federal level? Or as a collection of states, any kind of insight into that rapid growth would be appreciated.\n\nGeorge Zoley -- Executive Chairman of the Board\n\nMost of it is attributed to the federal level.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nOK. And do you expect going forward that we'll see the same kind of increase? Or is it going to -- you're going to have to sign another set of contracts to see this kind of step function higher in the revenues?\n\nBrian Evans -- Chief Financial Officer\n\nYes, so, the contract it has had the recent accelerated growth, I mean, there's no caps on those contracts and, really, any of the contracts. There's no guaranteed minimums or maximums. So, the contracts can expand or, you know, go down as the customer sees fit. Fortunately, and historically, most of these contracts have been utilized at a high level.\n\nAnd the customers have continued to expand them. And most recently, the federal customer has expanded it significantly. I think as Ann said also in her comments, there is some new technology that we are developing and rolling out. They introduced the risk borne device at their technology forum.\n\nAnd we believe that will create additional opportunities for the company going forward.\n\nGeorge Zoley -- Executive Chairman of the Board\n\nBut our forecast assumes steady level.\n\nBrian Evans -- Chief Financial Officer\n\nCurrent run rate right now. We haven't --\n\nGeorge Zoley -- Executive Chairman of the Board\n\nSo, any significant increase would be additive to our forecast.\n\nBrian Evans -- Chief Financial Officer\n\nYeah. And we'll update for that in our next conference call for the 2023 earnings.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nOK. Great. Thanks for taking my questions.\n\nOperator\n\nThe next question comes from Kirk Ludtke with Imperial Capital. Please go ahead.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nHello, everyone. Congratulations on the exchange in the quarter. Just a couple of follow-ups. With respect to the federal budget, you mentioned that ICE is funded at 34,000 beds through mid-December.\n\nI'm trying to get a better sense for the risks surrounding this funding. And I'm just curious, has funding ever been a constraint for ICE occupancy?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nIn the past, they have often exceeded their authorized funding for that line item and had to borrow funds from other line items within the Department of Homeland Security, I believe. But their present funding through December, which is the same as the funding for the prior year which is at 34,000 beds. And I believe the occupancy levels that are available publicly reveal that the current level of ICE detention is approximately 30,000.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nGot it. Thank you. That's helpful.\n\nGeorge Zoley -- Executive Chairman of the Board\n\nSo, they -- even when they have exceeded their occupancy levels for funding, they have been able to obtain additional funding to carry those -- to carry them through the year.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nGot it. That makes sense. And with respect to the ICE population versus the ISAP population, do you think there is -- is there any reason to think that these are inversely correlated?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nNo. I think they are totally separate, totally separate. The ISAP program is a program in lieu of detention, obviously. That's the nature of the program.\n\nBut we have seen growth in this fourth quarter, this partial fourth quarter of steady growth in both areas actually.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nGot it. This is maybe the first time where we have seen both.\n\nGeorge Zoley -- Executive Chairman of the Board\n\nFor this year, yes.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nGot it. Thank you. And with respect to staffing, is there anything you can say about how staffing would change if the ICE population went back to pre-COVID levels?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nIt would not change much, because we have these minimum guarantees that essentially require the majority, if not the entire staffing, for the facility.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nGot it. Thank you. And then just a couple minor ones, the availability that you show on the two revolving credits on the supplement, that reflects the maintenance of financial covenants and those agreements, right?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nYes. Yes. That's fully available.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nAnd then, lastly, thinking out to the 2023, a bit. Can you help us think through a government shutdown and what that means, you know, if the debt ceiling is not raised in time?\n\nGeorge Zoley -- Executive Chairman of the Board\n\nWell, we've had government shutdowns in the past. And it has not affected us because we are considered an essential government service. So, our facilities remain open. Our services remain ongoing.\n\nAnd we eventually receive payment when the government is reestablished from a budget standpoint.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nRight. So, it's the last part that I'm focused on. Your payments are delayed -- your payments from the federal government would be delayed?\n\nBrian Evans -- Chief Financial Officer\n\nThey can be. That's the main issue that we've experienced in the past. There'll be some delay, depends on how long the government shuts down. I mean, if it's just relatively short, it really has no impact.\n\nIf it's longer, then you're going to have some delays in payments. But they usually catch back up pretty quick to, as George said, once they --\n\nGeorge Zoley -- Executive Chairman of the Board\n\nBecause our payments are usually one month in arrears, so the shutdown would have to be more than a month, which has never occurred.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nNever?\n\nBrian Evans -- Chief Financial Officer\n\nThat's never happened.\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nOK, got it. That's all I need. Thank you. I appreciate it.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to George Zoley, executive chairman for GEO, for any closing remarks.\n\nGeorge Zoley -- Executive Chairman of the Board\n\nOK. Thank you very much for joining us on this conference call. We look to addressing you in our next one. Thank you.\n\nBye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPablo Paez -- Executive Vice President, Corporate Relations\n\nGeorge Zoley -- Executive Chairman of the Board\n\nBrian Evans -- Chief Financial Officer\n\nJames Black -- President, GEO Secure Services\n\nAnn Schlarb -- President, GEO Care\n\nJose Gordo -- Chief Executive Officer\n\nJoe Gomes -- Noble Capital Markets -- Analyst\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nKirk Ludtke -- Imperial Capital -- Analyst\n\nMore GEO analysis\n\nAll earnings call transcripts"
}