{
  "companyName": "Edgio Inc.",
  "companyTicker": "EGIO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/edgio-inc-egio-q2-2022-earnings-call-transcript/",
  "content": "Edgio Inc. (EGIO 3.67%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nHello, and welcome to today's Edgio Q2 2022 financial results conference call. My name is Elliot, and I'll be coordinating your call today. [Operator instructions] I would now like to hand over to Sameet Sinha with Edgio. The floor is yours.\n\nPlease go ahead.\n\nSameet Sinha -- Vice President of Investor Relations and Corporate Development\n\nGood afternoon. Thank you for joining the Edgio second quarter 2022 financial results conference call. This call is being recorded today, August 8, 2022, and will be archived on our website for approximately 10 days. Let me start by quickly covering the safe harbor.\n\nWe would like to remind everyone that we'll be making forward-looking statements on this call. Forward-looking statements are all statements that are not particularly statements of historical facts, such as our priorities, our expectations, our operational plans, business strategies, secular trends, product and feature functionalities, pro forma results, acquisition activities and contributions from acquired businesses. Actual results could differ materially from those contemplated by our forward-looking statements, and reported results should not be considered as an indication of future performance. For more information, please refer to the risk factors discussed in our periodic filings, including our most recent annual Form 10-K and quarterly reports on Form 10-Q.\n\nThe forward-looking statements on this call are based on information available to us as of today's date, and we disclaim any obligation to update any forward-looking statements, except as required by law. Joining me on the call today are Bob Lyons, our president and CEO; and Dan Boncel, EVP and CFO. Bob will start today's call with a brief discussion of the results and an update on our business and integration with Edgecast. Dan will then review financial results and guidance.\n\nFollowing that, Bob will use the remainder of the time to discuss aspects of our strategy and corporate initiatives going forward. I will now turn the call over to Bob.\n\nBob Lyons -- President and Chief Executive Officer\n\nThank you, Sameet, and welcome, everyone. It has been less than two months since we closed on the acquisition of Edgecast and form Edgio. We remain very excited about this transformational combination. Edgio is now a more diversified edge-enabled solutions company and has assembled the building blocks to improve profitability and accelerate growth.\n\nIn the second quarter of 2022, we continue to build on three previous quarters of positive momentum with revenue of $74.3 million, an improvement of 54% year over year. Limelight contributed $61.5 million, demonstrating 27% organic year-over-year growth across all aspects of our core business. Edgecast contributed an additional $12.8 million. We expanded our capacity by approximately 10% at Limelight largely in support of the forecasted needs later this year.\n\nThis capacity was ordered in the fall of 2021 and when combined with the acquired Edgecast capacity, we had mitigated previously highlighted supply chain concerns. We are well positioned for continued growth through this year and into next year, albeit resulting in a temporary gross margin impact for this quarter. We expect gross margins to continue improving sequentially going forward. Our pipeline also continues to grow, already up 50% this year and heavily focused on our high-margin, high-growth AppOps opportunities.\n\nIn the week that closed, we have successfully implemented the first phase of our integration plan. Our initial diligence indicated at least $50 million in synergies, half of which would be achieved in the first two quarters after close. Post closing, our deep analysis has resulted in an expanded synergy opportunity of at least $50 million. Of that, we have already achieved $17.5 million, well ahead of plan.\n\nAll of these are planned to be net run rate savings. We have also completed the first detailed 2023 bottom-up profitability and revenue level for the combined companies. There is more work to be done before we can lock in our 2023 plan and provide solid guidance. However, we do feel it is important to provide some clarity on our current outlook.\n\nWe expect 2023 revenue to be somewhere between $550 million and $560 million, with an adjusted EBITDA that exceeds $65 million. This would imply a year-over-year revenue growth of approximately 44% and adjusted EBITDA margin expansion from 4% in 2022 to 12% in 2023. Currently, this outlook did not include commercial synergies or platform utilization improvements, providing initial upside opportunity and downside risk edge. At last year's analyst day, we committed to taking both steps to become a leading edge-enabled solutions provider.\n\nWe outlined what we believe to be a large unmet market opportunity to provide edge-enabled solutions that simplify development for builders and meaningfully improve speed and security for operators. We have, in fact, delivered on that commitment. We currently offer three solutions. Edgio AppOps, which includes security, Edgio Delivery and Edgio Streaming, each solution boasts best-in-class capabilities and each benefits from our massive field edge platform.\n\nAppOps currently representing approximately 20% of revenue is expected to support significant high-margin growth for us. This solution is made up of our App Edge, App security and App platform products. Collectively, they provide the most powerful comprehensive cloud security suite, development platform and application CDN in the world. We believe this solution will be highly disruptive in the emerging high-growth web 3.0 sector.\n\nWe have successfully completed the first phase of our broader security strategy and have the most complete web application and API protection product in the market. Our solution includes DOS, WAF and WAF management capabilities, and we have displaced competitor solutions at Accenture, Risks, Symantec, Verizon and Citibank to name a few. In mid-July, our security product reported a 355 million packet per second DDoS attack, one of the largest attacks ever recorded. The client had no impact at all.\n\nOur delivery solution boasts approximately 230 terabytes per second event capacity delivered through more than 300 PoPs across the globe, making us the second largest and most performing in the world. We have also added 10 terabytes of additional capacity this quarter and are able to offer combined Limelight and Edgecast capacity seamlessly to our clients. This enables us to provide clients with high-performance capacity that was previously not possible and positions us well for continued organic growth going forward. Streaming may prove to be the most underrated solution in our portfolio, representing approximately 25% of our revenue.\n\nEdgio Streaming handled mission-critical applications for some of the most demanding and well-known companies. Our streaming solution can capture viewer usage and experience data wherever the viewer goes, enabling us to continuously improve viewer experience in real time. In fact, we will manage more than 30,000 live events and encircle over 50 billion ads for clients this year alone. My conversations with our streaming clients indicate our solution is meeting or exceeding their evolving needs as new content and seasonal event rosters rapidly expand.\n\nWe continue to work through our strategic planning process and look forward to unpacking our strategy for this compelling set of capabilities in greater detail at our analyst day. Our best-in-class solutions powered by our massively scaled and highly performing edge platform positions us well to benefit from sector tailwinds such as web 3.0, security threats, cord-cutting, linear streaming TV and gaming. In short, we continue to successfully execute on our multiyear transformation plan. In the past 12 months, we have successfully completed two acquisitions, overhauled all aspects of our operating model, removed $50 million of costs and implemented a new commercial team.\n\nOur solutions are demonstrating proof of value. Our clients continue to do more with us and our strategy benefits from sector tailwinds. We believe all of this supports a business that will continue to capture market share and sustain growth. As we look beyond our planning period, we remain confident in our ability to be a growth-oriented technology company with a greater than 60% gross margin, 15% EBITDA and positive free cash flow.\n\nWe will continue to be unwavering in this pursuit. At our upcoming analyst day, we will go into greater detail unpacking our strategy, operating plans and financial road map. We plan on announcing more details to them and are finalizing the dates and market calendars. At this time, I will turn the call over to Dan to impact second quarter financials.\n\nDan Boncel -- Chief Financial Officer\n\nThank you, Bob. Revenue from the second quarter was $74.3 million, up 54% from the second quarter of 2021 and our third consecutive quarter of double-digit percentage revenue growth over the prior year. Limelight contributed $61.5 million, supporting a 27% year-over-year growth and Edgecast contributed $12.8 million for the 16 days that results were included. Pro forma gross margins expanded to 38.4%, up from 32.7% in the second quarter of 2021, an increase of 570 basis points.\n\nWe added over 10 terabits per second of capacity during the second quarter in order to support expected growth in traffic. As traffic ramps and utilization improves and we realize synergies from the integration of Edgecast, we expect continued gross margin expansion over the next few quarters, Pro forma operating expenses, excluding stock-based compensation, restructuring and acquisition-related expenses were $28.9 million or 39% of revenue, up from 32% last year. The increase in operating expenses is driven by the inclusion of Edgecast expenses post June 15 close. Second quarter acquisition and legal-related charges in connection with the Edgecast transaction were approximately $14 million.\n\nAlso, immediately following close, we began taking steps to implement our target operating model, resulting in a restructuring charge of approximately $4.4 million, primarily related to severance benefits for 51 employees across the business. This will result in estimated annualized savings of over $10 million. As Bob mentioned, we already have realized $17.5 million in annualized synergy savings and expect to realize an additional $40 million plus of synergies. Second quarter 2022 adjusted EBITDA was slightly below breakeven due to the incremental spend on capacity added during the quarter as well as additional operating expenses from Edgecast.\n\nCash and marketable securities totaled $76 million, an increase of $15.4 million from the first quarter of 2022. We have an existing unused $25 million credit facility and the ability to upsize that based on added Edgecast collateral. We spent $13 million for capital expenditures in the quarter. Our liquidity position today is stronger than it was before the acquisition.\n\nWe believe that our current balance sheet and target operating model provides adequate liquidity and the strength to continue investing in our business as capital markets continue to tighten and recessionary fears continue. We have and will continue to take aggressive cost actions, further strengthening our balance sheet. Accounts receivable increased $108 million due to approximately $50 million of receivables from Edgecast. We have reviewed the agent in detail and as expected, it is composed of high-quality blue-chip customers with strong credit history.\n\nWe expect DSO to be in the 50- to 60-day range post integration. For the full year 2022, we are updating our guidance as follows. We expect a revenue range of $380 million to $390 million and adjusted EBITDA range of $13 million to $16 million. These numbers capture the previously disclosed streaming client loss and assume 45% of overall revenue will be from high-margin AppOps and streaming [Inaudible].\n\nWe expect gross margins and adjusted EBITDA to continually improve throughout this year and next year as we realize the benefit of planned synergies, increased utilization and diversified revenue mix. As we look beyond this year, our preliminary outlook for 2023 indicates a revenue range of $550 million to $560 million and adjusted EBITDA of at least $65 million. Beyond 2023, we continue to have confidence in our ability to achieve our longer-term objective of double-digit revenue growth, 60% gross margins and 15% adjusted EBITDA and with sustained positive free cash flow. With that, I will turn the call back over to Bob.\n\nBob Lyons -- President and Chief Executive Officer\n\nThanks, Dan. We committed to taking bold steps toward greatly improving client and shareholder value, and we continue to deliver on that commitment. While we are no doubt part of the progress we have made in short order, we remain focused on the opportunities in front of us and what has required of us to capture those opportunities. We are now one of the largest independent edge platforms in the world with unparalleled performance, security, live event and streaming capabilities.\n\nWhile we are a client-first company, our products are, in fact, best-in-class. I'll close by sharing some observations we have across our industry and how that shapes our outlook. We currently do not see any weakness in the number of hours a day people have eyeballs on glass. We do see some subtle shifts in where they are viewing, but believe our current portfolio, which includes streaming, applications, gaming and social media positions us well to follow these eyeballs wherever they go.\n\nOur growth is no longer tied to streaming trends but rather in our ability to capture market share. The aforementioned DDoS attack is indicative of a continued environment of risk for clients around the world. larger, more sophisticated high-state cybersecurity attacks and make headlines every day, delivering a secure experience is the only way to meet consumer expectations and continues to help differentiate Edgio across our AppOps, delivery and streaming solutions. We continue to see a large unmet need for outcome-based solutions versus tools.\n\nThe tools for all is detrimental to productivity, speed and security, and we are firmly positioned to address those needs for outcome buyers. This economic environment creates opportunities for companies that have momentum and a strong balance sheet. We have both as well as a strong partner at Apollo, who believes in our value creation strategy. We believe that our strengthening performance, coupled with the challenging capital markets will provide us additional expansion opportunities to consider.\n\nWe will remain acquisitive. And as always, we'll focus on deals that expand our relative scale, extend the use of our edge platform, expand our security capabilities and that will immediately be accretive to shareholder value. We have made meaningful progress in the past six quarters and have delivered three quarters of year-over-year positive revenue growth. Our leading indicators support a continuation of this momentum with expected year-over-year growth of 44% in 2023 and continued improvement to gross margins and adjusted EBITDA.\n\nWe continue to strengthen our team from the board to management. We are very excited to have added three new board members and the talent and expertise they bring to Edgio. We are also excited about the recent appointments such as our Chief Information Security Officer and our chief legal officer. Edgio is quickly realizing our transformative vision and demonstrating our ability to improve profitability and growth.\n\nWe have assembled the building blocks and established a foundation of solutions that have a clear rate to win in a highly attractive $40 billion market, and our company continues to strengthen. We thank our investors for their continued support and look forward to working together to achieve what we know to be uniquely possible for us. With that, operator, please open up the lines for the question-and-answer session.\n\nOperator\n\n[Operator instructions] Our first question today comes from Mike Latimore from Northland Capital Markets. Your line is open. Please go ahead.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nGreat. Thank you. Congratulations on all the news here. Diversification is an important part of the acquisition.\n\nI guess, as you look to the second half of the year, what would you expect your largest customer to contribute as a percent of revenue?\n\nBob Lyons -- President and Chief Executive Officer\n\nHey, Mike. It's Bob. I'll let Dan weigh in. But that was one of the key parts of this acquisition is that not only did we diversify our product revenue and have a higher mix of high-margin revenue, but also client diversification.\n\nWe only have one client above 10%, and that client will be around 13%. You can probably get who that is. It's been traditionally a very large customer for us. So historically, they've been running closer to 30%.\n\nSo that's a significant the concentration of a large client.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nGreat. Yeah...\n\nDan Boncel -- Chief Financial Officer\n\nYeah, the only other thing I would add there is the other large client from Edgecast was Verizon, and we have them locked into a three-year contract based on agreements that we put in place, along with the acquisition. They continue to be very strong in traffic, not only with their delivery service, but with their streaming service. And so that could be another one that gets up to that level, but that's a good thing based on the traffic we're delivering for them and how we're performing for them.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nGreat. And then you touched a little bit on the potential influence of the recession or inflation on consumer activity. What about just kind of enterprise sales cycles? Have you seen any changes there?\n\nBob Lyons -- President and Chief Executive Officer\n\nYeah, that's a great question, Mike. Historically, in my experience and what we've seen here as well is that is where you tend to see enterprise sales cycles slow down. I mean people are not spending money to holding on to it. Interestingly, with us, our thesis on that is we definitely are seeing that.\n\nBut when you look at our solutions, our solutions are really focused on giving more for less and reducing TCO. So we actually believe that there's an opportunity for us to come in and provide a better answer where people can trim their budgets and still move their companies forward with better security, better performance and better productivity. And so we've actually spent a lot of time with our marketing team putting together campaigns that we started launching about 30 days ago that are really focused on that. Basically, you can have more or less kind of campaigns.\n\nAnd so we're going to try to take advantage of that to the best of our ability. But that is a traditional thing in the enterprise sales as the sales cycle extending out basically.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nOK, great. Good luck. Thank you.\n\nBob Lyons -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Frank Louthan from Raymond James. Your line is open.\n\nFrank Louthan -- Raymond James -- Analyst\n\nThank you. Hey, as you've looked at the sort of the portfolio business out of EdgeCast, any concern either CDN customers may want to diversify a little bit more now that they maybe have some higher concentration of business with you? And then for next year on the capex, is it in a similar range of, as a percentage of revenue, would we expect or would it be running a little higher initially? How should we think about that? Thanks.\n\nBob Lyons -- President and Chief Executive Officer\n\nYeah. Great. Thanks, Frank. I'll take the first one.\n\nThat was actually one of the really important parts of this deal is that there was almost no overlap at all in customers. And so we don't see that at all. You might recall, we had one client that overlapped, and that client actually wants to do more with us. They want a big client on either side and actually like the stability of Edgio better.\n\nSo we're actually expanding that client meaningfully. And so we've had actually the opposite effect. We had no overlap other than that. And I would say that probably overall, the sentiment is Edgio is a much more stable company than the two individual ones given where they were.\n\nAnd so they're willing to lean in more. They look at us as a true alternative to maybe somebody else in the market that they're a little heavily weighted on today. So that was that one. I'm sorry, what was the second question again?\n\nFrank Louthan -- Raymond James -- Analyst\n\nOn the capex, is it, next year it could be expected to be similar percentage of revenue? Or will it start out a little higher before you get into the longer term?\n\nBob Lyons -- President and Chief Executive Officer\n\nYes. I'll tell you how we think about it qualitatively and then how it shows up quantitatively will come out as we give better guidance later in the year. But if you think about the two factors, we definitely expect the company to get better at reducing our capital intensity. Historically, as you know, we've run at 10%, that will reduce for two reasons.\n\nOne, as we have a higher concentration of revenue that's non-CDN related, those are low capex businesses. And so you generally are going to have a lower percentage of revenue on capex, number one. And then number two, the investments that we've been making in Linux and other things actually reduces that. And then the third thing is our Edge Xtend product actually allows us to have more capacity without having to spend the capex.\n\nSo those are the three things that we're driving. We see very good early indicators and early success in all three of those things. And as we go into next year, there's a point in which we definitely get better at capex and get more efficient at that. We're not willing to call it yet because there are so many opportunities available to us to invest in the short term to get very quick payback, and we want to make sure we capture all those things because it translates into getting that gross margin where we want to get it to.\n\nSo I would say as we get closer to the end of the year, we'll have a better idea there. But generally speaking, we will get more efficient with capex. The only question really is the timing and how much and we're not ready to call that yet.\n\nFrank Louthan -- Raymond James -- Analyst\n\nOK. And where are you as far as the percentage of complete on the Linux conversion?\n\nBob Lyons -- President and Chief Executive Officer\n\nSo we've actually done the completion of putting it in production and really now it's a rollout conversation. And so it's a combination of getting the equipment and then also make sure that we roll it out without creating any kind of impact, particularly going into Q3 and Q4, we're having more traffic. We've got to do that thoughtfully and take advantage of that. So as far as a specific time frame, I would say we're in the probably second or third inning of a ninth inning game.\n\nFrank Louthan -- Raymond James -- Analyst\n\nGot it. OK, great. Thank you very much.\n\nOperator\n\nWe now turn to Eric Martinuzzi from Lake Street. Your line is open. Please go ahead.\n\nEric Martinuzzi -- Lake Street Capital -- Analyst\n\nHey, it's Eric Martinuzzi from Lake Street. Just a question regarding the gross margins in the quarter. It seems like you made this decision to do the capacity expansion. But was that after you've given the outlook for the quarter or was this already baked in as you came out of Q1?\n\nDan Boncel -- Chief Financial Officer\n\nYeah, so we added capacity, a huge amount of capacity in the quarter is 10 terabits. And so coming out of last year, we didn't have clear visibility into when we are actually going to get the equipment in order to add that capacity that we felt we needed for the second half of 2022 in order to support the volumes to support the revenue forecast that we were rolling up. And so it just happened that we had a lot of capex that actually came in, in order for us to build that out during the quarter. And so we took that opportunity to roll that out without knowing exactly when the Edgecast deal was going to close.\n\nAs Bob mentioned, we think that capex can come down in the second half of the year '23 by better utilizing the capacity that we've recently rolled out, but also better utilizing the Edgecast capacity that we now have that we didn't know we were going to get as quickly as we did. And so is the kind of all the factors.\n\nEric Martinuzzi -- Lake Street Capital -- Analyst\n\nGot you. And then as far as, you talked about a sequential improvement of better utilization in Q3, Q4, what are we looking at as far as kind of narrow things down for us as far as that cash gross margin expansion opportunity? Are we talking bps? Are we talking in 50 to 100 bps or is it a larger step-up in that?\n\nDan Boncel -- Chief Financial Officer\n\nYeah, I think we're pretty safe in saying that we expect greater than in the triple-digit bps worth of sequential gross margin improvement as we continue to increase and build on that utilization and then increase the amount of revenue that's coming from the higher-margin AppOps revenue as well as streaming too.\n\nEric Martinuzzi -- Lake Street Capital -- Analyst\n\nOK. And then last question for me is around the incremental synergies that's terrific to hear $60 million of synergies from the Edgecast acquisition, up from $50 million. What's the source of that incremental synergy?\n\nBob Lyons -- President and Chief Executive Officer\n\nSo it's a combination of a couple of things. A big part of that synergy is actually going straight to the gross margin line. We have a stack of servers sitting in the same building as Edgecast had maybe two rows apart from each other in the data center and we can collapse those. We have a lot more pricing power now in these centers as well.\n\nBefore we could close, there was only so much information we can get our hands on. Once we were able to close, we were able to let the engineers really get under the covers and dig in and look in. And the good news was that we found that our initial estimate was a little bit more conservative. And so we're able to take more to that bottom line.\n\nSo it's largely just taking advantage of the natural redundancy in the system and other opportunities related to that, bandwidth costs and then obviously, colo savings.\n\nEric Martinuzzi -- Lake Street Capital -- Analyst\n\nYeah. Thanks for taking my questions.\n\nBob Lyons -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Jeffrey Van Rhee from Craig Hallum. Your line is open. Please go ahead.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks for taking my questions guys. Congrats. Looks real good.\n\nSo a couple for me. I wanted to follow up on Eric's second on the gross margin side. I think you had outlined a number of things you thought you could grow 10% to 15%, 50% gross margins, 10% to 15% on EBITDA margins and positive free cash flow over \"near term\". When you originally talked about Edgecast, obviously, you've had some lumpiness in terms of the timing of the capex and other items.\n\nBut I guess, simply put, has the tying to 50% gross margin change based on your best estimate right now?\n\nDan Boncel -- Chief Financial Officer\n\nNo, I don't think so. I think there's really a few things that are probably a little different than where we came in. I think one, as you know, we had the the large streaming customer leave right before closing. So that certainly didn't help.\n\nWe came to learn that there was lower utilization on the Edgecast network than we expected. That's not a terrible thing. It is in the short term, but it gives us the capacity we need to really grow the business. So that's an OK conversation.\n\nAnd those are really the two biggest drivers. And then, of course, the capacity that came online that we had to anticipate last year that we needed to buy to make sure that we could support the revenue numbers that we want to hit in the back half of the year. So those are really the three things that came together. All those is very manageable.\n\nWhat we've done is we've basically put our target operating model in place that gets us to that 50-plus percent gross margin. And then we've laid against that, all of the savings that we have planned. We have Alex Partners in helping us do that, and we've got a very tight process around savings and how it ties into these gross margins, and we track it on a weekly basis in a war room kind of PMO call. So we're pretty confident we can get there.\n\nA little bit of a different starting point for those reasons that I mentioned, but we'll get to the same outcome.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nYup. Got it. And then you mentioned a pipeline number up, I think, if I caught it up 50%. Just to be clear, was that ex-Edgecast? And then on that same topic, overall bookings, did they meet your expectations and any variance within what you booked?\n\nDan Boncel -- Chief Financial Officer\n\nYes. So the pipeline 50%, when you actually unpack that it's all line-like pipeline. So that doesn't include anything with Edgecast. And the AppOps pipeline is actually up triple digits.\n\nSo it's heavily concentrated toward the AppOps side of things, which we want for the reasons that we all know. So that's good. And then bookings, yes, I think we slightly beat our bookings against plan in the quarter and then ramping up to do the same thing in this quarter. So our bookings are tracking where we expected to track and nothing other than watching sales cycle times, which hasn't impacted us yet, but it's a natural thing to watch, as pointed out earlier, we really don't see any headwinds there.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nOK, great. I'll leave it there. Thanks for taking my questions.\n\nBob Lyons -- President and Chief Executive Officer\n\nNo problem. Thanks.\n\nOperator\n\nOur next question comes from Rudy Kessinger from D.A. Davidson. Your line is open. Please go ahead.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nYes, thanks for taking my questions. Also on gross margins, I'm curious for 2023 within that preliminary outlook that you gave, is there kind of a gross margin on the cash gross margin range we can expect that's baked in there for 2023 that you can share?\n\nDan Boncel -- Chief Financial Officer\n\nOn 2023, we're not ready to go into that level of detail. We do believe that we'll leave the year in excess of 50% margins. It will be a gradual step-up in order to get there. And so you can take that as sort of how that rolls out.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nGot it. And then I think you said 45% of the business now being more recurring. Just can you update us on what the kind of seasonality will be from here as we think about kind of the Q4 to Q1 and the Q1 to Q2 and etc. And then secondly, Edgecast, do you have the revenue number that they did in the first half of 2022? And how much came from that streaming customer that left the other month as well?\n\nBob Lyons -- President and Chief Executive Officer\n\nYeah. I'll take the first one, Rudy, and then Dan, I'll let you take the second one. So the first one on seasonality. As you know, our business historically has been kind of prone to seasonality given the limited nature of our focused strategic focus.\n\nThere are really two factors that are going to help us offset that. One is, obviously, the recurring revenue AppOps business, 50%. That makes a big impact. But in addition to that, when you look at the traditional streaming revenue that Edgecast had, it's largely focused on live events.\n\nLive events have a complementary seasonality and people watch sporting events in the fall, summer and spring. And our peak time was largely in the winter time. So those two factors will help us smooth out seasonality. I don't think we're ready yet to say how much, but we do anticipate that we'll see a more smooth revenue profile going forward for those two reasons.\n\nDan Boncel -- Chief Financial Officer\n\nYes. And as far as the streaming customer goes, we closed that they were about $25 million, $26 million last year. We had them in the plan through our diligence procedures at a little bit over $30 million. And so it was ramping from the end of last year into this year.\n\nAnd so it was probably less than less than $1 million in the first half and greater in the second half.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nGot it. That's helpful. Thank you, guys.\n\nOperator\n\nThis concludes our Q&A.\n\nBob Lyons -- President and Chief Executive Officer\n\nSorry, I was just going to say one other point we talked about in previous calls that our objective is to get to sequential quarter-over-quarter consistent growth. And so far we've been able to do that. And that's kind of what we're trying to go toward. So seasonality doesn't even become a factor in the conversation too much.\n\nOperator\n\nThis concludes our I'll now hand back to Bob Lyons, CEO, for final remarks.\n\nBob Lyons -- President and Chief Executive Officer\n\nOK. Great. Thank you, Elliott. Thank you, everyone, for joining us today.\n\nWe look forward to sharing our progress and continuing our conversations with analysts and investors and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSameet Sinha -- Vice President of Investor Relations and Corporate Development\n\nBob Lyons -- President and Chief Executive Officer\n\nDan Boncel -- Chief Financial Officer\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nFrank Louthan -- Raymond James -- Analyst\n\nEric Martinuzzi -- Lake Street Capital -- Analyst\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nAll earnings call transcripts"
}