{
  "companyName": "Smart Share Global Limited",
  "companyTicker": "EM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/smart-share-global-limited-em-q2-2022-earnings-cal/",
  "content": "Smart Share Global Limited (EM -0.79%)\nQ2 2022 Earnings Call\nSep 08, 2022, 8:00 a.m. ET\n\nOperator\n\nThank you for standing by and welcome to the Energy Monster second-quarter 2022 earnings conference call. [Operator instructions] I would now like to hand the conference over to Mars Cai, chairman and CEO. Please go ahead.  \n\nHansen Shi -- Director, Investor Relations\n\nThank you. Welcome to our 2022 second quarter earnings conference call. Joining me on the call today are Mars Cai, Energy Monster's chairman and chief executive officer; and Maria Xin, chief financial officer. For today's agenda, management will discuss business updates, operation highlights, and financial performance for the second quarter of 2022.\n\nBefore we continue, I refer you to our safe harbor statement in the earnings press release, which applies to this call, as we will make forward-looking statements. Also, this call includes discussion of certain non-GAAP financial measures. Please refer to our earnings release which contains a reconciliation of non-GAAP measures to the most directly comparable GAAP measures. Finally, please note that unless otherwise stated, all figures mentioned during this call are in RMB.\n\nI would now like to turn the call over to our chairman and chief executive officer, Mars Cai, for the business and operational highlights. \n\nMars Cai -- Chairman and Chief Executive Officer\n\nThank you, Hansen. Good day, everyone. Welcome to our 2022 second-quarter earnings call. The second quarter of 2022 continued to be a challenging quarter for Energy Monster due to a number of larger-scale COVID outbreaks, notably in Shanghai, Beijing, Shenzhen, and Changchun.\n\nHowever, the impact of these outbreaks, along with the lockdown measures implemented, were better than expected as we were able to achieve revenues above our guidance. During the second quarter, we continued to expand our service to more locations across China. Total number of POIs has increased to 895,000 locations, an increase of 4% quarter on quarter and 16% year over year. The total number of counties and county-level regions with Energy Monster's service has now reached 1,800 for the first time as we continue to strive to increase our coverage to reach more users that need our service.\n\nThe increased accessibility of our service has allowed us to attract 11.6 million newly registered users during the second quarter. That has put us at a new milestone as cumulative registered users reached over 300 million for the first time. Even though COVID outbreaks continue to weigh us down financially, we continue to place ourselves for long-term success operationally through increased service coverage, both in terms of POI count and regions covered and in terms of user coverage. Now as for the impact of COVID on our operations during the second quarter, let me share a bit more details on the impact.\n\nWhenever a region has active discovery of new COVID cases, a few things happen. A stricter COVID testing procedure is implemented at the regional level. This generally means that regional population has to take recent COVID test results before entering commercial or public locations. With larger outbreaks, a number of commercial locations, where our cabinets are typically placed, are required to be temporarily shut down.\n\nAnd in the cases where there is an even larger-scale spread of COVID, more restrictive lockdowns for the general population of the region are implemented, such as the one in Shenzhen during March and Shanghai during April and May. All of these counter measurements directly impacts the amount of people in active circulation within a certain region, meaning that less foot traffic passes our cabinets each day. This ultimately reduces the revenue efficiency of our cabinets and power banks. In April, larger outbreaks in Shanghai, Changchun, Guangzhou, and Chengdu resulted in 95%, 96%, 36%, and 30% year-over-year declines in GMV, respectively. In May, outbreaks in Shanghai, Beijing, and Tianjin resulted in 96%, 76%, and 51% year-over-year decline, respectively.\n\nAnd also in June, outbreaks in Beijing and Shanghai resulted in 54% and 68% declines, respectively. The second quarter was riddled with these regional outbreaks, impacting both the region's internal foot traffic and resulting in a general decline in foot traffic in nearby regions. Overall, in April and May, our GMV declined by 34% and 27%, respectively, as a result of COVID outbreaks. We also continue to observe that the impact of COVID outbreaks is completely correlated with the amount of active COVID cases in a given region. In regions where COVID cases are contained in April, recovery trends in May and June are clear. For example, Guangzhou GMV increased by 26% month over month in May and 14% in June.\n\nHangzhou's GMV increased by 36% month over month in May and 13% in June. Similarly, Suzhou's GMV increased by 143% month over month in May and 93% in June. We see similar recovery trends across all regions where outbreaks are fully contained, meaning that COVID-related impacts are short term in nature. That is why we remain focused on longer-term strategies of extending our coverage network and increasing our efficiency.\n\nWe believe the increased coverage through the combination of our direct and network partner models will help us further extend the Energy Monster network effect, which makes it easier for us to acquire users, location partners, and network partners. The increased efficiency through the declining usage of fixed incentive fees and the reduction in hardware capex per cabinet will reduce the impact of COVID on our operations and serve as the basis of reaching higher levels of efficiencies in the future. We believe Energy Monster's strategic initiatives and longer-horizon approach to strategy development are crucial in depreciating ourselves from market peers in the future and will allow us to be best-positioned to capture market opportunities within the industry. Now let me go through our core strategies in terms of expanding our coverage and increasing our efficiency in greater detail. First is our coverage expansion strategy, which continues to be fueled by both our direct and network partner models. During the second quarter, we continued to extract the synergy between the 2 models by allowing our direct model business development personnel to leverage their own network to identify and acquire new network partners. This new program initially launched in April but has quickly gained traction among our business development personnel.\n\nDuring the quarter, 40% of our BD participated in the program and acquired at least one new network partner. By leveraging the scale and existing capabilities of our direct model, we have drastically accelerated the pace of our network partner acquisition. And approximately 1,800 new network partners were acquired during this quarter, of which more than 70% was sourced through our direct models' personnel. The increased network partner has helped us grow our presence across the board by further penetrating existing regions and especially moving into newer regions.\n\nWith the significant increase in our network partner count, the next natural thing to focus is helping these network partners grow alongside Energy Monster. Newer network partners, a lot of the times, are new to the market. So providing guidance is the most important aspect. We focus on in early periods so that they can quickly achieve scale. We offer guidance primarily by sharing our know-hows of the industry, as well as providing one-on-one consultation on their current progress.\n\nWe also provide a complete set of backend system so that they can clearly see the key metrics of their own team, POIs, and cabinets. It is due to these various avenues of providing operational and strategic support that our network partners are able to grow alongside our company and maintain higher levels of efficiencies compared to those who work with our peers in the industry. We believe that our ingrained values of helping our network partner maintain sustainable returns is the key differentiator, defining Energy Monster's network partner model and also the reason why we maintain the highest market share in China's mobile device charging service industry and the network partner model. We continue to explore ways to synergize and to promote collaboration between our two models. The earlier opened up all direct model regions to network partners in order to further extend our leading market share in existing regions.\n\nWe now launched a program to allow our direct model personnel to also help increase our network partner acquisition. This unique balance and collaboration between the two models have paved the way for market share acquisition as we expand the coverage in all regions. We also have the largest direct model workforce within the industry, allowing us to continue moving into KAs and larger-sized POIs. Once the impact of COVID diminishes, we are uniquely positioned to quickly acquire market share as direct model typically acquires POIs at a faster pace than network partners due to its higher level of execution capabilities. Overall, we believe that increasing POI coverage remains our No.\n\n1 priority. The increased POI count allows more customers to use our service which ultimately converts into more registered users. This self-reinforcing cycle allow us to continuously scale our operation and to reach higher levels of benefit from the network effect. That's why we continue to rapidly increase our network partner count and maintain our direct model personnel so that we can continuously expand our POI coverage even during times of COVID impact. Next is our strategies on improving Energy Monster's efficiencies, both on the front and backend sides. While the expansion of our coverage is crucial to our long-term development, improvements to our efficiency is also important, especially during periods with external events like COVID outbreaks.\n\nThe outbreak of COVID has resulted not only in decline of foot traffic to a number of POIs but it has also resulted in the permanent closure for some of these locations. That is why we continue to reduce the amount of upfront payments we make to location partners in order to reduce our exposure to the decline in foot traffic and increased risk of POI closure during the outbreak. During the second quarter, we continue to significantly reduce the number of new POI signings using upfront or fixed fees. Ninety-five percent of all new POI signings only use variable incentive fees. This is up from 54% during the same period last time as we continue to scale down fixed type of incentive fees in new signings.\n\nThe declining usage of the fixed fees will benefit us during the COVID when revenues slow down due to declined foot traffic, significantly dragged down our bottom line. The increasing contribution from network partner model also increases our efficiency, especially during COVID. Under the network partner model, the company takes a fixed share of the revenue generated by the cabinets of our network partners. This reduces us exposure to fixed expenses, closure rate of POIs, and the general effect of COVID. We are also making significant improvements to efficiency of our direct model business personnel.\n\nIn the second quarter of 2022, our BD, the coverage of them, of POI per person, has increased 43% year over year, making a significant increase in terms of efficiency of people as we continue introducing new back-end system features that enhance our personnel's ability to manage more POIs and optimizing the workflow of our business development personnel's cost. The introduction of our new program with direct model business, BD, are also able to acquire network partners, pave the way for unlocking the high level of efficiency. This business development personnel can now contribute both through the direct model and help accelerate our network partner acquisition progress, which increased their overall contribution to the company per person. We believe this innovative program will take Energy Monster's already market-leading operational efficiency to a new level. In terms of technology, we continue to innovate our software and hardware technologies to increase our competitiveness in terms of operating efficiency and asset efficiency.\n\nOur software is closely tailored to our operating workflow and the needs of our employees, location partners, and network partners. We design our software in order to increase the levels of automation for each workflow segment in order to help them increase their efficiency. That is why we recently launched a new system for our network partner that helps them more systematically manage their relationships with location partners. This system is gaining wide levels of adoption among our network partners and has proven itself in helping network partners better manage their operation.\n\nAside from software, we also continue to make progress optimizing our hardware and the maintenance process of this equipment. The capex per power bank -- cabinet will continue to go down going to the second half of 2022 as we scale up the production of our new cabinets, which will have a significant reduction in terms of cost. We are also improving the maintenance process of our cabinets and power banks so that we can maximize the lifetime value of each equipment. These improvements to hardware will continue helping us, driving up the asset efficiency when going forward.\n\nOverall, the continuous outbreaks of COVID have a significant impact on our operations during the second quarter, and both newer outbreaks and existing outbreaks carrying over from the second quarter continue to be headwinds in the third one. Although the recovery trend is clear-cut, smaller outbreak within the region can still weigh down the recovery speed. New outbreaks, such as the one in Sanya, resulted a year-over-year decline of 31% in July and 71% -- 75% in August. Similarly, following a spike in new COVID cases since late August in Chengdu, a lockdown has been imposed. GMV from Chengdu declined by 83% on week-over-week base.\n\nWhile the impact of COVID continues to drive down both our revenue and profitability, the size and the frequency of these outbreaks are slowing down in third quarter when compared to the second one. In conclusion, I would like to emphasize that although COVID has been challenging in terms of its direct impact on our operation, but we continue to see that its impact is not a systematic change in user behavior as regions coming out of COVID impact are able to scale back to normalized level within two months as the outbreak is fully contained. In the meantime, we will continue to strengthen the foundation of our competitive advantages by focusing on our strategies and coverage expansion and efficiency optimization. Both our direct and the network partner model continue to serve as the pillars of our coverage expansion, but new ways of synergizing the two models has been proven to be a new driver for coverage expansion.\n\nOur efficiency is expected to improve as we scale back all forms of prepaid and fixed incentive fees, increase the contribution of the network partner model, and optimize the asset efficiency of our equipment. Our focus on these strategies will serve as the foundation of our market share growth and market-leading operational efficiency in the future, and especially once the impact of COVID impact is reduced. Again, we remain confident that Energy Monster continues to be best positioned to capture the growth of China's mobile device charging service industry and to deliver long-term value for all of our stakeholders. Thank you.\n\nI'll now turn the call over to Maria Xin, our CFO, for the financial highlights.\n\nMaria Xin -- Chief Financial Officer\n\nThank you, Mars. Now let me walk you through the financial results in greater detail. For the second quarter of 2022, revenues were RMB 690.5 million, representing a 25% year-over-year decrease. Revenues from mobile device charging business was down 27.8% to RMB 672.6 million and accounted for 97.4% of our total revenues for the quarter.\n\nThe decrease was primarily attributable to the impact of COVID-19 during the second quarter of 2022, which resulted in a significant decline in general offline foot traffic in China due to COVID-19 restrictions. Revenues from power bank sales was down 57.7% year over year to RMB 13.3 million and accounted for 1.9% of our total revenues for the quarter. The decrease was primarily attributable to the impact of COVID-19 during the second quarter of 2022, which resulted in a significant decline in general offline foot traffic in China due to COVID-19 restrictions. Other revenues were down 50.8% year over year to RMB 4.5 million and accounted for 0.7% of our total revenues. The decrease was primarily attributable to the decrease in user traffic as a result of the impact of COVID-19 during the second quarter of 2022.\n\nCost of revenues were up 17.4% year over year to RMB 162.9 million for the second quarter of 2022. The increase of cost of revenues was primarily due to the recognition of impairment for inventory and equipment and the increase in maintenance costs, which was partially offset by the decrease in cost of products sold. Gross profit was down 36.7% year over year to RMB 527.7 million for the second quarter of 2022. The decrease was primarily due to the decrease in revenues from mobile device charging business.\n\nOperating expenses for the second quarter of 2022 was RMB 718.7 million, down 11.8% year over year. Excluding share-based compensation, non-GAAP operating expenses was RMB 711.7 million, representing a year-over-year decrease of 11.7%. Research and development expenses for the second quarter of 2022 were RMB 23.7 million, up 15.8% year over year. The increase was primarily due to the increase in personnel-related expenses. Sales and marketing expenses for the second quarter of 2022 were RMB 664.9 million, down 13.8% year over year.\n\nThe decrease was primarily due to the decrease in entry fees and the incentive fees paid to the location partners and the personnel-related expenses, which was partially offset by the increase in incentive fees paid to the network partners. General and administrative expenses were RMB 28.5 million in the second quarter of 2022, down 0.8% year over year. The decrease was primarily due to the decrease in personnel-related expenses and the office rental expenses, which was partially offset by the increase in professional service fees. Loss from operation was RMB 191 million, and the operating margin for the second quarter of 2022 was negative 27.7%, compared to 1.9% in the same period last year. Net loss was RMB 184.5 million in the second quarter of 2022.\n\nNet margin for the second quarter of 2022 was negative 26.7%. Non-GAAP net loss, which excludes share-based compensation expenses, was RMB 177.5 million in the second quarter of 2022, compared to a non-GAAP net income of RMB 17.2 million in the same period last year. As of June 30, 2022, the company had cash and cash equivalents, restricted cash, and short-term investment of RMB 2.9 billion. Cash flow generated from operations for the second quarter of 2022 was RMB 136.1 million. Capital expenditure for the second quarter of this year were RMB 85.5 million.\n\nEnergy Monster generally expects to generate RMB 770 million to RMB 800 million of revenues for the third quarter of 2022. Please note that the forecast reflects Energy Monster's strength and the preliminary view on the industry and its operations, which is subject to change. Thank you for listening. We are now ready for your -- we are ready for your questions.\n\nOperator?  \n\nOperator\n\n[Operator instructions] The first question comes from Lin from GS. Please go ahead.\n\nUnknown speaker\n\nThank you, management, for taking my question. Can management give a bit more insight for the reason behind the increase in cost of revenues? And it will also be great if you can give a bit more color on the third quarter's revenue guidance, and possibly, any guidance on the bottom line? Thanks.\n\nMaria Xin -- Chief Financial Officer\n\nThanks. I will take your question. The reason for the increase in cost of revenues was primarily due to a few things. First is the impact of COVID on POIs.\n\nThis has resulted a lot of closures of business where our cabinets are placed. And because of the disclosure, in some cases, our equipment become -- cannot be returned to us. This has resulted in recognition of impairments for inventory and the equipment during the quarter. There was also some actual maintenance costs this quarter because we wanted to optimize some of our -- some of the older equipment to give our users a better experience and maximize the lifetime value for those equipment.\n\nDepreciation as a percentage of revenue also increased because we are now -- have more POIs. But because of the COVID, the revenue per cabinets and power bank is down significantly during the second quarter. Overall, the primary reason for the increase in cost of revenues as a percentage of revenue is still impact of COVID on the revenues. As for the guidance, we continue to see outbreaks during the quarter, although to a lesser degree when compared to the second quarter. We were actually seeing the strong results in August as new large-scale outbreaks were less frequently.\n\nOur GMV was able to grow year-on-year in August. By the new outbreaks, such as the one in Chengdu during the late August and the other outbreaks in early September, will weigh down our recovery for the third quarter. Given that, we can't actually assess the development of these outbreaks. We will now offer any guidance on our profitability.\n\nThank you.\n\nUnknown speaker\n\nThank you, Maria.\n\nOperator\n\nNext question comes from Charlie Chen from China Renaissance. Please go ahead.\n\nCharlie Chen -- China Renaissance -- Analyst\n\nThank you, management, for taking my question. Could management give us more color on the current competitive landscape in this industry? Is competition escalating? Or you also mentioned that the company is acquiring new network partners at record speed, so I just want to understand how the company balances the two models strategically. Thank you. \n\nMars Cai -- Chairman and Chief Executive Officer\n\nSure. Thanks for the question. As for competition, we are seeing a general decline in competition for POIs and especially for larger-sized POI and KAs. Most of our peers in the market have significantly downsized their direct model scale.\n\nAnd thus, we are seeing a lot less competition for new signings across the board. Also, because a number of our peer irrationally prioritize growth without much consideration of quality of growth, Energy Monster's POI quality is market-leading. So when COVID came around while we also experienced the challenges, our peers faces even higher level of the pressure due to the differences in POI quality. As a result, incentive fee rates for new signings during the second quarter continues to trend down due to the lower of -- lower level of competition.\n\nWhile it may take a bit of time for this decreasing competition to translate into financial metrics, given that newer signings are only a portion of the total contracts, we are optimistic on the current trend. For the second question, on the balance of the two models, I think the balance between the two largely depends on maximizing value for our shareholders and stakeholders. We don't have any exact percentage target for GMV contribution between the two models because both models are important to the company. Our network partner model is growing more quickly than our direct model during this quarter because of the new program we introduced, which allows for our direct model, BD people, to also contribute to the acquisition of the new network partners. And because the network partner allows us to better mitigate risks coming from the COVID impact, we believe the network partner model will continue to be a core driver of growth in the near future. But I think in the long run, both models will be equally important to the company.\n\nDirect models' advantage in terms of higher execution speed and ability to sign large KAs and network partners' advantage in coverage of long-tail POIs and regions and risk mitigation shows that each model has its own set of advantages. So that's why we continue to innovate new ways for the models to work together and ultimately help Energy Monster increase its market share. Thank you for the question. \n\nCharlie Chen -- China Renaissance -- Analyst\n\nThank you, Mars. Thank you very much.\n\nOperator\n\nNext question comes from Vicky Wei from Citi. Please go ahead.\n\nVicky Wei -- Citi -- Analyst\n\nThanks, management, for taking my question. I just want to get your perspective on the COVID, given that these outbreaks are happening on and off for some time now. How will the company coexist the pandemic if it continues for next year? Thank you.\n\nMars Cai -- Chairman and Chief Executive Officer\n\nHi. Thanks for the question. Yes, COVID outbreaks are very unpredictable, and there's no way for us to know for sure when, where it will happen and the size of outbreak. While the challenge is there, we are seeing a slight improvement in terms of the size of outbreak when compared to the second quarter.\n\nOn a longer-horizon perspective, we believe COVID impact will eventually diminish as containment measures become even more precise and the danger of the virus diminishes as well. That's why we continue to expand the scope of our service coverage and strengthen Energy Monster's network effect because we remain very optimistic about the eventual-but-permanent containment of COVID. But for the near future, we are prepared to coexist with COVID. We continue to find ways to reduce our exposure from COVID, namely in ways such as reducing upfront or fixed incentive fees, expanding our network partner count, increasing the efficiency of our business development personnel, optimizing our front and backend process, and enhancing both software and hardware technologies. These are just some of the things that we focus on in order to increase our efficiency during COVID. I think when we are able to fully implement these initiatives, we can then really mitigate most COVID-related risks and really be able to coexist with COVID.\n\nBut again, I think COVID will not be a long-term challenge, but the company is taking all measures necessary in order to reduce the short-term impact. Thank you. \n\nVicky Wei -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThere are no further questions at this time. I'll now hand it back to Maria Xin for closing remarks. \n\nMaria Xin -- Chief Financial Officer\n\nOnce again, thank you for joining us today. Please don't hesitate to contact us if you have any further questions. Thank you for your continued support and we look forward to speaking with you in the coming quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHansen Shi -- Director, Investor Relations\n\nMars Cai -- Chairman and Chief Executive Officer\n\nMaria Xin -- Chief Financial Officer\n\nUnknown speaker\n\nCharlie Chen -- China Renaissance -- Analyst\n\nVicky Wei -- Citi -- Analyst\n\nMore EM analysis\n\nAll earnings call transcripts"
}