{
  "companyName": "Warby Parker Inc.",
  "companyTicker": "WRBY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/warby-parker-inc-wrby-q3-2022-earnings-call-transc/",
  "content": "Warby Parker Inc. (WRBY -1.89%)\nQ3 2022 Earnings Call\nNov 10, 2022, 8:00 a.m. ET\n\nOperator\n\nThank you and good morning, everyone. Here with me today are Neil Blumenthal, Dave Gilboa, our co-founders and co-CEOs; alongside Steve Miller, senior vice president and chief financial officer. Before we begin, we have a couple of reminders. Our earnings release and slide presentation are available on our website at investors.warbyparker.com.\n\nDuring this call and in our presentation, we'll be making comments and -- of a forward-looking nature. Actual results may differ materially from those expressed or implied as a result of various risks and uncertainties. For more information about some of these risks, please read the company's SEC filings, including the section titled Risk Factors in the company's latest annual report on Form 10-K. These forward-looking statements are based on information as of November 10th, 2022.\n\nAnd except as required by law, we assume no obligation to publicly update or revise our forward-looking statements. Additionally, we will be discussing certain non-GAAP financial measures. These non-GAAP financial measures are in addition to and not a substitute for measures of financial performance prepared in accordance with U.S. GAAP.\n\nA reconciliation of these items to the most directly comparable U.S. GAAP measures can be found in this morning's press release and our slide deck available on our IR website. And with that, I'll pass over to Neil to kick us off. Neil, please go ahead.\n\nNeil, please go ahead.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nWelcome, and thank you all for joining this morning to discuss Warby Parker's third quarter 2022 results. I'm pleased to share that, in the third quarter, we achieved results moderately above the high end of our guidance range. Despite an increasingly difficult and uncertain macroenvironment, we delivered net revenue of approximately $149 million, an increase of 8.3% over the same period last year and nearly $3 million above the high end of our revised guidance. We believe this is because of our brand, our value proposition, our omnichannel model that continues to resonate with consumers and drive incremental demand even as consumers' wallets remain pressured.\n\nWe ended the quarter with 2.26 million active customers, an increase of 5.1% versus last year as we continue to gain share of the $44 billion vision care market and the nearly 200 million adults in the U.S. using some form of vision correction. Equally important, as we expand our product and service offering, customers are spending more with us than ever. Average revenue per customer increased nearly 7% year over year, reaching a new high of $258 in the third quarter.\n\nFrom a channel perspective, we saw a slight uptick in our retail performance as the third quarter progressed. Store productivity as a percent of our 2019 base level was 82% for Q3, which was ahead of our projection. And we saw incremental monthly gains throughout the quarter exiting September, with productivity at approximately 85% of 2019 levels. Our e-commerce growth moderated versus the first half of the year but is still up 19% on a three-year CAGR basis.\n\nWe view this positively given our intentional pullback in marketing spend, which was down 26% year over year, as well as the softness we've observed in the overall online eyewear market. The combination of a stronger top line, the actions we took to right-size our corporate cost structure to align with a slower growth environment, and reducing our marketing expense percentage to pre-pandemic levels resulted in an improvement in adjusted EBITDA year over year. Our focus has always been on driving profitable growth. We're pleased to have generated $11.9 million in adjusted EBITDA, which is up 6% from last year and ahead of our most recent guidance.\n\nWe are proud to deliver these results even as we face some gross margin headwinds from the fixed portion of our COGS due to long-term investments, namely the expansion of our store fleet and our optometric team. While we are encouraged with our results this quarter, we're maintaining a cautious view of the near term. Industrywide demand softness driven by lingering pandemic effects, inflation, and shifts in how consumers are spending their money and time continue to disrupt the normally steady and predictable shopping behavior in our category. We continue to believe in the resilience of and the long-term growth outlook for the optical industry and expect these headwinds to be temporary.\n\nWe also continue to believe in our more than 3,000 incredible team members who, in the face of volatility, continue to embrace flexibility, they like customers, drive innovation, and create impact. Until demand recovery materializes, we'll remain focused on what is in our control, driving increased operating leverage through diligent expense management and smart investments in future growth. The opportunity for Warby Parker within the $44 billion vision care market remains tremendous, and we're confident that continued focus and execution against our strategies will position us well for sustainable long-term growth. Steve will walk through the specifics of our guidance in a moment, but we are raising our projected full year revenue range to $590 million to $596 million.\n\nWe're also raising the low end of our previous full year adjusted EBITDA range by 3 million and the high end by 1 million. So, we now expect adjusted EBITDA for the year to be between $25 million to $27 million. And with that, I'll turn it over to Dave to walk through the progress we've made against our primary growth drivers this quarter.\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Neil. I'm excited to share the progress we made in Q3 against each of our long-term strategic initiatives. The investments we have made over the last few years to expand our unique omnichannel and holistic eye care offering are resulting in enhanced customer experiences and improved customer economics, which, in turn, have positioned us to continue to take market share and set us up for future scale and profitability. By making our channels more accessible and by expanding our range of products and services, we are able to better serve both new and returning customers.\n\nEvidence of this is best reflected in our average revenue per customer, which, as Neil mentioned, increased to a record high $258 in Q3, up 7% year over year. Importantly, the primary driver of this increase was not due to price increases, but rather due to a higher percentage of customers purchasing multiple products and from customers opting in to higher price point offerings like progressives and annual supplies of contacts. We continue to believe that our unique value proposition will hold up well in a challenging economy as consumers are more conscious about where to spend their dollars. Now, we'll talk through each of our four primary growth strategies, starting with scaling our omnichannel presence.\n\nIn Q3, we opened 13 new stores and remain on track to open 40 stores by year-end. Despite continuing to operate in an environment with lower retail traffic, our stores are generating $2.1 million in revenue, on average, on an annualized basis, with four-wall margins in line with our historical target of 35%. This performance is consistent across our fleet, including the cohort of stores open in 2021. These stores, on average, remain on track to pay back within our target of 20 months.\n\nWe also continue to enhance our e-commerce experience. Just last week, we launched our award-winning virtual try-on tool within our browser shopping experiences, making it easier than ever for customers to see how they look in our various styles. Previously, our virtual try-on was only available in our iOS app and has been a significant driver of engagement and sales. We are excited to now offer this technology to all of our e-commerce shoppers across platforms.\n\nSecond, we continue to expand our core glasses business. In addition to launching our Fall Core 2022 collection, we also introduced two collaborations this quarter, one with menswear brand Noah, founded by former Supreme creative director, Brendon Babenzien; and another with actress Chloe Sevigny. Collaborations like these are great opportunities for us to introduce our brand and product to new customers while delivering something fresh and unexpected to our existing customer base. We also continue to launch innovative new constructions based on customer feedback, like our first-ever performance lifestyle collection launched in July.\n\nMade in Japan, these eyeglasses and sunglasses feature top-of-the-line, performance-minded elements, including extra durable hinges, soft rubber pads for added grip, and ultra-lightweight TR90 nylon. This was also our first collection launch priced at $175. This quarter, we also expanded our prescription range, meaning more glasses wearers can fill their prescriptions with us than ever before. And finally, progressives, which are our highest price point and highest gross margin category, continue to grow as a percentage of total glasses sales.\n\nThird, we're building our contacts business. Contacts continue to scale, growing nearly 50% year over year and increasing from 5% of our business in Q3 2021 to 7% in Q3 2022. As a reminder, contact lenses typically account for 15% to 20% of sales of typical optical retailer. And contacts customers are some of our highest-value customers given the replenishment nature of contacts and the propensity of these customers to go on to purchase glasses.\n\nFourth, we're investing in our eye exam business. This quarter, we added a total of 14 exam rooms to our retail fleet, 12 within new stores and two within existing stores. As of September 30th, 139 of our stores, or 73%, offer exams, and we remain on track to provide the service in more than 150 stores by year-end. To serve our patients in those rooms, we continue to hire and retain incredibly talented optometrists.\n\nYou'll recall that last quarter, we completed our annual goal of converting 40 stores to our PC model. This quarter, we converted an additional seven existing stores and added eight new stores to the PC model, giving us greater control over the customer experience and enabling us to recognize exam revenue. We're also continuing to pilot new and innovative technologies that will allow us to make our telehealth and in-person eye exam experiences more convenient, more affordable, and more differentiated within the market. This includes rolling out services like retinal imaging, which gives our optometrists a closer look at a patient's eye to detect early signs of eye disease.\n\nAt pilot locations, Warby Parker patients can now add retinal imaging onto their eye exams for an additional charge. We hope to roll this service out to more locations in the coming quarters. In addition to innovative services, we're also introducing groundbreaking products like MiSight contacts, which are the first soft contacts on the market proven to slow the progression of myopia in children aged eight to 12 at the initiation of treatment. Myopia is the medical term for nearsightedness, and 50% of the global population is expected to have myopia by 2050.\n\nSlowing the progression of myopia by just one diopter or power level in children reduces the risks of visual impairment and eye complications such as glaucoma by 20%. Doctors must be certified in order to prescribe MiSight contacts, and we're proud to share that more than 90 of our doctors are already certified. We look forward to continuing to add innovative products and services like these to help our customers see. And to help pay for those products and services, we're also making good progress in enabling consumers to use vision insurance benefits to shop with us.\n\nAs a reminder, Warby Parker is currently in network with UnitedHealthcare vision insurance members, as well as through Davis Vision through select employers. We announced earlier this year that we became an in-network option for members of the Blue Cross, Blue Shield Federal Employee Program. And in Q3, we became an in-network option for over 2 million members with CareFirst Blue Cross Blue Shield serving Maryland, the District of Columbia, and Northern Virginia; and Guardian Vision with the Davis Vision network insurance plans. In total, Warby Parker is now in network with over 16 million lives.\n\nIn addition to our growing base of in-network customers, a meaningful portion of our customers use their out-of-network benefits to pay for our glasses, exams, and contacts, often paying $0 out of pocket for their purchases of eyeglasses. We are investing in a number of ways to make it even easier for these customers to use their existing benefits with us. This quarter, we rolled out additional messaging on how vision insurance works at Warby Parker and to help customers understand that often using out-of-network benefits with us is less expensive than shopping elsewhere within the market. According to Vision Council, when using vision insurance, consumers, on average, spend $220 or more out of pocket on a pair of eyeglasses, which is significantly higher than our glasses ASP.\n\nOverall, we are pleased with our continued progress against our long-term strategic growth initiatives, which will enable us to deliver on our mission to provide vision for all. We're thrilled that after years of COVID-related challenges, all of our Buy a Pair, Give a Pair partners have resumed operations globally and are on track to surpass their distribution targets for 2022, enabling us to impact millions of people's lives this year. We continue to navigate the macroeconomic challenges in front of us and believe we will manage through this period of high inflation and a pressured consumer much in the way we managed and emerged from the pandemic, as a stronger company. I'd like to thank our incredible team for their hard work and effort day in and day out.\n\nTheir determination and dedication allow us to consistently persevere through dynamic environments, and we look forward to continued success as we approach the holiday season and year-end. And now, I'll pass it over to Steve.\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nThanks, Neil and Dave. Good morning, everyone. We're pleased to report Q3 results ahead of expectations for both top line and bottom line despite the difficult macroeconomic backdrop in which we continue to operate. We intend to stay laser-focused on expense management and driving incremental profitability while making smart investments to strengthen the customer experience and support the long-term growth of the business.\n\nI'd like to walk you through our Q3 2022 results, starting with revenue. Revenue for the quarter came in at 148.8 million, up 8.3% year over year and above our guidance range of 143 million to 146 million. On a three-year CAGR basis versus the third quarter of 2019, revenue increased 16.2%. At a high level, we saw store productivity come in at 82% when compared to the same period in 2019, moderately above the high end of 80% we were projecting, which we shared on our last earnings call.\n\nThis was partially offset by our e-commerce three-year CAGR coming in at 19%, which was moderately lower than the high-case projection of 21% we provided on our Q2 call. We finished the quarter with 2.26 million active customers, an increase of 5% versus the same period a year ago. And our average revenue per customer increased 7% year over year to $258. This continued scaling in average revenue per customer reflects our ability to provide more value to our customers as we continue to expand our product and service set.\n\nAs a reminder, both active customers and average revenue per customer are measured on a trailing 12-month basis. Our growth in top line and average revenue per customer for the quarter was driven by a number of factors, including an increase in orders from our active customer base, as well as an increase in average order value, driven primarily by selling a higher mix of glasses with progressive lenses, which have our highest average selling price. Our progressive lens product represented 21% of total prescription glasses sold in Q3 2022, up from 20% when compared to the third quarter of 2021. This is still well below the market average of 45%, leaving a substantial runway for further AOV and gross margin leverage that we expect to realize from scaling our progressive business.\n\nLooking at our business by channel, store productivity, as mentioned, came in at 82% of 2019 levels in the third quarter. This was above the trend we observed in August when we provided updated guidance for Q3 and the full year. At that time, we had observed consistent retail productivity of approximately 80% of 2019 store levels. We're pleased with the incremental improvement in retail productivity we experienced during the second half of the third quarter and are encouraged that we exited September with productivity at approximately 85% of 2019 levels.\n\nAs discussed, business performance this year has been affected by a range of factors, including a pullback in consumer spend on durable goods and a meaningful reduction in marketing spend as we focus on profitability. Despite these factors, the unit economics of our stores remain strong. As of Q3 2022, we had 150 stores open for 12 months or more. As Dave mentioned, these stores generated, on average, 2.1 million in annualized revenue and generated four-wall margins in line with our target of 35%.\n\nWe've achieved these results by driving increased conversion rates and AOV in store and through managing team schedules to match lower top line to drive profitability. The strong performance is consistent across our store fleet. We continue to see a healthy three-year trend for our e-commerce business. Our e-commerce three-year CAGR in Q3 was 19.2%, moderately lower than the 21% we shared as the high end of our guidance on our Q2 earnings call, which was the growth we had been observing as we exited Q2 and started Q3.\n\nWe maintained a consistent e-commerce growth profile despite dropping marketing spend by 26% year over year from 20 million to 15 million and from 14% of revenue in Q3 last year to 10% of revenue in Q3 this year. On a year-over-year basis, we saw e-commerce down 6% year over year in Q3 2022 versus Q3 of last year. From a business mix perspective, for the third quarter, e-commerce represented 37% of our overall business, in line with pre-pandemic levels. This compares to 42% in Q3 2021 and 34% in Q3 2019.\n\nMoving on to gross margin. As we have done on each call, before we dive into details on gross margin performance, I would like to remind everyone that our gross margin is fully loaded and accounts for a range of costs, including frames, lenses, optical labs, customer shipping, optometrist salaries, store rent, and the depreciation of store build-outs. Our gross margin also includes stock-based compensation expense for our optometrists and optical lab employees. As a reminder, and as we talked about on our last call, approximately 60% of our COGS are variable, while 40% or more are fixed in nature.\n\nIn general, we've been pleased with the stability we have seen in the input costs of our products as we have thoughtfully managed expenses throughout our supply chain, including frames, lenses, and shipping costs. For comparability, I will be speaking to gross margin, excluding stock-based compensation. Adjusted gross margin in Q3 2022 came in at 56.9%, compared to 58.7% in Q3 2021. The primary driver of the decrease in gross margin was the continued growth in contact lenses from 5% in Q3 2021 to 7% in Q3 2022 as a percentage of our total business.\n\nExpanding our contacts offering is a core part of scaling our holistic vision care offering and a key driver of increasing average revenue per customer. While contact lenses have a lower gross margin percent versus our other product offerings, they are accretive to gross margin dollars given their higher purchase frequency and subscription-like purchase cycle. As a reminder, contact lenses represent a $5.5 billion market, and contact lenses account for anywhere from 15% to 20% of a typical optical retailer's sales. Next, we saw a year-over-year deleverage in gross margin in two areas, which represent the more fixed portion of our cost of goods.\n\nThese fixed elements of our COGS stack are retail occupancy and optometrist salaries, which generally remain the same regardless of revenue. We added 36 net new stores over the course of the last 12 months, going from 154 stores as of September 30th, 2021 to 190 stores as of September 30th, 2022, or an increase in our store base of 23% year over year, which naturally leads to an increase in store rent and depreciation from store build-outs. This 23% increase in store count compares to total company revenue growth of 8% and retail revenue growth of 19% over the same period. We also saw downward pressure on gross margin year over year from an increase in overall optometry salaries as we hired optometrists for our new stores and significantly expanded the rollout of our professional corporation or PC model.\n\nAs of the end of Q3 2022, we operated with 107 stores, where we engaged directly with an optometrist and, therefore, recognized both revenue from exams and optometrist salaries. These are 107 stores, compared to 41 stores at the end of Q3 2021. The majority of our 57 PC model stores are ones where we are converting an existing store with an independent doctor relationship to the PC model. And therefore, we had already been recognizing a significant portion of product conversion sales at our stores from the independent doctor.\n\nAs we convert these stores to the PC model, we expect a near-term margin headwind given the gross margins on the exam service alone are lower than our glasses and contacts gross margin. We expect that our investment in eye exam capabilities in store will benefit us in the long term as it gives us greater control over the customer experience, enables us to recognize exam revenue, and results in higher conversion rates from eye exam to product purchase. Two main factors continue to drive gross margin leverage. Firstly, we continue to scale our progressive business, which is our highest-priced and highest gross margin offering.\n\nAt approximately 21% of our prescription business, which is up from 20% a year ago, progressives account for less than half the industry average of 45%. Secondly, we continue to scale the portion of prescription glasses orders that we insource at our two owned optical labs in New York and Nevada. As discussed, there are many benefits we see from insourced orders at our labs, including higher NPS, lower refund rates, faster turnaround time, and improved gross margin. We've previously indicated that our optical labs account for 50%-plus of our prescription orders.\n\nWe saw an increase by over 10 percentage points of optical lab jobs insourced at our two optical labs in Q3 of this year versus Q3 of last year. Next, I would like to talk about SG&A expenses. Adjusted SG&A for Q3 2022 came in at 82.2 million or 55.2% of revenue. This compares to Q3 2021 adjusted SG&A of 75 million, or 54.6% of revenue, an increase of approximately 60 basis points of revenue year over year.\n\nIn terms of year-over-year dollar growth, adjusted SG&A was up 9.6% year over year compared to Q3 2021. As a reminder, SG&A for our business includes three main components: salary expense covering our headquarters, customer experience, and retail employees; marketing spend, including our home try-on program; and general corporate overhead expenses. Adjusted SG&A excludes noncash costs like stock-based compensation expense and also excludes one-time costs like those associated with our direct listing. The primary driver of the increase in adjusted SG&A as a percentage of revenue year over year was related to an increase in corporate overhead expenses.\n\nThis increase was largely concentrated in two main areas: public company costs and investments in our technology infrastructure. On public company costs, we noted in Q2, these represented approximately $2.5 million in the quarter. In Q3, we incurred approximately the same level of costs related to operating as a public company, which we did not incur a year ago. We expect to start leveraging public company costs in the fourth quarter as we begin comparing to a period in the prior year when we were a public company.\n\nWe also continued to invest in a number of key technology initiatives to enhance customer-facing platforms like our internally built point-of-sale solution for our stores and virtual try-on technology for our app and website. Salary expense within our SG&A category includes wages and benefits for our headquarters, customer experience, and retail employees. As a reminder, salary expense for eye doctors and optical lab employees are all included in our cost of sales. We continue to optimize retail salary expense as a percent of revenue as we schedule time for our retail and customer service teams and anticipate further consistency in these expenses to the remainder of this year.\n\nWith respect to our nonretail salary expense, as we announced in August, we took the difficult but necessary step to align our cost structure with the current environment and reduced our full-time corporate team by 63 people, or approximately 15%. This action, along with reductions in certain G&A spend also realized in Q3, are on track to generate 8 million to 9 million in savings this year and 15 million to 18 million in savings next year. As previously outlined, we made and expect to continue to make changes to marketing spend levels to optimize for the current demand environment. Marketing spend for the quarter came in at 15 million or 10% of revenue.\n\nThis was down sequentially from 21 million and 14% of revenue in Q2 of this year and also down from 20 million and 14.5% of revenue when compared to Q3 of last year. Marketing spend in Q3 was 26% lower year over year, which compares to revenue growth of 8.3% year over year over the same period. Since Q1, we've reduced marketing spend by nearly 10 points and expected to remain in the low double digits going forward. For the third quarter of 2022, we generated adjusted EBITDA of 11.9 million, representing an adjusted EBITDA margin of 8%, which compares to adjusted EBITDA of 11.2 million or 8.1% of revenue in the year-ago period.\n\nThis also compares to the 4% adjusted EBITDA margin on a sequential basis versus Q2 of this year. The actions we took to adjust our marketing expense and corporate cost structure, combined with higher-than-expected revenue this quarter, drove our adjusted EBITDA margin 150 basis points above the high end of our guidance range. We finished the quarter with a strong balance sheet, reflecting 198 million in cash and cash equivalents, which we'll continue to deploy deliberately to support our growth and operations. We also increased our credit facility with Comerica Bank from $50 million to $100 million with an ability to further upsize the facility to 175 million.\n\nWe have no plans as of now to draw down on this facility but are pleased to add increased options for liquidity to our capital structure. Before sharing guidance for Q4 and the full year, we wanted to provide a reminder on the seasonality our business has historically observed in Q4. As it relates to top line, we observe moderately higher seasonal demand during the month of December due to the holiday buying and customer usage of help and flexible spending benefits. This demand is most concentrated in the final week of the year.\n\nGiven we recognize revenue from delivery of product to the customer, we recognize revenue in Q1 for a significant portion of orders placed in the final week of the year. And we typically see a meaningful step up in sequential revenue growth from Q4 of the current year to Q1 of the following year as you can see from our earnings slides. From a bottom-line perspective, Q4 is generally our lowest margin quarter as we make several investments to support the important holiday selling season. These investments include marketing to support and generate customer demand, investments in shipping as we expedite orders to meet holiday timing, increased store staffing to accommodate higher traffic and extended store hours, and increased customer experience staffing to support higher demand, as well as elevated call volume related to flexible spending benefit questions.\n\nWe expect the pattern of adjusted EBITDA to look different this year than past years, and I'll explain further in just a moment, with Q1 2022, our lowest EBITDA quarter due to the impact of omicron. Based on our third quarter performance and current view of the fourth quarter, we are moderately raising our full year outlook. We're increasing our 2022 revenue outlook to a range of 590 million to 596 million from a range of 585 million to 595 million. This represents full year revenue growth of 9.1% to 10.2% over 2021, up from our prior guidance of up 8% to 10%.\n\nFor adjusted EBITDA, we are raising the low end of our prior range and moderately increasing the high end of our range and now expect adjusted EBITDA between 25 million to 27 million, compared with prior guidance of 22 million to 26 million. Adjusted EBITDA margins for the year are now projected to be 4.2% to 4.5%, compared with prior guidance of 3.8% to 4.4%. Lastly, as we mentioned in our last call, we expect gross margin of approximately 57% for the full year. We have seen continued faster-than-anticipated growth in our contact lens business, which we view as a positive.\n\nAs contact lenses have lower margins, this will continue to have a delevering effect on gross margin. Roughly 40% of our COGS are fixed in nature, the majority of which are made up of store rent, store depreciation, and eye doctor salaries. We expect that these investments in our store fleet and optometry will continue to have a delevering effect on gross margins in the short to medium term as eye exam offerings ramp and as store and e-commerce growth returns to higher levels. We plan to see continued gross margin leverage from scaling high-margin products like progressives and through serving customers from our own optical labs.\n\nFor Q4 of 2022, this full year guidance implies revenue of 138.2 million to 144.5 million, an increase of 49% year over year, and adjusted EBITDA of 6.2 million to 8.4 million, and adjusted EBITDA margin of 4.5% to 5.8%. While we are encouraged with the improved trend in store productivity in September and the fourth quarter to date, we believe it is prudent to maintain a cautious view heading into the holiday season given the importance of December to our fourth quarter and the various macroeconomic factors affecting consumer spending. For Q4 top line, we're projecting store productivity to run at the mid-80% level versus 2019 and are projecting our three-year e-commerce CAGR in the high teens, both consistent with recent trends. We want to reiterate that the quarterly pattern of adjusted EBITDA this year will look different from previous years.\n\nHistorically, we have seen adjusted EBITDA strong in Q1, with positivity continuing in Q2 and Q3 and then a decline as we ramp spend for Q4 and the first sales we generate from Q4 into the following year. This year, we expect that Q3 will be our strongest quarter of adjusted EBITDA, followed by Q4 as we remain focused on maintaining cost discipline and driving incremental profitability. For adjusted EBITDA, as a reminder, in H1 of this year, we generated adjusted EBITDA of 6.7 million and adjusted EBITDA margin of 2.2%. In Q3, we were pleased to see a step up in adjusted EBITDA margin to 8% of revenue.\n\nAt the high end of our updated range for adjusted EBITDA in Q4, we're projecting adjusted EBITDA of 8.4 million, or 5.8% of revenue, which translates to H2 adjusted EBITDA of 20.3 million or 6.9% of revenue. This implies a 470-basis-point improvement in adjusted EBITDA from H1 to H2 on revenue that is roughly 10 million lower than H1. Finally, and as a reminder, with respect to our outlook for 2022, we are forecasting stock-based compensation as a percentage of net revenue to be in the mid-teens, compared with 20% in 2021. Stock-based compensation for both years is above our long-term forecast of low single digits starting in 2024 as the result of RSU expense associated with our direct listing and multiyear equity grants to our co-CEOs in 2021, the majority of which is performance-based and best based on stock price targets from 47.75 to 103.46.\n\nWe'll provide formal guidance for 2023 and on our Q4 call in March of next year. The economy continues to be both dynamic and unpredictable, and we'll continue to update our perspective on scenarios for next year as trends affecting the economy, the consumer, and the optical industry continue to evolve. As it relates to adjusted EBITDA, in particular, we remain focused on realizing incremental profitability of at least 100 basis points to 200 basis points per year. For 2023, the baseline from which we expect to expand adjusted EBITDA margins next year is our H2 2022 EBITDA margin, which we are guiding to be between 6.3% and 6.9% of revenue in H2 of this year.\n\nWe expect that roughly half of this improvement will come from marketing spend normalizing in the low double digits as a percent of revenue and the other half from realizing a full year of corporate overhead savings related to salaries and general operating expenses. We look forward to providing more specific guidance and commentary at our Q4 earnings call in early 2023 as we finish this year and gain incremental visibility into next year. Thank you again for joining today's call. We continue to focus on the things we can control in this challenging macroeconomic environment.\n\nWith our expense base now optimized for current levels of demand, we feel good about our ability to profitably increase our market share and position ourselves to accelerate growth once operating conditions improve. With that, we'll open up the line for Q&A.\n\nOperator\n\nThank you. Our first question today comes from Ed Yruma from Piper Sandler. Ed, your line is open. Please go ahead.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nHi. Good morning. Thanks for taking the questions. I guess, first -- or actually, happy to note that my 10-year-old had her first eye exam and glasses at Warby and great experience.\n\nI guess just thinking about your model --\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nOh, amazing.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nThanks. First, on the PC model, help us understand the leverage points. Obviously, I know you've guided to deleverage in the near term just as you have, obviously, begin to ramp. But as you think about that longer term, I guess, how does that change the economics of the box, both of the higher penetration of contacts and progressive? And then I guess as a follow-up, I know you don't want to provide next year's guidance yet, but how should we think about some of the changes you've effected? You've obviously given a different rhythm for adjusted EBITDA this year.\n\nIs the 4Q to 1Q going to be fairly similar, you know, a kind of progression as we've seen in years past understanding that I know with flex spending, you know, that kind of maybe straddles both quarters? Thank you.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Ed. Maybe we'll start with the last part of your question is that we do anticipate that some of the irregularities that we saw during the pandemic should hopefully be coming to a close and that Q4 and Q1 and the rest of 2023 should revert to typical patterns where we do see accelerated spend and customer behavior at the end of Q4, particularly those last days of December between Christmas and New Year's. And as a reminder, we recognize revenue once customers receive their glasses. So, orders placed in those final days of the year gets recognized as revenue in January.\n\nAnd we do anticipate that people will return to their sort of normal habits of, you know, lots of eye exams as they're seeking other medical treatment right at the beginning of the year. We did start to see a more normalized back-to-school behavior this year, which was promising. So, we do anticipate next year, certainly quarter by quarter, to be more in line with sort of pre-pandemic behavior.\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nAnd just adding on to that, we have a slide in our earnings slides in the back, which has an EBITDA -- adjusted EBITDA reconciliation back to 2016. So, you can have all of the back data to see the patterns of EBITDA that we saw pre-pandemic. Most recently, I would look to the pattern that we saw in 2021 as a reference point with good profitability of the first three quarters of the year and then lower profitability in Q4 as we spend into holiday and FSA demand. We'll provide a lot more visibility on our Q4 call in March.\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nAnd then to your first question about leverage in our model. Over the course of the last several months, we have been in an investment period as we convert more of our stores and doctors to the PC model, as we invest in our nascent contact lens business, and so we're adding to our exam and contacts investments in a period where there is -- overall, there are headwinds on demand in our category and there are signs of that across kind of all our data points. And so, as we start to see demand recover in a category, as we start to see traffic, overall, recover into our stores, that -- the increased shopping behavior spread across that store fleet will allow us to reignite that -- the leverage that we have in the fixed nature of some of our cost base.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question is from Oliver Chen from Cowen. Oliver, your line is open. Please go ahead.\n\nUnknown speaker\n\nHi there. This is Katie on for Oliver. Thanks so much for taking our question, and great, great quarter, guys. I guess our first question kind of on sort of what you're seeing in terms of customer health.\n\nIs there any sort of promotional pressure, whether it's in the glasses segment or contacts segment that you're seeing and sort of how do you think that might translate into the holiday season, and sort of what are your expectations around there? And then our second question is more on how traffic progressed through the quarter and did that correlated pretty well with the productivity or was the productivity more hinging on the actual sales, product, and exam? Thank you.\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nThanks for the questions. On the traffic front, we saw that progress in line with productivity. So, we saw kind of moderate increases throughout the quarter, which was encouraging. And then on the promotional front, we currently have two offers for our customers, but they're not really designed as blanket discounts on our products, but are really designed to encourage customers to purchase multiple products with us.\n\nAnd so, the first is a $50 credit for customers who purchase an annual supply of contacts with us, and then they can use that credit to purchase a pair of prescription glasses. And as our contacts business is new, the percentage of our customers who are buying annual supplies is still relatively low. And so, this is an opportunity for us to encourage people to increase their basket size, but also to think about cross-shopping for glasses as well. We find that customers who buy contacts and glasses from us tend to be some of our most valuable customers.\n\nWe also have an offer, Add a Pair and Save, where customers who purchase multiple prescription glasses from us get 15% off their order. Glasses are -- most of our customers have not thought about buying multiple pairs of prescription glasses in the past because they cost several hundred dollars at most other places. And so, this is really designed for people to think about purchasing glasses and thinking of them as an accessory. This is an offer that we actually first introduced in 2020, and we found that customers who took advantage of that offer ended up then coming back and buying additional pairs more frequently since then.\n\nAnd so, we're not attracting kind of bargain hunters who are just looking for the best deal and then not coming back to the brand. But we're finding that these types of offers are encouraging people to buy more products, and then those customers end up becoming more loyal and make more subsequent purchases. And going forward, we don't anticipate additional promotional activity through the holiday or the end of the year.\n\nUnknown speaker\n\nThank you.\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nAnd just adding a few comments on to what -- and just adding a few comments on to what Dave just described, in terms of retail productivity and some of the increases that we've seen quarter over quarter, so we exited Q2 at approximately 80% store productivity versus 2019 levels. We're now running at roughly 85%. And most of that increase is really driven by increased conversion and increased AOV as opposed to increased traffic at stores. And to provide a little bit of additional color, what we've seen across our store base, this has come up on a few earnings calls, is just that the difference in productivity levels we continue to see between suburban stores and urban stores.\n\nIt's approximately running at a 10-point difference, where suburban stores are at roughly 90% of 2019 levels and urban stores are at 80% of 2019 levels. So, I just wanted to round out with a few additional points of color that help understand what's happening as it relates to store productivity.\n\nUnknown speaker\n\nThat's very helpful. Thank you.\n\nOperator\n\nThank you. Our next question is from Paul Lejuez from Citi. Paul, your line is open. Please go ahead.\n\nBrandon Cheatham -- Citi -- Analyst\n\nHey, everyone. This is Brandon Cheatham on for Paul. So, I just kind of want to talk about kind of your active customer count. It seems like that's, you know, somewhat plateaued despite, you know, store openings.\n\nSo, I was wondering, you know, how do you all think about, you know, your active customer count versus store openings going forward? You know, if it continues to lag, you know, your store opening cadence, like would you consider pulling back on store openings or rethink the speed at which you're opening stores?\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nThanks for the question. What we see is we are operating in an environment where, for the first time in a very long time, the optical industry, right, is not as predictable and is, you know, based on the data that we're seeing is actually declining. So, the fact that we're growing means we're gaining market share. But in this environment, it has been more challenging to, you know, engage newer customers, right, as traffic to stores has been lower than sort of typical.\n\nOne of the things that we also did in Q3, right, is that we deliberately and intentionally pulled back marketing spend given what we were seeing sort of in the industry. Now, that resulted in a lower tax, right? Our tax are down 50% from Q1. And as we approach Q4, we do expect sort of marketing spend to normalize in the low double digits sort of similar to sort of pre-pandemic levels. And we expect that to sort of accelerate our customer growth.\n\nBut in general, right, our stores continue to have high ROIC. We -- you know, our new stores are performing in line with older stores and are paying back within 20 months. So, you know, as long as we're able to sort of get that return on that capital and also have, you know, four-wall margins are -- of our target of 35%-plus, then we'll continue to open up stores.\n\nBrandon Cheatham -- Citi -- Analyst\n\nGot it. Thanks. And one follow-up, if I can. You know, thanks for sharing you have 16 million lives covered under insurance.\n\nYou know, what do you think the, you know, opportunity could be there? Is there any difference in shopping behavior between customers that are in network versus shopping out of the network? Thanks.\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nYes, we continue to be excited about opportunities to make it even easier for people to use their existing insurance benefits with us. We will continue to add to that 16 million life total. We're also pursuing opportunities to directly integrate with out-of-network options so people can look up their eligibility and reimbursement ahead of making a purchase and making that as seamless as possible. In general, we haven't found major differences in kind of our insurance customers and noninsurance customers.\n\nAs a reminder, our average median household income for our customer base is over $100,000. The majority of our customers do have vision insurance, whether we're in-network option or not. Tends not to be the primary driver of whether they're purchasing with us or not. And as we cited, people who have vision insurance and use those in-network benefits are spending over $220 out of pocket, so more than they'd spend out of pocket coming to us for similar products.\n\nAnd so, we haven't seen insurance be a barrier to customer purchasing from us, but we're always looking to make things even easier for our customer base.\n\nBrandon Cheatham -- Citi -- Analyst\n\nAppreciate it. Thanks and good luck.\n\nOperator\n\nThank you. In the interest of time, our last question today comes from Dana Telsey from Telsey Advisory Group. Dana, your line is open. Please go ahead.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood morning, everyone. Nice to see the progress. Given last year's impact of omicron at the end of the year impacting the FSA spend, can you expand on the opportunity to maximize the revenue this year from this end-of-year time period and potentially into January? Do you look at it more like it could be 2019? Or is there anything we should be watching for that you're doing? And also, nice to see the update on the retail productivity, which is even increasing. How do you think of that balancing act of the online revenue versus the store revenue and how you're planning going forward? Thank you.\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Dana. Yeah. On that first topic, we're certainly hoping that this holiday season looks more like 2019 than last year. And, you know, barring another pandemic surge or some unexpected event, we are expecting shopping trends to look more similar to pre-pandemic patterns.\n\nAnd certainly, what we've seen over the last couple of years and, you know, given the depressed activity we saw last year, we are expecting kind of a nice bump on a year-over basis on that front.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nAnd as we just think about retail productivity, yeah, it was sort of nice to see that expand throughout the quarter. We came into the quarter about 80% of 2019 levels, exited at 85% for sort of an average of 82%. So, feel like we have strong momentum going into Q4. On the e-commerce front, we continue to sort of invest in sort of new features that delight customers.\n\nAs Dave mentioned, we now offer virtual try-on on our browser. We were the first to launch a true-to-scale virtual try-on, and we'll continue to sort of launch new features. In general, what we've observed marketwide is that sort of online glasses sales have been sort of negatively impacted more than sort of bricks and mortar from an industrywide perspective. So, we're very satisfied with sort of e-commerce sort of performance for Warby Parker and expect that sort of just to sort of grow from here going forward in 2023 and beyond.\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nAnd to support the demand that we expect to see in December and to help stoke that demand a little bit, as we typically do, we do ramp marketing spend in Q4. And so, in Q3 of this year, marketing spend as a percent of revenue came in at roughly 10%. And we've talked about seeing marketing spend as a percent of revenue normalize in the low double digits. And I would expect us to see an elevated marketing spend within the range of 100 basis points to 200 basis points as we head into Q4 to make sure that we're doing everything we can to capture those holiday orders and FSA orders.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGreat. And then just one just quick follow-up. As you think about the number of new store openings and how you think about it for next year, should we assume it'll be similar to this year or do you foresee any change?\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nIt's safe to assume that'll be similar to this year.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nGreat.\n\nOperator\n\nThank you.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nThank you.\n\nOperator\n\nI'd like to turn back the call over to Neil for closing remarks.\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nGreat. Thank you all for joining our call today. We look forward to keeping you posted on progress heading into the holiday season and year-end. Thanks again for participating and all of your thoughtful questions, and we'll see you in March.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNeil Blumenthal -- Co-Founder and Co-Chief Executive Officer\n\nDave Gilboa -- Co-Founder and Co-Chief Executive Officer\n\nSteve Miller -- Senior Vice President and Chief Financial Officer\n\nEd Yruma -- Piper Sandler -- Analyst\n\nUnknown speaker\n\nBrandon Cheatham -- Citi -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMore WRBY analysis\n\nAll earnings call transcripts"
}