{
  "companyName": "Royal Caribbean",
  "companyTicker": "RCL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/royal-caribbean-rcl-q3-2022-earnings-call-transcri/",
  "content": "Royal Caribbean (RCL -0.74%)\nQ3 2022 Earnings Call\nNov 03, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Royal Caribbean Group third quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Michael McCarthy, vice president, investor relations.\n\nMichael McCarthy -- Vice President, Investor Relations\n\nGood morning, everyone, and thank you for joining us today for our third quarter 2022 business update conference call. Joining me here in Miami are Jason Liberty, our chief executive officer; Naftali Holtz, our chief financial officer; and Michael Bayley, president and CEO of Royal Caribbean International. Before we get started, I'd like to note that we will be making forward-looking statements during this call. These statements are based on management's current expectations and are subject to risks and uncertainties.\n\nA number of factors could cause actual results to differ materially from our current expectations. Please refer to our earnings release issued this morning, as well as our filings with the SEC, for a description of these factors. We do not undertake to update any forward-looking statements as circumstances change. Also, we will be discussing certain non-GAAP financial measures, which are adjusted as defined, and a reconciliation of all non-GAAP items can be found on our website and on our earnings release available at www.rclinvestor.com.\n\nJason will begin the call by providing a strategic overview and update on the business. Naftali will follow with a recap of our second quarter results and an update on our latest actions and on the current booking environment. We will then open the call for your questions. But first, we will start the call with this video highlighting and introducing our Trifecta program.\n\n[Commercial break]\n\nJason Liberty -- Chief Executive Officer\n\nThank you, Michael, and good morning, everyone. Over the past several months, our teams have been very busy and focused on generating strong quality demand, combating inflation, and most of all, delivering the best vacations in the world as we return our business closer to historical load factors while maintaining price integrity and generating $3 billion in revenue and almost $750 million in adjusted EBITDA in the third quarter. As you have seen in our announcement this morning, we have announced a three-year financial performance program that we have termed project Trifecta. Now, before getting into the details of the program, let's first talk about how the business is performing.\n\nAs our third quarter results clearly demonstrate the strength of our vacation platform, which includes our leading global brands, the best and most innovative ships in the industry. And a powerful and nimble commercial apparatus, coupled with strong execution by our operating teams have delivered another quarter of strong performance that exceeded our expectations. Our entire fleet is operating globally in our key destinations, demand for our experiences was very strong, and we achieved 96% load factors overall with the Caribbean at close to 105% at record pricing and high satisfaction scores. We delivered adjusted EBITDA of $742 million and positive earnings per share of $0.26, which was above our guidance.\n\nOur strong financial performance, coupled with proactive refinancing actions, further strengthened our already strong liquidity position and improved our debt maturity profile. I'm thankful and proud of everyone at the Royal Caribbean Group for delivering the best vacation experiences to our customers in a responsible way while executing so well in our recovery and building on our future. The successful return of our business to full operations in the accelerating demand environment positions as well to deliver on our expectations of record yields, and record adjusted EBITDA in 2023. Next, let me elaborate on the Trifecta program we announced this morning.\n\nBut the operational return of our business well in hand, we are now focusing the team and our stakeholders on returning to record financial performance and beyond. The introduction of the Trifecta program provides us the coordinates we are looking to achieve over the next few years while delivering the best vacations in the world responsibly. Specifically, we are focused on achieving three metrics by 2025, growing EBITDA profitability per APCD to triple digits, delivering double-digit earnings, and achieving a return on invested capital in the teens. We look to achieve these metrics while we return the balance sheet back to investment-grade profile and reduce our carbon intensity by double digits compared to 2019 as part of our commitment and focus on advancing the sustainability of our business.\n\nOur formula for success is based on moderate capacity growth, moderate yield growth, and strong cost discipline. For those who have followed us for some time, this will sound very familiar as we demonstrated in the past, it leads to strong financial performance, and does not assume a perfect operating environment. Our plan is well-grounded in a set of underlying strategies, robust secular and demographic trends, a strong culture, and a powerful foundation of leading global brands, the most innovative fleet in the industry, and the very best people. The main thrust of our plan is to take further advantage of our strong foundation, and further orient our ecosystem around the customer by enhancing our commercial apparatus and product offerings.\n\nBy doing this, we will further enhance customer preference, engagement, cruise frequency, guests experience, and spend. This combined with expanding our fleet through innovative new ships and land base experiences like Perfect Day at CocoCay will drive our profitability growth and strong cash flow generation. Disciplined capital allocation to high-returning investments will allow us to reduce leverage while investing in our future and delivering strong shareholder value. Trifecta creates the pathway back to what we internally describe as Basecamp.\n\nHowever, Basecamp is not our final destination, our ambitions go well beyond it. And while it may not always be a straight line, and there may be some choppy waves from time to time, we are confident in our leading platform and ability to execute on our strategies to deliver those goals over the next few years. Before going into the booking commentary, I wanted to share some of the behaviors that we are seeing from our guests. Global demand for travel is ramping up as consumers continue to shift spend to experiences.\n\nWhile this is good news to us as we are squarely in the experience business. The value proposition of cruise remains incredibly attractive, I would say too attractive. Our full addressable market is back and our brands are attracting new customers into our vacation ecosystem. As a result guest mix for the quarter was equally distributed across loyalty, new to cruise, and new to our brand similar to what we saw in 2019.\n\nLet me highlight some observations from our daily engagement with our customers. This quarter we delivered 1.7 million amazing vacation experiences. And we have more than 130,000 guests sailing on our ships globally every day. The positioning of our brands attracts guests across broad demographics, psychographics, and at a median household income above $100,000.\n\nThis provides us a unique vantage point on what our guests are looking for and their behaviors. Overall across markets, brands and products, we continue to see a financially healthy, highly engaged consumer with a strong hunger to dream and seek a variety of vacation experiences. Our commercial apparatus is seeing elevated booking activity across channels as we help our customers design their dream vacations. Our guests are willing to spend more than ever with us to create those memories.\n\nConsumers are engaging earlier in the planning their vacation, with about 60% purchasing onboard experiences before they even set sail. This has led to an 8-point increase in penetration and much higher revenue APD related to pre-cruise purchases versus 2019 levels. Our guests continue to seek the rich experiences we offer spending significantly more onboard our ships compared to 2019 across nearly all categories. All this is translating into strong booking activity.\n\nDuring the third quarter, we saw both strong demand for close in sailings and accelerating demand for sailings in 2023. Next, let me talk a little bit more about the new ships that are planned to join our fleet next year. Our innovative new ships and onboard experiences will allow us to continue to differentiate our offering, as well as deliver superior yields and margins. Two weeks ago, we revealed details on our new and amazing Icon of the Seas, which will be delivered in late 2023 ahead of its January 2024 debut.\n\nIt is a game-changing, first-of-its-kind vacation experience where everyone can experience their version of the ultimate vacation. Icon will have eight distinct neighborhoods, each a destination in and of itself, packed with an array of amazing experiences. The ship's stateroom configuration will allow for load factors to be accretive to the overall portfolio, and the ship will be significantly accretive to our key financial metrics. The ship opened for sale about a week ago, and the market response was nothing short of remarkable.\n\nOn the first day of bookings, we far surpassed our previous single-day booking record for the brand and the company overall, and it wasn't even close. With each new ship, we raise the bar in the travel industry while enhancing what our guests know and love. In addition to Icon, [inaudible] will join the Celebrity fleet in the fourth quarter of 2023 and Silver Nova will join the Silversea fleet in late summer. In the coming days, we will open a brand new flagship terminal in Galveston, Texas.\n\nThe new terminal significantly expands our capacity in the region, with the ability to accommodate the larger Oasis Class ships and give us further access into the attractive drive to markets of Texas, Oklahoma, and the entire southeast region. The facility will also be the first cruise terminal to generate 100% of its needed energy from onsite solar panels and will be the first zero-energy cruise terminal facility in the world. While we are still early in our planning cycle, 2023 is shaping up to be a strong year for the company and a return to normal typical business. Our overall capacity will grow 14% compared to 2019 on account of 10 new ships which have joined or will join the fleet across our brands during this period net of dispositions.\n\nOur deployment across markets is relatively unchanged compared to 2019 with Caribbean representing just over half of our overall deployment, Europe at almost 20%, and Asia in the low single digits with no planned deployment in the high-yielding China market. About 80% of the population is within driving distance to a U.S. home port and we have upsides the short Caribbean product by 35% compared to 2019. Almost 65% of guests sailing on Royal Caribbean Internationals, Caribbean itineraries will experience Perfect Day at CocoCay in 2023, up from 30% in 2019.\n\nWe expect almost 80% of 2023 guest sourcing to come from North America as we continue to see particularly strong demand from that customer. Our global brands appeal and nimble sourcing model allow us to attract the highest-yielding guests and partially mitigate the impact from the strong dollar. While 2022 bookings remain strong and on pace to achieve occupancy targets, the most notable change over the past few months has been a substantial acceleration in demand for 2023 sails. We received twice as many bookings for 2023 sailings in Q3, as we did in Q2, resulting in considerably higher booking volumes than during the same period for 2019 sailings.\n\nAs a result, all four quarters of 2023 are booked well within historical ranges at record prices, with bookings accelerating every week. While the last three years were certainly challenging. The resiliency of our business allowed us to recover quickly and be fully back up and running. Our operating platform is larger and stronger than it has ever been with the best brands, best ships, and best people.\n\nOur commercial capabilities allow us to reach more quality demand, and our itineraries are strategically planned to appeal to both new to cruise and loyal customers. The value proposition of cruising remains incredibly attractive and we have an opportunity to close the gap to other land vacation alternatives as we grow our addressable market. We continue to expect the business to accelerate as we close out 2022 and set a strong foundation for us to deliver record yield and adjusted EBITDA in 2023. Our formula for success remains unchanged.\n\nAs we have demonstrated in the past, moderate capacity growth, moderate yield growth, and strong cost controls lead to enhanced profitability and superior financial performance as we seek to improve the balance sheet. The future of the Royal Caribbean Group is bright. With our strong platform and proven strategies, I'm confident in our recovery trajectory and our ability to deliver on the Trifecta program, as well as reach new financial records. With that, I will turn it over to Naftali.\n\nNaf?\n\nNaftali Holtz -- Chief Financial Officer\n\nThank you, Jason. Good morning, everyone. Let me begin by discussing our results for the third quarter. This morning we reported a net profit of approximately $60 million or $0.26 per share above the high end of our guidance range.\n\nTotal revenue was just shy of $3 billion and adjusted EBITDA was $742 million. Third quarter outperformance was a result of continued strong demand for our brands vacation experiences, especially after the easing of health protocols, continued strength of onboard revenue, and better cost management. The successful ramp-up of our operations completed earlier this summer has positioned us well to return to generating consistent financial performance and recovering toward our record 2019 levels and beyond. We finished the third quarter at a 96% load factor with peak August sailings as close to 100%.\n\nBoth factors varied by itinerary with Caribbean averaging close to 105%, Alaska at about 96%, and Europe as expected at just under 90%. Also, as expected, total revenue per passenger cruise day was up 1% in constant currency compared to the record third quarter of 2019. Strong demand for our brands and outperformance in onboard revenue mitigated the negative impact from FCC redemption and the lower-than-average load factors on higher-priced Europe and Alaska sailings. Our goal has always been to maximize our revenue yields as we optimize occupancy and pricing.\n\nWith our ramp-up almost complete, we are nearing the point of full recovery to our record 2019 yields. Our cost and currency yield improved by 8% in the third quarter, and we expect a similar improvement in the fourth quarter. We expect yields to continue ramping up in the first half of 2023 as we return to historical load factors in late spring. Next, I will comment on capacity and load factor expectations over the upcoming period.\n\nWe plan to operate about 11.7 million APCDs during the fourth quarter with load factors close to the third quarter. Historically, our third quarter load factors have always been higher than the fourth quarter due to peak summer family travel. This year as we are continuing to ramp up, we do not expect a decline in overall occupancy quarter over quarter. Let me break down fourth quarter load factors and capacity expectations a little more.\n\nDuring the quarter, our ships transitioned to their winter itineraries and as a result, two-thirds of our capacity is in North America. Our remaining capacity is mostly split between late-season Europe, Australia, and repositioning voyages. We expect Caribbean sailings to continue to sell a triple-digit load factors with slightly lower occupancies on late-season Europe sailings, which are just about 10% of capacity for the quarter. We are returning to Australia for the first time in three years, and as a result expect to build to load factors in the low to mid 90s.\n\nWe expect to return to overall historical occupancy level by late spring of 2023. Our customer deposit balance as of September 30, was $3.8 billion, which is about $400 million higher than our balance at the end of the third quarter in 2019. As we previously shared, now that the full fleet is in service and occupancy is ramping up, we are returning to a more typical seasonality in customer deposits levels. In 2019, our customer deposit balance declined by about $500 million between the end of Q2 and the end of Q3.\n\nThe seasonal decrease was smaller this year as we continue to see stronger booking volumes. In the third quarter, over 95% of total bookings were new versus Future Cruise credit redemptions. Guests sailing with FCCs impact our APDs by about 1% this year, and we expect the impact to be smaller next year. Less than 20% of our customer deposit balance is related to FCCs.\n\nShifting to costs, net cruise costs, excluding fuel, per APCD improved 11% as reported and 10% in constant currency compared to the second quarter of '22. Net cruise costs for the quarter also included $3.37 per APCD of transitory costs related to help protocols and one-time legging costs related to fleet ramp-up. We still expect to have transitory costs in the fourth quarter but as we are nearing full occupancies and full crew staffing levels and are adapting our protocols we expect them to significantly ease. Similar to other businesses around the world, we continue to actively manage inflationary pressures that for us mainly relate to fuel and food costs.\n\nOur teams continue to demonstrate the ability to manage cost pressures while staying focused on our mission of delivering the incredible vacation experiences that are expected by our guests. In fact, year to date, we have consistently been able to abate about a third of the market increases as we observed through benchmarks across various categories, all while achieving consistently high NPS scores. We will continue to both monitor the inflationary cycle, as well as focus on mitigation strategies as we enter 2023. Regarding fuel, we have seen fuel rates coming off the highs of earlier in the year, but they are still volatile.\n\nWe continue to improve consumption and have partially hedged the rate, which is helping us mitigate the volatility and cost of fuel expense. As of today, fuel consumption is 64% hedge for the fourth quarter and 50% hedge for 2023. NCC, excluding fuel, per APCD in the fourth quarter is expected to be higher by low to mid-single digits on a constant-currency basis compared to the fourth quarter of 2019. This includes a few percentage points of transitory costs related to protocols and ramp-up of operations.\n\nLower expenses related to returning ships and crew to operations and easing health protocols are supporting the improvement in costs. In addition, the benefits from actions taken during the pandemic to improve margins continue to materialize, and we expect them to ramp up into fourth quarter and into 2023. We expect these actions to partially mitigate the inflationary pressures, we expect to continue to weigh on our cost through the first half of 23. Shifting to our balance sheet, we ended the quarter with $3.1 billion in liquidity.\n\nOur liquidity position remains strong and we are focused on expanding our margins to further enhance EBITDA and free cash flow. Our ultimate goal is to return the balance sheet to an investment-grade profile. During the third quarter, we took multiple proactive actions to address $5.6 billion of 2022 and 2023 maturities. Since early August we issued $1.25 billion of unsecured notes to refinance remaining 22 maturities and refinance $2.8 billion of 23 maturities that were previously backstopped by a Morgan Stanley commitment.\n\nWe also extend it for one year the commitment to a $700 million term loan and extended a $500 million term loan that was scheduled to mature in 2023. All these transactions have been well received by investors and we were able to upsize and improve pricing. Our access to capital remains strong, and our execution and performance resonate with our investors. While rates are higher than what we were able to issue earlier in the year, we have included early redemption features to allow for refinancings or pay down prior to maturity.\n\nFor 2023, our scheduled debt maturities are $2.1 billion made up of predominantly ECA debt amortization, which we expect to pay down with cash on hand and cash flow generated from operations. Now turning to guidance. For the fourth quarter of 22, and based on current currency exchange rates, fuel rates, and interest rates, we expect to generate approximately $2.6 billion in total revenue, adjusted EBITDA of $350 million to $400 million, and adjusted loss per share of $1.30 to $1.50. The combination of our strong brands, amazing experiences, and focused on building quality demand position as well for '23.\n\nWe expect yields to continue ramping up in the first half of '23 based on our return to historical load factors by late spring. I want to take a moment to highlight certain changes in our yield profile and cost base. Over the last several years, we divested the Pullmantur and Azamara brands, as well as several other small ships across the fleet. In addition, we did not have any China deployment planned for '23 and we have increased our short Caribbean product.\n\nThe net effect is a slight reduction in yield, but an increase in overall profitability. New ship additions for Celebrity and Silversea result in those brands being a larger percentage of our overall mix in '23 as compared to 2019. These additions are expected to add to our yield and return profile, but also have higher cost per berth. Our shift to more North American itineraries reduces our exposure to foreign exchange rates, with about 20% of our revenue expected to be sourced in non-USD currencies versus just over a quarter in prior years.\n\nWith that said, exchange rates for a basket of currencies are down on average 9% versus 2019. We are very excited about the introduction of the Trifecta program. As we demonstrated before, our proven formula should once again result in strong financial performance. By 2025, our capacity is expected to grow by 6% on an annual basis compared to 2019 with the introduction of 17 new ships across our brands and markets.\n\nWe expect new ships as well as our relentless focus on the customer to drive additional yield benefits, cost efficiencies, and profitability of at least triple-digit EBITDA per APCD by '25. Every 1% improvement in yield in 2025 will result in $130 million more in revenue, and every 1% of change in NCC, excluding fuel, will result in $60 million benefit in operating costs. Increasing EBITDA per APCD to triple digits will allow us to generate strong and growing cash flow and together with disciplined capital allocation and pay down of debt return to an investment-grade balance sheet profile. We will stay focused on executing on our strategy to achieve strong financial results by growing yields, expanding margins, and improving the balance sheet.\n\nWe have done it before. We have the best brands, the best assets and the best people as we build a brighter future of the Royal Caribbean Group. With that, I will ask our operator to open the call for Q&A.\n\nOperator\n\n[Operator instructions] Your first question is from the line of Steve Wieczynski with Stifel. Steven, your line is open.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nYes. Hey, guys. Good morning. So, Jason, I know you like it when I say nice quarter, so I'll go ahead and get that out of the way and say nice quarter.\n\nJason Liberty -- Chief Executive Officer\n\nYou didn't say it last time, Steve.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nI forgot. But you know, as we think about this Trifecta program, I guess, what I'm most interested in is the return to investment grade. And if I do the math here, I guess you guys are kind of embedding around, let's say $5 billion of EBITDA by '25, if not higher. So what does that mean from a leverage perspective? And if you had conversations at this point yet with the rating agencies about what's your leverage profile would have to look like to get back into that investment-grade status.\n\nSaying that in another way, I mean, is it a number like four times? Or is it going to be more about what your interest coverage is going to look like at that point?\n\nNaftali Holtz -- Chief Financial Officer\n\nHey, Steve. It's Naf. Good morning. So first of all, yes, we're very excited by Trifecta.\n\nAnd as you've done, your math with some of the coordinates we gave you, that's how we think about it. And that will help us as we grow continue to grow EBITDA, both help deleverage the balance sheet but also generate cash flow. And with our capital allocation, we're very much focused on paying down debt. And if you're going to remember, in 2019 and before, our goal was around and where we were is around three times leverage.\n\nAnd those are the topic coordinates that we're looking for. And which means, for us, an investment-grade balance sheet, in addition to being an unsecured balance sheet as well. We've been having conversations with the rating agencies. There hasn't been any indication of difference in their kind of ratings versus what was pre-pandemic.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK, great. Thanks for that, Naf. And then when you guys think about moderate yield growth and what that looks like going forward, I guess what I'm wondering is how do you think about breaking yields down moving forward between ticket and onboard? And I guess what I'm trying to get at here is are you embedding the consumer at this point? Are you thinking the consumer kind of stay strong in terms of that onboard spend patterns moving forward? Or can you still get what you call moderate yield growth, even if that onboard side does start to slow down?\n\nNaftali Holtz -- Chief Financial Officer\n\nYes, great question, Steve. When we look at things, over time, we've been able to grow our like-for-like yields. We've been able to grow our onboard. And obviously, as we take on new ships, the inventory mix has also been helpful as those ships have a better inventory mix in terms of speeds and outsides versus insides, as well as on the onboard side.\n\nThere's more venues for us to have different services and experiences for our guests, which they'll spend money on. So I think when we think about moderate yield growth we think about, as we said it in the past, it's on average 2% to 4% a year. And on the cost side, it's typically flat to low single digits. So we should be able to grab scale as our business grows.\n\nAnd that's how I think we -- you'll see us continuing to do that. We're not looking at this as if -- and I've said this in my remarks as the operating environment is going to be perfect and that the consumer is going to be perfect. What we've done is we know that we have been able to manage our business in that way in times in which the market might be accelerating and sometimes when market is a little bit choppy. And that's why we looked at this over this kind of two-and-a-half, three-year period of time on us getting back -- well, not just getting back, accelerating past our highs in 2019.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nAnd can I ask one real quick housekeeping question? And I guess there might be some confusion out there about -- when you talk about records, EBITDA in '23, is that going off an EBITDA base in 2019 of $3.6 billion or $3.4 billion? I think there's different thought processes out there.\n\nNaftali Holtz -- Chief Financial Officer\n\nYes. It's the former, $3.6 billion.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\n$3.6 billion, OK. Thanks, guys. Appreciate it.\n\nJason Liberty -- Chief Executive Officer\n\nI thought you're going to ask me about vacuuming, Steve, on the housekeeping question, I guess.\n\nOperator\n\nYour next question is from the line of Robin Farley with UBS. Please go ahead.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Yes. Thanks. You mentioned that price is at record levels for '23.\n\nI wonder if you could sort of give a ballpark of how that price compares on a percentage basis to 2019, knowing that it could go up or down from there, but just in terms of how it's tracking.\n\nJason Liberty -- Chief Executive Officer\n\nWell, it's still early, Robin. You know this from the past. Tt would be early for us to provide guidance, but I think how we've kind of talked about the Trifecta program is kind of how we think about yields and costs and so forth for next year. So that's what I would kind of use more principally as a guiding tool.\n\nBut it's early, there's -- we still have -- we're still building the book of business, while it is accelerating and we're very happy with it. We're comfortable providing exactly what those coordinates will be come January or early February call.\n\nRobin Farley -- UBS -- Analyst\n\nOK. Then you're probably going to love my next question.\n\nJason Liberty -- Chief Executive Officer\n\nI love that question, Robin.\n\nRobin Farley -- UBS -- Analyst\n\nIt's sort of  similar about expenses that -- just looking at what were sort of one-time expenses, meaning like the ramp-up and some of the protocols that you don't have to follow anymore was maybe about 3% to 5% of the expense increase in '23. And so in Q4, when you're talking about being uploaded mid-single versus '19, if we think of that maybe some ramp down and some of those one-time costs, could you get to the point in '23 where your expense is actually lower, just given your greater scale and more efficient ships? And this is all excluding fuel cost, which does not forecast that, but just your fuel expense, perpetual cruise sails like potentially being better being lower and better than it was in '19?\n\nNaftali Holtz -- Chief Financial Officer\n\nYes. So I'll follow what Jason was saying, which is we're still early in our planning cycle. And, obviously, we're not providing guidance here. But I think, as we think about it, as we said, all those one-time costs that we incur this year, we expect them to be lagging into the fourth quarter.\n\nAnd, again, going back to Trifecta in our formula, this is how we think about things in terms of how do we increase profitability. We continue to see inflation. We're working really hard to mitigate the impact of it and making sure that we are continuing to increase the margins of the business.\n\nJason Liberty -- Chief Executive Officer\n\nAnd I mean, just to add, Robin, we certainly much appreciate when we look at a 14% capacity increase that we should be able to get more efficient over time. And of course, some of that capacity increase that's coming in as a mix leans heavier now toward Silversea and Celebrity in terms of the capacity growth. And of course, those are higher net cruise cost products. But in the same vein, we have been taking a lot.\n\nWe have taken a lot of action during the course of this. We've done a lot of, as I've described in the past, getting into our wedding weight here, which is helping us combat a lot of the inflation so that we can kind of think about that formula for success as we go into 2023.\n\nRobin Farley -- UBS -- Analyst\n\nOK, great. Thanks very much.\n\nOperator\n\nYour next question is from the line of Vince Ciepiel with Cleveland Research Company. Please go ahead.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nGreat. Thanks for taking my question. First, a little bit more near-term focus. Looking at your occupancy progress in 3Q, as well as what's implied for 4Q, looks like you're outperforming peers by almost a low teens percentage in the second half of this year.\n\nAnd curious, your thoughts on what's driving that. Is that geography? Is it mix of shifts, strength of your brands, more marketing? What do you think is kind of the biggest contributor to the occupancy recovery outperformance?\n\nJason Liberty -- Chief Executive Officer\n\nYes. Well, I can't really speak for our competitors in terms of what's happening inside their business. But I think for us, we obviously -- we returned our ships very quickly. I do think that some of the things that you laid out there strong brands, I think leading brands, leading ships, having assets like Perfect Day at CocoCay has resulted in an acceleration of our business while also being very mindful about price integrity, as you know, certainly could be higher load factors if we wanted to take action on price, which we're not looking and we have no intent to do.\n\nAnd of course, in the Q4, we're moving into the colder season, which is why load factors are more or less what we talked about in Q3 and rates are typically lower in Q4 because that's the colder season period of time. But what we see is a lot of demand for our brands. We see the return. I mean, everything has normalized in terms of new to cruise, loyal guests first to ran.\n\nAnd so now it's just building up a quality book business over time as we would do in a regular way as we enter a normal 2023 year.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nGreat. Thanks. And then thinking longer term, pricing opportunity ahead of you and the value gap versus land base. Some of that gap has been exacerbated through COVID, which makes sense given the industry was on pause for so long, but some of that gap even existed pre-COVID.\n\nSo I'm curious how you guys have improved the product in the last few years to kind of better meet the consumers need. Or is it just marketing the product more to raise awareness to help close that gap?\n\nNaftali Holtz -- Chief Financial Officer\n\nVince, what can I say? You just gave me the great question. I've been sitting quietly here waiting for somebody to ask such a question. Obviously, we are extremely pleased and delighted and honestly excited with the direction of the business. I think, as Jason commented earlier, the results from Icon of the Seas that the first weeks bookings for Icon were absolutely phenomenal.\n\nI mean, we had high expectations, and the actual results just even surprised us. I'm not going to give you the stats for that first week because I may get into trouble, but they were really phenomenal. And Icon is the first in a new class of ships for Royal Caribbean, which is squarely in the family market, which is a scale. Obviously, it's a scale brand with huge presence in the American market and a strong global footprint.\n\nThat product and the journey that we've been on now for many years in terms of where we're taking the brands, the introduction of Perfect Day and our plans for future private destinations, combined with new hardware, and certainly with Icon now leading the way late in '23, and into '24, where we're really focusing on this target market, which is family and of course, has many new neighborhoods, including a neighborhood called Surfside, which is absolutely focused on young families. And those young families with children six and under travel all year round, because obviously, parents can pull their kids out of pre-k and what have you. The Icon product, along with Perfect Day, with the kind of experiences that we're offering with the kind of new accommodations that we have on Icon, and the experiences that we have for young families, older families, and of course, couples and singles, and what have you, is really squarely standing shoulder-to-shoulder with Orlando, and those kinds of destinations. And what we're beginning to see is the -- for us is moving certainly the Royal brand into that space far more aggressively.\n\nAnd we're seeing the kind of booking activity and demand and enthusiasm for those products is increasing and accelerating. So I would say that's the direction we're on. And, again, what we've seen with Icon in the first week, and it's continued now into the second week. There's a huge amount of demand for that product.\n\nAnd I think, if I'm correct, Vince, Michael told me that you actually been sitting on a plane and you overheard a conversation maybe you could share with everybody else. What you overheard on that plane.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nIt's something we hear often from our conversations with agents just stealing a little bit of market share from land based and it was a random traveler behind me saying they were thinking about going to Disney but going to book their family on the Icon. So yes, speaks to maybe some market share gains there. One-off conversation but part of a broader theme.\n\nNaftali Holtz -- Chief Financial Officer\n\nYes. But just assume that everybody says that. And I just wanted to add to Michael's comments, obviously, we've seen this 40% gap to land based vacation, it used to be about 20%. The Royal brand actually closed the gap very significantly, with the introduction of Perfect Day, the modernization of our fleet.\n\nAnd so we see there's a lot of opportunity to close that gap here over time. And I think what you're also hearing from us, and in, we'll probably talk more about this in our investor day in the coming weeks here is just how we need to increase frequency with our guests. We need to improve our loyalty programs. We need to be more one-to-one so that we're putting offers in front of our guests that are very relevant to them individually, and just bring more awareness.\n\nAnd that should all yield us closing the gap further to land-based vacation. So we're not happy about that gap, but it serves as great motivation for us to go after.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nGreat. Best of luck.\n\nNaftali Holtz -- Chief Financial Officer\n\nThanks, Vince.\n\nOperator\n\nThanks. Your next question is from the line of Brandt Montour with Barclays. Please go ahead.\n\nBrandt Montour -- Barclays -- Analyst\n\nHey, good morning, everybody. Thanks for taking my questions, and congratulations on getting this Trifecta out there. My first question is on broader bookings volume trends throughout the quarter adjacent if you could just speak broadly in terms of how that sort of trended post the protocol relaxation, if there was sort of a huge spike from pent-up people waiting for that to happen, and then it eased a bit or is it even or did it accelerate through anything you could help, you could add would be helpful. Thank you.\n\nNaftali Holtz -- Chief Financial Officer\n\nHey, Brandt. Let me just jump in before maybe Jason has some comments. But we were all waiting for that change in the protocols. Our calculation on the addressable market was quite significant in terms of the number of people who were excluded from the brands and the product because of these protocols and requirements, etc.\n\nAnd we were already doing very well, pre that announcement. But when those protocols fell off, we immediately saw a significant increase in the volume of bookings. And that volume continued to -- just continued and has accelerated. And I think what we've seen is that literally, I think our calculation in the American market was that the addressable market expanded by about 35 million people almost overnight, and we saw that coming through in our booking, so it was a very positive step.\n\nAnd if you look globally, now, there's -- it's pretty much the same story all around the world, in the Australian market, where we're obviously operating. There is still some protocols still in place, but we're pretty confident they're going to fall away in the coming weeks and months. So we've really entered into a very normalized environment and we've seen the customers respond, honestly, with a huge amount of enthusiasm has been extremely positive.\n\nJason Liberty -- Chief Executive Officer\n\nYes. I just want to add, because I know, coming out of all this, there's always a lot of what's happened with protocols and so forth. I think it is important to note that the business is back and operating, the booking activity is very, like, similar to what we were experiencing in '19. And of course, it's accelerating, which is what we want to see the consumer is very healthy.\n\nWe're spending a lot of money on our ships. But psychologically, and we – experience-wise, it's almost as if we just stepped into the next quarter after '19. And we're just -- it's business as usual.\n\nBrandt Montour -- Barclays -- Analyst\n\nGot it. Great. That's excellent to hear. And then my second question is on net yields for 2023, you guys went through a loss of puts and takes, versus 2019 I feel like I'm going to need a Ph.D.\n\nin physics, just to sort of distill it down to a common denominator here. But if I add up everything Pullmantur, Azamara, the change in mix for CocoCay, the change in mix for North America, in general, the exit higher yielding China. But I know you guys don't have guidance out there, and you're not going to give it. But just when you add it all up, does it equal a net positive or negative mix shift to where we would have been otherwise versus '19?\n\nNaftali Holtz -- Chief Financial Officer\n\nOur expectation, as I said,  is our yields will be up in 2023. And our EBITDA will be better in 2023. And we expect we're going to manage our costs, as we always have. And we know that there are headwinds, there are some structural headwinds and not pointed out on the top line.\n\nBut our expectations are that our yields are going to accelerate. And we expect that we're going to be managing our cost effectively and our capital allocation effectively.\n\nBrandt Montour -- Barclays -- Analyst\n\nOK. Thanks, guys. Just to clarify, I wasn't suggesting that -- I just wanted to focus just on the mix not if it was up versus '19 or down versus '19, but if you were to take a benchmark versus '19 what the mix shift alone would do to that benchmark? That's what I was asking about. But I appreciate your comment.\n\nJason Liberty -- Chief Executive Officer\n\nYes. For sure, the combination of new ships and the exit of Azamara and so forth that nets out to a positive for us.\n\nBrandt Montour -- Barclays -- Analyst\n\nPerfect. Thanks, everyone.\n\nOperator\n\nYour next question is from the line of Ben Chaiken with the Credit Suisse. Please go ahead.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, how is it going? Just a quick clarification, you guys mentioned some inflationary cost in the first half of next year. Is that incremental about what you are seeing today? Or are you just kind of suggesting a continuation of the trend into the first half of next year?\n\nJason Liberty -- Chief Executive Officer\n\nYes. We actually are seeing some mitigation, but it's a little bit hard, right? The environment is pretty complex. So what we're seeing is continuation of what we're seeing today.\n\nNaftali Holtz -- Chief Financial Officer\n\nYes, but I think just to add on to it, what we're not really seeing now is our commodities, the things that are inflationary impacted going up now, so it has stabilized and is not mentioned there. We're starting to see especially kind of in the protein space where those commodity costs are starting to come down.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nGreat. Thank you.\n\nJason Liberty -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question is from the line of Daniel Politzer with Wells Fargo. Please go ahead.\n\nDaniel Politzer -- Wells Fargo Securities -- Analyst\n\nHey, good morning, everyone, and thanks for taking my questions. I was wondering if we could just unpack the bookings commentary a little bit more. As you look across 2023, what are some of the highlights you'd call out? Is it Europe? Is it Caribbean? And also, as you exit this year, what's the typical percent of both things that you have on the books for the following year? Thanks.\n\nJason Liberty -- Chief Executive Officer\n\nYes, sure. So I think what we're seeing kind of across the Board is a lot of -- there is a lot of strength in the Caribbean. We see strength in Alaska. We see strength in the Europe, We're more focused on the Mediterranean area.\n\nThat's where we see the strength in the bookings. But yes, we see a lot of like these puts and takes and we see these trends change a little bit over time and but for the most part, we're seeing most of our products a lot of strength in demand with the focus a little bit more on the Caribbean in terms of where we're seeing the consumer want to get ahead of the curve in their booking activities. Historically, we've entered the year somewhere between 55% and 60%, I would just be mindful as we go into next year and some of the comments that I made and Naftali made, we don't have any China business assumed for 2023. Typically this point of the year we would have most of that business booked because it was charter-related contracts.\n\nSo that will weigh a little bit on in terms of the percent that were booked. And we have more short product going into 2023, which is a little bit more of a closer in product. But we feel very comfortable with not only how we're booking but we feel very comfortable on how we're going to turn the year to put us in a position for positive yield growth.\n\nDaniel Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks so much.\n\nOperator\n\nYour next question is from the line of Fred Wightman with Wolfe Research. Please go ahead.\n\nFred Wightman\n\nHey, guys, good morning. There was a comment and sort of the breakdown on the occupancy in the quarter that Europe lagged, Alaskan, Caribbean and I know that that was the plan. But can you just sort of help us think about that European occupancy figure as we move into 4Q and then into next year? Is that going to be a laggard for a while or do you think that that ultimately just catches up with the other markets?\n\nJason Liberty -- Chief Executive Officer\n\nYes. Hi, Fred. No, we think -- I think we mentioned it also in the prior call. We think that and we -- this is really a phenomena of this year, just given what happened earlier in the year.\n\nSo as we look forward, we don't expect that we expect this to be normal. We do have, as I mentioned we did finish 90% in Europe is actually a little bit better than what we expected. And for the fourth quarter, it's really late season in Europe, which typically is a lower occupancy.\n\nNaftali Holtz -- Chief Financial Officer\n\nYes. And just to add, Fred, I think the real trigger in Europe was when the U.S. finally dropped the testing requirement for U.S. citizens to come back in.\n\nAnd unfortunately, that didn't happen until very late spring, and that impacted just the bookings over time. But the ramp-up from when that announcement was made and has not commented that acceleration resulted in us doing better than we had anticipated in the third quarter but it is a high-yielding product and so that mix shift impacts your overall yields.\n\nFred Wightman\n\nMakes sense.\n\nJason Liberty -- Chief Executive Officer\n\nJust to add to that we also had the whole Ukrainian situation which when you think about it -- that came I think pretty much at the beginning of the season so that that was a really pretty significant curveball for bookings for a while.\n\nFred Wightman\n\nMakes sense. And then just quickly on China, no assumption that China comes back online in '23. But what have you guys assumed for the '25 targets for China?\n\nJason Liberty -- Chief Executive Officer\n\nIt's very minimal -- actually, there's no real -- we expect that we will be in China before the end of 2025. In our assumptions around our Trifecta plan, we have not considered that at this point in time.\n\nFred Wightman\n\nOK. Thank you.\n\nOperator\n\nYour next question is from the line of Jaime Katz with Royal Caribbean. Please go ahead.\n\nJaime Katz -- Morningstar -- Analyst\n\nHey, it's Jaime from Morningstar.\n\nJason Liberty -- Chief Executive Officer\n\nHey, Jaime. I was getting excited, Jaime. I was --\n\nJaime Katz -- Morningstar -- Analyst\n\nFirst and curiously as I would be able to delineate maybe what the best cost opportunity is you have out there to control are outside of these transitory things that are pruning back over the next few years.\n\nJason Liberty -- Chief Executive Officer\n\nWell, I think some of that comes into on the inflationary side and our ability to just continue to evolve our very nimble supply chain platform to reduce our costs, and some of that is by being able to do things more locally versus going out and globally source everything, which sometimes can result in us lowering the freight costs and so forth which can improve our cost structure. And then there's also a lot of opportunity on just automation and doing things more efficiently that we also think is an opportunity for us to lower our costs.\n\nNaftali Holtz -- Chief Financial Officer\n\nYes. And I guess that kind of if you take a step back or higher a little bit, it's also as we continue to grow capacity and grow the business, really leveraging the scale and creating the operating leverage, so we can expand the margin.\n\nJason Liberty -- Chief Executive Officer\n\nYes, good point.\n\nJaime Katz -- Morningstar -- Analyst\n\nOf course. And then, as you look at the brands, I know you probably won't bifurcate them. But I'm curious if there are any different demand patterns you guys are seeing between maybe Royal Caribbean and Silversea. Is there any sort of booking pattern differences or pricing power differences, just as we think about different income demographic status? Thanks.\n\nJason Liberty -- Chief Executive Officer\n\nYes. Well, I mean, all three brands are actually doing very well. The Silversea guest is obviously higher-yielding guest, and they tend to book further out which helps us when we think about our booking curve and more mix of Silversea in there. Well, I think the only thing that I would probably just add is you certainly see the -- currently, the drivable market is certainly something that's benefiting our brands or you can see that in the bookings the guests who are willing to drive six, seven, eight hours to their home port is definitely a trend that we have been seeing.\n\nBut this is not a surprise coming out of COVID, and now we're starting to see guests plan their vacations for fly cruise, for example, into Europe much earlier than we saw pre-COVID.\n\nJaime Katz -- Morningstar -- Analyst\n\nThanks.\n\nJason Liberty -- Chief Executive Officer\n\nSure. Thanks, Jaime.\n\nOperator\n\nToday's final question will come from a line of Paul Golding with Macquarie Capital. Please go ahead.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nThanks so much, and congrats on the quarter. I wanted to dive quickly into the marketing, selling, and admin line. It looks relatively flat sequentially, so I'm just trying to figure out here if outside of wave we should think about this returning to normalize structural proportional levels. Is it in addition to TAM unlocking? Is it getting cheaper easier to acquire customers from a marketing cost perspective per unit? And then I have a follow-up.\n\nThanks.\n\nNaftali Holtz -- Chief Financial Officer\n\nYes. No, that's right, and we don't -- we expect this -- as I think we said even in the last quarter earnings, we expect to be normalized in terms of our investment in sales and marketing. We're always thinking about where's the best money to spend which channel, which market. But generally, we expect it to be at normal levels.\n\nJason Liberty -- Chief Executive Officer\n\nYes. And I think the point is -- we're getting much more efficient in our ability to go one-to-one to our customers, but the cost which I know you guys all follow. The costs for SEO and other related marketing activities has gone up there's been an inflation or demand elements that have caused that to go up in our teams have done I think a very great job in finding efficient ways to do that. And we're not having to spend additional marketing dollars to generate demand which really just shows the strength of our brands and the positioning of our deployment which has paid us quite well.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nThanks for that color. And then, thinking about Trifecta and some of the initiatives, I was wondering if there was any sort of order priority among those different initiatives. I'm mostly thinking about your ROIC and earnings relative to deleveraging in light of the carbon-reduction efforts which presumably would carry some amount of costs expense and capital. Thanks.\n\nJason Liberty -- Chief Executive Officer\n\nYes, I wouldn't put them in -- they have different priorities. Of course the ROIC, the EBITDA margin, and leverage and earnings they're all very interrelated. At the same time, we've quadrupled down on what we can do to reduce our consumption the technologies that we can be employing to reduce our carbon footprint. So that is not -- when we look at the lens of making, decision-making it's about what's best for the customer, what's best for our investors, and what's best for the environment and how we make those decisions to make sure that we're optimizing all of them.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nThanks.\n\nJason Liberty -- Chief Executive Officer\n\nThank you.\n\nGreat. So thank you, everyone, for your participation and interest in the company. Michael will be available for any follow-up. I wish you all a great day.\n\nThanks a lot.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael McCarthy -- Vice President, Investor Relations\n\nJason Liberty -- Chief Executive Officer\n\nNaftali Holtz -- Chief Financial Officer\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nBrandt Montour -- Barclays -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nDaniel Politzer -- Wells Fargo Securities -- Analyst\n\nFred Wightman\n\nJaime Katz -- Morningstar -- Analyst\n\nPaul Golding -- Macquarie Group -- Analyst\n\nMore RCL analysis\n\nAll earnings call transcripts"
}