{
  "companyName": "Fortuna Silver Mines",
  "companyTicker": "FSM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/fortuna-silver-mines-fsm-q2-2022-earnings-call-tra/",
  "content": "Fortuna Silver Mines (FSM -0.53%)\nQ2 2022 Earnings Call\nAug 11, 2022, 12:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to Fortuna Silver Mines quarter 2 2022 financial and operational results call. [Operator instructions] It is now my pleasure to turn the floor over to your host, Mr. Carlos Baca, director of investor relations. Carlos, over to you.\n\nCarlos Baca -- Investor Relations Manager\n\nThank you, Jenny. Good morning, ladies and gentlemen. I would like to welcome you to Fortuna Silver Mines and to our financial and operations results call for the second quarter of 2022. Hosting the call today on behalf of Fortuna will be Jorge Alberto Ganoza, president and chief executive officer; Luis Dario Ganoza, chief financial officer; Cesar Velasco, chief operating officer, Latin America; and Paul Criddle, chief operating officer, West Africa.\n\nToday's earnings call presentation is available on the feature presentation box on our homepage at fortunasilver.com. As a reminder, statements made during this call are subject to the reader advisories included in yesterday's news release and in the earnings call presentation. Financial figures contained in the presentation and discussed in today's call are presented in U.S. dollars, unless otherwise stated.\n\nBefore I turn over the call to Jorge, I would like to indicate that this earnings call contains forward-looking information that is based on the company's current expectations, estimates and beliefs. This forward-looking information is subject to a number of risks, uncertainties and other factors. Actual results could differ materially from a conclusion, forecast or projection in the forward-looking information. Certain material factors or assumptions were applied in drawing a conclusion or making a forecast or projection as reflected in the forward-looking information.\n\nAdditional information about the material factors that could cause actual results to differ materially from the conclusion, forecast or projection in the forward-looking information and the material factors or assumptions that were applied in drawing a conclusion or making a forecast or projection as reflected in the forward-looking information is contained in the company's annual information form and MD&A, which are publicly available on SEDAR. The company assumes no obligation to update such forward-looking information in the future, except as required by law. I would now like to turn the call over to Jorge Alberto Ganoza, co-founder of Fortuna.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nThank you, Carlos. Our business continued to perform well in the delivery of production and costs in the second quarter. We prereleased production figures in July 11, both silver and gold are tracking in line with management plans and expectations to meet annual guidance. For the first six months, we produced 129,000 gold ounces and 3.3 million ounces of silver, achieving the middle of our guidance range for the year.\n\nGold accounted for roughly 70% of sales and silver for 20% with byproduct zinc and lead making up the 10% balance. In spite of inflationary pressures on key consumables like diesel, steel, cyanide and explosives and the strain on the supply chain, cost at all our mines are tracking within the range we provided at the beginning of the year for annual guidance. Lindero, Yaramoko and San Jose mines are in the upper range of guidance but within it. But more importantly is the fact that at the Seguela construction, which is 66% complete as of the end of June, today, approximately 70% complete.\n\nWe're not experiencing any deviation with respect to our guided budget and time line. We monitor active construction projects around the world and observe several experiencing challenges leading to significant deviations in capex and time line. The strong delivery at Seguela is the result of good planning, strong construction partners in the selected contractors, a consolidated owner's team and years of experience put to work. I'm very satisfied with the outcome so far.\n\nAnd Paul Criddle, our chief operating officer for West Africa, will provide you with details on the construction further down on the call. On sustainability, health and safety, I want to highlight a quarter free of lost time injuries with over 3.1 million hours worked across all our sites, 0 environmental and social incidence of significance during the period as well. In the quarter, we realized a silver price of $22.62 per ounce and $1,870 per ounce of gold. Our headline financial numbers were a healthy free cash flow of $22 million, mine operating income of $32.5 million, adjusted EBITDA of $58 million with an EBITDA margin of 34%, net income of $1.7 million or $0.01 per share and adjusted net income of $2.1 million.\n\nWe remain well funded to meet our capital demands with a liquidity position of $136 million at the end of the period. I want to say that this has been a difficult quarter for several peer mining companies reporting losses in the period. Although, we met physical targets for gold and silver production and cost targets, as I just described and managed to log a small gain, we came below analyst expectations for earnings per share. Our revenue and earnings this quarter were impacted by the fact that 40% of our revenue comes from concentrate sales where we were exposed to negative provisional pricing adjustments amounting to $6.6 million due to a steep decline in silver prices and zinc prices from April to June, and also impacting earnings was a $4 million inventory write-down of low-grade stockpiles at our Yaramoko mine.\n\nOn the exploration front, we have 12 drill rigs turning across sites with an annual budget of approximately $30 million. We work from a base of consolidated reserves that add up to approximately 4 million gold equivalent ounces as disclosed in our annual result statement. Our exploration priorities are to continue to pursue several high-value opportunities at Seguela, where we keep adding new resources, December deposit with 350,000 inferred ounces being the latest success of that program. The other priority is reserve replacement at the San Jose and Yaramoko mines and also definition of our investment case for the Boussoura Project in Burkina Faso this year.\n\nIn the quarter, we began our share repurchase program with an initial return to shareholders of $3 million. For the execution of the program, we bring into consideration several aspects that include not only our valuation, but also risk to capital demands in a construction year and sensibility of our liquidity position to the current volatility in gold and silver prices. So with that, as an introduction, I'd like to turn it on to -- turn it into our chief operating officer, to give you a bit more color on the business. So Cesar, you want to start?\n\nCesar Velasco -- Chief Operating Officer, Latin America\n\nAbsolutely. Thank you. Thank you, Jorge. In the second quarter, the three operating mines in Latin America delivered a strong production of 1.65 million ounces of silver and 37,600 ounces of gold.\n\nAs you highlighted, for Latin America, production for the first six months in total 3.3 million ounces of silver and a 36,000 ounces of gold. All mines are aligned to achieve annual guidance range. Allow me to make some remarks at the assets. In Argentina, Lindero delivered a gold production of 29,000 ounces, which represents a 49% increase year on year and is on track to achieve annual guidance range.\n\nGold production for the first six months of the year totaled 59,000 ounces. During the second quarter, the operation delivered 99% of the 1.5 million tons of ore placed on the pad by means of the crushing and stacking circuit demonstrating steady production performance. The operation continues to focus on capturing higher productivity opportunities in all processes and has been successful at achieving important reductions on key consumables during the second quarter such as sulfuric acid, fresh make-up cyanide and diesel. Moving on to Mexico, the San Jose Mine delivered 1.38 million ounces of silver and 8,295 ounces of gold.\n\nCompared to the second quarter of 2021, production variations are a result of a combination of 7% lower mill throughput and lower head grades, which are in line with the Mineral Reserve estimates. With the aim to improve production capacity and reduced total mining cost per ton, the operation has successfully implemented long-haul stopping in selected areas of mine. In addition, a new underground shotcrete plant was commissioned, which is expected to reduce overall mining cycle times and support costs. Silver and gold production for the first six months of the year totaled 2.7 million ounces and 16,534 ounces.\n\nThe operation remains on track to achieve its annual production guidance range. The Caylloma Mine in Peru, a steady performer, delivered 267,500 ounces of silver, 10.8 million pounds of zinc and 7.6 million pounds of lead. Production for the first six months totaled 539,000ounces of silver, 21.6 million pounds of zinc and 16.7 million ounces of lead. Production at Caylloma is on track to achieve the upper range of guidance.\n\nBack to you, Jorge.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nThank you, Cesar. Paul, please?\n\nPaul Criddle -- Chief Operating Officer, West Africa\n\nThanks, Jorge. Operations in West Africa continued their solid performance in Q2 and are tracking well with respect to our plans and budgets, ongoing worldwide inflationary and supply chain pressures did not impact operations in Yaramoko nor the construction progress at Seguela. At the Yaramoko Mine, second quarter gold production of 24,553 ounces was in line with the plan, leaving the operation in a strong position with a year-to-date production of 52,788 ounces on target to meet the upper range of annual guidance. Moving to Cote d'Ivoire, on our construction progress at Seguela continues to be steady and in line with plan.\n\nAs of June 30, the project is 66% complete and approximately $96 million of the $173 million initial capital budget is accrued. Construction activities are progressing on time and on budget with first gold pool projected for mid-2023. The project continues to be derisked having advanced through the critical bulk earthworks phase and now advancing key above-the-ground scopes to notable milestones been. The mining services contract was signed with Mota-Engil and long lead fleet ordered, currently consolidated in Europe and awaiting shipment to the plans of the third quarter.\n\nMota has commenced establishing their facilities as well as the mobilization of its management team to site. The project critical path processing plant EPC is on track at 70% completion. While HV grid connection scope is advancing just ahead of the plan at only 1% completion. The majority of equipment packages have been secured and first deliveries of Abidjan become arriving on site.\n\nAll major construction contract and mobilizations are underway with the critical S&P contractor now on site. Water storage embankment is complete, and we're now harvesting water ahead of commissioning activities with 75,000 cubic meters currently stored. The first structural steel shipments have begun to arrive at site. In parallel with the excellent progress on the ground, operational readiness scopes are advancing well with the operations team and system continuing to be established.\n\nA key member of the operational team, the General Manager of operations, was hired during the quarter with progress on the next level of management staffing advancing according to the plan. Dialogue is open and ongoing with the mines and budget ministries in Cote d'Ivoire around the negotiation of Seguela's Mining Convention. Back to you, Jorge.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nThank you. Luis, you will provide a financial update.\n\nLuis Dario Ganoza -- Chief Financial Officer\n\nYes. So sales were -- for the quarter were $167.9 million. This is a 9% increase over Q1 2021 -- I'm sorry, Q2 2021. The higher sales were driven by the contribution of Yaramoko with $45.9 million in the quarter and sales have been net of $57.2 million, which were 67% higher than Q1 -- Q2 2021 and representing an additional $23 million to our top line.\n\nThis was partially offset by lower sales of San Jose of 34%, representing a decrease of close to $21 million in sales. This decrease at San Jose was driven by lower silver prices and concentrate sales adjustments in the context of declining prices throughout the quarter and lower production probably in line with our guidance for 2022. Our average provisional realized prices in the quarter were $18.70 per ounce for gold compared to $18.12 in Q2 2021 and $22.6 per ounce for silver compared to $26.9 in Q2 2021. Prices during the quarter, however, experienced, as Jorge mentioned, the steady decline, triggering $6.6 million of negative concentrate sales adjustments, a onetime effect, typical experience at points of inflection, metal price trends.\n\nAround $3.5 million of this impact is provisional mark-to-market at the end of June. On a comparative basis, our accounting results are lower than Q2 2021 in spite of higher sales due to a reduction in operating income at our San Jose Mine, which is not entirely offset by the contribution from Yaramoko in the quarter. A large contributor to this effect is the increased accounting depletion at Yaramoko that comes with purchase price accounting. With respect to operating costs, the quarter reflects the overall impact of inflationary pressures with higher costs, in particular at Lindero and San Jose.\n\nIn relation to our cost guidance on a consolidated basis, we estimate the impact to be around 5% of our cost saves. The G&A line item in our income statement of $14.8 million increased $5.6 million over the prior year. Page 12 of our MD&A provides a breakdown of our G&A, which includes added nine general and administrative expenses from Lindero and Yaramoko as well as higher corporate G&A. Corporate G&A expense in the quarter is close to the $8.1 million.\n\nWe expect our run rate to be in the range of $6 million to $7 million. Other items that impacted the quarter included an inventory write-off of low-grade stockpiles at Yaramoko. This was mentioned by Jorge and an FX loss of $3 million, mostly unrealized and related to the impact a weaker euro has in our VAT collectible balances at our operations in Burkina Faso as the local currency is expect to the euro. Our effective tax rate for the quarter was particularly high, mostly due to timing of withholding taxes.\n\nOur year-to-date effective tax rate at 42% was in line with our expectations for the year. An additional item worth noting on the income statement is a $5.9 million gain on the area of derivatives, which consisted of $6.4 million of unrealized gains and $0.6 million realized loss. The unrealized gain was driven by the drop in zinc prices in the quarter. EBITDA of $57 million was 5% above Q2 2021, but $23 million below our EBITDA in the prior quarter as a result of lower sales and higher costs.\n\nWe reported strong free cash flow of $21.9 million in the quarter and $31 million year-to-date. This is free cash flow from ongoing operations before expenditures in new construction such as Seguela. On the balance sheet, we closed the quarter with $136 million of liquidity with $20 million undrawn under our $200 million revolving credit facility. Our total net debt, including the outstanding convertible debenture, is $110 million, which provides a very modest debt leverage.\n\nOn the Seguela Construction, we funded $23 million in the quarter and $64 million year-to-date. On a project to date basis, we have funded close to $100 million of the $174 million of total initial capital declared. Back to you, Jorge.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nOK. That's all for management. Carlos?\n\nCarlos Baca -- Investor Relations Manager\n\nThank you, Jorge. We would now like to turn the call over to any questions that you may have.\n\nOperator\n\nThank you. [Operator instructions] Thank you. The first question is coming from Trevor Turnbull of Scotiabank. Trevor, please ask your question.\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nThank you. Jorge, you mentioned, I think, in your write-up that there were some optimization projects at Lindero that would help potentially reduce some of the input costs that you have at the SART plant, and I just wondered, if you could talk a little bit about the timing of those projects and maybe how much of a benefit you would expect to get out of that in terms of cash cost savings?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nYes. I can allow Cesar here, Trevor, to provide some detail on those optimization cost initiatives. But I think right now the center one is the optimization of the SART plant, which allows us to significantly reduce makeup cyanide in the system. We budgeted in our feasibility study and in guidance -- in our budget, I am sorry, cyanide in the range of 0.5 kilo per ton and our expectation is that we can be a quarter of a kilo per ton.\n\nSo and that also comes with more efficient use of sulfuric acid, which is a region that we use in the SART in the feasibility study and we have about 1.6 kilos per metric -- per cubic meter of solution. And in the budget, we budgeted about 1.2 and we are currently delivering under a kilo per cubic meter. Cesar, you want to expand on a few of the other initiatives that you have?\n\nCesar Velasco -- Chief Operating Officer, Latin America\n\nCertainly, Jorge. As you mentioned, cyanide is one of the key aspects here. We also have some significant improvements in the sulfuric acid consumption in -- of -- when compared to the feasibility study, we are in the range of the 40%, 46% below in consumption versus feasibility. So that we expect a full impact on cost reduction for the year by the end of the year as well and we have increased significantly our haulage productivity, as well as lowering the diesel consumption for our mining fleet, which in today's prices obviously has a significant impact in the total cost.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nYeah. The Lindero Mine is -- costs are competitive in the range of $1,100 per ounce, all-in sustaining. That all-in sustaining still being impacted somewhat by corrective maintenance, the initiatives that we still have ongoing, seeking some of the productivity that we have. But as we advance and I believe that costs should start gravitating more toward the lower end of $1,100, $1,000 that range.\n\nWe still have a fair amount of work on the side of corrective maintenance and whatnot that weighs on our all-in sustaining costs. Some of the legacy of the difficult commissioning phase through the COVID pandemic, right? But I can say that, in short, the mine continues to perform well within our guidance and in a competitive range for cost, $1,100, all-in sustaining, in spite of all of that work that we are still carrying right, yeah.\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nNo. That sounds good. I appreciate the details. I had one other question about West Africa, and again, you would mentioned, the Sunbird resource that came in as a satellite deposit, where you put out the first inferred resources.\n\nI was just wondering, if we should look for another satellite deposit that you might be targeting that we might see a first resource maybe next year on one of the other deposits?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nOne of the things that was the driver for the acquisition on business combination with Roxgold was our strong view of the potential of Séguéla to continue to produce this type of opportunities, like, we are materializing with Sunbird, right? Sunbird currently stands in the first resource estimation at 350,000 ounces of gold with grades of around 3.6. But those grades are masking a higher grade ore, where we are already considering advancing with an underground mine plan for higher grade ore. Sunbird remains open. We published in the quarter some exceptional drill results outside of the existing shell of inferred resources that encompass the 350,000 ounces.\n\nSo we believe there is -- Sunbird will continue to grow. Outside of that, specific to your question, yes, we have about 40 targets in our inventory right now. We are drilling some of those. We look forward to publishing results.\n\nBut we have an ongoing drill program testing targets outside of the deposits we currently have, Antenna, Ancien, Koula, Agouti and Sunbird now, right? So outside of those, we -- yes, we are currently drilling and pursuing more of these satellites. We believe we have 30 kilometers of -- the 30-kilometer stretch along the corridor, the structural corridor that hosts Séguéla and within those 30 kilometers we have at 40 targets in our inventory, and we are pursuing that with drilling. And sometimes companies slow down exploration as they embark in construction, that's not something that we have done. We rate this as high value opportunities and while we are building, we continue drilling aggressively.\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nOK. Yeah. Look forward to seeing drill results from some of these other targets. That's all I had, though.\n\nThank you, Jorge.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nThank you, Trevor.\n\nOperator\n\nYour next question is coming from Don DeMarco of National Bank Financial. Don, please ask your question.\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nThank you, Operator, and good morning, Jorge and team. Just continuing on with West Africa, could you tell us a little bit more about the QV Prime zone at Bagassi South, I see that you are planning to do earlier development there? And maybe if you could just talk about how much incremental capex you might be spending there in 2022 and what it means for production in 2023 and 2024?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nYes. QV Prime today is about 30,000 ounces of gold in our inventory and we are advancing this year with the development of QV Prime to provide further flexibility to the mine in 2024,- sorry, in 2023. So we are also contemplating a change in mining method that will allow us to reduce costs as we mine this resource. We have brought into the budget for development this year $7 million that was not included in our budget and capital guidance at the beginning of the year.\n\nBut we have assessed with Paul and team that this will be very welcome flexibility into 2023.\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nOK.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nThe team has developed a very sensible plan around the change in mining method and we are moving ahead with it. There is nothing like giving flexibility to an underground mine and that pays off, right?\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nOK. Thank you. So maybe an incremental $7 million. I appreciate that.\n\nSo speaking of mine that is and shifting over to San Jose, you have implemented long-haul stope at San Jose. Looking forward, would we expect to see an increase in tonnage or maybe decreasing grades if tonnage were to increase in the coming quarters?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nNo. No. That is not in our plan. At San Jose, what we -- as we have been mining through the reserves over the years, what we are experiencing is a narrower production zones.\n\nAnd when I mean narrower, five years ago at San Jose, we -- our stopes were 20 meters wide. Today, they are more three-meter wide, five-meter wide, right? So the change in mining method just assist us in guaranteeing that we can meet the nameplate capacity of the plant. So we experienced in the quarter 7% less throughput compared to a year ago. But the reason for that was that through the quarter we experienced three days of non-continuous blockades that impacted production for roughly five days, right Blockading international sport in Oaxaca, so all of those issues were resolved and everything is good.\n\nBut that's why we saw the shortfall of 7% in throughput compared to what we planned and compared against the year. But the change in mining method is providing higher flexibility to the operation in meeting throughput and lowering cost and making a bit more efficient as well, right?\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nOK. OK. That's good. And if I ask a final question then, you mentioned Lindero, cost actually fairly attractive $1,150 in Q2.\n\nBut it was noted in the report that the inflationary pressures are most pronounced at Lindero. Why is that, what is specific to Lindero versus the other mines, is it because of the higher cyanide costs specifically?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nYeah. It really has to do with the higher dependence in the cost structure related to certain key consumables, mainly cyanide, P cells, sulfuric acid. That's the key reason.\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nOK. OK. Well, thank you very much. That's all for me.\n\nOperator\n\nThank you. Your next question is coming from David Kranzler of Investment Research Dynamics. David, please ask your question.\n\nDavid Kranzler -- Investment Research Dynamics -- Analyst\n\nHi, guys. Thanks for taking my call. I just have a couple of quick questions. Do you know offhand how much of the variance in operating income between the second quarter of 2021 and second quarter of 2022 is attributable to the lower average cost of silver in 2022?\n\nLuis Dario Ganoza -- Chief Financial Officer\n\nHow much is attributable to the lower price of silver? Yeah, I will say, if you give us a second, we can be more precise here. But the lower price of -- the lower sales. I will give you my, out of top of my head, potentially 40% of that lower operating income is just the price of silver, right? But that we probably can do a better job in terms of silver down 16%...\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nGiven down the number.\n\nLuis Dario Ganoza -- Chief Financial Officer\n\nYeah. Silver is down roughly 16%. Gold is fairly unchanged. But silver is down 15%.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nYeah. From $27 to $20 right around $21 I think. You also have to consider the effect that, I mean, we disclosed those average provisional prices for the metal. But as we emphasize the adjustments on concentrate sales, which come particular from San Jose contract, let's say, where the silver production comes from have that compounding effect.\n\nSo yes, on the top of my head, I would say around 40%.\n\nDavid Kranzler -- Investment Research Dynamics -- Analyst\n\nOK. Great. So I mean, I guess, assuming that the price of silver goes back up, which is why everyone would invest in Fortuna, not everyone, but one of the reasons. This potentially is just a one-time thing, again, assuming the price of silver goes higher?\n\nLuis Dario Ganoza -- Chief Financial Officer\n\nCertainly. Fairly depending on, right, your expectations on the silver price.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nYes. I mean we delivered the ounces and the cost and this is a business driven by physical metrics, right?\n\nDavid Kranzler -- Investment Research Dynamics -- Analyst\n\nThat's right. And then the second question has to do with that $4 million write-down of the low grade stockpile at Yaramoko. Is that kind of a one-time thing, did you write it down enough so that if the price of gold maybe is a little bit lower, stays the same, that won't happen again?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nDavid, the short answer is that, for raw material purposes, yes. We expect this to be a one-time thing and it has to do with the way those historic inventories, which stockpiles which are quite large, over 100,000 tons have been accounted to basically based on an average cost accounting basis, where that's not necessarily the logic behind the economics of taking those stock -- accumulating those stockpiles on the service, right? It's done more on an incremental cost, so the mining cost of that is, regarding the same cost to a large extent. So in -- two things, one is that, we don't expect to accumulate much more of that low grade ore at the Yaramoko and any significant amount. And second, we are going to be addressing the way we account for those inventories.\n\nSo we don't expect anything of that size going forward. If anything, it should be something much lower significant.\n\nDavid Kranzler -- Investment Research Dynamics -- Analyst\n\nOK. Great. And then just a quick follow-up on that, is that low grade stockpile, is that something that could be processed profitably if we get lucky in the price of gold moves, say, over $2,000 an ounce?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nSo, absolutely, all of that is -- metal content in those stockpiles is above the processing tariff, yes. So our current prices that are -- that is profitable, I mean, stockpile to process and right in principle of the tail of the life of mine.\n\nDavid Kranzler -- Investment Research Dynamics -- Analyst\n\nGreat. Thank you very much, and Jorge, I am sure I will have more questions for you tomorrow on the Arcadia Economics podcast. Thank you.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nLook forward to that. Thank you.\n\nOperator\n\nThank you very much. Your next question is coming from Ronald Brandstetter, a private investor. Ronald, please ask your question.\n\nUnknown speaker\n\nOK. Hey. Thanks, guys, for taking my call, Jorge and team. Most of my questions have been answered, but I wanted to ask about Yaramoko.\n\nWhen I look at the last four quarters, the all-in sustaining costs have experienced some rather significant variations. I guess, two questions, what's driving that and should we expect that variance to continue to be the case in the coming quarters and years?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nHey. Well, I can give a first pass to that answer and then allow Paul to elaborate a bit further. But what we are seeing with Yaramoko and then I have a -- it's a question that has come up before from Roxgold shareholders from the past, is in fact that the great profile of the mine has been declining consistently with the reserves. So therefore, we -- the mine has been producing less ounces, right? We are mining in the range of 5 grams, 6 grams, 6 grams to 7 grams, and therefore, the mine has been producing less ounces.\n\nIf we look at the cost on a per ton basis, which is really what we manage from the operations point of view, costs remain very steady at around $160 -- in the range of $160 per metric ton. On top of that, we might have some capital. But I want to say that, on the cost side, on a per ton basis, the mine has been performing very steadily over the last four quarters or a year. From an all-in sustaining perspective, the lower ounces, the capital requirements impact costs from the perspective of all-in sustaining.\n\nPaul, do you want to elaborate more?\n\nPaul Criddle -- Chief Operating Officer, West Africa\n\nYeah. I think very much in line with what Jorge saying, Ron. The mine -- the mine's capital density relative to the gold production changes at depth. The strike length has come in, so it's shorter.\n\nBut we are still having to develop the decline at the same rate to access at the bottom of the mine. So yeah, that relative to gold production we are looking, I think, where it is. I think it will be fairly consistent with where it is now for the next little while before the mine turned into a harvesting mode, i.e., we get to the bottom of the mine. We stopped developing the decline and then those costs come way down for the last 12 months, 18 months of the mine's life, while we are just in stoping harvesting mode.\n\nSo I don't anticipate any increases until we get to the bottom of the decline.\n\nUnknown speaker\n\nOK. OK. So you are incurring some expenses. Along those lines, did the $4 million write-down during the quarter was that -- did that impact the all-in sustaining cost?\n\nPaul Criddle -- Chief Operating Officer, West Africa\n\nThe answer is yes to the question.\n\nUnknown speaker\n\nOK. OK. Look forward to that.\n\nPaul Criddle -- Chief Operating Officer, West Africa\n\nSo both the stockpile write-down and as per the question of Don earlier, the additional capital to develop across QV Prime is included in the quarter and the forecast for the year, which still tracks within our guidance.\n\nUnknown speaker\n\nOK. OK. That's all I have. Thank you.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nIf I may address a prior question on the impact of the silver price on the operating income drop of around $10 million. I just want to confirm that, yes, silver price, let's say, would have been within 40% to 50% of the overall drop in operating income and that will be coming, as I mentioned, mainly from San Jose, yes.\n\nOperator\n\nThank you very much. Your next question is coming from Adrian Day of Adrian Day Asset Management.\n\nAdrian Day -- Adrian Day Asset Management -- Analyst\n\nYes. Good afternoon. Listen, I may have missed it at some point, but I just wondered, if there was any kind of update on San Jose with regard to the lawsuit and the discussions that you were having with SEMARNAT and others?\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nHey, Adrian. Good morning. Short answer is, no. We still in the court procedure, where we are appealing to revoke that resolution.\n\nWe are of the strong view and it's a view that gets stronger as the process advances. That -- just without discussing the fundamentals, just the form that they used renders that resolution invalid, right? Just by mere procedure, that resolution reducing the term of our EIA is invalid. So we have a high expectation or a degree of conviction that there is a fatal flaw in how the Secretary of Environment Office produced that resolution impacting the term of our EIA and although, I am cautious, because we still need to hear from the judge. And the fact that the judge was quick to grant the company stay of execution and protection.\n\nIt's also a positive sign that we take positively. But in essence, there have been no changes, we have not heard from the court. We expect we should be hearing from the court this year.\n\nAdrian Day -- Adrian Day Asset Management -- Analyst\n\nOK. OK. Thank you.\n\nOperator\n\n[Operator instructions] OK. We appear to have no further questions in the queue. I will now turn it back over to management for any closing remarks.\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nThank you, Jenny. If there are no further questions, I would like to thank everyone for listening to today's earnings call. We look forward to you joining us next quarter. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCarlos Baca -- Investor Relations Manager\n\nJorge Alberto Ganoza -- President and Chief Executive Officer\n\nCesar Velasco -- Chief Operating Officer, Latin America\n\nPaul Criddle -- Chief Operating Officer, West Africa\n\nLuis Dario Ganoza -- Chief Financial Officer\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nDavid Kranzler -- Investment Research Dynamics -- Analyst\n\nUnknown speaker\n\nAdrian Day -- Adrian Day Asset Management -- Analyst\n\nMore FSM analysis\n\nAll earnings call transcripts"
}