{
  "companyName": "PubMatic, Inc.",
  "companyTicker": "PUBM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/pubmatic-inc-pubm-q3-2022-earnings-call-transcript/",
  "content": "PubMatic, Inc. (PUBM -0.70%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nStacie Clements\n\nGood afternoon, everyone, and welcome to PubMatic's earnings call for the third quarter ended September 30, 2022. This is Stacie Clements of The Blueshirt Group, and I'll be your operator today. Joining me on the call are Rajeev Goel, co-founder and CEO; and Steve Pantelick, CFO. Before we get started, I have a few housekeeping items.\n\nToday's prepared remarks have been recorded, after which Rajeev and Steve will host live Q&A. [Operator instructions] A copy of our press release can be found on our website at investors.pubmatic.com. I would like to remind participants that during this call, management will make forward-looking statements, including, without limitation, statements regarding our future performance, market opportunity, growth strategy and financial outlook. Forward-looking statements are based on our current expectations and assumptions regarding our business, the economy and other future conditions.\n\nThese forward-looking statements are subject to inherent risks, uncertainties and changes in circumstances that are difficult to predict. You can find more information about these risks and uncertainties and other factors in our reports filed from time to time with the Securities and Exchange Commission, including our most recent Form 10-K and any subsequent filings on Forms 10-Q or 8-K, which are on file with the Securities and Exchange Commission and are available at investors.pubmatic.com. Our actual results may differ materially from those contemplated by the forward-looking statements. We caution you, therefore, against the line on any of these forward-looking statements.\n\nAll information discussed today is as of November 8, 2022, and we do not intend and under obligation to update any forward-looking statements, whether as a result of new information, future developments or otherwise, except as may be required by law. In addition, today's discussion will include references to certain non-GAAP financial measures, including adjusted EBITDA and non-GAAP net income. These non-GAAP measures are presented as supplemental informational purposes only and should not be considered as substitute for financial information presented in accordance with GAAP. A reconciliation of these measures to the most directly comparable GAAP measures is available in our press release.\n\nAnd now, I will turn the call over to Rajeev.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nThank you, Stacie, and welcome, everyone. As we suspected, Q3 marked an inflection point with respect to a deteriorating economic environment. However, despite the impact on global ad spend, we delivered adjusted EBITDA margins of 39%, above our expectations, and significant free cash flow, highlighting the durability and differentiation of the PubMatic business. Year-over-year revenue growth in the quarter was lighter than we expected and more pronounced in the back half of the quarter, including in the U.S., which is our largest market.\n\nOn the bottom line, our single omnichannel platform with fully owned and operated infrastructure gives us a high degree of operating agility to create leverage in our business and sustainable profitability. Despite the near-term economic pressure, I am confident in the medium- to long-term outlook for PubMatic because of our ability to consolidate activity on our platform and grow our market share. Historically, we have seen that in times of economic stress, our ecosystem leans into deeper partnerships with technology leaders that provide innovation, efficiency and automation. Our customers and prospects want to do more with fewer, trusted partners.\n\nWe are well-positioned to continue to gain market share in this kind of an environment, even if absolute rates of growth are lower. Our high-margin profile is a distinct competitive advantage and allows for continued though selective investment. With that investment, we widen the competitive gap and further strengthen our market leadership with a focus on positioning ourselves well for the economic upswing that will inevitably return. Our role in the ecosystem is only getting stronger.\n\nI co-founded PubMatic with the mission of delivering a more profitable digital advertising business to publishers so they can invest in the content experiences we all love. We built our platform to help publishers monetize their inventory across ad formats and geographies while providing the tools and levers to control how their inventory enhances our access. Today, we partner with nearly 1,600 publishers, which provides a critical scale required by global ad buyers. Our growth and market leadership stems from years of investment and focus in both technology and strong customer relationships, which is difficult to replicate.\n\nToday, as consumer privacy is increasingly important and third-party cookies are going away, sell-side technology is becoming even more critical to the digital advertising ecosystem. This is manifesting in a variety of ways, all of which strengthen PubMatic's long-term outlook. There's no question that the open internet is gaining share of digital ad budgets at the expense of walled gardens, in part due to content quality and diversification. This, along with the shift to fast-growing video and connected CTV formats, is foreseeing buyers and publishers alike to seek greater transparency into and control over their advertising strategies, which independent technology providers like PubMatic are best positioned to provide.\n\nFinding target audiences and delivering relevant ads in a privacy safe manner is evolving rapidly. The need for publishers to leverage their audience data at scale is increasingly moving to open and transparent sell-side technology platforms like PubMatic and coincides with our multiyear investment in PubMatic Connect. Without a technology partner like PubMatic, the majority of publishers will not be able to do this, which is becoming fundamental table stakes in commanding higher CPMs and monetizing premium inventory. PubMatic Connect offers a variety of methods for buyers to find target audiences across our publisher base.\n\nCase study after case study shows that PubMatic Connect audiences provide greater ROI and longevity than cookie-based solutions. For example, Wunderkind ran a month-long test campaign using audiences sourced through PubMatic compared to various alternatives. Performance metrics showed audiences delivered via PubMatic Connect had response rates nearly nine times those of alternative data used. Plus, PubMatic delivered impressive win rates and scale benefits.\n\nThese performance benefits highlight the value that marketers see in moving their targeting efforts to the sell side, closer to the publisher and the consumer. What's more, our strength in data activation and addressability is also unlocking growth opportunities in the fast-growing retail media market. As retailers are increasingly looking for incremental revenue opportunities, data monetization becomes an even more important aspect of their businesses. Kroger Precision Marketing, for example, works with PubMatic as a scalable technology provider to help their brand and agency clients to activate their retail data science and CTV, video and display inventory.\n\nThis also allows PubMatic's buyer and publisher customers to gain improved campaign performance and monetization opportunities using our sell-side platform. Agencies and advertisers are seeking greater control and efficiency of their ad budgets. Supply Path Optimization, or SPO, is a way for buyers to consolidate ad spend and gain greater control and efficiencies. We pioneered SPO several years ago, and it continues to grow as a share of our business.\n\nIn Q3, over 30% of activity on the PubMatic platform was SPO-related. We continue to expand SPO relationships as we did with Havas Media Group North America in Q3, adding new capabilities, workflows and data integrations for buyers. In September, we acquired Martin to bring more robust solutions to buyers and accelerate our SPO efforts. Martin brings robust measurement and reporting capabilities, as well as workflow tools and is in direct response to what buyers are looking for.\n\nWe have begun the integration process and we expect Martin to accelerate our product road map by up to 12 months. We expect the end result to be increased consolidation of ad budgets onto PubMatic. Connected TV is moving from insertion orders to a programmatic approach. Both buyers and streaming content providers are leaning into the efficiency, measurability and scale that automation can provide.\n\nI expect the challenging economic environment will accelerate the shift. Advances in data-driven advertising technology like Connect will further fuel the growth of programmatic CTV. As automated buying of CTV becomes ubiquitous across the ecosystem, we are seeing more interest in programmatic buying or unified auctions. As an omnichannel platform, we have been singularly focused on scaling this automated approach to CTV buying and selling.\n\nNo surprise, the results are compelling. Finecast, a subsidiary of WPP focused on addressable TV buying, bought 10% more inventory when compared to nonprogrammatic approaches as a result of the application of data, automation and the granular inventory access our platform provides. Advances in data-driven advertising technology, like Connect, will further fuel the growth of programmatic CTV. We recently released a suite of enhanced capabilities for OpenWrap OTT, helping publishers drive more revenue and increase flexibility and control while also making it easier to extend their monetization strategies to CTV.\n\nMulticultural media company, My Code, saw benefits from managing all of their inventory types in one place, allowing them to compare, manage and optimize across platforms. Similarly, True Digital, a business unit of the leading telco conglomerate in Thailand, saw increased fill and higher CPMs for their CTV inventory with OpenWrap OTT. Stepping back, we've built a resilient software business that enables publishers and buyers to grow their businesses and compete effectively in the digital advertising ecosystem. Our platform is sticky as our usage-based model drives high net dollar retention rates and increased ad spend from buyers.\n\nI have never been more confident in our business and the endless opportunities ahead. We continue to move toward our long-term goal of 20% market share. Propelling this forward is our historical and long-term commitment to the dual objectives of revenue growth and profitability. Our strong profit margins and free cash flow generation give us the ability to invest in products and customer relationships even in today's down cycle when others may not.\n\nAccordingly, in this environment, we are focused on two operating objectives: first, continued investment in long-term innovation. This unlocks incremental revenue opportunities today, but more importantly, should result in outsized gains when ad spending inevitably reaccelerates. Key areas of innovation include supply path optimization, accelerated by our acquisition and integration of Martin, CTV, addressability and retail media. And second, we are focused on maximizing the efficiency of our capex and opex investments that have already been made.\n\nOver the last three years, we believe we have expanded our competitive moat as a result of significant capex investments in our infrastructure and impression processing capacity. We are now focused on optimizing our infrastructure and increasing utilization, which will allow us to materially reduce next year's capex spend. On the opex front, we feel confident with the scale of our go-to-market teams in the near term and will lower the rate of headcount growth with a bias toward selective hiring in engineering and innovation in order to be well-positioned for when ad spend growth reaccelerates. Our long track record of profitable growth and significant cash flows, coupled with our strong balance sheet and zero debt, gives us confidence that we will come out of the downturn stronger than most.\n\nI'll now turn the call over to Steve Pantelick, our CFO, to walk through the financials.\n\nSteve Pantelick -- Chief Financial Officer\n\nThank you, Rajiv, and welcome, everyone. In Q3, we delivered outstanding profit and cash flows. Although revenue came in light due to global ad spend deceleration, we continue to gain market share. These operating results underscore the robustness of our business model and our team's proven ability to navigate challenging macro conditions.\n\nImportantly, amid these conditions, we made targeted investments for future growth and strengthen our financial position. On revenues of $64.5 million, we achieved adjusted EBITDA of $25.3 million, a 39% margin. We generated $28.1 million in net cash from operating activities and $10.7 million in free cash flow. It is clear from economic data across the globe that conditions have worsened over the last several months.\n\nIn all likelihood, some markets are already in recession or soon will be. With this backdrop, I want to remind investors about several fundamental reasons why we are confident that we can continue to navigate through the current headwinds and be well-positioned to accelerate our growth when the operating environment stabilizes. First, our business is well diversified. Our omnichannel platform supports numerous programmatic ad channels and formats, enabling thousands of advertisers across 20-plus verticals to reach the audiences they want.\n\nWith more than 60,000 advertisers purchasing our publishers' inventory in Q3, we saw spending in aggregate across the top 10 ad verticals increased approximately 19% year over year. The impact of diversification was clearly demonstrated. Travel, food and drink and business were each up over 40% year over year, which helped offset softness in shopping, technology and personal finance. Our Q3 omnichannel video business grew 45% year over year and represented 34% of revenues.\n\nThis growth is particularly notable as it was on top of 80-plus percent growth in the prior year. These results were propelled by our CTV business, which increased by over 150% year over year. This achievement marks the sixth straight quarter of 100%-plus growth for CTV. Display revenues declined 3% year over year.\n\nHigh levels of inflation, recession concerns and rising cost of capital put pressure on consumers and advertisers. These factors particularly affected demand for the display format more than other formats. We saw a similar pattern in the depths of the pandemic, and based on our prior experience, we anticipate that this format will return to growth. Our total Q3 revenues grew 11% on top of prior year's 54% growth.\n\nWe believe we are outpacing market growth and gaining share based on the results of other public companies in our industry that have reported thus far this quarter. PubMatic's U.S. business grew double digits year over year but decelerated compared to Q2's growth. EMEA's growth slowed as anticipated.\n\nWith the likelihood that difficult economic conditions will continue in the coming quarters, the durability and strength of our financial model is the second fundamental factor that gives us confidence we can successfully manage through this volatile period. To begin with, we have built a business with a high degree of control over our unit economics. For example, through innovation and focus, we have been increasing our revenue mix toward high-value channels and formats like mobile and video. We saw the benefit of this in Q3 with higher video CPMs offsetting lower display CPMs.\n\nOverall, our total company CPM was stable year over year. In terms of unit costs, by owning and operating our infrastructure, we have multiple ways to optimize and drive down our unit costs. One important lever is having control over the magnitude and timing of infrastructure capex. Over the last two years, we have strategically invested to grow our competitive moat and ensure we avoid supply chain disruptions.\n\nSince Q1 '21, we have more than doubled our ad processing capacity. Looking ahead to 2023, we see many opportunities to optimize our infrastructure and expect to be able to significantly lower our capex. In aggregate, we anticipate these efforts will lead to higher gross margins and improve free cash flow margins as ad spending normalizes. Another area of strength comes from our usage-based model, which aligns incentives and leads to long-term relationships with the world's leading publishers and buyers.\n\nInnovation, customer focus and initiatives like supply path optimization helped us achieve strong net dollar-based retention. On a trailing 12-month basis, our net dollar-based retention was 120%. PubMatic has consistently achieved high adjusted EBITDA margins and profits. Q3 was our 26th consecutive quarter of positive adjusted EBITDA.\n\nFor 19 of the last 20 quarters, we have generated positive cash from operating activities with the only exception being the pandemic quarter of Q2 2020. For the trailing 12 months through Q3, we generated approximately $96 million in cash from operations and $50 million of free cash flow, which represented a growth of 40% and 91%, respectively, compared to the prior-year period. At the end of Q3, we had no debt and $166 million in cash, cash equivalents and marketable securities. Excluding our recent acquisition of Martin, our overall ending Q3 cash position would have been $194 million.\n\nWith our strong balance sheet and efficient business model, we believe our position in the ecosystem will continue to grow via new and expanded customer relationships. We also anticipate being able to strategically invest in future growth opportunities where others may be constrained. Beyond our current balance sheet, we have enhanced our financial resources with a new $110 million undrawn committed credit facility. The third fundamental factor that gives us confidence in our future is our proven innovation engine.\n\nWe have built this competency over the last 16 years and have consistently invested in high ROI growth opportunities. We have a distinct advantage as a result of our development organization in India. In Q3, we increased our India-based headcount by 46% year over year, compared to a global headcount increase of 29%, supporting further innovation and cost efficiency in 2023 and beyond. One important area where we continue to innovate and lead is in supply path optimization.\n\nIn Q3, SPO represented over 30% of activity on our platform. With our recent acquisition of Martin, we added key technical talent and new tools to fulfill buyer requests for more robust measurement and reporting capabilities. In spite of the top-line headwinds that increased through the quarter, our Q3 adjusted EBITDA came in above expectations. We achieved this outcome because we have significant control over our cost structure and have been proactive over the last several months optimizing costs across the company while adjusting discretionary spend.\n\nOperating expenses in the third quarter were $33.3 million, up 19% year over year, reflecting the combination of increased headcount for growth and stock-based compensation. Q3 GAAP net income was $3.3 million. Note, Q3 net income includes a noncash impairment charge of $6.4 million related to an equity investment made several years ago. Non-GAAP net income, which adjusts for unrealized gain or loss on equity investments, stock-based compensation expense, acquisition-related and other expenses and related adjustments for income taxes, was $12.4 million or 19% of revenue.\n\nQ3 diluted EPS was $0.06, and non-GAAP diluted EPS was $0.22. Turning to Q4. The softness in advertising demand that began early in the year has continued. It is clear that advertisers are wrestling with a myriad of economic challenges and preparing their businesses for the likelihood of a global recession.\n\nWe expect these impacts to persist at least through the first quarter of 2023 and possibly longer. Nonetheless, based on the unique strengths of our business, our omnichannel platform, our financial strength and our ability to continue making investments in innovation, we anticipate continue to grow faster than the market. Q4 headwinds include continued pressure on our display formats that will be disproportionately impacted by macro conditions. We also expect Q4 seasonality to be muted with lower-than-normal holiday ad spend.\n\nIn terms of tailwinds, we anticipate our omnichannel video revenues will continue to grow and SPO activity to increase. Given the range of macroeconomic pressures, we believe there could be a wider range of outcomes in Q4 than we typically see, especially as our Q4 revenue tends to be back-end-weighted. Our revenue expectations for Q4 are $75 million to $78 million. This guidance is consistent with the rate of year-over-year growth we have seen in the month of October.\n\nAs communicated last quarter, we proactively initiated cost-saving measures to unlock several million dollars by the end of the year relative to our original planned expenses. This agile execution and strong unit economics supports our high margin rate now and in the future. We expect adjusted EBITDA between $33 million and $36 million or approximately 45% margin at the midpoint. Note, included in our Q4 adjusted EBITDA expectations are the incremental operating costs of approximately $1 million for our recent Martin acquisition.\n\nBased on our Q4 revenue guidance, the applied full year revenue range is $257 million to $260 million or 14% growth at the midpoint. With digital advertising projected to grow less than 10% in 2022, we are well-positioned to continue to grow our market share. Consistent with the revenue range and cost-saving plans already in place, we anticipate our full year adjusted EBITDA range to be between $98 million and $101 million or 38% margin at the midpoint. We anticipate capex between $34 million and $36 million this year.\n\nBased on equipment availability and logistics, the bulk of our capex occurred in Q3, which reduced our period gross margin and our free cash flow. With much of our multiyear capex investment plan completed, our team is now focused on optimizing these investments. We expect 2023 capex to be at least 50% lower than 2022, which will result in higher gross margins and improved free cash flow margins when macro conditions stabilize. We also anticipate that our increasing mix of video and other high-value formats will provide another tailwind to higher gross margins and improved free cash flow margins.\n\nWith regard to the strengthening of the U.S. dollar, we anticipate the impact on our revenues to be neutral to positive because the transactions flowing through our platform are largely denominated in U.S. dollars. On the expense side, we also expect the U.S.\n\ndollar's strength relative to the Indian rupee and U.K. British pound sterling to have a neutral to positive impact. In closing, there are multiple reasons we are confident in our long-term prospects despite the difficult macro conditions dampening global ad spend. Our business has structural advantages emanating from our owned and operated infrastructure and offshore R&D that enables us to expand our competitive moat and consistently invest in innovation on behalf of our publishers and buyers.\n\nWe have numerous growth drivers and see a long runway of growth ahead of us as our TAM continues to grow. We are consolidating the sell side as one of the few scaled global omnichannel platforms. And our profitability gives us a high degree of agility to weather challenging economic conditions and invest in long-term market share gains. With that, I'll turn the call over to the operator to open it up for questions.\n\nStacie Clements\n\nThank you, Steve. [Operator instructions] With that, the first question comes from Jason Helfstein from Oppenheimer. Please go ahead, Jason.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nHey, thanks, guys. So a question. So it would seem that programmatic advertising becomes even harder to predict in this kind of environment as buys become more last minute. Maybe just comment a bit more on kind of what you're seeing and -- but to the extent you get to the end of the month or the end of the quarter and there's budget left, you also get those dollars as opposed to IO orders, which become too hard.\n\nAnd then, just second, it sounds like display will be a drag on the fourth quarter. Just maybe comment what guidance assumes for growth ex display because it seems like that will still grow meaningfully faster. Thanks.\n\nSteve Pantelick -- Chief Financial Officer\n\nGreat. I'll take that. Good to connect, Jason. So a couple of points.\n\nWith respect to programmatic, certainly, the pros are that it's data-driven and provides a level of transparency that many other forms of digital advertising does not provide. And with that comes the ability to bid in real time. So there is a bit of that yin and yang with respect to the timing. But overall, the long-term secular trend is incredibly positive for programmatic advertising.\n\nAnd so, quarter to quarter, there might be some variations, but the reality is the long-term trend is moving in the right direction. And the reality is the visibility that any companies in this space, ours included, were largely driven by factors outside of our control. The most important thing that we focus on is, what does it look like for the long-term perspective? And from the way we think about it is the fundamentals of our business remain very robust and they're intact. And this gives us confidence.\n\nAs I indicated in our comments, we are expanding our SPO relationships. We're able to continue to grow our omnichannel video business very strongly. And these have really helped us continue to grow faster than the market over the last couple of years. Now, with respect to the display format, as I referenced in my comments, this is a path we saw during the pandemic, and it was one of the first formats to really feel the pressure of shifting buying.\n\nI do expect it to come back. It's a very long-term, stable format. But for the coming quarter or two, there will be pressure. And I anticipate the format will probably decline to high single digits in Q4.\n\nHard to say right now in terms of Q1. Overall, of course, our growth would be much higher if that format was more stable. Now, just as a reference point, though, last quarter, Q2, our display format business grew 19%. So clearly, we are doing things right in this space regarding display format.\n\nAnd overall, as an omnichannel platform, we really find pockets of growth when there's softness in other areas.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you, Steve.\n\nStacie Clements\n\nOur next question comes from Brent Thill at Jefferies. Please go ahead, Brent.\n\nBrent Thill -- Jefferies -- Analyst\n\nGood afternoon. Rajeev, maybe just walk us through kind of what you're hearing from some of your barrier partners about what they're seeing and what some of the explanations. Is this just macro jitters? Is it supply chain? Is it -- what are you hearing as kind of the common reasoning of some of these pullbacks?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nSure. Yeah. So I think what we are hearing and what we're seeing is that there was a deceleration through Q3, and that's a pretty common macro state, right? And what we are focused on, and I think what's most important to me personally, is that we continue to consolidate ad spend and gain market share. So if we just look at some of the Q3 numbers that are out there, Meta was down minus 4% to minus 5%.\n\nGoogle and their network business, minus 2%. I think, Snap was plus-6%; Pinterest, plus-8%; Roku, plus-12%. And our full year guidance has us at roughly 14% for the year, which is well above the market rate of growth, which is running at 10% or lower. So clearly, there's a step function down for our Q4 guidance, but we think the vast majority of that is driven by the macro environment.\n\nWhat does give us confidence as we go into the downturn is that we've got many tools at our disposal. So first of all, significant profit margins, and that gives us the agility and the ability to focus on long-term innovation in select high-growth areas. And then, as we highlighted, we're going to be very focused on optimizing the infrastructure and the capacity that we've already put in place, and that allows us to commit to reducing capex by half at least next year, which will be reflected in gross margins, as well as on the bottom line. And then, third is that we've got a management team that's got a long tenure.\n\nWe've seen this play out before in both the great financial crisis, as well as COVID and come through with flying colors. So we definitely cannot control the macro, but we feel good about our ability to execute and create differentiated outcomes.\n\nBrent Thill -- Jefferies -- Analyst\n\nRajeev, I know this is tough to probably gauge, but have you gotten a signal when you think this starts to improve? Is it back half of '23? Is it -- or is it just too hard to tell for you at this point?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah, I mean, I can start and maybe, Steve, you want to chime in on it, but I would say it's too hard to say at this point. I know everybody is looking for the bottom, of course, but I think we got to kind of take it one month at a time and see what's out there. Obviously, the big unknowns, right, which you know well, are what happens with inflation and then resulting interest rate changes and then what happens with the war in Europe. And I don't think anybody has any ability to predict those things.\n\nSo we just got to take it a month at a time. And I think from our perspective, again, we feel really good about our ability to be very agile in this environment given the strong profitability and balance sheet that we have.\n\nSteve Pantelick -- Chief Financial Officer\n\nYeah, let me add, Brent, to the points that Rajeev made. From my perspective, as CFO, what I focus on is the fact that we can grow faster than our peers, that we can leverage our very efficient business model and that we stay ahead in terms of investments for future growth. So wherever that bottom is, we feel very good about the point that we're going to be when we exit this current cycle. It's hard to say what that growth rate will be over the coming quarters, but historically, we've proven that we can grow faster than market, and I don't see any reason why that premise doesn't hold true.\n\nAnd I really want to reinforce the point that Rajeev made that going into this cycle, we feel that we're on the front foot. We've been proactive, and we believe that we are uniquely positioned because we continue to make growth investments over the last several years. And as Rajeev said, we're now turning our attention to further optimization of our infrastructure and selected targeted growth investments. So overall, we feel really good about where we are in the cycle and our ability to exit very strongly out of it.\n\nBrent Thill -- Jefferies -- Analyst\n\nAnd Steve, can I just clarify that the end of October -- or you said things got a little tighter at the end of the quarter. How did things trend in October? Was it a similar trajectory slowly getting worse? Or did it stabilize from at least end of September?\n\nSteve Pantelick -- Chief Financial Officer\n\nYeah, the softness that we saw in the third quarter really did continue into October. And as I had mentioned, there is the macro factors that we all are aware of. And I particularly saw it in a couple of different places. And just to set the context, in terms of the expectations for the fourth quarter, there's clearly a seasonal uptick that occurs every calendar year.\n\nAnd when we took a look at the numbers, we factored in not what -- how we exited Q3, but what's happened up to today's call. And shopping continues to stay under pressure. For the first part of this fourth quarter, it's roughly flat year over year. In a couple of other categories like personal finance is down about minus 15%.\n\nNow, having said that, we have other categories that are -- continue to perform strongly like travel and automotive. So the benefits of our business that we've built is that it does have a level of diversity in it, and so we can manage through, at some level, these puts and takes. And when we put together our Q4 guidance, I took a look at the year-over-year trends, bottom up from a publisher by publisher perspective. And then, also, just looked at sort of the seasonal expectations.\n\nAnd the one thing I'll call out is going into the fourth quarter, we had expected mid-30s seasonal sequential growth versus Q3. That's looking to be more like 20%. So it's very nice sequential growth, but relative to sort of the median average over the last decade is about 35% sequential growth. So clearly, softness is in the business right now.\n\nBut we feel really good about the financial strength we have and our ability to continue to invest through this and be very well-positioned as it stabilizes.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nThanks, Brent.\n\nStacie Clements\n\nOur next question comes from Shweta Khajuria at Evercore. Please go ahead, Shweta.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nThanks, Stacie. Could you please explain -- Steve, you just talked about the fourth quarter guidance, but what is the assumption that's baked into your guidance? So to see the high end of the guidance, what is the assumption? And what would have to happen to -- for you to be at the low end of the guidance in terms of the trajectory of growth rates from October to November to December? And then, the other question is, how are you thinking about opex not only this year, but just in general next year, you talked about capex. Could you comment on opex? Thank you.\n\nSteve Pantelick -- Chief Financial Officer\n\nSure. Happy to. So in terms of the expectations for Q4, it is really as straightforward as I just outlined. We take a look at the trends so far through this past weekend and then extrapolated them forward based upon those trends.\n\nClearly, we had a bit of an uptick benefit from political spend this year, but that was never a significant part of our expectations. And so, it's really just looking at the current trends publisher by publisher and where we see strength in that vertical and where we see some softness. And the softness is within those categories that are typically strong at this time of year, food and drink, for example. Now, having said that, I think that we try to create a range that we felt we can deliver with it.\n\nSo that's my expectation. I think, there might be some puts and takes up and down. But I feel like we've given a realistic range based upon what we're experiencing. Now, with respect to opex, the -- I really want to underscore the point of how we think about the opportunity ahead of us.\n\nUltimately, as we've shared in the past, it's all about innovation and doing that cost effectively. And we built an incredible development organization in India. And we're going to selectively continue to invest to support that organization and ultimately innovation. Where we're paring back is in selected go-to-market organizations.\n\nAnd our fundamental belief is we go into this cycle in very strong financial health. We have the ability to continue to invest. And what we saw back in the pandemic period, the down quarter of Q2, we were one of the only companies that consistently invested right through and we saw the benefit of that in the succeeding quarters and years. So from our perspective, we're going to, obviously, keep a close eye on opex.\n\nRajeev and I commented on our focus on optimization, and that's going to continue to flow throughout the organization, that we expect increased productivity in all the functional areas. And there will be some growth in opex, not at the same rate as we've seen it historically. But we see that there's an opportunity that we can't miss in terms of the long-term secular trends and the fact that we are absolutely becoming a bigger part of the ecosystem. And now, with the Martin acquisition, providing the tools to consolidate more ad spend onto our platform.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks, Steve. Is there any contribution from Martin included in the guidance?\n\nSteve Pantelick -- Chief Financial Officer\n\nNo. In fact, in the fourth quarter, I assumed roughly $1 million impact cost, and that's included in our financials.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks to you.\n\nStacie Clements\n\nOur next question comes from Matt Swanson at RBC. Please go ahead, Matt.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nThank you, guys, so much. So starting, Rajeev, last quarter, we talked a little bit about the challenging macro potentially being a tailwind SPO, right, with advertisers really focusing on ROI. And I was just curious if you saw anything like that again this quarter. And then, maybe if you could remind us a little bit about like the deal cycle time on SPO in terms of when a conversation starts to where it's kind of like up and running.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Sure. So why don't I start with the second part of your question, then I'll get to the first. So in terms of the deal cycle, there's a wide variety of ranges.\n\nSome advertisers are relatively quick. Agency holdcos tend to be longer. So we could see from an advertiser perspective, maybe a couple of months, a holdco to get a deal in place could take 12 to 18 months. And then, from there, there's the actual implementation process.\n\nAdvertisers, again, tend to be simpler and quicker to implement. That can be a matter of, again, a couple of months, whereas a holdco, you've got to go region by region, country by country and bring those trading teams on board. And so, that can take another six, 12, 18 months, depending on the agency. So that kind of gives you a reference in terms of the time frame.\n\nI think, what we typically tend to see on the first part of your question is that in a time of economic stress, that there is a consolidation within our ecosystem. So the buyers, the publishers, they need to figure out how to do more with less resources, how to become more efficient. And so, they typically tend to streamline the number of partners that they work with and lean into those activities that can make them more efficient. And I think we're going to see that play out here.\n\nStill a little bit early in the slowdown cycle from an economic perspective, but I suspect that we will see that play out here. And that was part of the reason why we made the acquisition of Martin is really to build upon the 40-year investment that we've made in supply path optimization and continue to have that as a very strong lever of spend consolidation on our platform and therefore, share gains. So we are absolutely talking every day with our buy-side customers and partners about what are the challenges, what are the opportunities, how data-driven advertising, how the ROI that can be driven from real-time bidding can increase accountability and increase client outcomes and grow their business and grow our business.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYeah, no, that's super helpful. And can I get some context based on the sales cycles that SPO revenue might kind of be a lagging indicator for how fast the business is growing in terms of your OpenWrap? The other question I wanted to ask was on the CTV side, and obviously, a lot of focus on the streaming services switching to AVOD. And I was just curious, in 2023, with this much inventory coming to the market, do you think that pushes the CTV market more in your direction with publishers maybe in to turn to biddable environments sooner, right? Just not able to handle so much direct with more competition.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah, I think we definitely are going to see a shift toward a bit of -- that's going to be driven both on the sell side and the buy side. So from a buyer's perspective, you can imagine that if we go back a couple of years, there was only a handful of really large platforms, CTV streaming platforms that buyers could buy from. And so, clearly straightforward from an operational complexity perspective to buy the insertion orders. Now, you fast forward to today's environment or next year's environment and in any given geo, there may be dozens of high-scale inventory sources.\n\nAnd so, in that environment, obviously, buyers want to buy across all of those scaled supply sources. And so, the operational complexity, the economic complexity, making sure that clients are getting strong ROI, that really requires a bidded approach. And so, we're going to, I think, continue to see pressure from the buy side. And as that pressure comes from the buy side, I think similarly, we're going to see the sell side want to match how buyers want to buy.\n\nAnd I think they're going to come under pressure to move toward more data-driven approaches to selling their ad space so that they can measure and deliver the ROI to the buyers. So we feel like the setup was already to move toward more of a bidded CTV environment. And again, economic pressure, whatever recessionary environment we're headed into, is only going to accelerate or increase that pressure.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAll right. Thank you so much for your time.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nThank you.\n\nStacie Clements\n\nOur next question comes from Andrew Marok from Raymond James. Please go ahead, Andrew.\n\nAndrew Marok -- Raymond James -- Analyst\n\nThanks for taking my question. You talked about areas of investment that will position the company better coming out of the downturn. Can you talk about prioritization of these initiatives kind of in the context of slowing ad com growth?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Absolutely. So I think, first and foremost, I'll give you the kind of the functional prioritization, which really is around engineering and innovation. So as the weight of ad spend growth decelerates, what that allows us to do, given our profitability and our balance sheet, is to really think about how do we maximize share gains when the upturn inevitably happens.\n\nAnd that's going to really be driven by having the right products and the right solutions in the market whenever that happens. And so, to do that, we're going to -- we're shifting our focus of investment toward products, toward engineering, toward software, toward infrastructure so that we can make sure that we have the right products. Now, in terms of those areas that we're focused on is really just four kind of primary areas. The first is supply path optimization to making sure that we have the right capabilities and products for buyers so that as this -- as we anticipate a spend consolidation may happen, we're in the right position to bring those dollars onto our platform.\n\nSecond is around video and CTV. So obviously, there's huge growth of consumption of that ad format, and of course, advertisers love it because of the rich opportunity to tell a story to the consumer. And there's a lot of first-party or log-in user data around CTV in particular. Third is addressability.\n\nSo this whole shift away from cookies or IDFA to new or varied ways of delivering a relevant ad to the consumer. And then, the fourth is retail media, which we see as a $100 billion to $150 billion addressable market when we have a lot of the capabilities in place and are building more product and then a go-to-market around.\n\nAndrew Marok -- Raymond James -- Analyst\n\nGreat. Thank you. And then, you spoke a little bit about the U.S. versus some of your international markets performance.\n\nI guess, anything to call out in the macro situation versus your expectations in some of the different regions. I think, Europe, in particular, was called out prior as a place that was experiencing some macro pressure earlier. Was that kind of in line, worse, better and same for APAC?\n\nSteve Pantelick -- Chief Financial Officer\n\nSure, sure. The expectations we had for the third quarter for EMEA payment line, we believe it was going to decelerate and it did decelerate. The real change was the trajectory for the Americas. As a reminder, in Q2, our Americas business grew 27% year over year.\n\nAnd the third quarter, we saw that decelerate to about 10%. And the core drivers of that go back to the points that I had mentioned earlier. The core verticals of shopping, personal finance, technology had all decelerated August onwards. And given that Americas represents roughly two-thirds of our overall revenue, clearly, that was felt through that business unit.\n\nNow, having said that, we delivered really strong robust EBITDA, 39% EBITDA margin in the third quarter despite that shift in the top line. And really, it underscores the control that we have over the various levers in our business. And we're turning that focus, and we're going to continue to optimize the investments that we've made. My expectation is that the Americas business going forward will mimic sort of the macro trends.\n\nAnd we will see a recovery, but there's still a lot of uncertainty. The other point I'll call out is just the great progress that we've made in terms of omnichannel video. I don't want it to be lost in the headlines because we grew that business 45% in the third quarter, and that was on top of 80% growth last year. And so, we're really hitting on all cylinders.\n\nAnd I underscore the point. The challenge right now is the omnichannel video represents 34% of our revenues. The balance is display and display is -- which is both mobile web display, app display, as well as desktop display, is under pressure right now given the overall macro conditions. But because we have this mix and the fact that the mix is growing over time, we feel really that we're well-positioned as the cycle progresses, not just from a financial perspective, but also what happens when we come out of it.\n\nAnd Americas will certainly lead aside of that situation.\n\nAndrew Marok -- Raymond James -- Analyst\n\nUnderstood. Thank you.\n\nStacie Clements\n\nOur next question comes from Andrew Boone at JMP. Please go ahead, Andrew.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nAll right. Thanks so much for taking my questions. I have a big picture question as we think about kind of the market growing 10% or lower, which I think you guys referenced earlier, versus kind of guidance for 14% growth for 2022. Can you just talk about the competitive environment as we go through a downturn? There's long been a thought that ad tech will consolidate.\n\nDoes this accelerate that? Or is there anything else that you guys are seeing on your end as we think about the competitive set within ad tech?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Why don't I kick that off, and then Steve, you can maybe chime in? So I think our focus is really on continuing to grow our share of the market. And it's very possible that us or others could -- that action could drive consolidation. But again, when I look at our rate of growth relative to the market, historically, we've been growing at roughly twice the rate of growth in the market.\n\nWe don't see any reason why we shouldn't continue to grow faster than the market, even if it's at a lower rate on an absolute level as the macroeconomic environment clearly indicates a deceleration. And we think we're very well-positioned, and I would say, uniquely positioned in terms of our balance sheet with no debt and then the ongoing profitability in the business. So I think there will be more opportunities for consolidation in the future, whether it's organic or inorganic. It's hard for me to comment on what's going to happen in the rest of the industry.\n\nBut we absolutely see these types of challenging times really as market share growth opportunities for us given our historical and long-term focus on both revenue growth and profitability. Let me turn it over to Steve for any other comments.\n\nSteve Pantelick -- Chief Financial Officer\n\nSure. I think, core to the point of view we have is that we feel really good about our business in terms of the model, in terms of the fundamentals that I outlined in my prepared comments. And I'll just sort of summarize because I think it really underscores the point that we're making. We believe that we built a very efficient business.\n\nWe've owned and operated our equipment for many years. We've been driving efficiencies out of that at significant rates. We've gone through a multiyear investment cycle and doubled the capacity that we could process. That all is raw material for us to leverage and grow over time.\n\nWe don't need to then build more to generate incremental revenue in the near term. So that's a really big leverage point for us. So we're going to be focused on optimization. And we think by virtue of the fact that we are one unified platform, we're going to be able to deliver innovation on quicker cycles.\n\nAnd we have a credible asset, as I commented on earlier, in terms of our R&D organization in India that we have been growing over time, and they are all pointed toward high ROI investments. And if you factor all those things together by, I'd say, definition, we should end up consolidating the business because there are going to be companies that cannot keep pace on any of those or altogether those fronts.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. I just want to kind of underscore the magnitude, I think, of our owned infrastructure advantage. As Steve mentioned, we're going to reduce the capex by at least half for next year. If you're in AWS or something like that, maybe you can reduce your infrastructure bill by 10%, if you really focus on it, but it's going to be hard to get significant gains beyond that.\n\nSo that's just, I think, an example of the significant advantage that we have.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThat's helpful. Thanks so much. And then, secondly, if I think about your CTD publisher wings, it steadily continues to increase over the last few quarters. Can you just talk about where you guys are actually winning share? Like what publishers are coming on the platform? Is there a trend there of a type or anything else you can share?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nThanks. Sure. Yes. So I think we're seeing growth really in two areas, both is in net new -- one is a net new and the other is in the penetration -- deeper penetration of the existing publisher base.\n\nSo we're seeing growth, I think, from both of those categories. In terms of the types of publishers, there's really three or four types of publishers that we're going after. So one is kind of the Tier 1, really large platforms, broadcasters that are pretty scaled in terms of their monthly users. The second category is one level down from that.\n\nSo these are more niche content providers. They maybe have 20 million, 30 million uniques in a month, very high-value content, but smaller in nature. They are very well suited to a biddable auction environment because you need automation to bring dollars the right campaigns to that inventory. And then, third is the FAST, the free ad-supported TV category.\n\nSo you may have some big players there, and that's a key part of our business. And then, fourth would be the TV OEMs or manufacturers and we're working with four or five out of the top five in that category. So these are kind of -- that's the playing field that we're going after pretty much in any given geography. So again, I think we're going to see penetration, new publisher acquisition, but also with the likes of SPO, bringing more dollars to the existing publishers that are in our stable.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nStacie Clements\n\nOur next question comes from Justin Patterson at KeyBanc. Please go ahead, Justin.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thank you. Good afternoon. Two, if I can.\n\nFirst, Rajeev, I appreciate your comments on Retail Media as a growth opportunity. There's, obviously, a lot of companies focused on that space. When you look at the assets PubMatic has today and where you need to invest to gain market share, could you kind of shed a little more light on where you think you can get some wins and how we can think about the time line for that? That's question number one. And then, Steve, I just wanted to kind of get a finer point on some of the optimizations you're talking toward.\n\nIf I step back, if you're getting more utilization on the data center and then also having this mix shift dynamic away from lower-priced desktop to potentially having more mobile video, that seems pretty positive from a mix dynamic. So acknowledging the growth rate is what it is for 2023. It's a guess for all of us. How should we think about just the -- how margins are insulated from these optimizations and mix shift taking place? Thank you.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Great, Justin. So in terms of the retail media question, it's definitely a long-term growth opportunity for us. We view it as a natural extension of our platform.\n\nI think, you're right, there's, obviously, a handful of companies that are going after it. But we think between our programmatic kind of DNA and infrastructure, the global capabilities that we have, multiple ad formats and then the investment that we made in Connect, our data and addressability platform to manage first-party data, identity data, contextual data, all of those pieces put us in a good position to field competitive product. We're already working with the likes of Kroger, eBay, Asda, Rakuten, Groupon, Bed Bath and Beyond and many others. In terms of the components, there's on-site advertising and there's offsite.\n\nAnd on-site, our core SSP business is a key product offering. And off-site, we think we have strong potential there in part with the Martin acquisition. The area that we're working hardest on right now is for on-site, it's sponsored listings. So these are the types of ads that you might see where somebody is shopping or sees product listing ads or product ads as they're going about a retailer site and shopping.\n\nAnd so, that's a newer area for us. And so, there will be some building there. So in terms of time line, I think this year and next year are significant product innovation and building time frames. And then, I think revenue contribution will come sometime -- meaningful revenue contribution sometime post 2023.\n\nI'll turn it over to Steve on the second part of your question.\n\nSteve Pantelick -- Chief Financial Officer\n\nSure. Justin, so to talk a bit more on the optimization front. So you are absolutely correct in assuming that the optimizations that we can do and have been doing will improve not only gross margins, but EBITDA margins. And there's, obviously, a number of reasons for that.\n\nBut I'll start out with the owned and operated part of the infrastructure, which we've -- you've heard from us for many earnings calls, is really a strength of ours on numerous fronts. Number one, we get to control the timing and magnitude of capex. So we decide when we want to invest, when we want to pare back, when we want to even move equipment because it's all our equipment. And so, we take a look at the market indicators and then we make the decisions in terms of how to best manage that.\n\nAnd so, clearly, over the last couple of years, we made a strategic decision to increase the competitive moat and be able to process more impressions. We made that decision because there is tremendous opportunity in areas like CTV and omnichannel video. And we have been doing that very judiciously. And as we look ahead in terms of this part of the cycle where the macro conditions are such that it's natural that ad spending is going to come down for some period of time, that we then are able to leverage the infrastructure that we already built.\n\nAnd from a cash generation perspective, these are high ROI outcomes because we've already incurred those costs. From a GAAP P&L perspective, we depreciate the equipment over three years, and we typically keep the equipment in service four, five, six years. So you can see the kind of leverage that we'll get over time. Now, the optimization doesn't just stop at the infrastructure.\n\nThroughout the company's history, we've always looked at opportunities to continue to drive productivity. And in times like this, when we're making very conscious decisions to focus, let's say, our investment in technology, engineering and not as much in GTM, it's really right for us to continue to improve workflows, automate workflows, etc. And so, that's what we have an organization that's very capable of doing and has been doing for a long time. Obviously, with the kinds of EBITDA margins that we have been able to achieve, in the high 30s last year, last couple of years above 40, I expect that the long-term trajectory of both gross margin and EBITDA margin will be up to the right.\n\nAnd it's really a function of how we organize ourselves, how we execute against the opportunity and how we are able to consistently invest in innovation and then when it's required to focus on optimization. And so, we feel that, as I mentioned earlier, we are on the front foot going into this cycle, and we feel really excited about the gains that we're going to make over the coming quarters from a competitive perspective.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nRight. Thank you.\n\nStacie Clements\n\nWe have time for one more question from Maxwell Michaelis from Lake Street. Please go ahead, Maxwell.\n\nMax Michaelis -- Lake Street Capital Markets -- Analyst\n\nHey, guys. My question here is just focusing on customer behavior. Just in terms of customers continuing to use several SSPs, are you seeing any consolidation and spend from customers maybe taking it from several SSPs down to maybe one or two? And if they are, are they choosing you? And what are they -- why are they choosing you?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah, hey, Max, so we haven't seen a significant trend toward consolidation on the publisher side at this point. But we certainly do see that on the buy side from a supply path optimization perspective. And so, for instance, in the last quarter, we announced an expanded Havas SPO relationship. And in Q2, we announced and expanded -- I think it was Q2 grew then global relationship.\n\nSo we definitely view the buy side as really the leader in terms of consolidation. I think, on the sell side, it's possible that we will see some publishers consolidate due to operational investments and maintaining multiple SSPs. But so far, I have not seen that play out in the cycle just yet.\n\nMax Michaelis -- Lake Street Capital Markets -- Analyst\n\nOK. Thanks, guys.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah.\n\nStacie Clements\n\nAnd we have no additional questions in the queue. I'll now turn the call back to Rajeev for some quick closing remarks.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nThank you, everyone, for joining us today. There's no doubt that it's a softer macro environment today versus a year ago. Ad spend growth is decelerating marketwide, but we continue to consolidate and grow market share. Our focused investments and continued innovation set us apart from others while still delivering high margins and cash.\n\nAnd while we can't control the macro, our business model provides resiliency and highlights our ability to execute and create differentiated outcomes. We do anticipate that ad spend will come back even bigger at some point in the future as it historically has, and we intend to be well-positioned to maximize further market share gains. I look forward to connecting with many of you at upcoming investor conferences.\n\nStacie Clements\n\nThank you, everyone.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nThank you, all.\n\nStacie Clements\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStacie Clements\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nSteve Pantelick -- Chief Financial Officer\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAndrew Marok -- Raymond James -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nMax Michaelis -- Lake Street Capital Markets -- Analyst\n\nMore PUBM analysis\n\nAll earnings call transcripts"
}