{
  "companyName": "FedEx",
  "companyTicker": "FDX",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/23/fedex-fdx-q1-2023-earnings-call-transcript/",
  "content": "FedEx (FDX -1.34%)\nQ1 2023 Earnings Call\nSep 22, 2022, 5:30 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the FedEx Corporation first quarter fiscal year 2023 earnings conference call. Today's call is being recorded. At this time, I will turn the call over to Mickey Foster, vice president of investor relations for FedEx Corporation. Please go ahead.\n\nMickey Foster -- Vice President, Investor Relations\n\nGood afternoon, and welcome to FedEx Corporation's first quarter earnings conference call. Before we begin, we want to recognize our SEC 8-K was filed earlier than planned due to a technical issue. The first quarter earnings release, Form 10-Q, and stat book are on our website at fedex.com. This call is being streamed from our website where the replay will be available for about one year.\n\nJoining us on the call today are members of the media. During our question-and-answer session, analysts will be limited to one question in order to allow us to accommodate all those who would like to participate. We want to remind all listeners that FedEx Corporation desires to take advantage of the safe harbor provisions of the Private Securities Litigation Reform Act. Certain statements in this conference call such as projections regarding future performance may be considered forward-looking statements within the meaning of the act.\n\nSuch forward-looking statements are subject to risks, uncertainties, and other factors which could cause actual results to differ materially from those expressed or implied by such forward-looking statements. For additional information on these factors, please refer to our press releases and filings with the SEC. Please refer to the Investor Relations portion of our website at fedex.com for a reconciliation of the non-GAAP financial measures discussed on this call to the most directly comparable GAAP measures. Joining us on the call today are Raj Subramaniam, president and CEO; Mike Lenz, executive vice president and CFO; and Brie Carere, executive vice president and chief customer officer.\n\nAnd now, Raj will share his views on the quarter.\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nThank you, Mickey, and good afternoon, everyone. I'd like to start today by acknowledging our pre-announced first quarter earnings results and updated outlook we provided last week. Our network capacity did not align with the demand we experienced as the quarter progressed. But as communicated last week, we have taken swift actions to address what's within our control.\n\nGetting costs out rapidly is my priority, and today, I will outline why I'm confident in our ability to drive improved performance and profitability through aggressive cost actions. Before providing more details around these actions, let me briefly discuss what happened since we last spoke to you in June. We saw a decline in our volumes during the first quarter, which accelerated in the final weeks. Our softening volumes in Asia and the U.S.\n\nwere predominantly due to the economy while the shortfall in Europe was both economic- and service-related. Therefore, we had costs in the system for volumes that didn't materialize. While we immediately took action, savings from these cost efforts lagged the volume decline due to the scale of our operations. As a result, while revenue was up 6% year over year, these dynamics translated to volumes being down year over year at all our transportation segments.\n\nThe volume decline directly impacted our bottom line, driving total company adjusted operating income down roughly 18% year over year. Now, what matters most is what we are doing about it, and this brings me to our aggressive and decisive plan to reduce costs. I'll speak to you -- I'll speak to our actions in two parts: first, our fiscal year '23 steps to immediately reduce costs; and second, our Deliver Today, Innovate for Tomorrow transformation strategy to permanently reduce cost and optimize our network. Starting with fiscal year '23, we are prioritizing cost actions to generate $2.2 billion to $2.7 billion of savings, of which about $1 billion will be permanent.\n\nTaking each key contributor in turn, at FedEx Express, we expect to drive $1.5 billion to $1.7 billion in savings this fiscal year. The largest single expected contributor in fiscal '23 will be the changes we are making to our express air network as we cut global flight hours. This reduction includes 11% of pan-Pacific daily frequencies, 9% of transatlantic daily frequencies, and 17% of daily frequencies on the lane between Asia and Europe. As volumes deteriorated later in the quarter, we began making these structural changes to our network.\n\nThe impact of these initial changes will be fully realized in October, and the benefit of our continued actions will steadily increase throughout the fiscal year. We are also evaluating additional reductions to be implemented post peak. Further, we're taking steps to enhance our ground efficiency, including reducing routes, hours, vehicle rentals, and other on-road expenses. For example, in Europe, we are altering ground network routes to improve productivity, leading to a reduction of approximately 11% of routes in the U.K.\n\nand 12% in Germany. Now, turning to FedEx Ground. We expect savings in Ground to be $350 million to $500 million in fiscal '23. Our approach to cutting costs in Ground primarily centers around rationalizing our operations.\n\nWe are consolidating sorts, which will reduce costs while maintaining service, and have canceled several planned ground network capacity projects. And as mentioned last week, we're also reducing select Sunday operations in over 170 stations. Mike will provide more details on our capital plans shortly. The final components of our expected fiscal '23 savings will be from overhead expenses as we rightsize our overall cost structure.\n\nThese actions include our plans to close nearly 140 FedEx office locations and at least five corporate office facilities. Additionally, FedEx Services has stopped all noncritical projects. In total, our overhead reduction actions, including FedEx services, will contribute $350 million to $500 million. We realized nearly $300 million in cost savings from these actions in Q1 and expect approximately another $700 million in Q2, with the remainder of the fiscal '23 savings realized during the second half of the year.\n\nThe second part of our cost plan is focused on permanent reductions, and we have launched DRIVE, a program supporting our Deliver Today, Innovate for Tomorrow strategy introduced in June. DRIVE is how we execute on that strategy. Our team has already started implementing cost reductions under this program, and this will ultimately enable Network 2.0, the long-term end-to-end trend optimization of our network. Sriram Krishnasamy, our newly appointed Chief Transformation Officer, will facilitate DRIVE and continue reporting directly to me.\n\nIn total, we expect to take out an additional $4 billion in costs related to DRIVE by fiscal year 2025. To be clear, these are incremental to the fiscal '23 savings I just outlined. These transformational changes will lay the foundation for Network 2.0, which will create an additional $2 billion benefit over the long term. In closing, we are focused on actions we can control as we stabilize our near-term performance and execute against our long-term strategy.\n\nI'd like to sincerely thank our highly motivated team for their hard work and dedication to deliver upon the Purple Promise. Now, let me turn it over to our chief customer officer, Brie Carere, to discuss market trends that underpin our outlook and our commercial strategy in some more detail.\n\nBrie Carere -- Executive Vice President and Chief Customer Officer\n\nThank you, and good afternoon, everyone. As Raj discussed, during the first quarter, manufacturing, global trade, and consumer spending decelerated, particularly late in the quarter, and certainly more than we anticipated. As a result, our first quarter volumes were lower than we forecasted. Our current expectations for 2022 U.S.\n\nGDP growth and U.S. industrial production forecasts have declined by about 100 basis points since June. Data shows that U.S. consumer spending has slowed as inflation remains a challenge.\n\nFurther, consumption is skewed toward services, demonstrated by the fact that in June, excluding auto, the real retail inventory to sales ratio fully recovered to its pre-pandemic level. From October to June, the real inventory to sales ratio, excluding automotive, increased 14 basis points, which was the fastest gain over an eight-month period in the 25-year history of the series. Also, real retail sales, including auto, after growing 4.6% and 10.8% in calendar year '21 and '22, respectively, are now down 3.1% year over year through July and are pacing to have the worst decline since The Great Recession. Turning to our transportation businesses.\n\nI'd like to spend a moment on the dynamics occurring within FedEx Express and most specifically in Asia and Europe. Starting with Asia, our results were impacted by macroeconomic weakness. Our lower demand is consistent with the broader market, with ocean and air freight rates under pressure in recent weeks. A good indicator of how quickly the market changed in Asia is to review the spot rates coming out of Hong Kong and Shanghai.\n\nIn June and July, spot rates were between 20% and 40% higher year over year, respectively. In early August, these rates fell to single digits, and by the end of the month, Shanghai had plummeted to a 10% decline year over year, while Hong Kong rates were flat. Through June, which is the latest data available, we have had small market share gains in our Asia region. In Europe, the economy was weaker than we anticipated, and service further pressured our results.\n\nOur network integration was successfully completed in March, but it is an incredibly complicated effort to combine two individual networks of this scale. Throughout the quarter, we continued to refine our standard operating procedures to improve service levels and create momentum across our European division. Moving now to FedEx Ground. Revenue growth was driven by higher yields from higher fuel surcharges, base rate increases, and improved volume mix.\n\nDespite volumes being lower than anticipated, we have held market share in the United States. FedEx Ground has strong service levels, best-in-market transit times, and an exciting new picture proof of delivery capability. We are ready to deliver for peak. We will remain nimble in leveraging peak surcharges to balance demand and the capacity of our network as we monitor volume trends.\n\nAnd at FedEx Freight, momentum continues to build. The Freight team delivered another strong quarter marked by 21% revenue growth. The team continues to drive disciplined execution, focused on revenue quality and profitable share growth. For the company overall, we continue to execute our revenue quality strategy and pursue business that provides attractive yields.\n\nWe continue to deliver new pricing capabilities, and we've taken recent actions to stay well positioned relative to the market as we approach peak. We have maintained a brisk pace for repricing contracts for the renewals and continue to negotiate strong increases. We just announced a 6.9% general rate increase this coming January in our response to inflationary pressures on our costs. We also announced our new remote area surcharge and peak residential pricing in the United States.\n\nIn Europe and Asia, we will launch a new handling surcharge as well this January. In August, we implemented international fuel surcharge table adjustments for Asia, Europe, the Middle East, and Africa. Fuel surcharges are an important pricing tool. We rigorously monitor fuel prices to ensure that we are appropriately positioned relative to the market.\n\nWe're moving with speed and agility to reposition our business model for today's operating environment. As you heard from Raj, we had a great -- we have a great opportunity to align costs with volume levels. We are committed to doing this while executing against our commercial strategy and delivering for our customers. Importantly, we're still focused on the longer-term opportunity growing in high-value segments, driving improved service quality, and, of course, delivering an outstanding customer experience.\n\nI am really pleased with how our teams have responded in this dynamic environment, and we are well positioned to deliver during the upcoming peak season. Service is strong and we have a fantastic value proposition. With that, I'll turn it over to our chief financial officer, Mike Lenz.\n\nMike Lenz -- Chief Financial Officer\n\nThank you, Brie. While revenue was up 6% for the quarter, profitability was challenged with operating income down 18% on an adjusted basis and adjusted operating margin down 150 basis points year over year. At Express, adjusted operating income declined 72% due to lower average daily package and freight volume and increased expenses as cost reductions lagged volume declines. These factors were partially offset by yield management actions, including higher fuel surcharges.\n\nPackage yield, including fuel, grew 16% year over year. Turning to Ground. Operating income increased 3% primarily due to yield improvement and home delivery volume growth. Yield including fuel grew 12% year over year.\n\nThese factors were partially offset by higher operating expenses, driven by increased purchase transportation and other operating expenses. Freight delivered another strong quarter with operating income increasing over 67% as the Freight team continues to execute. This was driven by yield management actions, including higher fuel surcharges. Yield, including the surcharges, grew 27%.\n\nThis was partially offset by higher salaries and employee benefits, as well as lower shipment volumes. To address the changed environment, we're focused on what's within our control and moving with urgency to take costs out of the network. Our team is operating at speed to identify cost-saving opportunities and accelerate for implementation. The $2.2 billion to $2.7 billion fiscal '23 savings we're targeting are relative to our initial plans heading into the year.\n\nThe majority of this year's savings will come from Express where the demand change has been most pronounced. We expect about $1 billion of our fiscal '23 savings to be permanent in nature, with slight reduction as the largest component along with corporate and back-office costs. These permanent cost reductions were not part of the Deliver Today, Innovate for Tomorrow strategy we shared in June, which is about how we structurally optimize our networks. These reductions are directly related to flexing in a changed environment with a view to build back differently in the future.\n\nAs Raj mentioned, we remain committed to the profit improvement objectives we shared at our June investors meeting. We have launched efforts to accelerate initiatives, identify incremental opportunities and implement metrics to track progress under the DRIVE program. So, next, I'll give more details on the targeted $4 billion savings by fiscal '25 enabled by DRIVE. About $1.4 billion of the total will come from the FedEx Express operating expenses.\n\nFour largest areas of opportunity we are actively advancing are: first, restructuring the air network by reducing routes and more efficiently deploying crews, aircraft, and commercial line haul; next, optimization of sort, surface line haul, and on-road design to improve efficiency, asset utilization, and service; next, driving efficiencies of Europe, as we've discussed previously; and lastly, harmonizing global clearance processes to lower cost. About $1.1 billion of the total will come from FedEx Ground operating expenses via dock productivity initiatives, network, and line haul efficiencies, and reduced liability costs. And approximately $1.5 billion will come from shared and allocated overhead expenses led by procurement savings, back-office automation and infrastructure modernization, increased deployment of digital self-service, and further consolidation of shared service functions. Moving to our capital spending plans.\n\nWe've reduced our forecast for capital spend for fiscal 2023 to $6.3 billion compared to our prior $6.8 billion forecast. We're intensely focused on allocating capital to the most attractive ROIC initiatives. Our liquidity remains a source of strength as we ended the quarter with $6.9 billion in cash. And based on our cash flows and liquidity, we remain committed to our capital return strategy, including our plan to repurchase $1.5 billion of stock in fiscal 2023.\n\nWe expect to purchase $1 billion in the second quarter. Our capital return strategy reflects our confidence in our business despite the headwinds we're currently navigating. We have significant flexibility to maintain our balanced capital allocation and preserve a resilient balance sheet. Now, turning to second-quarter guidance.\n\nWhile we continue to drive aggressive cost reduction actions, we expect business conditions to remain challenging in the second quarter. As a result, and consistent with the update we provided last week, currently expecting revenue of between $23.5 billion to $24 billion in the fiscal second quarter, and adjusted earnings per share, excluding costs related to business optimization and realignment initiatives of $2.75 or greater in the second quarter. For the remainder of the year, while we are not providing guidance, given current uncertainties, our plan is based on an expectation that the weak trends we saw in late Q1 will persist across our major geographies. This is embedded in our guidance for the second quarter and driving our cost takeout initiatives for the fiscal year.\n\nLonger term, we remain committed to our fiscal 2025 targets for operating margin improvement, return on invested capital, and capital intensity that we shared with you in June. We're leaning more heavily into cost actions to get to those goals. The start of the year presented greater-than-expected challenges, but I can assure you that we are moving with urgency to address these pressures while remaining focused on creating long-term value by prioritizing revenue quality, expanding margins, and elevating financial returns through profitable growth and reduced capital intensity. And with that, we'll open it up for your questions.\n\nOperator\n\n[Operator instructions] And we will take our first question from Tom Wadewitz with UBS. Please go ahead.\n\nTom Wadewitz -- UBS -- Analyst\n\nYeah. Good. Good afternoon. I wanted to see if you could maybe give us some more perspective on some of the biggest cost reduction actions and just kind of your level of confidence on the execution.\n\nIt seems like, I guess, parking the planes and taking out capacity is something you've done in prior downturns, but perhaps rationalizing sorting centers seems like a new thing in Ground. And I guess the labor markets, maybe it's a little tougher to take labor market if you think you might need it back. So, I just wanted to see if you could give maybe a bit more detail on your visibility to those cost actions and kind of how they come through. Thank you.\n\nMike Lenz -- Chief Financial Officer\n\nSure, Tom. This is Mike. So, you're correct in observing that the biggest order of magnitude of the cost reductions is from flexing down the air network. So, that will come into play, particularly as we move through into the second half of the year as the flight reductions for the -- take effect in October and into November.\n\nSo, at Ground, you spoke of a facility and sort rationalization. What that does for us is as volumes fell down below expectations, that leads to inefficient line haul because load factor's down, and so thus, you're running more line haul than you need for the volume you have. So, by consolidating sorts and rationalizing facilities, that's just an example of how we can optimize against the lower volume. I'd also highlight that within the capital spending projections, we have deferred a number of planned Ground facilities, and we actually canceled a few that we're literally about to initiate.\n\nSo, we are moving quickly on this and fully acting to realize the full potential there. So, we have clear plans to get at all of these. We have a long list, and they all add up to a very solid number, and the team is focused on execution.\n\nOperator\n\nWe will take our next question from Brian Ossenbeck with J.P. Morgan. Please go ahead.\n\nBrian Ossenbeck -- J.P. Morgan -- Analyst\n\nYeah. Maybe just more basic question. Raj, can you just talk about the -- I guess the reason why this is only a FedEx issue at least at this point in time? Why haven't peers called this out? They all seem to sound like things are actually working pretty well in their favor, at least not nearly as much of a falloff as you've highlighted. So, maybe can you just address that and why you waited a week to talk about the costs, which we're all waiting for? And then just because of the significant downdraft in Express, can you give us some recent stats in terms of just how quickly it fell and how September is shaping up?\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nOK. Let me start and then Brie can talk about some of the trends you're saying. Listen, I can't comment on what our competition is seeing or not seeing. All I can say is the trends that we are seeing in the marketplace, and we want to get out ahead of this.\n\nAnd listen, the whole -- at the end of the day, the macro is going to ebb and flow. It's really the activities that we do that matters at the end of the day, and we want to take control of what we can control. And that's why we are being very aggressive on our cost actions. And again, we'll let the economic environment, the things that we don't control, it'll do what it will do.\n\nWe'll just -- we will focus on the issues that we can control in primarily on the cost side. I'll let Brie talk about the revenue trends.\n\nBrie Carere -- Executive Vice President and Chief Customer Officer\n\nThanks, Raj. Brian, just to kind of reiterate what we -- I know we had a lot of opening comments. But when we look at kind of the background, we really did break things into three categories. In Asia-Pacific, we absolutely believe that this is a market trend and not a FedEx trend.\n\nAs I mentioned, our market share studies, they are a little bit of a lagging indicator. But we do see that through June, in our Asia-Pacific region, we actually gained market share. And that's why I shared those spot rates and how quickly the market changed in August. And we do believe the entire market is experiencing that in Asia.\n\nIn Europe, similar story from an economic perspective. We think that the economy got worse throughout the quarter. We, however, as we acknowledged, did not have the improvement in service in the quarter that we had expected. We actually saw some plateau in service levels, so that was a FedEx issue.\n\nAnd as Raj mentioned, we're working on it seriously and actually feel good about the momentum there from a service improvement. And then here in the United States, as I mentioned, through June, we can see that we've held market share. If you actually look from a nuanced perspective, I would say that the one nuance within the domestic performance is that from a FedEx Ground economy perspective, we have prioritized revenue quality and so we have let some volume go. That was very conscious, and we have seen that kind of persist throughout the quarter.\n\nSo, overall, we do think that the entire market is experiencing what we had from a macroeconomic perspective. And then for Q2, you've got the revenue range and I would say that September is right in that range.\n\nOperator\n\nWe will take our next question from Brandon Oglenski with Barclays. Please go ahead.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nHey, Raj and team. Thanks for taking my question and definitely appreciate the new cost plans. But maybe we're going about this all the wrong way because there's been plenty of cost improvement plans in the past at this company that just haven't delivered. So, can I ask a pointed question? Have you done a product review, like what is not working in the last 20 years that's driving lower profitability in your network relative to your competitor? Is there a certain product or customer or a region that just isn't working? And I can tell you from the outside looking in, TNT seems to have been an unmitigated disaster here that just has been delivering because you guys are coining out European losses again.\n\nAnd then from our perspective as well dual Express and Ground pickup and delivery networks, I get it. I know that Express and Ground have different dynamics. However, your asset efficiency is literally half that of your nearest competitor, which is unionized, if I might add. So, I guess why not use this downturn to put more concrete plans in place to exit markets or regions that aren't working? And the $1 billion in permanent costs out, obviously a step in the right direction.\n\nBut I guess how can you address the deficiencies in the network as you see them?\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nWell, thank you, Brandon. I think we are absolutely fully committed to taking cost levers out. We talked about the three buckets, fiscal year '23, the $2.2 billion to $2.7 billion with -- for cost take-out here. We're talking about $4 billion between '23 and '25 and then in the Network 2.0 of $2 billion after that.\n\nSo, those are significant numbers. We are confident in these numbers. We have identified domains with targets. We have people who are focusing on run the business and people focused on transform the business.\n\nAnd we are using cutting-edge technology and some of it is already coming on live here. And all of this is in motion as we speak to deliver value as quickly as possible. So, we are confident, we are committed, and this is definitely the focus of the entire team. As far as TNT is concerned, since you asked that question, you got to go back and look at the -- a little bit of history here.\n\nThere's a portfolio gap that we had in Europe that our competition has -- has been in Europe since 1974, and it took -- it's a very important business and profitable business for them. We had to fill that portfolio gap. Now, has the integration gone exactly the way we thought it would? No, because we had the cyberattack, we had COVID, we had all kinds of things in the middle. But the integration is now complete, and the -- that part of it is done.\n\nWe had -- the service issues are getting better. And we have in our portfolio to sell in Europe that's unmatched and sales is getting on the front foot. So, this is a starting point, if you would call, and that's why we are confident of the improvements that Europe is going to deliver for us over the next two or three years. And again, on the issue of Network 2.0, it's very easy to say yes, put it together and look at the numbers, yes, that's great.\n\nBut the complexity of -- from a technology perspective, from a facilities perspective, other issues is far greater. And most importantly, we have $4 billion of in-network efficiencies we can get relatively easier than that. And oh, by the way, we're building technology that will enable us to get the Network 2.0. So, we think it's the right sequence.\n\nOperator\n\nWe will take our next question from Jordan Alliger with Goldman Sachs. Please go ahead.\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nYeah. Hi. Sort of question for you in light of what could you have done different in the quarter. I guess the magnitude of the Express drop-off was so sharp and I get that [Inaudible] decelerated.\n\nBut I'm just curious, like how did it catch you so off-guard? How do you protect against that in the future? And I would have thought that with the contractual customers you've had, you might have had more of a heads-up that this deceleration was coming. So, maybe you could talk to that. Thank you.\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nLet me talk about the -- talk about timing and then maybe, Brie, if you want to add about what's up on the customers. But the volume did drop off quite suddenly toward the end of the quarter. As you know, we have a complex system form with which multiple constituencies around that. And there's a time lag between the actions we can take on reducing the line haul network.\n\nAnd that's all it is. So, as I said, in October, you will see the full benefit of those takedowns. In terms of customer trends, I don't know, Brie, if you want to add anything more.\n\nBrie Carere -- Executive Vice President and Chief Customer Officer\n\nYeah. What I will say is that from a customer perspective, our customers are incredibly sticky. And what we experienced, especially in August, both in Asia and here in the United States is two things, is their demand actually wasn't there and our customers missed their own forecasts. So, I think from a customer relationship perspective, we are working with them furiously to help them manage their -- the difficulties that they're experiencing in their own business.\n\nBut from a customer stickiness perspective, this is absolutely a reduction of demand within their own business, not a share loss implication.\n\nMike Lenz -- Chief Financial Officer\n\nYeah. Jordan, this is Mike. We also are very intently focused on identifying these variable costs and shortening the time span of which we can realize the reduction there. So, again, there's a span and continuum across different lines of business and nature of costs, but we are intently focused on shortening that horizon.\n\nOperator\n\nWe will take our next question from Helane Becker with Cowen. Please go ahead.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThanks very much, operator. Hi, team. So, just kind of wondering if you could be more specific on flights that you're reducing and parking aircraft to get to this $1.6-ish billion number. Like how should we think about the trade lanes that are going to be impacted and maybe the number of aircraft that are going to be on the ground? Or do you change your Boeing delivery schedule?\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nI'll -- let me hit the trade lanes first and then we'll go to aircraft. I think we have -- we've taken down 11% of Trans-Pacific daily frequencies, 9% of transatlantic daily frequencies, and 17% of daily frequencies in the lane between Asia and Europe. And we will continue to look at it and we'll see what needs to happen post peak, depending upon how the volume we will sold. Mike?\n\nMike Lenz -- Chief Financial Officer\n\nYeah, Helane. In taking that down, we're maintaining connectivity and service in the network, but there's lower volume, so we need less lift. So, as a result, we identified the need to -- the opportunity to park aircraft, just as we have demonstrated in the past, the equivalent of about eight narrow-bodies is what we will be idling temporarily. And so, as you can appreciate, that defers maintenance spending that we otherwise would have had.\n\nAnd of course, you save the operating costs of not flying. So, we'll continue to take that approach for how conditions unfold.\n\nOperator\n\nWe'll take our next question from Chris Wetherbee with Citi. Please go ahead.\n\nChris Wetherbee -- Citi -- Analyst\n\nHi. Thanks. Good afternoon. I guess I wanted to understand the process of the cost-outs, particularly this year.\n\nSo, I think you guys mentioned that $300 million of cost savings is in the fiscal first quarter, another $700 million is realized or expected to be realized in the second quarter. So, that's about 40% or so over the full year, yet the results are running at a level that is about half of what we expected just a week or so ago. So, is this the kind of run rate we should expect as we move into the back half of the year with that extra $1.2 billion to $1.7 billion of costs coming in? Or is there improvement? I guess I'm just struggling, particularly with the second quarter with the $700 million of cost savings relative to EBIT for the total company, which may be in the neighborhood of $1 billion or a little bit north of that.\n\nMike Lenz -- Chief Financial Officer\n\nOK. Chris, so this is Mike. Let me take that in two parts. First, you asked about the second quarter in that.\n\nSo, as we emphasize, we saw the downturn in the demand in the latter part of Q1. And as we expect those trends to persist through all of Q2, while we've accelerated or we'll realize more of the cost savings in Q2 as you highlight, we also have three full months of that step change in demand that occurred late in Q1. So, that certainly pressures Q2 margins. As we go through the year, the savings build, and we expect then that the pressures relative to Q2 will mitigate as we go through -- be less as we go through the year.\n\nOperator\n\nWe will take our next question from Ken Hoexter with Bank of America. Please go ahead.\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nHey. Great. Good afternoon. Just before I get to the question, I just wanted to understand why you chose to launch your Q&A with CNBC versus hosting a conference call.\n\nI just want to understand the philosophy of what we can expect of the message going forward and how you plan on distributing it. Obviously, you had technical issues today, but just to try to understand why you chose that route in getting a message out. But my question is, how do you solve the festering Ground contractor issue? It seems like you talked about purchase transportation cost scaling. You mentioned in your statements, you've pulled some networks.\n\nSome have turned their routes in. It seems like there's really deep concern. Is there opportunity to use this, I don't know whether the cost savings or something, to change the structure there, to resolve some of these issues that the contractors seem to have. Thanks.\n\nMike Lenz -- Chief Financial Officer\n\nKen, this is Mike. First, as it relates to your question about the prerelease, so we felt that was appropriate for the circumstances. That's consistent with market practices and, quite frankly, allowed us to use more time today to be talking about how we're going to address it and our future plans.\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nAs far as the perceived issues on the Ground side, let me just assure you, first of all, that the service levels at FedEx Ground are now reached pre-pandemic levels and we are very well positioned for peak. The 6,000 contractors, we have 96% of them have signed the peak incentive program. And to put that in perspective, this is running ahead of where we were last year. So, a lot of those were in the media.\n\nThey are all much more of a perception issue than reality, and we are well positioned for peak, and we have the support from our team.\n\nOperator\n\nWe will take our next question from Amit Mehrotra with Deutsche Bank. Please go ahead.\n\nAmit Mehrotra -- Deutsche Bank -- Analyst\n\nThanks. Hi, everyone. Mike, I just wanted to ask about the cost-out initiatives this year and if it's a gross or net number because, obviously, the company has a $90 billion cost structure. If it's not net, $2.2 billion to $2.7 billion, it may sound like a lot but if you have 3% inflation on that number, it wipes out the entirety of the cost savings.\n\nSo, I want to know how you think about that if that's a fair or unfair way of characterizing it. And then just very simply, are Express profits going up from here in the fiscal second quarter, or are they going down from here? If you can just answer that as well. Thank you.\n\nMike Lenz -- Chief Financial Officer\n\nSo, Amit, first, as we said, the $2.2 billion to $2.7 billion is relative to our cost plans that we had coming into the year. Now as you rightfully observed, we, as everybody else in the world, is experiencing unprecedented levels of inflation, and so that absolutely impacts our base costs. I guess the best way I would characterize it for you is on an absolute cost basis, the first quarter is the largest of the absolute year-over-year increase. As we move through the year, that will mitigate as the cost initiatives take traction here, and that will offset the cost inflation down the road.\n\nI'm sorry, what was the second question?\n\nAmit Mehrotra -- Deutsche Bank -- Analyst\n\nWell, just if you're just giving me a chance to follow up on that. And then the second question was if Express profits are going up from where we were in the fiscal first quarter, the 1.7% margin or even just absolute profits, are they going up or are they going down in the second quarter? And the way you characterized the answer just now, it just seems like there's still no -- if inflation offsets the growth cost takeout, then basically all of the revenue decline prospectively drops to the bottom line. And so, I just wanted to understand how you -- if you agree with that or how you think about that.\n\nMike Lenz -- Chief Financial Officer\n\nNo, it wouldn't drop to the bottom line because of the actions we're taking. We're reducing costs to adjust to a lower-demand environment. So, while that doesn't leave us at the expectations that we highlighted -- that we outlined in June, it's certainly the case that we're significantly mitigating that as we go through the year. As it relates to Express, I would -- as I highlighted earlier, the demand downturn, particularly in Asia-Pacific, and in Europe occurred late in Q1.\n\nSo, Q2 will be -- we'll see margin pressure, again, at Express, not dissimilar to what we experienced in Q1. But the structural initiatives really gain hold at Express as we move through Q2. So, as you think about the overall cost-outs, Express has more as we move through the year because just of the timing of the big elements there.\n\nOperator\n\nWe will take our next question from Jack Atkins with Stephens. Please go ahead.\n\nJack Atkins -- Stephens Inc. -- Analyst\n\nOK. Thank you for taking my question. So, I guess, Raj, going back to a comment you made earlier about the team, do you feel like you've got the right senior team in place to lead FedEx into the future? There's a clear lack of outside talent on the senior executive committee. Your largest competitor has really benefited from bringing in some outside talent over the last five or so years.\n\nDo you think it would make sense for FedEx to do that as you look forward to really put in some best practices and help drive improved profitability and returns? It seems like that's sort of a missing element to the story here.\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nJack, I think I'm very, very confident in the team that we have. There's a lot of experience here. We have several new players in place. The team is very, very excited.\n\nObviously, we'll look at external talent. We already brought an external talent on several areas of this company, so they're not worse of that at all. It's just that we have a very, very good team, Jack, and I'm very confident that we can deliver.\n\nOperator\n\nWe will take our next question from Jon Chappell with Evercore ISI. Please go ahead.\n\nJon Chappell -- Evercore ISI -- Analyst\n\nThank you. Good afternoon. Brie, I want to ask you about the service challenges that you referenced. I just want to make sure, is that strictly in Europe? We're now six months past the finality of the integration of TNT.\n\nAre you confident that those service issues are behind you? And then the final thing is you think about cost cutting across all the regions, is there a risk that cost-cutting could exacerbate some of the service issues going forward?\n\nBrie Carere -- Executive Vice President and Chief Customer Officer\n\nGreat question. And let me answer the second part first. The answer is absolutely not. At FedEx, one of the things we talk about a lot is quality-driven management and core service actually costs more.\n\nAnd our teams are completely aligned that we are going to reduce cost and continue to improve service. And I cannot emphasize that enough that these things will move hand in hand, and we are very confident in our service at Ground as we head here into the peak season for e-commerce. When we're talking about service in Europe, as Raj mentioned, the margin integration of the airline was successful. We successfully integrated the airline.\n\nIt was very complicated, and we did suffer some service challenges in March. As we stood in front of you in June, we absolutely had improvement from that March point. We did expect continued improvement in July and August. And what we experienced in Europe was a plateau in that service improvement.\n\nAnd I want to be really specific. When we get into Europe, the international domestic markets, when we talk about like our U.K. market or we talk about the France market, that domestic service is actually really, really strong. And then when we get across Europe on the deferred service offerings, it's strong.\n\nWe have to elevate the service within our overnight business in Europe, and that is our No. 1 focus from a service perspective. And yes, I am confident that Karen and her team will continue to improve there. But I just wanted to kind of give you that background of kind of where we're at and what we're looking at moving forward.\n\nAnd absolutely, our entire team knows, reduce cost, and improve service.\n\nOperator\n\nWe will take our next question from Ravi Shanker with Morgan Stanley. Please go ahead.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nHi, everyone. So, regarding the GRI you announced, how do you reconcile pushing through your biggest rate increase in history at a time when your volumes are falling double digits? I mean, isn't that going to exacerbate the volume decline?\n\nBrie Carere -- Executive Vice President and Chief Customer Officer\n\nFair question. I think the answer is inflation. Last year, we had a 5.9% increase in post, and by the way, we have just an incredible insight into our pricing discipline in the market and the commercial tools the team have are just best-in-class. So, last year, we did a 5.9%.\n\nIt was incredibly sticky. We had continued cost increases throughout the year, and so we felt that the 6.9% was appropriate for this year's GRI. We will monitor post-implementation stickiness. And of course, we're constantly looking to balance the yield and the volume and make sure that we get the right volume levels from a utilization perspective.\n\nBut given the inflationary backdrop, yes, we thought this was the right increase for the year.\n\nOperator\n\nWe will take our next question from Ari Rosa with Credit Suisse. Please go ahead.\n\nAri Rosa -- Credit Suisse -- Analyst\n\nGreat. Thanks. So, Raj, as I look at FedEx Freight, it's now producing almost four times the operating income of Express. Just could you talk maybe about how you think about the sustainability of the performance on the Freight side, particularly as we head into a potential downturn? And then to what extent, if we see some of the strength at Freight starting to wane, is it possible that starts to eat into some of the gains that you might see from cost savings at the other units?\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nYeah. Thank you, Ari, for that question. First of all, let me just say, our FedEx Freight team has done -- continue to do a phenomenal job of both managing revenue quality and our operating efficiency to generate fantastic results. And they also form a great piece of our portfolio and also provide synergies on the cost side.\n\nThe point that you made is important because -- but we have -- when there's a significant change, when we went to our last downturn, that we were very much focused on revenue quality and efficiency. And as even through the downturn, actually, the margins expanded. And so, we are very disciplined in this area, and we are executing the plan. We'll have to watch how the market conditions change.\n\nOur volumes have actually, as you can see, have declined, and yet the margins have gone up. And the team has done a fantastic job and I expect them to do that going forward.\n\nOperator\n\nWe will take our next question from Bruce Chan with Stifel. Please go ahead.\n\nBruce Chan -- Stifel Financial Corp. -- Analyst\n\nYes. Thanks, operator. Raj, Brie, I just want to go back to some of your earlier comments and maybe just ask it bluntly. When you think about the miss, how much of the shortfall was volume-related, and how much was from those European service issues? And maybe just a follow-up, if you can give us some color on what exactly you mean by service issues? I might have missed it but it's not really clear to me what that means.\n\nWas it, I guess, customer attrition? And if so, can that come back? Thank you.\n\nBrie Carere -- Executive Vice President and Chief Customer Officer\n\nSo, the short answer is the vast majority of our volume miss was macroeconomic. We talked about it, kind of when you think about the miss, it really was predominantly at Express, with Asia being the largest issue. We believe that was entirely macroeconomic. And then when we get into Europe, there was a split between service and the macroeconomic decline.\n\nI will tell you two things. From a service perspective, when we say service issues, specifically what we're talking about is on the Express portfolio within Europe, across the European network is that we are not hitting that time-definite mark at the level that we expect of FedEx. And so, we need to kind of increase that service commitment there. What I will tell you is that the sales team and our customer base absolutely wants FedEx participating in this market.\n\nAnd we have had strong indications that customers are looking for us in their portfolio in Europe. We have great relationships with large globals here in the United States, and they want us as part of their portfolio in Europe. So, I'm very optimistic about the future in Europe.\n\nOperator\n\nWe will take our next question from Bascome Majors with Susquehanna. Please go ahead.\n\nBascome Majors -- Susquehanna International Group -- Analyst\n\nRaj, you've managed through a lot of change at FedEx since 2016. Just to mention the TNT acquisition, the cyberattack, the trade war downturn and the pandemic, a change in leadership from a founder, and whatever we're going to call the cyclical reversal when we look back on it in a few years here. But as you step back and reflect, are there any management mistakes that FedEx did make? And if so, what can you learn from those mistakes to set your customers and your shareholders up for success over the next three to five years? Thank you.\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nWell, Bascome, I think that's an excellent question. And let me just think about this for a second. You see, 2016 was we're primarily in the B2B space. And when you look ahead of the market, we thought 90% of the growth for the next five years is going to be e-commerce and 10% B2B.\n\nWell, you look back now and look at that time frame, we see almost, not 90% but more than 100% of the growth came from e-commerce. So, we actually expanded our e-commerce portfolio in a big way and expanded our operations. We're very proud of the work we did in creating this portfolio of services in this time frame. We also did one of the most important work in the history of the company, especially with Express by delivering vaccines and healthcare around the world and especially in the time of the great pandemic, where operating a network like ours around the world was extraordinarily complex with changing circumstances.\n\nSo, I'm extremely proud of the team for having executed that. So, this is the time frame we're talking about. So, what we did not anticipate, to be perfectly honest with you, was the tremendous inflation of costs that hit us squarely last year. And that was what really got us.\n\nAnd even with that, we had tremendous results in fiscal year '22 from an EPS perspective. But we absorbed a lot of costs from the inflation side of the house. And then, of course, and now that we're dealing with this situation, we had to build capacity and now we have more capacity than we need. So, could we have timed that a little better? I don't know how you're going to calculate it.\n\nIt's like you can't build half a building. So, it's just -- it is now we are in a position to -- as we laid out at the investor meeting, we are focusing on the things we have control. We are -- our focus is now on improvement of margins, improvement of ROIC, and improve our capital intensive. That's what we're going to do.\n\nAnd this -- again, the economic upturn or downturn, forget about that for a second. Let's focus on the things we can control. And that's why this tremendous cost focus and the structural costs that we are talking about, that's going to get us to these targets.\n\nOperator\n\nWe will take our next question from Todd Fowler with KeyBanc Capital Markets. Please go ahead.\n\nTodd Fowler -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thanks, and good evening. So, I just want to make sure I understand the underlying macro assumptions. Mike, is it that the trends that you saw in August, that that's kind of the run rate now going into the second quarter? Or do you expect some further deceleration from where we were in August? And then is there a risk that there's contagion or we see weakness in Asia and then that comes into the U.S.? Or just kind of how are you thinking about the geographic piece of it? And then lastly, we typically have seen price follow volume.\n\nAnd so, is there a risk on the yield front that as volumes slow, that price follows after that? Thanks.\n\nMike Lenz -- Chief Financial Officer\n\nOK, Todd. So, yes, the basic underlying planning assumptions that we are using is that the demand levels that we experienced in late August will continue through the rest of the year, and so that we're taking actions accordingly to react to that. So, that's the operating assumption now. I don't have a crystal ball about contagion in that.\n\nBut rest assured, we are going to be continuing to focus on the things we can control. And if we need to make further adjustments and reductions in the cost structure, we will move quickly and decisively.\n\nOperator\n\nWe will take our next question from Jeff Kauffman with Vertical Research Partners. Please go ahead.\n\nJeff Kauffman -- Vertical Research Partners -- Analyst\n\nThank you very much, and thank you for the guidance on the cost savings as well. I just wanted to ask because I noticed that the other corporate and overhead part of operating income was about $100 million higher than a year ago. It costs money to park planes and I don't know if you're furloughing pilots or you're reducing those hours. It costs money to reduce routes or consolidate sorts or shut down offices.\n\nDo you guys have any estimate for where those costs are going to be? How much they're going to be? Where are they running through the regular P&L during the quarter? Or was that the $100 million in incremental costs that I saw going through kind of corporate office and other?\n\nMike Lenz -- Chief Financial Officer\n\nJeff, yeah. Let me just specifically address the $100 million, you can put it into two pieces. We had a specific customer bad debt reserve that we booked for $80 million at FedEx Logistics. And so, while we are pursuing legal action, it was the appropriate reserve to take at this point in time.\n\nAnd then while we separate it out in terms of our adjusted earnings, there's also $24 million of our business realignment is in that corporate/other line. So, maybe that gives a little more context for what's there. To clarify, as far as any other -- no charges or anything that was specific to the items you were asking about.\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nAnd there is also no furlough of the pilots. That's not even a thing.\n\nOperator\n\nWe will take our next question from David Vernon with Bernstein. Please go ahead.\n\nDavid Vernon -- Sanford C. Bernstein -- Analyst\n\nHey, good afternoon. So, I appreciate the added color on the cost saves, but reductions from baseline, kind of difficult to book as profitability. Ten weeks ago, we were looking at a low $20 -- EPS number going to something in the low $30s. Is there any to think that those targets for earnings power have actually shifted as a result of what's happening in the market right now or are we just pushing those out? And does the $4 billion of extra cost saves just kind of gets you back to that 10% margin level?\n\nMike Lenz -- Chief Financial Officer\n\nI think, David, the way to frame it is that we fully recognize that the external environment has changed more than we expected. So, we're focused on delivering the margin improvement, lowering the capital intensity that we highlighted, but it's absolutely the case that a greater emphasis will be put on the cost reductions. And so, that's what we're highlighting here today. And we have the specific initiatives and plans in place to go after that and realize that as supportive of the goals that we outlined.\n\nOperator\n\nWe will take our next question from Jairam Nathan with Daiwa. Please go ahead.\n\nJairam Nathan -- Daiwa Securities -- Analyst\n\nHi. Thanks for taking my question. So, I just wanted to clarify. Are there any -- should we account for any cash restructuring expenses or anything of that sort for these cost savings?\n\nMike Lenz -- Chief Financial Officer\n\nSo, to clarify, for the cost savings that we've identified for FY '23, no, there's nothing associated with that. Now previously, as we talked about the broader business optimization initiatives over a number of years, we scoped that that could be potentially in the $2 billion range but that is over a longer time horizon. But the near-term cost initiatives, there is no special charge for that.\n\nOperator\n\nThat concludes today's question-and-answer session. At this time, I will turn the conference back to Raj Subramaniam for any additional or closing remarks.\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nWell, thank you very much. And in closing, let me just say, it goes without saying, it was a challenging quarter. This is a real critical moment in time for FedEx to execute and I'm very confident that we will. The actions we are taking are key components on the path to achieve our long-term targets and make FedEx stronger for a better tomorrow.\n\nThank you for your time today, and thank you for your interest in FedEx.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMickey Foster -- Vice President, Investor Relations\n\nRaj Subramaniam -- President and Chief Executive Officer\n\nBrie Carere -- Executive Vice President and Chief Customer Officer\n\nMike Lenz -- Chief Financial Officer\n\nTom Wadewitz -- UBS -- Analyst\n\nBrian Ossenbeck -- J.P. Morgan -- Analyst\n\nBrandon Oglenski -- Barclays -- Analyst\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nHelane Becker -- Cowen and Company -- Analyst\n\nChris Wetherbee -- Citi -- Analyst\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nAmit Mehrotra -- Deutsche Bank -- Analyst\n\nJack Atkins -- Stephens Inc. -- Analyst\n\nJon Chappell -- Evercore ISI -- Analyst\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nAri Rosa -- Credit Suisse -- Analyst\n\nBruce Chan -- Stifel Financial Corp. -- Analyst\n\nBascome Majors -- Susquehanna International Group -- Analyst\n\nTodd Fowler -- KeyBanc Capital Markets -- Analyst\n\nJeff Kauffman -- Vertical Research Partners -- Analyst\n\nDavid Vernon -- Sanford C. Bernstein -- Analyst\n\nJairam Nathan -- Daiwa Securities -- Analyst\n\nMore FDX analysis\n\nAll earnings call transcripts"
}