{
  "companyName": "BioCryst Pharmaceuticals",
  "companyTicker": "BCRX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/biocryst-pharmaceuticals-bcrx-q3-2022-earnings-cal/",
  "content": "BioCryst Pharmaceuticals (BCRX 2.77%)\nQ3 2022 Earnings Call\nNov 01, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, and welcome to the BioCryst third quarter 2022 earnings conference call. My name is Michelle, and I will be your operator for today's conference. At this time, [Operator instruction] I will now turn the call over to Mr. John Bluth with BioCryst.\n\nSir, you may begin.\n\nJohn Bluth -- Senior Vice President, Investor Relations and Corporate Communications\n\nThanks, Michelle. Good morning, and welcome to BioCryst third quarter 2022 corporate update and financial results conference call. Today's press release and accompanying slides are available on our website. Participating with me today are CEO, Joh Stonehouse; CFO, Anthony Doyle; chief commercial officer, Charlie Gayer; and chief R&D officer, Dr.\n\nHelen Thackray. Following our remarks, we will answer your questions before we begin. Please note that today's conference call will contain forward-looking statements, including those statements regarding future results, unaudited and forward-looking financial information, as well as the company's future performance and or achievement. These statements are subject to known and unknown risks and uncertainties, which may cause our actual results, performance or achievements to be materially different from any future results or performance expressed or implied in this presentation.\n\nYou should not place undue reliance on these forward-looking statements. For additional information, including a detailed discussion of our risk factors, please refer to the company's documents filed with the Securities and Exchange Commission, which can be accessed on our website. I'd now like to turn the call over to Joh Stonehouse.\n\nJon Stonehouse -- Chief Executive Officer\n\nThanks, John. We continue to see steady progress with the ORLADEYO launch and underlying growth trends remain strong. New patient starts are consistent with previous quarters, discontinuations appear to have stabilized, and we are investing more to keep this momentum going. Based on our expectations for continued growth in Q4, we plan to exit 2022, having more than doubled sales from the great start we had last year and will be a quarter of the way to our expected peak of $1 billion globally in just the second year of launch.\n\nWe've shown you long-term data from our trial, and we will continue to show you real-world data that our drug works very well in many patients. The competitive landscape has changed too and is a reminder of how challenging it is to pursue a strategy of oral drugs in HAE. Right now, and perhaps for some time to come, ORLADEYO is the only direct-acting oral with once-daily dosing to prevent HAE attacks. With this unique offering and product profile, we believe this is a therapy every patient should have the opportunity to try to see if it works for them.\n\nCharlie will share more specifics on the ORLADEYO quarter performance in a minute. Our strategy of going after challenging targets, specifically serine proteases for patients suffering from rare diseases is rooted in our ability to discover potent, specific, and bioavailable molecules. In the case of HAE, we were able to do that, do what others haven't, develop an oral once-daily collection inhibitor. We believe this allows us to offer something unique to these patients and we believe HAE is just the start.\n\nIn addition, because these are difficult targets, we don't stop at the first molecule we discover, we work on improved next-generation compounds. We saw that with the world stat in ORLADEYO. We believe we've done it again with Factor D. We are fortunate to have two molecules again, and that puts us in a position to potentially have the first Oral Factor D monotherapy molecule to market.\n\nIn the next generation, that perhaps will be the best. While the future of 9930 is still to be determined, our expectation is we will get an answer to our hypothesis on data from the first 15 or so patients treated for 2 to 3 months by the middle of next year. We have also been working on additional next-generation complement inhibitors, including BCX10013. A potential once-daily Oral Factor D inhibitor that we have advanced into the clinic.\n\nIn Q1 of next year, we plan to show you data in humans that support the potential of once-daily dosing. Our plan is to go into rare disease patients in dose-ranging proof of concept studies with 10013 next year as well. But we won't stop there. The complement system is complex and blocking more than one pathway allows us to go after more rare diseases, and may be necessary to successfully treat patients.\n\nSo we also have a discovery effort, and we're making great progress on other targets in the complement system. If successful, we'll be able to go after other rare diseases and possibly combine molecules to make the best therapy in one capsule or tablet. We plan to show you more in an R&D day next year. So, the goal simply stated is to be the global leader in complement.\n\nSimple to state, but very challenging to do. We believe the strategy in our discovery platform allows us to do things others may not be able to do, and we look forward to showcasing it to you next year. So what does this mean for you as a shareholder? It starts with the evidence that we can successfully discover, develop, and launch an oral drug directed at a challenging target that offers something unique to patients. The result we expect is ORLADEYO will fill an unmet need for thousands of HAE patients and will reach $1 billion in global peak sales.\n\nThat is a major accomplishment that sets us apart to create meaningful value for patients and shareholders. And we plan to do it again and complement, but not with one molecule or one pathway. Imagine many molecules from multiple pathways making the best and unique therapies others may not. That value is many, many more patients and potentially multiples of ORLADEYO peak sales.\n\nNow, I'll turn the call over to Charlie to go over the ORLADEYO performance.\n\nCharlie Gayer -- Chief Commercial Officer\n\nThanks, Jon. The core metrics for ORLADEYO were strong once again in the third quarter. New patient starts were right in line with our six-quarter running average. The absolute number of discontinuations was flat to slightly improved for the second quarter in a row, and we saw a 9% growth in patients on paid therapy.\n\nAll these metrics point to what we have described previously, a pattern of consistent linear growth for ORLADEYO. I'll share more detail on what we saw in the quarter, and later, Anthony will provide context for how patient growth translated to revenue. We continued to add breadth and depth to the ORLADEYO prescriber base, and several facts point to our ability to expand ORLADEYO use. The overall prescriber base grew by another 11% in Q3, and we had the largest number of repeat prescribers in a quarter, as more physicians offer ORLADEYO to additional patients in their practices.\n\nTop 500 HAE treaters accounted for 54% of new ORLADEYO prescriptions, and about 25% of top 500 prescribers in Q3 were newly activated. We also have the largest number of tier-two prescribers in any quarter-to-date. These trends are consistent with another survey that we conducted with 60 allergists in September. As we have seen in prior surveys, physicians anticipated the percentage of their patients treated with ORLADEYO would grow more than any other HAE therapy over the next 12 months.\n\nThey anticipate expanding use because they have seen our long-term clinical data. Many also have firsthand experience with our ORLADEYO, and our physician survey shows that ORLADEYO is the most requested HAE prophylaxis medication among patients. Next week at the American College of Asthma, Allergy, and Immunology Congress, we will have an oral presentation and a poster from large cohorts of patients who started on ORLADEYO after the launch. This real-world evidence confirms what physicians are seeing, regardless of baseline attack rate or prior therapy, patients experience excellent long-term control. Even with the success we've seen since launch, we constantly evaluate opportunities to invest, to do more. In Q3, we identified two such opportunities.\n\nThe first is to add incrementally to our sales team to further accelerate impact in Top 500 position. The second is to add to our field market access team so that as we broaden our prescriber base, we can help practices that have less experience seeking payor authorization for HAE therapies. As we round out the second year on the market for ORLADEYO, we are excited about the future potential. One month into this quarter, our underlying metric remains strong. We expect to see a double-digit revenue growth percentage in the fourth quarter, with total ORLADEYO sales for the year ending at $255 million, more than doubling 2021 sales.\n\nHelen, I'll turn the call over to you.\n\nHelen Thackray -- Chief Research and Development Officer\n\nThanks, Charlie. Today, I'll discuss a few significant updates on our pipeline program, including progress with our current molecules, and our future goals for advancing multiple new drug candidates to treat complement-mediated diseases. As we continue to advance our pipeline, an important goal, which we believe is achievable, is to bring novel orally delivered products forward to treat many complement-mediated diseases. Our vision is to be the global leader in delivering medications, targeting dysfunction across the complement system. What's new with BioCryst today is some important progress we've made toward that vision.\n\nWe have expanded our Factor D inhibitor program toward targeting the alternative pathway with a second potentially best-in-class molecule in the clinic. And we have identified several additional targets, where there is potential for oral drugs to address the other major pathways of the complement system. Our discovery team has already made progress toward generating molecules for each of these targets, giving us confidence that our unique discovery platform has the capability to produce oral drugs for these challenging targets. If successful, this would multiply our opportunities to treat diseases mediated by dysregulation of the complement cascade. So in total, we are not only adding a second Oral Factor D inhibitor to our portfolio for the alternative pathway, but also building the potential for multiple additional oral drugs to address diseases across the complement system, including those of the classical pathway, lectin pathway, and terminal pathway. We intend to invest in the development of a number of oral medicines for these targets. If we are successful in delivering world treatments for more than one pathway in the complement system, imagine also the possibility of addressing several pathways at once with combined oral drugs.\n\nThis could expand treatment opportunities even further. With monotherapy single pathway approaches and with combination multiple pathway approaches for treatment of the most complex or serious diseases. Now we'll go into some of the specifics illustrating why we believe we can deliver both a first and then a best-in-class oral monotherapy Factor D inhibitor for a program targeting the alternative pathway. Overall, the goals of this program are twofold. One, to quickly bring a first molecule to market, putting BioCryst in a position to deliver the first, safe, and effective oral monotherapy Factor D inhibitor to patients across multiple complement-mediated diseases.\n\nBCX9930 has the potential to achieve this, and our near-term focus is on assessing swiftly and efficiently, whether we have successfully identified a safe and effective dose regimen that will keep us ready in pivotal trials in PNH on a path to registration. And two, to continue to produce and advance unique new molecules to achieve best-in-class outcomes for patients. By this, we mean molecules that bring some combination of improved potency, improved safety, or with longer exposure at therapeutic levels with oral delivery. And even more specifically, we mean a therapy that is differentiated in the field by delivering a safe and effective therapy in a once-daily dose. We did this with ORLADEYO, and we believe we can do it again.\n\nWith BCX9930, we've made steady progress toward reinitiating enrollment with the pivotal program. We've begun screening new patients for enrollment and redeem trials and are gaining some initial experience at the lower dose in patients already on our studies. You will remember that we amended the Redeem and Renew protocols with a new dosing regimen of 400 milligrams twice daily with a brief step up at the start of dosing, in our effort to confirm a safe and effective dose for BCX9930. Our hypothesis is that this new dosing regimen, together with attention to simple hydration, may prevent the rise in serum creatinine observed in some patients previously at 500 milligrams twice daily. All patients who continue on BCX9930 have been switched from 500 milligrams to a lower dose.\n\nAt this point, and with initial and limited experience, it is too early to draw any conclusions about the fact of these steps. Of course, if we observe something that warrants holding, we're just continuing the program, we will update you earlier as that occurs. Otherwise, our plan is to bring an update mid-2023 with more robust data from approximately 15 newly enrolled patients. If the new dosing regimen resolves the observations of renal injury, our plan would be to invest fully in the pivotal program and bring BCX9930 to market as quickly as possible. And if this is not demonstrated, we will discontinue the program. In addition, as I mentioned earlier, we are also advancing BCX10013 as the second unique molecule with the potential to be a differentiated product for the proximal alternative pathway of complement with once-daily dosing.\n\nBCX10013 has been moving at full speed for some time, and as a result is already in the clinic. We are reporting today the BCX10013 is being assessed in healthy volunteers at multiple dose levels, including at potentially therapeutic dose levels with single ascending doses and multiple ascending doses. Approximately 90 healthy volunteers have been dosed with BCX10013 at this point, and so far we have observed an initial safety tolerability and PK profile that's not only supportive advancing into evaluation in patients, but also looks promising for once-daily dosing. Our plan is to initiate patient studies to confirm the best dose level for advancement into a registration program. We'll have more to share with you about the data and the plan for this program in first quarter 2023. Finally, in other pipeline updates, I'll turn to BCX9250 and [inaudible].\n\nHere, the competitive landscape for the ultra-rare disease, this ultra-rare disease is increasingly crowded, including with several late-stage programs assessing the same mechanism of action for the treatment of this disease as BCX9250 that of ALK two inhibition. We have concluded that it's increasingly likely the needs of patients here may be served by other products before BCX9250 can achieve registration. We are therefore discontinuing development BCX9250, and redirecting the investment of this program toward our many opportunities and complement. To conclude today's update on our pipeline, I'll repeat a theme you've heard from us before. We have succeeded with delivering orally administrated orally administered small molecules for challenging target. This capability gives us very high confidence that we can achieve our goal discussed today to deliver oral drugs across multiple, very different difficult targets in the complement system.\n\nNow, I'll pass it to Anthony.\n\nAnthony Doyle -- Chief Financial Officer\n\nThanks, Helen. With ORLADEYO on net revenue for the quarter coming in at $66 million, that puts the trailing 12-month revenue at around $227 million. That's already over $100 million more than our 2021 full year revenue. When comparing Q2 ORLADEYO revenue, which came in at $65.2 million to Q3 revenue at $66 million.\n\nThere are a couple of things that we need to review to align to our comment on study growth. For Q2, we had a $2.2 million positive out-of-period reimbursement adjustment. We also had over $1 million of what would ordinarily have been July shipment a patients requested to ship in June due to the 4th of July holiday. For Q3, we also had a 500 K negative out-of-period reimbursement adjustment. Factoring in these elements, Q2 revenue would have come in at closer to $62 million, while Q3 revenue would have come in at $67.5 million. That's around 9% growth quarter-over-quarter.\n\nEven without taking into consideration these adjustments, the compounded quarterly growth rate from the end of last year where Q4 came in and around $46 million to Q3 of 2022 is over 9% growth quarter-over-quarter. The steady growth driven by the consistency of new starts and stabilizing DC rate, coupled with continued global expansion, gives us confidence that Q4 will deliver double-digit percentage growth over Q3, and as Charlie said, we are forecasting revenue for full year 2022 at $255 million. That's more than double our net revenue from last year and positions us well on our path to $1 billion of global peak sales. You can find our detailed third quarter financials in today's earnings press release, and I'd like to call your attention to a few items.\n\nTotal revenue for the quarter was $75.8 million, outside of the $66 million from ORLADEYO, the remaining revenue came from a $6.9 million wrap of our stockpile order and $2.9 million from ramp-above API sales to our partners. Operating expenses, not including non-cash compensation for the quarter was $83.3 million, and cash at the end of the quarter was up $463 million, that includes the $75 million that we drew from the offering facility in July. Capital allocation is critical to growing biotechs like ours, and when 9930 enrollment was paused, our team did a great job of controlling both internal and external spend. At the same time as identifying a hypothesis to potentially remediate the issue, getting agreement from the FDA to lift the partial clinical hold, and ultimately getting the trials back up and running as quickly as they did. When we started the year, we guided ORLADEYO net revenue of no less than $250 million, and OpEx of between $440 and $480 million.\n\nBefore the enrollment hole for 9930, we were definitely looking at being on the higher end of the [inaudible] We're now guiding to $255 million in revenue, and between $365 and $370 million of OpEx for full year 2022, which is more than $100 million less in OpEx than the higher end of that initial guidance. Net cash utilization is therefore significantly lower than we had anticipated coming into the year, which in the current macroeconomic environment is tremendously valuable. As Helen mentioned, we're also discontinuing BCX9250, which would have required more than $100 million of investment over the coming years. The disciplined approach to capital allocation, and our healthy balance sheet puts us in a strong position to invest in our future growth opportunities. Now, operator, we'll be happy to open up to Q&A.\n\nOperator\n\nThank you, sir. [Operator instruction] And the first question in the queue comes from Ken Cacciatore with Cowen and Company. Sir, your line is open.\n\nKen Cacciatore -- Cowen and Company -- Analyst\n\nThanks so much. Great explanation on Q3, appreciate that on ORLADEYO. Just wondering, with the investments that you're making to continue to press the advantage you have with the commercial spend, do you want to give us a little bit of thoughts as we look into 2023? It seems like Q4 is on a nice trend already. Maybe any context you can provide for ORLADEYO, and maybe discuss when we should start seeing a little bit more ex-U.S.\n\ncontribution. And I want to give a follow-up now because I know you want to limit it to one question. John, just in general, what do you think about the company, wonderful success commercially with ORLADEYO and on the pathway to $1 billion, but an earlier stage pipeline, we saw Biohaven take the opportunity to really maximize the value of their lead commercial asset with the pipeline that was trailing, as you kind of look at the company and how the value you've created in ORLADEY, plus kind of a little bit of an earlier stage pipeline albeit we hope 9930 continues to progress. Can you just talk about how the company is looking at maybe maximizing the value of these two? Would something like Biohaven's approach make sense to your organization? Thanks so much.\n\nJon Stonehouse -- Chief Executive Officer\n\nYeah. Tell you what, I'll take the first one. Well, I actually.\n\nCharlie Gayer -- Chief Commercial Officer\n\nYou want to start with the last one and I'll come back to it.\n\nJon Stonehouse -- Chief Executive Officer\n\nYeah. So Ken, the strategy I guess I look at it slightly differently, we have a pivotal program going on with 9930, and our expectation is if we find a safe and effective dose, we're off to the races with that molecule, and then competing with an oral drug in an injectable space. So I don't see a big gap there. And at the end of the day, it's steady revenue growth.\n\nSo if we're not burning a lot of capital on the R&D side, the revenue catches up, and you saw that this year when Anthony's guidance I mean, we're a little more than what, $100 million apart for the year in terms of revenue and an expense. So, I mean, if you look at all the other biotech companies around our size, that is a unique position to be in. We'll always be open to other options, and other creative solutions like Biohaven has done. But for right now, we're building a pipeline and we're launching a drug that we believe is going to be $1 billion. Charlie\n\nCharlie Gayer -- Chief Commercial Officer\n\nKen, and so on your other questions around the commercial investments, I think the first thing to say is and John mentioned this upfront, we still have all confidence in the world that this is a $1 billion peak sales drug. And so as we look to make other investments, it's really about being as efficient and accelerated in that process as possible. You're asking around 2023, I think we'll give guidance for 2023 in early next year. But we feel very good about our trajectory based on the underlying trends. And then as far as ex-U.S., eventually at some point we'll probably start to break that out.\n\nIt's still for 2022, a small percentage of sales. But everything that we see in the underlying trends in Europe and beyond gives us confidence that that will contribute to hundred million plus at peak sales. So we're feeling really good about where we are.\n\nKen Cacciatore -- Cowen and Company -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nThank you. The next question to you comes from Chris Raymond with Piper Sandler.\n\nChris Raymond -- Piper Sandler -- Analyst\n\nHey, guys. Thanks. So a question, and also a follow-up. Just on ORLADEYO quarterly quarter-to-quarter dynamics.\n\nAppreciate the color and the puts and takes from Q2 and also Q3. But can you maybe provide some color on the timing for understanding this dynamic and recognizing that pull forward? I'm just curious because it wasn't mentioned last quarter and just getting hit by some investors wondering why. And then maybe as a follow-up, on the next generation molecule 10013, can you walk us through what you know, pretty clinically that gives you confidence that you won't run into the same sort of renal signal as 9930?\n\nJon Stonehouse -- Chief Executive Officer\n\nYes. Maybe I'll take the first one, Anthony. If I go wrong direction you can correct me. But we did point out that there was $2.2 million of non-period accrual adjustment in the second quarter that made that higher than normal. And then, you don't know the differences between the two until you finish a quarter.\n\nRight. And so we had some our finish a month like July. And what happened in retrospect is July 4th landed on a Monday, I believe, this year and a bunch of shipments came in prior to that because I'm sure people weren't home. And as a result, it got shipped in June instead of July. So I don't know if there's anything else to add.\n\nAnthony Doyle -- Chief Financial Officer\n\nJust I mean, will things like this happen? They will, right? I think what we're not going to do is solely focus on that quarter to quarter. But that's why we lean into the idea of the underlying strength. Right. We feel really good around where we are, where we're going from a growth perspective and that we're on that path to $1 billion. So in the future, will there be some kind of quarter over quarter as it relates to holidays or seasonality? Maybe? But I think hitting on that underlying growth factors, and how confident it makes us in terms of getting to the $255 for this year and $1 billion thereafter is our focus.\n\nJon Stonehouse -- Chief Executive Officer\n\nYeah. Last thing I'd say on that front is we're the only ones with the data at the end of the day, no offense to those of you trying to guess. And so we think we're the most accurate guider. And we believe we're telling you right now that we believe we'll finish the year at $255. And that's a spectacular outcome given that we blew away the first year with 122 so more than doubling.\n\nHelen, you want to take the second part of Chris's question?\n\nHelen Thackray -- Chief Research and Development Officer\n\nYes. So it's BCX100013. We don't know yet that we will not see what we're seeing with 9930. However, we do know a number of things that give us confidence.\n\nOne is it's a unique molecule, which means it has its own unique characteristic, and so we expect it to behave differently in the clinic, and we're seeing that. Two, as we know what we saw with 9930. With this year 9930, we've learned from that with applied that in our process with both preclinical and clinical data. And again, what we're seeing in the clinic with BCX10013 as supportive of proceeding and patient trials, and supportive of the potential for once-daily dosing.\n\nJon Stonehouse -- Chief Executive Officer\n\nAnd so some of it, you know, we've gathered data that gives us confidence that it could be different. And then there's some that's just not mature enough that we can't declare that it's that different, we won't see it. But we will be moving it forward if we thought there was a high risk here.\n\nChris Raymond -- Piper Sandler -- Analyst\n\nSo excellent. Thank you, guys.\n\nOperator\n\nAnd the next question in the queue comes from Jessica Fye with J.P. Morgan.\n\nDaniel Chen -- JPMorgan Chase and Company -- Analyst\n\nMorning, guys. Thanks for taking our question. This is Daniel for just for Jess. A couple of questions. First, I guess you've elaborated a little bit on this, but what were the inputs you considered when narrowing down the full-year guidance to the lower end of the prior numbers? And to understanding that we'll see detailed data in early 2023 for 10013. But maybe you can you elaborate on some. Of the early clinical details that have generated with that product? For example, in terms of AP hemolysis, that was a just a one-state oral therapy.\n\nIf I can sneak one more is assuming that maybe assuming you're still in a position, assuming you still position 10013, similarly to you have been developing the 49930 before by targeting multiple oral indications. How are you thinking about the potential impact of an IRA, and how that might not encourage drug developers to develop more than one or an indication for the asset? Thanks.\n\nJon Stonehouse -- Chief Executive Officer\n\nYou're referring to the Inflation Reduction Act and the multiple indications on one molecule?\n\nDaniel Chen -- JPMorgan Chase and Company -- Analyst\n\nYep. Yeah.\n\nJon Stonehouse -- Chief Executive Officer\n\nI'll come back to that. Helen, you can take the 10013. I'll take the lower end. And Anthony, again, help me here.\n\nSo, I mean, it's real simple, Daniel, we have another quarter's worth of data, and we're into November now, and so we've said we would be the accurate guide here, and we believe we're going to be at $255. This is, I think one big difference in rare diseases versus mass markets is it doesn't take a lot of patients to have a movement one direction or another. So we're real confident in the $255. And that's a doubling or more than a doubling of the first year great start.\n\nHelen, you want to take the 10013?\n\nHelen Thackray -- Chief Research and Development Officer\n\nYeah, sure. So in terms of the early clinical data with 10013 and this is just to be clear, this is in healthy volunteers. So we have 90, about nine healthy volunteers who've been dosed with the drug. And so we have safety data and pharmacokinetics data for those individuals we have that, including dose levels that may be therapeutic in range, and we do not have data on patients at this point. So our plan is to move into patients next year to assess the potential for the complement activity.\n\nJon Stonehouse -- Chief Executive Officer\n\nAnd then on the Inflation Reduction Act, I think there's a lot of implementation, a lot of unknowns yet that have to occur before we can draw any conclusions. And maybe we are different than others, but we're not going to say we're not going to bring a molecule forward in a bunch of other indications when patients are in need. And we think that we can create real value for shareholders. So, it's certainly on our radar. But, one of the beauties I think in the complement system is single molecules can go after multiple diseases.\n\nAnd so that's our plan.\n\nOperator\n\nThank you. The next question in the queue comes from Brian Abrahams with RBC Capital.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nHi, this is Joe, in for Brian. Thank you for taking our question. I just wanted to ask one question on ORLADEYO once again. If you can tell us anything about like any improvement you're seeing and patient retention rate and, if there were any specific types of patients that they tend to stay on longer ORLADEYO. And how is your education or awareness initiative impacting this retention rates as a break [inaudible] Thank you.\n\nCharlie Gayer -- Chief Commercial Officer\n\nSure. Yeah. So as I mentioned on the call, first of all, we've seen two quarters in a row now of flat patient retention or patient discontinuations even as our overall patient base has grown. So I think we're making a difference.\n\nWhat we see is the patient types that do absolutely the best are patients who sweat, who are controlled on other prophylactic therapies, and then switch over. And in particular, patients who had been on paid therapy, or as I've said previously about 70% of those patients stay on ORLADEYO for at least 12 months. And so that's what we're really focused on, is getting the right patient type to switch ORLADEYO. And then as any patient starts off, we really focus on setting expectations for both efficacy and any side effects that some patients may experience, and we see that that makes a difference. So we're pleased with where we are with patient retention, and we think that this is going to be pretty stable going forward.\n\nJon Stonehouse -- Chief Executive Officer\n\nAnd Charlie mentioned this point around the college meeting, and I would just encourage people to watch the presentation and look at the poster because there's some real-world data in there that's incredibly encouraging around, as Charlie described, the best switches are the ones that are on controlled on prophy, injectable prophy. So, you know, our view remains that if you can be controlled on our drug on a once-daily capsule, why on earth would you not try it and see if it works for you? Right. And so that's our goal. We're continuing to chip away at this, and we believe we're making really good progress on our way to many thousands of patients and, peak sales of $1 billion.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nThank you for the insight.\n\nOperator\n\nAnd the next question in the queue comes from Jon Wolleben with JMP Securities.\n\nJon Wolleben -- JMP Securities -- Analyst\n\nHey, good morning. Thanks for taking the question. Two for me, I was hoping you could comment a bit on what you're seeing on growth net adjustment. As we're moving forward, you gave some comments on paid patient growth, which is helpful.\n\nAnd then also when you talk about the 15 patients from 9930 from what you want to see data to make the [inaudible] decision. I just want to check, is this strictly a PNH patient, or is it the real patients, as well or some combination? How are you thinking about what makes up that go no go population? Thanks.\n\nJon Stonehouse -- Chief Executive Officer\n\nYeah, I'll take. There's been no major movements in gross, and you know we talked about in Q1 the impact that we had there. But for Q2, 3, and 4, our expectation has been that it would be stable on reimbursed patients. Again, we said around 15% to 20%. Charlie talked previously around what we did from a PBM coverage, and insurance or payer coverage perspective at north of 80%.\n\nSo, Jon, I don't think there's any kind of big drivers we will continue to see from a percentage numerator versus denominator perspective, including free product that get toward the 15% to 20%. We still feel good about that, but no major movements from Q2. And then the 15 patients Helen?\n\nHelen Thackray -- Chief Research and Development Officer\n\nYeah. So the 15 patients we're looking for, first of all, approximately 15 patients, that's the right number for us to be able to have confidence in the data to continue to advance the program. Secondly, it's likely to be patients mostly from the Redeem Studies with PNH, if that's a program where we have more sites, two global pivotal trials, and we're likely to see enrollment faster there. In the Renew program, we will continue to enroll in that program. There's also a Brennan period built in, and so it may take longer for patients to be dosed and proceed to an outcome.\n\nSo we assume it's going to be mostly PNH.\n\nJon Stonehouse -- Chief Executive Officer\n\nYeah, remember, Jon, that they've got to have a biopsy to make sure that they truly have disease in the [inaudible] so that just takes long.\n\nJon Wolleben -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\nThe next question in the queue comes from Gena Wang with Barclays. Your line is open, ma'am.\n\nGena Wang -- Barclays -- Analyst\n\nThank you for taking my question. I have a question regarding ORLADEYO launch. So give me your prior comment, just wondering, is retention rate now maintained at the middle 60? And then my next question is regarding 2022, and your guidance $255. I just did a quick math.\n\nYou know, that will translate to $74.5 million for 4Q. And if we use like $67.5 million for 3Q, that we have a $7 million growth. And we are only one month into 4Q, and also we have holidays in 4Q. Just wondering what makes you confident you can achieve or Q numbers.\n\nAnthony Doyle -- Chief Financial Officer\n\nCharlie, you want to take the retention?\n\nCharlie Gayer -- Chief Commercial Officer\n\nSure. Yeah. So Gena, the one-year retention overall. Yes, in the mid 60 percentage.\n\nAnd then what we're really seeing is that, and we've talked about this before is where we lose the majority of patients is in the first few months then up to six months. Once patients get out to a year, they're doing well on or they're only going to stay on if they're doing well. And so those patients are much more likely to stay on for the long term.\n\nAnthony Doyle -- Chief Financial Officer\n\nYou want to take it?\n\nJon Stonehouse -- Chief Executive Officer\n\nSure. \n\nAnthony Doyle -- Chief Financial Officer\n\nFourth quarter?\n\nJon Stonehouse -- Chief Executive Officer\n\nNo. You know what? I think for Q4, Charlie talked about steady growth. That is Gena, from an underlying perspective, what we're seeing. And so I think getting to those numbers that you're talking about, right, to get to the $255.\n\nGiven where we are coming into November out of October, I think we feel really good that we feel really confident about heading out to $255.\n\nCharlie Gayer -- Chief Commercial Officer\n\nYeah. And we don't guide quarterly, but by the fact that we say $255 giving you three-quarters worth of revenue, we are basically guiding you in the fourth quarter. Yes.\n\nOperator\n\nThank you. And the next question comes from Justin Kim with Oppenheimer and Company.\n\nJustin Kim -- Oppenheimer and Company -- Analyst\n\nHi, and good morning. Thanks for taking the question. You know, as you think about sort of full speed ahead for the Redeem Studies later next year, could you describe how much separation you see between 9930 and 10013 program? Just from a timing perspective and any sort of progress with 10013 that might just incentivize commercialization of the next generation inhibitor.\n\nHelen Thackray -- Chief Research and Development Officer\n\nYeah, I'm sure, I can take that. So the regime studies it, just to be clear, we are going quickly with redeem studies, and the question is whether we continue that. So they are advancing, this is a pivotal program. We expected to be the first program to read out.\n\nWe expect to be the first program to market. Should we have successfully addressed the dose for safe and effective drug. So that is the in position to be the first market. And we have a file, a second-generation molecule that is also in a position to get to market. It's early, it's in phase one, we have healthy volunteer data, but we think it has the potential to be best in class, and so we're bringing it through behind.\n\nAnthony Doyle -- Chief Financial Officer\n\nYeah, I mean, it's about two years at the end of the day between the two, but one of them is in a pivotal study, and one of those in a phase one. And so if we find the safe and effective dose, we've got something that creates real value for patients in this market. And so, of course, we would invest in it if we have a safe and effective dose. I think the more important question is how do we allocate what we go after with each molecule, in our view, is probably a skinnier set of indications for 9930. That's how we see it today.\n\nAnd then because we believe 10013 has the potential to be best, maybe a broader set of indications for that one. But that's, you know, we'll see how the programs unfold over time and give you more clarity on that later.\n\nJustin Kim -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nThe next question in the queue comes from Tazeen Ahmad from Bank of America. Your line is open.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning. Thanks for taking my question. I think most of them have been answered.\n\nFor 4Q now that you have some experience calendar-wise with the launch, do you expect in general any kind of seasonality? And then secondly, on the subject of pricing, you know, historically rare drugs have been able to take at least annual price increases as you talk to insurers payers, has there been any change in tone on that? Obviously not asking you to guide, but just in terms of any kind of sentiment shift that you may or may not be seeing from payers. And then lastly, as you think about 2023 sales for ORLADEYO, where do you think your biggest area of untapped demand lies going forward? Thanks.\n\nJon Stonehouse -- Chief Executive Officer\n\nSo who wants to take the seasonality piece?\n\nCharlie Gayer -- Chief Commercial Officer\n\nOK. I can. So, Tazeen, I think, you know, looking forward into the new year, I think we'll see the same kind of seasonality that we saw last year kind of going into Q1. As we talked about, That's always a time when the majority or a good portion of the patients have to go through prior authorization.\n\nSo I think we'll comment more on that next quarter, but you can anticipate that. As far as pricing, we don't obviously, we don't comment on general pricing, but payer sensitivity, no, I think, you know, payers are always sensitive to high-priced therapies for rare diseases like HAE. But we're not seeing anything notable about that.\n\nJon Stonehouse -- Chief Executive Officer\n\nAnd there was one of the 2023 untapped potential market that let me start then you can add, you know, I think this further investment that Charlie talked about, we'll see the bulk of the value that come in in 2023 for sure. But the message has been consistent quarter after quarter after quarter. The best patients that we get are ones that are controlled on injectable pro-fee that switch over to ORLADEYO, and again I'd encourage you to to pay attention to what we're presenting at the college meeting. So continuing to pick away, and chip away at that I think is the key. And then you've heard me comment today and many times over over the quarters around our top 500 versus Tier two, and recall for everyone the top 500 is about half the HAE market, and then there's tier two and we had 54% of our new prescriptions come from the top 500, so really great balance.\n\nAnd we see opportunities in both hands kind of at the top of the market and then expanding the market. And so as we've expanded our team a little bit, it's to take advantage of both of those segments.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nAnd the next question the queue comes from [inaudible] with Needham and Company.\n\nUnknown speaker\n\nHi, this is [inaudible] Thanks for taking my question. You just talk about how the recent setbacks with other oral HAE prophylactic products in development changes your long-term outlook for ORLADEYO, and how do you see the competitive landscape playing out? Thanks.\n\nJon Stonehouse -- Chief Executive Officer\n\nYeah, I think I said it in my comments. It's just a reminder of how challenging it is to make a potent, specific orally bioavailable drug. I think there are now five companies, including us, with a world stat that had programs that had to be stopped. So, you know, these are really hard. What the flipside of that is, it means we may be the only one at the end of the day.\n\nAnd so that puts us in a spectacular position because we know that patients really want an oral, they want a decreased burden of disease and a decreased burden of therapy. And you can offer that with one capsule once a day with ORLADEYO. So I don't think it dramatically changes. The other piece I would say to the question, too, is we're absolutely in our competitors that are in the market that are have profit drugs are seeing this as well, is the market is definitely moving more and more and more to the prophy, and away from on demand. And I think on demand is going to be a tiny, tiny piece of the market ultimately, and then we'll be battling out with injectables for the prophy.\n\nUnknown speaker\n\nOK. Thanks.\n\nJon Stonehouse -- Chief Executive Officer\n\nYep.\n\nOperator\n\nThank you. And our last question comes from Maury Raycroft with Jefferies.\n\nMaury Raycroft -- Jefferies -- Analyst\n\nHi. Good morning, and thanks for taking my question. I'm just wondering if you can elaborate more on the comment about investing more to keep the ORLADEYO momentum going. You mentioned the increase in sales team in addition to field market teams.\n\nIs that the further investment you're referring to? And will you continue to add to these teams, or are you at a status quo at this point heading into 2023?\n\nJon Stonehouse -- Chief Executive Officer\n\nSurely, it might be good to just talk about one of the keys to the success of the launch so far has been your agility, right? Look at that data, understand what the data is telling you, and then making adjustments.\n\nCharlie Gayer -- Chief Commercial Officer\n\nYeah. So more to Jon's points, we have always looked where we can do more, and we when we built the launch when we built the team, we felt and we did have a great team that was ready to compete in the space, and I think we've seen that. Then what we're always doing is looking where we can do just a little bit more at the margins. And so previously have talked about how we added some additional field-based patient-facing members of the team because that's a need that we saw. And now we saw an opportunity just to add a little more to our sales team and a market access team.\n\nSo we'll continue to look for these opportunities. We feel good about where we're at right now, but at some point in the future I may come back and say we've invested a little bit more because we've had other opportunities, but that's the approach we take.\n\nMaury Raycroft -- Jefferies -- Analyst\n\nGot it. Make sense. Thank you.\n\nOperator\n\nWe have no further questions at the queue at this time, so I will now the call over to Mr. Stonehouse for closing remarks.\n\nJon Stonehouse -- Chief Executive Officer\n\nThank you, and thanks for your interest in BioCryst. I was recently shown some data from one of the banks around the number of publicly traded biotech companies. It's a really, really crowded space and what was an eye-popping was the number of companies that are trading below cash. You know, it's a really tough time and you guys know that better than anybody.\n\nBut what I think what's interesting is how do you differentiate yourself when there are so many companies with gene editing, gene therapy, you know, you name it. And I think at BioCryst, the way we see it is we've shown you that we have a discovery engine that can do things perhaps that others can't. Right. In making an oral, potent specific once-a-day Caltrine inhibitor, we've shown you that we can file in the U.S., Europe, and Japan and get approvals all within four months of each other. That's even hard for a big company to do. And we've shown you that we can successfully launch a drug.\n\nRight? I think the initial consensus was $30 million this year, I think it was $218, and we've consistently beat that. Right. And why? Because we look at the data objectively, we develop a plan, and then we figure out how to how to get the business. And so that puts us in a different category, I think than a lot of other companies. And then the last point is we have access to capital, whether it's revenue or other sources of capital.\n\nWe're not solely dependent on our shares to bring an additional capital into the market. So you add all those things together and then you have a team that, you know, I think your job is really hard, and do you believe what you hear? And I hope we're convincing you that we're trying to be objective in what we see and what we do, that we're disciplined around how we allocate capital and what decisions we make. It's hard to make decisions to stop programs. It's hard to make decisions in this business in general.\n\nBut we're not afraid of that. And hopefully, we're showing you that we're trust trustworthy and that we're disciplined in how we do it. So we think we stand out and we look forward to talking to you more and sharing more with you about how that is and hopefully get you more interested in their company. So have a great day, and thanks for your interest in BioCryst.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Bluth -- Senior Vice President, Investor Relations and Corporate Communications\n\nJon Stonehouse -- Chief Executive Officer\n\nCharlie Gayer -- Chief Commercial Officer\n\nHelen Thackray -- Chief Research and Development Officer\n\nAnthony Doyle -- Chief Financial Officer\n\nKen Cacciatore -- Cowen and Company -- Analyst\n\nChris Raymond -- Piper Sandler -- Analyst\n\nDaniel Chen -- JPMorgan Chase and Company -- Analyst\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nJon Wolleben -- JMP Securities -- Analyst\n\nGena Wang -- Barclays -- Analyst\n\nJustin Kim -- Oppenheimer and Company -- Analyst\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nUnknown speaker\n\nMaury Raycroft -- Jefferies -- Analyst\n\nMore BCRX analysis\n\nAll earnings call transcripts"
}