{
  "companyName": "Sea Limited",
  "companyTicker": "SE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/sea-limited-se-q2-2022-earnings-call-transcript/",
  "content": "Sea Limited (SE -1.48%)\nQ2 2022 Earnings Call\nAug 16, 2022, 7:30 a.m. ET\n\nOperator\n\nGood morning and good evening. Welcome to the Sea Limited second quarter 2022 results conference call. [Operator instructions] Please note this event is being recorded. I'd now like to turn the conference over to Ms.\n\nMinju Song. Please go ahead.\n\nMinju Song -- Senior Manager, Group CCO's Office\n\nThank you, Jason, and hello, everyone, and welcome to Sea's 2022 second quarter earnings conference call. I'm Minju Song from Sea's Group chief corporate officer's office. Before we continue, I would like to remind you that we may make forward-looking statements, which are inherently subject to risks and uncertainties and may not be realized in the future for various reasons as stated in our press release. Also, this call includes a discussion of certain non-GAAP financial measures, such as adjusted EBITDA and net loss, excluding share-based compensation and impairment of goodwill.\n\nWe believe these measures can enact our investors' understanding of the actual cash flows of our major businesses when used as a complement to our GAAP disclosures. For a discussion of the use of non-GAAP financial measures and reconciliation with the closest GAAP measures, please refer to the section on non-GAAP financial measures in our press release. I have with me Sea's chairman and your chief executive officer, Forrest Li; Group chief financial officer, Tony Hou; and Group chief corporate officer, Yanjun Wang. Our management will share strategy and business updates, operating highlights, and financial performance for the second quarter of 2022.\n\nThis will be followed by a Q&A session, in which we welcome any questions you have. With that, let me turn the call over to Forrest.\n\nForrest Li -- Chairman and Group Chief Executive Officer\n\nHello, everyone, and thank you all for joining us today. I'm going to start with an update on our plans to further focus on efficiency and strengthening our ecosystem for long-term profitability and competitiveness. I will also share a few highlights across our businesses as we make steady progress toward these objectives. During the pandemic lockdown, we rapidly scaled our businesses to answer to the fast-rising market demand for online consumption and services.\n\nAs a result, we significantly expanded our businesses and the total addressable market and strengthening our market leadership while improving growth efficiency. We were able to achieve these results by focusing on doing the right thing at the right time in setting our direction and being agile and adaptable in our execution. Now we are in an environment of increased macro uncertainty with rising inflation, rising interest rates, local currency depreciation against the U.S. dollar, and ongoing reopening trends.\n\nIn this environment, being agile and adaptable is even more crucial to the long-term success of our business. We believe the right thing to do at this unprecedented time is to focus even more on self-sufficiency, long-term profitability, and the defensibility in our business operations. Our results for the second quarter demonstrate the early success of this effort. Because of our strong execution in the quarter, Shopee's unique economics improved significantly, driven by efficiency gains across our markets.\n\nIn particular, adjusted EBITDA loss per order before allocation of HQ costs in our Asian market combined was less than $0.01. And we are on track to achieving positive adjusted EBITDA before HQ cost allocation in this region. At the same time, Shopee continued to grow at healthy rates despite the tough year-over-year comparison, with GAAP revenue up 51% year on year, or 56% year on year, adjusting for currency fluctuations. For Garena, quarterly active users were stable quarter on quarter.\n\nThis positive outcome was the result of our efforts around user retention to serve our large game community through more engaging experiences. We will continue to focus on user engagement around our existing franchises, especially Free Fire. Indeed, we are encouraged by Free Fire retaining its top ranking position as the highest-grossing mobile game in Southeast Asia and Latin America during the quarter based on data, data.ai. Synergies between Shopee and SeaMoney also expanded as we continue to cross-sell more financial products and services to our underserved user base across more markets.\n\nClose to 40% of Shopee's quarterly active buyers in Southeast Asia used the SeaMoney products or services during the quarter. SeaMoney's revenue has enjoyed strong growth, and its adjusted EBITDA loss has also continued to narrow during the quarter. With the solid performance across our businesses, group GAAP revenue was $2.9 billion, up 29% year on year in the second quarter. Gross profit grew 17% from last year to reach $1.1 billion for the quarter.\n\nLet's now discuss each business segment, beginning with e-commerce. Shopee continues to appeal to more buyers and sellers across our markets as evidenced by continued leadership in active user and engagement metrics as well as record operational and financial metrics. In the second quarter, Shopee's GAAP revenue grew 51% year on year to reach $1.7 billion driven by GAAP marketplace revenue growing close to 52% over the same period. Gross orders were $2 billion, up 42% from last year.\n\nAnd the GMV grew 27% year on year to reach $19 billion. The currency fluctuations negatively impacted both GAAP revenue and GMV year-on-year growth rate by more than four percentage points. We also drove further improvements in monetization during the quarter as we delivered more value to our sellers across the board. Sellers are investing more with us to pursue growth on our platform.\n\nThese efforts continue to translate into positive financial results. For the period, GAAP marketplace revenue as a percentage of total GMV increased both year on year and quarter on quarter to reach 7.7%. The increase was mainly driven by increases from high-margin revenue streams like transaction-based fees and advertising, which underscores the success of our platform in driving greater economics for our sellers. As a result, there was strong flow through to the bottom line with the better monetization contributing directly toward better profitability.\n\nIn the second quarter, gross profit for Shopee grew by close to 85% year on year and gross margins continued to improve sequentially from the last quarter. Shopee's overall adjusted EBITDA loss also improved sequentially by 13% quarter on quarter. Moreover, in Southeast Asia and Taiwan, adjusted EBITDA loss per order before allocation of HQ costs for the quarter was less than $0.01, which shows that we are well on track toward achieving positive adjusted EBITDA before HQ cost allocation in our Asian market combined. In Brazil, Shopee is also driving greater efficiencies while growing revenue rapidly.\n\nThe adjusted EBITDA loss per order before allocation of HQ cost there was $1.42, improving quarter on quarter. At the same time, GAAP revenue in the market grew more than 270% year on year. We are also optimizing spend around our HQ costs. During the quarter, total HQ costs for Shopee increased by $28 million quarter on quarter, driven by an increase in research and development, staff, and server hosting costs as we expanded our technological capabilities and service offerings.\n\nThis represents a deceleration in cost increases compared to the last quarter. While we will continue to invest to enhance our products, we have been able to strengthen our team significantly in the past period and plan to be prudent in further expanding the team. Meanwhile, Shopee continued to achieve top ranking globally and in our region. In the second quarter, Shopee ranked first in the shopping category globally by total time spending apps and second, by average monthly active users on Google Play according to data.ai.\n\nWe also remained at the top-ranked app in the shopping category by average monthly active users and total time spending app in each of Southeast Asia, Indonesia, and Taiwan. In Brazil, we further strengthened our leading position with Shopee ranking first by average monthly active users in the second quarter while continuing to rank first by total time spent in apps for the shopping category during the quarter. Besides engaging consumers, we are also working closely to support our sellers. We continue to empower our merchants through education and training in addition to providing them better tools and services.\n\nThis remains a key area of focus for us. Across the Shopee seller platform, resources, including our Shopee University and master classes have been especially helpful to the local entrepreneurs and MSMEs. We are also growing our brand partners on Shopee mall in closer collaboration to enable greater engagement with their customers. Staying close to and collaborating with our sellers has enabled Shopee to grow and thrive together with them.\n\nFor example, in Brazil, we estimate that Shopee has become the main source of income for over 300,000 local entrepreneurs and has brought 430,000 new digital entrepreneurs to e-commerce. This has been partly driven by our investments behind training our Brazilian sellers with more than 60,000 sellers attending classes at the Shopee Education Center. Now I would like to discuss our decision to suspend the full year revenue guidance for Shopee driven by the highly volatile and unpredictable macro environment. As shared earlier, while we think the right thing to do during the pandemic lockdown was to prioritize growth with improving efficiency, we think the right thing to do in this time of continuing heightened macro volatility is to prioritize efficiency and self-sufficiency.\n\nAs we have always maintained, we think about managing our businesses as more like marathons rather than sprints, adjusting our case to match the moment is therefore highly important. Our ability to navigate changing times will help us win this long race ultimately. Given our strategic shift, coupled with the various macro factors that are hard to predict, as mentioned before, we believe this is prudent to maximize our focus on efficiency across our business rather than overcommitting, which we believe would be ill-advised at this time of uncertainty. As such, we are suspending the full year guidance for Shopee, which we last provided in May.\n\nEven though we have stopped providing guidance, our focus for the rest of the year remains very clear, which is to continue to improve efficiency by both deepening monetization and optimizing our cost structure. We will be more tightly managing our operating expenses, such as marketing costs and the logistics costs while also gradually increasing monetization across various income streams with a focus on the high-margin ones. More importantly, I want to emphasize that the current macro volatility does not affect our highly positive long-term outlook for our region. Current macro uncertainties do not change the fact that our markets remain some of the areas with the highest long-term growth potential in the world with positive demographic features and deepening digitalization.\n\nThe current macro uncertainties also do not change our demonstrated track record in capturing some of the largest opportunities across the consumer Internet industry in our market. We believe our strong market leadership position will continue to allow us to disproportionately benefit from the long-term industry growth. And our strategic decisions and operational focuses today are all directed at best positioning us to capture these long-term opportunities. Turning to digital entertainment.\n\nIn the second quarter, Garena's GAAP revenue was $900 million and bookings were $717 million. Free Fire remained the most downloaded mobile game globally during the second quarter based on data.ai. It was also the highest-grossing mobile game in Southeast Asia and Latin America during the quarter, maintaining this leading position for 12 consecutive quarters. It is encouraging to see that Free Fire continued to perform well within the mobile game industry.\n\nMoreover, Free Fire shows some early signs of active user stabilization with quarterly active users reaching 619 million, compared to 615 million in the fourth quarter. We continue to focus on investing in user engagement around Free Fire franchise and platform, ensuring a consistent cycle of fresh and new content for our communities. As an example, we celebrated Ramadan with our local communities in the second quarter. During Ramadan, we worked with local celebrities, introduced more items, and hosted a number of community gatherings.\n\nThis highly localized effort allowed us to better engage our local users and enjoy strong monetization during the Ramadan season. New content we introduced in the form of game modes have also helped to diversify the experiences that our gamers can enjoy on Free Fire platform. Alongside the battle royale mode, we are increasingly seeing solid long-lasting retention and engagement around other game modes like clash squad, which is a 4v4 game mode, and Lone Wolf which is 1v1 or 2v2 game mode. Besides being highly engaging and social experiences, these game modes are also shorter and more fast-paced, which are preferred by some gamers, especially as time available for entertainment is more fragmented with reopening.\n\nWhile short-term gaming industry trends remain relatively uncertain due to reopening trends as well as the potential impact from macro volatility, we are highly confident in the long-term structural tailwinds of the segment. We expect this to be even more apparent across our market, where we are well-positioned and the growth runway for digital entertainment is substantial. We also expect this to support the long-term sustained life span of our existing franchises and the platforms. Lastly, our digital financial services business.\n\nIn the second quarter, the synergies between both Shopee and SeaMoney continues to expand, driving revenue and value across the ecosystem. SeaMoney's GAAP revenue for the quarter was $279 million, an increase of 214% year on year. Quarterly active users across our SeaMoney products and services reached close to 53 million, growing 53% from last year. Our mobile wallet total payment volume also grew healthily at 36% year on year to reach $5.7 billion during the quarter.\n\nWith the stronger adoption of our growing portfolio of financial products and services across our Shopee and SeaMoney ecosystem, we are driving greater efficiency across platforms. As such, SeaMoney's adjusted EBITDA loss continued to improve quarter on quarter. A significant population in our market is still underserved around digital financial products and services, and we are well-positioned with our strong ecosystem to serve the largest segment of our market through the direct relationships and the insights we have accrued. At the same time, we are working closely with our partners and other local stakeholders to build a healthy and sustainable environment for the long term.\n\nIn closing, as we navigate an increasingly uncertain market environment, the need for us to be more thoughtful, prudent, and disciplined has only grown. While we have ample resources to achieve self-sufficiency as a business, we are nevertheless rapidly prioritizing profitability and cash flow management. In this current volatile environment, we believe our focus on these areas will be key in setting the businesses up for long-term sustained success. We are also confident that our ability to execute to achieve our objectives during this period will be further supported by our scale, leadership positions, and the proven business models.\n\nWe have articulated clear commitments and are well on track to achieving them. We also continue to be highly optimistic about the long-term potential of the opportunities and the markets we are addressing. With that, I will invite Tony to discuss our financials.\n\nTony Hou -- Group Chief Financial Officer\n\nThank you, Forrest, and thanks to everyone for joining the call. We have included detailed financial schedules together with the corresponding management analysis in today's press release, and Forrest has discussed some of our financial highlights. So I will focus my comments on the other relevant metrics. For Sea, overall, total GAAP revenue increased 29% year on year to $2.9 billion.\n\nThis was mainly driven by the growth in our e-commerce and digital financial services businesses as we continue to leverage the synergies across our platforms. On e-commerce, our second quarter GAAP revenue of $1.7 billion included GAAP marketplace revenue of $1.5 billion, up 62% year on year, and GAAP product revenue of $0.3 billion, up 14% year on year. E-commerce adjusted EBITDA loss was $648 million. Adjusted EBITDA loss per order was $0.33, compared to $0.41 for the second quarter of 2021 as we further improved our growth efficiency and unit economics.\n\nDigital entertainment bookings were $0.7 billion and GAAP revenue was $0.9 billion for the second quarter of 2022. Adjusted EBITDA was $334 million. The slowdown compared to the second quarter of 2021 was mainly due to moderation of user base and user trends post COVID. Digital financial services GAAP revenue was $279 million, an increase of 214% year on year from $89 million in the second quarter of 2021.\n\nThe growth was primarily due to the growing adoption of our financial products and services. Adjusted EBITDA loss was $112 million, compared to $155 million for the second quarter of 2021 as we further improved on our growth efficiency. In the second quarter of 2022, we recorded an impairment of goodwill of $177 million. The goodwill impairment was primarily due to the change in carrying amount of goodwill associated with our prior acquisitions, mainly driven by the lower valuations amid the market uncertainties.\n\nWe recognized a net nonoperating loss of $33 million in the second quarter of 2022, compared to a net nonoperating loss of $25 million in the second quarter of 2021. The nonoperating loss in the second quarter of 2022 was primarily due to investment losses recognized amid lower valuations in the broader market. We had a net income tax expense of $65 million in the second quarter of 2022, which was primarily due to corporate income tax and withholding tax recognized in our digital entertainment business. As a result, net loss, excluding share-based compensation and impairment of goodwill was $570 million in the second quarter of 2022, as compared to $321 million for the same period in 2021.\n\nNet cash used in investing activities in the second quarter of 2022 was primarily attributable to an increase in loans receivables and purchase of property and equipment to support the growth of our businesses. At the end of second quarter of 2022, we had $7.8 billion of cash, cash equivalents, and short-term investments on our balance sheet. With that, let me turn the call to Minju.\n\nMinju Song -- Senior Manager, Group CCO's Office\n\nThank you for that, Tony. We are now ready to open the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Pang Vitt from Goldman Sachs. Please go ahead.\n\nPang Vittayaamnuaykoon -- Goldman Sachs -- Analyst\n\nThank you very much for the opportunity to question for me. Two questions from me. Firstly, on e-commerce. Can I please clarify on the suspension of guidance, what are management currently seeing that leads to the decision? Is the outlook that we are facing right now, really that cloudy? And at this point in time, we understand that macro has become very challenging, but at least up until middle of August, is there any color you can provide in terms of how Shopee has been doing so far for the quarter -- the quarter of 2022? Second question is related to Shopees and their breakeven.\n\nIs there any update on your breakeven post headquarter target for Shopee ASEAN and Taiwan? Right now, ASEAN and Taiwan breakeven is in sight. But headquarter costs still increased on a quarter-on-quarter basis. Can we understand what drives this increase in headquarter costs? And when can we actually expect to see this improve going forward?\n\nMinju Song -- Senior Manager, Group CCO's Office\n\nThank you, Pang. Regarding the guidance, we just want to clarify, this is a proactive decision from the management to continue to shift our strategies and we want to be very upfront and open to the market about it. If you look at our Q2 results, you already start to see that our actual losses for Shopee has been narrowing, not just on a unit economic basis, but also on a total -- at a Shopee group level basis and including all the costs considered. At the same time, we still achieved significant growth at 40% -- more than 40% for order.\n\nAnd so I think it's important that as we shared earlier that given the macro uncertainties and our goal is to be the optimal -- to achieve optimal success in the long run for the consumer Internet segment in our market. We think that pace ourselves well and manage the business prudently in accordance with the macro environment is very important. And a nimble execution adaptability has really helped us in achieving great success through the COVID period as well. And now it's a time for us to manage in a different direction, and we want to communicate proactively to the market about this different direction.\n\nNow of course, it doesn't mean that we think the market immediately are deteriorating or we see anything that significantly negative. It is more of a proactive communication to the market about management strategies to focus on efficiency, focus on the overall strength and health of the ecosystem and focus on continuing to tighten our operations. And that has been in our operations since earlier this year, and we want to continue in that trend. But of course, to put things in context, as we also shared, our long-term view about the market have not changed.\n\nAnd we remain very positive about the long-term growth opportunities across all these consumer Internet segments that we currently have leadership in our markets. And we are doing this to best position us to really capture these opportunities even better along the way. And to also put this into context. Currently, we have strong market leadership across various segments.\n\nAnd also based on the historical results so far, our market leadership has continued to widen the gap with our peers. So in that case, we have ample resources as well as a very strong position to manage the shift in our strategy and position us really well for the long run. In terms of the breakeven target for the Asia market, post HQ costs, we previously shared that we expect that to happen by next year. There's no change to our expectation on that.\n\nAnd of course, we continue to manage the cost. And we do expect that we'll try to move closer to the target over time. As you can see, pre-HQ costs, we almost achieved the targets given the order loss is less than $0.01 in Asia. And HQ cost-wise, although they are still increased quarter on quarter, the increase has -- the pace of increase has slowed.\n\nAnd as we shared in the earnings, this is mostly related to R&D as well as server costs. Now of course, the growth of R&D and service will also be commensurate with the overall growth of the business. As we continue to manage the growth, we're also very much focused on efficiency and in terms of the operation and also overall growth. So we do expect that to continue to see progress in a positive direction for us.\n\nOperator\n\nOur next question comes from Alicia Yap from Citigroup. Please go ahead.\n\nAlicia Yap -- Citi -- Analyst\n\nHi. Good evening, management. Thanks for taking my questions. I wanted to follow up on the e-commerce guidance suspension.\n\nSo can -- I think because in the past few years, management have proven very diligent on providing good insight into your forecast. So I wonder if these challenges, mainly on consumer, is that the frequency of the spending or the ASP where the consumer become more cautious on spending on the big ticket items that affect some of this uncertainty in the forecast? Or is it because of the spending willingness from the smaller merchants that you are seeing that create the difficulty on forecasting your revenue? So on -- this is the first question on e-commerce. Very quickly on gaming. Just wondering, without new games launched, what should we expect in terms of the Free Fire franchise to trend going forward? Would that be more stable? Or would that be also potentially growing the paying ratio with the existing user base that can actually support the growth booking going forward? Thank you.\n\nYanjun Wang -- Group Chief Corporate Officer\n\nYeah. Thanks, Alicia. I think what we're trying to say here is that for us, the reason we are suspending the guidance now is mainly because from a management of the business perspective, we will see the growth -- top line growth more as an output at this stage, not as a target. And what is the target now is going to be increasingly efficiency improvements and long-term health and strength and profitability of the platform.\n\nAnd that's why I want to put things into perspective. Even though we don't put as a target, naturally, we will continue to see growth. And overall, the market conditions, there are headwinds with, as we mentioned, inflation and reopening, tough comps against last year, especially given that we have supercharged growth. In fact, Shopee has achieved 10 quarters of triple-digit growth in the past 20 quarters since we are public.\n\nI think that is probably a historical record for any business. Also given the emerging market that we are in with underdeveloped infrastructure and all the work we have to play in to grow a highly complex e-commerce business across so many markets. So we have no problem. We don't have to prove that we can execute growth.\n\nThat has been very well established as a very strong track record and also got us here as a strong leader and continue to expand our leadership even despite all the headwinds that everybody has experienced in the market. However, we are saying that as a prudent business management perspective, we think now the direction needs to shift. And we want to proactively communicate the shift of that direction to the market to our stakeholders. And that's what we are saying here.\n\nNow in terms of Free Fire trends. So as you can tell, given the size of Free Fire, our Q2 results on the digital entertainment segment is also largely driven by Free Fire. On the active user side, we saw some stabilization quarter on quarter compared to last quarter. Of course, we're not making any forward projection here regarding user trends and also pay user trends or bookings because as you can tell, this is hard to predict for gaming industry as a whole.\n\nBut also to put things into perspective, of course, the inflation and also the opening up since COVID and again, the tough comp against last year, in particular, the outstanding performance of Free Fire throughout the year, that made the comparison look tough for us and thus affect the gamer consumption and engagement naturally. It's not particularly on Free Fire on Garena. It's on the industry as Free Fire maintained its top ranking in terms of global downloads, in terms of growth in our key markets in Southeast Asia and LatAm. So that seems to be more of an industry-driven and macro-driven kind of impact on game.\n\nOn the other hand, we also see some other franchises in our current game portfolio. For example, Arena of Valor performed very -- quite stable -- showed a stable performance. And even in some quarters, we saw improvements, there is also another game that we have been running for many years. So it's not necessarily true that given the headwinds, given the lifespan of the game, that we definitely will see continuing downward trend.\n\nI think part of it is also dependent on our own efforts and ability to continue to manage that. And that's what the team is focused on. In the past quarter, I think the team has done different things in terms of esports activities, engagement, new content, new game modes, more user-friendly packages, and game sizing in various aspects, try to continue to improve and retain our users and engage with our users better. I think the trends you're seeing is really, given the tough comp and the macro environment against us.\n\nOn the other hand, we're also making a lot of efforts in this regard. And we see our game as a very important long-term franchise for us. And as I said, we think that online virtual consumption is going to be increasingly important for the younger generations. And that's where we're betting in terms of the long-term future of this company as well.\n\nOperator\n\nOur next question comes from Piyush Choudhary from HSBC Singapore. Please go ahead.\n\nPiyush Choudhary -- HSBC -- Analyst\n\nYeah. Hi. Good evening to the management. Thanks a lot for the opportunity.\n\nTwo questions. Firstly, can you talk a little bit about the outlook for the e-commerce industry GMV growth in your core markets in 2022 and 2023? Which markets are proving more resilient and which are showing signs of early weakness? Secondly, could you give us a breakup of gross orders and grab revenue in Brazil? And what is the likely cost savings with your recent initiatives taken? Is it already reflected in 2Q or yet to come? Thank you.\n\nYanjun Wang -- Group Chief Corporate Officer\n\nI think in terms of the industry GMV growth, there are a lot of research outstanding. And I think, obviously, it's going to be slower, but also it really depends on the various industry players and us and our peers, how we manage this growth. And among the various markets, we see that there are some markets, for example, like Malaysia, Singapore, that enjoyed spectacular growth. During the previous years, there is a slowdown, given a tough comp and also the opening up versus a period of strict lockdown.\n\nI think continuing to this year, of course, the tough comp is going to remain a fact. And at the same time, we also see markets like Indonesia, Philippines, and Vietnam continue to enjoy relatively faster growth. That also in a way, sometimes is affected by the comp relative to -- in terms of open up versus lockdown, the relative macro situations people are placing, the fiscal tools, the central banks, and the governments in terms of interest rates and fiscal tools governments have been employing to manage the inflation and how they deploy those tools whether it's on price cap or on coupons and if it's on subsidies, how they channel the subsidies. So all of this can affect the overall consumption growth and where the consumption growth to whether it's a discretionary or necessities or is a physical consumption versus services and also the e-commerce relatively share online versus off-line.\n\nBut I think there are many factors that could affect -- well, in general, the big picture is going to be slower and -- compared to last year, and how much slower, I think remains to be seen. And overall, we hope that we can continue to see resilience. But again, as we shared from a management perspective, we think it's much better to be disciplined and prudent and manage for macro uncertainty and to be prepared for any negative events and situations as opposed to hoping for resilience and the markets staying positive. In terms of the gross orders and GAAP revenues for Brazil, I think we disclosed the strong growth that Brazil is continuing to enjoy for us.\n\nAnd we also, more importantly, continue to narrow -- improve our unit economics in Brazil. So everything's really on track for us in Brazil. And in terms of the group level, I think the cost initiatives, when we talk about the projections in the future -- for the future in terms of EBITDA positive after HQ cost allocation for the Asian market, we do take into any initiatives that are visible to us at this point. Of course, we don't have a perfect prediction for the future.\n\nOperator\n\nThe next question comes from Thomas Chong from Jefferies. Please go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\nHi. Good evening. Thanks, management for taking my question. I would like to ask about the digital entertainment side, in particular, how we should think about the new games in the pipeline.\n\nWe understand that we have a different -- development. I just want to see how the progress is going? And should we expect any meaningful titles to be released in second half or 2023? And on that front, how we should think about the EBITDA margin for the digital entertainment business in coming quarters? Do we expect to invest in driving the retention and engagement of Free Fire users, would continue in transitioning to 2023? Thank you.\n\nYanjun Wang -- Group Chief Corporate Officer\n\nYes. In terms of the game pipeline, we do have things in the pipeline, whether it's on our own self-development or published titles or our invest details, we might publish later this year. And as you know, we will announce it when they're public -- when they're officially launched. And I think in the long run, we do -- our goal is to continue to diversify our portfolio and in terms of genres and mix of the esports and more casual type of games and across the more diverse market, so the direction is the same.\n\nFrom a financial perspective, we don't think there will be anything that will have an immediate meaningful significant impact like that on Free Fire in the immediate future because as a, Free Fire is a very long -- the largest mobile titles in the world and b, for any game that we launched initially, our focus is more going to be user engagement and building up the momentum and also the user base and solidify that before we focus more monetization. Even for Free Fire, it actually took the game quite a number of quarters or I would say, even on a year, to graduate -- ramp up monetization and to develop into more full potential. So that's our view. And in terms of the EBITDA margins for digital entertainment in coming quarters, I think our EBITDA margin is still very much on the high end of the industry at more than 45%.\n\nNow from quarter to quarter, as we shared before, there could be fluctuations depending on, for example, esports events and other campaigns. For example, the second quarter, we had our -- the world series competition for Free Fire. And then that also depends on launch timing for the new games. If we have new games, then there will be some sales and marketing investment to build up momentum for the -- based on publishing timing.\n\nBut generally, I think even though there will be fluctuations, we do continue to expect our EBIT margins will continue to remain on the high end compared to the industry range.\n\nOperator\n\nThe next question comes from Jiong Shao from Barclays. Please go ahead.\n\nJiong Shao -- Barclays -- Analyst\n\nThank you very much for taking my questions. I have two questions. I'd like to ask one at a time, if that's OK? As a company focuses on sort of monetization, efficiency cost control, any comments on your take rate expectation? I think in the past, you talked about increasing take rate about roughly 200 basis points this year. Should that still be our expectation or your expectation? Any comments would be super, super helpful.\n\nThat's my first question. Thank you.\n\nYanjun Wang -- Group Chief Corporate Officer\n\nThank you, Jiong. I don't recall we give any take rate guidance, right? But on the whole, I think -- in terms of take rate, we do expect the take rate to graduate right and as we continue to deepen monetization through better services to our sellers and consumers and through growing the ecosystem as a whole.\n\nJiong Shao -- Barclays -- Analyst\n\nOK. So my apologies. I think maybe what I remember was I think -- you might have talked about the increase in take rate this year is going to be similar to the increase in take rate last year, which was roughly 170, 200 basis points, if I'm not mistaken. But maybe another way to just follow up on this, is there any change in your expectation for your take rate since now you sort of suspended the revenue guide? Is there any change in your expectation on the monetization specifically regarding to the take rate?\n\nYanjun Wang -- Group Chief Corporate Officer\n\nI think Jiong, there can be many factors affecting the take rate. We won't be providing any specific guidance on the take rate. But suffice to say that there will be gradual increase over time. We don't set a specific target take rate for any particular year.\n\nAnd when take rate rises, it can be also based on different income streams in terms of transaction-based fees and these are more like the take rate that we set. But on the other hand, there are also take rates that the sellers adopt because, for example, we offer opt-in programs for sellers who joined these programs, paid as a higher take rate in getting more services and offerings in return. And this will also increase our take rate. But it is not something that is directly set by us, but it's more based on the seller adoption.\n\nThere's also advertisement. Again, that is something based on adoption. Then there's also VAS. And VAS take rates in a way also depends on the rollout of our logistics and in terms of how we manage logistics and there's also accounting-related changes that might affect the take rate.\n\nSo there are many different factors that affected. But I think overall, we continue to focus on the unit economic improvement and overall platform ecosystem growth of our platform.\n\nOperator\n\nOur next question comes from Ranjan Sharma from J.P. Morgan Singapore. Please go ahead.\n\nRanjan Sharma -- JPMorgan Chase and Company -- Analyst\n\nHi. Good evening and thank you for the presentation. Two questions from my side. Firstly, on the gaming guidance, I guess, there's no change if you can confirm that? Secondly, on your ad revenues, if you can please give more color on how fast they're growing? And if I look at it from a percentage of GMV perspective, where are we? Thank you.\n\nYanjun Wang -- Group Chief Corporate Officer\n\nThanks, Ranjan. In terms of game guidance, no change to it. And in terms of ad revenue, we don't break that down, but there is also a gradual upward trend on that front. And that also part of the reason that combined with increasing transaction-based fees that we see continual increase in our high-margin revenue and the improvement on our margins overall for Shopee.\n\nOperator\n\nThe next question comes from John Choi from Daiwa. Please go ahead.\n\nJohn Choi -- Daiwa Capital Markets -- Analyst\n\nThank you for taking my question. My question is on your strategy to shift more on efficiency improvement. Management kind of elaborate what are the few intangible examples that you could give us, how you're going to really try to improve the efficiency on the margins. Is it going to be more by aggressive cutting or less spending in some of the strategic areas? And a quick follow-up is on the Brazil strategy.\n\nI know that we are growing very nicely here. How are you going to balance the growth opportunities and investments versus your new efficiency strategy going forward? Thank you.\n\nYanjun Wang -- Group Chief Corporate Officer\n\nYeah. Thanks, John. In terms of the efficiency rate, I think there's -- it's not as simple as we just cut, right? It is important to wanted to focus on the overall efficiency of the ecosystem. For example, as we all know, logistics is a big part of the ecosystem cost.\n\nAnd whether it's borne by the sellers, by the buyers or by the platform like us, it is one of the biggest cost component. And there are many ways to continue to improve it. For example, we work even more closely with our 3PL partners and other agents and service providers to better route the delivery and better plan and delivery, and also increase the density of delivery. There are many ways to improve the overall ecosystem efficiency.\n\nAnd on the payment front, for example, we continue to improve adoption of our e-wallet and also increase other online payment adoption over time, and that can also lower the payment cost and reduce the transaction friction. So there are many things that we focus on the ecosystem side that we want to make sure they can be more efficient. And also, in terms of the other cost managements that we continue to review various cost components and to see if there can be savings made during this process. And I think it's actually a very good exercise.\n\nNow as we shared, we see this business as running a marathon. And during this time, I think it's good to tighten our shoelace, get water and develop and also then that prepare us to run faster down the road. And in terms of our growth in Brazil on -- in terms of balancing growth and efficiency, I think the big picture is still doing the right thing at the right time at the right place. And for Brazil, we look at what is potentially natural or reasonable growth rates for us and what is efficient for us.\n\nSo that's -- we've always emphasized on efficiency in any growth region. And increasingly, given the micro trends, we will probably further focus on that and emphasize on that. And again, as I said, we're going to see growth rates as more output during this period of time and more focus on efficiency and that can allow us to eventually build a stronger and more profitable platform there long term.\n\nOperator\n\nOur next question comes from Varun Ahuja from Credit Suisse. Please go ahead.\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nYeah. Thanks for the opportunity. So I've got three questions. First, on the e-commerce, sorry to harp on it, guidance again.\n\nSo it's the change in strategy that you're talking about. So the suspension in guidance is for this year or for next year? Do you think you'll get back to giving guidance for the segment? And more importantly, have you going to change the metrics that you track internally with -- still revenue growth, or EBITDA or any of the metrics that you're going to focus on when you provide guidance? So any color on that front will be helpful. Secondly, on the fintech side. If you can tell us how the digital bank initiatives are going across the various countries? And if you look at the loan receivables on the balance sheet is around $2 billion.\n\nHow much more loans that you're giving outside of this in collaboration with the digital banks? Any color that you can share, that will be good. And lastly, if you can give more color on the goodwill impairment. Which segment of this investment relates to -- in e-commerce or logistics, gaming? How much is still left on the balance sheet of that investment? Thank you.\n\nYanjun Wang -- Group Chief Corporate Officer\n\nYes. Thank you, Varun. In terms of the guidance suspension, we are suspending the guidance for this year. No decision has been made with anything regarding future guidance.\n\nAnd in terms of the digital bank initiatives, we continue to -- as I shared before, we continue to focus on quality as opposed to growth for our bank initiatives. And it's going to be a very long-term effort and also the bank is we're very much aware, trust and reliability and integrity driven business, and it's very important to build a robust system for it. So we're not focused on driving growth on that front. And the same with our credit business, where we continue to build our models and provide needed services to our consumers in various markets and collaborating with third-party financial institutions in doing so.\n\nAgain, we're not driving growth in that area. We're looking more for how to build a robust model that can withstand cycles and can be a long-term sustainable business model for us. In terms of the overall impairments, these are related to various past investments, not any specific segment focused. But as you know, given the macro environment and the movements in the market of -- in company's valuations and stock prices, we also think it's prudent for us to proactively manage and review our portfolio that we hold on the book to assess the overall impairments needed.\n\nSo far, I think we -- if you look at our balance sheet, there's still around like $400 million. And of course, we -- at this stage, we don't currently expect all of this needs to be written off. But on the other hand, we will continue to assess over the period.\n\nOperator\n\nThis concludes our question-and-answer session. I'd like to turn the conference back over to Minju Song for any closing remarks.\n\nMinju Song -- Senior Manager, Group CCO's Office\n\nThank you. Thank you all for joining today's call. We look forward to speaking to all of you again next quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMinju Song -- Senior Manager, Group CCO's Office\n\nForrest Li -- Chairman and Group Chief Executive Officer\n\nTony Hou -- Group Chief Financial Officer\n\nPang Vittayaamnuaykoon -- Goldman Sachs -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nYanjun Wang -- Group Chief Corporate Officer\n\nPiyush Choudhary -- HSBC -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nJiong Shao -- Barclays -- Analyst\n\nRanjan Sharma -- JPMorgan Chase and Company -- Analyst\n\nJohn Choi -- Daiwa Capital Markets -- Analyst\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nMore SE analysis\n\nAll earnings call transcripts"
}