{
  "companyName": "Home Depot",
  "companyTicker": "HD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/home-depot-hd-q2-2022-earnings-call-transcript/",
  "content": "Home Depot (HD -1.42%)\nQ2 2022 Earnings Call\nAug 16, 2022, 9:00 a.m. ET\n\nOperator\n\nGreetings and welcome to the Home Depot second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. A brief question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Isabel Janci. Please go ahead.\n\nIsabel Janci -- Vice President, Investor Relations\n\nThank you, Christine, and good morning, everyone. Welcome to Home Depot's second quarter 2022 earnings call. Joining us on our call today are Ted Decker, CEO and President; Jeff Kinnaird, executive vice president of merchandising; and Richard McPhail, executive vice president and chief financial officer. Following our prepared remarks, the call will be open for questions.\n\n[Operator instructions] If we are unable to get to your questions during the call, please call our Investor Relations department at (770) 384-2387. Before I turn the call over to Ted, let me remind you that today's press release and the presentations made by our executives include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. These statements are subject to risks and uncertainties that could cause actual results to differ materially from our expectations and projections. These risks and uncertainties include, but are not limited to, the factors identified in the release and in our filings with the Securities and Exchange Commission.\n\nToday's presentations will also include certain non-GAAP measures. Reconciliation of these measures is provided on our website. Now, let me turn the call over to Ted.\n\nTed Decker -- Chief Operating Officer\n\nThank you, Isabel, and good morning, everyone. We appreciate you joining us on our call this morning. In the second quarter, we delivered the highest quarterly sales and earnings in our company's history. Sales for the second quarter were $43.8 billion, up 6.5% from the same period last year.\n\nComp sales are up 5.8% from the same period last year and our U.S. stores had positive comps of 5.4%. Diluted earnings per share were $5.05 in the second quarter, up 11.5% from $4.53 in the second quarter of last year. From a geographical perspective, each of our 19 U.S.\n\nregions delivered positive comps versus last year while Mexico and Canada posted comps above the company average. The team has done a fantastic job serving our customers while continuing to navigate global supply chain disruptions, inflation, and a tight labor market. Our results in the second quarter reflect continued strong demand for home improvement projects. As Jeff will detail, the business was strong across our departments while our seasonal business posted positive comps as spring broke in the second quarter, these categories underperformed our expectations for the first half of the year.\n\nThis was more than offset by strength in project-related categories that outperformed our expectations. We also saw growth with both our Pro and DIY customers in the quarter and are encouraged that project backlogs remain healthy. While the business performed very well and our consumers remain resilient through the first half of the year, we are navigating a unique environment. We can't predict how the evolving macroeconomic backdrop will impact our customer going forward.\n\nHowever, we continue to closely monitor elasticities and trends across our respective categories and believe we have the tools, team, and the experience to effectively manage in any environment. Despite near-term uncertainties, we believe that the long-term underpinnings of demand for home improvement remains strong and that we are well-positioned to leverage our distinct competitive advantages to capitalize on compelling growth opportunities in our space. For the Pro customer. We continue to invest in ecosystem of capabilities, including enhanced fulfillment, more personalized online experience, as well as other business management tools to drive deeper engagement with our Pro customers.\n\nAnd we believe our efforts are resonating. In May, we launched new capabilities on our B2B website to enhance the interconnected shopping and quoting experience for our Pros. In the past, our website was not integrated with our ordering and quoting systems, so an associate could not seamlessly modify an order if a customer had questions or changes before placing the order. Our new interconnected capabilities remove friction for both Pros and associates, allowing them to collaborate on orders both in-store and online.\n\nSales leveraging our digital platforms increased 12% versus the second quarter last year. We also saw record downloads, traffic, and sales via our mobile app. We continue to see improved conversion rates as ongoing enhancements within our digital properties are resonating with our customers. Our team is focused on what is most important: our associates and customers.\n\nOur merchants, store and met teams, supplier partners, and supply chain teams did an outstanding job delivering value and service to our customers throughout the quarter. Based on first half results, 100% of our stores qualified for Success Sharing, our profit sharing program for hourly associates. I'd like to close by thanking them for their dedication and hard work. With that, let me turn the call over to Jeff.\n\nJeff Kinnaird -- Executive Vice President, Merchandising\n\nThank you, Ted, and good morning, everyone. I want to start by also thanking all of our associates and supplier partners for their ongoing commitment to serving our customers and communities. As you heard from Ted, during the second quarter, we continued to see strong demand for home improvement projects and strong execution from our teams and supplier partners. Turning to our comp performance during the second quarter, all of our merchandizing departments posted positive comps, building materials, plumbing, millwork, paint, and hardware were all above the company average.\n\nElectrical decor and storage, kitchen and bath, outdoor garden, tools, appliances, indoor garden, lumber and flooring were positive, but below the company average. As you heard from Ted, while our seasonal businesses posted positive comps in the second quarter, they underperformed our expectations for the first half. First half of the year, driven by categories like grills, fertilizers, chemicals and mowers. Keep in mind that we were up against very tough comparisons versus the last two years.\n\nAnd in these categories when our customers focus on outdoor living, and these were some of our best performing departments. During the second quarter, our comp average ticket increased 9% and comp transactions decreased 3.1%. The growth in our average ticket was driven primarily by inflation across our product categories, as well as demand for new and innovative products. On a three-year basis, both comp average ticket and comp transactions were healthy and positive.\n\nDeflation from core commodity categories negatively impacted our average ticket growth by 14 basis points during the second quarter, driven primarily by lower lumber prices. Big ticket comp transactions for those over $1,000 were up 11.6% compared to the second quarter of last year. We saw big ticket strength across many Pro heavy categories like pipe and fittings, gypsum, and fasteners. During the second quarter, both Pro and DIY sales growth was positive with Pro outpacing DIY.\n\nWe're encouraged by the continued momentum we are seeing with our Pros and they tell us their backlogs remain healthy. During the quarter, we saw a robust project demand across the business. This can be seen in the double-digit comp performance of our building materials, plumbing, and millwork departments, as well as in certain project-related categories like fencing, siding, conduit boxes, and fittings, tubs and showers, and countertops. We continue to introduce new and innovative products aimed at simplifying the project, saving our Pros time and helping them take on more jobs.\n\nOne example, in building materials, where we launched nationally Henry's Tropi-Cool Roof Coatings. This new formula offers maximum reflectivity, helping reduce cooling costs. Henry's Tropi-Cool can be applied in any season, 100% waterproof, and rain-safe within 15 minutes of application. And this product is exclusive to the Home Depot in the big box channel.\n\nIn bath, we're excited about the success we're having with our great assortment of Delta tub and shower wall combinations. Delta Classic 500 series is a simple tub or shower system that delivers a big transformation to a bathroom in a fraction of the time. It's easy to install and its acrylic surface makes it easy to clean. The series is exclusive to the Home Depot and the big box channel.\n\nTurning to our online sales, we are very pleased with the performance of our digital assets as we deliver the highest sales dollar volume in company history. Sales leveraging our digital platforms increased 12% during the second quarter. This is driven by our continued investments, which are resonating with our customers. Enhanced search capabilities and improved Pro site experience, the more robust fulfillment capabilities helped drive online conversion.\n\nFor those customers that chose to transact with us online during the second quarter, more than 50% of our online orders were fulfilled through our stores, a testament to the power of our interconnected retail strategy. As we look forward to the back half of the year. We remain committed to being our customers advocate for value. Last quarter, we highlighted several new innovative products for our customers.\n\nThis quarter, we're excited to announce the launch of Makita XGT 40V and 80V Max system of cordless equipment and tools in our outdoor power categories. The XGT system is engineered to achieve the optimum power required for heavier load applications without sacrificing runtime. And these one-battery solution tools are exclusive to the Home Depot and the big box channel. We're also excited to build on the success of our Hubspace smart home platform, expanding our assortment across several categories such as door locks, lighting control, fixtures, and ceiling fans.\n\nHubspace makes it easier to set up and manage your smart home products and pairs well with voice-controlled operating systems. This platform is exclusive to the Home Depot. In our garage organization, we'll be rolling out our MILWAUKEE PACKOUT and RYOBI LINK wall systems, utilizing the same locking technology across the system. They can be customized to meet your organizational needs from the workshop to workplace.\n\nWe're also excited about our lineup for Halloween. Our merchants have worked with our supplier partners to put together an expanded assortment of product offerings for this Halloween season. These products bring excitement to our stores and help drive traffic. And our sneak preview of our Halloween lineup was a tremendous success.\n\nWe are thrilled for the full rollout in the upcoming weeks. With that, I'll turn the call over to Richard.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nThank you, Jeff, and good morning, everyone. In the second quarter, total sales were $43.8 billion, an increase of $2.7 billion, or 6.5% from last year. During the second quarter, our total company comps were positive 5.8% with positive comps of 5.2% in May, 4.9% in June, and 7.1% in July. Comps in the U.S.\n\nwere positive, 5.4% for the quarter with positive comps of 4.1% in May, 4.7% in June, and 7.2% in July. In the second quarter, our gross margin was approximately 33.1%, a decrease of approximately 15 basis points from last year, primarily driven by supply chain investments. We continue to successfully offset significant transportation and product cost pressures while maintaining our position as the customers advocate for value. During the second quarter, operating expense as a percent of sales decreased approximately 50 basis points to 16.6%.\n\nOur operating leverage during the second quarter reflects solid expense management for the quarter. Our operating margin for the second quarter was 16.5%, compared to 16.1% in the second quarter of 2021. Interest and other expense for the second quarter increased by $58 million to $379 million due primarily to higher long-term debt levels than one year ago. In the second quarter, our effective tax rate was 24.3%, up from 23.9% in the second quarter of fiscal 2021.\n\nOur diluted earnings per share for the second quarter were $5.05, an increase of 11.5%, compared to the second quarter of 2021. Our total store count at the end of the quarter was 2,316 and selling square footage was 240 million square feet. At the end of the second quarter, inventories were $26.1 billion, up $7.2 billion, compared to the second quarter of 2021. Inventory turns were 4.5 times, down from 5.7 times last year.\n\nApproximately half of the year-over-year increase in inventory reflects product cost inflation. Our inventory also reflects deliberate investments in higher in-stock levels and pull forward of inventory for back half events in response to continued global supply chain disruption, investment in our new supply chain facilities, and carryover of some spring seasonal inventory. Turning to capital allocation. After investing in our business and paying our dividend, it is our intent to return excess cash to shareholders in the form of share repurchases.\n\nDuring the second quarter, we invested approximately $750 million back into our business in the form of capital expenditures. And during the quarter, we paid approximately $2 billion in dividends to our shareholders, and we returned approximately $1.5 billion to shareholders in the form of share repurchases. Computed on the average of beginning and ending long-term debt and equity for the trailing 12 months, return on invested capital was approximately 45.6%, up from 44.7% in the second quarter of fiscal 2021. Now I'll comment on our guidance for fiscal 2022.\n\nAs you heard from Ted, we're very pleased with the strong performance we saw during the second quarter, which was in line with our expectations. Today, we are reaffirming our guidance for 2022. We expect sales growth and comp sales growth of approximately 3% for fiscal 2022. We expect comp sales to be stronger in the first half of the year than in the second half of the year.\n\nWe expect our fiscal 2022 operating margin to be approximately 15.4% for the year. And we expect mid-single digit percent growth in diluted earnings per share compared to fiscal 2021. We find ourselves in a unique environment with many cross-currents. We're operating in a broad-based inflationary environment not seen in four decades, while managing through constrained global supply chain conditions, all against a backdrop of monetary policy shifts intended to moderate demand.\n\nWe also see engaged and resilient homeowners who have strong balance sheets, consumer spending more time in their homes, and continued structural support for home improvement project demand. We feel confident that we will continue to manage with flexibility through a dynamic environment while growing faster than our market and delivering exceptional shareholder value. Thank you for your participation in today's call. And Christine, we are now ready for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Michael Lasser with UBS. Please proceed with your question.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. Are you seeing any signs that housing is having a negative impact on the business? Could it be that some of the seasonal performance that fell short of your expectation is a sign that some of the underlying challenges in housing are starting to leak its way into home improvement?\n\nTed Decker -- Chief Operating Officer\n\nHey, good morning, Michael. We we have not seen that yet. In fact, with the strong performance this quarter, the variability across our regions has been the lowest in markets, has been the lowest that we've seen in some time. So we all appreciate the headlines and follow those very closely, but we have not seen anything in our business yet from macro housing.\n\nMichael Lasser -- UBS -- Analyst\n\nIs there a case, Ted, where it's not evident in the business because you're generating a very healthy return on the investments that the Home Depot has made over the last couple of years? Perhaps you could frame this as what's going on in the Dallas market, which is where some of the distribution facilities and Pro efforts that have been in place for the longest versus what you've experienced in the rest of the market.\n\nTed Decker -- Chief Operating Officer\n\nSure. And Michael, we'll get to Dallas, and Hector will take us through some of the things we're seeing with our Pro, which is incredibly strong. But what we're seeing overall in the business, the questions about housing and the economy, all very real questions. Again, things we're following closely, but I mean we just couldn't feel better about our business.\n\nWe just reported record quarterly sales and profits and reaffirmed our guidance. And that's on top of the 40 billion in growth in the past two years. We see a very engaged customer, each DIY and Pro. And as Richard said though, we are operating in a unique environment with many crosscurrents, inflation and interest rates and supply chain disruptions and the like.\n\nBut given all that, our customer in our markets has been incredibly resilient. As Jeff said, project demand is incredibly strong. Our Pro in particular is very strong and their backlog remains healthy. In DIY, we did see some seasonal weakness.\n\nBut as we pass through that, it's difficult to say is that weakness in the seasonal businesses, the overlap of the two prior incredibly strong years? Is it the weather where we had a really bad in late spring and then it turned incredibly hot across the country? Or are they fundamental demand pressures? Again, we have not seen a broad based fundamental demand pressure in the business. So we couldn't be happier with the overall business, watching it very closely. And I can just say, as I said in my comments, Michael, whatever comes, we are an agile business, an experienced management team, and we look to take share in any environment. And Hector, if you can give us some color on overall Pro and specifically Dallas would be great.\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nYeah. And Michael, as you know, we're building a unique, interconnected Pro ecosystem to capture more of that propylene purchase. To serve our Pros, it's really about removing friction through a multitude of enhanced product offerings and capabilities. And it all starts with brands, assortments, and drop low quantities.\n\nAnd as these new supply chain assets allow us to do that at a different level. But it also includes digital tools and personalized experience, multiple fulfillment options for reliable delivery, our Pro Xtra loyalty tool and other value-added offerings such as credit, tool rental, quote center. And for our larger Pros, we have to serve them with a single point of contact. Hence, why we're expanding our onsite sales team and building an onsite sales team.\n\nAnd I will tell you specifically to Dallas, Dallas is the most advanced market and is performing extremely well. We're thrilled to see our Pros trying our capabilities, are growing their spend quarter over quarter. And I will share with you that other top markets for us are markets where we have the new supply chain assets and other parts of the ecosystem live.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much and good luck.\n\nOperator\n\nOur next question comes from a line of Simeon Gutman with Morgan Stanley. Please proceed with your question.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood morning, everyone. Hope you're good. I wanted to ask an oldie but goodie on reversion, given the significant gains that have occurred post COVID. One of the ways that we've been looking at it suggests that most of the unit reversion has basically in the base.\n\nSo we've kind of rebase lined a significant part of the business in '22 and that, it opens the door to growing next year. I'm not asking for any endorsement on '23, but curious how you're looking at this reversion question and anything interesting on units as you look at it.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWell, Michael. Sorry. Sorry, Simeon. It's a it's a good question.\n\nI think we have to return to Ted's commentary that the consumer -- our customer, consumer and Pro, has been more resilient than we even expected in the beginning of the year. When we expect -- when we issued guidance at the very beginning of the year, we assumed that we'd see ticket growth driven by inflation and really sort of like-for-like offset in transactions. We haven't seen that. And so that led to our our increased guidance in Q1 of a 3% comp.\n\nWe've reaffirmed that guidance today. It does assume some level as -- it assumes that inflation persists at current levels and that we may see a slightly greater offset in transactions through the year. But that's a conservative assumption and not really based on observation right now. So the consumer is -- and customer, are resilient.\n\nTed Decker -- Chief Operating Officer\n\nAnd Simeon, we've been watching obviously all those metrics in PCE and share on goods and in share on services, and clearly the U.S. consumer has reengaged in activities outside the house. And travel is incredibly strong right now and eating out and hospitality. So there has been the movement of PCE to services as we thought.\n\nBut home improvement in particular has been, again, just incredibly strong, as Richard laid out, which led us to increase our guidance from what was essentially flat at the start of the year to the 3% we just affirmed. But we just don't -- we don't see a slowdown from that and remain incredibly bullish about the engagement level. It's really all the dynamic of the home improvement against so many cross-currents in the economy. But when you think of the wealth that our core customers and their home equity up nine-odd billion dollars, the excess savings rates, the strong jobs and earnings growth of wages, and the fact that we're just continuing to spend more time at home in general, people are still super engaged in improving that home that they're spending more time in.\n\nSo we're certainly benefiting from that longer term dynamic.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nAnd I think there's a emerging interesting dynamic that kind of pushes against reversion. And you think about those who may have look to move into another house. A few years ago, we're looking at their fixed rate mortgage and saying, I like that mortgage and I like my equity position in my home. I want to stay in place and remodel.\n\nWe see that in the survey data where customers say their intent to do projects of all sizes is still very high.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nYup. And my follow up, I think Ted and Richard, you basically answered it. I was going to ask why you think the backlogs are still so healthy because looking at the other high ticket spending across the consumer complex, a lot of it is contracting. And yet you're basically saying we're not really seeing that or expecting it.\n\nI think it's partly the vibrancy of the housing market, to your point. I don't know if it's income cohort, but if there's anything else because you mostly answered it in the response to the last question, but curious if there's more.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nOur customer skews heavily homeowner. Our Pros spend on behalf of homeowners and our DIY customers, over 90% of that sales is to a homeowner. And as Ted said, when you look at the wealth creation over the last two years and price appreciation of almost 40%, our customer is just in a really good place right now, and I think that also carries over to income. If you were to take a look at real purchasing power of our customer, it compares favorably.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Scot Ciccarelli with Truist. Please proceed with your question.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGood morning, guys. So at the sake of asking, I guess, a shorter term question here, it's hard not to notice that July sales ticked up a couple of hundred basis points on a stack basis. And I guess I'm wondering, would you guys point to anything specific be it weather, the slight easing we've seen in interest rates or gas prices? Any kind of color on that might be helpful.\n\nTed Decker -- Chief Operating Officer\n\nYeah. Scott, good morning. On a on a three-year basis, it's more or less stable. So July had a relatively easier compare.\n\nBut I will say one thing we have noticed, because our strength has continued into Q3 here in the first couple weeks. We think, again, I mentioned, PCE and people traveling and service spending going up. As people have come back, particularly in the south. We start school very early down here, early August.\n\nAnd as people, including Pros, came back from vacations, we saw it in acceleration in the business midway through July, and that has continued into August. I think people are back home and home from the beach, the mountains, etc., and back engaging in home improvement projects.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nOK, that's helpful. And then just can you size the adverse impact on seasonal in the first half? Obviously, you came a little short of expectations. Is there a way to provide a magnitude of that for us?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWe -- as Ted says, we're accustomed to offsets in our business and we look at home improvement demand in total. And so, as we said, we met expectations. There's always -- we never hit a quarter exactly the way we think we are, but we feel great about the demand that we saw out there.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nRoger that. Thanks, guys.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nTed Decker -- Chief Operating Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Steven Zaccone with Citi. Please proceed with your question.\n\nSteven Zaccone -- Citi -- Analyst\n\nGood morning, guys. Thanks for taking my question. Ted, I was just hoping we could revisit your comments about the macro backdrop. Are you concerned there could be a lag in the sense of demand control over time? Because in the past you've looked at home price appreciation as a key factor for home improvement demand.\n\nYou're concerned that home prices could stay flattish or potentially decline from here. Does that alter your view on the demand outlook for the near to medium term?\n\nTed Decker -- Chief Operating Officer\n\nSo it hasn't as of yet, and this is what we're seeing. I mean, we talk about home price appreciation transactions, household formation, etc., multiple inputs on housing. But the strongest and most correlated for our sales is home price appreciation. Now that's gone up, as Richard said, 30, 40% in the last couple of years, which we believe translates to, high $8 trillion, $9 trillion of increased wealth with what is our core customer base.\n\nSo when mortgage rates touched at 6% there for a minute, certainly you saw new home construction and mortgage rates feel that immediately. If we have a couple years of holding serve, if you will, on this incredible price appreciation in the home. We don't see that impacting demand the fact that we're not going up year after year after year is less the point that we've gone up so much in the past two years and the equity position in these homes are so strong, coupled again with people spending more time in their homes, so repair and remodel. Demand is going to increase from wear and tear.\n\nYou're going to want more space and just improvements in the home because you're there more often. And then the fact that the U.S. home stock is aging and -- of course, it ages every year, but it's aging disproportionately because we had so many those years where we under built in housing. So now we have well over half the homes in the United States over 40 years old.\n\nSo all those factors with that incredibly strong run-up in value, we think supports home improvement for some time to come, regardless if you have appreciation beyond these levels in the near term.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nAnd we never thought or saw home price appreciation correlated period to period. We've always seen and heard there is a lag effect there that stretches over multiple periods. So as Ted said, we think fundamentals here are strong.\n\nSteven Zaccone -- Citi -- Analyst\n\nGreat. Very helpful. Just a quick follow up on inventory levels, maybe how much was inventory up on a unit basis, if you could share? And do you feel like you're at the right level of in stocks in the business now?\n\nJeff Kinnaird -- Executive Vice President, Merchandising\n\nMorning, Steven. It's Jeff Kinnaird. From an inventory perspective, we are -- if you look at our total inventory, half of that is inflation as we manage through this inflationary environment. Second is just in-stock improvement.\n\nTo your point, we're happy with our improvement, our merchants, our supply chain team, our suppliers have work hand-in-hand in building a better in-stock this year versus last year. We still have a ways to go in terms of improvement, but very happy with our -- where we -- how we progress. We are still having to pull inventory forward. If you think about today's supply chain environment, our focus is to be there for our customers, to be there for our Pros in terms of the right job by quantities and the right timing of events and other activities.\n\nSo part of our inventory overage is obviously due to that work in terms of being there for our customers. We do have some carryover inventory from the spring season, but it is really low risk inventory that we're managing through and ensuring that we're ready for next season. But overall, we feel very good about our in-stock position. We're managing the inflationary environment in inventory and we'll be there for our customers in terms of in-stock.\n\nSteven Zaccone -- Citi -- Analyst\n\nThanks very much. Best of luck in the back half.\n\nOperator\n\nOur next question comes from line of Brian Nagel with Oppenheimer. Please proceed with your question.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi. Good morning. Nice quarter. Congratulations.\n\nTed Decker -- Chief Operating Officer\n\nThank you.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nSo I've a couple of questions. First off, historically, having followed Home Depot now for a long time, your company has done a very good job of, sort of say, understanding the macro endpoints and building model and then you're forecasting your own sales off of that. So the question I have is this is somewhat of a follow up from the prior questions, but as you -- with your models right now, you look at the variable, the various variables out of various macro factors, is your business tracking consistent with where it should be or are you actually -- is there some type of break where you're actually performing better right now than the macro variables would dictate?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nI think, Brian, we're in such a unique environment that to try to build models off of macroeconomic factors is probably less valuable than spending our time managing in an agile way. What we are confident in is that we've been taking market share consistently and that we are positioned now better than ever to take market share in any environment. As Ted said earlier, we've watched the same housing statistics for over a decade now, and we think directionally we understand what's going on here. There's just a very positive environment with respect to the homeowner.\n\nBut we're not going to, at least at this moment, given the dynamism in the economy, tie to any given macroeconomic factor.\n\nTed Decker -- Chief Operating Officer\n\nYeah, Brian. And if I can add to that on, are there any parts of the business doing better than we expected? I mean, we truly are just thrilled with what we're doing with the Pro. As Hector outlined, this Pro ecosystem that we're building, I mean, we are truly building a set of capabilities that is not seen in our marketplace. And in talking to our Pros and the research we did, they are they are more than comfortable to do more with Home Depot as we develop capabilities to serve their larger planned purchase.\n\nAnd Hector talked specifically about Dallas, but as different parts of this Pro ecosystem come online, we have a number of one supply chain buildings now open in many large metro markets. We're starting to increase the size of the sales force, our quoting capabilities and integration of our B2B website, which I mentioned in my prepared remarks, all of this is really coming together to drive what is that incredibly strong Pro and larger Pro comp. So as we updated our TAM to 900 billion earlier this year with 450 of that being in Pro, we just see tremendous opportunity. And I would say, yes, that is a category that we are outperforming and happy for it.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nNo, it's very, very, very helpful. And just a follow-up question I have, unrelated, but with regard to inflation -- so once again, inflation has been a driver of your business. I guess the question I have is, are you seeing any incremental evidence that the consumer is trying to push back somewhat on these higher price points?\n\nJeff Kinnaird -- Executive Vice President, Merchandising\n\nBrian, we are -- we have higher average unit retail growth and that's higher than inflation. So really, no, not seeing any trade down. We've got strength in our ticket above $1,000 and that speaks to the project and to the Pro customer. We all say in categories like grills, mowers, laundry, and a few other bigger ticket items, it's possible there is a price sensitivity.\n\nBut as Ted commented, there's COVID pull forward, there's stimulus effect, we went from a very wet and cold spring to a very hot summer in the majority of our markets, and the consumer is focusing on other projects. You think about that consumer has shifted. You think of -- last year, it was all about the backyard. This year it's about categories like paint and other large renovation categories, and we're seeing that across our business.\n\nAnd I also see where you see the consumer in the pro trade up around innovation and couldn't be more proud of the merchants and our supply partners and what we've delivered around innovation for our customers. We've got a lot of products helping our Pros finish the job faster and simplifying the project for our consumers. So, no significant trade down taking place.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nI appreciate it. Thank you.\n\nOperator\n\nOur next question comes from line of Chris Horvers with J.P. Morgan. Please proceed with your question.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks. Good morning, everybody. So a follow-up question on the Pro. Can you talk about the relative performance among a large pro versus the smaller pro? Is a large Pro outperforming? What would you attribute to that? And then overall, I'm not sure if you can track this, but are you seeing Pro transaction growth? Because overall transaction growth has grown down.\n\nPresumably that was DIY.\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nYeah. Chris, I would share with you that -- is the performance of our high spend Pro has been very consistent over the last several quarters. So we're very pleased to see that. We're seeing other areas of our Pro business as far as the customer size accelerate quarter over quarter.\n\nSo we just feel really good. We've spent a substantial amount of time with them talking about backlogs and we feel very good about where they're positioned for the next couple of quarters.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nSo -- sorry, just to interpret. So you're saying that the large Pro has been the best performer?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWhere -- our large Pros were the best performers this quarter. That's right, Chris.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then are you able to look at on a transaction level? Were transactions up for the Pro?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWe're not going to break that out any further, but let's just say that demand is strong with the larger professional customer.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then a follow-up on that sort of, Ted, your point on, people came back from vacation and have reengaged in the category. Last year that seemed to happen more in the September timeframe where DIY reengaged. How are you thinking about the DIY business into the fall versus maybe people come back and there's some things that need to get done and the kids are going back to school.\n\nBut how do you think about the risk on DIY maybe fading as we get into September in the fall?\n\nTed Decker -- Chief Operating Officer\n\nWell, Chris, that's a great question. And frankly, when we -- given the strong first half and the strong second quarter, to reaffirm guidance, which implies a lower comp in the second half, that's really the question for us. And frankly, we don't know the answer. We're super comfortable with Pro.\n\nThat continues to motor on. But the question for the second half and the opportunity to do better, that implied comp is if the consumer hangs in there is just said of the various potential reasons for seasonal relatively underperforming in the first half if it's things more like whether and having focused for so long in the backyard for two years that they went and did other things, go to the beach, etc., and then they get back in the fall and reengage, that will obviously be great news. But with these cross-currents, we just haven't called that, and that's a little bit of conservatism in the second half.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thanks very much. Best of luck.\n\nOperator\n\nOur next question comes from the line of Chuck Grom with Gordon Haskett. Please proceed with your question.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, thanks. Just to kind of a bit off Chris' question, I'm just curious how you're planning the business from a category perspective over the next couple of quarters and maybe into early '23? And is it your expectation that the Pro continues to lead, or do you think that what you've seen over the past few weeks that we start to see maybe a shift on that front?\n\nJeff Kinnaird -- Executive Vice President, Merchandising\n\nChuck? Good morning. Look, we are prepared for the continuation of the project customer. When it comes to innovation and value, I point out Halloween and how we launched Halloween a few weeks ago and saw just, just great success in the early launch and will set in stores in the upcoming weeks and look forward to that category performing. When it comes to the Pro, we'll be there in terms of innovation and job-like quantities and leveraging our supply chain capabilities and the other capabilities that Hector spoke to.\n\nSo planning the continuation of the project business, the Pro business and we'll be there for our consumer when it comes to Labor Day, coming up in a few weeks. We've got a great program planned for Labor Day that's moved through Halloween. As we head into the Black Friday timeframe, we'll be there for our customers with great value and that will continue being the advocate for value for our customers.\n\nTed Decker -- Chief Operating Officer\n\nChuck, it's interesting. On something like Halloween, it's not a huge category. It's not going to, move the needle on 150 billion in sales per say. But the level of excitement that category brings to us in the traffic and when you think about resilience of the customer and willingness to spend on clearly discretionary items, we had two releases of some of that product very, very specific limited quantities leading up to this period and we sold out in -- I don't even know if it was hours, how quickly, people are spending $300 for a clearly discretionary item.\n\nBut a lot of fun, great innovation in value. But clearly, people snapped up, in minutes a pretty decent price point, 100% discretionary item.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nSo that's obviously good to hear. Just switching gears a little bit to the next couple of years. Just wondering if you guys can discuss the new facilities that you've opened up across the country and the benefits you're seeing. You touched on it in Dallas a little bit, but how much of a tailwind can that be over the next couple of years as you largely complete that rollout?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nYeah, I'll start off. Our supply chain is an important component of the ecosystem that we're building to serve our customers and drive productivity. And our intent is really to build the fastest, most efficient, and reliable delivery network in home improvement, reaching 90% of households with a same-day, next-day service on parcel and big and bulky. Our original plan was to open up 150 new buildings.\n\nAnd while many of these will be complete by the end of this year, some are going to take us a little bit longer. And that's a function of our HD Supply acquisition, which we paused and reevaluated our needs and facilities that serve similar capabilities as well as some of the impact that we had associated with COVID. We're very pleased with the performance of the buildings. We've got about 85 of our 100 planned market delivery operations.\n\nWe've got 11 of our planned DFC expansions. And those facilities will serve, both the parcel and the big and bulky customer in local markets. And then lastly, and Hector referenced this, our flatbed distribution centers that will finish the year with about 15 or half of our intended goals are right on track. And Dallas was the first market that we set up these capabilities.\n\nIt's been operational for over two years, and we really like what we're seeing out of that ecosystem in the Dallas market that Hector mentioned. We're learning a great deal and we're winning, that Pro planned purchase. And so we're excited about the possibilities that remain with our investment in our our One Supply Chain strategy.\n\nTed Decker -- Chief Operating Officer\n\nChuck, you asked, what do we think, tailwinds are as we build this out and John mentioned HD Supply is part of a pivot and what we are building from One Supply Chain. I'd like to all just say that we couldn't be happier with the HD Supply acquisition. Shane O'Kelly and his team are just doing a terrific job. That integration is going incredibly well on product catalog, on customers, and sales force integration.\n\nAnd they are just off to a great start and that business is performing incredibly well. Remember, we put together the #1 and two multifamily players and have a leading position in multifamily. And then with the supply acquisition picked up, additional verticals in hospitality, in healthcare, government, etc. All of them are doing incredibly well and we couldn't be happier with HD Supply.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nThanks, Ted.\n\nOperator\n\nOur next question comes from the line of Steven Forbes with Guggenheim. Please proceed with your question.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nGood morning. Ted, Jeff, I was hoping to expand on the Pro loyalty program and the B2B website experience, really looking for any specific data points you can provide to help us better understand the maturation benefits of these initiatives. Like how many members do you have? How often are they engaging in the personalized offers? What's happened to sort of average wallet share of the Pro post onboarding? Is there anything you could provide us to help us understand the opportunity here?\n\nJordan Broggi -- Senior Vice President, Finance\n\nHey, thanks for the question. This is Jordan Broggi from the online team. We don't break those out, but what I would say is we're super happy with our loyalty customers. They are outperforming the average and the customers that are logged into our B2B experience online outperform pretty significantly the customers on our consumer site.\n\nTed Decker -- Chief Operating Officer\n\nAnd I'll just jump in on Pro Xtra as well. I'm just thrilled with the second year in terms of performance. We linked our Pro Xtra loyalty to our commercial credit cards this past spring. That's been another leap forward in terms of overall performance.\n\nWe see great existing member engagement, we see great new signups, and the enrollments are strong and the revenue is strong. And then our pros are engaging in the perks. And we are we are seeing significant growth in that level of engagement.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nAnd then just a quick follow up maybe for Richard. I think Ted mentioned that 100% of the stores qualified for Success Sharing. Any any color on how that payment compared to last year or I guess to the original plan for the year as we think about the expense build?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nIit was roughly equivalent to last year.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Mike Baker with D.A. Davidson. Please proceed with your question.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nHi, guys. So I just wanted to ask a lot of moving parts, obviously, in the environment, but through it all, it looks like at least according to your guidance, you guys are going to comp at about 3% with flattish operating margins. Is that the right way to think about the business longer term? Is that where you sort of target the comp and the margin break even at about 3%, you'd be break even? If something above that, maybe margins go up, etc.? Just wondering about the long term view.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWe -- thank you for the question. We typically will cover operating expenses into the very low single digit comp. And we would always expect to do so. Leveraging operating expense as a part of our financial model and been a part of how we do business.\n\nYou're going to see fluctuation from quarter to quarter. But we've met expectations this year and feel great about where we sit and how our teams have managed through this environment. Longer term, again, we expect to generate operating expense leverage. Our goal, though, here is to gain market share and deliver shareholder value.\n\nAnd we think about delivering shareholder value in terms of driving operating profit dollar growth. That's a formula that's worked for us and we think it's going to keep working for us.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nAnd so if I could follow up on that, what that sounds like to me, both of those comments, leverage operating expenses but focus on gross profit dollars. Is it fair to say you're willing to let gross margins continue to tick down? I think they've been down something like six of the last 10 quarters and each of the last couple of years, not by much. Just by kind of 20 basis points a year. But is that the idea that we're OK with gross margins ticking down a little bit as long as it's driving comp and leveraging the SG&A?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWe -- thank you for the question. Again, we think about dollar growth and we think about cash and cash returns, first and foremost. I think gross margin in particular is kind of a secondary metric. I'll give you an example.\n\nOver 10 years ago, we identified appliances as a category, where we had a major competitor who was losing steam and where we thought we could make some inroads. The question at the time was that gross margin on appliances carried a gross margin that was below company average, but the return on invested capital, given that model, where we we really don't own the inventory in the model, the return on invested capital was fantastic. And so as we look back at appliances impact on our business, we would say we'd do that again every single time. We will look for opportunities to drive market share, drive operating profit dollar growth and drive return on invested capital.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nPerfect. Makes sense. Thanks for the color.\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from line of Zach Fadem with Wells Fargo. Please proceed with your question.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nHey, good morning. I wanted to follow up on your Dallas market. As performance seems to be tracking at or above your expectations and now that you've had some time for your supply chain and facility investments to resonate, is there any quantification you can share in terms of comp lift for the market, new customer wins or wallet share gains versus the overall fleet?\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nLook, we're not going to break down the specific performance for Dallas. But again, I will tell you that Dallas has been toward the top of our performance when it comes to the Pro segment of our business. We're seeing just great reaction and engagement from our customers and those who are trying our capabilities are repeating purchases with us and those baskets continue to grow. So we're excited to continue to enhance the ecosystem.\n\nWe just expanded for the second time. Our outside sales resources and those team members are doing great, are servicing our Pro customers. So we're just very encouraged about what we're seeing in Dallas and other markets. But again, it's just that it's early in the transformation, early in the build out of the ecosystem, but great signals coming back from our customers and they really want to consolidate their purchases.\n\nWhen you think about our per customers coming to our stores over 60 times a year and then having to go to other retailers for compliments on our projects, we can serve those needs of our Pro customers and they want to consolidate their purchases with us.\n\nTed Decker -- Chief Operating Officer\n\nHey, Zach, and if I can add, I've mentioned this before and we have another quarter of this tracking. As we look at the size of the Pro, and we have a pretty good breakdown of -- they're buying, small item emergency infill versus a larger planned purchase, days out that's delivered. And then you look at the various capabilities sites that we're building, what you what you'd hope to see, expect to see is exactly what we're seeing. As these Pros engage in the capabilities, so they, get a sales -- a dedicated professional sales resource.\n\nThey join our credit program, they join our our loyalty program, they rent tools, they they use our larger quoting systems. They take delivery. As they engage with more capabilities, we're seeing larger purchases. We're seeing more repeat purchases.\n\nAgain, everything is sort of mapped out is what would you want to see to demonstrate that this is working? That's exactly what we're seeing. So we couldn't be happier. It's a journey. As we've said, Dallas is the market that is most established but we're in for in many metro markets right now with different levels of these capabilities.\n\nAnd we do look at Dallas very specifically and we look at incrementality and we know exactly what we need to drive an NPV positive project, even to add an incremental sales force. A single individual sales rep, we're tracking incrementality of sales to make sure, we're paying for that resource. But this whole ecosystem, again, working in the different -- many different markets now with different levels of capabilities built is what is behind this incredible performance with the Pro and the large Pro in particular. I mean, it's not by accident that we're growing our Pro the way we're growing it.\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nAnd Zach, it's Hector again. The only thing I would add is that think about the last project that you engage with. Every Pro planned purchase pulls a lot of unplanned purchases for that same project and also advance order pickup, and we're seeing that. We're seeing the customer not only go after the large deliver product, but also coming back to restore for that unplanned purchase to complete the project.\n\nSo the ecosystem is really working well.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nGot it. That's all helpful. And I just wanted to ask, with the recent leveling out of CPI and also the step down in your commodity basket, if you could just talk through the impact here. As you're freight or input costs start to moderate, is it fair to say that you'll immediately pass that savings on to your customers, or do you view the majority of recent price increases more or less sustainable?\n\nJeff Kinnaird -- Executive Vice President, Merchandising\n\nHey, Zach. Yeah, we manage a large portfolio of goods. We do a lot of work on competitive pricing analysis and we'll stay competitive in the market. And I will also say we have a deep understanding of almost all cost components for almost all of the products that we sell.\n\nAnd we're working with our suppliers on what it looks like when we see commodities fall off. As you said, there's been a fall off on the broader commodity index. We're watching that very closely. And we will certainly maintain our competitiveness in the market as we watch what takes place with commodities in the short end, in the mid-term here.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nThanks for the time.\n\nIsabel Janci -- Vice President, Investor Relations\n\nChristine, we have time for one more question.\n\nOperator\n\nThank you. Our final question comes from the line of David Bellinger with MKM Partners. Please proceed with your question.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nHey, thanks for getting me on. A couple of quick ones. So you mentioned a slower pace of sales implied in the back half to get to the 3% comp for the year. So how should we think about operating expense growth in relation to sales growth in both Q3 and Q4? Any specific measures you're taking to get better leverage on cost after the nice result in Q2? And just remind us, if you can, just how much of the expense structure is tied to payroll and your ability to flex that up or down in real time?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nWe -- take it in reverse order, we don't break out our percentage of payroll to sales although it is our largest operating expense, and we manage it very closely. With respect to the remainder of the year, I'd really just point you to our guidance. You're going to have variability quarter to quarter in operating expense leverage but we feel great about, at least where we think the year is heading. And again, I'd point you to guidance with respect to what we anticipate.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nOK. And then just one other one. Can you talk about the share buyback outlook? Just given where Q2 numbers have landed, is there any potential share repurchase acceleration? We've got this potential 1% added tax coming January 1. Just any change in on the buyback?\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nThere's there's no change in our capital allocation philosophy or approach. We will continue to return excess cash to shareholders.\n\nOperator\n\nMs. Janci, I'd now like to turn the floor back over to you for closing comments.\n\nIsabel Janci -- Vice President, Investor Relations\n\nThanks, Christine, and thanks, everybody, for joining us today. We look forward to speaking with you on our third quarter earnings call in November.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nIsabel Janci -- Vice President, Investor Relations\n\nTed Decker -- Chief Operating Officer\n\nJeff Kinnaird -- Executive Vice President, Merchandising\n\nRichard McPhail -- Executive Vice President and Chief Financial Officer\n\nMichael Lasser -- UBS -- Analyst\n\nHector Padilla -- Executive Vice President, Outside Sales and Service\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nSteven Zaccone -- Citi -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nJordan Broggi -- Senior Vice President, Finance\n\nMike Baker -- D.A. Davidson -- Analyst\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nMore HD analysis\n\nAll earnings call transcripts"
}