{
  "companyName": "Opko Health",
  "companyTicker": "OPK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/opko-health-opk-q3-2022-earnings-call-transcript/",
  "content": "Opko Health (OPK 0.81%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the OPKO Health third quarter 2022 financial results conference call. [Operator instructions] Please note this event is being recorded. I'll now would like to turn the conference over to Mr. Yvonne Briggs.\n\nPlease go ahead.\n\nYvonne Briggs -- Investor Relations\n\nThank you, operator, and good afternoon. This is Yvonne Briggs with LHA. Thank you all for joining today's call to discuss OPKO Health's financial results for the third quarter of 2022. I'd like to remind you that any statements made during this call by management other than statements of historical fact will be considered forward-looking and as such, will be subject to risks and uncertainties that could materially affect the company's expected results.\n\nThose forward-looking statements include, without limitation, the various risks described in the company's SEC filings, including the annual report on Form 10-K for the year ended December 31, 2021, and subsequently filed SEC reports. This conference call contains time-sensitive information that is accurate only as of the date of the live broadcast today, November 8, 2022. Except as required by law, OPKO undertakes no obligation to revise or update any forward-looking statements to reflect events or circumstances after the date of this call. Before we begin, let me review the format of today's call.\n\nDr. Phillip Frost, chairman and chief executive officer, will open the call. Dr. Elias Zerhouni, vice chairman and president of OPKO, will then provide an overview of OPKO's pharmaceutical business as well as BioReference Laboratories.\n\nAfter that, Adam Logal, OPKO's CFO, will review the company's third quarter financial results. And then we'll open the call to questions. Now, I'd like to turn the call over to Dr. Frost.\n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nGood afternoon, and thank you for joining today's call to discuss our third quarter financial results and business progress. Starting with OPKO Health's pharmaceutical business. We're pleased with the launches to date of NGENLA, or somatrogon, by our commercial partner, Pfizer. NGENLA is our once-weekly injectable growth hormone product that's expected to ease a patient's burden versus the standard daily injections.\n\nPfizer has launched in Japan and other countries, including Germany, Canada, Australia -- and Australia. NGENLA is now offered through the pharmaceutical benefit scheme, which is Australia's national drug subsidy program. Although it's still very early in the launch of just huge territories, NGENLA starting to experience significant sequential quarter growth, which Adam will review in a moment. Additionally, there are several pricing approvals pending in other European countries, which should occur soon.\n\nIn the U.S., I can assure you that we're working diligently with Pfizer to resolve the FDA's comments regarding somatrogon's BLA submission. As you know, it's Pfizer's position not to disclose any further information regarding the FDA's comments in the complete response letter, ongoing discussions with the agency or strategy to advance the regulatory process. Yet, they have publicly stated their commitment to the product in the U.S. market.\n\nAs soon as we are able, we will provide an update with additional information on the regulatory status of somatrogon in the U.S. We're pleased with the progress of our licensing partners for several of our development-stage drug candidates. LeaderMed, our joint venture partner in China, is expected to initiate a Phase 3 trial of oxyntomodulin for the treatment of obesity and type two diabetes early next year. LeaderMed is also planning a clinical trial of our Factor VII CTP and a novel long-acting coagulation factor to treat hemophilia.\n\nWe look forward to the results from these clinical studies as we plan to leverage the data for regulatory approval in countries outside of China. The ModeX team is enthusiastic and motivated to advance the pipeline of the combined company and to leverage the ModeX proprietary technology platform focused on multi-specific antibodies. Their unique platform technology represents a significant opportunity to provide better therapy and outcomes for a wide variety of patients, and we continue to advance our discussions with potential partners. We'll keep you updated on our progress.\n\nDr. Elias Zerhouni has immersed himself in all aspects of our business and has spent significant time on site at BioReference Laboratories Laboratories to provide oversight leadership of the diagnostic operations and strategy. Elias will provide further details on the lab and its performance following his commentary on the pharmaceutical business. With that brief review, I'll now turn the call over to Elias.\n\nElias?\n\nElias Zerhouni -- Vice Chairman and President\n\nThank you, Phil, and good afternoon, everyone. It's been a busy and extremely rewarding six month for me and since ModeX was acquired by OPKO for all the teams that are involved. As Phil mentioned, I've been focusing my time on all aspects of OPKO's business, including our pharmaceutical and diagnostic divisions. Starting with the integration of ModeX, the team is very excited to be part of OPKO and to leverage and benefit from the knowledge, resources and platforms within OPKO as we advance our multi-specific technologies.\n\nAs I've discussed on past calls, ModeX has two technology platforms. One is focused on developing vaccines, utilizing ferritin particles, which is a necessary protein for all cells as it brings iron for their metabolism. Our technology attaches specific antigens to the ferritin protein, which then self-assembles into nanoparticles in a very scalable and cost-effective manner. Our first application of this technology is to target the Epstein-Barr virus, which is responsible for infectious mononucleosis and its long-term consequences in some patients, such as cancers and multiple sclerosis.\n\nWe are in the pre-IND stage for that application and in earlier stages for other targets. But as you know, as vaccine trials require significantly larger numbers of subjects to test for efficacy and safety, our development strategy is to pursue collaborations with larger pharma companies to advance drug candidates into the clinic and ultimately bring them to market upon approval. And we're very encouraged with our discussions to date as we seek suitable partners for this promising vaccine technology platform, which as Phil said, potentially lends itself to multiple applications in infectious diseases. Now our novel proprietary platforms called STAR and Stealth enable us to design multi-specific multivalent antibodies beyond the bispecific and trispecific formats currently used by us and others.\n\nThis provides extraordinary flexibility for our multi-specific technology to go up to a total of six targets simultaneously. We believe that STAR is a plug-and-play platform, which optimizes functionality and manufacturing simplicity, typically a challenge for multispecific technologies. Our STAR technology is focused on infectious diseases and oncology indications. In infectious disease, we include HIV and COVID-19.\n\nIn oncology, we address both solid and hematologic malignancies. In our pipeline, we have a trispecific candidate in Phase 1 to treat HIV that receives support from the NIH actually and as well as two preclinical multispecific candidates also targeting HIV. In addition, we have several SARS-CoV-2, multispecific antibodies in late preclinical stages partially funded by DARPA that provide protection against multiple variants of concern all at once. In oncology, we have two multispecific antibodies focused on hard-to-treat solid tumors and one focused on liquid tumors.\n\nThese oncology programs are all in the preclinical stage with a goal of entering the clinic in late 2023 or early 2024. Now, I'd like to switch gears and discuss BioReference Laboratories. Although we continue to realize additional cost reductions post the COVID expansion that we experienced, those initiatives are moving quite rapidly. The laboratory had another challenging quarter as we transition away from COVID testing and focus on strengthening our base business.\n\nAs discussed in our last conference call, a three-pronged plan was put in place in order to rightsize the expense structure and drive growth in our core and specialty testing businesses. So we first focused on decreasing our cost structure through our Reach initiative, which commenced at the beginning of 2022. We were looking to remove $140 million a year in expenses this year and have realized savings of more than $100 million to date. We have reduced our workforce to 3,300 at the end of September from a total of over 4,300 prior to July.\n\nIt is imperative that we also align our infrastructure and related costs with current testing volumes for COVID being reduced to endemic levels in addition to inflation pressures. We have focused our efforts on operational excellence, including revenue cycle management to offset these pressures while pursuing efficiencies in virtually every area of our business, including rationalization of our testing platforms and looking at opportunities to use lab automation and machine learning where possible. I think the highlight of our diagnostic business is our specialty segments, which continue to outperform. These segments include oncology, women's health, neurology and special ventures.\n\nAll of which have demonstrated promising growth opportunities. We, for example, continue to outperform in the oncology franchise as we are showing strong growth year on year within our genomic sequencing line of testing. We have expanded our relationship with Westchester Medical Center beyond our existing lab management business. In addition, we have a new definitive agreement with the University of Rochester for oncology testing, as well as several other large cancer centers.\n\nWe continue to expand our best-in-class oncology portfolio with new and emerging diagnostics testing. An example of this is Onko clone for minimal residual disease in emerging unmet need, which oncologists consider critical to their management of patients, which helps physicians at all times -- oncologists to determine whether the disease is reoccurring or not and adjust therapy accordingly. On the core business side, we've done work to prepare for the emerging respiratory season and launched a new multitest panel that tests for simultaneously for COVID, for flu A, flu B and RSV, which is well received and increasingly used. I think we've done a good job of stabilizing volume in women's health with an eye on growth moving forward.\n\nAn example in women's health is a collaboration with Aspira Women's Health -- and BioReference Laboratories and Aspira will co-market and distribute OVA1plus, which combines Aspira's FDA-cleared blood tests, Ova1 and OVERA to detect the risk of ovarian malignancy in women with adnexal masses prior to surgery. Our 4Kscore test for prostate cancer continues to perform well. And the third prong of our rightsizing plan is focused on optimizing our organizational structure to streamline the responsibilities of our leadership team to improve our speed to market with new products and initiatives and most particularly improve our agility and decision-making through a much less complex management structure. We're also in active discussions with health systems and value-based care organizations, which also represent a significant growth opportunities and synergy with our diagnostic platforms.\n\nAnd so I will now turn the call over to our CFO, Adam. Adam?\n\nAdam Logal -- Chief Financial Officer\n\nThank you, Elias. Starting with our Pharmaceutical segment, Pfizer, our partner for our long-acting growth hormone, recently launched NGENLA in a number of countries since earlier this year and continue to expand its launch over the next 18 months, a part of it is global regulatory and commercial strategy. We're entitled to gross profit share of royalties, depending on the region in which the product is sold. In Japan, we are in the franchise gross profit stage.\n\nAnd in Europe, we are receiving royalties until pricing is approved and NGENLA is launched in two additional major markets in Europe. If approved in the U.S., their U.S. region will move to gross profit share. But until then, we will continue to receive royalties on sales in that region's market.\n\nOverall, revenues from the pharmaceutical segment for the three months ended were $36.9 million, a decrease of $8.8 million, reflecting foreign currency pressures in our Chilean and European operations as well as a decrease in RAYALDEE volumes. In addition, during the 2021 period included nonrecurring upfront payments from CAMP4 in LeaderMed. Total costs and expenses from our pharmaceuticals segment in the 2022 period were $65.2 million, including $16.5 million of noncash intangible amortization. Research and development activities increased $4.7 million, reflecting a full quarter of development expense from our MODEX operations as well as costs related to our somatrogon development activities, principally around the development of a next-generation device.\n\nAs a result, operating loss from our pharmaceuticals segment was $28.3 million for the third quarter of 2022. The comparable period of 2021 includes a $31.5 million gain, which offset expenses of $48.5 million for net expense of $17 million and income from operations of $28.6 million. Moving to our diagnostics segment. We reported revenue of $142.9 million compared to $340.2 million for the 2021 period.\n\nThis decline reflects decreased COVID testing levels as the broad testing market has shifted to rapid at-home testing. We continue to execute our Reach program, as Elias mentioned, and during the third quarter alone reduced our annualized employee costs by $46 million and are targeting further expense reductions across the entirety of the organization. As Elias mentioned again, so far in 2022, we have reduced our expense run rate by over $100 million and continue to see benefits of this program each sequential month of the third quarter of 2022. We've reduced or eliminated spending on our longer-term commercial initiatives, including Scarlet Health and our digital health platforms, while we bring the remainder of our cost structure in line with our expected volume levels.\n\nWe have identified a number of near and medium-term growth programs, which Elias outlined. We expect those to realize in the first half of 2023, which will help return BioReference to profitable growth. Looking at our base business. Our third quarter volumes decreased by about 4%, and as a result, negatively impacted our overall growth and operating margins.\n\nWe saw strength in certain lines of our testing, as Elias mentioned, with our cancer genomics business showing growth along with 4Kscore tests compared to 2021 levels. However, these gains were offset by the evolving physician practice market where we saw client loss due to the consolidation and roll-up of small physician group offices. Operating loss for our Diagnostics segment was $49.5 million, which reflects a sequential decrease of approximately $8 million before considering $5 million of nonrecurring charges included in the third quarter. The third quarter of 2021 reported operating income of approximately $19.7 million, which benefited from significant COVID-19 testing that occurred last summer.\n\nTurning to the consolidated financial results for the third quarter. We reported an operating loss of $87.8 million compared to 2021 operating income of $37.8 million. Net loss for the third quarter includes a $30.6 million noncash mark-to-market adjustment from the decline of the price of Sema4's common stock, offset by an income tax benefit of $40.3 million, resulting in a net loss of $86.1 million or $0.11 per share compared to net income of $28.7 million or $0.04 per diluted share for the period which, as I previously mentioned, benefited from COVID testing as well as the sale of our fill-finish facility in Ireland. As we look at the remainder of 2022, we have narrowed our ranges, which are with consistent assumptions from prior quarters to the following.\n\nWe don't expect the surge in COVID testing. Our base business will continue to -- with most -- our most recent trends, and we have not factored in any changes to the value of our Sema4 common stock. With that, we now expect full year revenue for 2022 to be between $980 million and $1 billion, including revenue from services of $735 million to $745 million. Revenue from products of $135 million to $140 million and other revenue of $103 million to $110 million.\n\nWe expect costs and expenses to be between $1.23 billion and $1.25 billion, which reflect various assumptions or testing volumes. Operating results include approximately $110 million of noncash depreciation and the amortization expense as well as expected research and development expense of $75 million to $78 million. Thank you, and we'll open up the call for questions. Operator? \n\nOperator\n\n[Operator instructions] Our first question comes from Maury Raycroft of Jefferies. Please go ahead.\n\nKevin Strang -- Jefferies -- Analyst\n\nHi. This is Kevin Strang on for Maury. Thanks for taking my questions. First question on -- and again in Europe.\n\nJust can you talk about how far away you could be from profit sharing there in terms of the last two launches? Could that be by year-end? And then also, is there anything that you've learned so far from the Ascendis launch on patient and doctor appetite to switching to the long-acting growth hormone. \n\nAdam Logal -- Chief Financial Officer\n\nSo I'll talk about the profit share. Thanks for the question. So in Europe, we've projected and guided that we expect that switch to happen in the first quarter of next year. Certainly, things could happen sooner, but that is where our current expectations are.\n\nAs far as the Ascendis launch, so the adoption in the U.S. seems to be going fairly well for them. It's hard to see anywhere beyond that. But we think the switching is going to happen rapidly and the adoption of the products will happen quickly under the long-acting form. \n\nKevin Strang -- Jefferies -- Analyst\n\nGreat. Thanks. And just one more follow-up on the cost reduction effort. You mentioned $100 million so far this year.\n\nCan you just talk about where you are in the context of your final sort of cost reduction goals. And then given the COVID-19 testing paradigm, what do you expect your capacity there will be going forward? \n\nAdam Logal -- Chief Financial Officer\n\nYes. So we talked about the Reach program. It's going to be a multiyear effort. We haven't finalized our targets for 2023 on what that program is going to go for.\n\nBut we've set the objective to take out $140 million in costs, and we're well on our way to that already. Elias, I don't know if you wanted to say any words about the Reach program based on your involvement to date.\n\nElias Zerhouni -- Vice Chairman and President\n\nNo, I think you're right. I think we are really aiming to go to $140 million and we actually see opportunities to go beyond that related to the flattening of the organization and the ability for us to automate the laboratories and therefore, reduce labor expenses. So $140 million is a minimum, and I think we can do better than that. But I couldn't tell you until we have the 2023 figured out. \n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nAnd as it relates to COVID capacity, so we continue to have adequate capacity. As you remember, we brought up capacity pretty quickly when it was needed and could flex to it. Right now, we're staffed to our current volumes, which we've talked about have come down dramatically from where they were earlier this year. But would have the ability to scale back up should we need.\n\nElias Zerhouni -- Vice Chairman and President\n\nI think also -- if I may, I think also that we -- no, no, we were quite aware that this season will be different than the previous ones that COVID will be persistent as an endemic virus. Flu A, flu B, RSV, as you know, from the projections of CDC were predicted to be very high. So we developed a new offering, a 4-in-1 test that is actually getting a lot of good reviews and good reception in the medical community and growing very fast in terms of demand because this winter and the beginning of next year are predicted to be quite severe in terms of what people call the tridemic of RSV, flu and COVID just a point. \n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nI was just wanting to add that with regard to BioReference, it's a two-pronged approach. One, of course, is cutting costs, but not to neglect, of course, the emphasis on increasing revenues. And in that regard, one point was mentioned that I'll highlight and that was new ventures. This is an area that we're devoting a lot of attention to with some really good talent applying themselves.\n\nAnd I'm very hopeful that this will pay off in a serious way.\n\nKevin Strang -- Jefferies -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from Jeffrey Cohen of Ladenburg Thalmann and Company, Inc. Please go ahead.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nHi, Dr. Frost, Dr. Zerhouni and Adam. How are you?\n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nGood, Jeff.\n\nElias Zerhouni -- Vice Chairman and President\n\nGood. Thanks.\n\nAdam Logal -- Chief Financial Officer\n\nHi, Jeff.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nSo just a few questions from our end. I guess, firstly, if we could go back to NGENLA a little bit. Do you have clarity or does Pfizer share the information as far as reimbursement and pricing by some of these territories, which they're launching throughout?\n\nAdam Logal -- Chief Financial Officer\n\nSo we don't get any specific pricing guidance other than what's publicly available otherwise.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nOK. Got it. That's helpful. Thanks.\n\nAnd Adam, I don't know if it's handy, but is it possible to get a cost of service revenue and cost of product revenue, at your convenience?\n\nAdam Logal -- Chief Financial Officer\n\nYes, we'll get that to you. The queue should be on file in a minute now, Jeff. \n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nSuper. And then, I guess, lastly for us, I wanted to hear a little more about some of the initiatives on the BRL side. I saw that you had an interesting arrangement with Aspira Women's Health as far as that testing. When -- Dr.\n\nFrost, you had talked about new ventures. Could you give us any more color there as far as is it in-licensing of tests or developing your own tests? And kind of how you're building that out at your end? \n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nI would say all of the above.\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nGot it. OK. And then lastly, any specific readout or any commentary on 4K from the quarter from Q3 or any outlooks going forward on 4K?\n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nI think that it's doing very well. It's certainly moving ahead of last year. And again, Elias is doing a good job of identifying initiatives. Jane Hsiao has been working with the team to bring more payers on board.\n\nBut we're very optimistic that the growth that we're seeing now will continue and perhaps accelerate. \n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nOK. Super. Thanks for taking our questions.\n\nAdam Logal -- Chief Financial Officer\n\nThanks, Jeff. \n\nOperator\n\nNext question comes from Edward Tenthoff of Piper Sandler. Please go ahead.\n\nTed Tenthoff -- Piper Sandler -- Analyst\n\nGreat. Thank you very much. Appreciate the update. I'm really excited about the new efforts with ModeX.\n\nYou mentioned with so much going on, maybe you can get into a little bit more detail on partnering opportunities. Are there specific areas like -- and I'm sort of making this up, but like oncology where you would either keep or maybe because of the complexities with partners? Or is there a focus more internally on infectious disease? How will you sort of prioritize programs and ultimately decide what to keep internally and what to ultimately develop externally? Thank you.\n\nElias Zerhouni -- Vice Chairman and President\n\nThank you for the question, very important question. The first thing is that we have received a lot of incoming interest as we presented our portfolio in various venues. And the interest is leading to a strategic consideration on our part, obviously. We do have an infectious disease portfolio that's composed of two segments.\n\nThe vaccine segment where the most advanced vaccine candidate is EBV. And as you know, EBV is quite important in can -- mononucleosis, but also cancer and now multiple sclerosis. So that's a huge market that has attracted a lot of interest. At the same time, we have flu and other prototypes that are being tested.\n\nAnd so we think that in vaccines and viral diseases like HIV and COVID, we have quite a bit of near-term potential for large collaborations as well as potential trials. In terms of oncology, we are really looking at using the multivalent, multi-specific approach to test out our ability to actually not look at very unknown targets, but known targets in unique novel combinations based on the knowledge that we have. Our preference would be to keep that in-house, not to partner those because we think that the multispecific multivalent platform has enormous potential as Dr. Frost mentioned to you.\n\nSo we are trying to finance, if you will, a little bit through our infectious disease, maybe licensing out and partnering. The ability for us to keep half portfolio internal to OPKO. I don't know if that helps you.\n\nTed Tenthoff -- Piper Sandler -- Analyst\n\nSuper helpful color. Thank you. \n\nOperator\n\nOur next question comes from Yale Jen of Laidlaw and Company. Please go ahead.\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nGood afternoon, and thanks for taking the questions. The first question is that I remember in the last call, you mentioned that you may doing R&D Day to highlight some of the things in the ModeX. Is that still in the schedule for this year? Or that will be in next year? \n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nYes, it is still in the schedule. We're still planning it. We do have a few things that we need to finalize in terms of discussions with others that we need to do. So we're aiming for something either December or J.P.\n\nMorgan or right around J.P. Morgan, that's where we're trying to do the R&D Day. I think things will be a little more mature. And I think people will enjoy more because it will be more detail than what we can do today.\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nOK. Great. That's helpful. Maybe one more question.\n\nIn the vaccine, as you mentioned, that there most likely to be a partnering opportunity. But in terms of the stage -- development stage to be partnered, are you guys looking for complete maybe the first -- earlier stage of clinical development before partnering? Or you are even contemplate partnering out in much early even preclinical or early clinical stage?\n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nWe have interest for both things. We're going to do what's really practical, and it depends on the quality of the partners. And so we're basically at a pre-IND stage. We're going.\n\nWe have the manufacturing we're working on and all of the steps you need to have before you go through IND. And we're willing to do it alone if we need to, if we find terms of collaborations that are attractive, we'll do it the other way. So we are not pressed for one choice or the other. We can continue it on our own.\n\nWe can also partner it. I'm not weathered to one way or the other is what I'm trying to say.\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nUnderstood and appreciate that. And maybe the last question is a housekeeping one that -- as we look at the total other revenue or income, it seems structurally a lot between quarters. So how should we, in general, think about this fit number going forward?\n\nAdam Logal -- Chief Financial Officer\n\nYes. So it's going to be a balancing number because we've got some lumpy milestone payments that come through in some of our partnering deals as well as just the overall milestones that come through. So the consistency is going to be the growth from our RAYALDEE and Pfizer gross profit and royalty streams. But that -- and that we expect to build a good base.\n\nAnd when those individually become material, we'll start to break those out for you guys to work in your model. But otherwise, we'll continue to give guidance on what's included in that number and what's not included like early this year, we talked about that we didn't have the milestone payments factored in until we got the approvals and then we upped our guidance related to those.\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nOK. Great. That's very helpful. And congrats on the progress this fall.\n\nThanks a lot.\n\nOperator\n\nAt this time, the question-and-answer session is concluded. I would now like to turn the call back over to Mr. -- Dr. Frost for any closing remarks. \n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nWell, thank you for your participation and excellent questions. As you can see, there's a lot more detailed work going on in the development of new products. What we hope to do is some time in the near future, perhaps in the first quarter, have a research day in which we can go into a little bit more detail about some of these projects and give you a chance to meet some of the scientists so that you can get a better feel for what we're dealing with here and to understand why we're so enthusiastic. Having said that, I'll end the session and invite you to join us for the end of the year fourth quarter meeting, which will be forthcoming.\n\nThank you. \n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nYvonne Briggs -- Investor Relations\n\nPhillip Frost -- Chairman and Chief Executive Officer\n\nElias Zerhouni -- Vice Chairman and President\n\nAdam Logal -- Chief Financial Officer\n\nKevin Strang -- Jefferies -- Analyst\n\nJeffrey Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nTed Tenthoff -- Piper Sandler -- Analyst\n\nYale Jen -- Laidlaw and Company -- Analyst\n\nMore OPK analysis\n\nAll earnings call transcripts"
}