{
  "companyName": "MSCI",
  "companyTicker": "MSCI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/msci-msci-q3-2022-earnings-call-transcript/",
  "content": "MSCI (MSCI -1.43%)\nQ3 2022 Earnings Call\nOct 25, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. And welcome to the MSCI third quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. [Operator instructions].\n\nAs a reminder, this conference call is being recorded. I would now like to turn the call over to Jeremy Ulan, head of investor relations and treasurer. Please go ahead and begin.\n\nJeremy Ulan -- Head of Investor Relations and Treasurer\n\nThank you, operator. Good day, and welcome to the MSCI third quarter 2022 earnings conference call. Earlier this morning, we issued a press release announcing our results for the third quarter 2022. This press release, along with an earnings presentation we will reference on this call as well as a brief quarterly update are available on our website, msci.com under the investor relations tab.\n\nLet me remind you that this call contains forward-looking statements. You are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date on which they are made and are governed by the language on the second slide of today's presentation. For a discussion of additional risks and uncertainties, please see the risk factors and forward-looking statements disclaimer in our most recent Form 10-K and in our other SEC filings. During today's call, in addition to results presented on the basis of U.S.\n\nGAAP, we also refer to non-GAAP measures, including, but not limited to, adjusted EBITDA, adjusted EBITDA expenses, adjusted EPS, and free cash flow. We believe our non-GAAP measures facilitate meaningful period-to-period comparison and provide insight into our core operating performance. You'll find a reconciliation to the equivalent GAAP measures in the earnings materials and an explanation of why we deem this information to be meaningful as well as how management uses these measures in the appendix of the earnings presentation. We will also discuss run rate, which estimates, at a particular point in time, the annualized value of the recurring revenues under our client agreements for the next 12 months, subject to a variety of adjustments and exclusions that we detail in our SEC filings.\n\nAs a result of those adjustments and exclusion, the actual amount of recurring revenues we will realize over the following 12 months will differ from run rate. We therefore caution you not to place undue reliance on run rate to estimate or forecast recurring revenues. We will also discuss organic growth figures, which exclude the impact of changes in foreign currency and the impact of any acquisitions or divestitures. On the call today are Henry Fernandez, our chairman and CEO; Baer Pettit, our president and COO; and Andy Wiechmann, our chief financial officer.\n\nFinally, I would like to point out that members of the media may be on the call this morning in a listen-only mode. With that, let me now turn the call over to Henry Fernandez. Henry?\n\nHenry Fernandez -- Chairman and Chief Executive Officer\n\nThank you, Jeremy. Welcome everyone, and thank you for joining us today. In the third quarter, MSCI delivered another strong performance despite significant turmoil and dislocation in financial and commodity markets around the world. We posted organic recurring subscription run rate growth at over 14% and adjusted EPS growth of 12.6%.\n\nWe achieved our best third quarter ever of net new recurring subscription sales growing at 26%. In addition, our retention rate was 96.4% up by 188 basis points from a year earlier. In terms of capital management, we repurchased another $225 million worth of MSCI shares through October 24. For the year as a whole, our total share repurchases now stand at approximately $1.3 billion.\n\nThis performance demonstrates the resilient and adaptability of MSCIs all-weather franchise. There is no question that the global economy stated major headwinds. These headwinds have created challenges for all companies including MSCI. Yet, they have also created a massive opportunity for us to differentiate ourselves and to show to both clients and shareholders the power of our all-weather franchise.\n\nAnd moments of extreme volatility and high uncertainty investors become more reliant in high-quality data in type of models and weather and research. They want a clear blueprint for navigating choppy waters, MSCIs tools can help them design one. Indeed, our solutions take on even greater importance during periods of elevated global risk. In other words, they face the time when well we do best matters most and we fully intend to demonstrate it.\n\nOur third quarter performance show continuous strength across client segment and product line. In index, we delivered our highest subscription run rate growth in a decade at 12.6%. And deleted future some options trading volume linked to MSCI indices, increased by 21%. In analytics, we achieved our highest retention rate ever at 95.9%.\n\nWe also posted subscription run rate growth excluding foreign exchange of 97% in climate and 35% in ESG ex-climate. All of these numbers illustrate how MSCI is capturing key market trends. At the index in trend continues beyond market capitalization indices, we are meeting investor demand for tools to support more customized and personalized portfolio construction and highly specialized outcomes. Likewise, as global economic pressures accumulate, we have provided the risk analytical tools investors need to stay ahead of the turmoil.\n\nMeanwhile, as ESG becomes increasingly mainstream, we are helping investors measure the full scope of sustainability risks, capitalize on sustainability opportunities, and achieve sustainability objectives. For all the political noise and controversy around ESG, the simple fact is that sustainability risks are financial risks and will continue to be so. Investors know this, in fact, a recent PwC report found that 81% of institutional investors in the U.S. along with 84% in Europe both plan to increase their allocations to ESG products over the next two years in growth.\n\nRecent report projected that ESG related assets under management, we have reached nearly $34 trillion globally by 2026 and 84% increase from 2021. And born to underscore that as our ESG product line becomes more diverse with many different use cases and client types, ESG sales growth will naturally fluctuate based on market shifts, difficult conditions, and regulatory development. Right now, the world is simultaneously witnessing global energy and food crisis, the largest European war in almost 80 years, the biggest inflation surge in decades, rapidly rising interest rates and COVID lockdowns in China which continue to affect supply chains. At the same time, MSCI remain bullish on ESG long-term potential.\n\nIf anything, the main factors driving ESG growth and greater environmental and social awareness to demographic shifts we'll become even more powerful in the years ahead. And for climate specifically, there is no turning back in the rate to net zero emissions. While the global energy crisis has created new obstacles to decarbonization, policymakers continue to embrace bold green investment plans. Moving to U.S., President Biden recently signed a most aggressive climate law in American history.\n\nIn Europe, governments in active all proposed a wide range of measures that would speed up a low-carbon transition. These include more ambitious decarbonization and clean energy targets, policies to maintain or expand nuclear power, and a $5.4 billion hydrogen project. For our part, MSCI will continue building a robust and dynamic climate franchise. Two climate wins in the third quarter deserve special attention because they demonstrate our emergence as a leader in this area.\n\nBoth the California State Teachers' Retirement System or CalSTRS approve a plan to cut their portfolio emissions in half by 2030. To help them get there, they proposed the lowest proposal for 20% of their public equity assets to drive the MSCI ACWI low carbon target index. This means CalSTRS will now have nearly $27 billion allocated to tracking that index. State-owned, the New Zealand Super Fund announced that he have moved roughly 40% of this total investment portfolio to track the MSCI world climate Paris-aligned index and the MSCI merger market climate Paris-aligned index.\n\nThat 40% translates into NZ$25 billion or about $15 billion. Each win represents a milestone on our climate journey. As I have frequently said, MSCI aspires to be the No. 1 provider of climate solutions to the global finance and investment industries.\n\nWe recently published a Net Zero guide for asset owners outlining complete steps for decarbonizing portfolios. We also hosted White House National Climate advisor Ali Zaidi at our New York offices during Climate Week. That same week, we joined with the Glasgow Financial Alliance for Net Zero or GFANZ to help launch a proposed climate data public utility. All of these have helped MSCI generate strong momentum doing the run-up to COP27 in Sharm el-Sheikh, Egypt.\n\nIn climate, ESG, analytics, index, and other area MSCI continues to benefit from our mission-critical solutions, our diversified client base, and our commitment to financial discipline. Right now, many companies are retrenching and turning in work, MSCI is doing quite the opposite. Even as we reallocate resources, we continue investing in key differentiators using our Triple-Crown investment framework. More than that, we continue to attract talent and show MP&A opportunities also down on client centricity and reinforce our competitive advantages.\n\nAll of these will help us emerge even stronger when the current market turmoil subsides. And with that, let me turn the call over to Baer. Baer?\n\nBaer Pettit -- President and Chief Operating Officer\n\nThank you, Henry. And greetings, everyone. As Henry discussed, the world is experiencing historic levels of economic, financial, and geopolitical turmoil simultaneously. Against this backdrop, we see not only big market and foreign exchange swings but also geographic factor sector and asset rotations.\n\nAt MSCI, our highly diversified product offerings continue to serve us well. For example, the benefits of our non-U.S. dollar expenses have more than offset FX-related revenue headwinds. Likewise, the strong performance of our growing index derivative franchise has helped offset some of the pressures related to AUM revenues.\n\nAs we notes last quarter, MSCI has activated our downturn playbook, which means we continue investing in key differentiators while tightening expenses in less time-sensitive areas. This has allowed us to generate attractive financial returns and position ourselves to capitalize on opportunities when they emerge. All of that represents essential context for understanding both our Q3 performance and our strategic priorities moving forward. Henry mentioned a few areas where MSCI delivered especially strong results including index, analytics, and Climate.\n\nIn my remarks, I'd like to explore each of these areas in greater depth. In index, MSCI posted 12% subscription recurring revenue growth. Our highest retention rate in more than three years and our 35th consecutive quarter of double-digit subscription run rate growth. We also achieved market cap subscription run rate growth of a 11%.\n\nA key driver of our third quarter Index performance was custom index. MSCI has focused heavily on custom indexes in response to a broader industry trend. More and more investors favored differentiated systematic outcome-oriented strategies for which they need to design custom index. Last week, for example, we announced the launch of institutional client- designed indexes.\n\nIt will make it easier for asset owners to design customized indexes underpinning their investment strategies. Turning now to our analytics business. In the third quarter, analytics posted recurring net new sales growth of 73% with strong numbers across products and client segments. In particular, analytics achieved robust growth with risk and equity models on the product side and with banks and hedge funds on the client side.\n\nAt the regional level, analytics delivered its best run rate growth in the Americas in more than five years. In analytics as with Index, MSCI solutions helped clients to distill and interpret a huge amount of complex data quickly and efficiently. Last month, we launched a new analytics module known as risk insights, which automates many previously burdensome tasks and processes thereby giving clients more time to focus on their analysis. Risk insights will make it easier for investors to trench more raw data into meaningful useable information with an integrated view of performance and risks.\n\nWe considered a timely launch in the high levels of market volatility and uncertainty. Finally, just a few comments about climate and ESG. As Henry mentioned, we posted subscription run rate growth excluding FX of 97% in climate while also achieving a 97.6% retention rate. Before that last number in perspective, it represented a 456 basis point increase over our climate retention rate a year highly.\n\nThe largest portion of our run rate Climate Metrics continues to grow at over 60% with exceptional growth in newer areas. For example, MSCI delivered over a 125% growth from climate value-at-risk supported by our recently launched total portfolio footprinting solution. In addition, our ESG retention rate increased by 66 basis points to reach 97% overall. In September, we launched a Bloomberg MSCI China ESG index week which consists of nine separate ESG indexes.\n\nCollectively, they represent the first-ever Bloomberg MSCI index week to track both the RMB-denominated bond market and the U.S. dollar-denominated Chinese bond market all incorporating ESG and socially responsible investment considerations. Last month, we expanded our index offerings by launching MSCI fixed income climate transition corporate bond indexes whose standards exceed the minimum requirements of the European Union's climate transition benchmark. We continue to see strong growth with our real asset and analytics climate solutions, growing run rate by approximately 250% year-over-year.\n\nWhile our climate index solutions be approximately 80%. We helped to drive additional client progress to our recent minority investment in EVORA Global, a British environmental consultancy. By combining EVORA's proprietary software with MSCIs climate models and indexes, we will further embed climate risk considerations in the real asset investment process. It's a common scene that tied together all these various products and partnerships.\n\nSimply put, MSCI is constantly finding new ways to meet the needs and expectations of global investors. We have proven our ability to adapt, innovate, and succeed, even in the most challenging circumstances. And with that, I'll turn the call over to Andy. Andy?\n\nAndy Wiechmann -- Chief Financial Officer\n\nThanks, Baer. And hi, everyone. The strong secular demand for offerings and the resilient nature of our business model fuel impressive results across the business. In addition to the 14.2% organic subscription run rate growth this quarter, we experienced double-digit subscription run rate growth excluding FX across all geographic regions as well as across all major client segments.\n\nWe recorded the highest third quarter ever for new recurring and net new recurring subscription sales increasing 8% and 24% year-over-year respectively, excluding the acquisition of RCA. Within Index, on top of the strength we see within our non-market cap modules, we continue to see remarkable resilience within our market cap index modules which delivered an 11% subscription run rate growth. This has been fueled in large part by tremendous demand within higher-growth client segments. Across the index subscription franchise, we saw an 18% subscription run rate growth from broker dealers, hedge funds, and wealth managers on top of 10% growth from asset managers and asset owners.\n\nAsset-based fee revenues experienced declines in the quarter. With ETFs and non-ETF passive fees impacted by declines in global market levels somewhat offset by continued level of elevated volumes in features and options linked to our indexes. ETF linked to MSCI index has experienced marginal net cash sale outflows in the quarter resulting in outflows in broad-based EM exposure funds in all country products, two areas where the broader ETF market was muted. However, we continue to see inflows and high market share capture flows in the fund linked to our equity ESG and climate indexes which captured $9.5 billion of the $13 billion of total industry flows.\n\nAdditionally, fixed-income ESG and Climate ETF linked to indexes developed with partners and to our proprietary indexes witnessed nearly $7 billion of inflows during the quarter. Revenue from listed features and options linked to MSCI indexes continue to provide a meaningful offset to AUM declines growing 16% year-over-year. This growth has been fueled by elevated volumes that were in line with the last couple of quarters. In analytics, the strong demand for our tools in our current environment helped drive 8% growth in subscription run rate excluding FX.\n\nWe had an 11% growth in recurring subscription sales will also experiencing a 35% decline in cancels and highest retention rate of all time in the segment. Recurring net new was up 73% year-over-year. Within the segment, we continue to see strong momentum in front office equity and fixed income portfolio management tools with strength in hedge funds and then helping it drive the growth. Additionally, analytics continued to gain traction in our climate solutions including Climate Lab Enterprise.\n\nIn ESG and Climate, we delivered subscription run rate growth a 42% excluding FX, roughly one-third of recurring subscription sales were generated from our climate solutions and the climate run rate across all segments reached $65 million which is an increase of 89% from a year ago. Within our ESG and Climate segments, merging client areas including wealth managers, hedge funds, broker dealers, and corporates collectively have run rate growth of more than 60%. We did see a lower level of new recurring subscription sales in the third quarter. On top of changes in the broader market in economic environment which is likely impacting purchasing decisions in some areas, there are many layers of growth in our ESG and climate franchise across a wide range of solutions and use cases which results in a dynamic growth rate that's impacted by the pace of new regulations, client segment dynamics, asset class shifts, and geographic factors.\n\nShifts in these layers of growth will drive variations in overall segment growth rate, however, we continue to believe in significant, long-term secular opportunities and continued momentum. With real assets, the organic subscription run rate growth was 12% combining our legacy real-estate business and RCA. Given the all-weather dynamics of our financial model and our ability to proactively manage the expense base, we were able to drive adjusted EPS growth of 12.6%. During the quarter, we continue to utilize our downturn playbook by further flexing our expense base to mitigate the impacts of the AUM-based headwinds.\n\nWe are prioritizing key investment areas to address the most critical needs in this challenging environment while meaningfully moderating the pace of hires in less critical and time-sensitive areas. Additionally, we continue to flex certain non-compensation expenses in areas like professional fees and we had a slightly lower bonus accrual. In the quarter, revenue had a $12 million FX headwind from an appreciating US dollar. This was more than offset by a $13 million FX benefit resulting from a global expense footprint.\n\nAdditionally, our proactive capital management contributed $0.15 of the adjusted EPS growth as we've now repurchased approximately $1.3 billion of our shares or approximately 2.7 million shares year-to-date. We ended the quarter with a cash balance of $867 million of which approximately $600 million is readily available. We continue to be well-positioned to opportunistically pursue bolt-on M&A and share repurchases against this volatile market backdrop. Lastly, I would like to turn to our updated guidance which we published earlier this morning.\n\nWhile we expect continued volatility, our guidance assumes generally flat market levels throughout the balance of the year. As mentioned earlier, we have continued to utilize more levers in our downturn playbook with a focus on moderating our pace of expense growth. Our downturn actions are reflected in our decreased operating and adjusted EBITDA expense guidance. It's worth noting that we remain consistent in our approach that the pace of spend may fluctuate up and down based on the trajectory of our asset-based fees, the performance of the business more broadly in the global operating environment.\n\nWe've modestly increased our range for depreciation and amortization expense mainly reflecting a continued higher level of capitalized software development cost across products. Lastly, we have increased our net cash provided by operating activities and free cash flow guidance which reflects the lower than originally projected tax payments and cash expenses in the second half of the year as well as resilient fee in cash collections. We've narrowed our tax guidance which continues to reflect in expectation of the higher rate in Q4 in line with what we saw in Q3. Across the business, we continue to see strong levels of demand for our products which is underscoring the mission-critical nature of our tools.\n\nWe are heavily focused on both driving the attractive runway of long-term growth while protecting the financial model of our all-weather franchise. And with that, operator, please open the line for questions.\n\nOperator\n\nThank you. [Operator instructions]. And first question is from Manav Patnaik with Barclays. Please go ahead.\n\nManav Patnaik -- Barclays Capital -- Analyst\n\nThank you. Good morning. Can you just talk about ESG first, can you just -- what decline is specific run rate in the quarter? And if you could just talk about the different pieces of ESG, kind of the growth rate in the franchise in there?\n\nAndy Wiechmann -- Chief Financial Officer\n\nSure. Hi, Manav. Yes, we did throw a number of climate metrics out during the call, so it's probably helpful to summarize them here. I'll start at the top.\n\nIf we look across MSCI, so across all product lines, we had $65 million of climate run rate. That was going at 89% year-over-year. If we look at just the subscription portion of the Climate run rate, that was $46 million. And that was growing at 92%.\n\nSo, that excluded about $19 million, between $19 million and $20 million of ABF revenue from our index segment. If we look at the climate component in our ESG and climate segment, that's $37 million. And that's growing at 97% ex FXs as Henry and Baer alluded to in their prepared remarks. And so, climate is becoming a more meaningful component of the overall business.\n\nIt's clearly contributing a meaningful amount to the overall growth of the segment and the overall company. And we continue to be quite bullish on the prospects more broadly across both climate and ESG.\n\nManav Patnaik -- Barclays Capital -- Analyst\n\nRight. And then, Andy, and in terms of -- obviously our retention rates are high as subscription growth is good. And if we enter in certain environment next year, just historically on what time lag or when do you start seeing the first times of some the pressure on those metrics?\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes. I think if you highlighted -- and we've seen, the retention rates do underscore the fact that our tools are very mission critical to our clients and there in areas of long-term secular growth which is clearly driving some resiliency. And you can see that in not only the overall retention rate but the fact that it's close to record levels across all areas. Although, as you pointed out and I've mentioned in the past, in past downturns, when we've seen a few I'll say to several quarters of sustained market pullbacks, we do tend to see a pickup in client events like fund closures, desk closures, restructurings, mergers, so client events like that tend to pick up and our largest source of cancels is client events.\n\nAnd so, we are proceeding with caution here. Where we're definitely excited about the high retention rates but given past performance what we've seen in past downturns, we could see a pick-up in cancellations if this environment persists.\n\nManav Patnaik -- Barclays Capital -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. And the next question will come from Alex Kramm from UBS. Please go ahead. And that looks like Alex's name just connected and so he was being promoted into the queue.\n\nWe will move to the next question, and that is from Ashish Sabadra with RBC Capital Markets. Please go ahead.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nThanks for taking the question. We saw some pretty good improvement on the analytics front as well. And so, I was just wondering if you could talk about what you're seeing from a deal pipeline perspective, have you seen any change there, any elongation in the deal, sale cycle. Any color on the momentum in the business? Thanks.\n\nHenry Fernandez -- Chairman and Chief Executive Officer\n\nYes, thanks for the question. Look, I don't think we've seen anything dramatically different, to be honest. I think this is consistent with the messaging we've had for some time now. So, I think our level of execution is strong.\n\nAs Andy mentioned, the retention rate shows the predictability of our products. So, I think we're really in a mindset of letting the numbers speak for themselves and continuing to execute with our strategy. And hopefully, we'll keep moving things in this direction. But there is -- I don't think there has been any really material changes in the outlook.\n\nIt's more than we're doing a good job, we're enhancing our products, we're servicing our clients, and I think we're getting the results of that.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nThat's very helpful color. And maybe, just a quick follow-up on the private asset side. Again, pretty strong momentum there as well I was wondering if you could talk about the RCA, now that that acquisition has anniversary, what have you seen on that front and what else is in line for private assets? Thanks.\n\nHenry Fernandez -- Chairman and Chief Executive Officer\n\nSure. Yes, absolutely. So look, we're definitely on plan with the integration and we're pleased with how that's going and we're definitely more convinced that the strategic logic of the acquisition than ever. As you say, the topline is growing attractively.\n\nClearly, the environment for real estate is going to be interesting in close across the world. And there will definitely be different types of challenges depending on the segments and the country, etc. But I think in that environment, it's dramatically in keeping with the comments we've made across the board. Our tools are very necessary for people to understand whereas in performance and what's happening in the market.\n\nSo, I think we're in a good situation, we're executing well and the only slight caution there is just the environment which could get a little bit jittery.\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nThanks again, and congrats on solid results.\n\nOperator\n\nThank you. And next question, we'll move back to Alex Kramm with UBS. Please go ahead.\n\nAlex Kramm -- UBS -- Analyst\n\nYes. Hey, guys. Thanks. Sorry, my phone turned off in the middle of the question.\n\nGreat. Anyways, sorry if this was asked already and if I was off. But on the EST and Climate sales, you obviously proactively addressed that and I understand it can be lumpy and obviously at tough comps too. But can you actually talk around about what areas maybe saw outsized weakness in particular this quarter and why.\n\nAnd I know it was a tough quarter and particularly at the end of the quarter with market selling off. So, I was just wondering if there's anything that in particular slipped that may or may pick up again in the fourth quarter. So, any color there would be helpful. Thanks.\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes, sure. Let me try to provide some perspective and I'll give a little bit of color on what we saw in the quarter. I do want to start by underscoring that we remain very bullish on the long-term potential for both climate and ESG. I think the factors that have been driving the growth will remain powerful in the years ahead.\n\nAnd if you can tell by the climate growth rates that we mentioned in the prepared remarks and I underscored to an earlier question. We continue to see very strong growth from climate and expect Climate to be a larger and larger contributor to the overall growth of the segment. Now within ESG, we did have softer sales in the quarter relative to recent quarters. Realistically, there probably is some cyclical impact from the environment in the market backdrop.\n\nWe saw some deals taking longer to close and we did see fewer large deals in the Q3 figures. We did see slightly higher declines in sales outside the U.S. in AMEA and APAC. Although the run rate growth continues to be quite high across all regions.\n\nI think as we touched down in the prepared remarks that you want to underscore that there are so many layers and dimensions to growth in the ESG and climate which I know Alex you know. But we've got a wide range of solution-serving climate objectives, ESG objectives as well as a wide range of users and use cases. And so there was relative going to be that the growth rate will fluctuate up and down based on pace of new regulations, client segment dynamics, asset class shifts, various geographic factors as well as the market and economic environment. I do want to underscore that there have not been any impacts from U.S.\n\npolitical rhetoric down that's gotten a lot of attention recently. I think generally the focus on ESG and Climate remains front in center to investors globally.\n\nAlex Kramm -- UBS -- Analyst\n\nRight. Helpful. And then, just a very quick follow-up staying actually on the ESG and climate topic. But if my math is right, since you're now providing some incremental data here, I think that the climate and ESG portion analytics is $7 million this quarter.\n\nI think very nice increase there. So, can you just remind us exactly what's getting picked up in analytics now and a new way to think about the TAM for that or how penetrated you are? Again, it's a very small number but, clearly, you've a pretty diverse Analytics customer base. So, just wondering how we should be thinking about those opportunities in particular on that segment. Thanks.\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes. And I'd say in everything we do, our capabilities across segments are symbiotic and synergistic with the other segments. And so within analytics, we not only benefit from the ESG and climate franchise that we built, we are also helping to fuel it. And so, within the segment, within climate, in particular, the main offering that we have is our Climate Lab Enterprise which we've released very recently.\n\nI believe it was late last year and that has grown that an attractive growth rate although off a very small base. But that is feeding off the broader portfolio and risk management solutions that we offer where when we have a client's portfolio we can now provide very granular climate insights to them about the portfolio, help them manage climate risk more systematically across the portfolio. We also have, within the analytics segment, a broader range of reporting solutions. So, we can help clients with things like their TCFD risk sensitivities that they will do as well as help with various other reporting requirements.\n\nAnalytics does have a very powerful reporting function and capability which we've provided the clients across broader risk insight for quite some time. We're leveraging that to generate climate risk reports as well as broader ESG risk reports and broader ESG reports. And so, those are probably the main areas I would highlight within analytics. Listen, it's still -- to your point about TAM, we're still very early in that journey.\n\nOur penetration's relatively small. It's actually extremely small but if we extrapolate across the entire analytics client base, it can be a massive opportunity. The other thing that's exciting is that really opens up some of the client segments and parts of clients that we haven't served with the existing Analytics solution. So, it's helping us with insurance companies, it's helping us with banks and bank regulation.\n\nAnd so, there's some big wallets in big markets that we're very excited about on the climate from within analytics.\n\nAlex Kramm -- UBS -- Analyst\n\nSuper helpful. Thanks, guys.\n\nOperator\n\nAnd next question will be from Toni Kaplan from Morgan Stanley. Please go ahead.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nThanks so much. As usual, you guys have done a great job on expenses. And I know you called out maybe using less professional fees or being able to flex the bonus accrual and also sort of the less time-sensitive investments. I guess I think of you guys as really efficient lean organization.\n\nI know you not going to cut back on the growth investments that are really meaningful. So, I guess how much room is there on the expense side within the downturn playbook I guess.\n\nHenry Fernandez -- Chairman and Chief Executive Officer\n\nYes. So, it's a fair question, Toni. And it's something that we are spending every day thinking about and proactively managing the business. I do want to underscore just to provide some context on the directional moves on the downturn playbook, some of the shifts that have happened since our last quarterly call.\n\nSo, I think during our Q2 earnings call, we had mentioned that the guidance expense guidance was based on the premise of flat to slightly increasing markets. During Q3, we had a downward impact from market depreciation of over $100 million on ETF AUM and so the market has come down below what we projected or at least what our guidance was based on during the Q2 call. And as a result, we've begun to take further actions in the downturn playbook. And it's really mostly in the same areas that we were focused on previously just to a larger degree.\n\nSo, we're further slowing the pace of hires in a broader set of areas, in particular, that run the business activities, areas like corporate function. We are continuing to as you mention prioritize hires in really our key growth areas and triple-crown investment areas like ESG and Index, custom Index capabilities, fixed income content and capabilities, key data, and technology enhancements, particularly in areas like ESG and in climate data as well as the broader technological infrastructure and on the cloud. And then we continue to preserve investments in key areas within our go-to markets or sales in client-service organization. But we are clamping down harder in the run the business areas and even in selected areas in the broader franchise.\n\nYou alluded to on the non-comp side, we are squeezing further on professional fees, areas like T&E and recruiting which actually comes down naturally with the pace of hiring. And our comp accrual is lower. We do have further levers to go to, hopefully, we don't have to but clearly based on the comments I just made, there are areas where we can't stop hiring more dramatically. We could cut into the investment portfolio and things like the comp accrual naturally adjust with the direction of the business.\n\nAnd so, there are additional levers out there if we need to go there but hopefully, we don't need to. Generally, we are being cautious, so our outlook is cautious, which you can tell by our comments and our guidance here.\n\nBaer Pettit -- President and Chief Operating Officer\n\nLet me add to that Toni. If you don't mind, let me add to that. The -- in addition to all the things that Andy has said, one of the things that we're obsessed with is protecting as much as we can, the new investment plan. And therefore what we're doing is squeezing and viewing time and time and again on the run the business -- the normal run-the-business activities to lower expenses and protect profitability and protect the investment plan.\n\nSo, if you look back at -- if you move to look back at our budget from the end of last year to renew investments that we were planning to make in 2022, that total investment plan is only off by a couple of million dollars which is an incredible achievement in the context of this difficult environment that we've been able to protect a vast majority of that investment plan. We surely have made some tweaks about reprioritizing that total investment plan but in general, we haven't gotten it back. And we believe strongly that in down markets that's where companies slow down their long-term growth because they caught back easily on their investment plans whether than doing the hard work of cutting back on their run -- the usual run-the-business activities.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nThat makes further sense. Wanted to ask my follow-up on pricing. How is it running this year and what are your plans for '23, are you seeing sort of clients watching spend really closely just given the environment, and imagine a lot of those conversations are sort of taking place maybe right now. So, just wanted to understand the outlook for pricing for next year.\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes. I'll talk generally, not specific to any year or point in time. But I would say in an environment like this where costs and prices are going up, we are generally increasing prices more than we have in the recent past. Given that our tools are really mission-critical to our clients, we do have some pricing power in many parts of the business.\n\nAlthough, as we've mentioned in the past we are very focused on the long-term relationships we have with our clients and recognize that most of our growth is going to come from our existing clients. So, we're heavily focused on adding value in connection with any price increases that we are rolling out. And so, our approach to price increase is more generally factoring in the value that we're adding to existing services that we're delivering the clients. It does factor in our broader cost structure, the broader cost environment, the broader pricing environment as well as client health and client usage.\n\nSo, we are being measured and being mindful of the health of our clients but I'd say generally across products, we are rolling out higher price increases than we have in recent years and as a result, you're probably seeing some impact of that in the Q3 recurring sales relative to a year ago. And we expect probably similar benefits in the next couple of quarters.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nPerfect. Thanks.\n\nOperator\n\nThe next question is from Owen Lau from Oppenheimer. Please go ahead.\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nGood morning, and thank you for taking my question. If the market recovers in the fourth quarter, how do you think about your bonus and other non-comp expense which you kind of give back some of their bonus back to employees or you would stick with the downturn playbook because you try to be more conservative? Thank you.\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes. And I don't want to be too prescriptive here because that really depends on the facts and circumstances. On the bonus point, I would underscore the large majority of the bonus accrual is formulaic. And so it depends on the performance of the business.\n\nAnd so to the extent the business performance increases, in particular, asset-based fees run up significantly, that will just trickle through how we accrue our bonus and our bonuses are paid out which is tied to the key financial metrics of the business. And so, the bonus accrue would likely go up. Across broader levers, listen it depends on the exact situation but non-comp areas in particular we can flex those pretty quickly up and down where things like professional fees and other non-comp areas can flex up a little bit in pretty short order. The comp lever does take a little bit more time to trickle through and start having an impact, that depends on pace of hiring new hires etc.\n\nBut I'd say the bonus and big portions of the non-comp levers that we have can flex in pretty short order.\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nGot it. That's helpful. So, I think you mentioned Climate was strong in this quarter and then options and future-trading volume was also strong. Could you please talk about do you see any other product that you see -- saw a pretty strong demand in the quarter? Thanks.\n\nAndy Wiechmann -- Chief Financial Officer\n\nAnd so, the other area that I would highlight and Baer mentioned is analytics. And so, I think there has been a component of the strength we saw in analytic sales that's attributable to focus on our risk models and broader risk management tools in these environments which are critical to or helping our clients navigate in market uncertainty, a lot of that asset class, geographic, sector shifts and rotations that are taking place. And so, that would be another area that I would highlight here. I would also highlight that the extreme resilience of our index subscription franchise as well and I think there is just such a plethora of use cases across many different users in client segments that continue to be strong pockets of demand and in use cases for those products, particularly in areas like over the counter derivatives that can be very useful to our clients in these types of environments.\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nNext question is from Faiza Alwy from Deutsche Bank. Please go ahead.\n\nFaiza Alwy -- Deutsche Bank -- Analyst\n\nYes. Hi. Good morning. I wanted to just drill down a little bit more on climate.\n\nAnd wanted to ask if you're envisioning from here sort of an inflection in terms of the size of the business given the broad-based focus around climate like are there -- is the regulatory environment such that again we may see that type of inflection. And maybe as you answer that, talk to us about your specific competitive advantages within climate. I recognize that you have many different areas but curious where you think you're best positioned?\n\nHenry Fernandez -- Chairman and Chief Executive Officer\n\nThanks for that question. As we have previously said, climate change is at complete existential threat to the planet. And we're witnessing a huge increase in physical risk and hid ways and floods and fires and hurricanes and all of that. And therefore, this is going to be a clear and present danger for portfolios of all types around the world because, clearly, the portfolios are made up of equity and fixed income and property and infrastructure and all of that.\n\nThat will be affected by both the physical risk and the transition risks associated with climate change. So, we're in the very, very early stages of the demand or tools for portfolio managers and portfolio allocators to decarbonize their portfolios and protect their assets from repricing of assets, higher cost of capital, and reallocation of capital. So, this -- we think that this $64 million or so across all of our areas will continue to increase pretty rapidly over the years to come. And we're positioning ourselves not only in terms of the underlying climate data, so just the carbon emission estimates for companies and bond issuers and private companies and real estate exposure and all of that, but also the models, the value-at-risk models, the implied temperature rise models to try to help people project into the future what the carbonization path of their -- of the assets and their portfolios are.\n\nWe're very bullish on this total portfolio footprinting process. Basically, what we do is we take the total portfolio of an asset manager or an asset owner and tell them what the current footprint of carbon emissions of the entire portfolio, Scope 1, Scope 2, Scope 3, and what the trajectory of that footprint will be in the next three to five years or five to 10 years. So, this is -- it's going to be in extremely high demand. I think that the Ukraine war, the -- Putin's war in the Ukraine has highlighted even more so energy security and the dependence on the energy from other sources.\n\nAnd even though in a short-term basis have had enormous increases in fossil fuel prices, every country is thinking about their energy dependence, and the easiest way to achieve energy independence is by wind and solar that is in your own land, in your own country, and the like. So, I think we're going to see tremendous -- so, yes, there is an inflection point that is happening last year with COP26; this year, with COP27 despite the -- clearly, the balancing act between fossil fuels and renewable energy.\n\nFaiza Alwy -- Deutsche Bank -- Analyst\n\nGreat. Thank you so much for that. And then just a follow-up maybe for Andy on capital allocation. So, far, it seems sort of share buybacks have been the priority.\n\nI'm curious how you think about that in a rising rate environment and how much of a focus is M&A from here?\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes. I would say, generally, no major changes to our approach. We continue to be highly focused on both repurchases and opportunistic bolt-on MP&A in key strategic growth areas for us. To your point about the change in funding markets and cost of capital, I would say that we are watching the markets closely, being very mindful of what that means for valuation, and trying to be quite opportunistic about where we take advantage on the repurchase front and acquisition front.\n\nI'd say given where our gross leverage is and where our funding costs are, we're probably not in a rush to raise additional debt. But we do think we've got a good amount of cash, and we'll continue to build cash to continue to be opportunistic here on both fronts. And we think there are opportunities to get either bolt-on MP&A or repurchases at attractive long-term values.\n\nFaiza Alwy -- Deutsche Bank -- Analyst\n\nGot it. Thank you so much.\n\nOperator\n\nThe next question will be from Craig Huber from Huber Research Partners. Please go ahead.\n\nCraig Huber -- Huber Research Partners -- Analyst\n\nYes, hi. In the past, you guys have talked about how you thought your climate run rate over time would exceed the rest of ESG run rate. I wanted to ask if you still believe that. And back to the prior question, I wanted to hear a little bit further about sort of the mission-critical tools and data you have on the climate side that make you guys stand out that your competitors do not have that will help fuel that growth in your climate area.\n\nHenry Fernandez -- Chairman and Chief Executive Officer\n\nNo, great question, Craig. The -- over a 10-year horizon or so, we believe that climate tools per se, not just climate in the context of ESG, but I'm talking about climate tools separately from what's embedded in the ESG offering, will grow at a very large clip and could potentially exceed the run rate of ESG at that time. Obviously, I'm talking about long-term projections here that can vary year-to-year, and it's hard to say where they end up. But the reason we say that is to highlight the climate tool opportunities, right, the Climate tools, so the climate solutions by MSCI that's -- because we're paring it against a fairly rapid growth rate on ESG that will continue.\n\nAnd we're saying climate per se could even exceed that incredible business that we have in ESG. The competitive advantages we have is that, remember, the mission of MSCI is to provide mission-critical tools for the investment and finance industry. So, a lot of our competitors are focused on developing climate data, for example. Some of our competitors are only focused on physical risks.\n\nSome other ones are focuses on transition risks. Some of them are only focused on the real estate industry. Some of them are focusing on corporate bonds. What you will find in MSCI is a holistic solution to your entire portfolio from one source, one source of data, one source of models, one source of the total portfolio, whether it's private equities and private credit, which we're doing an incredible amount of work on climate emissions and carbon emissions and things like that.\n\nSo, I think the benefit -- and you can have that in an index, you could have that in a model, you can have that in individual securities. You can -- and then, as I said, you have across different asset classes and the like. So, I think this is completely in keeping with the way we do on managing MSCI.\n\nCraig Huber -- Huber Research Partners -- Analyst\n\nAnd, Andy, I have a quick housekeeping question. What percent of your costs right now are outside the US? And what percent of those are billed in U.S. dollars? And a follow-up question real quick is, what is your organic ex-currency cost growth in the third quarter year-over-year, please? Thank you.\n\nAndy Wiechmann -- Chief Financial Officer\n\nSure. So, the -- yes. And it's a good point. Just taking a step back, we have this nice natural P&L hedge related to FX.\n\nSo on the revenue side, I believe it's around 11% or 12% of the revenue base is in non-USD currencies. It's about 45% of the cost base is in non-USD currencies. And just given the relative sizes of those bases, the revenue base and cost base as well as the mix of currencies within them, they tend to move in parallel. And so we saw in the current quarter, on the expense side, we had a $13 million -- close to a $13 million benefit from the appreciating U.S.\n\ndollar relative to a year ago that more than offset the $12 million headwind we had on the revenue side. And so it's a good example, and you've seen that in recent quarters where we do have this natural P&L hedge where any impact from currency fluctuations on the topline tends to be dampened or offset almost completely by movement on the expense line.\n\nCraig Huber -- Huber Research Partners -- Analyst\n\nGreat. Thanks, guys.\n\nOperator\n\nThank you. The next question is from George Tong with Goldman Sachs. Please go ahead.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nHi. Thanks. Good morning. The analytics business posted a new high in retention rates.\n\nCan you unpack the drivers behind the improvement and discuss how high retention rates can go?\n\nAndy Wiechmann -- Chief Financial Officer\n\nSo, yes, I'd say we are encouraged -- really encouraged by the performance in our retention rate in analytics. I think as I alluded to earlier, there's probably been some benefit from a heightened focus on risk and risk tools in this environment, but we're also seeing success in many of the areas where we've had the strategic focus. And so we've strength in front-office equity and fixed income risk models and broader portfolio management tools. We've been benefiting from our strong models, really best-in-class models and content enhancements that we've been making as well as the broader improved functionality and tech-enabled access that we've been investing in.\n\nAnd then we've had success on the enterprise risk side through the partnerships that we've developed just to deliver a broader value proposition to our clients. And as we talked about earlier, while it's still early days, we're seeing some real momentum in the Climate Lab Enterprise offering. And so we're encouraged, although I would say we are cautious, and we're definitely not ready to declare victory. Analytics will likely continue to experience some lumpiness in not only its growth, but I'd say cancellations within analytics.\n\nSo, we're cautious but very much encouraged. Analytics is not only a key strategic capability for us as a firm, but it's also a critical financial area for us. And this performance is encouraging. But also you can see in the margin on the profitability growth, it's been a great source of operating leverage that can help fuel investments in other parts of the company as well.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nGot it, that's helpful. And then you raised your free cash flow guidance for 2022. Can you walk through the moving pieces there, if that's being driven primarily by lower expenses? Or if there are also working capital and capex benefits?\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes, I mentioned this in the prepared remarks, but it's mainly driven by a few factors. We had a larger-than-projected benefit from lower tax payments in the second half of the year. We've also seen, as you know, a decrease in cash expenses. And then we've had some higher yields on cash, and we've also seen some resiliency in collections.\n\nAll those factors have helped to offset some of the revenue headwinds that have pressured a bit on the collection side. And so that was the real essence behind the increase in the free cash flow guidance. I would say, like our profitability more generally, our downturn actions also help support our free cash flows and free cash flow growth, and free cash flow is a very important metric that we're very focused intensely on.\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nGreat. Thanks for confirming.\n\nOperator\n\nThe next question is from Gregory Simpson with BNP Paribas. Please go ahead.\n\nGregory Simpson -- Exane BNP Paribas -- Analyst\n\nHi, good morning. Thank you for taking my questions. The first one is in analytics, the EBITDA margin was 47% this quarter and 44% last quarter. It was more in the 30s historically.\n\nSo, could you share any colors on the drivers of margin expansion and whether this level of profitability is sustainable in the segment?\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes, there are several factors that have been driving the margin expansion in Analytics. And I think we've seen similar dynamics in particularly the last quarter. I would note that we have been capitalizing a higher level of expenses related to the development work that we've been doing around things like our risk insights and Climate Lab Enterprise and broader enhancements to our analytic capabilities. I would say that FX has a big impact just given the size of the analytics cost base.\n\nThe non-USD expense base that I alluded to in a prior question impacts analytics heavily. So, the appreciating U.S. dollar has helped drive the analytics expenses down. And then also our downturn actions have impacted the analytics expense base.\n\nAnd so the confluence of all those factors has driven this really very modest expense growth in Analytics and a higher margin within the segment.\n\nGregory Simpson -- Exane BNP Paribas -- Analyst\n\nThank you. And just a follow-up, can you share some thoughts on the potential impacts on MSCI. If we started to see signs of headcount reductions across the asset management industry, how much of the subscriptions are tied to user numbers relative to more enterprise deals with the entire firm? Thank you.\n\nAndy Wiechmann -- Chief Financial Officer\n\nMost of our -- I'd say most of our agreements are not tied to users per se. They tend to be modules that are licensed. And it varies very much on product. They tend to be their modules licensed to office locations for use of specific products.\n\nThere can be max users that are allowed to use that license, but they're not tied to seats per se. We also do have some, as you're alluding to, more enterprise-type licensing arrangements. And so seat count is not something that impacts us necessarily directly. Although as I alluded to in my answer to an earlier question, when you start to have more client actions, including investment firms downsizing, closing funds, closing desks, consolidating, that will generally cause an increase in cancellations and a drop in the retention rate.\n\nAnd we've seen those sorts of impacts as downturns are maintained for several quarters in the past, so we are proceeding cautiously although we haven't seen it to this point.\n\nGregory Simpson -- Exane BNP Paribas -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question is from Russell Quelch from Redburn. Please go ahead. Russell, your line is open, please proceed with your question.\n\nRussell Quelch -- Redburn -- Analyst\n\nSorry, my headsets seem to be given up, so I'll switch to the phone. Hopefully, you can hear me.\n\nOperator\n\nYes, we can. Thank you.\n\nRussell Quelch -- Redburn -- Analyst\n\nThanks very much. So, given the 10% quarter-on-quarter fall in average AUM and ETF tracking MSCI indices in the quarter, I just wondered why did the period-end basis point fee not step up in the quarter. I'm just trying to understand the mechanics there.\n\nAndy Wiechmann -- Chief Financial Officer\n\nYes. Maybe if you're asking about the run rate basis points, that were quite resilient. So, actually, the run rate basis points have remained constant at 2.52 bps. I'd say there were just very small mix impacts and fee impacts, which resulted in pretty strong resiliency in the fee, which we've seen in recent quarters.\n\nAnd so it's something that is encouraging to us, but I wouldn't flag anything too notable around it.\n\nRussell Quelch -- Redburn -- Analyst\n\nYes. Just wondering if it should step up when the AUM steps down. That was more the question.\n\nAndy Wiechmann -- Chief Financial Officer\n\nI see. Yes. Yes. Well, listen, we've got a wide range of products out there that are licensed to our indexes under a wide range of agreements with various providers.\n\nThere was -- to your point, there were some small negative mix impacts on the fee and some very small positive impacts from fee, and those fee impacts were driven by certain products dropping into lower AUM bands where we receive a higher fee. So, there was some embedded impact from that in the fee, but it wasn't significant. I wouldn't overplay that.\n\nRussell Quelch -- Redburn -- Analyst\n\nOK. OK. That makes sense. And then just as a follow-up then.\n\nAre you seeing increased competition in the custom index space? And if so, does that change your expectations for growth and investment in that business area?\n\nBaer Pettit -- President and Chief Operating Officer\n\nLook, I don't think we're seeing increased competition. I think it's been a competitive market. It's hard to judge precisely. But for sure, we feel our competitive edge is rising.\n\nWe're putting significant investments into it. And I think this is both -- it's on two levels. It's on strategic client relationships of the kind of winners, those sort of big index wins in climate that Henry alluded to in his prepared remarks. So, it's understanding the clients' investment process.\n\nAnd it's also the methodology and the skill and the investment process. And finally, it's the technology platform behind that. So, I think in all of those areas, on a relative basis, we're building competitive strength, but it's a very competitive market. So -- but I think we're really focused on it and forging ahead.\n\nRussell Quelch -- Redburn -- Analyst\n\nGreat. Good stuff. Thanks very much.\n\nOperator\n\nThank you. Ladies and gentlemen, this concludes our question-and-answer session. I would like to turn the conference back over to Henry Fernandez for any closing remarks.\n\nHenry Fernandez -- Chairman and Chief Executive Officer\n\nWell, thank you for joining us today and your continued support. As you can see from the results this quarter and our prepared remarks and the answers to your questions, our all-weather franchise continued to perform well despite a very significantly difficult operating environment. We truly remain excited about the very large opportunities in front of us and we'll continue to invest significantly in those areas of significant strategic growth. Having said that, given the environment, we do remain cautious.\n\nAnd -- but it is in times like this in which MSCI shines. We intend to continue to do so. We look forward to a lot of your questions in the coming days or weeks or months, and please don't hesitate to reach out to our team with any thoughts or questions you have. Thank you very much.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeremy Ulan -- Head of Investor Relations and Treasurer\n\nHenry Fernandez -- Chairman and Chief Executive Officer\n\nBaer Pettit -- President and Chief Operating Officer\n\nAndy Wiechmann -- Chief Financial Officer\n\nManav Patnaik -- Barclays Capital -- Analyst\n\nAshish Sabadra -- RBC Capital Markets -- Analyst\n\nAlex Kramm -- UBS -- Analyst\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nFaiza Alwy -- Deutsche Bank -- Analyst\n\nCraig Huber -- Huber Research Partners -- Analyst\n\nGeorge Tong -- Goldman Sachs -- Analyst\n\nGregory Simpson -- Exane BNP Paribas -- Analyst\n\nRussell Quelch -- Redburn -- Analyst\n\nMore MSCI analysis\n\nAll earnings call transcripts"
}