{
  "companyName": "Tritium DCFC Limited",
  "companyTicker": "DCFC",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/23/tritium-dcfc-limited-dcfc-q4-2022-earnings-call-tr/",
  "content": "Tritium DCFC Limited (DCFC -4.00%)\nQ4 2022 Earnings Call\nSep 22, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Tritium full fiscal year 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I'd now like to hand the conference over to your speaker today, Michael Collins.\n\nPlease go ahead.\n\nMichael Collins -- General Counsel and Company Secretary\n\nThank you, operator, and good afternoon to everyone. We're glad you could join us today for Tritium's full fiscal year 2022 earnings conference call. Delivering prepared remarks on today's call are chief executive officer, Jane Hunter, and chief financial officer, Michael Hipwood. Incoming CFO, Rob Topol will also be available during the Q&A session.\n\nTritium has issued its results in a press release that can be found in the Investor section of our website at tritiumcharging.com. As a reminder, this call includes forward-looking statements, which are subject to various risks and uncertainties. Statements may be based on certain assumptions and thus could cover actual results to differ materially from those predicted in the forward-looking statements. Any forward-looking statements that we make on this call are based on assumptions as of today and we undertake no obligation to update these statements as a result of new information or future events.\n\nFactors that could cause actual results to differ materially can be found in today's press release and other documents filed with the SEC by the company from time to time, including our forthcoming report on Form 20-F. A recording of this call will also be available on the Investor section of our company website. And with that, I am pleased to turn the call over to Jane Hunter, Tritium's chief executive officer.\n\nJane Hunter -- Chief Executive Officer\n\nThank you, Michael. Good afternoon, everyone and thank you for joining us for Tritium's first earnings call. I'll let Michael Hipwood run through the detailed financial results, but the headline is that today Tritium is reporting revenue results to select the best fiscal all calendar year in the company's history. For the fiscal year ended 30th June 2022, revenue was $86 million, a 53% increase over the prior fiscal year.\n\nThis result was better than we expected in an environment of supply chain constraints, cost inflation, and a tight labor market. We saw great enthusiasm for our products and a market where demand is outstripping supply for fast electric vehicle charges. This resulted in record sales of $203 million, an increase of 232% over the prior fiscal year. At 30 June, order backlog was a record $149 million.\n\nTritium reports sales orders and backlog based on executed and contracted purchase orders. So those figures don't include potential volumes from Memorandums of Understanding or customer forecasts. It would be an understatement to say it's been an exciting year for Tritium. Since listing on the NASDAQ in January, the company has improved our business in a number of key areas.\n\nWe've added several large new customers on global framework agreements. We've continued to innovate and expand our product line launching our 150-kilowatt PKM fast charger. We've added talented new executives to our team and just a few weeks ago, we officially opened our Tennessee factory, which we expect to be a game changer for the business. I'll expand on each of these topics, but suffice to say Tritium is moving at an accelerated pace as we focus on operational excellence, scale to meet demand, and position ourselves to take advantage of favorable legislation in the U.S.\n\nand globally. Recently, many analysts have made the call that the tipping point for EV uptake has been reached as more than half of global car buyers sought electric vehicles for the first time. Tritium is very well placed to take advantage of this historic disruption to transportation. We're among a handful of companies with a comprehensive fast charger product suite, a globally diversified revenue base, and factories in the Asia Pacific and the US.\n\nOur products remain technologically differentiated from our competitors and are successfully winning tenders on the strength of low total cost of ownership and high reliability. The success of our strategic positioning is evidenced by the strength of our new and existing customer base. Tritium's global framework agreements with BP, Shell, and Global Energy Utility are now a confirmation of the strength of our brand and customer trust in our products. Tritium is presently working with a number of prospective new customers across a wide range of geographies and solutions, and we expect to maintain and grow what we consider to be among the highest quality customer registry in the entire charging category.\n\nMajor global and oil gas companies are now preparing to sell driver's electricity from their fuel four courts and beyond. BP's initial order of nearly 1,000 charges for their gas stations in the U.K., Australia and New Zealand demonstrates their aggressive global rollout strategy. We continue to progress our close partnerships with BP and Shell in support of their global electrification strategies. We've entered into agreements to supply our fast charges to multiple new and existing customers in the US, Europe, the U.K., Canada, South America, Thailand, Australia, and New Zealand, with orders, which we'll see us deploy thousands of fast charges across those markets.\n\nWith secured U.S. purchase orders from Enel X, EV Charging Solutions, Nicola, Siemens, Blink, ChargeNet, Crews, and YZV among others across Europe and the U.K., we have orders from customers like BP, Motor Fuel Group, Ionity, OK. Shell, Aqua Superpower, EON Charge, Liberty Charge, Iberdrola, and Osprey. We held a grand opening for the Tennessee factory last month, and we were honored to host dignitaries from the local state and federal governments, as well as Australia's ambassador to the United States and many valued customers, suppliers, and stakeholders.\n\nThe opening of our factory in Tennessee will bring multiple business benefits to Tritium. The factory will enable the company to increase our margins by reducing freight costs. From Tennessee, we'll be able to truck our charges across North America. We also expect to reduce our use of air freight with an expectation that we'll increasingly make use of sea freight to shift products to Europe from the East Coast ports of Savannah and Charleston at materially less expense and a reduced time at sea than sea freight from Brisbane to Europe.\n\nOver the past fiscal year, air freight to Europe from Australia has been as much as 12% of the sale price of a 75-kilowatt charger and 13% of the sale price of a 350-kilowatt charger. Time at sea from Brisbane to Amsterdam rose from six weeks to seven weeks pre-COVID to eight weeks and congested ports further extended transit times. The expected time at sea from U.S. East Coast ports to the Netherlands is 10 days to 15 days.\n\nIn addition to the added time, the cost of moving goods increased substantially in the fiscal year. Inbound and outbound freight costs for Tritium to and from Brisbane increased to 30% and 21% respectively. Importantly, as Michael will detail, we see this inflation repressures easing and the new factory is in an optimal location in terms of proximity to suppliers and customers. Building products in Tennessee will reduce our lead times for charging equipment for our U.S.\n\nand European customers shortening our order-to-cash cycle and improving customer satisfaction. The Tennessee factory significantly increases our annual manufacturing capacity and associated revenue, supporting us to meet market demand and reduce backlog. We also expect to see improved margins through factory layout efficiencies, such as the co-located warehouse, a longer floor plate for more production line stages, which reduces complexity per stage and allows us to more rapidly onboard new staff, as well as separate end of line test base per production line. These Greenfield factory benefits as well as the depth of the manufacturing talent base in the local region are already paying off with record tact time hit at the facility in its third week of production.\n\nOur U.S. factory enables Tritium to take advantage of billions of dollars of U.S. federal government formula and grant funding, allocated to the rollout of public charging on American highways and alternate fuel corridors via Bipartisan Infrastructure Law. We expect U.S.\n\ndemand for charging infrastructure to be further driven by the Inflation Reduction Act, tax credits for both EVs and EV charges, and associated site installation costs. Tritium is one of a handful of manufacturers building locally who will be able to build by America-compliant charges in 2023. The factory was completed within the planned budget of $8 million. There will be additional investment as we add production lines over the coming year.\n\nWe took possession of the property on the 1st of March and we're building our first charges in July. Although this was an incredibly fast project from start to finish, we were six weeks behind our planned production ramp-up due to supply constraints and recruitment delays. Tennessee enjoys near-record low unemployment across the state. To put this in perspective, July and August recorded unemployment rates in Tennessee of just 3.3% and 3.4% respectively, just marginally higher than the all-time low of 3.2% set earlier this year.\n\nWhile over the long term, this broader employment backdrop creates precisely the type of communities in which we want our employees to work and live, it did result in the longer than expected onboarding of our workforce. We are delighted to report though that we are now enjoying our targeted staffing levels in Tennessee and the workforce is committed and talented. We're very proud of the positive impact that our new factory has had on the local community and we've certainly received a very warm welcome there. Today, we've hired over 100 workers locally and we're onboarding around 10 staff a week as our ramp-up continues.\n\nAlthough the six-week delay commensurately pushes six weeks of planned builds and the associated $45 million of revenue into the first quarter of calendar year 2023, to date, we have not lost any of those purchase orders and we expect to continue to fulfil our auto backlog as production capacity increases and order fulfilment accelerates through the rest of this calendar year. As has been the plan, production capacity at Tennessee was designed and is expected to ramp up over the next 16 months. By the end of this calendar year, our Tennessee capacity is expected to be 6,000 units per year and by the calendar end of 2023 and expected 28,000 units per year. To put this in perspective relative to Tritium's legacy footprint, our existing Brisbane factory has a capacity of up to 5,000 charging units per year.\n\nSo the scale-up is enormous. Although Europe remained our largest region for revenue in the fiscal year, our investment in Tennessee is in anticipation of substantial increases in market demand for North America. It will also better position Tritium for the freight of products to Europe in terms of price, time on the ocean, and availability. The new factory will only build Tritium's latest generation charges.\n\nFor this year and next, that will be our modular, scalable RTM 50 kilowatt and 75-kilowatt charges and our PKM100 and PKM150 kilowatt charges. These modular products are faster to build being designed for manufacturer and service with 80% parts commonality across product lines. The modular design includes sale over modes and easy field serviceability designed to provide world-class reliability and uptime. We're now manufacturing and shipping our modular 150-kilowatt charger, which uses our innovative DC microgrid architecture and which is planned to be NEVI and by America compliant in 2023.\n\nThis architecture provides the flexibility for the charging site and the charges to have power levels increased at a later date at site utilization and increase in car battery capacity, drive up power demand, or as the site operator works with the local utility to increase their grid feed. Through this architecture, customers can lower their upfront capital investment and design their charging sites to be capable of scaling with their businesses. Our customers have embraced this architecture and model, and we have a significant backlog of orders for this new product. Our next-generation technology retains the best of Tritium's differentiated and pattern to designs remaining the world's only fully liquid called Ingres Protection 65 rated fast charging technology.\n\nOur technology roadmap sees us launching another bi-American and NEVI-compliant fast charger in late 2023, our modular and scalable charger, which is expected to be produced in large quantities in 2024. This model will allow customers to add 250 miles of range to their EV in about 10 minutes, which we expect to appeal not only to public charging network operators but also to fleet and commercial customers. We're also pleased to report that we continue to progress our technology roadmap toward release of a 32 kilowatt DC wall unit that we expect to be particularly suitable for fleets and car park applications, as well as our one-megawatt charger for trucks, fairies, and buses. We anticipate sharing more news on this effort in 2023.\n\nThis fiscal year has been momentous for Tritium, as well as achieving record revenue, sales orders, and backlog, we secured Shell as a customer in August, listed the company on the NASDAQ in January, joined President Biden at the White House in February, onboarded our new U.S. general council, Michael Collins from ON Semi in March, secured BP as a customer in April. The same month, we welcomed our new chief people officer, Keith Hutchison from the National Grid, we started building and shipping our new PKM 150 kilowatt charges and we executed a lease and built a factory in Tennessee, which started assembling charges in July. Throughout those milestones, we've remained 100% focused on operational execution, making incremental and sustainable changes to the business, which are planned to further improve our margins and increase our revenue in the coming fiscal year.\n\nAnd we've remained focused on the prize of electrifying transportation, which remains our mission as it has been for Tritium throughout its 21-year history from its roots in solar racing. And with that, I'll turn the call over to Michael Hipwood.\n\nMichael Hipwood -- Chief Financial Officer\n\nThank you, Jane, and thanks to everyone for joining us. As Jane mentioned, Tritium's fiscal year ended 30th June 2022 results were the strongest in the company's history. The company achieved record results in sales orders, backlog, and revenue with a significant increase to year-over-year margin. For the fiscal year 2022, the company recorded sales orders of $203 million, an increase of 232% over fiscal year 2021.\n\nOrder backlog as previously mentioned, was a record of $149 million and revenue came in at $86 million, a 53% increase over the period ending 30th June 2021. This revenue is the highest in the company's history for both a fiscal and calendar year, driven by strong sales growth and improved operations in charge of building times. Gross margin for fiscal year 2022 was negative 0.4%, which was a 300 basis point improvement year on year. We were able to improve our margins despite the world documented global supply chain issues and worldwide increases in inflation affecting companies across the manufacturing and electronics industries.\n\nWe began to see improvements in our margins as we progressed our plan path to profitability. This path to profitability is based on two pillars. First, scaling our production capacity and second, design improvements to our product lineup, the feature greatest standardization of components and design for manufacture. Of course, a discussion on profitability cannot be had by any manufacturer today without an acknowledgment of the incredible dual headwinds from inflation and incremental costs from supply chain disruptions.\n\nInflation affected many components in a Tritium charger in the last fiscal year. In particular, the global chip shortage has driven printed circuit board assembly prices up significantly as well as materials for power conversion models. As an illustration, for our 75-kilowatt charger, semiconductor parts increased in price by 27% year over year, while modular parts prices increased by 24%. These parts alone make up 30% to 40% of components in a finished charger.\n\nThese factors impact DC charges more meaningfully than AC charges due to the technological complexity of a DC fast charger. Outbound freight costs from Brisbane also increased by 27% over the same period, further compressing margins. Nonetheless, we are already seeing the green shoots of relief in some of these pressures. We expect a combination of factors to result in a continued upward trajectory for our gross margin, particularly in 2023 and 2024.\n\nThese are firstly, reduced input price pressures and improved component availability. Second, price increases that we've either implemented or are currently negotiating with our customers. Third, a material reduction in our freight costs as the bulk of our production shifts to Tennessee, and finally, a continued expansion in sales, production, and revenue that will allow a high percentage of production overheads to be absorbed on a per charger basis. SG&A expenses were $74.3 million over the fiscal year.\n\n$28 million of those costs were related to stock-based compensation to staff on the accomplishment of the listing of the company on the NASDAQ. Going forward, we should see the SG&A base of $46 million increasing in line with inflation and wage growth, now that the company is nearing the full complement of corporate staff, IT systems, professional advisors, and the necessary insurances for a global manufacturing business. We have previously discussed our capex light business model as a contributor to our long-term plan toward positive cash flow generation. Unlike other manufacturers, the cost to expand our production footprints and capacity is relatively modest and our capex in 2022 was only $7 million.\n\nGoing forward, we expect similar levels of capex, the majority of which would be committed to higher production capacity. Comprehensive loss for fiscal year 2022 was $120 million, which included $35 million in one-time stock-based compensation, fringe benefit tax, and listing costs, as well as investments in manufacturing capacity, sales, and in field services. On September 06, 2022, Tritium announced that we had closed the refinancing of our existing $90 million credit facility held by our long-term financing partners, Cigna and Barings, entering into a new $150 million facility. In addition, we announced the closing of the $75 million committed equity facility with B.\n\nRiley. Capital available to the company from these financings will be primarily used for working capital investments, particularly the purchase of long lead time components for our charges and the material inventory ramp-up required to meet increased orders. Our overall outlook remains positive for the remainder of calendar year 2022. With our Tennessee facility now online and ramping to capacity, a large and growing backlog, and measures we are taking to overcome various supply challenges in the global economy, we are confident in the strong drivers supporting our revenue and gross margin in progress as we look toward 2023.\n\nIn the near term, as a result of the six-week delay in production in Tennessee, we now expect revenue for calendar year 2022 to be approximately $125 million, with the six weeks of delayed revenue of approximately $45 million moving to the first quarter of calendar year 2023. This adjustment reflects a change in timing rather than a change in expectations of business performance. With that, I thank you all again for joining Tritium's first earning call. I'll now turn the call back to Jane for closing remarks.\n\nJane Hunter -- Chief Executive Officer\n\nThank you, Michael. Before we open up the call for Q&A, I want to take a moment to thank the entire global Tritium team. Whether you've been working with us for years in Brisbane, Amsterdam, Los Angeles, the U.K., Singapore, Denmark, or anywhere in the world, or you've only just joined the team in Tennessee, we appreciate all that you do every day to drive our company forward in our mission to electrify transportation. It was an incredible experience opening the Tennessee factory and meeting our wonderful new team there that just keeps growing every week.\n\nThe skills and talent of that team will drive cross-jurisdictional knowledge share, and we expect our Brisbane team to be learning from the folk in Tennessee as much as our team at the new factory is learning from the old hands. This fiscal year has been a validation of Tritium's tenacity and vision for fast charging everywhere. For Tritium has held an unwavering belief that the world's transport fleet will electrify enabled by public fast charging everywhere. It's only in the last two years that that vision has become our shared future and Tritium is in the driver's seat to deliver it.\n\nI'd like to conclude today's call by emphasizing how honored I am to lead Tritium during such a pivotal time in the company's history and at this historic moment for the electrification of global transport. Tritium's technology will help enable the rapid conversion of vehicles from combustion engines to electric motors, removing impediments concerning range, charge time, and the reliability of infrastructure. The rollout of fast charging is a vital part of the EV transition now underway, which will reduce global emissions and hasten the renewable energy transition and Tritium is at the forefront of making that happen. With that, we'll open the call to questions.\n\nOperator\n\n[Operator instructions] Our first question will come from the line of Steven Fox from Fox Advisors. Your line is open.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nHi. Good afternoon. Thanks for taking my question and congrats on your first earnings release.\n\nMichael Hipwood -- Chief Financial Officer\n\nThanks, Steve.\n\nJane Hunter -- Chief Executive Officer\n\nHey, Steven.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nSo for first question, I was just curious, so based on the push out of revenues, because of the timing with ramping, the Tennessee plant, how do we start thinking about 2023 on top of this $45 million in revenues, because you also have substantial orders on your books already, and then you also have a lot of customer announcements that I don't think are in the orders yet. So any range you could put on what kind of growth you think is reasonable to achieve in the -- for an environment as we look after next year, and then I had a follow-up.\n\nJane Hunter -- Chief Executive Officer\n\nYeah. So we're very optimistic about the near and immediate term prospects for Tritium in 2023, given that we're recording fiscal years. I think importantly for today's release, we came in within 1% of planned revenue in the second half of FY '22 and within 3% of plan for the full fiscal year '22. So it's very good, very close to plan for the fiscal year.\n\nAbsolutely, we've talked about this six week delay in the factory at Tennessee in terms of what we had planned to build there. Talking about that delay, again it's worth reiterating that that's a calendar year measure and we're reporting in fiscal years. So we are forecasting that six weeks of revenue plan for the first two quarters of fiscal year '23. That's the $45 million we'll push into the third quarter of fiscal year '23.\n\nOur COO though is operating on a plan to try and catch those six weeks up within the fiscal year '23, Steve. So there may be no impact on an annualized basis, but we'll be able to provide an update on that at our next half-year release. I think though, in terms of the delay, there was, as we mentioned the component shortages, which had an impact on the end-of-line test equipment and the staff onboarding that didn't meet schedule, but we don't believe the $45 million of revenue that's going to shift to quarter three of financial year '23 means that any of that revenue's lost because we don't need to make room for the shifted revenue. We expect to grow production capacity throughout '23 and our objective and plan is not to be building at production capacity.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nThat's helpful. And then as a follow-up, I was just curious if you can provide a little bit more insight into sort of the planning that goes on from here in Tennessee? It's still a substantial ramp in terms of your targets going toward 28,000 or 30,000 units over the next 18 months or so. How, do you sort of manage that dance between because there's been issues already between labor components, shipments? Like what do you have to do to sort of make sure that that's sort of a smooth and orderly ramp over the course of that time period? Thanks.\n\nJane Hunter -- Chief Executive Officer\n\nYeah. The ramp, as you said, is still quite steep. So 6,000 unit capacity at Tennessee plus the 5,000 in Brisbane by the end of this calendar year, then we have to get to 28,000 by the end of calendar year 2023, that involves additional spend in the vicinity of around $6 million over the course of the year, the most difficult and significant aspect of that is simply the end of line test units, which are the only area where we usually experience shortages because they do have semiconductors in them. Now for that, Steve, we've got a couple of mitigations in place in that we do have some end-of-line test bays in Brisbane that could be shipped over and repurposed the same in Tennessee.\n\nSo we have some fallbacks in case we have ongoing issues getting the end-of-line test equipment there, but otherwise, it's a relatively staggered ramp with an additional, I think eight bays of end-of-line test equipment to go in and then the rest of the tooling being very standard cots, tooling, and equipment that comes in quite rapidly. So we don't particularly expect that ramp to be an issue. The labor obviously is an ongoing issue. We just saw the numbers this morning in, from Wilson County and I believe they were as low as two point something percent in that particular county where we're operating as opposed to across the State of Tennessee where they're 3.4% still very low unemployment rates.\n\nWe do seem though now to have a great word of mouth happening, a lot of our staff know each other and are bringing each other into the business from automotive and other local electronics industries that we're formally operating there. We're operating out of a former Toshiba TV factory and that seems to have really given us a great head of steam in terms of onboarding staff. And we are now onboarding them at the rates that we'd hoped. So it's slow to start, but it seems to have gathered ahead of steam.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from the line of Matt Summerville from D.A. Davidson.\n\nYour line is open.\n\nWill Jellison -- D.A. Davidson -- Analyst\n\nHi. This is Will Jellison on for Matt Summerville today. I wanted to ask the first question about demand. You described pretty broad-based demand across a number of end-use cases, by the end of the fiscal year in June.\n\nAs we sit here in September, where are you seeing some of the most compelling inbound interests? And how has that inbound interest evolved at all in response to some of the recent legislative moves made in the United States in particular?\n\nJane Hunter -- Chief Executive Officer\n\nHi, Will. Yeah. Thanks for the question. You're absolutely right.\n\nWe are still seeing that demand is outstripping supply in this industry, and that has led to some reduction in pressures on price. So that customers have been relatively open to increases in pricing. In terms of where we are seeing the demand and what we might be seeing from NEVI and the Inflation Reduction Act changes is that interestingly, we had a look at our top five customers buy revenue for fiscal year '22, and there's a really good mix of segments. We've always been segment agnostic.\n\nWe sell into all of the various market segments that are buying, but in our top five customers, we've got two fuel companies. So two global fuel companies, an energy company, a large American charge point operator and Ionity, the largest public network operator in Europe, who spans both the CPO segment as well as the car manufacturer of the EV car manufacturer segment. So I think if we look then across those a little more deeply in terms of CPOs, we're seeing those large established charging networks, like Ionity, EV charging solutions, Loop, Blink, in fuel, BP, Shell, Apple Green, Motor Fuels Group, Liberty Charge, Circle K. Then we've got a number of utilities, vehicle OEMs, and then the start of fleet operators like Nicola, Revel, Port of Oakland, Port of Long Beach.\n\nSo there's a lot of demand coming from across different segments. I do think at the moment, we would probably say that fuel and utilities are the upcoming segments with fleet, not too far behind it and then the very large established charge point operators and demand really is outstripping supply. And you can see that from the amount of sales that we've got and the significant backlog that we are building. We'd love to get that backlog down to three to four months, which would be more normal.\n\nAnd the only issue that there has been in reducing that backlog and just converting it straight away into revenue is simply the long lead time for parts, because you need to be planning your builds about 12 months out now. So some parts, some of the semiconductors have had six, 60-week lead times. So those have had to be secured on the secondary market, or you've had to find alternates or redesigns or even do away with part entirely so that you can continue your builds. So that's why there's a lag of some type between the large amount of sales at $203 million of sales versus revenue at $86 million.\n\nWill Jellison -- D.A. Davidson -- Analyst\n\nGreat. Thank you for that. And as a follow-up to that, Jane, how do you think about prioritizing the investment that you make specific to the charges themselves in terms of which charges do you decide are most important to make and ship amid the situation?\n\nJane Hunter -- Chief Executive Officer\n\nThat's a question that we actually deal with on almost a day-to-day basis. Will, so we -- our new chief sales officer, David Nickel has established a series of principles and we try to stick to those principles because otherwise, you'll have whichever customer screens the loudest and the overarching principle of course is always first order in, first order out. But then around that, when we are doing our longer-term planning, we are planning for high-margin builds to be prioritized because they obviously are very supportive for us. And of course, you're strategic customers, but the overarching principle is very much first order in, first order out, because that does allow all of the customers to be treated fairly and they're very accepting of that as opposed to one customer being prioritized over another customer who perhaps came in later.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from the line of Rob Wertheimer from Melius Research. Your line is open.\n\nRob Wertheimer -- Melius Research -- Analyst\n\nHi, everybody. Congratulations on the report and it's good to be able to catch up.\n\nJane Hunter -- Chief Executive Officer\n\nThanks, Rob.\n\nMichael Hipwood -- Chief Financial Officer\n\nThanks, Rob.\n\nRob Wertheimer -- Melius Research -- Analyst\n\nMy questions on gross margin and you gave some commentary on some of the obvious pressures that we see in supply chain and with your, I guess longer positions, but are you able to give any more clarity on what gross margin you might have been targeting and whether there's pricing power at air to achieve, whatever margin you choose to specify if the cost over just hadn't been there? And I guess I'll just ask them all in one, it's just sort of the same theme, your pricing strategy, does that assume that costs fall again, or your pricing for current costs and reaping the benefits, if prices fall just balance of pricing power targeted gross margin, what gross margin would've been without the overruns? Thank you.\n\nJane Hunter -- Chief Executive Officer\n\nYeah. Thanks, Rob. So I think in terms of what we were targeting for gross margin, it's very product line and customer dependent. So usually lower gross margins targeted with large global customers that are buying orders of the vicinity of a thousand then those that might be mid-tier with slightly smaller orders where we'll be targeting higher margins.\n\nThe margins vary depending on whether it's a fast or an ultra-fast. So the 50 kilowatts to 75 kilowatts, will target quite different margins and what we might target for the ultra-fast, where we often target a higher margin. Overall, I would say that in any event we're always targeting a minimum of a 20% margin and that's our sort of baseline that we like to move from and, from there, they can go up as high as sort of 35%, depending on the product that we're selling. Now I do think your question is worthy of something of a slightly more detailed response though, because margins are very, very important and having achieved a margin that was just sub-zero.\n\nI did want to touch on the fact that in the first quarter of 2021, immediately prior to our merger announcement, obviously, the PPI topped out at 4.1%, which was a good indicator of trend, but then we saw it move higher to 11.7% annualized inflation within a year. Now its supply chain challenges for us had three key impacts, which are fixable. Firstly was the high freight prices, which we talked about in our pre-prepared remarks, and the need that we had to use air freight to counter those very long lead times for customers who might have, waited as long as a year for a product at the end of that, we had to air freight the product. Secondly, there was that disruption of the free flow parts to the production lines causing the stop-start builds and labor variances and then of course the need to source higher cost components on the secondary markets, particularly semiconductors.\n\nAnd then lastly, those delays in builds, which significantly separated the delivery date from the order date, causing a lag in the price increases that we had put into place becoming effective. Those long lead time components, especially electronics and specifically semiconductors delayed final builds. When you couple out with the frightened port delays, we were often fulfilling orders with product sale pricing that was negotiated 12 months before the input prices in certain cases have gone up by a 1,000 basis points or more. So simplistically, that lag between securing an order and fulfilling it when input prices climb dramatically does challenge near-term margins as does any day where production's disrupted by parts shortages, but I think to emphasize in the face of that, we improved our gross margins year over year and I think it is easy to imagine the kind of gross margin expansion we could have enjoyed if those challenges hadn't existed.\n\n[Audio gap] We've obviously detailed some of those increases that we experienced in categories like shipping and electronic componentry. And we don't expect to see the same level of inflation next year that we experienced in fiscal year '22 and we're expecting to see shortages ease over the course of calendar year '23. Then we do have the margin benefits of the capacity increase that's enabled by the Tennessee factory as the volumes increase, and we produce and sell more, that has this significant benefit to the bottom line and improves gross margins and what we do find particularly promising is we just don't think we're going to have the same kind of input price pressure escalation in 2023. And we expect those shortages to ease, but demand for our products is going to grow and average selling prices are not experiencing downward pressure.\n\nSo we definitely see the path to expanding profit margins and, I think there's some quite easy wins for us on aspects like freight and the scale that comes from Tennessee. And I think there was another aspect to your question Rob around pricing,\n\nRob Wertheimer -- Melius Research -- Analyst\n\nActually, I think that was really comprehensive, but yeah are you able to, like if costs do not sharply increase from here, is the market price, are you able to price to a level that will get to you that kind of gross margins that you desire? If you see what --\n\nJane Hunter -- Chief Executive Officer\n\nYeah. Absolutely and we've already started to see some of those kick in, in that we've introduced new pricing, particularly where we've negotiated new agreements, but also where we're amending pricing, which has come to an end of being pricing. And already, we're starting to see the flow through of some of those nice margins. We recently saw one as high as 40%, which we were all celebrating.\n\nSo I think we're starting to see the green shoots of those improved margins with the increased pricing for sure.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from the line of Tom Curran from Seaport Research. Your line is open.\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nGood morning.\n\nJane Hunter -- Chief Executive Officer\n\nGood morning, Tom.\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nJane or Michael, if we were to return to Tritium's Analyst Day a year ago, you shared a revenue trajectory showing projections for calendar 2022 of $170 million, which you've addressed. And then for 2023 of $359 million excluding the $45 million of orders that have slid from calendar 2022 into calendar 2023, and acknowledging all of the macro challenges that are have arisen over the past year, do you still believe that a top line around that $360 million level is achievable, especially given the much better clarity and detail you have on how Tennessee should ramp over calendar 2023?\n\nJane Hunter -- Chief Executive Officer\n\nYeah. Tom, I'll let Michael touch on some of that, but as you pointed out, those were projections done back in 2021. So before we had listed and at this stage, they're not guidance or forecast. I think the capacity and you'd be able to work that out at 28,000 units times the average selling price could absolutely achieve that type of revenue.\n\nAs you mentioned, $359 million was what we'd showed for 2023 calendar year. The question though is the plan that we have in terms of scale, and that involves, purchasing and putting in purchase orders for parts now about a year ahead of where you want to get to. And some of those were put in last year, and we're certainly planning to shoot for something quite significant in that vicinity, but we're not putting out guidance, similar to what we've had with most of our peers, EV go-charge point or Lego with such a market with so many different inflationary and impacts that we are seeing from aspects relating to supply chain and freight, and also such a growth market. We just don't feel that we're well served by putting out guidance at this stage for next year, but Michael, do you want to expand on that?\n\nMichael Hipwood -- Chief Financial Officer\n\nYeah. Thanks once again for the question. Yeah, just going back to the previous investor presentation, if we look back to the one that was outlined in the spec, so we needed to include that just like all spec mergers. We expected to A, list a lot faster than what we did and also that redemptions would've been not as bad as they were.\n\nSo we're at peak redemptions and all that did was like Jane said, our business is on getting the parts in to meet demand and a lot of them are long lead items. So we then quickly raised some capital after that and got on with that, but it was just delays. And I think, that's the key there. We aren't giving guidance going forward, but I think, every analyst should be able to see from the amount of revenue that is from the six weeks delay that will move in.\n\nEveryone can extrapolate that math to have some idea of what we expect to be able to produce in 2023 and as revenue. So and we are doing our best to catch up in Tennessee. We just don't want to put that extra pressure on us for this year. So hopefully that's answered the question.\n\nJane Hunter -- Chief Executive Officer\n\nI think Tom too, it might be helpful in terms of the forward view, we think capacity and the average selling price figures are useful. And perhaps I'll just give a bit more detail on those because they're in the form 20-F, which we only just lodged and you wouldn't have had a chance to delve into that. We expect to finish the calendar year, as we said, with an annualized production capacity of 6,000 charges ending next calendar year with 28,000 charger annualized production capacity. In the last fiscal year, we sold 2,006 stand-alone charges at an average selling price of $25,958 and we sold 216 sites of distributed charges.\n\nThat's two charges, one power unit in a site at an average selling price of $123,162. In fiscal year '23, we do expect to sell more distributed charges than we have in fiscal year '22, but we do expect to sell those at a lower average selling price because as we phase out our current 350-kilowatt charger and sell more of our new modular 150 kilowatt chargers, they'll be available also in lower power configurations at a lower average selling price. And our new 400-kilowatt charger won't be available until late in the calendar year. So we expect that to have little to no revenue flow through until 2024.\n\nAnd our revenue's not going to be linear, which is why we focus on annual targets and nor do we expect to operate our facilities and production lines at a 100% capacity, but we're building out the capacity for expectations in future periods, not just for tomorrow. So hopefully that's useful in terms of building a sound model to develop and assess the business, letting you form your own views on the impact of the global prevailing forces like inflation, foreign exchange volatility, any potential for a recession, the timing of those easing of supply chain constraints. And then also the benefits though to EV businesses in the states that flow from the Bipartisan Infrastructure Law and the Inflation Reduction Act and some of the German Government legislation that's been introduced that favors charge manufacturers.\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nThose metrics are very helpful. Thank you, Jane. I had not had a chance to dig into this 20th and come across those yet. And then first, how should we think about how much of backlog exiting a quarter for a year should translate into realized revenue over the subsequent 12 months, and then at this point, are you expecting to reach sustained positive EBITDA, more likely before the end of fiscal 2023 or would that be fiscal 2024?\n\nJane Hunter -- Chief Executive Officer\n\nYeah. So in terms of backlog reduction where we'd like to land at the three to four months of backlog is more likely to occur toward the end of the calendar year 2023. So the first half of fiscal year '24. By the end of fiscal year '23, so 30 June of next year, I think we'll still have, a backlog which is going to be more material than three to four months.\n\nI think it'll be closer to still six to seven months at that time. So it's going to be a sort of gradual burn down over the course of the 2023 calendar year to get that backlog in order. And that's really going to be driven by securing of the semiconductor parts that we need more rapidly and we are finding a slight easing in that, but the flip side of the easing is that most of them are being secured still on the secondary market where they're needed. And so that can have an ongoing impact on your margins, but not nearly as material and impact as not being able to secure them.\n\nSo securing them has a more minor impact not being able to secure them has a significant impact. In terms of the being EBITDA positive and I think we had sort of talked previously in the past about, at the start of the year about being free cash flow positive by late '23, early 2024 calendar years and that was the types of timing that we were talking about, that will completely and utterly be influenced by scale. So there was a delay, of course, in receiving the capital that we'd expected to receive at the list in terms of the high levels of redemptions that we had, which were 85%, 86%, that reduced capital influenced our ability to secure sufficient inventory for a very large ramp up. And so what that will do is it will mean that we won't become free cash flow positive until we reach sufficient scale.\n\nAnd Michael, you might want to comment on that.\n\nMichael Hipwood -- Chief Financial Officer\n\nYeah. So obviously becoming free cash flow positive is reliant on certain volumes of revenue and certain gross margins. So I think James painted a very good picture of where -- what we expect in the coming year and two, to achieve that. And yeah, so once again, without giving guidance, I think there's sufficient strong headwinds to show that we are definitely on a path to profitability in going forward.\n\nAnd like Jane said, it will be a slow burn down of the backlog in terms of months of backlog, simply because we're seeing as you've seen the sales grow and our productivity, and it's just ramping up productivity to meet the growth in sales.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Noel Parks from Tuohy Brothers. Your line is open.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nHi. How are you?\n\nJane Hunter -- Chief Executive Officer\n\nGood. Thank you. How are you?\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nReal good, thanks. Just had a couple of questions. I was wondering if you could talk about the progress in the PKM150 sales, thinking back to the formal launch of it. I'm just interested in, how's the market reception been? What do you know, in the time took the formal launch and I just was curious maybe what, if you could characterize what may be your largest order to date has been of that product line as far as number of units?\n\nJane Hunter -- Chief Executive Officer\n\nYeah. So that's a good question, Noel. The PKM150 at a high level, I would say, has been incredibly well received by customers. It would make up a material amount of that backlog.\n\nThe customers have been very receptive particularly to the DC bus architecture that it's built on as well as to that ability to scale up. So we're already seeing some customers wanting to take the PKM150 with less modules inside it, so they can add modules later and increase their site utilization availability as they get, more drivers at the site. So definitely had a very strong reception and the ramp-up of that product for us is still on, what I'd call new product ramp. So you start with level like eight a month.\n\nIt goes up to 10, it goes up to 40, it goes up to 60. So it's been a staggered ramp and it does mean that it makes up a material amount of the backlog. Michael, I don't know if you have any of those percentage figures of how much backlog is made up of the PKM versus some of the other product lines.\n\nMichael Hipwood -- Chief Financial Officer\n\nNot at tandem. I might be able to get that during the call.\n\nJane Hunter -- Chief Executive Officer\n\nYeah. But overall, I would say Noel very strong sales it's going to be, I think, a very good product for us as part of the NEVI program. It's a product we expect to be both by America and NEVI compliant over the course of 2023. So that will be our key NEVI product until we introduce our 400 late in 2023.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nOK. Great. Sorry.\n\nJane Hunter -- Chief Executive Officer\n\nAnd, I think you mentioned also the largest sale that we had seen of the PKM150. It's a little bit of a tricky question. We have, obviously one of the biggest sales that we saw last year in the fiscal year was the 1,000 sale to BP. I believe one of the recent ones that we had was made up of around two-thirds of that being RTMs and about 200 of those being PKM150.\n\nMichael, would we do other large of the large PKM sales come to mind for you and Michael, just suggesting that PKM looks like it makes up about close coming up toward 20% of the backlog. Noel, yeah.\n\nMichael Hipwood -- Chief Financial Officer\n\nSorry. 20% of the backlog. Yeah. Sorry, what was the question? Sorry.\n\nI was looking.\n\nJane Hunter -- Chief Executive Officer\n\nAt just about any other very large sales of sort of single large sales that we've had of the PKM150, one that came to mind for me was the recent sale of 200 of them, but was there any others that you've got to hand?\n\nMichael Hipwood -- Chief Financial Officer\n\nPretty much all of the our larger customers have put in orders for the PKMs and then it's just their rollout. So some are purchasing, 20 and then seeing how they go. And some others, like Jane, said purchasing a hundred or so but to have that 20% of the backlog already is a very good indication seeing we've just started shipping them. So these are mainly putting in orders, literally side unseen.\n\nSo --\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nOK. Great. Sorry.\n\nJane Hunter -- Chief Executive Officer\n\nI think, Noel too, it's worth mentioning that the shell who have previously been rolling out are PK175, which is a 350 with half the modules in it have started to shift all of their orders across to PKM150s and Shell obviously being one of our very large fuel customers.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nGreat. And, my second one is, I just wondered if you could maybe take a step back and talk about the supply chain challenges. You talked about the four different or three or four different parts of that. Do you have a sense that the worst is over with supply chain at this point and sort of like a light at the end of the tunnel type situation? Or is it still kind of the visibility limited enough that it's really too early to say?\n\nJane Hunter -- Chief Executive Officer\n\nI think -- I don't think it's over. I think we do see the light at the end of the tunnel. So what we're seeing at the moment is that the market for semiconductors is still particularly tight, but you can get almost all of those semiconductors on the secondary market. So it's more, it's becoming more of a margin impact than it was before, where it was a line stoppage impact, which is much worse.\n\nSo the line stoppage impacts have the bigger impact for us because your labor variances become very large. And of course it just delays you builds, whereas being able to buy them on the secondary market at a higher price is less of an issue for us and actually I was just on a lengthy call with our buyers yesterday in that semiconductor category and we have line of sight on the key semiconductors that we need from now to year end so September through December with large numbers of those still coming from the secondary market. So I think what I would say I've seen change is that there were periods where you just couldn't get them. There just weren't enough in any market whereas now we do seem to be able to source them on the secondary market.\n\nI think what we saw across the industry was that a lot of those secondary buyers bought them up from the manufacturers at a price increase and are benefiting from that now.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nGot it. OK. Thanks so much.\n\nJane Hunter -- Chief Executive Officer\n\nMy pleasure. Thanks, Noel.\n\nOperator\n\nThank you. One moment for our next question. Our next question on comfort line of Christopher Souther from B. Riley.\n\nYour line is open.\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nHey. Thanks for taking my questions here. Maybe just on U.S. versus Europe, can you walk through the mix of the annual revenue versus what it looks like in the backlog? I just wanted to get a sense of the piece of the shift there.\n\nJane Hunter -- Chief Executive Officer\n\nYeah. I'm always interested in that Christopher and we follow that very, very closely. We had a slight change. So I think last time we had publicly announced to the market, we actually had totally equal revenue between Europe and North America.\n\nIt was 43%, 43% in each region. For the end of this fiscal year '22, there was a slight change. So we made 46% of our revenue from Europe and 39% from the Americas. That's mainly North America, a little bit in Canada, a little bit in South America, but the bulk of it in the United States.\n\nAnd then we made 15% from the Asia Pacific, mainly Australian New Zealand. So slight change in that we see a 7% pull ahead for us in Europe versus North America, which I think surprised all of us. And one of the ways we've been interpreting that is that we believe some of the U.S.-based demand is awaiting the NEVI and Inflation Reduction Act funding to start to flow and that we should see a significant pick up as those funding sources begin to flow because there's so material, whether that's a tax credit that you can get under the Inflation Reduction Act for the rollout and for the site installation. And in fact for maintenance or whether it's grant funding that you're seeking under the $5 billion worth of formula funding or the $2.5 billion of grants, I believe that it makes so much business sense for charge point operators and businesses operating charges to wait for that funding.\n\nSo what we're expecting is we've seen perhaps a slight suppression and then we'll see a really huge uptick in demand. The other missing piece in that too Christopher is we haven't seen fuel take off yet at all, to the extent that we've seen it take off in Europe. So I expect to see Shell and BP start their rollout plans in North America, which very much started in Europe. They've now started in Australia, New Zealand, and will expect fuel to start to open up in North America where it's been a minor channel.\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nGot it. So the order book from some of those key fuels really just mostly ex-U.S. at this point, is that a good way to think about?\n\nJane Hunter -- Chief Executive Officer\n\nYeah. The order, the back orders are almost all Australian, New Zealand, U.K., and Mainland Europe with a lot in the U.K. and a fairly large amount in Mainland Europe. Interestingly, some quite large plans for both of the backlog are in Australia, New Zealand in the latest orders that we've received.\n\nSo it seems to be moving across the globe. But we are now seeing some activity from Shell recharge in North America. And I think we'll start to see fuel rollout occur in North America that we haven't seen in the past.\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nGot it. No. That's really helpful. And then maybe just to kind of put a bow on the gross margin trajectory appreciate all the color there.\n\nI just wanted to get a sense, you called out a couple specific areas, quite a few where there's room for improvements here. Maybe just on the shipping where you did quantify it, can you kind of walk through, what percent of the costs you think you can get that down to out of Tennessee, be it increased U.S. mix plus, improved economics to Europe, like what would be kind of a steady state, expectation for how much that should cost versus, the numbers you quoted.\n\nJane Hunter -- Chief Executive Officer\n\nYeah. I think --\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nAnd then the other ones you wanted to kind of quantify, I think would certainly be helpful people with some of the walks there toward the next year or so.\n\nJane Hunter -- Chief Executive Officer\n\nYeah. Absolutely and over the past fiscal year air freight to Europe from Australia, as I mentioned in the prepared remarks has been as much as 12% of the sale price and 13% of the sale price of a 350. Those figures when you translate them to gross margin and have still on particular charges, been as much as 9% to 10% impact on margin sometimes lower than that, but as high as that, for those particularly heavy high volume charges. So it could have an immediate impact of that significance where Michael remind me of our preferred, where we like to see freight as an overall percentage in gross margin.\n\nMichael Hipwood -- Chief Financial Officer\n\nIt would be relatively small. So when we are talking about from Tennessee and trucking in the US, across North America, it's under a $1,000 a charger, so and well, under a $1,000 a charger.\n\nJane Hunter -- Chief Executive Officer\n\nSo 2% or 3% is that.\n\nMichael Hipwood -- Chief Financial Officer\n\nYes. That's about the range because we would still see freight to Europe from Tennessee, but no more than 2% or 3% of margin where --\n\nJane Hunter -- Chief Executive Officer\n\nAnd lower than that for trucking, Michael.\n\nMichael Hipwood -- Chief Financial Officer\n\nAbsolutely. Yeah. So it's as Jane said, it's a lot higher currently and from Brisbane, but as we ship the center of gravity to Tennessee and as more and more U.S. customers come online, the gross margin will improve significantly due to freight alone.\n\nJane Hunter -- Chief Executive Officer\n\nAnd it wouldn't be as high as that for sea freight from Australia across to Europe. Christopher, it would've been more like say 6% to 7%, but still a material impact, which is a really easy win that's one of the easiest wins. So I think the two easy wins are price increases, which is probably the easiest way to improve your gross margin followed by these very simple fixes to freight both of which have a really material impact.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Pavel Molchanov from Raymond James. Your line is open.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nThanks for taking the question. Let me zoom in on your home market. What's the latest on the electric car discount, the federal EV charging program, and anything else that the new labor government has decided to provide for the EV market?\n\nJane Hunter -- Chief Executive Officer\n\nHi, Pavel. Yeah. In terms of Australia, we haven't seen, well, we've seen in the rest of the world in Europe and North America, we have seen some improvements as you've touched on under the labor government and we recently attended the first inaugural National Electric Vehicle Forum, which had labor government, senior officials present there. One of the issues we do see with the program at the moment in terms of the ability to get a discount on an electric vehicle or a tax credit is that it's still in the vicinity of around the $3,500 mark, whether that's at the state or the federal level, and they can't be combined.\n\nAnd so that we see as quite low and not really enough in a market, which actually has very high pricing for vehicles. So because almost well, in fact, all Australian vehicles are imported they're expensive. So you add a luxury vehicle tax to that, which occurs at, I believe around the 70,000, AUD mark. Cars are really expensive in Australia.\n\nAnd AUD3,500 is not much of a defrail on a car that actually starts at the cheapest EV being there formally was the MG at AUD40,000. There's a couple of cheaper Chinese cars being imported now from by BYD, which I think sit just slightly below that, but electric vehicles are incredibly expensive in Australia and AUD3,500 is not nearly enough to make a difference and bring them down toward price parity that you would see with some of the subsidies that you see in the United States. And in fact, I mentioned this publicly at the panel that I sat on at that inaugural forum, which was to say that in the States under the Inflation Reduction Act, you get $3,500 and then another $3,500 if the components are mined in the United States and $3,500 if the battery's built in the United States, which is a $7,000 total. And I think in a country where cars are already cheaper than they are in Australia, that's the type of commensurate reduction in the purchase price that you want to see to make a difference because they sit completely and utterly outside the ability of an ordinary family to buy one of these cars.\n\nSo a typical Australian family often buying a Japanese car or Toyota or a Subaru for in the vicinity of say $28,000 to $32,000, these are, $10,000 more. So we are not seeing all that we need to see yet in Australia. We don't yet have a levy on dirty fuel. And so we are still seeing a lot of imports into Australia of cars, which still have effectively no restrictions on the types of fuel that they and emissions that they can bring.\n\nAnd that means we're becoming something of a dumping ground for dirty vehicles, which is something that I do believe to have a government will start to look at. They've decided to have a discussion paper on it and that's the first time we've seen that open up, but Australia's still a long way behind North America and Europe. And I think the increase that we're starting to see in uptake in Australia is largely driven at the high end of the market. So Tesla model three drivers are the most common car.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nOK. That it's -- it's very interesting. A question about the competitive landscape and be because you sell geographically widely, you're in a great position to comment on this. There are plenty of Chinese manufacturers of charging equipment.\n\nTo what extent are they trying to establish or succeeding in establishing a foothold outside of the domestic market in China itself?\n\nJane Hunter -- Chief Executive Officer\n\nYeah, Pavel. We're starting to see Chinese manufacturers becoming competitors. So we have seen a handful in the U.K. of where we've seen CPOs purchase one European or even Tritium-built charger and one from China and comparing the two.\n\nInterestingly, without naming names, that particular customer, last time I was over there speaking to them, they had not been happy with the performance of their Chinese charges, and I'm not sure that they'll continue with them. So where they're competing for drivers to come to their sites and a driver may not come back to your site and then gives a whole lot of negative blogs about your site if the charger didn't work or was unreliable, or was out of order, that I don't believe that that's currently worthwhile for our customers. So I think what we're going to need to see from the Chinese manufacturers for them to become truly competitive is higher uptime and reliability and better servicing. Because one of the things you are going to see with these DC fast charges, because they're high-end power electronics, and they break if you use them a lot.\n\nSo there's just like a car. The longer you drive it, the more likely you are to have an outage. So high utilization will lead to more outages is services are going to start to become the differentiator, not just meantime between failure. So it's no good to have a very reliable charger with, good MTBF if you can't resolve the problem very rapidly.\n\nSo that's going to be the next area of maturation that we'll see in the industry is the need, not just for free warranty, with a reasonable amount of fixed time, but also a service agreement with fixed response and resolution times much like you see in data centers and medical imaging. And that just hasn't really occurred yet across the industry, but we will see it occur because fuel is used to it. And that's how fuel's always operated. They have SLAs on the full court, they have four-hour turnaround times for fixers, and we're going to see them pull the socks up at the industry I think.\n\nOperator\n\nThank you. We're not showing any further questions in the queue. I would turn the call back over to our speakers for any closing remarks.\n\nJane Hunter -- Chief Executive Officer\n\nOK. In terms of wrapping up, I think what I would like to say is for the company overall, we're very, we think it's very important to say that today's release, we're very pleased to have come in within 1% of planned revenue for the half that we've just reported and 3% for the full fiscal year. We are, we do suffer some challenges over the next half, but we are very buoyant about fixing that particular six-week delay over the subsequent half of fiscal year '23 before the 30th of June in 2023. And that's what both myself and our CEO -- COO will be very focused on over the next half is getting that fixed.\n\nI think one topic that we didn't touch on was services and software. We should also note that although service and maintenance revenue does continue to be modest for Tritium, it improved from 4.6% of revenue in fiscal year '21 to 5.8% of revenue in fiscal year '22, and services and maintenance revenue increased by 92%, compared to a 51% in hardware, revenue services and maintenance for us generated a 24% gross margin in fiscal year '22 from a negative gross margin in fiscal year '21. And we have spoken in the past about that boom echo effect of the hardware rollout generating ancillary revenue opportunities and we continue to see that as a key strategy that we're developing. We've always said, we believe our hardware's a Trojan horse for that broader level of customer relationship and we continue to believe that high-quality hardware with comparative to other categories, lower margins is the ideal vehicle for growing a material services and software business.\n\nOur fast charges have a 10-year operating life. So there's typically this eight-year tail after the standard two-year free warranty period for paid services like spare parts, service agreements, preventative maintenance, and extended warranties. And then as the industry matures, we do see a material opportunity for service agreements to be in place from day one of operating a charger, not after the free warranty. Free warranties are reasonable efforts, no fixed resolution times.\n\nThey're not going to be suitable in the future for businesses that want to operate high availability, public and commercial charging fleets. And of course, we do plan to use this lengthy 10-year period to sell software that brings benefits to our customers, operating our hardware, like advertising modules, predictive analytics, diagnostics tools, fleet management software, and those APIs for backend integration. And that's one of the reasons we've invested in talent here. So we now have state-of-the-art data coming in and being sucked in across all of our platforms directly from the charges and also from all of our services and systems like JIRA, NetSuite, Salesforce, and what that's going to allow us to do is really improve our predictive analytics and diagnostic tools.\n\nAnd again, there's this boom echo effect the booms happening right now with the hardware. And we expect to see over time, greater revenue contributions from services, maintenance, and software. So that's a really key aspect of the business that I did want to touch on that I don't think we did touch on. And the other thing I think I'd just like to wrap up with is Tritium is an investment for 2023, 2024, and beyond.\n\nThis has always been the plan for fiscal year '22 was very much a setup year. It was our first year of trading as a publicly listed company. We had to put in the scale in Tennessee and we're so pleased that we have that was a great call. The infrastructure, the Inflation Reduction Act, and the Bipartisan Infrastructure Law have come in since we made that plan and we've been able to work with our landlords to increase the ability to scale at that size.\n\nSo we've taken on a lease that starts more and has the ability to grow and grow and grow. So we don't actually have to pay for the space until we take up the space and we can be America complaint ahead of many of our competitors and building in America at a time when the American market are expected to grow absolutely gangbusters. So I think with that, we'll conclude the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Collins -- General Counsel and Company Secretary\n\nJane Hunter -- Chief Executive Officer\n\nMichael Hipwood -- Chief Financial Officer\n\nSteven Fox -- Fox Advisors -- Analyst\n\nWill Jellison -- D.A. Davidson -- Analyst\n\nRob Wertheimer -- Melius Research -- Analyst\n\nTom Curran -- Seaport Research Partners -- Analyst\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nChristopher Souther -- B. Riley Financial -- Analyst\n\nPavel Molchanov -- Raymond James -- Analyst\n\nMore DCFC analysis\n\nAll earnings call transcripts"
}