{
  "companyName": "Gaotu Techedu Inc.",
  "companyTicker": "GOTU",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/gaotu-techedu-inc-gotu-q2-2022-earnings-call-trans/",
  "content": "Gaotu Techedu Inc. (GOTU -8.88%)\nQ2 2022 Earnings Call\nSep 08, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. And welcome to the Gaotu Techedu Inc. second quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Ms.\n\nSherry Lu, IR manager of Gaotu. Please go ahead.\n\nSherry Liu -- Investor Relations\n\nThank you very much, operator. Good evening, everyone, and thank you, all, for joining us tonight for Gaotu's second quarter 2022 earnings conference call. Gaotu's second quarter earnings release was published earlier today and is available on the company's IR website at ir.gaotu.cn. On the call with me tonight are Mr.\n\nLarry Chen, Gaotu's founder, chairman, and chief executive officer; and Ms. Shannon Shen, Gaotu's chief financial officer. Larry will give a general business overview, and then Shannon will discuss the financials. Following their prepared remarks, Larry and Shannon will be available for the Q&A session.\n\nI will translate for Larry. Before we begin, I'd like to remind you that this conference call will contain forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements are based upon management's current beliefs and expectations, as well as the current market and operating conditions.\n\nAnd they will involve known and unknown risks, uncertainties, and other factors. All of which are difficult to predict, and many of which are beyond the company's control and may cause the company's actual results, performance, or achievements to differ materially from those contained in any forward-looking statements. Further information regarding these and other risks is included in the company's filings with the U.S. SEC.\n\nThe company does not undertake any obligation to update any forward-looking statements, except as required under applicable law. As a reminder, this conference is being recorded. In addition, a live and archived webcast of this conference call will be available on Gaotu's team's website. It is now my pleasure to introduce Larry.\n\nLarry, please go ahead.\n\nLarry Chen -- Chief Executive Officer\n\nThank you, Sherry. Thank you for joining us on Gaotu's second quarter 2022 earnings conference call. Before I start, I would like to remind everyone that all financial information that I mention later is based on RMB, unless otherwise noted. During the second quarter of this year, our businesses sustained a healthy and stable growth.\n\nOur growth being nearly doubled compared with that of last quarter, and we successfully generated positive net operating cash flow. Moreover, our net loss substantially narrowed year over year, and this is the third consecutive quarter that we realized non-GAAP profitability after our business restructuring. Going forward, we will continue to focus on educational services for college students and adult, nonacademic tutoring services, and educational contents and digitalized learning products, continue to uphold our strategy of profitable growth and continue to strive for effective growth through improving operational efficiency and optimizing cost structure. During this quarter, our net revenue reached 537.8 million, and our gross billing increased 92.3% quarter over quarter to 611.7 million.\n\nTo provide a consistent basis of comparison, if we compare continuing businesses, the net revenues of our comparable business sales increased over 30% quarter over quarter. And the gross billings of comparable business have also achieved quarter over quarter growth for fourth consecutive quarters. Further, our gross margin this quarter was 70.2%, slightly higher than that of the same period of last year. Additionally, we also generated a net operating cash flow of 93.8 million, demonstrating that we have achieved effective growth.\n\nIn the second quarter, we upgraded our user products and made a solid progress in our main businesses. Additionally, we saw decent improvement in some of our key operational metrics, including ROI for selling expenses and employee efficiency. I will now briefly talk about the progress we made in each of these areas during the quarter. First, in terms of a product upgrades, we have repositioned and transformed the go to APP from a cross delivery tool into a comprehensive learning content-as-a-service platform.\n\nTo better serve our students, we have equipped our APP with additional tools, including independent many programs for key business lines, delay of coming live streaming announcement, and exam guide, as well as new features such as a mock examinations and test banks, teacher-student interactions, and exam reminders. After the upgrade, delay active users, students, retention rate, and a number of newly registered users for our APP all showed gradual increase. The improvement in the level of user engagement demonstrates that our APP center fulfills students multilevel and highly diversified needs and solidify our corporate mission as a learning -- as a learner-centric, life-long learning and service platform. By reaching out to a larger and broader customer base, our APP has delivered better performance in customer retention and generated more synergies among our business lines, thereby expanding our customer acquisition channels while reducing marketing costs.\n\nGoing forward, we will continue to enhance our products with dedication to make learning a better and a more convenient experience through technology and innovation. Second, we saw stable development for our key businesses during the quarter. In May, we released the go-to college students post-graduate entrance examination white paper, which present detailed guidance and a new medical analysis that we summarized based on numerous surveys and studies, and is intended to have student typically prepare for their exams and then reports their passing rate. With our continuous pursuit of the best teachers, the best consultants, the best services, according to our survey results, the success rate was more than twice that of the national average for our 2022 class for the national graduate school entrance exam.\n\nAdditionally, our nonacademic tutoring services also delivered a solid performance in this quarter. It not only achieved quarterly operating profit, but also contributed positive net operating cash flow. With a continuous effort to refine and optimize our products, we are pleased to see a higher user satisfaction. For instance, the retention rate of our programming tutoring business was almost 8% during this quarter, and its cross-billings increased approximately quarter over quarter.\n\nWe believe that high retention rate is the best indicator of user satisfaction. Going forward, we will continue to optimize our products and services to further increase retention rates and customer satisfaction. Third, ROI for selling expenses and employee efficiency both increased during the quarter. ROI for selling expenses doubled compared with that of the last quarter and employee efficiency also nearly doubled quarter over quarter.\n\nGoing forward, guided by our effective growth strategy, we will continue to implement control on marketing expenses and continue to further improve ROI for the selling expenses and operational efficiency. Lastly, I would like to say that we celebrated Gaotu's 8th anniversary on June 16 of this year. In this area of challenges as well as opportunities, we are well prepared to leverage our strong organizational capability to properly respond and adjust to the ever-changing environment. Although we have restructured our businesses and our organization, we remain true to our precious original aspiration to educate.\n\nOur starting point has never changed, nor have our hopes for the future of our confidence in the education industry. With emphasis on long-term value, we will continue to deep dive in the education industry, practice corporate social responsibilities as an education company and actively play a role as advocates, practitioners and leaders in the core education in China. Over the next 18 and even 28 years, we will continue to offer exceptional services, create better products, provide superior content, empower more students and, build a better go to. Thank you very much.\n\nNow, I will pass the call over to our CFO, Shannon, to walk you through our financial and operational details of this quarter.\n\nShannon Shen -- Chief Financial Officer\n\nThank you, Larry, and thank you, everyone, for joining our call today. I will now walk you through our operating and financial performance for the second quarter 2022. Please know that our financial data, that I mentioned later is based on RMB terms, unless otherwise noted. The education industry highly relies on employees' operational efficiency and the synergies among the workforce.\n\nDuring the second quarter, through optimizing costs and enhancing operational efficiency, we continued to achieve effective growth under this challenging economic environment. Net revenues generated by comparable businesses showed quarter-over-quarter growth for three consecutive quarters. And their gross billings showed a quarter-over-quarter growth for four consecutive quarters. We expect this momentum to continue in the next quarter.\n\nAdditionally, net loss was hugely narrowed by 94.6% year-over-year to 49.8 million on the GAAP basis. And we remained profitable this quarter on the non-GAAP basis with the amount of 645,400. We are also seeing a positive net operating cash flow of 93.8 million. With that, our capital position remains strong.\n\nAs of June 30, 2022, we had a total of approximately 3.4 billion in terms of cash, cash equivalents, restricted cash, and short-term investments on our balance sheet, providing ample resources for continued business development. Going forward, we will continue to focus on our three core businesses, educational services for college students and adults, nonacademic tutoring services and educational content, and digital learning products, well guided by our strategy of sustainable growth. Now, I will go through our key financial data for the second quarter. As the new businesses we initiated after our business restructuring are still in their early development phases, we will compare our financial performance on a quarter-over-quarter basis, alongside with year-over-year comparisons to better present the development of our comparable businesses.\n\nIn the second quarter of 2022, our net revenues decreased 75.9% year over year to 537.8 million. To provide a consistent basis of comparison, if we compare our comparable businesses, our net revenues achieved healthy growth with a higher than 270% increase year over year and over 30% increase quarter over quarter. We would like to point out that from the second quarter onwards, our net revenues and gross billings come from continuing businesses. Gross billings decreased 77.3% year over year and increased 92.3% quarter over quarter to 611.7 million.\n\nGross billings of our comparable businesses showed quarter-over-quarter increase for four consecutive quarters. Among that, gross billings for nonacademic tutoring services showed substantial quarter-over-quarter increase. The performance for non-academic treating services displayed seasonality as cost retention normally happened during the second and the fourth quarter of the year, during which upfront tuition will be collected, and therefore, gross billings will increase. We accept the same increasing trend to also appear in the following fourth quarter of this year.\n\nOur cost of revenues this quarter decreased by 77.9% year-over-year to RMB 106 million. Our gross profit decreased 74.9% year over year to 377.8 million, which give us a gross profit margin of 70.2%, 269 basis points higher than that of the same period of last year. Non-GAAP gross profit was 396.4 million, and non-GAAP gross profit margin was 73.7%. The increase in gross profit margin is because compensation for instructors and tutors in new businesses took up a smaller proportion of net revenues.\n\nOperating expenses decreased by 81.4% year over year to RMB 438.3 million. To break down the operating expenses, selling expenses decreased by 83.6% year over year and 5.3% quarter over quarter to 269 million. Selling expenses have shown quarter-over-quarter decrease for 5 consecutive quarters since the first quarter of last year. Selling expenses margin for the first quarter was 50%, a solid decrease compared to the same period of last year.\n\nROI for sales and marketing expenses has also increased over the last quarter. The improvement of selling expenses efficiency is due to lower cost and diversified customer acquisition channels and constantly increased operational efficiency. Since different customer acquisition strategies are suited for different business lines, after our restructuring, we prefer to acquire new customers more vertically, and we have upgraded our model for private traffic operations to better identify potential customers with high conversion rates. We have also upgraded our APP, which is not only a learning tool, but also an application for customer acquisition and retention through enriched content.\n\nFurther, we will continue to establish our branding in the education industry through exceptional service, superior quality and better learning results, and gradually become more reliant on customer acquisition through word-of-mouth referrals, and in this way, constantly lower our customer acquisition cost and the selling expenses margin to pursue shareholder value and the sustainable growth. Research and development expenses decreased by 75.6% year over year to 103.9 million. To provide superior quality education and to be able to offer contents and products that exceed users' expectations, we will invest in R&D according to the development of each specific business line. Meanwhile, we will adjust the R&D employee structure to continuously enhance ROI for R&D expenses and realized R&D efficiency improvement.\n\nGeneral and administrative expenses decreased by 73% year over year to 65.4 million. Since our new businesses are still in the early development stage, initial fixed costs, including R&D expenses, are still taking up a relatively high proportion of net revenues. We expect some R&D and G&A expenses to start showing economies of scale as the size of new businesses grow larger. Going forward, we will continue to improve our operational efficiency and optimize our cost structure to achieve greater value for our stakeholders.\n\nOur loss from operations for the second quarter was reduced by 92.9% to 60.5 million. Our net loss was reduced by 94.6% to 49.8 million. Non-GAAP net income was 645,000. Our net loss margin was 9.3%, and non-GAAP net income margin was 0.1%.\n\nDue to the effect of restricted stock units offered to employees in the past years, the share-based compensation expenses were still being recognized toward cost and expenses of acceleratingly. And, thus, took a high proportion of net revenues, causing a relatively wide gap between GAAP and non-GAAP bottom line. With the end of this acceleration and the increase in our revenue, we expect share-based compensation expenses to gradually account for a lesser and lesser proportion of revenues in the following quarters. Additionally, our net operating cash flow turned positive this quarter, reaching 93.8 million and representing an improvement in efficiency compared with the same period of last year and last quarter.\n\nThe large increase in cash flow was primarily due to increase in gross billings. We are pleased to be able to continue to achieve effective growth this quarter, and we will strive to continue this momentum. Turning to our balance sheet. As of June 30, 2022, we had 591.5 million cash, cash equivalents, and restricted cash, and 2.8 billion short-term investments, which totaled approximately 3.4 billion, providing ample resources for continued business development.\n\nFurther, as of June 30, 2022, our deferred revenue balance was 647.9 million, which primarily consists of tuition collected in advance. Before I provide our business outlook for the next quarter, please allow me to remind everyone that this contains forward-looking statements, which involves risks and uncertainties, which are beyond our control and could cause the actual results to differ materially from our predictions. Based on our current estimates, net revenues for the third quarter of 2022 are expected to be between 576 million and 596 million, representing a decrease of 46.5% to 48.3% on a year-over-year basis. This concludes my prepared remarks.\n\nOperator, we are now ready for the Q&A section. Thank you, everyone.\n\nOperator\n\n[Operator instructions] The first question comes from Mark Li with Citi. Please go ahead.\n\nMark Li -- Citi -- Analyst\n\nHi, management. Thanks for your presentation, and congrats on breaking even in this quarter in the non-GAAP net profit. My first question is about Q3 revenue outlook. We see the Q-on-Q revenue improvement.\n\nCould you share a bit on maybe the breakdown of the major segments? Or could you comment on the Q-o-Q growth drivers for the major segments? Thank you.\n\nShannon Shen -- Chief Financial Officer\n\nThanks, Mark. We are gradually becoming more focused on our businesses and products to target a more vertical student population and in this way, to create synergies between our users and to enhance our branding and to increase the market penetration rate. As such, during this quarter, we are focused on the three main businesses, including educational services for college students and adults, and academic tutoring services and educational content and digitalized learning products. Our new businesses are still in their early development stages and the revenue contributed by each of the business lines will be affected by different seasonalities and different stage of the development.\n\nSo, currently, we did not disclose our revenue breakdown in detail because our current revenue structure is not a very perfect indication for what's going on, and we expect it to change in the following quarters as our revenues grow larger. But I can give you a high-level picture. Like this quarter, I mean, in the second quarter, our academic tutoring services and educational content and digitalized learning products, combined together, contributed roughly 68% of our revenues and constantly contributed operating profit and sizable net operating cash flow. So, we will leverage our brand recognition and large user base that we have accumulated in the past years to constantly upgrade our products and to better serve our students.\n\nAnd other than the 60%, the rest of the -- our 40% revenue were contributed by educational services for college students and adults, which includes some vertical categories, such as whether through entrance exam preparation and civil servants exam preparation and also like financial and accounting qualification test preps, as well as other exam preparation categories. Because different business lines are still at different stages so we will not disclose more -- we will disclose more information when this businesses enter a more mature phase. So then if you're looking to next quarter for Q3 outlook, we foresee all these three categories of revenue to grow, but it still depends on like the seasonality and the different stages. Hope that helps.\n\nMark Li -- Citi -- Analyst\n\nThank you. Got it. May I have a quick follow-up on the education service for the college doubts. I look into Q3, what are the major driver for the courses? Or any new costs you could highlight to us?\n\nShannon Shen -- Chief Financial Officer\n\nYes. Thanks for your question, Mark. So this is the third quarter, we're transforming and restructuring our business. Currently, we have categorized our core businesses according to the groups of clients that we wanted to target.\n\nSo, college students and working adults are a group of students, which is still energetic for about learning and their demand is very strong. And historically speaking, we have achieved decent progresses for these new businesses. If we look into last quarter, this business achieved over 200% year over year growth. And gross billing also achieved over 68% year-over-year growth.\n\nAnd this quarter, we are happy to see the momentum to continue. And we also think the gross billing is always an indicator and it will build a strong foundation for the future development. So further, some of our business lines raising this group have achieved a quarterly operating profit, such as financial qualification prep businesses. And also, like the graduate school entrance exam preparation businesses also achieved around 30% quarter-over-quarter growth in revenue.\n\nBesides, we have courses called language training and overseas tax preparation. This also achieved a savable quarter-over-quarter revenue growth about like over 30%. So, based on this, because we invest in certain categories, and they all like grow in a sustainable way so we can see that in Q3, we do foresee like our education services for the college students and working adults to continue to grow. So yes, so then in terms of the seasonality, for instance, I will use the graduate school entrance examination reoperation as an example.\n\nSo, this business shows a strong seasonality, like Q1 and Q3 are usually the season that we collect the tuition fees, then you will see the gross billing to increase. Then for the second quarter and the fourth quarter, that's usually when the students started to take the courses, so we will see revenue to grow. So like -- because we -- there're certain categories in this direction, so both of them are in a very fair way to grow.\n\nMark Li -- Citi -- Analyst\n\nThank you very much.\n\nShannon Shen -- Chief Financial Officer\n\nThanks, Mark.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Sherry Liu for any closing remarks.\n\nSherry Liu -- Investor Relations\n\nThank you, operator, and thank you, everyone, for joining the call tonight. If you have any further questions, please don't hesitate to contact our Investor Relations department or our management via email at ir@gaotu.con directly. You are also welcome to subscribe to our new sellers on the company's IR website. Thank you very much again for your time.\n\nHave a great night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSherry Liu -- Investor Relations\n\nLarry Chen -- Chief Executive Officer\n\nShannon Shen -- Chief Financial Officer\n\nMark Li -- Citi -- Analyst\n\nMore GOTU analysis\n\nAll earnings call transcripts"
}