{
  "companyName": "MSC Industrial Direct",
  "companyTicker": "MSM",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/msc-industrial-direct-msm-q4-2022-earnings-call-tr/",
  "content": "MSC Industrial Direct (MSM -0.39%)\nQ4 2022 Earnings Call\nOct 20, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the MSC Industrial Supply fiscal 2022 fourth quarter and full year conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to John Chironna, vice president of investor relations and treasurer. Please go ahead.\n\nJohn Chironna -- Vice President of Investor Relations and Treasurer\n\nThank you, Andrew, and good morning to everyone. Erik Gershwind, our chief executive officer; and Kristen Actis-Grande, our chief financial officer, are both on the call with me today. During today's call, we will refer to various financial and management data in the presentation slides that accompany our comments as well as our operational statistics, both of which can be found on our investor relations web page. Let me reference our safe harbor statement under the Private Securities Litigation Reform Act of 1995, a summary of which is on Slide 2 of the accompanying presentation.\n\nOur comments on this call as well as the supplemental information we are providing on the website contain forward-looking statements within the meaning of the U.S. securities laws, including statements about the high inflationary environment and global economic conditions on our business operations, results of operations and financial condition expected future results, expected benefits from the investment in strategic plans and other initiatives and expected future growth and profitability. These forward-looking statements involve risks and uncertainties that could cause actual results to differ materially from those anticipated by these statements. Information about these risks is noted in our earnings press release and the risk factors in the MD&A sections of our latest annual report on Form 10-K filed with the SEC as well as in our other SEC filings.\n\nThese risk factors include our comments on the high inflationary environment and global economic conditions. These forward-looking statements are based on our current expectations, and the company assumes no obligation to update these statements, except as required by applicable law. Investors are cautioned not to place undue reliance on these forward-looking statements. In addition, during this call, we may refer to certain adjusted financial results, which are non-GAAP measures.\n\nPlease refer to the GAAP versus non-GAAP reconciliations in our presentation or on our website, which contain the reconciliations of the adjusted financial measures to the most directly comparable GAAP measures. I'll now turn the call over to Erik.\n\nErik Gershwind -- Chief Executive Officer\n\nThank you, John. Good morning, everybody, and thank you for joining us today. I hope you're all doing well. We had an exciting year, and our fiscal fourth quarter was definitely no different.\n\nOn today's call, I'll reflect on our recent performance, share my perspective on the current environment and outline our goals for fiscal '23. I'll also discuss our fourth quarter acquisition of Tower Fasteners. Kristen will provide more specifics on Q4 and on our fiscal '23 framework. I'll then wrap things up, and we'll open the line up for questions.\n\nBefore I get into our performance, I'd like to mention our newest member of the MSC executive team, chief operating officer, Martina McIsaac. Martina started at the beginning of this month and come to us from Hilti Corporation with a proven track record of driving both top-line growth and profitability improvements. Her experience in implementing an organic revenue growth engine and expanding share of wallet in adjacent products and services fits perfectly with our strategy. Equally exciting, it's her experience with using Lean and Six Sigma to improve productivity, operating rigor and execution.\n\nWe're thrilled to have Martina on board. Over the past year, we've made our culture and talent development, a core focus of our business. The addition of Martina further emphasizes our growth on this front. Martina has lived by values and principles that line up perfectly with MSC.\n\nShe's a strong leader of people and a strong advocate of DE&I. We're also in the midst of refocusing our ESG program and more clearly communicating our progress, building on a legacy of good corporate citizenship since the founding of our company. We'll be releasing our annual ESG report next month, and I look forward to further discussing our ESG goals moving forward. Now, on to our recent results.\n\nOur fiscal fourth quarter continued our string of strong financial performance and execution. We achieved average daily revenue growth of 14%, which is well above the IP index. We expanded adjusted operating margins by 190 basis points over prior year, driven by a 200-basis-point reduction in operating expenses as a percentage of sales. Zooming out from the quarter and looking at the full fiscal year of '22, I'm equally pleased.\n\nWe achieved average daily revenue growth of nearly 11%, roughly 600 basis points above the IP index and above our goal of a 400-basis-point spread. This was aided by strong price contribution, bolt-on acquisitions and successful execution of our growth drivers, which I'll speak to shortly. We expanded adjusted operating margins by 140 basis points over prior year. In fact, adjusted operating expenses as a percentage of sales are at their lowest mark since fiscal 2012.\n\nThis was aided by our mission-critical initiative, which has already yielded $85 million of structural cost reductions and productivity and is on track to exceed our original goal of $100 million by the end of fiscal '23. Finally, adjusted ROIC is already into the high teens at nearly 18%, a year ahead of schedule with our fiscal '23 targets. Our growth formula remains anchored in the five priorities that we've been discussing as part of the mission-critical initiative. And those are metalworking, solutions, selling the portfolio, digital and customer diversification with an emphasis on public sector.\n\nI'll now update you on each of those growth drivers. Metalworking remains the cornerstone of our value proposition. We use a combination of our broad and deep product offering, an extensive network of technical metalworking expertise and digital innovation to drive productivity and cost savings for our customers, and this leads to high customer retention rates and to new growth opportunities. In many cases, we also help our customers to reduce waste, helping them achieve their sustainability goals.\n\nA recent example illustrates this. We just won a proposal to supply cutting tools and broad line MRO to a component producer for the energy industry. In doing so, we identified over $200,000 in annual savings at just one of their many locations. The savings come in the form of increased metal removal rates, reduced weights, carbon recycling and reuse opportunities, and we also found safety improvements.\n\nAs a result, the customer has now asked us to implement the same process at a different location where we've since identified another $300,000 in savings. Our second growth driver is solutions. This includes our vending and implant programs, both of which continue gaining traction and adding to share gains. Vending signings were up 21% in our fiscal fourth quarter year over year, and vending sales now represent 15% of total company sales.\n\nLikewise, implant signings increased 42% and now represent 11% of total company sales. You may recall that our original goal was to reach 10% by the end of fiscal '23. So we've surpassed that goal a year early, and we'll continue to push on that program. Sales to customers with our solutions offerings now represent 56% of total company sales, up nearly 200 basis points from prior year.\n\nThe third priority is selling the portfolio, which is about increasing share of wallet through ancillary products, especially our CCSG business. Here, we provide an outsourced vendor-managed inventory service for the C-Part consumables that keep plants running. For our customers, we're taking over a difficult-to-manage category that can shut down a plant. For MSC, these are high-margin items that because of the VMI solution, result in high retention rates.\n\nWe've been focused on this business, and we're seeing nice momentum with Q4 ADS growth rates in the mid-teens. Our fourth priority is digital, also referred to as e-commerce. As you may recall, we hired a new chief digital and information officer, John Hill, a few quarters back. He and team have been quite busy improving our website and reviewing our entire digital offering.\n\nSo far, the feedback we've received from the field is excellent. Our e-commerce sales grew by 20% in our fiscal fourth quarter on an ADS basis and reached 63% of total company sales, up roughly 300 basis points compared to prior year. Our fifth growth driver is customer diversification through our public sector business. Over the past few quarters, I've described the building momentum, including several contract wins such as the 4PL contract serving U.S.\n\nmarine bases. That contract is ramping up and as a result, our Q4 ADS government growth rate was over 30%. We expect strong growth to continue into fiscal '23. Outside of our organic growth drivers, we also added two tuck-in acquisitions in our fiscal fourth quarter, and both are tracking to performance targets.\n\nIt will each be nicely accretive to earnings in fiscal '23, and we expect ROIC to exceed our weighted average cost of capital within the first full year of operations for each. Most recently, we acquired Tower Fasteners, a Long Island New York-based distributor of OEM fasteners and components. Tower will be joined with AIS, the OEM Fastener business we acquired in 2018. You'll recall that we identified OEM Fasteners as a natural extension of our mission-critical value proposition on plant floors across North America.\n\nOEM Fasteners, like metalworking and like Class C consumables, are both technical and high touch. We've spent the past few years shoring up the AIS Foundation by bolstering its management team, systems and cross-selling capabilities with MSC. With those strengths now in place, we're turning our attention to growth, and Tower is a great start. Mark Shannon and his team are a terrific addition to this platform, and we expect to see continued growth.\n\nTurning to the external environment. The headlines are filled with the growing likelihood of recession. This is also reflected in eroding readings on the sentiment indices and declining IP forecasts. While we do see some pockets of softening in consumer-facing industries, the majority of our customers are still seeing stable order levels, demand and general activity.\n\nWe do, however, hear more caution expressed by our customers when it comes to calendar 2023 conditions. We're going to keep a careful eye on the environment and keep our ear to the ground with respect to both customers and suppliers. At the same time, the need for our customers to find productivity to offset their own cost headwinds is as high as it's ever been. And this plays really nicely into our value proposition.\n\nSo we remain focused on delivering that productivity for our customers. With that as a backdrop, I'll now look ahead and outline our fiscal '23 goals. And they're largely a continuation of our current mission-critical objectives as we look to build on our recent momentum. First, we remain focused on capturing market share.\n\nSpecifically, we aim to continue outperforming our original growth target of 400 basis points above the IP index, just as we did in fiscal '22. As of now, we foresee average daily sales growth of between 5% and 9% for the fiscal year. This range assumes a contracting industrial economy at the low end and a flat economy at the higher end of the range as an average across our fiscal '23. Now given that we've started the year -- the fiscal year in positive territory, the bottom end of the range implies significant erosion through the year.\n\nThe top end of the range implies more modest erosion in the environment during the rest of our fiscal year. If conditions do not deteriorate, we would expect to come in above the guided range. Inside the company, I can tell you that we're rallying to even higher rates of market share capture, particularly if the market softens. As the bulk of our competitors are local and regional distributors, who will struggle disproportionately.\n\nOur second goal is to continue expanding adjusted operating margins. We do this by leveraging revenue growth and by executing our mission-critical initiatives, which will yield at least an additional $15 million in cost savings, achieving our goal of at least $100 million by the end of fiscal '23. Kristen will go into more detail on our guidance range shortly. And third, we aim to further improve adjusted ROIC, lifting it beyond the current 18% and closer to 20%.\n\nWe've set these goals amid an uncertain environment. Should being softened even further than what we've currently envisioned, we have identified multiple levers to pull, and we're prepared to adjust quickly through our downturn playbook. Kristen will also say a few more words on that shortly. In addition, our balance sheet remains strong, and our cash generation will continue improving, leaving us well positioned to capitalize on any opportunities that emerge.\n\nKristen will now take you through the financials, including our new annual guidance range.\n\nKristen Actis-Grande -- Chief Financial Officer\n\nThank you, Erik. I'll begin with a review of our fiscal fourth quarter, then update you on the progress of our mission-critical initiatives. Before I turn it back over to Erik, I'll close with our thoughts and guidance on fiscal 2023. On Slides 4 and 5 of our presentation, you can see key metrics for the fiscal fourth quarter and full year on a reported basis.\n\nSlides 6 and 7 reflect the adjusted results, which will be my primary focus this morning. Our fourth quarter sales were up 23% versus the same quarter last year and came in at $1.02 billion. This includes the 53rd week this fiscal year. So on an ADS basis, our sales were up 14% for the quarter as compared to the same quarter last year.\n\nOur fourth quarter acquisitions represented nearly 250 basis points of the growth. Looking at growth rates for our average daily sales by customer type, Government sales increased over 30%, fueled by fulfillment under our 4PL contract for the U.S. Marine bases and other public sector spending. National Account growth was high teens, and core customers grew high single digits.\n\nOur gross margin for the fiscal fourth quarter was 41.9%, down 100 basis points sequentially from our third quarter and down 10 basis points from last year's fiscal Q4. The quarterly decline includes approximately 60 basis points from the seasonal product mix of summer goods, headwinds from the acceleration in the public sector growth rate and a 40-basis-point impact from our recent acquisitions. We continue to see inflation from our suppliers, particularly on the metalworking side of the business, albeit at a slower pace than the past year. In response to supplier moves, we implemented a roughly 1% price increase in August.\n\nRealization rates remain strong as our customers are hungry for product availability and for tangible productivity gains. MSC continues to deliver on both fronts, as evidenced by the example that Erik shared earlier. Reported operating expenses in the fourth quarter were $290 million versus last year's reported operating expenses of $253 million. Adjusted for acquisition-related costs, adjusted operating expenses were also $290 million or 28.3% of net sales versus last year's adjusted operating expenses of $252 million or 30.3% of net sales.\n\nThis 200-basis-point reduction in adjusted opex to sales year over year is a testament to the continued success of our mission-critical initiatives. We incurred approximately $4.1 million of restructuring and other costs in the quarter as compared to $4.4 million in the prior-year quarter. We also recognized a $10.1 million gain on the sale of our Melville, New York facility, and we have adjusted that out as well to improve comparability. Our reported operating margin was 14.1% compared to 11% in the same period last year.\n\nAdjusted for restructuring and acquisition-related costs as well as the current year gain on sale of property, adjusted operating margin was 13.6% as compared to adjusted operating margin of 11.7%, a nearly 200-basis-point improvement year over year. That resulted in an adjusted incremental margin for our fourth quarter of approximately 22%. For the full year fiscal 2022, we achieved a reported operating margin of 12.7% and on an adjusted basis, 12.9%, which was squarely in the top tier of our annual operating margin framework. I'll note here that the extra week added roughly 60 basis points for the fourth quarter and 20 basis points to our full year adjusted operating margins.\n\nOur full year adjusted incremental margin was just over 23%, exceeding our original fiscal 2022 adjusted incremental margin goal of 20%. Reported earnings per share were $1.86 for the quarter as compared to $1.18 in the same prior-year period. Adjusted for restructuring and acquisition-related costs as well as the current year's gain on sale of property, adjusted earnings per share were $1.79 as compared to adjusted earnings per share of $1.26 in the prior-year period, an increase of 42%. This continues to reflect strong execution at all levels, sales performance, gross margin levels and opex leverage.\n\nTurning to the balance sheet. You can see that as of the end of the fiscal fourth quarter, we were carrying $716 million of inventory, up $36 million from Q3's balance. The inventory build is consistent with our double-digit revenue growth, the ongoing supply chain disruptions and continuing inflation. Accounts receivable are also rising with the current sales growth.\n\nAs expected, we saw continued sequential improvement in our cash flow conversion or operating cash flow divided by net income. Q4 cash conversion was 106% compared to 78% cash conversion last quarter. This brings our annual cash conversion rate to 72% in the range of the 70% to 80% we communicated earlier this year. Our capital expenditures were $16 million in the fourth quarter, bringing our full year capex to roughly $60 million.\n\nMoving ahead to Slide 10. You can see our free cash flow is also up year over year at $95 million for the current quarter as compared to $69 million in the prior-year quarter. Note that we also spent about $22 million buying back shares during the quarter, just over 300,000 shares at an average price of $73.75. Finally, we also announced a 5% increase in our ordinary dividend to be paid in November.\n\nOur total debt at the end of the fiscal fourth quarter was $795 million, reflecting a $5 million increase from our third quarter. As for the composition of our debt, roughly 57% was floating rate debt and the other 43% was fixed rate debt. Cash and cash equivalents were $44 million, resulting in net debt of $751 million at the end of the quarter, down from $761 million at the end of the third quarter. Let me now update you on our mission-critical productivity goals on Slide 11.\n\nIn our fiscal fourth quarter, we achieved additional savings of $5 million and invested another $2 million. That brings our fiscal year 2022 savings and investments to $25 million and $15 million, respectively, and right in line with our guidance for the year. One of the programs we're quite pleased with is the continued automation enhancements of our distribution centers that strengthens our operations and mitigates the effects of labor inflation. For the total program to date, we have achieved gross savings of $85 million, and we remain on target to hit at least $100 million of gross cost savings by fiscal 2023.\n\nNow, let's turn to the fiscal year 2023 guidance, which is shown on Slide 12. We are estimating average daily sales growth of 5% to 9% and an adjusted operating margin between 12.7% and 13.3%. Let me point out a few factors and assumptions to keep in mind. Specific to the ADS growth range, fiscal 2023 has 252 days, six fewer days than fiscal 2022.\n\nThe full fiscal calendar can be found on our website. As we mentioned before, we made two acquisitions during our fourth quarter. These are included in the guidance and add roughly 200 basis points to our ADS growth for the year. In terms of our economic assumptions, most readings and forecasts point to a softening environment.\n\nWhile our growth is currently strong, as evidenced by our September growth rate of 13.5% and October's similar trend, we do assume the industrial economy slowed sequentially through fiscal 2023, and our growth rates will flow accordingly. At the gross margin level, we expect to benefit from a favorable price cost spread to offset most of the typical 30 to 50-basis-point headwind we experienced from customer and channel mix. On a year-over-year basis, acquisitions will pose a 30 to 40-basis-point headwind. Overall, we expect full year gross margins to be down 40 to 70 basis points versus fiscal 2022.\n\nOn the operating expense line, we expect continued reduction on a percentage of sales basis despite ongoing headwinds from freight and labor inflation, and we will continue to strategically invest in the business in support of our mission-critical growth strategy. As I mentioned earlier, we expect to achieve additional cost savings through our mission-critical program of at least $15 million. Factoring in those assumptions, we expect adjusted operating margins to be in the range of 12.7% to 13.3%. Excluding the 20-basis-point benefit of the extra week from fiscal 2022, this would reflect operating expansion -- operating margin expansion at nearly all points within our range.\n\nAlso note that the recently completed acquisitions dilute operating margins by approximately 20 basis points in fiscal '23, their first full year with us. While dilutive to operating margins in the first year, both acquisitions are accretive to EPS and on track to achieve an ROIC above WACC in their first full year of operations. Lastly, on an operating margin on operating margin, and as I mentioned earlier, please keep in mind that the 53rd week added about 20 basis points to our full year fiscal 2022 operating margin. For modeling purposes, I'd like to give some additional color on the quarterly progression through the year.\n\nWe expect gross margins to remain at a consistent level, plus or minus 20 basis points. Additionally, as we continue to benefit from our mission-critical initiatives, we expect our adjusted operating expense as a percent of sales and adjusted operating margin to improve sequentially as we progress through the year. A couple of additional and important points. Please note that given the current interest rate environment and expectations for further rate hikes, interest expense will rise significantly.\n\nHolding fiscal '23 debt constant with current levels, we would expect roughly $8 million to $10 million of interest expense per quarter and tax rates of slightly under 25%. Given our expectations for an operating cash flow conversion over 100%, we will have flexibility to deploy free cash into debt reduction, buybacks or accretive acquisitions. One final area I'd like to discuss is our downturn playbook. While we are not yet experiencing any signs of a slowdown, we are well positioned to navigate a change in the environment.\n\nWe have clearly defined the triggers for changes in our actual or forecasted revenue and operating profit that initiate a series of actions we will take across the business. This includes everything from pullback on discretionary spending, changes in staffing levels and reprioritization of investments. In addition, our balance sheet remains strong. And when the economy slows, we generate high levels of cash flow as working capital becomes a source of funds.\n\nThis will enable us to pay down debt and/or to strategically invest through the downturn. So while we certainly prefer the current environment, we feel well positioned regardless of whatever happens. I will now turn it back over to Erik.\n\nErik Gershwind -- Chief Executive Officer\n\nThank you, Kristen. As we wrap up fiscal '22 and we're full speed ahead into fiscal '23, I remain quite pleased with our company's performance. We are tracking to each of our mission-critical goals for the end of fiscal '23 and are seeing momentum build within -- inside the company. Regardless of the macro environment, we'll remain squarely focused on what we can control, capturing market share and hence, growing well above IP, and then translating that growth into profit expansion.\n\nI'd like to thank our entire team for their hard work and dedication, and we'll now open up the line for questions.\n\nOperator\n\n[Operator instructions] The first question comes from Ryan Merkel with William Blair. Please go ahead.\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nHey. Good morning, everyone. \n\nErik Gershwind -- Chief Executive Officer\n\nHey, Ryan. How are you?\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nDoing well. Let me say, first off, thanks for all the details on the outlook. I know it's a tricky time, so we appreciate it. Can I start with price? I think it was contributing 7% in the quarter.\n\nAnd I know you don't want to give price and volume assumptions for '23, but should we assume that there's more price at sort of the midpoint of the sales guidance versus volume?\n\nKristen Actis-Grande -- Chief Financial Officer\n\nYeah, Ryan. So first of all, the 700 bps is a little bit lower, closer to 600. The '23 contribution from price, yes, I would say that's fair to assume that at the lower end of the range, that there is a disproportionately higher contribution from price upright.\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nGot it. OK. And then on the macro assumptions, makes sense what you provided. When you say that contracting industrial economy, can you just put a finer point on that? Are you thinking IP down in the like 5% range? Or would it -- could it be worse at that lower end? How are you thinking about that?\n\nErik Gershwind -- Chief Executive Officer\n\nYeah, Ryan. So it's certainly an interesting time because we start by -- if you look at the current results, the current conditions with our customers are still solid. And you could see September's growth rate, good October, Kristen mentioned is trending similarly. So we're starting the year off in positive IP territory and obviously, double-digit growth territory.\n\nSo the assumptions we're making -- and look, our guess is as good as yours, right? This is really uncertain times. Basically, you have the high end of the range, the low end of the range. Yes, so we're indexing it on IP, Ryan. And effectively, where we're at is the high end of the range assumes a flat IP.\n\nNow this is through the course an average of our fiscal year. So realize that we're starting in positive territory, even the higher end of our band here is assuming that conditions erode, and that the IP erode so that -- such that by the back half of our fiscal, the math would work out that at some point, IP turns negative. It just would be modestly negative to get you to an average of flat. The low end of the range on the other hand, assumes more aggressive erosion in the environment such that the average of the full year is negative IP.\n\nSo you can imagine if we're starting the year in positive territory to get to a negative average for the year by the back half of our fiscal, we're in pretty healthy negative territory. That's the assumption.\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nMake sense. OK, and then just last one. Heavy manufacturing packer sales. And from what I hear, those customers have big backlogs, higher than normal.\n\nIs that something you're hearing? And is that something that is a little bit different this cycle that could help sustain sales, maybe a little bit longer than we're thinking?\n\nErik Gershwind -- Chief Executive Officer\n\nRyan, I do think it's possible. So what we're hearing from customers is, yes, conditions now are stable, and I do think part of that is you take industries, Ryan, that have been on their back for so long, like aerospace and even automotive, where there's just -- it's been such a supply constrained industry that there is a larger -- yeah, I think that's a fair point. So there is the potential that, that could carry us for a while. We'll see, but I think it's a fair observation.\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nGot it. All right. Thanks. Congrats.\n\nErik Gershwind -- Chief Executive Officer\n\nThanks, Ryan.\n\nJohn Chironna -- Vice President of Investor Relations and Treasurer\n\nThank you.\n\nKristen Actis-Grande -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nThe next question comes from Stephen Volkmann with Jefferies. Please go ahead.\n\nSteve Volkmann -- Jefferies -- Analyst\n\nHi. Good morning, guys. Thanks for taking the question. Maybe just building off of that, Erik, it sounds like what you're saying is that you're sort of looking at the big broad macro picture and trying to be sort of prudent.\n\nBut not actually hearing any real issues from any of your customers? I think maybe you mentioned some of the consumer-facing guys. Just any more color on what your customers are actually saying?\n\nErik Gershwind -- Chief Executive Officer\n\nYes, Steve. So in general, I would say right now, our revenues feel solid. When we look at our own internal trends feel solid, customer activity levels are solid with some isolated pockets. So anything touching consumer right now, that's where they're feeling some softening.\n\nSo for instance, the food processing sector is feeling in a bit. RV industry, you could imagine, is actually down quite a bit. But for the bulk of our customer base that's heavy industry, it's still solid. What we are hearing in fairness, Steve, is we're hearing caution.\n\nSo a lot of our customers, as they look ahead, they're not seeing it in their business. But I think some of that just could be self-fulfilling. Everyone's reading the headlines. Everybody is seeing the sentiment of the disease.\n\nSo they're expressing caution for '23, which is why we're taking a somewhat cautious stance in our guidance range. But in terms of what we're seeing now, no, it's still good.\n\nSteve Volkmann -- Jefferies -- Analyst\n\nOK, that's helpful. Thanks. And then is it possible -- this may not be a fair question, but what do you think your exposure is to sort of consumer type end markets, just roughly?\n\nErik Gershwind -- Chief Executive Officer\n\nReally, it's one of those that's really tough to give you a number, Steve, because so many of our customers, job shops, machine shops that are doing work for multiple industries. It's tough for us to get to a number, but what I would tell you is it's pretty small. The bulk of our business is heavy industry and not consumer-facing.\n\nSteve Volkmann -- Jefferies -- Analyst\n\nYeah, that's what I thought. And then a final one, I'll pass it on. I'm just curious how we should think about we're seeing the declines in lots of input costs, whether it's metals or other commodities, I mean, even energy lately, transportation and logistics costs are down, at least on the big indexes? And how do we think about how that sort of plays through to you guys?\n\nErik Gershwind -- Chief Executive Officer\n\nYeah, Steve. So the first thing I'll say is, you're correct on all of those things coming down. This is a bit of an unusual cycle in that you have other factors that are sort of buying costs. And you're seeing inflation numbers continue to outpace what expectations are every month.\n\nWe're still seeing cost increases coming from our suppliers late through -- late calendar '22, and we're hearing it Maven be early calendar '23, certainly not at the rate and pace at wards or the size, but still there. You have -- labor is a major issue and a major input cost for most companies and wage rates are still high. So that's being it a little bit. I will tell you in terms of ultimately if things really do come down.\n\nHistorically, yeah, you can never say never. But historically, our product lines for the most part do not see price deflation. There could be a period where we don't get price, but they don't come down in past cycles. And the reason is typically most of what we sell, the raw material itself is a relatively small percentage of the finished good.\n\nAnd so you have lots of other factors. Now again, never say never, but historically, it's not meant price deflation.\n\nSteve Volkmann -- Jefferies -- Analyst\n\nI appreciate the time.\n\nErik Gershwind -- Chief Executive Officer\n\nThanks, Steve.\n\nOperator\n\n[Operator instructions] The next question comes from David Manthey with Baird. Please go ahead.\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nYeah. Thank you. Good morning, everyone. \n\nErik Gershwind -- Chief Executive Officer\n\nHi, Dave.\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nFirst off, Erik, when you talked about the framework, and you said it will -- you'd report above framework in theory if conditions do not deteriorate, just to be 100% clear here. When you say do not deteriorate, you mean IP does not slow from the current mid-single-digit growth rate. You don't just mean it's positive, right?\n\nErik Gershwind -- Chief Executive Officer\n\nYeah. Basically, what we meant, Dave, is that look, if IP the top of our framework assumes roughly a flat IP, plus or minus a bit. So if IP for the year were nicely positive, what we're saying is meaning a couple of points or more, that we would expect to be on top above the framework. And look, proof point is take a look at September positive, nicely positive IP and where the growth rate is tracking is obviously well above the top end of the range is, and we're seeing the same thing for October, roughly plus or minus.\n\nSo that's what we meant.\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nAll right. Thank you for that. And then relative to the framework, you mentioned that the ET and Tower are going to add a couple of points of growth via acquisition. Did you mention, Kristen, what of the remaining 3% to 7% is price mix at this point? And then a related question there's, within that assumption, and I guess you're talking about a sliding scale because you sort of straddled the calendar year, are you assuming that price goes flat at some point in your framework methodology?\n\nKristen Actis-Grande -- Chief Financial Officer\n\nYeah. Dave, a few thoughts. First, we didn't break down the growth, and it does kind of vary whether you're at the low end of the framework or the high end, and that's because of the assumptions around price and what you get price carryover I think it's definitely fair to assume we'd be targeting that 400 basis points of share gain regardless of where IP falls. And then there would be potentially some upside to perhaps share gain volume assumptions.\n\nThe -- I think the second part of your question was on whether or not price cost went flat in the year. Did I catch that right?\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nYes.\n\nKristen Actis-Grande -- Chief Financial Officer\n\nYeah, it does not. So we're still price positive for the year. We're expecting not to flip to a headwind in that regard until fiscal '24 based on everything that we're seeing right now and the timing of the costs roll off from the balance sheet.\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nGot it. OK. And then just one small one here. In your segment breakdown or your customer breakdown, you reallocated some previously other non-manufacturing customers.\n\nI think it looks like a lot of them landed in heavy manufacturing. I'm confused by that. Could you just talk about what the definition change to other was?\n\nKristen Actis-Grande -- Chief Financial Officer\n\nYeah, so not so much a definition change to other. But happened there, Dave, is we have a process where we use a third party to help us account for which of those segments our customers fall into. And a lot of times, it's kind of difficult to attribute them to one or the other because, as Erik mentioned before, you have oftentimes like job shop coming in, you don't necessarily know where to apply them. So we actually have a manual process that happens.\n\nLike after the third party kind of does its first pass, we go in and we say, OK, where do we actually think the best end market or segment is to attribute this customer to. And we've basically gotten backlog this year with the number of new customers that have come in, and we did a big kind of process improvement on that in the fourth quarter, and that's why you saw that shift out of other and into the other bucket. So we feel pretty good about the change that we made and the ability to do that on a much more regular basis going forward.\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nOK, got it. All right. Thank you. See you in a couple weeks.\n\nKristen Actis-Grande -- Chief Financial Officer\n\nTake care.\n\nErik Gershwind -- Chief Executive Officer\n\nThanks, Dave.\n\nJohn Chironna -- Vice President of Investor Relations and Treasurer\n\nThanks, Dave.\n\nOperator\n\nAnd our last question today comes from Ken Newman with KeyBanc. Please go ahead.\n\nKen Newman -- KeyBanc Capital Markets -- Analyst\n\nHey. Good morning, guys.\n\nJohn Chironna -- Vice President of Investor Relations and Treasurer\n\nHey, Ken.\n\nErik Gershwind -- Chief Executive Officer\n\nGood morning, Ken.\n\nKen Newman -- KeyBanc Capital Markets -- Analyst\n\nI just had a clarifying question on price. From a price perspective here, maybe just any color on how much of sales growth guide for this year, the carryover effect from the price increases you enacted last year?\n\nKristen Actis-Grande -- Chief Financial Officer\n\nKen, I think you're...\n\nJohn Chironna -- Vice President of Investor Relations and Treasurer\n\nCan you repeat that? \n\nKristen Actis-Grande -- Chief Financial Officer\n\nYou're a little bit hard to hear. It's kind of breaking up a little bit.\n\nKen Newman -- KeyBanc Capital Markets -- Analyst\n\nYeah. I was just asking, within the sales growth side, any color on how much that is the carryover effect from increases that you enacted last year?\n\nKristen Actis-Grande -- Chief Financial Officer\n\nYeah. So we didn't give a specific range on that comp. But the way I'd tell you to think about it is if you go back and look at the timing of the price increases in '22, you're still getting a healthy benefit from price, like if you kind of think sequentially through the year, I'd expect price to be peaking in the first quarter based on the timing and the amount of those increases that went into effect in '22. And then because of the price carryover, which is pretty healthy at the low end of the framework you should assume a disproportionately higher contribution from price and at the high end of that.\n\nKen Newman -- KeyBanc Capital Markets -- Analyst\n\nGot it. And then you're -- for my follow-up, you're expecting a pretty strong free cash flow this year, and you've already done a few deals in the last few quarters. Maybe talk a little bit more about the M&A funnel expectations for more deals this year?\n\nErik Gershwind -- Chief Executive Officer\n\nYeah. Ken, and happy to do that. And maybe what I'll do is even zoom out a bit from M&A and just to our capital allocation philosophy in a fairly unique time. Look, so we're sitting -- we feel very good about our position right now.\n\nWe're sitting at plus or minus a turn and half of leverage, which is a comfortable spot for us. What I would say is, this year, more than others, given what's happened with interest rates, we're going to be really scrutinous about how we use cash. Look, priority one remains reinvestment into the core business, which we're pleased. We've got some areas we've highlighted that we think are really working.\n\nWe're pleased there. Priority 2 is going to be continued steady growth of the ordinary dividend. And then we've got three things on our mind in terms of what we do with excess free cash flow that we expect to generate. And those three are debt reduction, share buyback and M&A.\n\nAnd we're going to look at all three and evaluate returns carefully. What I would tell you with respect to M&A, Ken, is what you're seeing us do as part of our strategy here, we've built out a couple of platforms that really fit into our brand of being on the plant floor, technical and high touch. Obviously, metal work can be the roots of the business, the C-Part consumables or CCSG business being a second platform and OEM Fasteners being a third. What you saw us do in the last quarter was tuck-in deals.\n\nSo relatively small compared to company size into those platforms. And I think if you see us do M&A this year, it will be a continuation of that theme, which will be relatively small and tuck-ins to existing platforms. So given the current environment, I would not expect us, I mean, you never say never again, but the hurdle would have to be really high to do something big and really high to do something that's outside of one of those core platforms.\n\nKen Newman -- KeyBanc Capital Markets -- Analyst\n\nRight. Maybe just one more follow-on to that. I mean, maybe a little bit more color on how you think about -- how do you expect operating margins that you once discussed here, do you expect that the margin profiles for Tower and Engman-Taylor is kind of get [Inaudible] or any color in terms of where you expect that?\n\nErik Gershwind -- Chief Executive Officer\n\nYeah, Ken, you were breaking up a little, but I think we'll spit back your question here, tell us if we get it right is where you're going is the margin profile on the small -- on the tuck-in acquisitions and how it performs over time. If I've got that right, typically, it's very typical what we see with a smaller distributor that their gross and operating margins are going to be well below MSCs to start. And that's very typical of the industry. And so what happens is out of the gate year 1, as Kristen highlighted in our margin framework, you see an immediate dilution effect to margin percentages.\n\nWhat happens over time though is we have a great opportunity to lift those margins, both gross margins and operating margins with all the synergy cases. And those are purchasing synergies, those are cross-selling synergies, those are all kinds of cost synergies like freight opportunities and things to take advantage of MSC scale. And so what we see is the incremental margins, once we own the business, the incremental margins are actually quite good. and we can get those businesses really to grow, maybe not quite to MSC level company average margins, but well above where they are today.\n\nAnd so the deal economics actually become really good, especially when we're looking at return on capital, as we highlighted, we should be above WACC within first full year. They're pretty compelling.\n\nKen Newman -- KeyBanc Capital Markets -- Analyst\n\nAppreciate it. Thanks.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to John Chironna for any closing remarks.\n\nJohn Chironna -- Vice President of Investor Relations and Treasurer\n\nThank you, Andrew. A quick reminder that our fiscal '23 first quarter earnings date is now set for January 5, 2023. And over the next few months, we'll be attending several investor conferences, so we look forward to seeing you in person. Thanks, again, for joining us today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Chironna -- Vice President of Investor Relations and Treasurer\n\nErik Gershwind -- Chief Executive Officer\n\nKristen Actis-Grande -- Chief Financial Officer\n\nRyan Merkel -- William Blair and Company -- Analyst\n\nSteve Volkmann -- Jefferies -- Analyst\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nKen Newman -- KeyBanc Capital Markets -- Analyst\n\nMore MSM analysis\n\nAll earnings call transcripts"
}