{
  "companyName": "Medtronic",
  "companyTicker": "MDT",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/medtronic-mdt-q1-2023-earnings-call-transcript/",
  "content": "Medtronic (MDT -0.12%)\nQ1 2023 Earnings Call\nAug 23, 2022, 8:00 a.m. ET\n\nRyan Weispfenning\n\nGood morning, and welcome to Medtronic's fiscal year 2023 first quarter earnings broadcast. I'm Ryan Weispfenning, vice president and head of Medtronic investor relations. I'm inside one of our Medtronic mobile labs, which is making a stop here at our operational headquarters in Minneapolis. These high-tech mobile classrooms will give about 5,000 U.S.\n\nclinicians every year the opportunity to train on some of our most advanced state-of-the-art technology, including our O-arm and StealthStation. As you can see, it's on 18 wheels. Our fleet of mobile lab trucks allows us to play big, literally, as they traverse the United States. In fact, with over 200 stops planned this fiscal year, they're likely coming to a hospital near you.\n\nNow before we go inside to hear our prepared remarks, I'll share a few details about today's earnings broadcast. Joining me are Geoff Martha, Medtronic chairman and chief executive officer; and Karen Parkhill, Medtronic chief financial officer. Geoff and Karen will provide comments on the results of our first quarter, which ended on July 29, 2022, and our outlook for the remainder of the fiscal year. After our prepared remarks, the executive VPs for each of our four segments will join us, and we'll take questions from the sell-side analysts that cover the company.\n\nToday's program should last about an hour. Earlier this morning, we issued a press release containing our financial statements and divisional and geographic revenue summaries. We also posted an earnings presentation that provides additional details on our performance. The presentation can be accessed in our earnings press release or on our website at investorrelations.medtronic.com.\n\nDuring today's program, many of the statements we make may be considered forward-looking statements and actual results may differ materially from those projected in any forward-looking statement. Additional information concerning factors that could cause actual results to differ is contained in our periodic reports and other filings that we make with the SEC, and we do not undertake to update any forward-looking statement. Unless we say otherwise, all comparisons are on a year-over-year basis and revenue comparisons are made on an organic basis, which excludes the impact of foreign currency and revenue from our recent acquisition of Intersect ENT. References to sequential revenue changes compared to the fourth quarter of fiscal '22 and are made on an as-reported basis, and all references to share gains or losses refer to revenue share in the second calendar quarter of 2022 compared to the second calendar quarter of 2021, unless otherwise stated.\n\nReconciliations of all non-GAAP financial measures can be found in our earnings press release or on our website at investorrelations.medtronic.com. And finally, our EPS guidance does not include any charges or gains that would be reported as non-GAAP adjustments to earnings during the fiscal year. With that, let's head into the studio and hear about the quarter.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nHello, everyone, and thank you for joining us today. We reported our Q1 results this morning, and the quarter played out largely as expected. Our organization executed to deliver revenue ahead of our guidance and EPS that was in line with our guidance. Macro factors that we discussed with you and forecasted over the past few quarters, like supply chain, inflation and foreign exchange, along with difficult comparisons to the prior year, caused our revenue and EPS to decline.\n\nAt the same time, there were several bright spots in the quarter across our businesses, including strength in pacing, cardiac surgery, U.S. core spine, neurovascular, diabetes in Europe, and strong overall growth in many emerging markets. And as we look to the future, we have several near-term pipeline catalysts approaching that will accelerate growth. We're also making progress on our initiatives around quality and operating improvement.\n\nAnd in an uncertain economy, our business is well-positioned with our robust balance sheet, strong and growing dividend and leadership positions in many secular growth healthcare technology markets. So taking a closer look at our Q1 results, as expected, acute supply chain disruptions impacted our performance. Most notably, our Surgical Innovations business. We saw improvement in areas like packaging and resin supply as we progressed through the quarter.\n\nWe also continue to manage semiconductor shortages across our businesses to minimize their impact on product availability, as well as our financial results, and we're expecting these chip shortages to linger throughout our fiscal year. Overall, our operations teams have executed and worked closely with our suppliers to minimize impact, improving our order backlogs as we exited the quarter. We expect our overall supply chain issues to continue to improve as we move through the fiscal year. On the demand side, we're still seeing impacts to procedure volumes due to health professional labor shortages.\n\nAnd COVID is still causing procedure cancellations and deferrals in some pockets around the world. We see our hospital and physician customers are doing all they can to manage these dynamics. So while procedure volumes in most of our markets remain at pre-COVID levels, we do have certain procedures or geographies where volumes are still lagging. Turning to market share.\n\nThis is an important metric at Medtronic and is part of our annual incentive plan, along with revenue growth, profitability and free cash flow. And when we look at our quarterly market share performance, acute product availability challenges impacted our share capture opportunities in certain businesses, including surgical innovations and high-power CRM implants. We're also facing some competitive pressures in pelvic health and in diabetes, predominantly in the U.S. We're making good progress on the acute product availability issues and have pipeline plans in place to address competitive pressures over time.\n\nNow let me highlight some of our bright spots. In CRM, our pacing business continues to outperform the market as our Micra leadless pacemaker family is driving strong growth around the globe as we enter new geographies and expand penetration in existing markets. Micra grew 15% in the quarter, including high 70s growth in Japan, mid-teens growth in Western Europe, and high 30s growth in emerging markets. In CST, we had a good quarter in U.S.\n\ncore spine, which grew 4%. We won market share on the strength of our overall portfolio, including our UNiD AI-enabled surgical planning platform and patient-specific implants, which had strong double-digit sequential growth in our U.S. user base. In addition, our recently launched Catalyft PL spinal system designed to target the TLIF and PLIF markets drove meaningful results in Q1.\n\nAnd the breadth of our enabling, imaging, navigation and robotic technologies is a key differentiator. In our neuromodulation business, we are gaining initial implant share in both pain Stim and DBS. In pain stim, the market continues to gravitate toward our Vanta recharge-free and Intellis with DTM rechargeable neurostimulators. And in DBS, customers value the differentiated sensing capabilities of our Percept PC system with our SenSight directional lead.\n\nIn diabetes, we continue to see significant growth in markets outside the U.S. due to the increasing user base of our MiniMed 780G insulin pump, combined with our Guardian 4 sensor. The increase in this user base over the past couple of years is now driving significant recurring revenue growth for our CGM sensors and other supplies. In markets outside the U.S.\n\nwere launched, the 780G and our Guardian 4 sensor has a very positive user experience with no finger sticks and more time and range. Now this is due to its near real-time basal insulin and auto correction boluses every five minutes to address underestimated carb counts and occasional missed mealtime boluses. Now let's move to our product pipeline, where we're advancing several meaningful technologies that can create new markets, disrupt existing ones and accelerate our growth. We continue to execute on our pipeline, having received over 200 regulatory approvals in the U.S., Europe, Japan and China over the past 12 months.\n\nAnd looking ahead, we have several near-term pipeline catalysts approaching that we expect will enhance the weighted average market growth rate of Medtronic. Now starting with our cardiovascular portfolio and transcatheter valves. The limited U.S. market release of our Evolut FX valve is receiving an overwhelmingly positive customer reception.\n\nAnd we're excited about the impact this next-gen valve can have as we move to full market release this fall. Evolut FX enhances ease of use and provides implanters with greater precision and control during the procedure, and it maintains all the industry-leading hemodynamic and durability benefits of the Evolut platform. When you combine the FX launch in U.S., PRO+ launch in Europe and Evolut PRO launch in China, we feel really good about the opportunities in our TAVR franchise around the globe. TAVR is one of the largest growth drivers for Medtronic, and we expect the market, which is roughly $5.5 billion today, to exceed $7 billion within the next three years and reach $10 billion in the next five years.\n\nIn cardiac rhythm management, we're really looking forward to disrupting the single-chamber ICD market with our AURORA extravascular ICD. Now as you may know, one of our competitors has had a subcutaneous ICD in the market for many years, but it's remained a niche device given its limitations compared to conventional ICDs. With AURORA, we've created a true game changer where the electrophysiologist and the patient don't have to make trade-offs. It will deliver the benefits of a traditional ICD, including having the same size, battery longevity and ability to use proven antitachy pacing in lieu of delivering a painful shock to terminate life-threatening arrhythmias.\n\nAURORA does all of this without having to place leads inside the heart. Our EV-ICD global pivotal data will be presented this weekend in a late-breaking session at the ESC Congress in Barcelona. We're also awaiting CE Mark approval for AURORA, and we expect U.S. approval next calendar year.\n\nIn renal denervation, our breakthrough procedure to treat hypertension, we're nearing completion of the six-month follow-up for the full cohort of patients in our SPYRAL HTN-ON MED study. We'll then analyze the data and plan to present the findings in the next few months. This data will complete the final piece of our clinical module submission to the U.S. FDA as every other module has been submitted, reviewed and closed.\n\nThe data on our simplicity blood pressure procedure is robust, including strong pivotal trial results and compelling real-world registry data from over 3,000 patients. And more recently, data has been presented that show already in-patient spend nearly double the time and target blood pressure range through three years than those who received a sham procedure. This could have a profound effect on public health through the reduction of cardiovascular events, including stroke, heart failure, and CV mortality. And we expect to be a leader in this market, which we project to exceed $500 million by calendar year 2026 and $2 billion to $3 billion by 2030.\n\nMoving to our medical surgical portfolio, which includes surgical robotics. We continue to execute on the limited market release of our Hugo robot. We're installing new systems and collecting clinical data in approved geographies, enhancing the system based on surgeon feedback, improving supply chain resiliency and scaling manufacturing production. Feedback and demand continue to be very strong.\n\nWe've made progress over the last quarter, and we're nearing the start of the U.S. IDE clinical trial for our urology indication. We also continue to increase our user base of Touch Surgery Enterprise, our AI-powered surgical video and analytics platform. With Touch Surgery Enterprise, surgeons can now easily review film from their surgeries to continuously improve and advance patient care.\n\nOverall, when it comes to surgical robotics, we're investing heavily to become a major player in the market for the long term, leveraging our decades of experience and leadership in minimally invasive surgery. Now turning to our neuroscience portfolio. In neuromodulation, we've submitted our inceptive ECAPs closed-loop stimulator. We expect inceptive's closed-loop therapy, which optimizes pain relief for patients to revolutionize the SCS market.\n\nWe're also continuing to ramp our commercial activities to go after the diabetic peripheral neuropathy opportunity with our first cohort of DPN market development reps now trained. We believe DPN is one of the largest opportunities in med tech, and we expect the market to reach $300 million by FY '26 with an annual total addressable market of up to $2 billion. In diabetes, we're in active dialogue with the FDA on our regulatory submission for the MiniMed 780G with the Guardian 4 sensor and we remain focused on resolving our warning letter. We're making good progress on our warning letter commitments.\n\nWe've completed more than 90% of the actions we committed to the FDA. This represents substantial progress toward resolving the warning letter and preparing for reinspection. In our CGM pipeline, we submitted our next-generation sensor, Simplera for CE Mark. Simplera is disposable.\n\nIt's easier to apply, and it's half the size of Guardian 4. The Simplera file is ready to submit to the U.S. FDA, and we're waiting to submit it as we're prioritizing the 780G Guardian 4 review. And with regards to our overall diabetes pipeline, we're making considerable investments well above our corporate R&D average.\n\nWe have a comprehensive pipeline of multiple next-gen sensor and pump programs, including patch pumps. This pipeline gives us confidence that we can restore strong growth to our diabetes business over the coming years. With that, I'll turn it over to Karen to discuss our first quarter financial performance and our guidance. Karen?\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nThank you, Geoff. Our first quarter organic revenue exceeded guidance, decreasing 3.6%. Adjusted EPS of $1.13 decreased 17%, in line with our guidance range. As we outlined on our last earnings call, we faced acute supply chain challenges in the quarter, particularly in our surgical innovations business.\n\nWe also faced tougher underlying growth comparisons, including both strong ventilator sales and good procedure recovery following the third wave of COVID last year. Looking at our results from a geographic perspective, our U.S. revenue declined 9% and our non-U.S. developed and emerging markets both grew 2%.\n\nOur emerging markets growth was impacted this quarter by China, which declined 9% given COVID lockdowns and volume-based procurement. However, our teams drove strong growth in many other markets, including high teens growth in South Asia and Latin America, mid-teens growth in the Middle East and Africa, and low double-digit growth in Southeast Asia. And when you exclude China, our emerging markets grew 13%. Turning to our margins.\n\nOur adjusted gross margin declined 230 basis points. The impact of the strengthening dollar drove 50 basis points of the decline, and the rest was primarily due to inflation on labor and materials, as well as freight, given fuel surcharges and increased expedited shipments. As we said at the beginning of the year, we expect the impact from inflation and currency to continue to negatively affect our gross margin in the quarters ahead. I want to remind you, when you look at our R&D line, we had a recast of last year's IP R&D that we told you about last quarter.\n\nWithout that recast, adjusted R&D expense would have grown 4% as we continue to prioritize investment into development programs across our businesses. While our operating margin declined 320 basis points on lower revenue and gross margin pressures, we do expect to show sequential improvement as our revenue growth accelerates through the year. And our balance sheet remains strong, allowing us to invest in future growth and return capital to shareholders. We continue to target returning a minimum of 50% of our free cash flow to our shareholders, primarily through our strong and growing dividend.\n\nAnd we supplement these returns through opportunistic share repurchases. This past quarter, we repurchased $336 million, which is on top of the $2.5 billion we repurchased last fiscal year. We also continue to put the cash on our balance sheet to work, investing in tuck-in acquisitions and minority investments that help fuel our near-term and future growth. We closed Intersect ENT in the quarter, and we also began the structured acquisition of the Acutus left-heart access portfolio and expect to begin distribution by the first half of calendar '23.\n\nTheir advanced Transseptal Access Systems will be an important part of our broad offering to electrophysiologists and interventional cardiologists. Last month, we announced a co-promotion agreement and path toward acquisition with CathWorks. We're excited to partner with CathWorks and promote their innovative FFRangio System, which we believe can disrupt the traditional FFR market. We believe that Medtronic can add a lot of value to the technologies that we acquire, and we expect tuck-ins to supplement our organic R&D investment and long-term growth acceleration.\n\nNow turning to our guidance. With one quarter behind us, we are maintaining our full year revenue guidance at 4% to 5% organic, which excludes currency movement and revenue from our Intersect ENT acquisition. If recent exchange rates hold, foreign currency would now have a negative impact on full year revenue of $1.4 billion to $1.5 billion, an increase of $400 million over the past quarter. We expect organic revenue growth to improve each quarter, with the second half of our fiscal year much stronger than the first, driven by our expectation that many of the acute supply chain challenges subside and new products drive our growth.\n\nIt's worth noting that we also face increasingly easier comparisons as we go through the fiscal year. By segment and on an organic basis, we continue to expect cardiovascular to grow 5.5% to 6.5%, medical surgical to now grow 0.75% to 2.75%, given increased volume-based procurement in many of the Chinese provinces. neuroscience to now grow 4.75% to 5.75%, given a slightly lower outlook for the neuromodulation market. And diabetes to now decline 3% to 6%, given stronger growth in international markets.\n\nOn the bottom line, we continue to expect non-GAAP diluted EPS in the range of $5.53 to $5.65. Inflation and currency are still creating near-term impacts on our margins, and we've seen inflation on raw materials and freight become larger headwinds over the past quarter. We also continue to execute on initiatives to partially offset these macro impacts, as well as prioritize our R&D investments, to drive future growth. Given these dynamics, and the fact that we are still early in our fiscal year, we would suggest you model closer to the lower end of our EPS guidance range.\n\nOur EPS guidance includes an unfavorable impact of foreign currency, which is approximately $0.17 to $0.22 at recent rates. In the second quarter, we expect organic revenue growth in the range of 3% to 3.5%, implying a strong sequential acceleration driven by improved product availability and the cadence of our launches. Assuming recent exchange rates hold, the second quarter would have a currency headwind between $365 million and $415 million. By segment, we expect cardiovascular to grow 5% to 5.5%, medical surgical to be down 0.25 point to up 0.25 point, neuroscience to grow 5.5% to 6%, and diabetes to be down 3% to 6%, all on an organic basis.\n\nAnd we expect EPS of $1.26 to $1.30, including an FX headwind of about $0.02 at current rates. While our markets are facing challenges, we're focused on identifying ways to offset their impact to our financials, and we are optimistic about our future as we prepare to create markets and realize new opportunities. In addition, I want to take a moment to recognize and thank our employees at Medtronic, who are unwavering in their commitment to deliver life-saving treatment to people around the world. Back to you, Geoff.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nThank you, Karen. Now this last quarter, we made a lot of progress on our aggressive agenda of underlying changes that are needed to ultimately accelerate our growth. With supply chain, it's getting better. And our back orders are coming down, not just because of the external environment, but because of the actions we are taking under Greg Smith's leadership, and I expect these improvements will continue.\n\nWe've co-located our employees with suppliers and are also working closely with sub-tier suppliers. We're managing through the acute issues and making progress on improvements that I'm confident can enhance the resiliency of our end-to-end supply chain. On quality, we've been conducting a large transformation of our quality system over the past couple of years. We're advancing quality in innovative ways, working very closely with our regulators, and this is leading to important progress.\n\nWe're also making progress on our pipeline and portfolio as these two strategies come together to create meaningful growth drivers. We're tucking new products into dependable higher-growth businesses like we did by adding Intersect ENT to our ENT business. We're also broadening the product portfolio of some of our businesses so they can become more meaningful growth drivers for the total company, like our strategy in cardiac ablation solutions. Overall, the path has not been easy, but I'm confident that these fundamental enhancements that we're making in the company, combined with our op model change, culture changes and incentive changes, are positioning us to deliver a higher level of growth that can be sustained.\n\nAnd as we overcome the near-term issues and start to put points on the board with the pipeline, I believe the underlying transformation of Medtronic, all the work that we've been doing over the past couple of years will become increasingly apparent setting up a durable value creation engine to fully capitalize on the mega trends in the healthcare and technology markets, which will benefit all stakeholders. So to close, I want to join Karen in thanking our employees. It's never easy going through change, especially in a challenging macro environment, but our teams have stayed focused and are playing critical roles in helping to alleviate pain, restore health and extend life for millions of people around the globe. Now let's move to Q&A.\n\nWe're going to try to get to as many analysts as possible, so we ask that you limit yourself to just one question and only if needed, a related follow-up. If you have additional questions, you can reach out to Ryan and the Investor Relations teams after the call. With that, Brad, can you please give the instructions for asking a question?\n\nBrad Welnick -- Senior Director, Investor Relations\n\n[Operator instructions] Lastly, please be advised that this Q&A session is being recorded. For today's session, Geoff, Karen, and Ryan are joined by Sean Salmon, EVP and president of the cardiovascular portfolio; Bob White, EVP and president of the medical surgical portfolio; Brett Wall, EVP and president of the neuroscience portfolio; and Que Dallara, EVP and president of the diabetes operating unit. We'll pause for a few seconds to assemble the queue.\n\nRyan Weispfenning\n\nWe'll take the first question from Robbie Marcus at J.P. Morgan. Robbie, please go ahead.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGood morning, everyone, and congrats on the quarter. Maybe I'll ask both my questions upfront in one. The quarter came in a little better than expected, but second quarter guide is lower than where the street was thinking by maybe 0.5%, 0.75% on organic sales growth. So maybe you could walk us through how you're thinking about the cadence of the year.\n\nIt includes a pretty material dollar step-up each quarter. What's driving that? And then also, it looks like you narrowed or lowered a lot of the product segment organic sales growth guidance with diabetes the big offset. Maybe talk to if you're seeing any impact to share from some of the supply issues you had? And what's driving those moderated outlooks on the segment basis? Thanks a lot.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nHi, Robbie. Well, thanks for the question. There's a lot there to unpack. Maybe I'll start and then hand it over to Karen.\n\nI mean, look, I think, look, the quarter played out largely as expected, managing through these macro headwinds and making progress on supply chain issues like resins and packaging. And the procedures largely remain at pre-COVID levels. And we are seeing month-over-month improvement and had a pretty good exit coming out of the quarter. Getting to the remaining three quarters of the year, I mean, one, you see coming out of this first quarter, you'll see some tough comps anniversarying.\n\nI think we grew like 19% in Q1 last year, and we have vents and LVADs, certain tough comps anniversarying there. And then I mentioned earlier, some of these acute supply chain issues, we're starting to put them behind us. I mentioned resins and packaging. We have semiconductors that we're still dealing with across many businesses that will be with us for a little longer.\n\nBut a lot of the acute issues we're starting to put behind us. And then we've got a number, and we'll get -- I'll let Karen get into the specifics of the Q2 versus the second half. But we have a number of nice growth drivers in the second half of the year, like the full market release of Evolut FX and EV-ICD coming as well. And it's -- and there's a whole -- there's a number of other launches as well or even existing products that are out there that pick up momentum, and the cadence as they go through the three quarters.\n\nMaybe I'll turn it over to Karen to provide a little more details on that.\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nYeah. Thanks, Geoff, and good morning, Robbie. So I would add on Q2 that we do also expect some modest improvement in underlying procedural fundamentals. For example, we expect China procedures to come back.\n\nAnd we had some cardio procedures that were slightly impacted from contrast supply last quarter, that we expect to come back. We also continue to factor in the potential for incremental pressure from volume-based procurement in China, including a potential national VBP tender in spine and continued provincial tenders in SI. But just an important reminder, in Q2, we do have much easier comparisons versus the prior year. We grew only 2% last fiscal year, and that was given the impact of the Delta variant and some labor shortages on procedure volumes.\n\nSo then as we move into the back half of the year, Geoff mentioned the exciting product launches that we have and the continued improvement in our acute supply chain challenges. And then I would also just note that our year-over comparisons continue to get easier from where they were in Q2. We had roughly 1.5% growth in Q3 and Q4 last year. And we also have the vent headwind easing in the back half.\n\nAnd in terms of what's going on with our portfolios and the diabetes offset, yes, we did see greater strength in diabetes in this quarter, particularly in international growth, and we expect that to continue. And then we're just being overall prudent with our guidance. We think it's early in the fiscal year. We've still got a lot of macro uncertainties, particularly with inflation and freight.\n\nAnd so again, we just wanted to be prudent. I hope that helps.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nYeah. Thank you very much.\n\nRyan Weispfenning\n\nThanks, Robbie. We'll take the next question, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nOK. We'll take the next question from Vijay Kumar at Evercore ISI. Vijay, Please go ahead.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nHello, guys. Congrats, and thanks for taking my question. Geoff, I had two product-related questions, maybe one on Ardian and one on the robot. Ardian, can you just talk to us and when can we expect this data? I think you said it's in the upcoming months.\n\nIs that going to be a headline press release? Will that be a formal presentation at a conference? Is there any chance that the FDA looks at the data and could hold an ad comm? Or any sense on what we can expect from Ardian?\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nSure. Thanks for the question. Well, I'll start by saying -- I think I may hand over to Sean here for the answer on this one. But we're, as you've seen over the last couple of months and a number of conferences, more and more data is coming out.I saw you did an interview or whatever, a session with the KOL in the space, and it was good to hear his feedback.\n\nSo there is a lot, more and more data emerging, more and more physician excitement and confidence as they -- our sites, our trial sites have been working with these patients for quite a long time, and the data continues to build and be super positive. So we're optimistic. And Sean's pointed this out before, the FDA has done their own kind of patient preference studies, and it's clear to them that patients prefer this to medical management. So I know that they're looking for this to hit the market as well.\n\nBut the specifics on your questions, I'll open up to Sean here to answer those on the timing of the data and will we have an ad comm or what have you.\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nSo, Vijay, we finished enrollment and then a six-month endpoint to get to, which will be ramping up very, very shortly, and we target the -- whatever comps we have this fall, which was most likely in the AHA. So we'll submit to AHA. And if it gets accepted, that would be the place that we'd see the results. Now we'd also publish those results and make the top line available in that same period of time.\n\nAnd that is -- just a reminder, that is the last part of what we've submitted, right? So every other module has been reviewed and closed. It's just the clinical data that's outstanding. So we're as close as we've ever been.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nGot you. And then Geoff, maybe one on the surgical robot. I thought the prepared remarks, the commentary was pretty bullish. And correct me if I'm wrong, I saw a healthy order book, momentum with installations, key supply chain challenges have been addressed, U.S.\n\nIDE about the store. This feels like a change in tone versus the last call. So perhaps can you comment on what's changed in the last three months?\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nSure. And I'll have Bob chime in as well. But yes, this quarter was a big quarter for us as we made, I think, quite a bit of progress on some of the supply chain concerns that we had, in some cases some specific issues that we had to resolve and building our manufacturing capacity as well ahead of the U.S. IDE and more importantly, expanded sales in Europe.\n\nWe had a number of installs and continue to get good feedback. And the surgeon feedback continues to be really strong. And I actually had a chance to meet with a number of our surgical innovations reps, sales reps. And I was asking them, like what are you hearing from your surgeons? I was pleased with what I heard.\n\nAnd there's a lot of -- the word is out. They like the design. They like the approach we're taking to the market. And they realize that when we launch, we won't have all the indications yet, and we're going to be building out our instrument on the number of instruments we have with it, but they want to be part of this journey with us.\n\nSo I think the expectations are appropriately set. We built out some manufacturing capacity. And like I said in the commentary, we are real close to this U.S. IDE.\n\nAnd so I don't know, Bob, what do you want to add to that?\n\nBob White -- Executive Vice President and President of the Medical Surgical Portfolio\n\nYeah. No, thanks, Geoff. And Vijay, thanks a lot for the question. And I think you're right to characterize we're making solid progress with our surgical robotic ecosystem.\n\nAnd we really do think about it as an ecosystem with really good progress with touch surgery as well. But as Geoff mentioned, our Hugo installations continued in the quarter. We liked it if they accelerated as we closed the quarter as well. And as I've spoken on previous calls, we were really focused on hardening our supply chain and our operations performance, and we've seen progress there.\n\nAnd then third, we continue to train surgeons across the globe and across multiple specialties, and so solid progress there. So we're near the start of our IDE, and so we believe we continue on track. So thanks, Vijay, and thanks, Geoff.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nThanks, guys.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nYeah. Bob mentioned the touch surgery. That's another big piece here with this ecosystem. That's something we learned in the spine space, how important it is to have not just the robot, but the all-enabling technologies around it.\n\nWe're starting to use -- customers are starting to use touch surgery with Hugo now and surgeons are impressed with the kind of analytical capabilities and the benefits of the secure video storage and sharing for case review and training and whatnot. So the ecosystem for our soft tissue robot is coming along nicely, as Bob mentioned. So there's definitely some excitement on our end.\n\nRyan Weispfenning\n\nThanks, Vijay. Next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nThe next question comes from Travis Steed at Bank of America, Global Research. Travis, please go ahead.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking the question. So Geoff, I'll start with the portfolio management, portfolio stuff. It's been about 8 months since you started highlighting that.\n\nI didn't know if that was something we could see in FY '23. And it seems like you're highlighting solving for your weighted average market growth rate more than other variables at this stage of the process. And then, Karen, a quick follow-up on something you said earlier. I think you said exiting the quarter with better momentum.\n\nSo curious if you could comment a little bit on some of the August trends, and there's been some concern with investors about vacations and stuff like that. So would love to get any color on August.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nOK, yeah. Thanks for the question, Travis. Yeah, we're definitely continuing to look at the whole portfolio more intently, and we've been doing that for several months now, as you mentioned. And look, I'll start by saying, look, we're really deeply committed to doing the right things for shareholders and all Medtronic stakeholders.\n\nAnd when we're looking at this portfolio and capital allocation, we are talking about both the buying and the selling side and actively looking at, as you pointed out, portfolio management to really improve our weighted average market growth rate, whether it be through addition or subtraction and to make sure that the growth is more durable. So look, we're making -- we made -- we're making a lot of progress on the approach here to look strategically at each business. And last quarter, we -- I'll remind you, we did announce an initial step on the subtraction side of things with the Renal Care Solutions JV with DaVita, but this process will be a continuous process. I just want to also set that expectation and will play out over time.\n\nSo the goals are unchanged. The process continues. And like the goal is this durable growth. So it's a lot easier to grow when your weighted average market growth rate is increasing as well.\n\nAnd I'll leave it at that and turn it over to Karen for the other question.\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nYeah. Thanks, Travis. We did exit the quarter with better momentum. We saw a reduction in our backlogs.\n\nWe saw continued improvement each month of the quarter. And as we look at August, it's still early. And we do have -- we're still managing through some supply issues in some of our businesses. So the numbers are a little cloudy.\n\nBut when we took that into account in our guidance and when we look at the operating units that are not impacted by supply issues through the first three weeks of August, we're trending largely in line with the second quarter of last year. So seeing continued momentum and improvement.\n\nRyan Weispfenning\n\nThanks, Travis. Take the next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nThe next question comes from Cecilia Furlong at Morgan Stanley. Cecilia, please go ahead.\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nGood morning, and thank you for taking the question. I wanted to ask about the diabetes business, the updated guidance for the year. Obviously, OUS came in stronger. But just what you're expecting now, both OUS, but then also in the U.S.\n\nfrom competitive pressures? And then I wanted to follow up. It sounded like your timing for submission of Simplera shifted your strategy there. Just if you could comment on how you're thinking about the cadence of submission. Thank you.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nSure. Well, thanks for the question, Cecilia. Yeah, I mean, look, diabetes, as mentioned and Karen mentioned it in her comments, I mean, we're seeing really strong growth in -- outside the U.S. and Europe in particular.\n\nAnd more -- even more importantly than that, the quarterly growth, it's the clinical results we're seeing in patients and the feedback on the patient experience is really positive with the 780G plus Guardian Sensor 4 system. So that, we think, bodes well for the franchise and what we'll see when we get it into the U.S. because we're competing with everybody there in Europe. And you had a couple of specific questions.\n\nAnd the other thing I'll say is, look, we -- this is a business that -- I got a lot of questions when I first became CEO two years ago about what we're going to do. We doubled down on investment. We believe that the integrated insulin delivery system that we have with the sensors, the insulin delivery device. And right now, for us, it's a durable pump and down the road with the pen and then, and hopefully a patch, we think is -- we've got -- in our market-leading algorithms, we think we've got a very sustainable position in a high-growth market that has high barriers to entry.\n\nAnd we've been powering through, and these results in Europe are very encouraging. On top of that, we recently had a -- the transition from Sean to Que. And Sean did a great job stabilizing this business and really focusing it where we have a competitive advantage and helping really focus our product road map. Que's picking it up from there.\n\nThey had a great transition. And with that, maybe I'll introduce Que Dallara, who's been with us now 14, 15 weeks and is already having a big impact on not just diabetes, but on the leadership team at Medtronic. And it's a delight to be working with her. And why don't I introduce Que and welcome her to her first earnings call.\n\nQue?\n\nQue Dallara -- Executive Vice President and President of the Diabetes Portfolio\n\nThanks, Geoff. Yeah, I would say the transition with Sean has gone really well, and I'm really encouraged with the progress we're making on restoring this business to growth, as well as innovation road map. And to address your two specific questions around what we see in the U.S., as well as around Simplera, I would say that, look, our short-term focus is remediating the warning letter and also making progress with the FDA around approval of the 780G and Guardian 4 sensor system. We continue to be encouraged by that, making good progress.\n\nAnd so our hope is that we can remediate that and secure approval in the near term. Now -- but we're not standing still. In the U.S., we do see growth in our 770G system, as well as our InPen technology. And not only that, we are very close to launching the extended-wear infusion set, which has been approved by the FDA for up to 7 days wear and this is a game changer for patients.\n\nIt's probably the biggest innovation we've seen in the last 20 years in this area and allows patients to be able to synchronize, if you like, their sensor CGM changes with the infusion set changes, leading to better site recovery and the comfort for our customers. So that's happening. We obviously anticipate 780G, but we're not standing still with respect to the products that we do have approved in the U.S. And with regards to Simplera, I mean, we're very excited about this product.\n\nIt's half the size of the Guardian 4 sensor. It's thinner. We've submitted a CE Mark in July as we said we would. It is ready to go for submission in the U.S.\n\nBut we are -- we remain focused on prioritizing the efforts around the warning letter, as well as 780G approval.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nOK. Thank you, Que.\n\nRyan Weispfenning\n\nThanks, Cecilia. Next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nYeah. The next question comes from Larry Biegelsen at Wells Fargo Securities. Larry, please go ahead.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nGood morning. Thanks for taking the question. First, on supply constraints, I think in Q4, you said it was about a $260 million impact. How much was the impact in Q1? What are your expectations for Q2? And are you assuming some catch-up from lost sales? And just lastly, Karen, maybe talk about the FX hedging gain in the guidance now for '22.\n\nI think it was $410 million to $440 million. And how that rolls off in fiscal 2024, how we should think about that? Thanks so much.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nWell, look, thanks for the question, Larry. I'll start on the expectations for Q2 and beyond on the supply chain stuff. Like I mentioned, Q4, Q1 were the most acute for us on these supply chain issues, and I'm definitely glad that we're looking in the rearview mirror on those quarters. We're not out of the -- totally out of the woods yet, but our back orders are coming down.\n\nWe're seeing particular improvement in areas like resins and packaging across the company. A lot of this is a result of us taking well over 100 of our employees and co-located them with our top suppliers to help them prioritize Medtronic, but more importantly, kind of work through, make sure that communication is tight, the planning is tight. And that's really making a difference. The macro market is getting a little better.\n\nI mean, in some of these areas, in particular. I mentioned earlier that semiconductors are still going to be with us for a while, that back order. We're working directly with the semiconductor companies on this. And just across the board also, one of the things we've done, in addition to co-locating our employees with our top suppliers, is going out to -- directly to the commodity or raw material suppliers versus the supplier that's between us and them, if you will, the finisher or the distributor, the middleman, and locking in contracts and getting prioritization, especially given that these products go into medical products and are life-preserving and lifesaving.\n\nAnd in some cases, those raw material suppliers weren't aware of that. So all of this is definitely helping, and we'll continue to see this back order go down over time. As I said, I think we're starting to put the most acute piece of this behind us. In terms of catching up on lost sales, kind of like COVID, we don't put a bolus of lost sales coming through into our guidance.\n\nAnd right now, in particular, as you've seen and heard is, there is kind of a little bit of a governor out there on procedures with the healthcare worker shortage, which has gotten better, but it's still hard for customers to run at 110%, 120% of pre-COVID levels. So because of that, we haven't really baked a catch-up on sales into the guidance. You had some specific quantification questions on, and I'll turn those over to Karen. And Karen, anything else you want to add to the qualitative comments that I made.\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nThank you. I think you covered it well on supply chain. We did say that we expect it to get a little worse before it got better, and that's what happened in the first quarter, but we expect it to get better from here. We do have the supply chain improving, but again, not necessarily a bolus catch-up built into the guide.\n\nIn terms of FX, as you've seen, we've had the strengthening dollar continue to impact our reported revenue, just like it has for many of our peers. We do have foreign currency-based cost of sales and overhead. And now we have foreign currency-based interest expense as well, and those all provided some offset. And as you know, Larry, we also have the benefit of our multiyear currency hedging program, which did produce significant gains, and that resulted in a smaller FX impact to the bottom line in the quarter.\n\nAs we look ahead for FX, I would say, keep in mind, it's only Q1 now. We've got foreign exchange rates that are continually volatile. So we know they're going to move from here. But if we look at next fiscal year, based on recent rates, we would expect the headwind next fiscal year to be similar to the headwind this fiscal year, again, if rates stay the same.\n\nI hope that helps.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nRyan Weispfenning\n\nYeah. Thanks, Larry. Next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nYup. The next question comes from Joanne Wuensch at Citi. Joanne, please go ahead.\n\nJoanne Wuensch -- Citi -- Analyst\n\nGood morning, and thank you for taking the question. Briefly, the -- if revenue is improving quarter over quarter throughout the remainder of the year, do operating margins and gross margins also improve? And I'll just throw my second one quickly. Hugo, what does it take to bring that into the United States? And is there a parameter or a thought process on the timing? Thanks.\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nYeah. Thanks, Joanne. On margins, we do expect margins to improve sequentially through the year as revenue improves. So the answer to that one is yes.\n\nAnd then, Geoff, for --\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nYeah, sure. On Hugo, what does it take to get it to United States? Obviously, you got to start our U.S. IDE, which is set up here. And our -- Bob's mentioned in the past getting our customers, our trial sites ready for that and physicians trained, which we've been working on.\n\nBut Bob, do you want to give some more specifics on that?\n\nBob White -- Executive Vice President and President of the Medical Surgical Portfolio\n\nYou're exactly right, Geoff. It begins with our U.S. IDE that will start the U.S. process.\n\nAnd as we mentioned, Joanne, we're nearing the start of that, but that will be the key milestone that we'll certainly update to guide investors on.\n\nRyan Weispfenning\n\nOK. Thanks, Joanne. Next question, please.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nYeah. The next question comes from Jayson Bedford at Raymond James. Jayson, please go ahead.\n\nJayson Bedford -- Raymond James -- Analyst\n\nGood morning. Just a couple of diabetes questions. It was mentioned that you hope to remediate the warning letter and secure approval for 780G in the near term. Do you have clarity on if you can get approval for 780G while the warning letter is still outstanding?\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nI think the -- thanks for the question. I think the variance path is an option. But as I said earlier, I think our primary priority is to work with the FDA and remediate the warning letter, now focus entirely on doing that. Obviously, we'd love to, we're very eager to launch the product, but we were focused on patient safety, making sure that our remediation plans are robust.\n\nIt's really the first and foremost in our mind that we make those corrective actions. So that's our primary focus. In parallel to that, we are engaged with the FDA on getting the 780G and Guardian 4 sensor system approved. Those -- both those things continue to make progress.\n\nIt's obviously very hard for us to be completely predictive around when those things will happen, but I'm really pleased with the progress that we're making on both of those.\n\nJayson Bedford -- Raymond James -- Analyst\n\nOK. And I apologize if I missed this earlier, but when will you submit Simplera to the FDA?\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nWe will do that as soon as we feel confident that we've made sufficient progress on the warning letter remediation, as well as progress on the 780G. So as you know, we submitted for CE Mark in July, as we said we would. And we just want to make sure that our focus remains on those immediate short-term goals of warning letter remediation and approval for the 780G.\n\nJayson Bedford -- Raymond James -- Analyst\n\nThank you.\n\nRyan Weispfenning\n\nYeah. Thanks, Jayson. Next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nYeah. The next question comes from Steve Lichtman of Oppenheimer & Co. Steve, please go ahead.\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nThank you. Good morning. Geoff, thinking a little longer term. How far along would you say are Greg Smith and his team and making them more durable changes in operations you've talked about in prior calls, and when do you think we could start seeing margin benefits from those initiatives?\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nThat's a great question. Thanks for that one, Steve. They're -- they've made quite a bit of progress in a relatively short period of time. Greg started in April of 2021.\n\nSo it's been a little over a year. In that time, we've -- working with the executive team, we've centralized, if you will, the global operations and supply chain function. This is one of those opportunities in our new model where we're trying to play small and play big at the same time. Certain things have been decentralized into the businesses and the businesses are more empowered, refer to them as operating units.\n\nAnd then certain things, a limited list where we'll leverage our scale or drive -- and/or drive standards. And the supply chain is definitely one of those. So we've made that change, that organizational change, which is probably the biggest organizational change we've made, even more than going to the 20 operating units. And so it's significant.\n\nIn addition, we started to invest in new capabilities. Hiring people from outside the company, outside the industry, and in many cases, that are best-in-class in the various sub functions, if you will, or capabilities within the global operations and supply chain, things like planning, things like factory automation, et cetera. And we've been -- so we've hired quite a few, and I think the majority of Greg's team is new in the last year. And we've been making investments in technology, various different systems on planning and supply planning, demand planning, et cetera.\n\nAnd the No. 1 focus has been resiliency and quality. There's three things we're looking at from this function: resiliency, quality because they have a big impact on quality and over time, cost of goods sold productivity that you're getting to that would be two times or more of what we've seen historically at Medtronic. And so that will play out over time.\n\nWe haven't seen that yet. The other thing you've got a lot going on in there. You've got you've got inflation and things like that that are kind of masking any kind of or overshadowing, if you will, any kind of cost of goods sold productivity that we are seeing. So -- but we will see that over time and we're confident.\n\nBut we haven't quantified the exact timing of it. And like I said, it's been a little kind of hard to decipher here in the short term because of the inflationary impact on our cost of goods sold. I don't know, Karen, do you want to --\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nYeah. Thanks, Geoff, and thanks for the question. We are making a lot of progress in the ops front. And our shorter-term goal is going to be a focus on driving enough cost offset to offset the impacts that we've got, either in pricing or inflation.\n\nWe're not ready to give guidance for next fiscal year, but that's the initial goal just to offset. And then over time, to hopefully more than offset. I would say, Geoff mentioned, too, that this work in operations is not just going to help on the cost of goods sold line, but also on the revenue line, as we can more predictably have products available and get quality issues and better stead. So I think it will help on both.\n\nRyan Weispfenning\n\nOK. Thanks, Steve. Next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nThe next question comes from Rich Newitter at Truist Securities. Rich, please go ahead.\n\nRich Newitter -- Truist Securities -- Analyst\n\nHi. Thanks for taking the questions. Just on spine, I think you guys called out navigation and robotics, it decline. I was hoping you could talk a little bit about what you're seeing there on the funnel, the pipeline and the capital environment more broadly.\n\nAny changes that are taking place in the way you're selling these types of capital items, especially robotics? And then we did see one of your orthopedics robotic competitors talk about changing business models, more rentals, meanwhile, but your direct spine robotics competitor actually saw a sequential pickup in capital purchases. So it would be great to get your color on the capital environment and specifically what's going on in the spine robotics. Thanks.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nSure. Thanks for the question, Rich. I'm going to have Brett Wall, president of neuroscience field that question.\n\nBrett Wall -- Executive Vice President and President of the Neuroscience Portfolio\n\nSure, Rich. Yeah, looking overall, the capital, we have a very extensive ecosystem and capital system within our CST business. And what we saw was extended purchasing times, particularly as we move through to the end of our quarter. Now specifically, as it relates to the technology and the selling models, we have a variety of different approaches that we use.\n\nAnd so we're well-positioned. However, the markets seem to work at hospitals, they are in a mode of preserving cash. We have more opportunities to put forth different models where we actually utilize the implantables and other disposable products as a way of financing this particular capital, and that works very well. We didn't see a significant uptick in our O-arms or StealthStations during the time -- this time with that model, but we saw a little bit of an uptick with Mazor in that particular model.\n\nAnd we think during these times, we'll probably see more of that. The competitor you referenced there, if you look at calendar Q2, per our calculations, we continue to outstrip them in our actual placement and sales of robots. And -- so we continue to do that, and our procedural base there is nearing almost double the amount that they reported in their last earnings call. So we are very well-positioned there.\n\nAnd then the underlying spine business remains pretty attractive. We saw a 4% increase in our core spine business there. So we're pleased with how that's recovering.\n\nRich Newitter -- Truist Securities -- Analyst\n\nThank you.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nYeah. We're really excited about the positioning of our spine business with the recent product launches in the implant side, but the ecosystem that we've built over the last decade and how that's come to bear and how the market is shifting to that ecosystem approach. So we're feeling good about spine as we move forward here.\n\nRyan Weispfenning\n\nYeah. Thanks, Rich. I think we've got time for one more question, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nOur final question comes from Rick Wise at Stifel Nicolaus & Company. Rick, please go ahead.\n\nRick Wise -- Stifel Financial Corp. -- Analyst\n\nThanks, and good morning, Geoff. Hi, Karen. I was hoping, Geoff, just in closing, you'd expand on two of your exciting, I think, pipeline opportunities. You highlighted AURORA, the leadless subcu device.\n\nI was hoping you'd share your latest thinking in terms of the opportunity there. And when you talk about U.S. approval next year, are you saying next calendar year or next fiscal year? And this seems like a major opportunity, I was hoping you could talk about that. And just last, you didn't talk as much this time about the opportunity in pulsed field ablation.\n\nMaybe just update us on your internal Medtronic program and the favored programs and just some timelines on the U.S. trial, follow-up submission and approval timing. Any of that would be great. Thanks so much.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nYeah, sure. Yeah. Thanks for the question, Rick. And those are two topics we like to talk about with -- and I'm going to hand it over to Sean here to give you some details.\n\nBut on AURORA, like I mentioned in the commentary, I mean, this -- we think we can take this segment and shift it from what up to now has been what we would define as somewhat niche-y to a bigger segment. We're talking about $1 billion by 2030. We just don't think you're -- with our AURORA, we don't think you're making -- the physicians or the patients have to make the trade-offs here and you get that traditional impact that we had from attritional ICD with much less invasive approach here. And so I'll turn it over to Sean on that.\n\nAnd then on PFA, you mentioned Affera, and Sean will give you the details between our internal program on PFA and Affera. But again, Affera plus Acutus, it's that whole cardiac ablation solutions business, our Afib business. We think this really rounds out that business. We're anticipating an approval on -- from FTC on the Affera acquisition here.\n\nAnd we'll move forward on that aggressively because it really is a high growth market where we've been a little bit niche-y, I would say. And this would round out that and make this -- that business a real growth driver for the company. But on your specific question, I don't know, Sean, do you want to dive into the -- some of Rick's specifics?\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nYeah, sure. So Rick, as Geoff mentioned in the commentary, today's subcutaneous ICD market is, it's a niche around $300 million, $350 million -- $300 million to $350 million annually. And we think that within 10 years, this could be $1 billion segment. And the reason that it expands is all those limitations of the current device where we can get sort of the benefits of traditional ICD, smaller devices, longer battery life, the ability to pace out of the arrhythmia rather than having to shock out of arrhythmia.\n\nThat's really both that can expand the market, like we saw the leadless pacing. When we went to that, we started picking up new patients that weren't being treated because of the acuity of disease and leads to that strong growth. With regard to timing, we're saying next calendar year, to kind of put a finer point on that, it's the first half of next calendar year is what we're targeting for approval for the U.S. Pulsed field ablation, we have completed the trial, as you know, last November, and that's been in its follow-up period.\n\nSo that would put us for availability of data in the springtime. That's probably one of the most likely to be presented. And of course, the filing of our technology would be at that point in time. As Geoff mentioned, we're waiting the regulatory closure of Affera, and that really expands out the fuller bag.\n\nIt gives us within both RF and pulsed field, point-by-point ablation. And what we have with our own internal PFAs really for the isolation of pulmonary vein sleeve, right? So it's more anatomically based. And then the other catheters that come with Affera would be for point-by-point ablation or for lines of conduction block that you do with a linear catheter. So really nice complementary sort of technologies for PFA.\n\nBut more importantly, where we've been restrained from being able to participate in the full market because we don't control the mapping navigation systems. There's a strong monopoly between two players, Biosense Webster and Abbott, they particularly really control and dominate that field. So that Affera acquisition allows us to have all of our catheters now with mapping navigation really expands the opportunity into that, what is today $8 billion market. Should be, by the time all this stuff rolls out, it continues to grow robustly close to $10 billion, and we'll then fully participate in that market.\n\nSo two really important growth drivers we're excited about, and we're making meaningful progress on both of them.\n\nRick Wise -- Stifel Financial Corp. -- Analyst\n\nThanks, Sean. Thanks, Geoff.\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nYeah. So yeah, just -- and Rick, on this, one in the short term, we'll see a pretty nice uptick in sequential growth going from our Q1 to our Q2, and then see more sequential improvement from there. But the reason we're confident is things like these two areas that you mentioned, along with a host of others, right? Micra continues, as Sean mentioned, Micra, we just hit PFA and what's coming there, and EV-ICD in the cardiac space. But on the call -- and then down the road, Ardian, see the data, the economic impact of that will be a little bit out there beyond this year, obviously, but -- out of this fiscal year, but there's another -- and then you -- that's just in the cardiology area.\n\nWe hit on Hugo on soft-tissue robotics side. I forgot to mention mitral and tricuspid on the cardiac side. There's a lot in cardiology. You got the soft tissue robot.\n\nAnd that whole surgical ecosystem that we're surrounding that with that's way more than the robot. You've got a lot going on in neuroscience. We mentioned the spine surgical ecosystem. And we didn't get any questions on DBS this time with the sensing and the Percept product and the leads that go with it and the closed loop trial that we're doing there.\n\nAnd we talked a little bit about ECAPs and pain. And then shifting, you heard Que talk about diabetes and what we're seeing in Europe with the system now, the 780G and just sending in the Simplera submission into the EU and she gave you the dynamics on when we would do it in the U.S. But there's a lot going on here, and we're excited about it. And the operational issues that we've gone through, not all of them are completely in the rearview mirror.\n\nLike I mentioned, semiconductor shortages. But it's made us stronger. And all this, the changes that we made will become more apparent in the quarters -- the benefits of those changes will become more apparent in the quarters ahead here, and we're looking forward to it for sure. So with that, I think that is all for Q&A, all the time we have.\n\nAnd I just, again, want to thank you for the questions, the engagement. As always, we appreciate your support and your continued interest in Medtronic, and we look forward to updating you on our continued progress that we've talked about here on our next earnings call, our Q2 earnings broadcast, which we anticipate holding on November 22, so just before Thanksgiving. Those here in -- it's just before Thanksgiving. And so with that, thanks for tuning in today, and please stay healthy and safe, and have a great rest of your day.\n\nDuration: 0 minutes\n\nRyan Weispfenning\n\nGeoff Martha -- Chairman and Chief Executive Officer\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nBrad Welnick -- Senior Director, Investor Relations\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nBob White -- Executive Vice President and President of the Medical Surgical Portfolio\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nQue Dallara -- Executive Vice President and President of the Diabetes Portfolio\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nJoanne Wuensch -- Citi -- Analyst\n\nJayson Bedford -- Raymond James -- Analyst\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nRich Newitter -- Truist Securities -- Analyst\n\nBrett Wall -- Executive Vice President and President of the Neuroscience Portfolio\n\nRick Wise -- Stifel Financial Corp. -- Analyst\n\nMore MDT analysis\n\nAll earnings call transcripts"
}