{
  "companyName": "PPG Industries",
  "companyTicker": "PPG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/ppg-industries-ppg-q3-2022-earnings-call-transcrip/",
  "content": "PPG Industries (PPG -0.52%)\nQ3 2022 Earnings Call\nOct 20, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Elliot, and I'll be your conference operator today. At this time, I would like to welcome everyone to the third-quarter PPG earnings conference call. [Operator instructions] Thank you. I would now like to turn the conference over to John Bruno, vice president of investor relations.\n\nPlease go ahead, sir.\n\nJohn Bruno -- Vice President, Investor Relations\n\nThank you, Elliott. And good morning, everyone. Once again, this is John Bruno. We appreciate your continued interest in PPG and welcome you to our third-quarter 2022 financial results conference call.\n\nJoining me on the call from PPG are Michael McGarry, chairman and chief executive officer; Tim Knavish, chief executive officer-elect; and Vince Morales, senior vice president and chief financial officer. Our comments relate to the financial information released after U.S. equity markets closed on Wednesday, October 19, 2022. We have posted detailed commentary and accompanying presentation slides on the Investors Center of our website, ppg.com. The slides are also available on the webcast site for this call and provide additional support to the brief opening comments Michael will make shortly. Following management's perspective on the company's results for the quarter, we will move to a Q&A session.\n\nBoth the prepared commentary and discussion during this call may contain forward-looking statements, reflecting the company's current view of future events and their potential effect on PPG's operating and financial performance. These statements involve uncertainties and risks, which may cause actual results to differ. The company is under no obligation to provide subsequent updates to these forward-looking statements. This presentation also contains certain non-GAAP financial measures.\n\nThe company has provided in the appendix of the presentation materials, which are available on our website, reconciliations of these non-GAAP financial measures to the most directly comparable GAAP financial measures. For additional information, please refer to PPG's filings with the SEC. Now let me introduce PPG chairman and CEO, Michael McGarry.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nThank you, John. And good morning, everyone. I would like to welcome you to our third-quarter 2022 earnings call. I hope you and your loved ones are remaining safe and healthy.\n\nBefore I go into my comments regarding the third quarter, I would like to congratulate Tim Knavish for being appointed president and chief executive officer of PPG effective January 1, 2023 and immediately joining the company's board of directors. Tim has an outstanding track record, having served the company for more than 35 years and leading nearly every PPG business during his career. The board and I have full confidence that Tim will guide PPG to future growth and additional shareholder value. With Tim's appointment, I will become executive chairman on January 1, 2023.\n\nNow let me turn to our financial results. Last evening, we reported third quarter 2022 financial results. For the third quarter, we delivered net sales of $4.5 billion, and our adjusted earnings per diluted share from continuing operations were $1.66. To quickly summarize the quarter, our sales performance was a record, driven by continued realization of real-time price increases that fully offset total cost inflation for the second consecutive quarter.\n\nOn a two-year stack, selling prices are up about 18%. As we communicated earlier this month, these sales and earnings results were lower than our guidance for the quarter as we were impacted by further softening of demand in Europe and less of a sequential economic improvement than expected in China due to the pandemic restrictions in September. In addition, the strengthening of the U.S. dollar lowered sales by about 6% or $265 million, worse than it was originally forecasted. Despite these lower-than-forecasted sales, we did deliver strong performances in several of our businesses, including PPG Comex, which delivered another record quarter.\n\nAlso, our global automotive refinish, traffic solutions, and U.S. packaging coatings businesses each set all-time quarterly sales records in the quarter. Year-to-date, our automotive refinish coatings business has delivered about 1,500 net new body shop wins as customers continued to value the product, technology, and industry-leading services and capabilities that this business delivers every day. In addition, our aerospace business delivered strong double-digit percentage sales growth, volume growth aided by recovering airline travel that is now about 85% of pre-pandemic levels.\n\nWith additional industry recovery, a strong order book, and PPG's advantaged-technology products, we expect this business to continue to grow into 2023 and beyond. We continue to experience improvement in commodity raw material availability. However, certain short supply raw materials impacted our automotive refinish and aerospace coatings businesses, constraining their ability to meet their respective strong order books. Together, these 2 businesses ended the quarter with a $200 million backlog, similar to the end of the second quarter.\n\nImportantly, our year-over-year segment operating margin recovery has begun. This reflects the progress we have made in implementing selling price increases. The third quarter marked the 22nd consecutive quarter of higher selling prices. We expect our margin recovery to accelerate into 2023.\n\nAnd anticipate by the first quarter of 2023, we will fully recover all cumulative inflation from 2021 and 2022. We continue to make good progress executing on our acquisition-related synergies and other cost-savings initiatives from previously announced restructuring program, which delivered about $25 million of incremental benefit in the third quarter. During the quarter, we continue to progress our launch of the expanded pro painter initiative with The Home Depot. Each week, our team is calling on thousands of prospective new customers and delivering new business wins.\n\nIn the third quarter, we also started joint work with the HD supply team to hunt for new paint customers, including in the commercial maintenance area. And while early, this collaboration is yielding results and we expect will be another catalyst for future growth in the U.S. architectural coatings business. Overall, paint contractors are providing us with ongoing positive feedback on the convenience of buying well-recognized PPG pro products at The Home Depot.\n\nCollectively, we continue to see opportunities for significant growth in the coming years. While working capital remains higher than we would like, we made solid progress in the third quarter and began to lower our inventories on a sequential basis. We had been carrying higher-than-historic levels of inventory given supply chain constraints over the past year. But given the broadening elongation of supply globally, we are now able to destock, including reducing or canceling raw material orders and reducing safety stock closer to historic levels.\n\nWe are prioritizing further inventory reductions in the fourth quarter, which will benefit our cash generation. We made modest repurchases of our stock during the quarter and repaid $100 million of debt. We continue to evaluate potential strategic bolt-on acquisitions. Consistent with our past practices, we will deploy cash in the most accretive manner for our shareholders, including some continued debt reduction.\n\nOn the ESG front, I want to highlight yet another example of PPG leading the way. The acquisition of Tikkurila has proved to be very valuable on several fronts, including enhancing PPG's ESG program through the addition of advantaged sustainable solutions that contribute to the circular economy. These include bio-based products and packaging made from 50% to 75% recycled plastic that is also 100% recyclable. Currently, nearly 90% of Tikkurila's products are waterborne, and 48% of the portfolio is eco-label.\n\nWe are leveraging Tikkurila's sustainability approach in our architectural business beginning in Europe. Looking ahead to the fourth quarter, normal seasonal demand trends are expected, including lower sequential sales in most of our architectural businesses and also in our traffic solutions business, where sales historically fall about 50% due to the weather considerations. In Europe, we expect economic conditions to remain weak due to the softening consumer confidence and lower industrial activity related to the significantly higher energy costs and geopolitical issues. In China, we anticipate weaker-than-normal economic activity for the fourth quarter due to continued pandemic-related disruptions and slowing exports to Europe.\n\nPPG's largest factory in China was required to close for the first 10 days of October, and further restrictions could curtail production and commercial activity. One offset important to PPG is we expect automotive OEM builds in China to remain solid and consumer spending to improve into 2023. In general, demand in the U.S. in the huge markets remains solid, and we expect several of our businesses to continue to deliver positive year-over-year sales volume growth.\n\nDemand for architectural DIY and residential new home coatings products in the U.S. is beginning to slow, and industry demand is anticipated to weaken further in the fourth quarter and in the next year's basis leading economic indicators. PPG's exposure to the U.S. new home market is relatively small and a low single-digit percentage of company sales, and our overall exposure to the residential housing market is less than 10% of company revenue. We expect some of the industry weakness to be offset by our growth initiatives with The Home Depot and other customer gains.\n\nRaw materials are expected to remain inflationary with a mid-single digit higher than the prior year but fall modestly on a sequential quarterly basis. We expect supply chain conditions to continue to broadly improve, including better raw material and transportation availability as our suppliers are nearing their 2019 manufacturing and supply capability. As a reminder, we've absorbed about $1.9 billion of raw material inflation since the beginning of 2021. In the fourth quarter, we expect further increases in energy costs, especially in Europe and to some degree in the U.S.\n\nWe will continue to prioritize implementing further real-time targeted selling price increases to mitigate these higher costs. Due to the heightened level of economic uncertainty, we have implemented an additional restructuring program focused on past payback actions targeting $70 million of annualized savings upon full implementation. The program includes several initiatives in Europe, is mostly concentrated on matching our staffing levels with lower demand. As we enter a period of heightened economic uncertainty, we expect our business portfolio to prove more resilient in the coming quarters.\n\nWith continued recovery in the automotive OEM and aerospace coatings businesses, along with demand-stable businesses like automotive refinish and traffic solutions, we believe that more than 50% of PPG's portfolio will remain resilient even if we experience a broader global economic decline. This is noteworthy and positive step change from the prior recession. Also importantly, we expect that our sequential quarterly momentum on operating margin improvement will continue in the fourth quarter as we work back toward our historical margin profile. This will be supported by maintaining our selling prices to reflect the value of the products and services we provide.\n\nWhile economic conditions are challenging in the near term, I remain confident about the future earnings capabilities of PPG as the earnings catalysts that I'd referenced in the past remain fully intact, and we certainly see a path to return to prior peak operating margins with opportunities to exceed them. In closing, as we look to finish the year managing intensifying challenges, I want to thank our team of 50,000 employees around the world who are making it happen by supporting our customers and the communities where we operate. Their dedication even during the most challenging times is inspiring and drives our purpose to protect and beautify the world. Thank you for your continued confidence in PPG. This concludes our prepared remarks.\n\nAnd now, Elliott, would you please open the line for questions?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Christopher Parkinson from Mizuho. The line is open. Please go ahead.\n\nChristopher Parkinson -- Mizuho Securities -- Analyst\n\nThe macro is changing, not necessarily for the better. But per your comments, it doesn't seem like the setup for this recessionary environment aligns with history, which has consequences across fixed asset leverage, end market mix when you're discussing refinish and aero, just the overall margin outlook versus past downturns. Can you just give us sort of overall update of your thoughts here? And potentially, anything on price cost as well? Thank you.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nThanks, Christopher. First of all, I think the most encouraging thing about what we see is that we see continued price increases coming. So fourth quarter, we're still looking at high single digits, low double-digit price increases. So that's gonna be significant.\n\nWe have seen raw materials, they have loosened up in China, they are starting to loosen up in Europe. We are arbitraging what we see in China into Europe, and we expect to arbitrage Europe elsewhere. So these are things that are a little bit different than the last ones. I'll remind everybody by the end of the year, we'll have about $2 billion of raw material inflation, and we still have other inflation.\n\nAnd for the second quarter and third quarter, we covered all total inflation. That includes MRO, freight logistics, labor, you name it. We covered it. Okay? So we feel very confident going into the fourth quarter that we're gonna continue to recover that gap.\n\nBy the end of the year, we will have recovered all raw material inflation. And before the end of the first quarter, we will recover all total inflation. So we're really in good shape from that standpoint. So I'm pleased with what I see, and I think this is gonna be a little bit different recession than last time because we have a strong OEM business and a strong refinish business.\n\nOperator\n\nOur next question comes from Ghansham Panjabi from Baird. Your line is open. Please go ahead. \n\nGhansham Panjabi -- Robert W. Baird and Company -- Analyst\n\nYeah, thank you. And congrats, first off, Michael and Tim. Can you just give us a sense, Michael, on how you see architectural volumes evolving in your 3 major regions of the U.S., Europe, and Mexico as we cycle into 2023? I mean, obviously, DIY has been impacted in the U.S. and Europe.\n\nBut just given the extent of mortgage rate increases and some of the fundamental shifts in housing as well for markets such as the U.S., how are you planning for that evolution of volumes there?\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nGhansham, I'm gonna let Tim take this one.\n\nTim Knavish -- Chief Operating Officer\n\nYeah. Thanks, Ghansham. And first, I want to thank Michael and the PPG board for their trust and confidence as we continue to drive the company forward. I also want to thank Michael personally for his leadership, his personal mentorship of me and, frankly, for setting up PPG with a global portfolio that is well-positioned for future growth and also well-positioned to navigate through today's economic challenges. Excited for this opportunity.\n\nI really look forward to the future and working -- continuing to work with our 50,000 people around the world. Now specifically to your question, so around the world for architectural, PPG Comex, our Mexican business continues to shine. First, GDPs are holding up better than most parts of the world in Latin America. And second, just the strength of our position, the strength of our services, the strength of our brand, the strength of our network will continue to put up strong results down there.\n\nAs you know, Asia Pacific for us is a fairly small business in architectural. And given some of the things happening in China, that's actually a positive at this point. Europe, we continue to see a soft -- quite soft DIY, as we said in Q1 and Q2, and we expect it to continue at the depressed levels that it is today. Trade in Europe is actually a bit stronger. It's down mid-single digits.\n\nThe pro backlogs are still there, driven largely by labor shortages more than anything, but we do see that moderating. We do see the trade business moderating as well in Europe, as you would expect. Some variability by country, the closer you get to the war zone, the more depressed it gets. U.K., you know what's happening there, and then a bit stronger in the south.\n\nHolding up better over here in the U.S./Canada market. We are seeing DIY softness here. Nothing like Europe, more down like low single digits in DIY U.S./Canada. But the pro business is holding up well.\n\nBacklogs remain strong. Backlogs, our quarterly survey, paint contractors averaged about 12 weeks of backlog, pretty consistent with the prior quarter. And our omnichannel business for the pro, we were actually up this quarter. So holding up better here in the U.S./Canada region.\n\nOperator\n\nOur next question comes from Josh Spector from UBS. Your line is open.\n\nJosh Spector -- UBS -- Analyst\n\nYeah. Hey, guys. Thanks for taking my question. Just curious if you can comment on the pricing progression in the 2 segments.\n\nI mean, clearly, you have momentum in performance with that increase on a 2-year stack. But industrial may be a little bit less obvious. 20% 2-year stack or slightly above that isn't much of an improvement Q-on-Q. So I'm wondering if you can comment on why pricing there wouldn't be moving up higher, especially if you're just talking about margins accelerating.\n\nAnd does energy prices, and that being a new inflationary factor, perhaps a higher inflationary factor, impact the ability to get pricing in any of the segments? Thanks.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nJosh, this is Michael. First of all, what I would tell you is that part of what you're seeing of the slowing of the price increases in the performance coatings segment is because of the drop in architectural sales. Okay? So you have a little bit of a mix issue going on in there. So that's one.\n\nThe other thing you have to remember is we've got pricing much earlier in performance coatings segment, and we always lag a little bit in the industrial side. So the other piece besides mix is timing. So what you see, which is most important, is that on our industrial side, it does lag, but now it's catching back up. And the industrial side was above company average, and we expect that to continue in the fourth quarter as well.\n\nAnd most importantly, in our automotive segment, a number of our customers have provided us retroactive pricing as well. And so, that helps that margin as well. So we're still anticipating some significant price improvement in the fourth quarter. And again, we'll be ready to talk about the first quarter later, but we will have positive -- significant positive price in Q1 as well.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nHey, Josh, this is Vince. I think the key things to remember for us is the margin recovery we promised in industrial is underway. We're seeing -- we expect that margin recovery to continue into Q4 and expand into Q1. Your question on energy in Europe, we did put in select energy surcharges as most companies have done to accommodate that.\n\nWe're not a big energy consumer in Europe, we're downstream, and we're reacting as much as we can to what's being -- what's a tough energy environment in Europe.\n\nOperator\n\nOur next question comes from John McNulty from BMO Capital Markets. Your line is open.\n\nJohn McNulty -- BMO Capital Markets -- Analyst\n\nYeah, Good morning. Thanks for taking my question. And congratulations again to two Michael and Tim both. So when we think about the raw material basket, it sounds like a lot of things have improved, but there are still some challenges. I guess can you help us to understand what portion of the raw material basket is still currently challenged? And then as the supply chains continue to improve, and it looks like they have a lot, I guess how should we be thinking about what that might mean for raw material relief as we look to 2023? Thanks.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nYeah, John, this is Vince. Let me start real quickly, and then I think Tim is gonna chime in here. If you look, again, we have cumulative, about 40% inflation levels. We do see inflation year-over-year in Q4, but it's down sequentially.\n\nAnd that's, I think, the key is we're starting to see the fever break. It's different, as Michael mentioned, by region. And we're seeing arbitrage opportunities, and I think Tim has some specifics.\n\nTim Knavish -- Chief Operating Officer\n\nYeah. And so, from the availability situation, John, it's much better. We're now to isolated examples. You've got the singular example here in the U.S.\n\nwith a fire at a particular resin supplier that has caused a transient disruption. We put some alternatives in place to deal with that. And if you look at like cut across the aerospace transparencies, you've got some things not related to coatings, but components, machine parts, acrylic parts that go into the manufacture and assembly of a windshield. But now we're down to handfuls of items, some minor additives as opposed to what we had a quarter or certainly two quarters ago.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nYeah. And just one other comment here is if you think about the inflation that we've absorbed in the past almost two years now, a part of it started as a supply chain issue, but we then were saddled with inflation that included COVID absenteeism, freight issues, port issues. A lot of those other issues have fallen by the wayside. So we do feel, given those other issues have been resolved, the supply/demand economics will start to play a bigger factor.\n\nOperator\n\nOur next question comes from Stephen Byrne from Bank of America Merrill Lynch. Your line is open. \n\nStephenByrne -- Bank of America Merrill Lynch -- Analyst\n\nYeah. So I was curious to hear your view on the ability for you to expand geographically in your various businesses. Which of them do you think you have the most potential to expand? For example, Tikkurila, did that give you a footprint in a region where you think you can meaningfully expand either refinish or traffic markings? What's the outlook for you in that region?\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nWell, Stephen, this is Michael. Let me just give you some examples that all play into the positives of what we do with the acquisition. So if you think about traffic solutions, that was primarily a U.S. business.\n\nThey had a key tiny piece in Mexico where you take our PPG Comex team, and they're a powerhouse in Mexico. So what do we do? We take those formulations that they have in the U.S., we transfer them down to Mexico, we localize them for those local markets, and we started to sell them. And our traffic solutions business is growing 20-plus percent every quarter since we've had it, and we've had it now five quarters. So it's moving along.\n\nSame thing with Tikkurila. So you go to Tikkurila, and they had a strong customer relationship up in Scandinavia. It's not that we weren't selling in Scandinavia, but they had some tremendous relationships. So we're able to take our industrial products and bring them up there.\n\nWe're able to expand our refinish products up there, and I think we highlighted that when we took you to see Birks there up in Scandinavia for the investor day. And the same thing when you think about China. So when we bought Wörwag and Cetelon, we took those formulations. We moved them over to China, and we've been able to grow our automotive parts and accessories business in China, and that's been a nice move for us.\n\nWe have a new waterborne technology for automotive parts, where we're growing significantly faster than market. So I think we have a number of these examples where we do acquisitions, and we move them around the world, and it turns out to be a strong positive for us. So thank you very much for the question.\n\nOperator\n\nOur next question comes from Kevin McCarthy from VRP. Your line is open.\n\nKevin McCarthy -- Vertical Research Partners -- Analyst\n\nYes. Good morning. I'd like to ask, how much destocking do you anticipate internally and externally? For example, do you expect to run your assets at a rate that's below underlying consumption in the next several quarters, perhaps outside of auto OEM and aerospace, where those markets have been more dislocated or depressed?\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nWell, we're certainly, Kevin, gonna do that for some of our businesses where the raw materials we built up. So that's going to happen. But you did highlight a number that are going to be well north of that. So automotive, refinish, traffic solutions, things like that are all going to be well above company average.\n\nBut the thing you have to remember is we're also going to take advantage of the arbitrage in raw materials. So if it makes sense for us, we're moving TiO2 right now from China. We're moving it into Europe. So we're going to take advantage of things like that.\n\nAnd net-net, I would tell you that we're probably going to be pretty close. We took down inventories $100 million in Q3. We're probably gonna take down another couple of hundred million dollars in Q4, and I think we're in pretty good shape.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nYeah. Let me just add on to what Michael said here. I think if you think about the coatings industry more broadly, we're a batch process. So we typically can start and stop as we please.\n\nWe're not a continuous process. Where we are this cycle versus prior cycles is we don't have a lot of inventory. Our end customers, with a few exceptions, do not have a lot of inventory in the chain. We're seeing that in, for example, automotive refinish, as Michael alluded to.\n\nWe're certainly seeing that in the aerospace. So there's not, Kevin, a big destock coming in many of our industries. Automotive, another one where we're inventory-light all the way through the chain. So we're going to run at or slightly below what we see as our end customers' consumption to draw down our inventories.\n\nBut with a couple of small exceptions, we're including in some of our big box DIY customers. There's not a lot of inventory in channels, but we do have a huge focus on drawing down our raw material inventories in the fourth quarter.\n\nOperator\n\nOur next question comes from Lauren Favre from Exane BNP Paribas. Your line is open. Please go ahead. \n\nLauren Favre -- Exane BNP Paribas -- Analyst\n\nYes. Good morning, all. Congrats again to Michael and Jim. My question is, again, on this inventory point and destocking.\n\nOn the volume guidance for Q4, I was wondering if you had made a specific assumption on destocking itself on the customer side.\n\nTim Knavish -- Chief Operating Officer\n\nYeah, Laurent, thanks for the question. This is Tim. To Vince's point, really, the only segment where we're seeing destocking on the customer side is architectural DIY big box. And we are seeing that in Europe predominantly, but also here in the United States.\n\nAnd so, we do expect that to continue really for the remainder of the year until they reach their targeted levels. But beyond that, many of our customer channels are still fairly light or very light in some cases on inventory. So that's the only destocking we expect to see.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nYeah. And if I can just add, this is Vince again. If you go to Europe, where we're seeing that, we started to see that really in Q2 -- Q1, early Q2 of this year. So we're gonna lap -- in a couple of months here, we're gonna lap those declines.\n\nSo we do have a different comparison base in 2023 for Europe. \n\nOperator\n\nOur next question comes from Michael Sison from Wells Fargo. Your line is open.\n\nMichael Sison -- Wells Fargo Securities -- Analyst\n\nCongrats to you, Tim. And been great working with you, Michael. I assume you're moving to Cleveland post-retirement. But I guess the first question for you, Michael, when you think about your outlook for the fourth quarter, the $1.05 to $1.20 seems sort of low on a quarterly run rate.\n\nAnd just curious what you think needs to happen to see sequential improvement heading into the first half of '23. And then maybe for Tim, maybe you can comment on what you believe PPG's earnings potential is at some point in time. There was a $9 number out there for a while, and I just didn't know if that was still the one that you think is the right number. Thank you.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nOkay. Mike, this is Michael. So I will take the first question, and I'll let Tim answer the second question. Look, at the end of the day, when we put together our original, let's call it, our pre-announcement guidance, we -- our Chinese team was very confident that post President Xi's election for his third term that the COVID policies in China would be relaxed and would take a more normalized approach.\n\nClearly, with his speech last week, that is not going to be the case. So we've adjusted based on that. Our Tianjin plant, which is actually our largest coatings plant in the world in China, it was down the last 10 days of September. It was down the first 10 days of October running at reduced rates.\n\nAnd consumer confidence, obviously, is something we're going to be watching very closely in China. But the good news is when you look at the rest of China, the automotive business had a very strong third quarter. They had a very -- we're projecting a pretty good fourth quarter. That's historically the best quarter for automotive in China, and I'm very encouraged by the fact that the automotive guys in China are exporting their electric vehicles.\n\nAnd as you know, the electric vehicles are good for us. BYD is not only exporting to Europe, but they're also exploring to Southeast Asia. So we feel very confident about that. So I think overall, you may view that guide as a little weak, but there's a lot of things out there that are quite uncertain.\n\nWe don't know how much destocking DIY guys will do in the fourth quarter. We don't know how much they're gonna -- typically they start buying in December to get ready for the new season. We have not put any of that in there. So we're being a bit cautious given what we see.\n\nAnd so, I think our guide is reasonable, and we're certainly gonna keep you updated through the quarter as we go. So I'll end with that, and I'll let Tim talk about how he sees the $9.\n\nTim Knavish -- Chief Operating Officer\n\nRight. The $9, the answer is it's a question of when, not if. The fundamentals for $9 are absolutely there. If you look at the pluses and minuses on the ledger for that, you've got aero recovery, you've got auto recovery, you've got more refinish recovery.\n\nThat great business is still down 10% versus pre-COVID. You've got the inflection of the price cost curve. You know about our restructuring and the footprint work we've done. China is still closed.\n\nAcquisition synergies, technology, etc., etc. So that side of the ledger is a lot stronger than the other. The other side of the ledger is really only about macroeconomic-driven volume, and we only need some of that to come back to get to that $9. So it's absolutely in our future, and thanks for the question.\n\nOperator\n\nWe now turn to Noah Poponak from Goldman Sachs. Your line is open.\n\nDuffy Fischer -- Goldman Sachs -- Analyst\n\nHi. This is Duffy. Can you hear me OK?\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nYes. Duffy, Good morning.\n\nDuffy Fischer -- Goldman Sachs -- Analyst\n\nGood morning. Sorry, guys. So first, thanks, and congrats to Michael and Tim. Second one, two questions around kind of the price cost. So the first one is, to get to your first half goal of offsetting all the raw material inflation we've seen to date, how much sequential price do you need between Q3 and whether that ends up being Q1 or Q2 next year? And then the second one is the $1.9 billion you referenced, what is it realistically you think we're playing for, let's say, over a three-year period? I mean, obviously, there's some true inflation in there that we'd probably never get back.\n\nYou've got stuff like the Allnex plant that. Again, theoretically, as soon as that's back up and running, you'll see some relief there. But you can do a lot better job kind of analyzing the supply/demand change for each of the particular -- is it half? Is it three quarters? What is like a realistic bogey that we think we can get back on the raw material side over a couple of years?\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nDuffy, this is Vince. I'll take the first part of that question, and I'll let Michael take the second part. To fully recover our total inflation, as we said early, late Q4, early Q1, we have very modest targeted pricing actions we're gonna take in Q4, and we're gonna take some targeted actions in Q1. So again, we're not -- this is not relying on exceptionally, exceedingly high pricing going forward.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nSo, Duffy, let me just reiterate. Look, we're gonna have covered all inflation. We covered it all in the second quarter. That's total inflation.\n\nThat's not just raws. We've covered it at all in the third quarter. We're gonna cover it all in the fourth quarter. So now, we're eating into some of that gap that we had built up, and we'll be totally caught up in Q1, and that's what the price increases we know.\n\nThat's not with anything that may come up in the next 30 to 60 days that we may also talk -- tag on, as Vince says, from a targeted standpoint. Okay? So what is it that we're probably not going to see relief on? We're clearly not gonna see relief on labor. Okay? That's not gonna happen. But we are gonna see -- we already have started to see relief on transportation.\n\nWe think warehousing costs are gonna moderate a little bit. It's not gonna be significant, but that's gonna moderate some. And raw materials, we've already seen it in -- starting in TiO2. We've seen it start in epoxy.\n\nWe're gonna continue to see it in some of the basic isocyanates. There's no question in Q1 we're gonna get to lower emulsion costs. So we can see these things coming. Now are we gonna get all the way back to 2019 levels on some of these? Maybe, maybe not.\n\nIt's a little bit too early to make that call. But what I am confident enough is that our team has done a really good job of pricing effectively, our customers are well aware of what's going on in that space, and I think we're gonna continue to close this gap. And it will be completely closed by the end of Q1, and that's why we're confident that margins will continue to expand in 2023.\n\nOperator\n\nOur next question comes from Frank Mitsch from Fermium Research. Your line is open. \n\nFrank Mitsch -- Fermium Research -- Analyst\n\nYes. Thank you. And first, we get a changing of the guard in Pittsburgh at the quarterback, and now this. Michael, it's been a pleasure working with you.\n\nBest wishes for the future. And obviously, congratulations to Tim. I wanted to drill down a bit more into the volume trends. Third-quarter volumes were down 3%.\n\nI was wondering if you could let us know what that was by month to see if there was some degradation as we exited the quarter. And as I think about the fourth quarter, as we think about the fourth quarter, you mentioned that you anticipate volumes down mid-single digits. And in the prepared remarks, you said that Asia was expected to be down 10%. I was wondering if you could offer some comments on expectations, Europe, U.S., Canada and Asia.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nFrank, this is Michael. Thank you very much for your kind comments. It's been a pleasure working with you. And obviously, we'll continue to follow the Jets regardless of where I end up playing golf in the future.\n\nSo let's talk a little bit about the third quarter. Look, the thing about the third quarter was September in China was weaker than we expected, that we certainly did not expect the impact from them asking us to reduce rates 50-plus percent in our Tianjin plant. We certainly saw the decreases coming in the destocking in the architectural channel in Europe. They've been very aggressive with that, and they made that even more aggressive in the September time frame.\n\nWe started to see that in the U.S. as well. Anything that touches a consumer, whether it's the appliance area or think about things that look like a Peloton, that continues to be weaker. So we're tracking that closely.\n\nRight now, I would say for the fourth quarter volumes, we're not projecting any major surprises in that area. I mean, cautiously optimistic that the OEM space in Europe has reached the bottom. I think that's one area that we'll be looking for to see if that levels out where it is now. Certainly, we're worried about and watching the interest rates here in the U.S.\n\nand how that's gonna impact automotive. But look, this year, we're probably gonna finish with automotive builds around 81-plus million cars, and we're looking at next year to be about 85 million. So for some of these things that are weakening, we do see some things that are strengthening. And should China ever move away from or at least move partially away from their Zero COVID policy, we know that flights in China will significantly increase.\n\nThey've been pent-up. They wanna move around, but they just haven't been allowed to by the government. So on that standpoint, I feel pretty confident.\n\nOperator\n\nOur next question comes from Arun Viswanathan from RBC Capital Markets. Your line is open.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\n Great. Thanks for taking my question. Apologies for that. And Michael, congratulations on your next endeavors there.\n\nGood working with you. I'm just curious on the volume side. So when we think about it, there looks like there's been some real structural damage in Europe. Volumes may not necessarily recover to where they were pre-pandemic levels.\n\nI don't know if you'd agree with that, but maybe you can just comment on that. And then secondarily, if we do see some continued weakness in Europe, is there a risk that volumes also could deteriorate in North America? And if that's the case, then are we kind of thinking about Q4 earnings run rate as likely a good starting point for Q1 and most of next year? Thanks.\n\nTim Knavish -- Chief Operating Officer\n\nYes. Arun, this is Tim. Thanks for the question. I'll go first, and then maybe hand it over to Vince.\n\nFor Europe, I think the guidance that we put out, we're comfortable with what we projected from an architectural standpoint, industrial, auto. We feel pretty much like we bottomed on the volume standpoint from a European situation. And then the carryover to the U.S., we really haven't -- we haven't seen that yet. The U.S.\n\nvolumes are holding up pretty well for us with the exception of, again, anything consumer-related on the industrial side and architectural DIY. So we haven't really seen the contagion cross the ocean into the United States market yet.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nYeah. Arun, this is Vince. On your question about structural demand, I think it's too early to make that call. I think as we look into 2023, again, we're gonna lap some easier comparisons beginning in March.\n\nWe do feel there is a health -- there's a consumer there that typically has spent money. We were obviously seeing some impact from that due to higher energy prices. The length of that energy price issue will drive some of the answers to your question that we just don't have. And if activity or production shifts to other parts of the world from Europe due to those energy prices, we already have positions.\n\nSo if it shifts to China or shifts to Mexico, we'll supply the customers there.\n\nOperator\n\nOur next question comes from John Roberts from Credit Suisse. Your line is open. \n\nJohn Roberts -- Credit Suisse -- Analyst\n\nThe theme in auto OEM is that in Europe and the U.S., we're already at recession levels so that we don't decline further. Now that Europe is actually probably in a recession, do you still think that European auto OEM is gonna be flat to up next year?\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nJohn, this is Michael. I think that European auto demand is gonna remain at the level it's at for the next two to three quarters. I don't see any catalysts for the turnaround. At the end of the day, Europe rarely gets below that 8 million or 9 million cars in Western Europe.\n\nThat's about where we are now. And overall, we have a lot of cars that are driven by corporate buying and fleet buying, and those behaviors have not ever changed because they're ingrained in the habits of the companies that do those things. So we're pretty confident we're at that level. In the U.S., look, I mean we've been constrained.\n\nI mean, right now, there's only 32 days of inventory on the lots, and many of the most popular colors are very hard to find. And so, people are still buying. If you think about the truck market, you can't find a truck out there. So that remains a very solid market.\n\nThat's always a good indicator because our -- the man-and-the-van kind of stuff, those guys need trucks. And so, that's gonna continue. We do see some continuum momentum on EVs, but we're really excited about the EV momentum in China. I didn't talk about this earlier, but China had a goal of having 25% of all cars by 2025 EV.\n\nWell, actually, last quarter, they hit that target. And the fact that these guys are starting to export EVs is an encouraging factor for us. And the largest maker of EVs in China is BYD, and we just happen to be the largest supplier to BYD. So we feel like we're in good shape.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nYeah. I think, John -- this is Vince. I think holistically, when we look at the global auto market next year, our forecast six months ago was we'd be up 5% to 10% year-over-year. Our current forecast is we're going to be up 5% to 8%.\n\nSo there might be some cropping off at the top of that, but we still feel very good about global auto growth next year.\n\nOperator\n\nWe now turn to Mike Harrison from Seaport Research Partners. Your line is open. Please go ahead. \n\nMike Harrison -- Seaport Research Partners -- Analyst\n\nHi, good morning, And let me add my congratulations, Michael and Tim. Wanted to ask maybe for a little bit more color on the actions that you guys are taking to reduce cost by another $70 million. You mentioned that a lot of those are gonna be taken in Europe. But can you talk about some of the different buckets in terms of whether it's supply chain procurement, manufacturing optimization, headcount reduction.\n\nMaybe talk about the timing? And also, should we assume that it's split pretty ratably between the 2 segments? Thank you.\n\nTim Knavish -- Chief Operating Officer\n\nHey, Mike, this is Tim. I'll start with -- and thanks for the question. The vast majority of the new cost-out program are people reductions. We anticipate, globally, we'll reduce our headcount by about 2%.\n\nAnd most of those will be fairly fast-moving. Any facility discussions, of course, we would work with the appropriate works councils. But the majority, by far, of this new program are fairly fast reductions in staffing.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nAnd Mike, this is Michael. It is ratably the same between the performance side and the industrial side, and I'll let John talk a little bit about the $70 million.\n\nJohn Bruno -- Vice President, Investor Relations\n\nYeah, Mike. So we are targeting $70 million, and that will start benefiting the company as early as the fourth quarter, along with other open progress we've had from prior years. At this time, we expect next year the savings will be a total of about $70 million. \n\nOperator\n\nOur next question comes from David Begleiter from Deutsche Bank. Your line is open. \n\nAnthony Mercandetti -- Deutsche Bank -- Analyst\n\nHey, good morning. This is Anthony Mercandetti on for David Begleiter. Can you discuss the benefit in U.S. architectural coatings from The Home Depot relationship and maybe quantify the additional wins that were mentioned in the prepared commentary?\n\nTim Knavish -- Chief Operating Officer\n\nSure, Anthony. This is Tim. Thanks for the question. The Home Depot pro program is progressing well.\n\nWe've got thousands of new customers from the program. And we've actually -- as you heard in the prepared comments, we've activated the next phase, which is engaging with HD Supply. And the beauty of HD Supply, they're largely MRO-focused, hospitality, healthcare, government, multifamily, maintenance, repair and delivered on site and previously did not do a lot of paint. So this is a lot of upside opportunity for us.\n\nAnd to put some scale on some of the comments earlier, we're focused heavily on lead indicators. And we're averaging over 6,000 new customer engagements every week, and that is enabled by the linkage of our CRM systems between The Home Depot and PPG. So these are new customer opportunities for us that are already buying paint from somewhere else and buying other products from The Home Depot. We've got about a 40% win rate.\n\nThat compares to historical levels of about a 20% win rate. So we're very satisfied with that lead indicator. And then on the HD Supply, we're very early days here, but we've also started to engage in the first month 12,000 new customers just through that next stage of the program. So big picture, this is a $10 billion U.S.\n\naddressable market for the pro painter. It's a marathon, not a sprint, as you convert each one of these contractors. But we're pleased with the results so far, and we're expecting double-digit growth in this category for us for many quarters to come.\n\nOperator\n\nOur next question comes from Alexia Yefremov from KeyCorp. Your line is open.\n\nAleksey Yefremov -- KeyBanc Capital Markets -- Analyst\n\nThanks. And congratulations, Michael and Tim. In the U.S./Canada DIY market, you mentioned that it's down low single digit. How does this compare to prior downturns? How bad do you think this could get? And also in the short term, if you can comment if this is down low single digit, was getting worse in September, October or was stable?\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nThis is Michael, Aleksey. I would tell you the architectural business in September was a little bit lighter on the destocking in the big boxes. So that is not demand-related. They just decided they would move into a little bit lower inventory position.\n\nAs Tim has said on multiple occasions, our business with The Home Depot continues to grow. We're really pleased with that. We'll have some further announcements about some other wins in the big box segment when it's appropriate to put it out there. But we're gonna have a substantial, nice, slow win in the big box segment starting in the first quarter, and so we'll be starting to ship that in Q1.\n\nAnd what I would tell you is that this is probably -- the slight downturn is lighter than historical. It's still too early to call. Obviously, interest rates -- when I think about interest rates of 6% and 7%, it's still low compared to my first house that I got at 11%. So of course, my kids don't understand that.\n\nBut I would tell you that we still have a positive outlook on the housing market. We know that there is a labor shortage, and more of this is being driven by the fact that both our pro painters don't have enough labor, there's not enough labor in the new home construction market. So net-net, I would still tell you that we're optimistic.\n\nTim Knavish -- Chief Operating Officer\n\nYeah, I'd just like to add one other thing on U.S. housing with all the numbers everybody has seen. And really, we're talking about new housing here. We're gonna be honest with ourselves in how we plan for that based on what's really happening in that space.\n\nAnd the way we're looking at it is we do see an air pocket in the new housing space for some number of quarters. The positive from PPG standpoint, it only represents about 1% to 2% of our total enterprise sales. And we're also, frankly, significantly stronger in commercial maintenance repair. So we are accounting for what's happening in new housing in our guidance.\n\nAnd the other positive, as Michael alluded to, the housing fundamentals are still strong for the mid to long term. There is a housing shortage in the United States as well as many other countries. So while there is maybe an air pocket in the short term, the fundamentals for the mid and long term remain strong.\n\nOperator\n\nOur next question comes from P.J. Juvekar from Citigroup. Your line is open. \n\nPatrick Cunningham -- Citi -- Analyst\n\nHi. Good morning. This is Patrick Cunningham on for P.J. How is Tikkurila holding up relative to your expectations, especially given the energy crunch in Europe and the consumer slowdown?\n\nTim Knavish -- Chief Operating Officer\n\n  Yeah, Patrick, Tim again here. We are very pleased with Tikkurila as a result in our first year of ownership. It has given us technology. It's given us ESG.\n\nIt's given us a great wood care offering that we can spread throughout the rest of PPG, starting with the rest of Europe. It's given us market access, strong No.1 position in a number of countries. It's -- and a great management team, by the way, which was a very pleasant -- I'm not going to say surprise, but the strength and depth of the management team was better than we had anticipated. So we are absolutely thrilled with Tikkurila and the path forward.\n\nOf course, from a DIY standpoint, they're seeing some of the same issues that I mentioned earlier for kind of the Pan-European situation. But between what we acquired with Tikkurila and what we're able to bring into Tikkurila and their position from other businesses like light industrial, like refinish, like protective coatings, we really are just thrilled with how that acquisition is doing.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nAnd Patrick, I would add one thing that the skill set that we brought to Tikkurila that -- they were starting to learn how to do, but we've accelerated is pricing. And this is an area where they have a market-leading position in Finland, a market-leading position in Sweden, a market-leading position in the Baltics. That pricing muscle hadn't been exercised previously, and we're showing them how to exercise it. So it's a win-win from that standpoint.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nAnd Patrick, this is Vince. I don't want to sway away from your question, but the other acquisition we did was Ennis-Flint. Michael alluded to it earlier. We've had double-digit sales growth in that business.\n\nThe outlook for that business continues to look promising into 2023, especially with the infrastructure activities in the U.S., etc. So again, very promising situation with Ennis-Flint as well.\n\nOperator\n\nOur next question comes from Laurence Alexander from Jefferies. Your line is open.\n\nKevin Estok -- Jefferies -- Analyst\n\nHey, good morning. This is Kevin Estok on for Laurence. Thank you for taking my question. I was just wondering if you could discuss how you guys think about incremental margins between the different regions you operate in, in particular, if there was a difference between EU and U.S. incremental margins, let's say, every additional dollar that's spent by customers.\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nYeah, yeah. Kevin, this is Vince. We're still in that 30% to 40% range for incremental margins, certainly around the fringes as activity in Europe -- win activity in Europe comes back, it will be a little higher just because our utilization rates are a little lower. But I would certainly pencil in 30% to 40% incremental margins.\n\nAnd then we have to -- as we've talked about several times on this call, there'll be some benefit from price raws as that normalizes. So that will be above those incremental margins.\n\nOperator\n\nOur next question comes from Steven Haynes from Morgan Stanley. Your line is open. \n\nSteven Haynes -- Morgan Stanley -- Analyst\n\nHi. Thanks for squeezing me in. As working capital frees up a little bit, as inventories come down, can you just provide a bit of an update on your M&A pipeline and how you're thinking about doing deals versus share buyback going forward? Thank you.\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nSteven, this is Michael. Listen, our inventory on the pipeline of deals is still solid, but the most important thing is we're going to remain disciplined on how it affects total shareholder returns. So we're gonna decide whether it's better to pay down debt versus do acquisitions versus buying back stock, whatever is the most accretive to our shareholders. So we're actively engaged in this space.\n\nThere are still a number of deals we had. I always tell people that when earnings are falling, it's always harder to get deals done because people want to be paid on what their old earnings look like and not what their current earnings are looking like. So that always does make it a little bit more of a challenge, talk about normalized earnings versus where they currently are. But we're gonna remain disciplined in this area, and I don't think you should expect anything different than what you've seen from PPG in the past.\n\nOperator\n\nOur last question today comes from Adrian Tamagno from Berenberg. Your line is open. Please go ahead.\n\nAdrian Tamagno -- Berenberg Capital Markets -- Analyst\n\nHello. Good morning, gentlemen, and congratulations to Tim and Michael. A question for Tim, I mean given your extensive experience in all of the areas of PPG, where do you see the greatest potential for self-help and margin recovery in the current environment?\n\nTim Knavish -- Chief Operating Officer\n\nThank you, Adrien, for the question. And let me just first say, I am very excited about the opportunity we have at PPG. And I can assure you that we will continue to execute on our margin recovery and we will continue to execute on the optimization of shareholder return, first and foremost. Beyond that, second, as Michael indicated, the change becomes effective on January 1.\n\nAnd at the appropriate time after that, I look forward to engaging all of our key stakeholders, including this group, to communicate further about my priorities, my vision for the next phase of evolution for PPG. So thrilled with the opportunity, encouraged on our path to margin recovery, encouraged on the opportunities to deliver shareholder return and look forward to 2023 for both organic growth and continued opportunities on the inorganic side.\n\nOperator\n\nThere are no further questions at this time. Mr. John Bruno, I turn the call back over to you. \n\nJohn Bruno -- Vice President, Investor Relations\n\nThank you, Elliot. I want to thank everyone for your interest and your attention today. This concludes our third quarter earnings call. Have a good day.[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Bruno -- Vice President, Investor Relations\n\nMichael McGarry -- Chairman and Chief Executive Officer\n\nChristopher Parkinson -- Mizuho Securities -- Analyst\n\nGhansham Panjabi -- Robert W. Baird and Company -- Analyst\n\nTim Knavish -- Chief Operating Officer\n\nJosh Spector -- UBS -- Analyst\n\nVince Morales -- Senior Vice President and Chief Financial Officer\n\nJohn McNulty -- BMO Capital Markets -- Analyst\n\nStephenByrne -- Bank of America Merrill Lynch -- Analyst\n\nKevin McCarthy -- Vertical Research Partners -- Analyst\n\nLauren Favre -- Exane BNP Paribas -- Analyst\n\nMichael Sison -- Wells Fargo Securities -- Analyst\n\nDuffy Fischer -- Goldman Sachs -- Analyst\n\nFrank Mitsch -- Fermium Research -- Analyst\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nJohn Roberts -- Credit Suisse -- Analyst\n\nMike Harrison -- Seaport Research Partners -- Analyst\n\nAnthony Mercandetti -- Deutsche Bank -- Analyst\n\nAleksey Yefremov -- KeyBanc Capital Markets -- Analyst\n\nPatrick Cunningham -- Citi -- Analyst\n\nKevin Estok -- Jefferies -- Analyst\n\nSteven Haynes -- Morgan Stanley -- Analyst\n\nAdrian Tamagno -- Berenberg Capital Markets -- Analyst\n\nMore PPG analysis\n\nAll earnings call transcripts"
}