{
  "companyName": "Olo Inc.",
  "companyTicker": "OLO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/olo-inc-olo-q3-2022-earnings-call-transcript/",
  "content": "Olo Inc. (OLO 1.13%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Olo Inc. Q3 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Stephanie Daukus, vice president of investor relations. Please go ahead.\n\nStephanie Daukus -- Vice President, Investor Relations\n\nThank you. Good afternoon, everyone. And welcome to Olo's third quarter 2022 earnings conference call. Joining me today are Noah Glass, Olo's founder and CEO; and Peter Benevides, Olo's CFO.\n\nDuring our call today, some of our discussion and responses to your questions may contain forward-looking statements, which represent our beliefs and assumptions only as of the date such statements are made. These forward-looking statements include, but are not limited to, statements regarding our expectations of our business; future financial results; total addressable market and growth opportunity; guidance and strategy; the restaurant order and processing trends; ability to increase usage of our platform and upsells, including with respect to growth in average revenue per unit; and the durability of our customer adoption of multi-module. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those described in our forward-looking statements. And such risks are described in our earnings press release and our risk factors, including in our SEC filings, including our annual report on Form 10-K and quarterly reports on Form 10-Q.\n\nYou should not rely on forward-looking statements as predictions of future events. We undertake no obligation to update any forward-looking statements made during this call to reflect events or circumstances after today. Also, during this call, we'll present both GAAP and non-GAAP financial measures. Reconciliations to the most directly comparable GAAP financial measures are available in our earnings release, which we issued a short while ago.\n\nThis earnings release is available on the investor relations page of our website and is included as an exhibit in the Form 8-K furnished to the SEC. Finally, in terms of our prepared remarks or in response to your questions, we may offer incremental metrics. Please be advised that this additional detail may be one-time in nature, and we may or may not provide an update in the future on these metrics. I encourage you to visit the investor relations page of our website at www.olo.com to access our earnings release, investor presentation, periodic SEC reports, a webcast replay of today's call, or to learn more about Olo.\n\nWith that, let me turn the call over to Noah.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nThank you, Stephanie. Hi, everyone. Thank you for spending time with us today. We're proud of our third quarter results.\n\nWe generated $47.3 million in total revenue, a 26% increase year over year, as our platform supported increased module adoption within our existing customer base, increased transaction volumes, and continued growth in new locations. We increased average revenue per unit, or ARPU, to $558, up 15% year over year and 3% sequentially, and deployed roughly 2,000 new locations to the platform, with ending active locations increasing 11% year over year and 2% sequentially to approximately 84,000. The Olo platform is purpose-built to help our customers do more with less and create a differentiated and memorable guest experience. And as restaurant executives and operator conversations increasingly focus on sales and margin maintenance due to challenges related to increased inflation, supply chain constraints, and labor dynamics, we believe that Olo's platform is best positioned to meet restaurants' needs.\n\nIn particular, this quarter's customer deployment, partnership announcements, and product enhancements are representative of this belief, that technology is instrumental in enabling restaurants to be more operationally efficient while enhancing the guest experience. We're honored to play this role in the $1 trillion and growing restaurant industry. Olo's ability to address this massive market opportunity is a function of increasing ARPU through further multi-module adoption and continued growth in transaction volume, as well as adding more locations to the platform. And we're happy to report continued momentum across all of these key drivers.\n\nSpecific to our ability to expand ARPU, we broadened our relationship with Jack in the Box, a top 25 quick-service restaurant, or QSR, brand with more than 2,200 locations. We initially supported Jack in the Box with our Dispatch module, enabling direct delivery at scale. More recently, we deployed our Ordering module, replacing their homegrown solution. We're excited about this expanded partnership as it reflects our ability to expand within our existing customer base, even when Ordering is not the lead module.\n\nImportantly, this expanded partnership also reflects our ability to support the industry's largest brands and largest segment, QSR. Other examples of expanded relationships within brands this quarter include BJ's Restaurants and Brewhouse, as well as Wetzel's Pretzels, adding Dispatch and Olo Pay, in addition to our Ordering, Rails, and Network modules. A number of existing brands, such as IHOP and Krystal, adding virtual restaurants to their existing Ordering, Dispatch, and Rails modules; and brands such as Another Broken Egg Cafe and Capriotti's adopting our guest engagement and our front-of-house solutions in addition to their existing Ordering, Dispatch, and/or Rail modules. Our existing customer base presents a sizable opportunity to expand ARPU by providing additional solutions to improve our customers' operations and delight guests, as brands on average utilize 2.7 out of 12 modules on a per-location basis at the end of 2021.\n\nAt the same time, on-premise solutions unlock additional ARPU expansion opportunities. Momentum in this area continues, with more than 50 brands in over 1,000 locations processing on-premise digital orders through Olo. We believe this is the beginning of a larger trend whereby restaurants will process 100% of their orders digitally through the Olo platform. Furthermore, when restaurants pair on-premise solutions with Olo Pay, they're able to realize the incremental value of utilizing one single digital platform, driving a better experience for their guests and staff.\n\nAs we've already seen at brands like Nando's, with their adoption of QR-code ordering and Olo Pay. We believe, if restaurants utilize Olo Pay and the Olo platform to process 100% of their orders, that ARPU has the potential to increase by 25x. Another exciting trend that continued this quarter relates to enterprise brands, replacing legacy technology partners and implementing Olo solutions. This quarter, we welcomed Smashburger, a rapidly growing, fast-casual concept with more than 200 locations; Ruby Tuesday, a casual dining concept with more than 200 locations; and Zaxby's, a fast casual concept with more than 900 locations to the platform.\n\nAll three enterprise brands selected Olo to replace their legacy technology providers through the adoption of our Ordering, Dispatch, and Rails modules. The implementation of Olo as their consolidated digital commerce solution allows each brand to provide a highly customized and personalized digital program to their guests while increasing operational efficiencies. Over the last two years, we've proven through many instances that investing in an enterprise-grade SaaS platform is a compelling alternative to building in-house. That means a fundamentally superior platform, lower cost, faster time to market, tapping into platform best practices, leveraging a large partner and customer ecosystem, and harnessing platform-level innovation.\n\nNames such as Papa Murphy's, Potbelly, and now Jack in the Box, Ruby Tuesday, and Smashburger, and Zaxby's, further affirm our long-held conviction that SaaS is a better alternative to homegrown solutions. We've also continued to successfully deploy our solutions within the emerging enterprise segment. This quarter, we welcomed names such as Grimaldi's and JINYA Ramen Bar to the platform, as they adopted the full stack of Olo solutions, which included order management, delivery enablement, guest engagement, front-of-house, and Olo Pay. Throughout the year, we've seen an increasing number of emerging enterprise new logos adopt multiple modules from the onset of our relationship, inclusive of OLO Pay.\n\nWe believe this trend will continue and further drive ARPU. Also, this quarter, we deployed our Ordering, Dispatch, and Rails modules at convenience stores or c-stores. Two examples include Maverik Adventure's First Stop, an Intermountain West operator with nearly 400 stores across 12 states; and second, an East Coast operator with more than 200 locations. With Olo solutions, guests of these c-stores are now able to order fresh food for pickup or through delivery.\n\nAs I've mentioned in the past, c-stores are an exciting emerging vertical for Olo, given their 55,000 location opportunity representing c-stores with fresh food programs. We also continue to grow our partner network this quarter, which enables our customers to leverage our platform to tap into best-in-class applications and services that are fully integrated into Olo. Our open platform provides restaurants with access to more than 300 technology providers, significantly more integrations than many other platforms. This quarter, we added technology partners in both autonomous and piloted delivery, as well as voice artificial intelligence, or AI.\n\nWe're excited to offer these cutting-edge technologies to our customers. More specifically, Olo Dispatch network now offers autonomous and piloted delivery robots through partnerships with certified delivery providers, Coco delivery, Refraction AI, and Serve Robotics. Last-mile delivery is oftentimes the most complicated and costly aspect of the delivery experience, on average, accounting for 40% of the total cost of delivery. Through these partnerships, we enable brands, such as Modern Market and Newk's Eatery, to empower automated last-mile delivery in specific markets, lowering transportation costs through automation while decreasing pollution.\n\nWe've also introduced partnerships with voice AI ordering solution providers, ConverseNow, SYNC 3 and Valyant AI. These partners provide premier ordering automation technology, facilitating the seamless placement of guest orders at the drive-thru and enhancing the guest experience through shorter drive through lines. For operators, these partners increase average ticket size and alleviate labor shortages by allowing staff resources to focus on food prep, order fulfillment, and guest services. Panda Express, a top 25 brand with more than 2,400 locations, leverages voice AI technology partners to transform the drive-thru, leading to an enhanced digital experience while paving the path to 100% digital.\n\nWe believe unique solutions like voice ordering will enable Olo to expand further into the QSR segment, as well as increase our penetration of digital orders in the space. Notably, the conversion of drive-thru to digital doesn't require consumer behavior change. Operators make the decision to enable digital in drive-thru, converting all orders from analog to digital through voice AI. This represents an exciting leap in the digital transformation of the drive-thru service model that represents the plurality of restaurant industry transactions, over four times larger than delivery.\n\nWe also continue to implement product enhancements to better serve our customers, many of which we showcased in our quarterly public release event held last month. In particular, at the end of October, we announced commercial availability of Borderless, Olo's password-less and platform-level sign-on offering. With Borderless, guests can save and access their own file payment information, along with contact information and delivery addresses across all participating restaurant brands, securely speeding through checkout. By eliminating the need for guests to create an account, remember a password, or manually enter payment details at every purchase, Borderless strives to help restaurants meaningfully increase basket conversion, retention, and visit frequency, driving increased revenue and profitability.\n\nBorderless also aims to enable brands to capture valuable guest data on more orders that were previously anonymous, adding new guests and ordered data to their guest data platform, in the industry's race to de-anonymize every order and uncover guest lifetime value. As our latest platform-level innovation, we believe Borderless is the next step to improving the on-demand commerce experience, empowering brands to capture valuable guest data while delivering superior hospitality through added convenience. And we're excited by the opportunity for Borderless functionality to transform the sign-on and checkout experience for guests, unlocking additional revenue opportunities for restaurants and Olo. Additionally, this past quarter, we introduced new capacity management capabilities across our order management solutions.\n\nAs off-premise volumes increased dramatically during the pandemic, and as labor challenges persist, it's imperative that operators effectively manage kitchen order flow in order to ensure smooth operations in the kitchen, accurate order, handoff or delivery service providers, and properly set guest expectations. This became a key problem for our customers that we believe Olo is best positioned to solve. Through our acquisition of Omnivore earlier this year and by integrating with kitchen display systems, or KDS, data, our platform can now capture crucial on-premise information. Now, restaurants are able to provide more accurate quote times to guests and delivery service provider partners for when orders will be ready for handoff.\n\nNoodles & Company, a fast casual brand with more than 400 locations, is one customer enrolled to pilot this feature. By providing more accurate quote information, Olo enables brands to be as productive as possible and as profitable as possible, all while elevating the guest experience. This is a win-win-win scenario for our partners, our customers, and their guests, as well as a win for OLO, as our platform becomes an essential integrated layer in our customer's everyday operations. These product features play an important part in improving the guest experience and empowering restaurant teams to provide hospitality through optimized operations and personalization.\n\nI'm proud of the tools we provide our restaurant customers and the continuous hard work the Olo team does in order to help our customers do more with less. And I'm honored that the industry recognizes our hard work. Recently, we earned Vendor of the Year award by fast casual brands, Cousin Subs, as well as Noodles & Company. Over the last two years, we've dramatically expanded our core value proposition.\n\nOlo's platform now provides a modular end-to-end restaurant technology offering that encompasses all guest touchpoints: on-premise, off-premise, guest engagement, and payments. We're laser-focused on providing and delivering these solutions to enterprise and emerging enterprise brands, and we're working to ensure that we're aligned from a go-to-market perspective to fully capitalize on our broader opportunity. As we think about our future potential, we continue to believe that ARPU expansion will be the most meaningful driver of growth and the best measure of our success. We expect product adoption to increase across brands as we become an essential layer that aligns customers with Olo's vision of enabling hospitality at scale and empowering restaurants to operate as one business.\n\nAnd finally, as I typically do on earnings calls, I'd like to provide a corporate update. We recently debuted our updated corporate website at olo.com, which showcases the platform's modular end-to-end restaurant technology offering that encompasses all guest touchpoints. We also published a refreshed page for our partner program, Olo Connect, which includes a tiered partner directory of our expansive technology partners. Additionally, we published our first environmental, social, and governance, or ESG, site.\n\nThis site takes a big step toward our ESG disclosure efforts by publishing our environmental and social initiatives and aspirations. We believe the future of hospitality is sustainable. We hold ourselves accountable to managing the impacts that our material topics impose on our company, stakeholders, and planet. Our ongoing ESG strategy development will harness opportunities to enrich our social impacts and lessen our environmental impacts, while centering on strong corporate governance and ethics.\n\nTo close, I'm excited about our future. The Olo platform provides restaurants with mission-critical tools that drive value, allowing brands to do more with less while elevating the guests experience. We believe that Olo's platform is best positioned to meet restaurants needs and drive growth. We're focused on executing to create positive outcomes for our customers, partners, and shareholders.\n\nAnd with that, I'll hand it over to Peter to discuss more detailed results. Peter?\n\nPeter Benevides -- Chief Financial Officer\n\nThanks, Noah. Today, I'll review our third quarter results in detail, as well as provide guidance for the remainder of the year. In the third quarter, total revenue was $47.3 million, an increase of 26% year over year. Platform revenue in the third quarter was $46.4 million, an increase of 28% year over year.\n\nIn terms of key metrics, ARPU for the third quarter was approximately $558, representing a 15% increase year over year and a 3% increase sequentially. Continued growth in ARPU was driven by further expansion within our existing customer base, including continued adoption of Olo Pay. Year over year, the impact from subway locations transitioning from the platform positively impacted ARPU by approximately $25. As a reminder, Subway is a single-module customer with significantly lower ARPU than the average.\n\nSo, as locations transition from the platform, this will have a positive impact on ARPU. As Noah mentioned earlier, we expect ARPU to continue to expand and be a meaningful driver of growth as we further increase multi-product adoption and transaction volumes on the platform. We believe we have a 25x opportunity to expand our booth from its current levels in the early momentum we are seeing with Olo Pay and guest engagement adoption, as well as on-premise ordering trends, gives us conviction in being able to significantly expand ARPU over time. In terms of active locations, we ended the quarter with approximately 84,000 active locations on the platform, an 11% increase year over year and a 2% increase sequentially.\n\nThis number was in line with expectations, as Subway locations held constant over the quarter and as we continue to actively work to alleviate elongated deployment timelines, which we discussed last quarter. And lastly, net revenue retention was approximately 107%, up 100 basis points sequentially. For the remainder of the financial metrics disclosed, unless otherwise noted, I'll be referencing non-GAAP financial measures. Gross profit for the third quarter was $34.7 million.\n\nThis compares to $30.2 million a year ago. The year-over-year increase in gross profit was driven by continued growth in revenue, partially offset by incremental costs associated with our Wisely and Omnivore acquisitions, increased compensation costs to support new locations coming onto the platform and, to a lesser extent, processing costs associated with Olo Pay. Sales and marketing expense for the third quarter was $6.1 million or 13% of total revenue. This compares to $4.2 million and 11% a year ago.\n\nOver the past year, we have significantly increased our product portfolio and, in the near term, plan to continue to invest in our go-to-market team to fully capitalize on the growth opportunities we have within new and existing customers. Research and development expense for the third quarter was $15.4 million or 33% of total revenue, compared to $11.9 million or 32% of total revenue a year ago. General and administrative expense for the third quarter was $10.3 million or 22% of total revenue. This compared to $9 million and 24% a year ago.\n\nThe year-over-year percentage decline was due to continued optimization of expenses within G&A as initial cost to support Olo as a public company continue to scale. Operating income for the third quarter was $3 million compared to $5.1 million a year ago. Net income in the third quarter was $4.3 million, or $0.02 per share, based on approximately 181.9 million fully diluted weighted average shares outstanding. Turning our attention to the balance sheet and cash flow statement.\n\nOur cash, cash equivalents, and short- and long-term investments totaled $469.2 million as of September 30, 2022. This quarter, there were no impacts from the $100 million stock buyback program we announced in September, as we did not initiate share repurchase activity before the quarter ended. Regarding cash flows, net cash provided by operating activities was $3.3 million in the quarter as compared to $10.7 million a year ago. Free cash flow was $1.4 million compared to $10.2 million a year ago.\n\nI'll wrap up by providing our guidance for the fourth quarter and full year 2022. For the fourth quarter, we expect revenue in the range of $48.2 million and $48.7 million and non-GAAP operating income in the range of $2.6 million and $3 million. For the fiscal year 2022, we expect revenue in the range of $183.8 million and $184.3 million and non-GAAP operating income in the range of $9.3 million and $9.7 million. In terms of guidance, our outlook for the fourth quarter and the full year is consistent with the assumptions we discussed last quarter.\n\nElongated sales cycles and deployment timelines have continued. And while we have a robust pipeline and are actively working to speed up deployment, we anticipate these dynamics to continue in the near term. Secondly, we remain committed to driving profitable growth. Inclusive of this past quarter's operating income outperformance, we are targeting slightly higher profitability in the second half of 2022 as compared to last quarter's guidance.\n\nAs we've exhibited all throughout all of this history, we are a financially disciplined organization and plan to continue to maintain this operating principle going forward. And lastly, in the fourth quarter, we entered into a sublease for our headquarters at One World Trade Center. As we continue to embrace a hybrid work environment, we plan to reinvest some related savings into an exciting and more fitting New York-based headquarters, as well as initiate other remote employee engagement activities. To summarize, we continue to deliver an attractive combination of strong revenue growth and profitability as we take meaningful strides toward becoming the engine of hospitality.\n\nWe believe we have a long runway for growth through cross-selling our robust and comprehensive product suite, expanding the use cases of the platform, and continuing to add locations to the platform. With that, I'd now like to turn it over to the operator to begin the Q&A session. Operator?\n\nOperator\n\n[Operator instructions] My first question comes from Gabriella Borges with Goldman Sachs. Please go ahead.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nHi. Good afternoon. Thanks for taking the question. Maybe to start, I'd love to get an update on some of the catalyst points or trigger points for relationships like Jack in the Box, where you're seeing really nice product module expansion.\n\nYou know, the issues that you talked about, the supply chain, the labor shortages, they've persisted for a handful of quarters now. So, we'd love to get an update. What are you seeing in terms of commonalities of trigger points that are leading to expansion within the Olo platform?\n\nNoah Glass -- Founder and Chief Executive Officer\n\nWell, Gabriela, thank you for the question, and welcome to the group. I'd say, you know, with Jack in the Box, and maybe extrapolating beyond Jack in the Box specifically, you know, we've seen great engagement from these large restaurant brands in the enterprise segment, from QSR brands specifically. And it's really about how they want to engage with guests. I think the digital transformation of the industry is something that is permeating every segment of the industry.\n\nSo, it has become a guest expectation and it's operator table stakes. It's about, as you heard from our prepared remarks, better productivity, better profitability, and up-leveling the guest experience. So, we see a lot of these brands, Jack in the Box among them, saying, you know, \"We had a homegrown solution, but we see that there are benefits in engaging with this SaaS platform, like Olo.\" And not so much a buy versus build. But more of a buy and build, to buy into the platform and then to build on top of it, and in the case of Jack in the Box with a third-party agency doing some of the esthetic on top of the Olo engine.\n\nSo, I think that's sort of a natural progression. In the past we have landed with a single module in some of these relationships, proven ourselves out, shown the benefits of platform-level innovation, and all that Olo can do. And then introduce brands to the other modules. There are 12 in total now.\n\nAnd so, going from dispatch into dispatch and also ordering is a very natural progression and growth of the relationship. And we're excited to have the ability to land with one module and then expand into a larger suite of capabilities for all restaurant brands.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nThat's helpful. And as a follow up for Peter, I wanted to pick up on your comments on profitability and balancing the investments that you're making in the opportunity that lies ahead. When do you think we might see a more pronounced inflection in profitability in the model as we think about internal planning assumptions for 2023 and beyond?\n\nPeter Benevides -- Chief Financial Officer\n\nYeah. Thank you for the question, Gabriel. So, in terms of profitability trends, I think at this point, you know, what we've shared is that we remain committed to maintaining profitability while delivering strong growth. And we believe we can do that because, one, just the core DNA of Olo and the discipline we have in terms of financial management.\n\nI think we've shown that over our history, burning less than $6 million in total investment to reach $100 million of ARR. That discipline, coupled with our highly efficient go-to-market in support motion, enables us to drive profitability and growth at the same time. You know, as we look ahead for 2023 and beyond, we believe that we can continue to do that in terms of driving profitable growth and attractive growth for the long term.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nAnd so, just to put a finer point on that, do you think 2023 will be a year of margin expansion?\n\nPeter Benevides -- Chief Financial Officer\n\nYeah, I think look, I think there's, you know, a lot that's happening in real time as it relates to both the top line and the bottom line. What I will say is that, you know, where we stand today, we are, you know, highly focused on making sure that we are allocating capital to the parts of the business that we believe will drive the greatest long term-value for our shareholders and long-term growth and, in doing that, maintaining profitability.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nThanks for the color.\n\nOperator\n\nOur next question comes from Terry Tillman with Truist. Please go ahead.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nHey, good afternoon, Noah, Peter, and Stephanie. First, I just want Zaxby's. They're all throughout Atlanta, so that's nice to see. I'll be sure to find out how those -- that experience is firsthand.\n\nMaybe the first question for you, Noah, is just -- you know, when we talked to investors in the past, it's like, how big is this TAM? Is there a low ceiling and high ceiling, etc., because it's just online ordering? We're now hearing you talk about digital entirety and on-premise over a number of quarters. I think you said 50 brands, 1,000 locations. So, I'm kind of curious, where do you see like revenue now? Where does that stand in terms of on-premise dynamic?\n\nNoah Glass -- Founder and Chief Executive Officer\n\n[Audio gap] The transactional SaaS model are built. Just back to your TAM comment for a moment, and then I'll pass it over to Peter to see if he wants to add on to that. We really think that no matter how you look at it, we are in the very, very early innings of penetrating our TAM. We are well below 2% of the addressable TAM that's out there in the segment that we serve.\n\nAnd I think we look at these drivers of growth, ARPU being the biggest one, and of course, moving on premise is part of capturing more transactions. Olo Pay is another part of making each one of those transactions a higher revenue event for Olo. And we think that that's the largest part of the TAM expansion or the revenue expansion into that TAM. There's location growth as well.\n\nAnd I'm proud also that, you know, we have in Dairy Queen and in Jimmy John's and in Panda Express and Jack in the Box some great top 25 brands and are showing our expanded opportunity to work with those brands as well and to really add value regardless of the scale of the restaurant enterprise. And then, Peter, I'll pass it over to you in case you want to double down on some of the economics of on premise.\n\nPeter Benevides -- Chief Financial Officer\n\nYeah. So Terry, just to answer your question on where the on-premise transaction volumes will appear within the financials. It has the potential to appear both in subscription and transaction. So, in terms of subscription, by having more orders processed over the platform, that will then graduate customers into higher-priced subscription packages.\n\nSo, that will help to drive subscription revenue. And to the extent that customer is utilizing Olo Pay, that will help to drive transaction revenue because of the associated processing fees with Olo pay.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nGot it. That's wonderful. Thank you both for the answer there. I guess, Peter, just a quick follow up in terms of anything you can share at all about how visibility is into 2023 compared to how visibility was going into '22? I know, obviously, we have the macro.\n\nBut the way I'd like to kind of add to that big picture question I just asked, which is probably a hard question is, are you seeing the revenue come in as you expected for Olo pay? I think you said up to a couple million now. And I think customer engagement was going to do about 10 million. So, maybe you could talk about how they're performing and just any comments about visibility going into '23? Thank you.\n\nPeter Benevides -- Chief Financial Officer\n\nYeah. So, we've been pleased with the progress across both Olo pay and guest engagement. So, specific to Olo Pay, this past quarter, we generated just under $2 million of revenue associated with Olo Pay. And for the year, we're now estimating $5 million of revenue contribution.\n\nSo, great momentum there. I think part of the momentum that you're seeing with respect to Olo Pay is, you know, brands and operators prioritizing deployment of products that are a relatively light lift to deploy and also provide very fast time to value. And that is the case with Olo Pay. It's a light-touch deployment, and the time to value is immediate.\n\nAnd I think part of that prioritization by brands and operators is due to that continued labor -- you know, dynamic labor challenges that we've discussed prior calls. In terms of 2023, so, you know, obviously, it's still a little early. There's a lot that's happening in real time. I think where we stand today, we are planning as though the sales and deployment dynamics continue into 2023.\n\nBut that said, I think despite, you know, the macro challenges, I think there's a lot of reasons to remain excited about the go-forward. So, I think, first off, our sales pipeline for both new business and upsells remains robust. And we anticipate that's going to continue as brands continue to look to do more with less and leverage digital to increase sales and improve margins. Secondly, food away from home and digital ordering in general has remained durable.\n\nAnd that is in part because food is not discretionary. Everyone must eat. And you're seeing that across a variety of data points within the industry. And then, lastly, I think our enterprise focus in the market share we have within the limited service segment, I think, provides some additional resiliency as we head into 2023.\n\nSo, certainly still a lot going on at the moment, but, you know, a lot of positives to remain excited about the go-forward.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question comes from Stephen Sheldon with William Blair. Please go ahead.\n\nStephen Sheldon -- William Blair -- Analyst\n\nHey. Thank you. First one I'd ask about just the longer sales cycles. I know that's happening for a lot of enterprise SaaS companies, and you still had plenty of wins this quarter.\n\nBut what do you think is specifically driving the delay in decision-making here? Or are a lot of the enterprise restaurant concepts that, you know, you're kind of going after, they're just distracted with a variety of other issues? And what do you think it could take for those cycles to more or less normalize?\n\nNoah Glass -- Founder and Chief Executive Officer\n\nHey, Stephen. This is Noah. Thanks for the question. I think, you know, we are being prudent as we look at this quarter and think about the near term.\n\nWe are sort of staying consistent with what we guided to last quarter. At the same time, I think there is some light at the end of the tunnel. There are some of those dynamics that are causing restaurant brands or that were causing restaurant brands to be a little bit slower to make decisions or to implement those decisions that are normalizing. So, there are things like wholesale food prices that are starting to come in.\n\nThere are things like the labor environment starting to tick back up, not quite yet at pre-pandemic levels but getting closer to it. And so, you know, I think we're being prudent. We're being financially responsible in the way that we're modeling and the way that we're planning. But I think that, you know, what is abundantly clear, as we look at all those business, as we think about the current macro as something that is kind of a temporary crosswind, and I think -- you know, we've seen moments in time like this in our history, 2008, 2009.\n\nI would contrast that with the digital transformation of this $1 trillion restaurant industry. That is a mighty and persistent tailwind that's been at our back for 17 years and will be at our back for many, many years to come, especially as restaurant brands are looking to lean into digital transformation for the very reasons that Peter just mentioned, getting more productive, getting more profitable, and at the same time, upleveling the guest experience.\n\nStephen Sheldon -- William Blair -- Analyst\n\nGot it. That's really helpful. And then, as a follow-up, just as we model active locations for the fourth quarter, can you just help us frame the moving pieces on locations, especially with Subway continuing to roll off. I think you'd talked before about that being progressive in the fourth quarter and potentially in the early 2023.\n\nIs that still the right expectation for those remaining locations, just given the visibility you have right now?\n\nPeter Benevides -- Chief Financial Officer\n\nYeah, that's right. So, consistent with what we shared last quarter, we are targeting 2,000 net new locations in the fourth quarter. Specific to Subway, the way in which we count an active location for Rails is a location having had at least one order in the period. So, even as remaining locations begin to off-board this quarter into early Q1 of next year, they'll show up in the active location count, having generated at least one order in the period.\n\nSo, we'll be -- we'll just make sure to be very clear on how that is evolving throughout the quarter and into early next year.\n\nStephen Sheldon -- William Blair -- Analyst\n\nSounds good. Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Matthew Hedberg with RBC. Please go ahead.\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nGreat, thanks guys. Following up on the question on sales cycles, Noah, I know last quarter you talked about a little bit different implementation headwinds, tailwinds between corporate-owned and franchisee-owned restaurants. I'm wondering if there's anything that changed in the dynamic of those two restaurant styles, I guess. And then maybe as a follow-up, Diego's been on now for a few months as CRO.\n\nYou know, I guess from that perspective, are there things that you guys are doing specific that could counter -- that could cut through macros and maybe it's something he's implemented thus far?\n\nNoah Glass -- Founder and Chief Executive Officer\n\nHey, Matt. Thanks for the two questions. I would say, nothing pronounced as a difference between corporate-owned brands. Those are pretty rare.\n\nThose brands that have all corporate locations. Most of the industry, whether we're talking about enterprise or emerging enterprise, are a smattering of corporate stores but primarily franchisee locations. And last quarter, we mentioned some of the efforts that we were taking, making things easier on the restaurant brands to do the implementation themselves, to do the deployment themselves, also using third parties to do deployments, you know, as an augmentation for the restaurant brand. And then -- although taking on more of the work.\n\nAnd I think, when I talk about these deployments that we're celebrating this quarter, take one, take Jack in the Box of rolling out to 2,200 locations, that is deploying to 2,200 locations in a highly franchised environment. I think it's showing how those efforts that we're making are helping to get brands that have been sold and are showing up in bookings actually deployed and live on the platform for their operators' benefit and for the guest benefit and, obviously, for Olo's benefit. When I think about Diego and some of the things that he's focused on in the role of chief revenue officer, it really aligns with our commentary around the growth drivers of the business. So, we are very focused on ARPU as a huge driver of growth.\n\nAnd that is about selling additional modules into existing restaurant customers who are asking us to play a larger role because we're a mission-critical platform, and we've become something of a digital transformation area [Inaudible] to these brands. So, they're asking us to do more with them. And we now have a lot more to offer because of our great product R&D and the M&A activities that have added new modules into our platform. So, we're focused on that.\n\nWe're focused on selling in Olo Pay, selling in guest engagement, and, of course, we're still focused, very focused on landing additional restaurant brands from the enterprise segment and the emerging enterprise segments. I'd say, you know, we are rightsizing our investments to go after all of those opportunities and believe that we have so much room to grow and a huge TAM to grow into under Diego's leadership.\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nThanks, Noah. I really appreciate the color.\n\nOperator\n\nOur next question comes from Brent Bracelin with Piper Sandler. Please go ahead.\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nHi. This is Clarke Jeffries on for Brent. First question is around ARPU growth. You know, 3% sequential growth in ARPU certainly looks healthy.\n\nJust wondering maybe Peter, what kind of ARPU growth do you think you can achieve either based on the Olo Pay rollout or multiple software module rollout? Do you think it could be sustainable at these kinds of levels for sequential ARPU growth? And then, you know, maybe second on that, you know, reaching a point where there are now 12 modules to sell. From a philosophy perspective, from a growing efficiently perspective, do you think you might change to preference more overall ARR or total contract value added at a lower gross edition level, as in more multi-module lands and that growth additions could take a backseat to the growth model over the, you know, next 12 months to 18 months?\n\nPeter Benevides -- Chief Financial Officer\n\nYeah, so in terms of the ARPU sequential growth trend, I think, if you go back in time, I think the growth has been from a trend-line perspective lumpy at times. And part of that is because of how products are deployed, as well as the number of products that are subscribed to from the onset of the relationship. So, depending on, even if a customer subscribes to say three products at the onset of the relationship, they may roll out one at one time and then the second and third at a subsequent time, which would make the trend line a bit smoother versus some customers deploying all three modules right from the onset. The way I would think about the long-term kind of growth rate or growth potential for ARPU is really through that 25x opportunity lens.\n\nAnd that is really by driving more transactions on the platform, as well as increasing the adoption of Olo Pay. So, looking at the ARPU from where it stands today on a quarterly basis, having a 25x opportunity to expand that number over time. And then, if I'm -- in terms of your second question, if I'm understanding that right, I think the question is around the ability to expand ARPU over time if more and more customers are landing with more products at the onset of the relationship. I would say we're -- we've seen more of that in the emerging segment of the business, which we noted on the call, where, oftentimes, that segment of the market is coming to us.\n\nAnd they're wanting us to solve a number of pain points from the onset of the relationship. So, they're typically taking order management, delivery enablement, and now, more recently, Olo Pay. I think that, obviously, you know, presents some challenges to further expand ARPU when you're taking everything upfront. But I think we would, obviously, enjoy that problem in being able to have a higher ARPU from the onset of the relationship.\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nMakes sense. And I think I had a follow-up related to it. Seems like a lot of the enterprise lens you've noted this quarter were relationships that took more of the modules upfront instead of just ordering. But, Noah, I wanted to ask about how do you view the industry changing around proprietary versus legacy replacement? Maybe you can help us frame the sort of portion of engagements where you're going in and replacing proprietary versus a legacy solution.\n\nIt seems like the Jack in the Box deal was very much based on your competency in integrating with the proprietary. So, I'd love to just get your thoughts on how that's evolved over the history of the company and where you sit today.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nWell, Clarke, thank you. I think that's usually up for an important point, which is that the trend has certainly been that brands are migrating from homegrown to Olo. And if I just think about the time, really, over the last 18 months since our IPO, there are 10 sizable brands that have made that transition. Carl's Junior, Carrabba's Italian Grill, Hardee's, Jack in the Box, Outback, Potbelly, Ruby Tuesday, Smashburger, TGI Friday's, and, now, Zaxby's.\n\nAnd I think this is exactly what we were hoping to see by becoming a public story, by brands seeing the strength of Olo's business, the strength of Olo's balance sheet, hearing our philosophical commitment to being an independent and open platform, and then seeing some of the platform-level innovation that we've been able to bring to life. First in Dispatch, that in Rails, most recently in Borderless. I want to come back to that in a moment. These are things that brands can't build themselves.\n\nThey are things that you can build once you've built a two-sided network of many brands on one side and many partners on the other. If I think about Borderless as the extreme example of this point, this is a two-sided network that we've created that connects the 84,000 restaurants on our platform. And for those of you who don't know the industry super well, 84,000 restaurants is very large. Take every McDonald's in the United States.\n\nIt is six times every McDonald's in the United States, the number of locations. And it connects those to 85 million restaurant guests that order through Olo. That's more than the entire population of Germany. Olo is then serving as the conduit between those restaurants and those restaurant guests and creating a win-win, a better experience for those restaurant operators and for those restaurant guests who no longer have to create an account, remember a password, reenter payment details.\n\nThey have a better, faster experience. And it leads to those restaurant brands getting more of that guest data into their guest data platform, which is really the holy grail. This is what restaurants are looking for, ways in which they can get guest data into their guest data platform, de-anonymize transactions, and tie every transaction back to a guest account so they can unlock and uncover the guest lifetime value. And I think that's something that Olo is uniquely able to do and really where the industry is headed.\n\nAnd so, I think when you compare that to just the tactical building of functionality for on-demand commerce, it just -- there's no comparison to what we're able to build as a platform serving the industry as a whole.\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nReally appreciate the color. Thank you very much.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] There are no further questions. This concludes the question-and-answer session. I would like to turn the conference back over to Noah Glass for any closing remarks.\n\nNoah Glass -- Founder and Chief Executive Officer\n\nOK. Well, thank you all for joining us again today. We are honored to be a mission-critical platform for the restaurant industry and to serve as the engine of hospitality, helping restaurants to drive sales, do more with less, and make every guest feel like a regular. Thank you, team Olo, for your hard work and execution.\n\nWe have miles to go before we sleep.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStephanie Daukus -- Vice President, Investor Relations\n\nNoah Glass -- Founder and Chief Executive Officer\n\nPeter Benevides -- Chief Financial Officer\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nStephen Sheldon -- William Blair -- Analyst\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nMore OLO analysis\n\nAll earnings call transcripts"
}