{
  "companyName": "Vasta Platform Limited",
  "companyTicker": "VSTA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/vasta-platform-limited-vsta-q2-2022-earnings-call/",
  "content": "Vasta Platform Limited (VSTA)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon and welcome. My name is Emma and I will be your conference operator today. At this time, I would like to welcome everyone to the Vasta second quarter 2022 earnings conference call. [Operator instructions] Bruno Giardino, CFO, you may begin your conference.\n\nBruno Giardino -- Chief Financial Officer\n\nGood evening, everyone, and thank you for joining me in this conference call to discuss Vasta Platform's second quarter 2022 results. With me on the call today, we have Mario Ghio, Vasta's CEO; and Guilherme Melega, Vasta's COO. During today's presentation, our executives will make forward-looking statements. Forward-looking statements generally relate to future events or future financial or operating performance and involve known and unknown risks, uncertainties, and other factors that may cause our actual results to differ materially from those contemplated by these forward-looking statements.\n\nForward-looking statements in this presentation include, but are not limited to, statements related to our business and financial performance, expectations for future periods, our expectations regarding our strategic product initiatives and their related benefits, and our expectations regarding the market. Forward-looking statements are based on our management's beliefs and assumptions and on information currently available to our management. These risks include those set forth in the press release that we issued today as well as those more fully described in our filings with the Securities and Exchange Commission. The forward-looking statements in this presentation are based on information available to us as of the date hereof.\n\nYou should not rely on them as predictions of the future events and we disclaim any obligation to update any forward-looking statements, except as required by law. In addition, management may refer to non-IFRS financial measures on this call. The non-IFRS financial measures are not intended to be considered in isolation or as a substitute for results prepared in accordance with the IFRS. Let me now give the call over to Ghio to make his opening statements.\n\nMario Ghio -- Chief Executive Officer\n\nThank you, Bruno. Thank you all for participating in our earnings release. Let's jump to the highlights of the quarter on Slide number 4. As the main highlights, we can see that Vasta has not only consolidated the recovery of profitability but also delivered a strong cash flow generation, attesting that the business is back to normal, following a 2021 cycle severely hit by the pandemic.\n\nNet revenue grew 35% year on year and 27% in the cycle to date, driven by an acceleration in growth of subscription revenue that grew 33% in the 2022 cycle to date and is representing almost 90% of the total revenue of the company. And that shows that Vasta is a true platform with predictable and recurrent revenues. Adjusted EBITDA was BRL 11 million in the second quarter, recovering from a loss of BRL 17 million in the same quarter last year. In 2022 cycle to date, the adjusted EBITDA margin expanded 6.6 percentage points to over than 30%, the highest for this period in our recent history.\n\nWe attribute this increase not only to the normalization of the business and sales mix of superior quality, but also to efforts such as the workforce optimization and our financial discipline. Operating cash flow totaled BRL 103 million in the second quarter, a significant improvement from a consumption of over BRL 60 million in the second quarter last year, driven by the recovery of operation -- operating results and better working capital dynamics. As we approach the end of 2022 cycle, subscription net revenue growth converged to the 35% growth implied by our 2022 ACV of BRL 1 billion. Therefore, we reiterate that in 2022, we will collect 100% of the ACV by the end of this commercial year or by the end of the third quarter of this year.\n\nWith that being said, I pass the word to our COO, Guilherme Melega.\n\nGuilherme Melega -- Chief Operating Officer\n\nThank you, Ghio. Now moving to Slide number 5, we detail the ACV growth composition. In 2022 cycle to date, more than 85% of 2022 ACV was already captured. The different seasonality of our brands, namely Eleva and Mackenzie, has led to a less concentrated distribution of subscription revenue along the 2022 cycle when compared to previous cycles.\n\nFor the following quarter, we expect ACV recognition to be 14.5%, which guides for a full recognition of ACV within 2022 cycle, as Ghio mentioned. Now I'll turn the floor to our CFO, Bruno Giardino, who will talk about the financial results of the quarter.\n\nBruno Giardino -- Chief Financial Officer\n\nThank you, Melega. In the Slide 5, we present the composition of Vasta net revenue in the second quarter of 2022. As you can see in the left side, total net revenue increased 34% year -- 35% year on year to BRL 190 million. Moving to the right side, we see the components of revenue growth.\n\nIn total, subscription revenue jumped 48%, driven by an acceleration in the recognition of ACV when compared to the previous year, plus the contribution of Eleva. Subscription revenue was mostly composed of revenue from Learning Systems, as the delivery of PAR and complementary solutions occur mostly in the first two quarters of the cycle. Moving to Slide 6. We analyze the net revenue for the 2022 cycle to date from fourth quarter '21 to second quarter '22.\n\nNet revenue grew 27% in this period, driven by a 33% growth in subscription revenue. As we approach the end of the cycle, we see the growth in subscription revenue converging to the ACV growth of 35%. Non-subscription revenue fell 6%, in line with our initial expectation of stability or a small decline in this line. In the following slide, adjusted EBITDA totaled BRL 11 million, a relevant increase from the minus BRL 17 million of the same quarter in the last year.\n\nThis improvement was driven mainly by operating leverage gains, cost savings, and better sales mix with the growth of subscription products and the contribution of Eleva. In proportion of net revenue, gross margin grew 580 bps, while adjusted cash G&A expenses and commercial expenses were down 270 bps and 50 bps, respectively. There was also a significant decrease in the provision for doubtful accounts as there was a hike in the provision in second quarter '21 to accommodate the impacts of the pandemic on our receivables. As a result, adjusted EBITDA margin reached 5.9% in the second quarter this year versus a negative margin of 12.2% in second quarter '21.\n\nIn the 2022 cycle to date, adjusted EBITDA grew 59%, reaching BRL 313 million, with margin increase of 660 basis points. This is evidence that Vasta's profitability is now standing at a much higher level than last year and closer to the company's potential. In terms of adjusted net profit in the second quarter, despite the growth in operating profit, we posted an adjusted net loss of BRL 42 million, worse than the same quarter last year, mostly driven by the higher financial leverage of the company and the higher interest rates in the country. In the 2022 cycle to date, adjusted net profit totaled BRL 62 million, slightly down compared to the 2021 cycle.\n\nMoving to the Slide number 9, we show the operating cash flow solution and this is the main highlight of the quarter, in our view. In this quarter, operating cash flow totaled BRL 103 million, a significant improvement when compared to the second quarter '21 when we normalize it -- even when we normalize the operating cash flow of that quarter by the early receipts of accounts receivable amounting to BRL 52 million. In the cycle to date, the operating cash flow totaled BRL 31 million or BRL 58 million when excluded the early payments of royalties to content providers in the amount of BRL 20 million. This is also an improvement compared to the previous cycle, which had consumption of BRL 113 million.\n\nNext, I'll give more details on the provisions in our accounts receivable. As you know, over the last quarters, we have recognized higher provision for doubtful accounts due to the challenging business environment for our school partners as well as our decision to support them by extending payment terms. In the cycle to date, we have seen a gradual normalization in the payments aligned with the restoration of school partners' regular activities, but this restoration is not yet completed. That's why the average of days of accounts receivables was 140 days in this quarter, still 22 days above the same quarter of the previous year.\n\nBy adjusting this metric by Eleva's last-12-month net revenue, the average term was lower at 133 days. Moving to the next slide. Vasta ended the second quarter with a net debt position of BRL 865 million. From the first quarter, the decrease was related to the operating cash flow generated in the quarter, as mentioned before, partly offset by the interest accrual over our net debt position.\n\nIn the right chart, we see that our leverage measured as net debt to last-12-month adjusted EBITDA has started to decline since the first quarter, reaching 3.04 times in the second quarter '22, or 2.98 times including Eleva's last-12-month in full. We expect the downward trend to continue over the coming quarters as our adjusted EBITDA base increases. Next, let's talk about Educbank. This has -- this was our last acquisition recently announced in July.\n\nSo we acquired a minority interest in Educbank, the first financial ecosystem dedicated to K-12 schools. For those that are not familiar with this business, Educbank provides educational institutions payment guarantee to school tuition, making the usual uncertain flow of tuitions over the school year a regular monthly flow of cash discounted by a take rate earned by Educbank. In the bottom of this slide, there is an illustration of how the business works. This is a market that we estimate to have a total payment value of BRL 70 billion, 7-0 billion.\n\nThe investment will total BRL 158 million for a 47% stake to be paid in two ways. First, BRL 88 million in cash over the last -- over the next two years according to the growth of Educbank's student portfolio; and two, BRL 70 million in capitalization of credits arising from the sale of Vasta to Educbank the right of -- to access our base, our client base. Vasta will have the right to appoint two members out of six to the board of directors of Educbank, which will continue to be indefinitely managed by the founders. As Vasta will not consolidate Educbank in its balance sheet, Educbank results will be recognized via equity income.\n\nWith that being said, I'll pass the word back to Ghio.\n\nMario Ghio -- Chief Executive Officer\n\nThank you, Bruno. Moving to the next slide, I will give you more details of the reason why we invested in Educbank and why it's important for Vasta's platform, to access new revenue pockets and build products that complete our portfolio to K-12 schools. Since the IPO, we had several developments in our platform, such as reinforcing our core content with Eleva acquisition, the creation of Fibonacci Learning System and the distribution agreement with Mackenzie. We also expanded our complementary solutions and entered the B2B2C segment through the launch of Plurall MyTeacher and Plurall Adapta.\n\nIn the bottom, in the digital services, we completed the acquisition of SEL, EMME and Phidelis, aiming to build a portfolio with administrative services that will address the needs of our partner schools, freeing up time for them to focus on what they know the best, to educate. With the Educbank transaction, Vasta gains exposure to the K-12 payment needs, a still unexplored segment for us, adding another arm in the development of its digital services platform. Moving to the next slide, ESG report. From this quarter on, Vasta will report updates about ESG standards, including a quarterly panel of key indicators in line with the topics identified in the materiality process, reinforcing our commitment with the highest ESG standards.\n\nCommitted to accountability and transparency, Vasta launched the first Greenhouse Gas Emissions for its operations. The purchase of renewable energy reduced Vasta's total emissions by 14%. Another highlight in the quarter was the Afro Internship Program, which will create exclusive intern vacancies for Black people in the organization. In the environmental field, 97% of the energy consumed in this quarter comes from renewable sources, being 100% in our largest distribution center in São José dos Campos.\n\n100% of our suppliers are FSC certified. In the social field, 47% of all of our leadership is women. Permanent space in PROFs -- and we also provide the permanent space in PROFs to give visibility to the pedagogical actions for Black teachers. A program of mentoring from Instituto SOMOS accelerates 371 young talents from public schools.\n\nAnd we know that for every BRL 1 we invested in Instituto SOMOS, more than BRL 11 are generated in benefits to society. In the governance fields, we have a diverse Board of Directors with 42% independent members and a relevant female participation that granted us the \"Women On Board\" Seal. Important to mention that Vasta received no complaints in this quarter related to leaks or loss of data. Having said that, I finish our presentation and now I open the Q&A session.\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Your first question today comes from the line of Lucca Marquezini with Itau. Your line is now open.\n\nLucca Marquezini -- Itau BBA -- Analyst\n\nHi, everyone, and thanks for taking my questions. The first one would be, with the acquisition of Educbank, Vasta now should offer partner schools services that go beyond learning systems and academic solutions. That said, what should we expect in terms of the relevance of financial solutions in the consolidated net revenue in the long term? And then secondly, regarding PDA, there was a significant decrease year over year as provisions went up last year due to the higher delinquency caused by the pandemic. Should we consider the number reported in this quarter as the normalized level from now on? Thank you.\n\nBruno Giardino -- Chief Financial Officer\n\nThank you very much, Lucca. Regarding your question on the projections for financial services, it's still too early to tell because Educbank is a new business. It's a nascent business, let's put this way. It's in an accelerated ramp-up of revenue, but it's still small.\n\nSo it's -- we cannot predict how important it will be when compared to our traditional business. However, we see a huge potential total addressable market of -- that may surpass more than BRL 70 billion. This is more than the -- this is more than the addressable markets we have for other products we have here in the company. So it's definitely a great potential and we think that Educbank will be relevant in the future; financial services will be relevant in the future.\n\nThat's why we wanted to be in this business. However, it's too early to give any kind of prediction of how representative this will be within our revenue pie, OK? Second question regarding PDA. I think we are on our way to a normalized level. We are not there yet, I would say.\n\nWe think that when the situation normalizes, we should have a PDA over revenue less than 2%, perhaps approaching 1%, which is the historical level of the company. So we are not there yet. We are getting there. Eventually, 2023, we can be around that level, below 2% or closer to 1%, as I mentioned, OK?\n\nMario Ghio -- Chief Executive Officer\n\nLook, if I may add, this is Ghio speaking. If I may add something regarding the first question. It's important to understand that Vasta is serving today more than 5,300 schools. And we know that the total amount of tuition in those schools are around BRL 17 billion per year, right? So that's the -- that's the SAM for Educbank in our base of clients.\n\nSecond, important to mention that we have a minority stake. So we are not consolidating Educbank in our P&L, right? So you are not going to see the Educbank revenues in our P&L, right? And third, it's super important to understand that for us, it's super powerful, the combination of Phidelis, which is our financial and academic ERP, plus Educbank. So we are aiming to provide the partner schools everything they need to be a better school in terms of in data, to be more efficient and also to have the school -- to help the schools to have this working capital, right, through Educbank. So more important than having Educbank is having the combination of Educbank and Phidelis embedded in our digital platform.\n\nLucca Marquezini -- Itau BBA -- Analyst\n\nThanks, Ghio and Bruno, that was very clear.\n\nOperator\n\nYour next question comes from the line of Vitor Tomita with Goldman Sachs. Your line is now open.\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nHello. Good evening, everyone, and thanks for taking our questions. A couple of questions from our side. The first one is if you could share any initial views regarding the early commercial trends in the sales cycle for 2023? And our second question would be how do you see the likelihood of revenues for this cycle actually surpassing 100% of ACV given the strong revenue performance of complementary solutions so far? Thank you.\n\nMario Ghio -- Chief Executive Officer\n\nVitor, just to clarify regarding your second question is if we are expecting to have more revenue than the ACV of this cycle, right?\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nYeah. Of this cycle, if the -- if you think that's possible. Thank you.\n\nGuilherme Melega -- Chief Operating Officer\n\nOK. So I'll start here. Vitor, this is Guilherme speaking. So initial view of the commercial cycle was very good, very positive.\n\nWe had a very good first half of the year. As we all know, the first half is not the peak of the season. The peak is yet to come. But so far, so very good.\n\nWe had a sound campaign until July 31st, both in core content and complementary. We have new products in complementary, especially in bilingual, that are leading us to a very good campaign. So we are very positive about the campaign. We are keeping the trend the same we did last year, so we expect to reach our goals.\n\nAnd regarding ACV, we do not expect any increase in ACV recognition from the previous BRL 1 billion that we already guided the market. We are seeing the contracts performing as expected. And we have a different seasonality this year. That's why Q2 is more concentrated in ACV, but Q3 will most likely deliver what is expected to reach the BRL 1 billion.\n\nMario Ghio -- Chief Executive Officer\n\nAnd Vitor, just adding a little bit more color on this marketing campaign. We are seeing interesting movement. That is, we are selling more premium brands than our mainstream brands, right? And that's very, very important, not only because premium brands, they have a higher average ticket, but also because the churn in the medium and long term, the churn of a premium brand is lower than a mainstream brand. So we saw -- I don't know if you remember, but we saw the same phenomenon happening in the last cycle as well.\n\nSo it's important to mention that, not only because Anglo is performing very well, pH is also performing very well, but we have this new third premium brand, which is Fibonacci, right? We have created Fibonacci exactly to address this need for more premium brands in some places where Anglo and pH were already installed, right? So I guess this is the trend that we are seeing. So far, as Melega said, we are in the middle of a marketing campaign, but so far, so very good.\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nVery clear. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Marcelo Santos with J.P. Morgan. Your line is now open.\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nHi. Good evening. Thanks for the opportunity to ask questions. I have two.\n\nThe first, if you could provide an update on the B2C2B initiatives? Hope I got this right this time. And the second one, if you could give us an idea on how your leverage should progress? So you got to around three times net debt to EBITDA now. How do you see that going forward? And what is -- what would be a comfortable level? Thank you.\n\nMario Ghio -- Chief Executive Officer\n\nGreat. So Marcelo, thank you for the questions. I'm taking the first one. We are in the full deploy -- fully deploying our Plurall MyTeacher and Plurall Adapta, right? We are seeing hundreds of new private classes given every month.\n\nAll the KPIs that we are seeing in our reports are very good. So we can really say that we have an excellent new edtech as part of our platform, right, especially in Plurall MyTeacher. Plurall Adapta, it's going fine as well. We are launching -- we started -- the first product of Plurall Adapta was focusing on the secondary school.\n\nRight now we are launching products for the high school as well and that opens more opportunities for us. And as you may remember, we also said a little bit in the last call about Plurall MyTherapy, right? So we are we are piloting all the tech framework to deliver a good experience in providing students and families the connection with a good therapist. And as soon as we see that the product is it's OK, we are going to launch or I mean we are going to deploy or to connect in our platform, right? Now I'll pass to Giardino.\n\nBruno Giardino -- Chief Financial Officer\n\nGood evening, Marcelo, I was waiting for the margin question, but thanks for the leverage question anyway. Our expectation is to have our net debt to adjusted EBITDA in a level lower than three times by the end of this year, right? This could go down in a faster speed, but we are now committed to invest the money on Educbank, right? So this, maybe our leverage do not fall as fast as expected. But for sure, we expect to end the year below three times. And I think next year, even lower as we project to be growing EBITDA next year, right? So we probably -- we should pursue a leverage of around anywhere between two times and three times, I think, would be a good leverage level for the company considering our current structure of capital, OK?\n\nMario Ghio -- Chief Executive Officer\n\nAnd we are also improving the EBITDA to cash, right? And given that you touched -- you mentioned the margins, you can give more color on that.\n\nBruno Giardino -- Chief Financial Officer\n\nSure. Marcelo, we reiterate our perception and our belief that margins will expand in 2022 when compared to 2020, right? So anywhere higher than the 26-point-something level we had in 2020, OK?\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nOK. Perfect. I would ask that as a follow-up, so thanks a lot.\n\nBruno Giardino -- Chief Financial Officer\n\nI knew you will do that, thank you.\n\nOperator\n\n[Operator instructions] We have one more question here from Marcelo Santos again with J.P. Morgan. Your line is open.\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nSo instead of the margin question, I'll ask about M&A outlook. How is your pipeline doing now? What's -- how is your appetite? And are the prices of non-listed companies in sync with listed -- have they gone down? Any perceptions there would be great. Thank you.\n\nMario Ghio -- Chief Executive Officer\n\nYep. So we have -- I would say we have a strong pipeline of not acquisitions, but companies that we are studying. We are focusing more on the side of complementary solutions in edtech, right? We are -- at this moment, we are talking to -- in the core content, I mean we are talking to two small players in the market, right? Because as you know, we and the other player, the other listed player, we have around 50% of market share in the learning system market. And that means that 50% of the market is still in the hands of medium and small guys, right? We are seeing these small guys initiating talks to -- in terms of M&A and acquisitions and so on, right? But we are -- as always, we are focusing more on how can we complete our platform.\n\nEducbank was a very, very important investment. Now we are connecting Educbank with Phidelis and that will generate not only more revenues, more cash, more EBITDA and so on, but also we will increase the stickiness of our platform, right? Let's have in mind that after a school adopting our ERP and having all the services regarding the working capital will be tough to leave our platform, right? So there are opportunities. We are looking for not listed companies, if I understood the other part of your question. Now currently, we are not aiming any other listed company.\n\nBut if we had an opportunity to complete or to bring more services, more TAM, especially more TAM to our platform, we are -- we'll be always open to understand.\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nActually, I was not so ambitious to ask if you would buy Arco or anything like this. I was just asking if the price that the non-listed are asking, if it makes sense or -- because we usually hear that non-listed companies are still with an old mindset and trying to ask too high of a price, it didn't decline. So I just wanted to -- like in your conversations, has the pricing environment become more rational on this M&A market or no? That was the actual question.\n\nMario Ghio -- Chief Executive Officer\n\nYeah, got it. I can tell you that if it's irrational, we don't talk, right? We are -- all the opportunities we are studying now, they are pretty rational, especially the guys that are suffering a lot with the kind of players that we and Arco represent to the market, right? We are not seeing some irrationality in the market, I guess. This year is better than last year.\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nPerfect. Very clear. Thank you.\n\nMario Ghio -- Chief Executive Officer\n\nCompared to the last year, I guess, is better, at least with the kind of assets we are talking to.\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nPerfect. Very clear. Thank you.\n\nOperator\n\nThis concludes today's Q&A. I now turn the call back over to Bruno Giardino.\n\nBruno Giardino -- Chief Financial Officer\n\nThank you, Emma. Guys, I would like to take the opportunity to make an important announcement here. After a cycle of nearly two and a half years within Vasta, first year, helping in the preparation for the IPO and later as the CFO of the company, I will begin a transition period with the new CFO of Vasta, Mr. Cesar Silva, and after that, I will be dedicated to personal projects, OK? So from today until September 15th, I will be transferring my activities to him.\n\nAnd for your information, Cesar Silva is currently Cogna's controllership director. He has more than 15 years -- more than 25 years of experience in the financial management and controllership. And I'm sure that he will be a great addition to Vasta's team, right? And as for the part of IR matters, Mario Ghio will succeed myself as the investor relations officer. So I would like to thank you -- to thank all this audience for the presence here.\n\nAnd I would like also to thank my colleagues here at Vasta for the opportunity of having -- for being together and sharing battles with you, such a nice and talented people, particularly these guys sharing the room with me today, Guilherme Melega and especially Mario Ghio. So thank you very much. And this concludes our second Q '22 conference call. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBruno Giardino -- Chief Financial Officer\n\nMario Ghio -- Chief Executive Officer\n\nGuilherme Melega -- Chief Operating Officer\n\nLucca Marquezini -- Itau BBA -- Analyst\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nMore VSTA analysis\n\nAll earnings call transcripts"
}