{
  "companyName": "China Automotive Systems",
  "companyTicker": "CAAS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/china-automotive-systems-caas-q2-2022-earnings-cal/",
  "content": "China Automotive Systems (CAAS 0.35%)\nQ2 2022 Earnings Call\nAug 12, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to the China Automotive Systems' second quarter 2022 conference call. [Operator instructions] It is now my pleasure to turn the floor over to your host, Mr. Kevin Theiss. Kevin, over to you.\n\nKevin Theiss -- Investor Relations Manager\n\nThank you, everyone, for joining us today. Welcome to China Automotive Systems' 2022 second-quarter conference call. Joining us today are Chairman Chen; Mr. Qizhou Wu, CEO; and Mr.\n\nJie Li, chief financial officer of China Automotive Systems. They will be available to answer questions later in the conference call with the assistance of translation. Before we begin, I will remind all listeners that throughout this call, we may make statements that may contain forward-looking statements. Forward-looking statements represent the company's estimates and assumptions only as of the date of this call.\n\nAs a result, the company's actual results could differ materially from those contained in these forward-looking statements due to a number of factors including those described under the heading Risk Factors in the company's Form 10-K annual report for the year ended, December 31, 2021, as filed with the Securities and Exchange Commission, and in other documents filed by the company from time to time with the Securities and Exchange Commission. If the outbreak of COVID-19 is not effectively and timely controlled, our business operations and financial condition may be materially and adversely affected as a result of the deteriorating market outlook for automobile sales, the slowdown in regional and national economic growth, weakened liquidity and financial condition of our customers or other factors that we cannot foresee. Any of these factors and other factors beyond our control could have an adverse effect on the overall business environment, cause uncertainties in the regions where we conduct business, cause our business to suffer in ways that we cannot predict and materially adversely impact our business, financial condition and results of operations. A prolonged disruption or any further unforeseen delay in our operations of the manufacturing, delivery, and assembly processes within our production facilities could continue to result in delays in the shipment of products to our customers, increased cost, and reduced revenues.\n\nThe company expressly disclaims any duty to provide updates to any forward-looking statements made in this call, whether as a result of new information, future events, or otherwise. On this call, I will provide a brief overview and summary of the second quarter and first six months results for the period ended, June 30, 2022. Management will then conduct a question-and-answer session. The 2022 second quarter and first six months financial results are unaudited and all results are reported using U.S.\n\nGAAP accounting. For the purposes of our call today, I'll review the financial results in U.S. dollars. We will begin with a review of the recent dynamics of the Chinese economy and automobile industry and China Automotive's market position.\n\nChinese GDP growth was a slight 0.4% increase in the second quarter of 2022 and 2.5% for the first six months of the year, compared with 12.7% growth in the first six months of 2021. Lockdowns and travel restrictions from COVID-19 interrupted supply chains with delays in raw material and finished good delivery including for automobile microchips and other components. Investments in real estate in the first half of the year fell by 5.4% from last year's same period and industrial production in June missed expectations. In this challenging environment, data from the Chinese Association of Automobile Manufacturers, CAAM, reported that the Chinese automobile sales decreased by 13.3% year over year in the second quarter of 2022.\n\nThe passenger vehicle sales declining by 2.2% year over year and commercial vehicle sales declined by 50.1% year over year in the second quarter of 2022. For the first six months ended, June 30, 2022, CAAM reported automobile sales declined by 6.6% year over year. Passenger vehicle sales rose by 3.4% year over year with sedans 6.1% year over year higher, SUVs 3.3% higher year over year. However, on a year-over-year basis, NPV sales declined by 15.7% and cross vehicles were down by 13.3% -- 13.7%, respectively.\n\nFor commercial vehicle sales, CAAM data showed an overall sales decline of 41.2% year over year for the first six months of 2022. The truck market declined by 42.2% year over year and bus sales were down 30.5% year over year. Despite the weak results in both the Chinese passenger and commercial vehicle markets in the second quarter, our net sales grew by 5.5% year over year in the 2022 second quarter. Most of our business segments achieved sales growth, except our commercial vehicle products division, which reflected the overall commercial vehicle sector sales decline.\n\nFor the second quarter of 2022, while net sales of our advanced hydraulic steering products and parts were 2.6% lower year over year; net sales of our electric power steering, EPS products, rose 39.7% year over year and represented 25.5% of the total net sales. And export net sales to our Tier 1 North American customers rose year over year in the second quarter of 2022. We grew our gross margin by 4.8% year over year in the second quarter of 2022 to 17.9% from 13.1%, mainly due to the changes in product mix as our EPS products experienced strong sales growth. Research and development expenses, R&D, increased by 33.9% to $7.9 million in the 2022 second quarter as we continue to build our technologies.\n\nHigher gross profit, stricter cost controls, and higher other income helped generate income from operations of $7.2 million in the second quarter of 2022, compared to $0.1 million in the second quarter of 2021. Our 2022 second income per share -- second quarter income per share was $0.31 versus $0.10 in the second quarter last year. In early 2022, we signed an agreement with Global Truck Powerhouse, Scania AB, to develop an eRCB steering systems for Scania's trucks and buses to expand our technology in the commercial vehicle markets. Combining our proprietary eRCB steering system with our advanced driver assist systems, L4 platform, known as AP04, allows the vehicles to execute Level 4 autonomous driving.\n\nERCB is a fully electric intelligence steering system for light-, medium-duty trucks and heavy-duty commercial vehicles. Furthermore, our subsidiary in Sweden, Sentient AB, will further enable us to improve our NEV steering technology, especially for fast-growing autonomous driving products in passenger and commercial vehicles. As of June 30, 2022, we had cash and equivalents plus pledged cash of $143.8 million and working capital of $150.1 million. Our share repurchase program can use up to $5 million of these resources to buy outstanding common shares through March 30, 2023.\n\nBefore I move on to discuss the financial results, we would like to comment on recent dynamics of the Chinese auto market. We are particularly encouraged by the June sales of passenger vehicles including sedans, SUVs, and MPVs. Over 2.2 million passenger vehicle units were sold, up 41.2% year over year in June alone, according to CAAM. The robust rebound of passenger vehicle sales was mainly driven by a recovered supply chain, pent-up demand, and favorable government policies, including a 50% reduction in the national purchase tax for some vehicles.\n\nLocal governments have also issued more license plates available and offered purchase vouchers as well. While the Chinese automobile market is recovering, our North American and Brazilian operations continue to expand. Our EPS products are gaining greater market share and our NEV technologies are acquiring more capabilities. Let me now review the financial results for the second quarter of 2022.\n\nOur net sales increased by 5.5% to $127.2 million in the second quarter of 2022, compared to $120.6 million in the second quarter of 2021. Net sales of traditional steering products and parts decreased by 2.6% to $94.8 million for the second quarter of 2022, compared to $97.4 million for the same period in 2021. Net sales of electric power steering products rose 39.7% to $32.4 million from $23.2 million for the same period in 2021. EPS product sales were 25.5% of the total net sales for the second quarter of 2022, compared with 19.2% for the same period in 2021.\n\nExport net sales in North American customers rose by 20.1% to $38.3 million in the second quarter of 2022, compared with $31.9 million in the second quarter of 2021. Gross profit rose by 43.7% to $22.7 million, compared to $15.4 million in the second quarter of 2021. Gross margin in the second quarter of 2022 was 17.9%, compared with 13.1% in the second quarter of 2021. The increase in gross margin was mainly due to changes in the product mix and an increase in selling price.\n\nGain on other sales was $2.1 million, compared to $0.7 million in the second quarter of 2021. Selling expenses decreased by 8.5% to $4.1 million, compared to $4.4 million in the second quarter of 2021, which was primarily due to lower transportation expenses. Selling expenses represent a three-point net sales in the second quarter of 2022, compared to 3.6% in the second quarter of 2021. General and administrative expenses, G&A, decreased by 6.6% to $5.7 million, compared to $6.1 million in the second quarter of 2021, which was primarily due to lower office expenses and professional service fees.\n\nG&A expense of 4.5% of net sales in the second quarter of 2022, compared to 5.1% of net sales in the second quarter of 2021. Research and development expenses, R&D, increased by 33.9% to $7.9 million, compared to $5.9 million in the second quarter of 2022 compared to -- in the second quarter 2022, compared to 4.9% in the second quarter of 2021. Other income net was $2.8 million in the second quarter of 2022, compared to $1.5 million for the three months ended, June 30, 2021. Income from operations was $7.2 million in the second quarter 2022, compared to net income from operations of $0.1 million in the second quarter of 2021.\n\nThe increase was primarily due to higher sales in gross profits and cost growth. Interest expense was $24 million in the second quarter of 2022, substantially consistent with $0.3 million in the second quarter of 2021. Net financial income was $2.5 million in the second quarter of 2022, compared to net financial income of $2 million in the second quarter of 2021. The change in net financial income was primarily due to a higher foreign exchange benefit in the second quarter of 2022.\n\nIncome before income tax expenses and equity and earnings of affiliated companies was $12.2 million in the second quarter of 2022, compared to income before income tax expenses and equity in earnings of affiliated companies of $1.5 million in the second quarter of 2021. Net income attributable to parent company's common shareholders was $9.4 million in the second quarter of 2022, compared to net income attributable to parent company's common shareholders of $3.2 million in the second quarter of 2021. Diluted earnings per share was $0.31 in the second quarter of 2022, compared to $0.10 in the second quarter of 2021. The weighted average number of diluted common shares outstanding was 30,849,009 shares in the second quarter of 2022, compared to 30,855,406 in the second quarter of 2021.\n\nI will briefly go over the six months financial highlights. Net sales increased 5.1% to $263.6 million in the first six months of '22, compared to $250.9 million in the first six months of 2021. Six months gross profit was $37.4 million, compared to $35.6 million in the corresponding period last year. Six-month gross margin was 14.2%, which is consistent with the 14.2% in the first six months of last year.\n\nThe gain on other sales was $3 million in the first six months of 2022, compared to $2 million in the corresponding period last year. Income from operations was $5.7 million in the first six months of 2022, compared with income from operations of $4.3 million in the first six months of 2021. Net income attributable to parent company's common shareholders was $9.4 million in the first six months of 2022, compared to net income attributable to parent company's common shareholders of $6.4 million in the corresponding period in 2021. Diluted earnings per share was $0.30 in the first six months of '22 -- of 2022, compared to diluted earnings per share of $0.21 in the first six months of 2021.\n\nNow a review of a few balance sheet items. As of June 30, 2022, total cash, cash equivalents, and pledged cash were $143.8 million. Total accounts receivable, including notes receivable, were $203.5 million. Accounts payable, including notes payable, were $210.7 million, and short-term loans were $47.6 million.\n\nTotal parent company stockholders' equity was $313.6 million as of June 30, 2022. Net cash provided by operating activity was $14.5 million in the first six months of 2022. The business outlook. Management has increased its revenue guidance for the full year 2022 to $500 million due to the economic impact of COVID-19 and foreign exchange volatility.\n\nThis target is based on the company's current views on operating in the market conditions, which are subject to change. With that, operator, we are ready to begin the Q&A.\n\nOperator\n\n[Operator instructions] Your first question is coming from William Gregozeski from Greenridge Global.\n\nWilliam Gregozeski -- Greenridge Global -- Analyst\n\nExcellent quarter. The gross margin was the highest you guys reported in like five years. What is the margin level you're expecting going forward?\n\nJie Li -- Chief Financial Officer\n\n[Foreign language] Yes. Our gross margin in the second quarter reached 17.9%. It is our one of the -- it is the highest record in the last five years. There are two main factors attributable to this increase of gross margin.\n\nFirst is our electric power steering product. We finally getting to a stage that reach a fairly good economy of scale. Our volume increased significantly and our cost has been coming down. So the reduction in cost allows volume increase and decent -- very good efficiency.\n\nAnd in addition to that, we also increased our average selling price on the EPS product. So -- and as a result, our gross margin for EPS product has exceeded 15%. This is the highest in recent history because our -- in past, our EPS product gross margins posting around single digit. And now, we're at a pretty good phase on the EPS gross margin.\n\nAnd the second reason to help boost our gross margin is the ForEx. The slightly increase of U.S. dollar against RMB was also our gross margin. [Foreign language] OK.\n\nLooking forward, we believe EPS gross margin can further improve. We have pretty abundant orders coming in. Our order books look really good. And we are -- we believe the increased volume can further help us bring down the cost, reaching an even better economy of scale.\n\nAnd also the EPS as a percentage of the total volume will further increase. As a result of both, I think our forward-looking gross margins is going to be -- there's some room for further improvement. And EPS -- just the EPS gross margin alone, we are foreseeing further increase to 16% to 17% in the coming quarters.\n\nWilliam Gregozeski -- Greenridge Global -- Analyst\n\nOK. Great. Great. And then the last question.\n\nHave you guys continued repurchasing shares in the current quarter that we're in now?\n\nJie Li -- Chief Financial Officer\n\n[Foreign language] The answer is yes. We have already repurchased over 200,000 shares since the announcement. We will continue to repurchase shares in the overall market.\n\nWilliam Gregozeski -- Greenridge Global -- Analyst\n\nOK. Great.\n\nOperator\n\n[Operator instructions] OK. It appears we have no further questions in the queue. I will now hand it back over to Kevin for any closing remarks.\n\nKevin Theiss -- Investor Relations Manager\n\nWe want to thank everyone for joining us today, and we look forward to speaking with you again. So please keep safe, and we'll talk to you on the next quarterly conference call. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Theiss -- Investor Relations Manager\n\nWilliam Gregozeski -- Greenridge Global -- Analyst\n\nJie Li -- Chief Financial Officer\n\nMore CAAS analysis\n\nAll earnings call transcripts"
}