{
  "companyName": "Enterprise Products Partners",
  "companyTicker": "EPD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/enterprise-products-partners-epd-q3-2022-earnings/",
  "content": "Enterprise Products Partners (EPD -0.41%)\nQ3 2022 Earnings Call\nNov 01, 2022, 10:00 a.m. ET\n\nOperator\n\nHello. Thank you for standing by, and welcome to the third quarter 2022 Enterprise Products Partners LP earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference may be recorded. I would now like to hand the conference over to your speaker today, Randy Burkhalter, vice president of investor relations. Please go ahead.\n\nRandy Burkhalter -- Vice President, Investor Relations\n\nThank you, Josh, and good morning, everyone, and welcome to the Enterprise Products Partners conference call to discuss third quarter '22 earnings. Our speakers today will be co-chief executive officers of Enterprise's General Partner, Jim Teague and Randy Fowler. Other members of our senior management team are also in attendance for the call today. During this call, we will make forward-looking statements within the meaning of Section 21E of the Securities and Exchange Act of 1934 based on the beliefs of the company, as well as assumptions made by and information currently available to Enterprise's management team.\n\nAlthough management believes that the expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such expectations will prove to be correct. Please refer to our latest filings with the SEC for a list of factors that may cause actual results to differ materially from those in the forward-looking statements made during this call. And so, with that, I'll turn it over to Jim.  \n\nJim Teague -- Director and Co-Chief Executive Officer\n\nThank you, Randy. Today, we reported exceptional results for the latest quarter. We reported adjusted EBITDA of $2.3 billion for the quarter. We also generated $1.9 billion distributable cash flow, providing 1.8 times coverage.\n\nWe retained $826 million in DCF, taking us to $2.6 billion for the first nine months. We achieved six operating records, including transporting a record 11.3 million barrels per day of oil equivalent in the form of NGLs, crude oil, natural gas, refined products, and petrochemicals we transported a record of 17.5 trillion BTUs per day of natural gas. We also set quarterly volumetric records for NGL fractionation, ethane exports, butane isomerization, and fee-based natural gas liquids. Where am I? Just a minute.\n\nI've lost my place, and I won't tell you why. Earnings from our Midland Basin natural gas gathering and processing business and higher gross operating margins from our natural gas processing, octane enhancement, and natural gas pipeline businesses were particularly exceptional for the quarter. Today uncertainties in the global economic environment are weighing on the petrochemical industry, where sluggish demand is leading to reduced runs and destocking. There are some serious concerns about recession, especially in Europe, where the question isn't whether they go into recession, but about the depth and length of the downturn.\n\nMeanwhile, on the other side of the globe, China's GDP has taken a nosedive from double-digit growth over the past number of years to low single digits at best. Thinking back on my career, first with Dow and here in Enterprise, I can't count the number of downturns I've been through. At Dow, the downturns were always painful. But here in Enterprise, they always bring opportunity.\n\nIn the current environment, while the uncertainties are real, the certainty that Enterprise will always deliver is real too. Moving to capex. Year-to-date growth capex, excluding our Midland Basin acquisition that totaled $973 million, and our current expectation for growth capital for 2022 and 2023 remains in the $1.5 billion to $2 billion. We currently have $5.5 billion of organic growth projects under construction.\n\nAnd we look forward to bringing our PDH 2 plant, our Frac 12, one plant each in the Midland and Delaware basins, and our TW product system online in 2023. We've been traveling domestically since end of 2020. And now, we're back on the road traveling internationally, and we're welcome in every country we visit. Brent and some of his folks just spent three weeks traveling across Asia, from Japan to Korea, to Singapore, to India, and I joined them for some meetings in the last week of their trip.\n\nIn the middle of a prolonged war in Europe and the outright weaponization of energy by prudent, a global energy and food crisis and inflation worldwide, our country is better positioned than any other, thanks to our abundance of both energy and agricultural products. Notwithstanding that abundance, the critically low inventories of distillate in the Northeast United States were self-inflicted and could have been completely avoided by temporarily waiving the Jones Act. In our travels, executives in other countries no longer ask about the size of U.S. Energy Resources.\n\nThey don't ask about where we think price is headed or if we feel U.S. supplies will be competitive. Instead in most meetings, we are asked if our politicians have a clue about the realities of the world's immediate and longer-term needs for U.S. energy.\n\nUnfortunately, with a rhetoric that comes from our government and inaction on badly needed permitting reform for pipelines, transmission, infrastructure, and mining probably answers that question. Our government needs to understand that rhetoric matters. The United Nations has stated that there is a direct correlation between energy consumption per capita and quality of life. Much of India's population lives in poverty.\n\nOne of India's most senior executives reminded me in our meeting that they have access to ample supplies of coal and without access to U.S. resources, they are going to use any and all available resources to raise the standard of living for their people. Global coal consumption is predicted to hit an all-time high in 2022, and that's a trend that could continue as Russian natural gas stays shut in. Meanwhile, back in touch with reality, Europe recently declared both natural gas and nuclear energy as clean energy, resources that will be needed for years to come.\n\nAnd Asia continues to make no bones about their long-term appetite previous energy. We at Enterprise had been emphatic and it's going to take all of the above in order to meet the world's growing energy needs. That's why in addition to traditional midstream services, we're also focused on investments in lower carbon projects like carbon capture and sequestration and providing blue ammonia into export markets. U.S.\n\nhydrocarbons remain badly needed to support countries who live in poverty, energy poverty, and to support our closest friends, our allies in Europe who are in energy crisis. We currently export about 60 million barrels of oil equivalent every month. It's clear that the world wants and needs much more of what we have. We're back on the road traveling domestically, internationally.\n\nWe're growing existing relationships and developing new ones for new opportunities. Sorry, I lost my place, Randy.\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nAll right. Thank you, Jim. Good morning, everyone. Starting with the third quarter income statement.\n\nNet income attributable to common unitholders for the third quarter of 2022 was $1.4 billion or $0.62 per common unit on a fully diluted basis. This compares to $1.2 billion or $0.52 per unit for the third quarter of 2021. Adjusted cash flow from operations is our cash flow from operating activities before changes in working capital. For the third quarter of this year, it was $2 billion.\n\nThis is a 13% increase, compared to $1.7 billion generated for the third quarter of last year. We declared a distribution of $0.475 per common unit for the third quarter of 2022, which is 5.6% higher than the distribution declared for the third quarter of last year. This distribution will be paid on November 14 to common unitholders of record as of the close of business on October 31. During the third quarter, we repurchased approximately 3.9 million common units at a cost of $95 million.\n\nFor the first three quarters of this year, we repurchased approximately 5.3 million common units for $130 million. We plan to resume our program to opportunistically buy back up to $350 million of units in the near term. For the 12 months ended September 30, we paid over $4.1 billion of distributions to limited partners and bought back $255 million of common units in the open market. For this period, Enterprise's payout ratio of adjusted cash flow from operations was 56%, and our payout ratio of the adjusted free cash flow, if you exclude the $3.2 billion Navitas midstream acquisition, was 70%.\n\nIn addition, during the third quarter and the first nine months of this year, approximately 1.5 million common units and 4.7 million common units, respectively, were purchased on the open market by our distribution reinvestment and employee unit purchase plans. Total capital investments in the third quarter were $474 million, which includes $397 million for organic growth capital projects and $77 million for sustaining capital expenditures. Capital investments for the first nine months of 2022 were $4.4 billion, which included the $3.2 billion acquisition of Navitas Midstream, $973 million invested for organic growth capital projects, and $234 million for sustaining capital expenditures. Our total growth projects under construction remains unchanged from last quarter at $5.5 billion.\n\nWe continue to expect our total 2022 growth capital expenditures to be approximately $1.6 billion and sustaining capex to be approximately $350 million. For 2023, we currently expect growth capital investments will be approximately $2.0 billion. Our total debt principal outstanding was $29.5 billion as of September 30, 2022. Assuming the final maturity date for our hybrid notes, the weighted average life of our debt portfolio was approximately 20 years.\n\nOur weighted average cost of debt is 4.4%. At September 30, approximately 93% of our debt was fixed rate. Earlier this year, we retired $1.4 billion of senior notes and redeemed $350 million of variable rate hybrid notes using a mix of cash proceeds from a note issuance in September 2021 and commercial paper. Our consolidated liquidity was approximately $3.3 billion at September 30, including availability under our credit facilities and unrestricted cash on hand.\n\nWith regard to near-term debt maturities, we have $1.25 billion of senior notes maturing in March of 2023. We expect our free cash flow generation and liquidity position will provide ample flexibility regarding the refinancing of these notes. Adjusted EBITDA was $9 billion for the 12 months ended September 30, 2022. Our consolidated leverage ratio was 3.26 times on a gross basis.\n\nAnd if you net out the partial equity treatment for the hybrid notes and reduce debt by unrestricted cash on hand that number on a net basis was 3.1 times. Given the coordinated efforts by global central banks to increase interest rates to temper inflation and the likelihood of a global recession and just general volatility, we believe that it is prudent to remain at the lower end of our targeted leverage range of three and a quarter and three and three-quarters times EBITDA. Lastly, we published our 2022 sustainability report in September. We encourage you to visit our website and review our discussion on the vital role of U.S.\n\nfossil fuels in supporting the pillars of modern civilization and providing a pathway for a better life for 2.5 billion who still live in energy property. With that, Randy, I think we can open it up for questions.\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nOK. Thank you, Randy. Josh, we're ready to take questions from our listeners. I would like to remind everyone to please restrict your questions to one question and one follow-up, please.\n\nGo ahead, Josh.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Michael Blum with Wells Fargo. You may proceed.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nThanks. Good morning, everyone. Wanted to ask about Permian growth heading into 2023. You had some comments last week from the majors.\n\nObviously, you've got tight gas takeaway. Do you see that all impacting the pace of growth into '23 on the oil side and the gas side, I guess, for the Permian?\n\nTony Chovanec -- Vice President, Fundamentals and Supply Appraisal\n\nYeah. Michael, this is Tony. You know, when we went into this year at our Analyst Meeting, we said given the momentum we have, we thought that year-end '21 to year-end '23, hard to call which year it would land in, we'd be up to, and I'm just going to oil, 1.5 million barrels of increase. Clearly, and you referenced what the majors said, I'll use Chevron as an example, sort of as a poster child.\n\nThe supply chain issues in the oilfield and labor issues are not minor. And so, if you look at what Chevron said, they are guiding to the low end of their production target, particularly as we get to year-end 2022. That said, we've got 60 rig increase in the Permian Basin year to date. And if you think about what those rigs look like compared to, call it, 2019 or 2020, there's some efficiency of some 30% greater.\n\nThis is not a small number. So, if I were to guess right now, OK, because it's hard. Yesterday, the August numbers came out from EIA for what it's worth. And they showed a 100,000 barrel-a-day increase between July and August.\n\nSo, I would tell you that I think we're probably an increase -- and that puts us year-to-date increase of between 350,000, 400,000 barrels, depending on which numbers you look at. So, I'm comfortable saying that we're probably going to increase 500,000 to 600,000 barrels in 2022 for the whole U.S. and in 2023, 600,000 to 800,000 barrels. So, when you add the two together, $1.2 million to $1.4 million, and we'll address that at the analyst meeting again next year, but we're very comfortable in that range.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks for that Tony. I guess a related question, clearly, Waha price has been really weak lately. Curious if you could just speak to how much open gas pipeline capacity you have to capture those spreads.\n\nAnd basically, how much of that you've already hedged?\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nMichael, this is Brent Secrest. If you look at Enterprise's capacity as it relates to Waha to Gulf Coast markets, we're between 350 million and 400 million a day of open capacity, or just call it outright capacity for Enterprise. And as it stands right now, none of that's hedged for next year.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Jeremy Tonet with JPMorgan. You may proceed.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning.\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nGood morning.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nJust wanted to kind of pivot to the Petchem business if we could. And we've seen a lot of commentary of the Petchems talking about lower operating rates. And it looks like we're head for a bit of a down cycle here. And you touched on the opening remarks, but just wanted to get a bit more color on what that could mean for EPD specifically here.\n\nI think we've talked about in the past, maybe this looks like kind of a 6- to 9-month destocking cycle. Is that still how you see it? And if so, I guess, how would that impact EPD? Do you see like a big step down in Petchem services next year? Or how should we frame the range of outcomes?\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nChris, I'm going to take a shot and then give it to you. We don't have the spreads between RGP and PGP that we had last year. Saying that, the spreads we have today are more like what we have traditionally seen. Our octane enhancement business has done well.\n\nWe've got that hedged 75% next year at good numbers. And then don't forget, we're bringing on PDH 2 next year. And then our ethylene and propylene distribution and export and storage facilities are going strong and growing. So, I personally think, yes, propylene is going to be softer, but I still think we're going to do pretty good.\n\nChris D'Anna -- Senior Vice President, Petrochemicals\n\nYeah. If you look at how we've built our splitter business over the years, it's midstream services, where we have 50% of our margin is fee-based, 25% of our margin is fee-based with the exposure to the spread when it blows out. And certainly, that's what you've seen over the last year and a half. And then the last 25% is market exposed.\n\nAnd I think over the next six to nine months, we continue to see weakness in destocking. We're going to see kind of reversion to what our historical splitter profits have been. Let's bring in -- PDH 2 will add to that, though.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful. Thanks. And just wanted to see, I guess, within this context of how you think about capital allocation here, it seems like we have a bit of choppiness in the credit markets, and then investors still looking for a greater return of capital on the equity side.\n\nAnd just wondering how you think that all shakes out within this background.\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nYeah. Jeremy, this is Randy. Good morning. Jeremy, I think you'll continue to see us sort of follow all of the above and try to do a combination of distribution growth and buybacks where it makes sense, again, opportunistically.\n\nAnd then I think we're in good shape. We've managed our debt maturities very well. We really came in and issued longer-term debt. So, our maturity ladder, we don't have big maturities in any of the years coming up.\n\nSo, I think we're in good shape going into 2023 to handle that maturity when it comes due. \n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. And as far as the return of capital to investors buyback versus dividend distributions, any change in thoughts?\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nNo, no change on thought. You know, 2022 marks our 24th year in a row for distribution growth, and we think next year will be 25 years in distribution growth. But still, you know, we'll come in and do all of the above.\n\nChris D'Anna -- Senior Vice President, Petrochemicals\n\nJeremy, this is Chris Nelly. The one thing I would add there is that in talking to a lot of investors, given the inflationary environment they're in, they really appreciate the 5.6% distribution growth year over year. That's helpful to a lot of our individual unitholders.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Jean Salisbury with Bernstein. You may proceed.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nHi. Good morning. Just building on Jeremy's question, again, about Dow saying that they're going to cut polyethylene production by 10% to 15% here. Can you kind of just higher level give us your thoughts on what that means for U.S.\n\nethane production and NGL prices? And if it could kind of touch some other parts of your business like LPG exports or discretionary ethane that maybe people don't necessarily expect to be so Petchem-related?\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nI'll start and then throw it to Brent and Chris, Jean. I'm going to go to LPG exports. We're full aren't we, Brent?\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nWe're full.\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nSo, every month, on ethane exports, I've seen us go no less than 5 million barrels a month, I'm thinking, and up to 7 million barrels a month. So, I think where ethylene and propylene are concerned. To the extent they go lower, I think it opens up export opportunities more for ethylene and propylene. So, I think those export docks grow in value as prices go down.\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nJean, on ethane, in terms of recoveries, if domestic demand goes down, it's still pretty strong, Tony, it's around 1.9 million barrels a day. So, it's still hanging in there. But ultimately, there's going to be a lot of ethane recovery out of the Permian basin. That's going to help our Permian Basin NGL lines.\n\nOn the discretionary ethane, so when you look at Rockies and some other more challenged basins in terms of distance, that's the barrel that's going to be on margin probably for next year. If you look at enterprise on the ethane business on the downstream side, I would say there's probably about 90% of our business that's it's take-or-pay type contracts. So, think of the ethane doc and EGS and ATEX and those type of businesses, all that's fairly well, from a revenue standpoint, on solid ground. And then ultimately, on LPGs, what we've always said is LPGs are going to have to price in to go clear across the water.\n\nSo, we're heavily contracted. We do probably have some open spots when we look into next year that we'll wait and see what happens, but we'll have some opportunity across our facilities.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nGreat. Thank you. And then just following up on one of your comments there. You kind of said before that as gas price widened in Waha, you might start to see more ethane being recovered there, maybe 100,000 barrels even I was just wondering now that you're seeing gas price widen if that ethane is showing up.\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nAbsolutely. If you look across how Enterprise runs their system, what's going on doesn't probably affect us as much as it does affect third-party processors. But you're definitely seeing the effects of it this month. You saw it toward the end of last month, and we expect to see it probably for the balance of 2023.\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nOne more thing. I'm absolutely convinced that some of what we export is being burned, especially in Asia. In fact, I know one company that is. I mean, you can land ethane cheaper than LNG.\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nAbsolutely.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nGreat. Thank you for all the color.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Michael Lapides with Goldman Sachs. You may proceed.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nHey, guys, thank you for taking my question. Just curious, world's changed a ton in the last six or nine months. It's just the cycle. The credit market is starting to get a little choppy out there, especially for some of the smaller entities, public or private.\n\nJust curious, are you -- is the M&A landscape, has that yet become more attractive? I know you just did Navitas, but that was kind of before the credit markets got choppy. Just curious how you're thinking about the opportunity to use a lot of the balance sheet to gobble up assets.\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nI'm thinking that we're building two more plants in the Midland Basin and two more plants in the Delaware Basin, and that's a more efficient use of capital than going to pay a lot of money. We like the Navitas deal, it's done real well. But it wasn't only a good deal, it was a strategic fit. And what bothers some of us, at least me, is I've been through a number of second requests, and I don't see anything we could buy that doesn't require a second request.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. In other words, sellers haven't gotten to a point either due to leverage or anything else where pricing has come down a lot in the market.\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nYeah, Michael. I think it's more – you know, again, expanding what Jim was saying is really we just see a lot of organic growth opportunity right now. And when we came in and leading up to the Navitas transaction, we did a pretty deep dive of, at least in the G&P world, as far as what the opportunities were. And by far, Navitas checked all the boxes for us.\n\nAnd as Jim said, the transition has gone well. The fit has been great. We didn't have anything in the Midland, and we've been very pleased with it. We continue to look at opportunities.\n\nBut right now, we're just seeing better returns on capital on organic growth.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. Thank you, guys. Appreciate it.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Brian Reynolds with UBS. You may proceed.\n\nBrian Reynolds -- UBS -- Analyst\n\nHi. Good morning, everyone. Maybe just start on the moving pieces in '23 capex. It seems like Sinok has gotten pushed to the first half of 25% from '24.\n\nKind of curious if you can talk about just the moving pieces in capex, what's potentially still under development? And what ultimately could provide some upsides or downsides that '23 capex number of roughly $2 billion.\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nYeah. Brian, this is Randy. I think where we are with 2023 at $2 billion. Really, it's hard to see that moving materially higher.\n\nAs far as on the only large project that's out there that we're looking for more clarity is our offshore crude oil export facility, and we're still waiting on permits there. But even with that, as we sit here today, it's hard to see that number move materially.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. And just a quick follow-up. Is there any fundamental change of view with the Sinok expansion being pushed back a year?\n\nJustin Kleiderer -- Senior Vice President, Hydrocarbon Marketing\n\nYeah. this is Justin Kleiderer. I don't think it changes our fundamental view. I think we have a little bit more time to pull the trigger on expansion.\n\nWe still have the scope expansion ready to go. We're just spending a little bit more time trying to understand what's appropriate for what the market needs and when it needs it.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. That's super helpful. And then maybe just as a broader question while '23 E&P budgets haven't been formalized, I'm curious if you could just talk about Permian producer customers, what they're looking at, and how they're thinking about '23 just given the expected nat gas tightness, are publics and privates looking at '23 a little bit differently? Do you see flaring coming back materially into '23? Or do you think that's kind of a thing in the past? And then we could just see more lumpy volumes while we navigate that nat gas tightness? Thanks.\n\nTony Chovanec -- Vice President, Fundamentals and Supply Appraisal\n\nBrian, I'll start out. This is Tony. I made the comment at the beginning of this call, if you look at what's happened to Permian rig counts, it's not small. So, there is a significant amount of momentum in the Permian.\n\nWe hear it from publics and privates alike. And I quoted some numbers this morning there so what we think and how the numbers end up, could things slow it down, you know flaring on gas, we could go to a lot of things. But it's hard to kill this kind of momentum. And Brent, I'll let you -- you spend a lot of time with producers, talk about privates and big privates and public and how you see it.\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nYes. Brian, I think, you know, when you look at the bigger privates, they still have a fairly robust growth plan. I heard some of the earnings calls last week from some of the larger players in the Permian, and they were a little bit more tempered than what we had heard, but the bigger public company is the more growth that they were talking about. But if you look at our system in the Midland Basin and recognize that we have some of it's timing of capital projects.\n\nBut if you look at our growth on the natural gas side and processing side, it's probably about 23% growth from 22% to 23%. On the Delaware Basin side, it's going to be probably, call it, 7% to 10%, that's probably a little bit later timing on our Mentone plants. And when you look at what producers are looking at even where gas prices are in 2023, I didn't check it before I came in here, but we're still around a $3 type number where producers can hedge. In the whole scheme of things, if the crude is going to drive somewhere between 85% and 87% of the economics with the gift that producers were given when they were able to achieve $4 or $5 type gas prices, that's what it was.\n\nIt was a gift. But I don't think it changes the mentality in terms of where Waha is trading at because, again, it's still at a pretty healthy number for 2023.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. Appreciate all that incremental color. Enjoy the rest of your morning, everyone.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Theresa Chen with Barclays. You may proceed.\n\nTheresa Chen -- Barclays -- Analyst\n\nGood morning. Tony, I want to ask you for an update on how much ethane do you think is still currently being projected in the Permian from -- I think the last update was 200,000, 250,000 barrels per day. And how much can realistically come out?\n\nTony Chovanec -- Vice President, Fundamentals and Supply Appraisal\n\nThat number changes from day to day. I'll pass it to Tug or Brent. But when I say it changes from day to day, I mean, it changes from day to day. I would think that that rejection number is less because of what's happened to gas, but gas moves, it's really unbelievable what happens at cash market.\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nThere's probably some older plants out there that can't recover as much as a lot of the newer type plants. I would think everything that can be recovered is probably getting recovered. Tug, do you have a volumetric number what we think should not being recovered because it probably can't?\n\nTug Hanley -- Senior Vice President, Pipelines and Terminals\n\nYeah. This is -- if you look at the, you know, Waha spread right now, there's a very healthy incentive, obviously, for every single plant that can recover to recover. But as far as the older plants and wagon it's probably 50,000 to 75,000 barrels a day that cannot be recovered due to older technology.\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nAt the spreads they have, I can't imagine anybody purposely rejecting it.\n\nTheresa Chen -- Barclays -- Analyst\n\nFair enough. And looking to the Petchem side of things, I'm curious to hear your view on your customers in the international markets. Granted from a U.S. perspective, if capacity utilization is down here making the feedstocks cheaper, exports make a lot of sense.\n\nBut as we look at the international markets, we also are hearing about Far East and European facilities curtailing production, some prolonged their maintenance because of these poor margin outlooks. And as we think about Europe potentially fending elevated amounts of naphtha to that Singapore market, as a competing feedstock. What does that mean for U.S. Gulf Coast exports of Petchem feedstocks internationally?\n\nChris D'Anna -- Senior Vice President, Petrochemicals\n\nThis is Chris D'Anna. I guess globally, the whole Petchem segment is weak right now. And so, what that's meant to us over the last several months is that our ethylene export dock has been full. And some months, that product goes to Europe, some months, it goes to Asia.\n\nAnd I think all the petrochemical plants over there are trying to balance out and find the right optimum level to run. But I think the short answer for us is that it means our dock is full, at least for ethylene. And for propylene, we've had imports at times, we've had export at times. So, it's really creating some opportunities for us.\n\nTheresa Chen -- Barclays -- Analyst\n\nThank you.\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nI said earlier that ethane dock is going to stay full and that LPG dock is going to stay full, notwithstanding the weakness. Like I said in my script, we've been traveling internationally. And we've been visiting, I'm not going to tell you what country or who. But we've been visiting with the companies that want to build petrochemical complexes.\n\nAnd our goal is to export everything to them.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Chase Mulvehill with Bank of America. You may proceed.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning, everybody. I guess I want to follow up on some of the Permian growth expectations. I think you talked about, Brent, I think you said 600,000 to 800,000 barrels a day of -- I think that was U.S. growth for next year.\n\nSo, I guess, what would that translate into Permian growth? And then what about residue gas growth if you're going to go -- what's the equivalent kind of residue gas growth on that 23% number?\n\nTony Chovanec -- Vice President, Fundamentals and Supply Appraisal\n\nYeah. This is Tony, Chase. It's very, very weighted toward the Permian. Any other increases when we look at oil are relatively small.\n\nSo, I think Permian, I don't have that split out in front of me, but think Permian. Relative to NGL growth, just a walking -- relative to residue for every 1 million barrels, think about 3 Bs of gas from a drive standpoint. That said, the gas, both on the Midland side and on the Delaware side, I mean, the oil is getting a little gassier. That doesn't mean there's less oil.\n\nIt just means there's more gas, which is the reason you see us building more plants. That does put producers in a box for 2023 for takeaway at Waha.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nYeah. I guess that was my follow-up question, is how quickly do you think that 1.1 B fills what's PHP and Whistler, those expansions come online kind of late 3Q, early 4Q. And the follow-up to that would be, do you still have the 350 to 400 Ms a day open for the first half of '24 for the FT?\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nI'll answer the second question. This is Brent, but it's still open in '24. Ultimately, those pipelines can't come on probably fast enough. I think in the daily market when it comes to Waha, I think we saw it last week and prior to that, when things are this tight, and something goes down, it's going to be incredibly challenging.\n\nAnd I don't think that's the last that we've seen of negative gas prices in Waha. Or something goes up being the wind blows hard.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Yeah, absolutely. All right. I'll turn it back over.\n\nThank you.\n\nOperator\n\nThank you. One moment for questions. One moment for questions. Our next question comes from Neal Dingmann with Truist.\n\nYou may proceed.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nMorning guys. My first question, just on your upcoming projects, specifically, when looking at all these projects listed on Page 6, I know talking to some of your other midstream and upstream guys are seeing the typical supply chain issues and other various delays out there. I'm just wondering, could you guys give just general comments -- you have a lot of fantastic projects coming on here starting first half next year and I'm just wondering if you could give a sense of -- you feel pretty good about those projects? I mean, obviously, there's a large number of coming on, maybe just overall color you could give on that.\n\nGraham Bacon -- Executive Vice President and Chief Operating Officer\n\nThis is Graham. Yes, bottom line is we feel real good about these projects. I mean, there are a few still remaining supply chain issues, primarily around electrical gear. I think we've mitigated all of almost every one of those issues on these projects.\n\nGoing forward, we feel really good about the execution of the projects that we have on the list.\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nGraham, do you want to give a little color on PDH 2?\n\nGraham Bacon -- Executive Vice President and Chief Operating Officer\n\nYes. Just in light of -- Randy mentioned PDH 2, still scheduled for mechanical completion in the second quarter of next year. I think the execution is going very well, looking at coming in under our forecast on that particular project. We're really excited about that.\n\nOur teams did a great job back in 2020, mitigating a lot of the supply chain issues that arose during the pandemic. And even through all of that, we're still on schedule and maybe a little bit ahead of budget.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Keith Stanley with Wolfe Research. You may proceed.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nHi. Thank you. And that's good news on PDH 2. I just wanted to clarify on the buybacks.\n\nIs the plan still to repurchase the up to $350 million specifically in the second half of the year? Or is it more open-ended on the timeline for completing that?\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nHey, Keith, good morning. Yes, it could spill over into next year because, again, we're looking to come in and do this opportunistically. And again, we'll see what the market gives us a lot of noise out there with the Fed. But yes, I mean, we'll see if we can get it done by year-end.\n\nIf not, we'll spill over into next year.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nGot it. And then just a quick one on the EFS, the Eagle Ford crude contract. The impact in the third quarter, should we think of that as kind of an ongoing impact to just annualize that number going forward?\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nSo, if you look at that contract and that's the life of lease contracts. So, what we lost on that is deficiencies. So, we're still going to get some fees associated with how much production goes up. If you look at the producer around that contract, they have pretty healthy growth plans.\n\nSo, as more volume comes on in '23 [Audio gap] in '24, and they've shared the growth plans with us. You're going to see some offset. So, I would think that this quarter is probably the worst quarter in terms of impact. If you look at toward the end of the year, we'll probably make up about 25% of what we lost, and then that number will go up as we go forward.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nGot it. Thank you.\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nJosh, this is Randy. We have time for one more question.\n\nOperator\n\nThank you. And our last question -- one moment, please. And our last question comes from Colton Bean with TPH and Company. You may proceed.\n\nColton Bean -- Tudor, Pickering, Holt and Company -- Analyst\n\nMorning. Just one on my end. The natural gas segment had a pretty significant step-up in earnings this quarter, but it didn't look like that was marketing-weighted. Can you just walk us through the changes in the interest rate business and whether that's a sustainable run rate heading into 2023?\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nAre you asking specifically about our Texas interest rate system?\n\nColton Bean -- Tudor, Pickering, Holt and Company -- Analyst\n\nThe natural gas segment broadly, but based on the release, it looks like the interest rate was responsible for most of the uplift, so yes just any changes there?\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nYes. So, we've gotten increased demand or increased contracts from -- so volumes from power providers, but it's [Audio gap] also upgraded some of our transport contracts from Waha as well.\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nI think if you looked across our whole natural gas segment, and you could go from Haynesville or anywhere around the Permian, you're going to see increases probably every month as we go forward, Colton. It's a pretty healthy business right now.\n\nColton Bean -- Tudor, Pickering, Holt and Company -- Analyst\n\nGreat. Thank you.\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nOK. Josh, this is Randy. That would end our call today, and we'd like to thank everyone for joining us for our call. And have a good day.\n\nThank you very much. Goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRandy Burkhalter -- Vice President, Investor Relations\n\nJim Teague -- Director and Co-Chief Executive Officer\n\nRandy Fowler -- Director, Co-Chief Executive Officer, and Chief Financial Officer\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nTony Chovanec -- Vice President, Fundamentals and Supply Appraisal\n\nBrent Secrest -- Executive Vice President and Chief Commercial Officer\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nChris D'Anna -- Senior Vice President, Petrochemicals\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nBrian Reynolds -- UBS -- Analyst\n\nJustin Kleiderer -- Senior Vice President, Hydrocarbon Marketing\n\nTheresa Chen -- Barclays -- Analyst\n\nTug Hanley -- Senior Vice President, Pipelines and Terminals\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGraham Bacon -- Executive Vice President and Chief Operating Officer\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nColton Bean -- Tudor, Pickering, Holt and Company -- Analyst\n\nMore EPD analysis\n\nAll earnings call transcripts"
}