{
  "companyName": "Six Flags",
  "companyTicker": "SIX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/six-flags-six-q2-2022-earnings-call-transcript/",
  "content": "Six Flags (SIX 0.74%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. Welcome to the Six Flags second quarter 2022 earnings conference call. My name is Andrew, and I will be your operator for today's call. [Operator instructions] I will now turn the call over to Steve Purtell, senior vice president, corporate communications, investor relations, and treasurer.\n\nSteve Purtell -- Senior Vice President, Investor Relations\n\nGood morning and welcome to our second quarter 2022 call. With me is Selim Bassoul, president and CEO of Six Flags; and Gary Mick, our chief financial officer. We will begin the call with prepared comments and then open the call to your questions. Our comments will include forward-looking statements within the meaning of federal securities laws.\n\nThese statements are subject to risks and uncertainties that could cause actual results to differ materially from those described in such statements. And the company undertakes no obligation to update or revise these statements. In addition, on the call, we will discuss non-GAAP financial measures. Investors can find both a detailed discussion of business risks and reconciliations of non-GAAP financial measures to GAAP financial measures in the company's annual reports, quarterly reports, and other forms filed or furnished with the SEC.\n\nAt this time, I will turn the call over to Selim.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nGood morning. I hope you had a great summer. Thank you for joining our call. It is my pleasure to introduce Gary Mick, our new chief financial officer.\n\nGary and I worked together at Middleby where he was responsible for turning around several of our underperforming businesses and was consistently one of the top-performing group patents at the company. I'm thrilled to welcome him to Six Flags where he will make an immediate impact as we elevate the guest experience and launch our next phase of profitable growth. On today's call, we will focus on three areas. First, I will provide a progress report on our new strategy and execution.\n\nSecond, Gary will go into more detail about our financial results, our capital allocation strategy, and our outlook for the remainder of the year. Finally, I will return to provide some brief closing remarks before opening the call for questions. We are pleased that our guest satisfaction scores are improving. We are seeing very few security incidents in our parks.\n\nOur guest spending per capita has increased more than 50% versus pre-pandemic levels. And we have been able to offset the highest levels of inflations we have seen in decades. Our aggressive strategic shift is still a work in progress, but my first nine months at Six Flags as Six Flags CEO has only reinforced my initial belief in Six Flags' potential. We have truly unique assets located in all of the top 11 markets in the U.S.\n\nand in some of the fastest growing areas around the country. We are a global leader in delivering fun and thrills for all ages, and we have a widely recognized and beloved brand among consumers. Let me tell you why this company is amazing. First, we have a tremendous fan base who are willing to spend more in our parks.\n\nThese loyal guests have stuck with us despite the changes we have made. Second, while we owned the young adult thrills, we have historically missed out on families with kids, who are proven to spend more in the parks. While we have seen initial success in wooing families, grandparents, and single parents with kids to our parks, our potential to grow that segment further is very promising in the near term. Finally, our engagement with influencers has been tremendous this year.\n\nThey have been cheering the changes we are making, and we expect to see the impact of all the digital media and positive reviews to pay off handsomely over the next few years. I am so excited to lead Six Flags because the opportunities we see here are similar to the opportunities I had at Middleby, where we acquired and reinvigorated more than 50 underperforming companies. Our formula was simple. First, we selected companies with strong underlying assets, but whose management had lost confidence in their product and cut price to drive volume.\n\nSecond, we raised prices to be commensurate with the value we delivered to our customers. Third, we invested in product quality, innovation, and people to support further price increases and to build our brand advantage. Fourth, we eliminated all nonessential activity. Most importantly, we restored an entrepreneurial culture in the businesses we acquired, which I believe was critical to their long-term success.\n\nIn many cases, our unit volumes declined, but in every case, our profits grew substantially and sustainably. Although, we are operating in a different industry, I see similarities between Six Flags and many of the businesses I turn around at Middleby. Like many of those businesses, Six Flags resulted to excessive discounting to drive volume. For context, let me provide an example related to one of our largest parks.\n\nIn 1994, a season pass to Six Flags Great Adventure in Jackson, New Jersey averaged $75. At the time, Great Adventure only had four roller coasters. Fast forward 25 years to 2019, and we are still charging on average only $75 for our season pass, despite the fact that we have invested hundreds of millions of dollars in our park, and we now have 14 roller coasters, including several of the top-rated coasters in the world. Just to keep up with inflation, we would have had to increase the price by 70%, but instead our season pass price remained flat.\n\nI also looked at other smaller theme parks in our markets, and noticed that their prices are substantially higher than ours. This gave me confidence in our ability to raise price. I tell the story to illustrate both one of our historical issues, as well as one of our biggest opportunities. Our current challenges have built up over a long period, and it will take time for us to transform them.\n\nSince I started as CEO nine months ago, we have moved quickly to reset the foundations of our company. At the organizational level, we are focused on two key areas. First, we are resetting our culture to make our company easier to do business with by reducing layers of management and shifting decision-making to the parks. Second, we are continuing to execute our premiumization strategy by focusing on guests who are willing to pay more for a premium experience.\n\nToday, I would like to provide a report card on our progress so far. I will highlight what is working and where we need to improve. Let's start by discussing our areas of progress. First, our guest satisfaction scores continue to improve.\n\nWe are delivering significantly more rides per guest versus last year. And this metric has historically ranked as the No. 1 determinant of guest satisfaction. Second, total spending per capita is up significantly, increasing more than 50% versus 2019 levels.\n\nThird, employee staffing levels and overall friendliness have improved. As overcrowding of our parks has eased, employees are better equipped to engage with our guests in a friendly and welcoming manner. We have also improved our training methods and placed a greater emphasis on employee engagement. Fourth, security and safety incidents in our parks are the lowest they've ever been.\n\nFifth, our parks' appearance has improved as they've received their biggest makeover over the past few decades, headlined by our new front gate and extending to our restrooms and bathrooms. We still have work to do in this area, but guests are taking notice and appreciate our progress today. And finally, guest amenities. From more benches to relax on to take a break to more shaded area to escape from the hot sun, we moved quickly to upgrade our park infrastructure to respond to our guest feedback.\n\nBut we are not stopping there. Guest amenities are a top priority for our capex spend over the next few years. We are encouraged by what we have seen so far. In fact, even after adjusting for the fiscal calendar shift, our parks in North America earned nearly the highest modified EBITDA in company history for the first half of the year, and they did it on lower attendance.\n\nNow, I would like to comment on several areas where our execution needs to improve. First, our attendance. We estimate that the optimal attendance level that allow us to deliver an exceptional guest experience, while maximizing our profit represents a 20% to 25% decline relative to 2019. Our year-to-date attendance through July is down approximately 35% versus 2019.\n\nSo, our current attendance trends are about 10% to 15% below where we would like it to be. As we seek to rebuild our attendance base in a healthy and profitable fashion, we plan to introduce new product offerings to increase visitations this fall, such as introducing a new dining plan, creating a bigger and better Fright Fest with activities to attract more families such as trick-or-treating and [Inaudible] wearables and introducing a new Oktoberfest event. We believe these and other initiatives will help us grow our attendance and recapture a portion of our last active base holders in advance of the 2023 season. Second, our marketing.\n\nWe reduced our marketing budget substantially this year as we wanted to hold back on our spending and to be completed more of our park enhancements. We will be reevaluating our optimal marketing spend for 2023. Third, our guest facing technology and in particular, our mobile app. We are investing to improve the guest experience, increase revenue, and become more efficient.\n\nTechnology is probably a single area where we are the most behind. To start, much of our team's energy has gone toward upgrading our back-office application. Going forward, we have a new chief digital officer starting next week, and we plan to allocate the vast majority of our technology efforts toward guest-facing initiatives. We want to make it easier to navigate our parks and easier to do business with Six Flags.\n\nFor example, if a guest wants to upgrade from a single-day ticket to a seasons pass, they should not have to wait in line at guest relations or wait on hold for a customer service representative. This should happen with the click of a button. Our key technology priorities include modernizing our mobile app and simplifying our website and improving our point-of-sale in the parks. Finally, cost structure.\n\nExpense management is an area where we've made some progress, but we are still lagging behind our internal expectations as we have not fully adjusted our cost structure to our reduced attendance levels. Last year, our costs grew faster than our revenue, especially in our corporate office. We now view corporate's role as that of a support center for our parks, and we have delegated activities to our parks. We have also continued to optimize our full-time and seasonal labor in the parks.\n\nAs a result, we have reduced our full-time headcount by almost 25% since the beginning of the year. Our approach to expense optimization is to minimize costs that do not impact the guest experience but to invest in areas that do impact the guest experience. This change in philosophy helped us offset the inflationary pressures in the first half of 2022 and bring our costs below 2019 levels. However, more recently, as our attendance decline, we did not move quickly enough to reduce our operating costs to reflect the lower attendance levels.\n\nGary and his team have continued to focus on this initiative and we expect to operate much more efficiently in the second half of the year. Overall, we have made excellent progress in many areas, and I feel much better about where we are as a company today than a year ago. Now, that we have reset the foundations of our business, we expect to delight our guests and our shareholders with an improved in-park experience and a sustainable profit growth well into the future. I will now turn the call over to Gary who will provide detail about the quarter and the first half of 2022.\n\nGary?\n\nGary Mick -- Chief Financial Officer\n\nThank you, Selim, and good morning, everyone. I'm very excited to join the Six Flags team with this iconic brand and long history of providing thrills and memories to our guests. This company has a tremendous value proposition, and I have seen firsthand how Selim unlocked a similar value for the Middleby customers, employees, and shareholders. Selim is a visionary with regards to customer engagement, and I am extremely pleased to be working with him, Steve, and the team at Six Flags.\n\nTurning to the second quarter results. Revenue came in at $435 million, which represented a decrease of $24 million or 5% compared to second quarter 2021. This was driven by lower attendance and a reduction in international licensing revenue, which benefited in the prior-year quarter from a one-time termination payment related to our China development projects. Total attendance was 6.7 million guests, which represented a 1.9 million or 22% decrease from our second quarter 2021.\n\nOur attendance decrease was related to the elimination of free tickets and low-margin product offerings coupled with increased pricing into a market that had become accustomed to discounts. It is important to note that much of the attendance decline was recovered through increased guest spending per capita of $64, representing an increase of $12 or 23% versus second quarter 2021. Admissions spending per capita increased $8 or 27%, and in-park spending per capita increased $4 or 18%. The increase in admission spending per capita compared to 2021 was driven primarily by higher realized ticket prices and a higher mix of single-day tickets.\n\nThe increase in in-park spending per capita compared to 2021 reflected our improved assortment of in-park offerings and our in-park pricing initiatives. We experienced higher spending across almost all categories, including sales of food, rentals, and retail. Moving on to costs. Cash operating and SG&A expenses were $222 million versus $229 million in the prior year, representing a decrease of $7 million or 3%, driven primarily by reductions in full-time wages and benefits, seasonal labor, and advertising, offset by significant inflationary pressures.\n\nAdjusted EBITDA for the quarter was $155 million compared to $170 million in second quarter 2021. Excluding the $11 million related to our terminated international development agreement in China, which was recorded in the second quarter of 2021, adjusted EBITDA decreased $4 million or 2%. Due to the impact of spring break timing, which often shifts attendance between the first and second quarter, we believe the most accurate measure of our early season performance is the first and second quarter combined. In addition, since our park operations were impacted during the first half of 2021 by pandemic-related closures and capacity limitations at certain parks, we believe it is more instructive to compare our first half results to 2019, which had a similar operating calendar to 2022.\n\nRelative to 2019, our first half 2022 revenue decreased $32 million or 5%. As a result of our premiumization initiatives, attendance declined by 4.3 million or 34% offset by a significant increase in total guest spending per capita of $23 or 53%. Adjusted EBITDA decreased $8 million versus first half 2019, but the periods are not comparable due to a fiscal calendar shift and a reduction in international agreements revenue from our terminated operations in China and Dubai. Accounting for these impacts, adjusted EBITDA for the first half 2022 versus the same period in 2019 increased $6 million or 5%.\n\nWe believe this growth reflects the impact of our strategic shift and our increased operational efficiency. I will now review each of these two adjustments in detail. First, we changed our method of reporting fiscal quarters beginning in Q1 2021. The second quarter of 2019 ended on June 30, while the second quarter of 2022 ended on July 3.\n\nThe net impact of this calendar shift compared to 2019 was an additional 400,000 in attendance and $26 million of revenue compared to first half 2019. Adjusting for this reporting calendar shift, first-half attendance is down 4.7 million or 37% versus 2019. Second, we had a $26 million reduction in international agreements revenue from China and Dubai in the first half of 2022 versus the same period in 2019. Excluding this revenue and adjusting for the reporting calendar shift, revenue was down $31 million or 5% versus first half 2019.\n\nI will now move on to expenses. Our first-half cash operating expenses and SG&A decreased $18 million or 5% versus 2019 due to our leaner corporate overhead structure, less advertising, and our initial efforts to optimize full-time and seasonal labor based on lower attendance levels. There are three main factors at play within our cost structure. First, on our last call, we called out approximately $80 million in cost headwinds in 2022 relative to 2019.\n\nIn the second quarter of 2022, inflation has accelerated. And now we expect $90 million in total cost headwinds for the full year versus 2019. Second, we have reduced our corporate overhead structure as part of our decentralization strategy. And third, we are in the process of lowering park operating costs to better align our costs with our reduced attendance levels.\n\nGoing forward, we expect our cash operating and SG&A costs to remain below 2019 levels, and we expect to further reduce our fixed cost base at our parks. I will now transition to our active pass base and select balance sheet metrics. Our active pass base as of July 3, 2022 comprises 4.5 million active pass holders, as compared to 6.3 million as of July 4, 2021. This decline is a result of our premiumization strategy, as well as our decision to discontinue selling new memberships earlier this year.\n\nDeferred revenue as of July 3, 2022 was $171 million, down $139 million or 45% compared to second quarter 2021. The decrease versus prior year was primarily due to a deferral of revenue from guests whose benefits were extended from 2020 into 2021 due to the pandemic. The reduction in unit sales was largely offset by the higher average prices versus 2021. Compared to the same point in 2019, deferred revenue declined by $64 million or 27%, primarily related to the decrease in season pass sales.\n\nTotal capital expenditures for the quarter, net of insurance recoveries, were $26 million. We expect our full year 2022 capital spend to be slightly higher than 2021 with a balanced approach between several exciting new roller coasters and an increased emphasis on implementing guest-facing technology and amenities in our parks. Over the next couple of years, we expect to invest approximately 130 million in annual capital expenditures, which will prioritize park beautification and other in-park initiatives, food and beverage enhancements, guest-facing technology improvements, and new rides and attractions. On July 1st, we paid down $360 million of principal value on our 7% notes.\n\nReducing debt is a top capital priority after investing in our parks, and this prepayment is a big step in reducing our leverage and interest burden. Our net leverage ratio is currently 4.7 times. Over the next 12 months to 18 months, we plan to further pay down debt and look to opportunistically refinance our 2024 maturities as we work toward our target leverage ratio of three to four times. While debt pay down remains a primary focus, we also opportunistically purchased $97 million in common stock or 3.5 million shares.\n\nA dislocation in our stock price provided us the opportunity to repurchase shares at what we believe are attractive prices. To sum up the second quarter of 2022, we are encouraged by our strong guest spending and our improved operational efficiency, which positions us well to leverage future growth. Now, I will pass the call back over to Selim. Selim?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThank you, Gary. 2022 is a transitional year for Six Flags as we reset the foundations of our business model to focus on delivering a premium guest experience, while at the same time correcting for decades of heavy price discounting. Raising price is no easy task for a company that has trained customers to expect discounts. And in 2022, we have shocked the system with a significant increase in ticket price.\n\nThis has resulted in lower, but more profitable attendance. I would like to take a minute to thank our team members who have been a tremendous driver of our new strategy by pivoting, adapting, and transforming our culture in a very short time. As a new CEO in my first year, I could not have achieved all these changes without the full support, dedication, hard work, and commitment of the Six Flags team. I was brought to Six Flags to achieve an ambitious goal to reach $710 million of adjusted EBITDA within three years.\n\nI strongly believe that as we execute on our goal to dramatically improve the guest experience, we will recapture a portion of our lost attendance over time at higher pricing and with lower costs to service the reduced attendance base. This will position us to achieve this goal and continue to grow earnings in a sustainable manner over time. Operator, at this point, could you please open the call for any questions?\n\nOperator\n\n[Operator instructions] The first question comes from David Katz with Jefferies. Please go ahead.\n\nDavid Katz -- Jefferies -- Analyst\n\nHi, good morning everyone. Thanks for taking my questions. Two for me. You know, understanding the intent and commitment to getting the attendance or the lost attendance back, if you could talk about some of the data or evidence that you have seen so far that you can recapture it, or that you will recapture? And then second, on the capital allocation side, you know, particularly focused on the share repurchases, right, which I think, if reading the math correctly, were actually purchased at a higher level than where the stock is today.\n\nAnd from the looks of it, you know, it may go down a bit more today. And given the opportunistic, you know, perspective that you talked about, should we expect that you will continue to buy and look to buy more, you know, given that obviously it's going to be lower and therefore the dislocation, as you call it, would be more so? Thanks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nDavid, let me answer the first part of your question, what is our confidence level of being able to regain the lost attendance. First of all, the lost attendance is driven by our decision to basically change our customer base, our guest base. So, let's not forget that this was not a decision like the market dropped off us. We have basically changed our strategy of creating a better guest experience by having fewer people in our parks.\n\nSo, at the end, what happened so far in the first half of the year? In the first half of year, basically, we have trended down, and we have trended down maybe 10% to 15% below where we would like to be. However, let's go back and say, what's going to happen next? What is our sweet spot? So, our sweet spot in order to, per year, where we can still achieve an optimal guest experience is 25 million to 27 million guests per year. So, we need to grow our attendance today by another around 3 million to 4 million people. So, from that, I want to basically -- without losing our stickiness of our per cap and result affecting the guest scores.\n\nSo, one, how do we do that? Our biggest opportunity, literally, so far is to convert a fraction of our record single-day ticket holders that have come to our park this year versus any other prior years into season pass holders this fall. That is our biggest opportunity. Because people drove and paid top dollars at single-day ticket holders to come to our parks. We need to create -- convert a fraction of those back to us.\n\nSecond, we have basically discontinued a very popular perk, which is unlimited dining meal plan. That is a very big perk, and that affected, well, I would say, at least a million plus of our guests. We are in the process of reintroducing a dining plan. And that dining plan is going to be a value to our guests but also a way for us to be able to make money and not lose money on that meal plan.\n\nAnd I think we will recapture a part of those guests that we've lost.\n\nDavid Katz -- Jefferies -- Analyst\n\nAll right. Thank you, Selim. If I can maybe just follow that up very quickly. You know, the question was really around evidence that it will rebound and whether we should be thinking about next season achieving that impact? Or is that a this year kind of thing?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nI think it's going to be both. I think this is a transitional year for us. Let's make clear that this is a year of transition. And I think, as we've made and shocked the system, honestly, this company has been used to heavy discounting for many, many decades.\n\nNow, we came in and shocked the system. And we are truly in a pivoting year for us, which means at this moment, we will expect that some of it will come in this year, some of it will come in 2023. So, we're not dropping 2023 to make 2022. Let's make that clear.\n\nAt the same time, I have to tell you that one aspect of our attendance being down is group-related visitations. While it's better than 2021, it is much lower than '19, we are down 33% or more from 2019. We missed a lot of schools and newsgroup events in the spring. Hopefully, this would get better in spring 2023.\n\nOnce you missed it in the spring, you don't get a chance to make it up until next year. So, basically part of that is try to come and make up the group sales that we lost in the spring.\n\nGary Mick -- Chief Financial Officer\n\nDavid, I'll take the question you had on capital allocation. Our priority remains to pay down debt and reduce our leverage ratio. On our last call, we stated we also might engage from time to time to buy shares opportunistically if market conditions create a dislocation on our stock price. And that stays the same in this quarter.\n\nWe're going to focus on investments in our parks first. We're going to pay down debt second. And we will keep our open mind depending on the opportunities that we are afforded on our stock price.\n\nDavid Katz -- Jefferies -- Analyst\n\nThank you very much.\n\nOperator\n\nThe next question comes from Ian Zaffino with Oppenheimer. Please go ahead.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nHi. Great. Thank you for taking my question. I guess, can you guys just walk us through, you know, some of the pricing mechanisms you guys have? You know, how are you coming up with the pricing that you're trying to push through now? How do you know that that's the right price? You know, I get what you're saying if you raise price, you get rid of let's just say, the lower-margin customers and then there's hope of rebuilding back that base with a better customer.\n\nBut, you know, how do you know whether you maybe overshot on the pricing side or if there's an opportunity to maybe even take pricing higher? So, you know, basically, what's the system, what's the mechanisms and maybe walk us through your thinking on the pricing? Thanks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nOK. Ian, thank you. I will answer that question. First of all, I will start with a major premise.\n\nOur pricing is still below the other players in the industry. Let's start there. And we provide as good as value as any of the other players in the industry. And for that, there is no reason for us to be priced below them significantly, despite today, our price increase was still below them.\n\nNow, the question is, should we have taken all that pricing all at once or should we have taken it over time? That's maybe the question that everybody has on their mind. And I believe, very strongly, that taking the Band-Aid, ripping off the Band-Aid all at once is a lot better for our guests for our employees then having it every year now, we're going back and sticking them with another huge price increase. And I believe during this year of inflationary pressures where everybody has taken price, it was a very good timing to take care of that. Now, let's address -- the second part is, did we take the right pricing or did we take the wrong pricing in terms of price increase? I strongly believe that there is more opportunity for pricing to take place.\n\nAnd I have to tell you that having done what we've done, not only taking away freebies, bring a friend, taking away -- we put in blackout dates days. We basically didn't allow now new season pass, the entry-level season pass doesn't allow to go all the parks or even to some of the water parks. We took away the dining plan, the free drink bottles. I am very pleased to see where our dollar revenues have been in the first half.\n\nAnd the number of fans that continued to come to our park and willing to spend significantly in our park. So, let me give you some data that, for me, illustrate why our pricing, our premiumization strategy has worked. So, let's start first with what I call our realized pricing resulting -- has resulted in record revenue per cap in our first half. Admissions per cap increased by 57% to a record $37.75.\n\nAnd most interesting is our in-park per-capita spending increased by 47% to a record $28.46 in the first half, compared to the first half of 2019. So, we're comparing apple to apple. So, we know that the pricing work, we know the premiumization is working. And the second data point I would like to bring is our high-dollar revenues.\n\nCompared to both 2019 and 2021, where we are comparing to some very aggressive ticket offerings, perks, and freebies in both those years in 2019 and 2021, I know we can do better, and we want to do better, especially in the area of marketing and communication. But I'm very pleased and we are with the revenues -- a dollar revenues we generated despite a huge drop in attendance in the first half. I think we can really continue to drive higher-dollar revenues with lower attendance. And what does this bring to us? It brings lower costs and a better experience in our parks.\n\nSo, to answer your question, I believe that there are tweaks to happen. I don't think we have perfected our pricing strategy. We are doing tweaks to it. And it depends on each parks.\n\nI think we have to go back to each parks and make sure that those parks are basically connecting with their communities and their constituents and what makes sense for each park. However, we are not going back to the days of heavy discounting, freebies, and the perks that were given. So, I just want -- I think we have some minor tweaks to do. But over the long term, we believe that there is more opportunity for pricing going forward.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK, great. Thanks for the color. And then just if I could sneak in one smaller question, is the sponsorship revenues, could you touch on the decline? I don't think I heard that in the prepared comments. You know, what drove that? And should we expect it kind of to really cover back to where it has been, you know, in previous quarters? Thanks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nSo, let's start talk about sponsorship. At this moment, our sponsorship revenues are down, significantly down. And I think part of it has been a dual reason. One, I think some of our sponsors have faced inflation this year, and maybe they've had some slowdown within that.\n\nSecond, I would say, we have also turned away some of our sponsors. As the stock -- we've had the impact of COVID as COVID decreased, and then we had also us coming back and saying they don't fit who we want them to be. We are changing our sponsorship makeup of the park to make sure that we don't get sponsorship on one end and end up being hit by costs on the others. So, a sponsor comes and say, \"I'm going to give you,\" I mean, lets' take an example, \"$5 million to promote my brand in your park, but I wanted you buy the products.\" And we end up spending $8 million on their cost.\n\nNow, it doesn't make sense for us. So, for us, at this moment, we are reevaluating our sponsorship. And we are looking at a complete different strategy for 2023.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK. Thank you very much.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Ben Chaiken with Credit Suisse. Please go ahead.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, thanks. Just three quick ones. And I can repeat them if you need. So, on the cost side, Selim, you mentioned still lagging your expectations and you want to operate more efficiently going forward.\n\nSo, should we assume that the decline versus '19 accelerates here? Meaning, is that the right interpretation you're down, let's call it, sub ballpark 3% or so in the first half versus '19 on a combined SG&A and opex? Does that improve in the back half? And then number two, attendance, I think you guys gave us some data points on the 1Q call, and we can infer that April started, you know, down around 30% versus '19. So, are we -- can you help us with some cadence to the quarter? Are we run rating at a down 40% or so? Is that where we are ballpark? And then last quickly on dining. You mentioned bringing back some dining plans. Is that going to be different than what you're currently offering now at your parks, which, I think, is kind of like a bundled package? Or is it kind of -- or is it one and the same like what we see today? Is that it? Thanks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nSo, I'm going to most probably answer the cost one first. I will start to say, we are very disappointed with our optimization efforts. While we are pleased with the results so far, I believe we could have done a much better job, we left money on the table. For example, our staffing levels were not optimized given the reduced attendance in the first half.\n\nWhat I mean by that is, we could have done better with the right mix of our employees, the right scheduling, the right mix of full-time and seasonal worker. I will go back to cost and talk about also where I see we have to continue to find efficiencies and other initiatives to offset the impact of inflation and our drop in attendance levels. I will tell you, Ben, that we are very focused on cost while still improving the guest experience. So, I'm going to turn it basically to Gary to give you a little bit more color on truly where do we -- where we are and where do you see ourselves going with respect to our costs.\n\nGary Mick -- Chief Financial Officer\n\nThank you, Selim. And, Ben, good questions. Appreciate that. We plan to -- our costs will be lower than 2019, and that's about as much guidance as I can give you, pending the impact of inflation, which is still relatively unknown.\n\nMoving on to the run rate attendance question, we believe we're going to continue Q3 at this stage to be approximately 35% below 2019's attendance levels. And then, dining, Selim, I'll turn back to you.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nSo, I will talk to dining. But before, I would like to bring up something very important, Ben, if you want to talk about. I think we got hit like everybody in the industry and this is not an excuse. We're not trying to present something that's not been general everywhere, but we have been hit this year, or will be hit this year in around $90 million to $100 million in inflationary costs.\n\nAnd we have been able to manage those costs very efficiently so far at least in the first half compared to 2019 and 2021. And we believe that we'll continue optimizing our cost to offset that inflation. And most important, I would like to bring up something very important having to do with maximizing operating efficiencies. We are using data analytics to adjust the operating calendars of our parks, our restaurants, our retail store, and our rides.\n\nThis is totally new to Six Flags, of being more proactive in decision-making where we are guiding in data to make sure we are driving value creation. This is something that has not been used to that extent at Six Flags. And it's all used on maximizing efficiency in the second half of this year using the data analytics and predictive analytics that we're putting in place to create that culture of maximizing efficiencies and optimization. Now, let's go back to dining plan.\n\nThe dining plan is something that customer -- guests love. And we're not going to take that away. It's something that guests love, but it was not something good for us for three reasons. One, it was basically priced too low.\n\nSecond, it basically did a huge traffic jams in our restaurants. So, the people who are paying, coming, and paying for a meal were basically fighting in-line with people had a meal plan that could come in back and eat whenever they wanted. Number three, we had a technology issue. We could not monitor if somebody would come back in the park five minutes later threw their meal back in a trash can and came back five minutes later, 10 minutes later, in line to get it again.\n\nToday, we need to get that technology to make sure that people are not abusing the system. And we're putting together this technology, which is in place with our -- with the other players in the industry, whether it's a time lapse, where you can come in, enter a time lapse, or monitoring that you can get extra amount of meals a day, but you cannot come in and keep on throwing food away and going to every restaurant and abusing the food and so on. If you take a bite of a burger and say, \"OK, I'm going to go get a hotdog,\" and take a bite of hotdog, then I throw the hot dog away. So, we had no technology to be able to limit the waste.\n\nAnd now, we're putting all this in place.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nThat's really helpful. And you mentioned minus 35 is your expectation kind of going forward on attendance, but presumably -- unless I misheard you, but presumably, you know, you had to be lower than that. You started the quarter at 30, minus 30. So is it percent minus 35, assuming you get some benefit on this food initiative? Or are we already seeing things getting a touch better? Does that make sense?\n\nGary Mick -- Chief Financial Officer\n\nYeah. Yes. Thank you. That is the assumption that we will be picking up some of our attendance decrease through the initiatives that Selim talked about previously.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nThank you very much.\n\nOperator\n\nThe next question comes from Steven Wieczynski with Stifel. Please go ahead.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nYeah. Hey, guys. Good morning. So, Selim, you mentioned in your prepared remarks you were brought into this company to drive EBITDA north of 700 million over a couple of years.\n\nAnd, you know, based on your commentary, I got the sense, you probably still think the company could eventually get to a level that high. So, I guess the simple question is based on what we're seeing today in the business, and look, I fully understand we're only two quarters into this strategy change, but, you know, how can you get this company to a level of EBITDA that high with attendance eventually in that $25 million to $27 million range? I mean, either, you know, we're going to need to see per caps go substantially higher from here or costs are going to have to be dramatically below 2019 levels. So, I'm just trying to understand if I'm kind of thinking about this the right way?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nVery good point. I think let me first reassure that I remain very confident that reaching the 700 million-plus is achievable within three years. How we're going to do that? Simply, one, we are one focusing on going back and recapturing some of our attendance that we've lost. And I gave example of that.\n\nConverting single-day ticket orders into that, converting guests we lost because of the dining meal plan. Members, we have an amazing program, which has been grandfathered. And part of the issues on, we've lost million or plus members because we basically canceled that program. And I have to tell you, on social media, and people reach out to me saying, \"Please don't cancel membership.\n\nI would like to add a grandchild or with their family, I would like to add more members.\" And we say no. So, we have opportunities to go back and figure out how we grow attendance. I think we will get there over time to go back to that 25 million to 27 million. I think our biggest opportunity is to keep on increasing price and catching up with our competitor by elevating the guest experience.\n\nI think we've -- at the end, the only thing that matters in my opinion is having people come back. Our success is all about the quality of our guest experience. The objective is to keep our guests coming back for more visitations during the year and next year. And I think something where we're putting a lot of emphasis on this is two-fold.\n\nOne, we have changed our customer base to today having more families coming in our parks. And we know that families spend a lot more money in our parks than young adults. Our percentage of families in the first half that attended our parks, given our premiumization, has been tremendous. We're talking not about 1%, 5%, but we're talking about multiple percentage points of families coming, driving to our parks, and spending more money.\n\nWe need to attract more of those people to our park. I also believe that once we start promoting the premiumization, which we have not done this year. We have basically been very low key on promoting our advertising and marketing because we wanted to be able to not spend money until the parks are fully done with the beautification. And I believe we will get there in terms of getting more of those people we want.\n\nBut then we have the expense side. On the cost side, we have a lot of cost to be taken out of the business today. So, if you like what you've seen in our costs so far, I think it's just the beginning. We are obsessed by our expense side.\n\nWe are obsessed through data analytics to drive -- and technology, guest-facing technology to drive the experience up and our cost down.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nSo, thank you very much for that. And then the second question it's going to go back to this premiumization strategy, and it's a question we get a lot from investors. You know, is there a point though, I don't know if it's six months down the road, a year from now. Let's say the strategy and you can't drive the attendance back to where you want it to be, is there a point where you guys just say, hey, \"This isn't working,\" and you pivot back away from where you are today and kind of go back to the way the business was being run before?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nI think that we are very pleased. Honestly we are pleased of overall progress in our strategy. I think not only me, the board, the guests, I think if you look at the trending of our guest scores, we are very pleased with our strategy. I think the safety and well-being of our guest employee has been a top priority.\n\nAnd I think if you look at our safety record -- our security this year, you look at the number of rides our people have taken, you look at the employee friendliness because now our employees are not stressed out. I don't think we'll ever come back to what Six Flags used to be. I don't think there is a return to this. Otherwise, the board would not have embraced that strategy and willing to pay a short-term pricing or short-term hit for a long-term benefit.\n\nI think very clearly that we might need to tweak a few things, but I don't think this is a complete going back and undoing all what you've done.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nVery clear. Thank you very much.\n\nOperator\n\nThe next question comes from Chris Woronka with Deutsche Bank. Please go ahead.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nHey, good morning, guys. Not to beat the dead horse, but just to zoom in a little further on the attendance. Selim, where do you think the customers that you want to get in the future? Where are they today? Because it sounds like there's a certain group and type of customer you don't really want back based on their spending patterns and other things. And then where does this customer come from? Is it somebody that's intentionally avoiding the park today? Are they going to baseball games instead? Or are they going to some kind of competitive -- other competitive outdoor product in the market? Is there any way to think about that?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nWell, I can tell you, I can start with friends of mine who the last time they've been at the park at the Los Angeles park and they used to go a lot to the park was four years ago, and they had never stepped in the park again. And those people who were spending a lot of money on flash passes, spending a lot of money on eating in the park, and they never came back. So, ultimately, I asked them to visit the park in June. And I say please visit the park and see what you've gone through.\n\nAnd the husband took his children and went to the park and sent me an amazing message from the park with pictures about how he enjoyed the park. It's a different park. He said it is not -- it's not overcrowded. I look at people like look like me.\n\nI want my children to be safe. I don't want rowdy teenager running around. He said, \"I saw a lot of families.\" He loved the park. He just went back again and bought tickets for next week, his wife, his children, and all their friends to go to the park.\n\nThis is the type of people we need. Now, on the other side, what is missing? We have most probably missed on our marketing and communication. I will have to admit this is an area where we have not promoted as well this year what happened in our parks. And we're going to put a big drive in 2023 to make sure that people understand with a lot of influencer, digital media, but most important driving testimonials of why people want to come back to our parks.\n\nTestimonial of somebody like my friend who was delighted to come back.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nThat's very helpful. Thanks, Selim. And then just follow-up is, you know, I think you said one of the keys going forward is going to be to convert the single-day passes you're getting now into the season passes, right, for next year. How is that going to impact the pricing dynamic? Obviously, there's going to be a difference in kind of how that's priced? And so, how should we think about that going forward in terms of how it's going to look, you know, in the ticket per caps?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThat's very, very good question. So, let me breakdown a little bit where we see the future growth of our attendance. So, single-day ticket this year was a big part of our business. So, it's the highest it's ever been.\n\nSo, it's around 6 million ticket -- single-day ticket holders this year. So, my feeling is those people do usually one visitation. If I can get some -- and they spend money. We know that single-day ticket holders spend money.\n\nThey pay for parking. They pay for food. They pay for flash passes. If I can convert them in a single -- into seasons pass and be able to have them visit more, this is a type of customer we want.\n\nSo, our objective is to get a fraction of those 6 million to become seasons pass holder, hopefully given the experience they have, given what they need to be, at least to get them to come back a second time this year, if not the season pass get them to come back to our Oktoberfest, to our Fright Fest, and holiday in the park. So, that's one of our objectives that we need to do. And we're lucky that we have so many single-day ticket holders that came to us this year. So, that's a good conversion.\n\nSecond, we have legacy season pass holders that came and expired. Those people expired. And they were from the old pricing architecture that were bought last year. And those people expire, most of them, it's around 2 million of those people that expire this year.\n\nAnd we're hoping that to get those people a fraction of them to switch to our new pricing architecture and convince them that with the new premiumization and all of that they will come. Then we talked about the dining meal plan. So, we lost over a million, between a million to 2 million just because of dining meal plan. And we're hoping once we introduce that, they will come back.\n\nSo, between those several initiative we have, I'm very confident that we will basically, over time, it might not happen in a year. People need to be convinced, wait a minute, is the experience better? All of that coming. So, we'll basically, over time, and I'm talking not three years, but I'm talking maybe by this time next year, we'll most probably start seeing a much -- we'll close the gap to that 27 million guests.\n\nGary Mick -- Chief Financial Officer\n\nAnd, Chris, if I might, this is Gary. I would add that the conversion of summer pass -- to single-day to annual pass would be accretive and at the absolute worst would be neutral to our current per-cap rate.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nOK. Very helpful. Thanks guys.\n\nOperator\n\nThank you. The next question comes from Barton Crockett with Rosenblatt. Please go ahead.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. Thanks for taking the questions. I was curious about the variance versus what you were expecting coming into the first quarter of your strategy, the first full kind of seasonal quarter. I assume you had, you know, some kind of internal projection or estimate of what would happen to your attendance this quarter.\n\nAnd now you have some actuals. And I'm just curious to what degree were the actuals different than what you expected, and to what degree have you been able to kind of analyze that and see what drove the variance. You know, so, that kind of postmortem is my first question.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nSo, I think when we did this strategy, we recognizes it will be between 20% to 25% down to our basically right now between 10% to 15% below what we expected. And I think it came up, if you want to break that difference. So, we wanted 20%, 25% down because we knew that -- I think it was part of the strategy, because we knew that our parks were not delivering a great experience. It was stress on our employees.\n\nIt was stress on our rides. It was stress -- it was chocking points everywhere. So, let's go back and define the strategy again. So, I want to define it so people understand that this was not a decision to come in and just raise prices.\n\nThe decision was, we had in the park five chocking points. We mean chocking is places where touch points with our customers. It started with the parking. To enter our parks at any time in 2021, 2019 would take 20 minutes to 30 minutes to enter the park just because the lines were tremendous to come in.\n\nThat's one choking point. The second choking point was coming into our park because you need to be searched and that all used to take also another 20 minutes to 25 minutes. Then it gets worse from here. To hit our restaurants, the restaurant were basically -- because we were running at almost full capacity in our parks, the restaurant at any time, you need to wait 15 minutes to 20 minutes to 25 minutes to be able to utilize our restaurants.\n\nThen you go to our restaurants. It was an hour to two hours to get your meal. Then at the rides, it was a minimum two hours to ride the ride. So, basically, we realized that literally we had discounted too much.\n\nAnd the philosophy of filling our parks was not the right strategy. At the end, all we're doing, people did not have a good experience, as I mentioned, with our friend, who did not come back in four -- since four years ago, because it was not an experience for him willing to pay for it. So, we only got the discounter or we became a day care center for teenagers. It was a cheap day care center for teenagers during breaks and the summers.\n\nWe changed the strategy and we said, \"OK, what is the sweet spot?\" And the sweet spot was 25 million to 27 million. Now, in order to be able to institute a new pricing strategy, we had to start going after customer who wanted -- families, young adults who are willing to come and spend the money in our parks. And we wanted our members who we feel strongly about to have a great guest experience. So, we went and did a lot of analysis on what the pricing should be.\n\nOf course, we would have liked to be almost the same price as our other players, but we said, we're going to take a big jump this year. And over the next two years, we'll catch up with our -- I don't like to call them competitors with other players, like SeaWorld and Cedar Fair, who have been able to have more pricing discipline than we had. So, that's what we've done, and that's where we continue to go with the pricing. And we believe that as we move and transfer our guests from the previous customer we have to a new customer base, of which 65% to 75% have stuck with us, we're very comfortable that we will reach the other 3 million to 5 million guests that we need.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. You know, and if I could add another question, I'm curious about the demographics of the base that you're starting with. So, the season pass members, the database you have of people who have come in for a single-day pass, to what degree are those people who are comfortable in the current kind of economic circumstances and to what degree are those people who are stressed. We're seeing a divide in the economy for Walmart consumers who can't afford to buy clothes because they're spending all their money on fuel and food, and the Disney customers who are willing to pay up for a few new experience at their parks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThat's correct.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nCan you give us any data on where your customers sit demographically?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nYeah. So, I can answer that question very clearly. At the end, our objective is not to become a park that's not affordable to everyone. So, let's make that clear.\n\nOur objective has always been want to be a part for the middle-class and even lower middle-class. And fortunately, over this past year, I think many of our customers, even if you kept the pricing the same as last year, their disposable income has been hit pretty hard. So, there was no point to try to say, \"How do I capture those people again?\" Because they suffered. They suffered with gasoline prices.\n\nThey suffered with their utilities at home. They suffered with their pricing at the supermarket. Those people were not able to come. And hopefully, if the inflation comes back to normal, I'm hoping that some of those people come back to our parks and enjoy the new premiumization and beautification.\n\nBut let's put that aside. On the second part, we believe that we -- our demographic is what I call the average income of the U.S. That's who we are. And I think we are trying to migrate -- I call it very different.\n\nI'm migrating a little bit from what I call the Kmart, Walmart to maybe the target customers, if I want to say that.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. All right. Thank you.\n\nOperator\n\nThe next question comes from Brett Andress with KeyBanc Capital Markets. Please go ahead.\n\nBrett Andress -- KeyBanc Capital Markets -- Analyst\n\nHey, good morning. Just to clarify, do you expect 2022 EBITDA to still be above 2019 levels?\n\nGary Mick -- Chief Financial Officer\n\nHi, Brett. This is a great question. At this stage, we are striving to exceed the 2019 EBITDA, and that is our goal. Whether we can get there or not depends on the headwinds that we're facing with inflation, whether or not the attendance metric increases in the second half of this year, which we are determined.\n\nAnd we have wonderful effective programs that Selim has laid out to achieve. And our long-term goal, as he has also indicated, is always north of 700 million within three years. That is where we're focused. And everything we do is on the long-term vision.\n\nBrett Andress -- KeyBanc Capital Markets -- Analyst\n\nGot it. OK. And then at this point to get all of these people back that you're talking about, do you think that these parks need more reinvestment in the form of capex and rides and attractions. Because, I mean, you talk about getting pricing closer to the other players, but I think many of us would argue that those players have historically invested more than you.\n\nSo, do you think that you need that to bridge that gap?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nI can answer the question, if you want. I think first of all, the question, I'm going to repeat it in a different way. How are we spending enough to impact our guest experience? So, I will answer very clearly that we have ample ride capacity in our parks. Each of our parks have introduced a new ride of attraction every year and larger parks now have between 10 to 18 roller coasters each.\n\nI don't think that's an issue. I'm going to also say very proudly that despite all what people have said, we are introducing a lot more rides still today that we have introduced a lot of rides going on, but which I'll talk about in just a minute. But let's go back. Now, we have to deploy more resources effectively on guest-facing technology, on food and beverage service, and other attractions.\n\nThese investments, in my opinion, are less capital intensive than new rides. So, what we have been able to accomplish today is not important to have a new ride if you have to wait two hours to get to a ride in the coaster. The question is, we need to make sure that we increase our ride per guest per day, and we have been able to do that. And we're very proud of that.\n\nAnd then you can see our guest scores -- satisfaction score has gone up tremendously. So, what do we want to do now? We've been able to effectively invest in single-rider lanes in QR technologies to our park. And we will continue helping our guests navigate better our park and become easier to do business with. Unfortunately, we're not as easy to businesses as I would like it to be, as we all like it to be.\n\nSo, that's where we're spending the money. Now, let's talk about something else. Even though we have basically say that we have not invested in new rides, and it has not been our priority this year, we will introduce -- we will be introducing record-breaking and first-of-its-kind ride this year at Magic Mountain, Wonder Woman Flight of Courage single-rail coaster, the park's 20th coaster; at Fiesta Texas, Dr. Diabolical Cliffhanger, the world's steepest dive coaster, over Texas in Dallas; Aquaman: Power Wave, the first of its kind water coaster in North America and the park's 14th -- 15th coaster in that park.\n\nIn St. Louis, Catwoman Whip is going there. In Discovery Kingdom, Sidewinder Safari, a unique combination of family coaster and animal exhibit. And then in Darien Lake, we are rebranding the waterpark and making it up to standard of Hurricane Harbor.\n\nI think if you look at what we're introducing still this year, I think we've introduced, I think, a lot of rides, even though this has not been our priority going forward at least for the next two years.\n\nBrett Andress -- KeyBanc Capital Markets -- Analyst\n\nThanks.\n\nOperator\n\nThe next question comes from Eric Wold with B. Riley Securities. Please go ahead.\n\nEric Wold -- B. Riley Financial -- Analyst\n\nThank you. Two questions, if I may. I guess the first one, I want to follow up on your comment that you lost 2 million pass holders from renewing because of the old price architecture and the new pricing. How much was the delta in pricing dollars between what they were paying before or what they would have paid new that kept them from renewing.\n\nShall I get a sense of how price sensitive those 2 million holders were? And then the second question, obviously, you cut back on marketing spend substantially this year to, you know, not kind of promote the parks. And so, you've gotten to a point where you felt they could be promoted, so you kind of evaluate your plan for -- for next year. Is -- is your definition of marketing purely informational marketing? Is that, you know, kind of keeping customers informed as the park offerings, new amenities, rides, etc.? Or when you think about your marketing spend for next year, does that also include, you know, maybe a return to some level of promotions and discounting at higher initial price points to try to get back some of those attendees? Thank you.\n\nGary Mick -- Chief Financial Officer\n\nThank you, Eric.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nYou want to take the first part?\n\nGary Mick -- Chief Financial Officer\n\nI'll take the first half, Selim, which is his question on the past level change -- price level change? It depends on the product that was offered, Eric. So, I'm going to give you a range of percentages as it pertains to the year-over-year changes. But it is 50% to 100% is the price level change in our past offerings. Selim, the second question was on media spend.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nOK. I would like to talk about the advertising. So, what has changed our pricing methods. One, we'd like to target two types of customers that we have not done in the past.\n\nIn the past, at Six Flags over the last 10, 15 years, they've only targeted people come to the park. We tried to basically incentivize people who come. So, our database is only going to people who have been at the park. So, if you've never been in our park, you will never get an email from us.\n\nNow, we're changing that philosophy, and we're going to a broader market. We're going to, what I call, more affluent neighborhoods where we would like to bring people from those neighborhoods to come to our park who have not been targeted before. That's one change of that. Not only targeting the existing and current customer or potential customer who used to come to our park, but target completely new customers that have never been to our parks.\n\nSecond, our adjustment in our marketing is shifting and pivoting to focus more on digital advertising and influencers. What we've done this year has been the fact that influencer have monitored and watched and observed the change in our parks, and there has been a lot of them blogging about how great the park is. Our biggest reach is places like TikTok where we have been nonexistent and would like to go back with the influencer and be able to be on TikTok and reach a complete different population, young population, adult, as well as families that have not been able to be reached. The other one is focusing on mom.\n\nMothers are a big decision-maker and drivers of young adult to our parks. And there are a lot of bloggers and there are a lot of entertainment blogging by mothers who prefer about where we need to be and where we need to do and we need to catch that up. I think that's our focus is focusing mothers, influencers, social media like TikTok, and targeting not only the people who use -- have used the park or coming, but people who are outside our database and try to get people to try to experience our park for the first time.\n\nOperator\n\nWas there a follow-up, Mr. Wold?\n\nEric Wold -- B. Riley Financial -- Analyst\n\nNo, all set. Thank you.\n\nOperator\n\nThank you. This concludes our question-and-answer session. I would like to turn the conference back over to Selim Bassoul for any closing remarks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nI would like first to conclude this call this morning by saying how proud I am of our team and what we have accomplished. I think our team has worked hard to create a unique guest experience and operating our best parks in the industry and by achieving what I call a record total guest spent cap, both on the admission level, as well as on the in-park spend. And that has been evidenced by our -- validated by our guest satisfaction rating, by our safety and security in our parks, and by basically making sure that people are enjoying themselves in the park. Second, I would like to -- on behalf of Gary and the rest of the management team at Six Flags, I would like to thank you for joining us this morning.\n\nAs you heard today, we are confident in our long-term strategy, and we believe that we will drive operating and financial results to meet that ambitious goal of $710 million of EBITDA in three years. Thank you for your continued support. Six Flags is uniquely positioned to create fun and thrilling memories for all. Take care, and we hope to see you at our parks this fall for Fright Fest or Oktoberfest or Holiday in the Park.\n\nThank you. Bye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Purtell -- Senior Vice President, Investor Relations\n\nSelim Bassoul -- President and Chief Executive Officer\n\nGary Mick -- Chief Financial Officer\n\nDavid Katz -- Jefferies -- Analyst\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nBrett Andress -- KeyBanc Capital Markets -- Analyst\n\nEric Wold -- B. Riley Financial -- Analyst\n\nMore SIX analysis\n\nAll earnings call transcripts"
}