{
  "companyName": "MongoDB",
  "companyTicker": "MDB",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/07/mongodb-mdb-q3-2023-earnings-call-transcript/",
  "content": "MongoDB (MDB -1.01%)\nQ3 2023 Earnings Call\nDec 06, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to MongoDB's third quarter fiscal year '23 earnings call. [Operator instructions] After the speakers' presentation, there will be a question-and-answer session. [Operator instructions] Please be advised that today's conference is being recorded.\n\nI would now like to hand the conference over to your speaker, Brian Denyeau, from ICR. Please go ahead.\n\nBrian Denyeau -- Investor Relations\n\nThank you, Carmen. Good afternoon and thank you for joining us today to review MongoDB's third quarter fiscal 2023 financial results, which we announced in our press release issued after the close of market today. Joining the call today are Dev Ittycheria, president and CEO of MongoDB; and Michael Gordon, MongoDB's COO and CFO. During this call, we will make forward-looking statements, including statements related to our market and future growth opportunities, the benefits of our product platform, our competitive landscape, customer behaviors, our financial guidance, and our planned investments.\n\nThese statements are subject to a variety of risks and uncertainties, including those related to the COVID-19 pandemic and the adverse macroeconomic environment and their impacts on our business, results of operations, and clients that cause actual results to differ materially from our expectations. For a discussion of risks and uncertainties that can affect our actual results, please refer to the risk described in quarterly report on Form 10-Q for the quarter ended July 31st, 2022, filed with the SEC on September 2nd, 2022. Any forward-looking statements made in this call reflect our views only as of today, and we undertake no obligation to update them except as required by law. Additionally, we will discuss non-GAAP financial measures on this conference call.\n\nPlease refer to the tables in our earnings release on the investor relations portion of our website for a reconciliation of these measures to the most directly comparable GAAP financial measure. With that, I'd like to turn the call over to Dev.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThanks, Brian, and thank you to everyone for joining us today. I will start by reviewing our third quarter results before giving you a broader company update. We generated revenue of 334 million, a 47% year-over-year increase and above the high end of our guidance. Atlas revenue grew 61% year over year, representing 63% of revenue.\n\nAnd we had another strong quarter of customer growth, ending the quarter with over 39,100 customers. Overall, we are pleased with our performance and execution in Q3 despite the challenging macroenvironment. Let me give you a bit more context on what we saw in Q3. We had another strong quarter of new business.\n\nWe added over 500 direct sales customers, and we keep winning new workloads in existing accounts, from start-ups to Fortune 500 companies. Our new business from Enterprise Advanced also significantly exceeded our expectations, which is particularly notable in this environment, given that EA requires an upfront commitment. Turning to Atlas consumption trends, we have seen an improvement in Q3 versus Q2, albeit still below historical levels. Michael will cover this in more detail.\n\nFinally, retention rates remained very strong in Q3, demonstrating the mission criticality of our platform. Indeed, our Q2 results are an indication that our value proposition resonates with customers even in a difficult macroenvironment. Let me remind you of the key pillars of our developer data platform. First, MongoDB enables our customers to unleash developer productivity.\n\nThe more productive developers are, the faster their organizations can innovate. The document model, which underpins MongoDB, has proven to be the best way for developers to work with data because it aligns well with how developers think and code. Second, MongoDB supports the performance and scale requirements of the most demanding modern applications. MongoDB is built from the ground up as a distributed platform and allows organizations to easily and cost-effectively scale their applications to address the most exacting performance requirements.\n\nThird, MongoDB allows enterprises to remove enormous complexity and costs out of their technology stack. MongoDB is a general-purpose platform capable of serving a broad array of use cases, including transactional, time series, mobile, search, and application-driven analytics. MongoDB continues to be the most popular modern data platform with developers. In the last 12 months alone, our open-source community server has been downloaded more than 150 million times from our website, which is more than in our entire company history through the beginning of 2020.\n\nAnd in Q3 alone, we had over 300,000 signups for Atlas feature, which is up 15x over the last five years. We also see growing evidence for how our value proposition resonates with IT decision-makers who are known for their focus on ROI, especially in economic environment such as the one we're in today. Customers who are moving to the cloud at scale, such as companies in the financial services industry, are increasingly choosing MongoDB as their underlying data platform to modernize their application portfolio. IT decision-makers value not being locked into any one environment, and by building apps on MongoDB, customers preserve their ability to run these apps on-premise, on any cloud, and to easily switch between cloud providers.\n\nIT decision-makers are also increasingly interested in consolidating vendors. By virtue of MongoDB's broad support for a wide variety of use cases as a general-purpose platform, customers can run most workloads on MongoDB rather than a disjointed set of narrow point solutions that increase the cost and complexity of their data architecture. Finally, we continue to gain mindshare with our partners, and we see them leaning into co-selling with MongoDB as they also want to leverage the popularity and value of their -- of our offerings. Starting with the cloud providers, all three hyperscalers now showcase MongoDB Atlas on their consoles to make it easier for their customers to sign up for Atlas given the increasing popularity of using MongoDB in the cloud.\n\nA number of large systems integrator is in the process of setting up business units focused on MongoDB given the size of the growing MongoDB practice. A growing number of ISVs continue to build their products in MongoDB. We currently have close to 200 ISVs co-selling relationships, which is up more than 2x compared to two years ago. Our growing popularity has tangible benefits for our business, especially in periods of economic uncertainty.\n\nIn times like these, customers typically default to vendors they know and trust and with whom they can consolidate spend while reducing overall costs. We see the current environment as an opportunity to establish ourselves as an enterprise standard with more of our customers. Now, I'd like to spend a few minutes reviewing the adoption trends of MongoDB across our customer base. The following customers are running mission-critical apps in MongoDB Atlas, leveraging the full power of our developer data platform, incorporating services such as search, in-app analytics, and mobile services.\n\nThese include Toyota Financial Services, Ulta Beauty, Mediastream, and Vodafone. Vodafone is a world-leading telecoms company, with over 625 million global customers in 65 countries. Vodafone is creating hundreds of new cloud-native apps. Underpinning these apps is MongoDB Atlas, which provides a scalable, resilient, and flexible data platform.\n\nAtlas also supports Vodafone's IoT ecosystem of 140 million-plus devices. MongoDB is a part of a suite of fully vetted tools that Vodafone allows developers to use to build any application. Several MongoDB customers are embarking on their digital transformation journey by choosing MongoDB Atlas and migrating from on-premise to the cloud, including American Tire Distributors, Schwarz IT, and Volvo Group. Schwarz IT, part of the Schwarz Group, uses MongoDB's Enterprise Advanced on-prem to drive innovation and fuel their own cloud service.\n\nWith more than 13,000 locations across 32 countries and brands like Lidl and Kaufland, Schwarz Group is Europe's largest retail company. Their internal IT arm, Schwarz IT, works in both internal teams and external customers to ensure smooth operations of their tech stack. Schwarz IT is also run STACKIT, a cloud provider that offers its customers all the benefits of cloud deployment while ensuring that data is stored in Germany under EU regulations. In 2022, STACKIT launched a MongoDB service to help their customers modernize apps and services and improve performance.\n\nHugging Face; Okta; Washington Post; Cisco; and L&T SuFin, a B2B e-commerce platform, are currently developing a number of applications across different parts of their business and significantly expanding the use of MongoDB Atlas throughout their tech stack. Hugging Face, a fast-growing AI company, migrated from MongoDB Community to MongoDB Atlas to scale their open-source platform and online community for machine learning. The company's shift to Atlas allowed them to rely on our developer data platform for software and security compliance, take advantage of change streams to speed decision-making, simplify the infrastructure through a single control plane for managing data, and reduce time spent on maintenance through Atlas' integrated services. In summary, I am pleased with our execution in the third quarter.\n\nWe had another strong quarter of new business, demonstrating that our value proposition continues to resonate in the marketplace and with developers, IT decision-makers, and partners alike. We are pleased to see a rebound in Atlas consumption in Q3 and continue to closely monitor usage trends. We remain focused on winning new workflows with new and existing customers and are committed to profitable growth as we pursue our enormous market opportunity. With that, here's Michael.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nThanks, Dev. As mentioned, we delivered a strong performance in the third quarter, both financially and operationally. I'll begin with a detailed review of our third quarter results and then finish with our outlook for the fourth quarter and full fiscal year 2023. First, I'll start with our third quarter results.\n\nTotal revenue in the quarter was $333.6 million, up 47% year over year. As Dev mentioned, we continue to see a healthy environment for new business. Thus, this is a confirmation that we remain a top priority for our customers and our value proposition continues to stand out even in this market. Shifting to our product mix, let's start with Atlas.\n\nAtlas grew 61% in the quarter compared to the previous year and now represents 63% of total revenue, compared to 58% in the third quarter of fiscal 2022 and 64% last quarter. As a reminder, we recognize Atlas revenue based on customer consumption of our platform, and that consumption is closely related to end-user activity of the application, which can be impacted by macroeconomic factors. Let me provide some context on Atlas consumption in the quarter. Overall consumption trends improved compared to what we saw in Q2, though they are not back to historical levels.\n\nSpecifically, there are a couple of trends worth noting. First, we saw a bounce back in areas that were below our expectations in Q2, namely the midmarket channel globally and our enterprise business in Europe. Second, we saw stronger sequential growth in underlying application usage in Q3 versus Q2, a trend observed across most industries and geographies. We observed a similar pattern last year, and we believe that this may be an emerging seasonal effect.\n\nTurning to Enterprise Advanced, EA significantly exceeded our expectations in the quarter, and we have continued having success selling incremental workloads into our existing EA customer base. As a reminder, under ASC 606, the term license component of the entirety of value is recognized as revenue upfront. This leads to increased variability and reduced comparability of our EA results and it's particularly impacted by multiyear EA deals. This quarter, we benefited from more multiyear EA deals than anticipated.\n\nTurning to customer growth, during the third quarter, we grew our customer base by over 2,100 customers sequentially, bringing our total customer count to over 39,100, which is up from over 31,000 in the year-ago period. Of our total customer count, over 5,900 are direct sales customers, which compares to over 3,900 in the year-ago period. Q3 was another very strong quarter of direct customer net additions. As a reminder, our direct customer account growth is driven by customers who are net -- new to our platform, as well as self-serve customers with whom we've now established a direct sales relationship.\n\nThe growth in our total customer count is being driven primarily by Atlas, which had over 37,600 customers at the end of the quarter, compared to over 29,500 in the year-ago period. It's important to keep in mind that the growth rate in our Atlas customer count reflects new customers to MongoDB in addition to existing EA customers adding incremental Atlas workloads. We had another quarter with our net ARR expansion rate above 120%. We ended the quarter with 1,545 customers with at least $100,000 in ARR and annualized MRR, which is up from 1,201 in the year-ago period.\n\nMoving down the income statement, I'll be discussing our results on a non-GAAP basis unless otherwise noted. Gross profit in the third quarter was $247.8 million, representing a gross margin of 74%, which is up from 73% in the year-ago period. Our year-over-year margin improvement is primarily driven by improved efficiencies that we were realizing in Atlas. Our income from operations was $19.8 million, or a 6% operating margin for the third quarter, compared to a 3% margin in the year-ago period.\n\nThe primary reason for our strong operating profit results versus guidance is our revenue outperformance. In addition, our operating profit benefited from the steps we've taken to moderate the growth rate of expenses as we prudently manage our investments in the current environment. Net income in the third quarter was $18.7 million or $0.23 per share based on 80.4 million diluted weighted average shares outstanding. This compares to a net income of $2.6 million or $0.03 per share on 78.5 million diluted weighted average shares outstanding in the year-ago period.\n\nTurning to the balance sheet and cash flow. We ended the third quarter with $1.8 billion in cash, cash equivalents, short-term investments, and restricted cash. Operating cash flow in the third quarter was negative $5.7 million. After taking into consideration approximately $2.7 million in capital expenditures and principal repayments of finance lease liabilities, free cash flow was negative $8.4 million in the quarter.\n\nThis compares to free cash flow of negative $9.2 million in the third quarter of fiscal 2022. I'd now like to turn to our outlook for the fourth quarter and full year fiscal 2023. For the fourth quarter, we expect revenue to be in the range of $334 million to $337 million. We expect non-GAAP income from operations to be in the range of $6 million to $8 million and non-GAAP net income per share to be in the range of $0.06 to $0.08 based on 83.3 estimated diluted weighted average shares outstanding.\n\nFor the full year fiscal 2023, we expect revenue to be in the range of $1.257 billion to $1.26 billion. For the full fiscal year 2023, we expect non-GAAP income from operations to be in the range of $30.8 million to $32.8 million and non-GAAP net income per share to be in the range of $0.29 to $0.31 based on 80.2 million estimated diluted weighted average shares outstanding. I'll now provide some more context around our guidance. First, in Q4, we expect slower sequential Atlas consumption growth than we experienced in Q3 but better than what we saw in Q2.\n\nWe are encouraged by the improvement in consumption trends we saw during Q3. But as noted earlier, we believe some of that was driven by seasonality from which we will not benefit in Q4. Second, given the significant outperformance of EA in Q3, we do not expect a sequential uptick in EA revenue between Q3 and Q4. Finally, on a full year basis, we expect a non-GAAP operating margin of 2.5% at the midpoint of our guidance, about a 1-percentage-point improvement compared to last year.\n\nWe have consistently demonstrated operating leverage each year since going public, improving margins by over 35 percentage points over that time period. We will look to continue improving our margin profile over time, and we are pleased with our rate of progress this year. To summarize, MongoDB delivered strong third quarter results. Our new business performance and strong direct net customer additions indicate the robust underlying demand for our developer data platform.\n\nWe are pleased to see an improvement in Atlas consumption trends in Q3. We'll continue monitoring the environment and investing responsibly in pursuit of our long-term opportunity. With that, we'd like to open up to questions. Operator.\n\nOperator\n\nThank you. [Operator instructions] It's from the line of Kash Rangan with Goldman Sachs. Please proceed.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nHi. What a spectacular comeback. Very nice to see this. So, Dev and Michael, just wondering what you've seen in the month of November with just like the consumption trends and what do you make of the new Atlas wins in the quarter? I would assume that given that there was a lot of belt-tightening in the quarter from a macro standpoint, rates went up, these new customers are probably even more discerning customers.\n\nThese clients with MongoDB are probably even more certain than the customers that might have been part of other cohorts. And as you look into calendar '23, what is your outlook for how you think about consumption patterns as your Atlas customer base becomes bigger and easier to predict? Not easy, but easier to predict. Thank you so much once again.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nDo you want to start with the Atlas wins?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. One is the -- Kash, first, thanks for the question. I'm going to first start with the Atlas wins, and I'll have Michael talk about consumption trends in November. First, you know, the key thing that I think people, you know, understand is that software is central to every company's value proposition.\n\nAnd in recent discussions with customers at our own customer advisory board; in the field; and more recently, last week at re:Invent, our customers are very focused on modernizing to drive more differentiation, operational efficiency, and agility. And so, the platform message that we are out there with really resonates because, one, it enables high developer productivity so people can do more with less. The platform enables customers to consolidate on one solution versus, you know, connecting and stitching together a point of disjointed tools, so it reduces costs and complexity of the data architecture. And all this provides a very compelling ROI, which really drives that -- those new customer additions.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nAnd just on the consumption questions, a few thoughts, Kash. First of all, Q4 generally does not see anything that we would describe as a seasonal benefit. When we look at the November patterns, they were consistent with Q3. That effectively implies that the latter part of the quarter will be slower growth because, in general, we haven't historically seen anything that looks like seasonal growth in Q4.\n\nSo, that'll give you a sense for the balance of this year. And as it relates to fiscal '24, we're obviously not providing guidance right now. We'll update that in the March call. It's obviously good to see the continued success in new business, as well as the recovery in those growth rates.\n\nBut it's certainly a very fluid, you know, macroenvironment, and we're monitoring the situation closely.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you so much.\n\nOperator\n\nThank you. One moment for our next question, please. It's from the line of Brad Reback with Stifel. Please proceed.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. So, last quarter, you guys talked about the digital native customers being a big problem from a consumption basis. Have those businesses now sort of stabilized at a consistent level?\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah. So, a couple of things. Thanks for the question, Brad. I wouldn't have described it as a problem, but we did kind of slice and dice the consumption behavior to see what we're -- you know, exposed to folks what we were seeing, including what areas where we were seeing slower growth, of which, you know, that part of the midmarket, you know, demonstrated that behavior.\n\nAs I mentioned in the prepared remarks, we saw a rebound in consumption across the board, but including the midmarket everywhere across geographies and across industries and also in Europe. So, not all the way back to historical levels but, you know, improved versus Q2.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nThat's great. And then on the opex side, I know you guys aren't guiding for next year but, Dev and Michael, you both talked about the leverage you guys have generated since IPO, and the results of this quarter were astounding. Is there any reason to believe that opex won't meaningfully grow slower than revenue next year?\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah. So, as I said, we're not going to guide as it relates to fiscal '24. You can see that the implied guide for fiscal '23 is 100 basis points of improvement in terms of the year-over-year margin on the op income side. We're very pleased with that, and we'll obviously, as we work through our plans, you know, over the next year, you know, monitor the environment and everything else.\n\nI would just add that we have always had a fairly granular view of things in terms of our returns framework and the returns -- you know, evaluating and assessing the returns that we're getting, you know, out of different investments. We continue to apply that framework, although obviously, the market environment has changed, which sort of implicitly means that the returns threshold has gone up, and we've applied that scrutiny, you know, and we'll likely do that as we get through the fiscal '24 guide.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nFantastic. Thanks very much.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThanks, Brad.\n\nOperator\n\nThank you. One moment for our next question. And it comes from the line of Brent Bracelin with Piper Sandler. Please go ahead.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGood afternoon. Dev, the big surprise for us here is the momentum you're seeing in that EA business. We're seeing some of the peers obviously see moderation just as the overall tech market starts to do more belt-tightening. What drove the strength in EA this quarter specifically and if you could provide any color by industry? That's really the question here.\n\nWhat type of industry is driving the momentum and driving the upside here in EA specifically? Thanks.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah. Thanks, Brent. I think what we saw in EA is just evidence that customers are really viewing MongoDB to be an important part, if not a standard, in their tech stack. And once you are viewed as a critical element of the tech stack, people are more comfortable, you know, investing more aggressively, especially in this environment where people do need to modernize their legacy platforms to drive more efficiency and lower cost, as well as drive more agility.\n\nSo, I think that's I think why we're seeing the upside on EA. And so, we feel good about that. And obviously, this shows you that customers also like optionality by building apps on MongoDB that can truly run their apps anywhere, not only on-premise but on any hyperscalers, and obviously switch between on-premise or any hyperscaler. So, that is also a very compelling benefit to customers in this environment.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nHelpful color. Then a quick follow-up for Michael here. Short-term deferred growth did slow. Didn't know if there was an impact on payment timing or if you saw a similar slowdown in RPO.\n\nSo, can you just kind of walk through short-term deferred and why it slowed, and if we should expect a similar slowdown in RPO?\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah. So, what I would just point you to, Brent, is that we've talked about that deferred in general and sort of calculated billings more broadly. It's not a particularly relevant metric for us as we've talked about for, you know, a few years now as we continue to make it as easy as possible for customers to adopt usage of our platform, which then allows them to subsequently expand. We have de-emphasized upfront, you know, commitments and tried to streamline that sort of upfront part of the negotiation.\n\nAnd so, that has a, you know, natural consequence from a balance sheet perspective sort of flowing through there. And that's where you see it. And that's why we tend to talk about that as being less relevant for our business.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGot it. Helpful color. Thank you.\n\nOperator\n\nThank you. One moment for our next question. And it's coming from Raimo Lenschow with Barclays. Please proceed.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nCongrats from me as well, and two quick questions. Michael, on staying on that EA one, was there anything like in terms of Q4 deals that kind of got pulled into Q3, etc. that made like the Q3 performance, you know, like that there were one of -- I consider was it just like general performance being better? And then one for Dev. In this sort of environment, there tends to be -- well, there is a tendency to go back to the established platforms.\n\nWhat do you see in terms of new customer projects starting and going to Mongo, but also in terms of clean up of like legacy, Oracle legacy, IBM, and stuff like that and people consolidating on those platforms, some of those movements? Are those initiatives happening as we speak? Thank you.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nHey, Raimo, thanks for the question. On the pull-forward, no, we did not see any particular pull-forward activity. The only thing I'd call out, which I mentioned in the script on the EA, is we saw a little more multiyear in EA, which under 606 drives a little more revenue. But nope, no pull forward.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah. And in regards to the question about -- I lost my train of thought. Yeah, platform. So, we are definitely seeing customers continue to choose us and standardize us in terms of using Atlas.\n\nAnd the breadth of the platform is really attracting customers to use MongoDB in a wide variety of ways. And so, we feel really good about the win rates. We feel really good about our engagement with customers. And obviously, you saw that in the new customer wins.\n\nThe new customer wins were quite strong.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Thank you. Congrats.\n\nOperator\n\nThank you. One moment for our next question. And it comes from Sanjit Singh with Morgan Stanley. Your question, please.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThank you for taking the question and very impressive set of Q3 results. Dev, if can I go back to the pandemic, some of the initiatives that you guys put in place that really served you well. Coming out of the pandemic, you saw the new customer adds really accelerate in 2020 as you sort of focus on -- sort of this onboarding customers at lower overall spend levels. In terms of the playbooks that could unfold in 2023, what sort of your playbook are you going to be focusing the team more on sort of the at modernization use case? Is it going to be about further accelerating the customer adds? How are you sort of thinking about the sales playbook as we go into calendar 2023?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nRight. Thanks, Sanjit. I just want to make the point that it was actually pre-pandemic that we decided to make it much more easier for customers to engage with us by both changing, you know, sales compensation incentives, as well as making it easier for customers to commercially engage with us. And obviously, that paid -- to your point, paid huge dividends for us during the pandemic.\n\nWhat I will tell you is that it's really more of the same. We're really hyper-focused on acquiring new customers and adding more workloads from existing customers, and that's across the board, across every channel, every industry, and every customer segment. So, that is something that we care a lot about, and we're seeing that now expand in terms of getting customers now to adopt some of the new capabilities we rolled out to the marketplace. So, as I talked about in my prepared remarks, we're seeing a lot of customers embrace the full suite of the platform.\n\nSo, that drives incremental workloads that we would not have gotten in the past. And so, we feel really good about that. And that's our real focus. It's all about acquiring new workloads and getting more and more people to build apps on MongoDB.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMakes a lot of sense. Just one quick follow-up for Michael. You referred to the sort of ROI framework and what -- you know, sort of alluding to like a higher bar given the current environment. Could you give us a sense of like what the team is prioritizing more and what may be following kind of below the line or being deprioritized as you think about driving both sustaining growth, but also, you know, expecting more efficiencies in the business?\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah. I'll do my best to try and kind of walk you through it. I mean, I think you kind of have to run sort of type of investment versus type of investment. And obviously, ultimately, we look across the entirety of the portfolio, whether it's go to market or R&D or things like that.\n\nBut it's probably easiest to think about it within the different buckets and flavors, you know, as it relates, you know, today as sort of those teams effectively, you know, compete for capital. And so, within the go to market, we obviously are looking at the returns that we're generating. We are continuing to invest. We are continuing to, you know, hire and grow within the teams, but we're backing the areas that are having the most success in delivering us, you know, the highest returns.\n\nGo to market is a little bit easier to measure quantitatively and on a shorter-term basis. On the R&D side, things take a little bit longer, you know, to play out. And, you know, you've got a little bit of a lag between when you make the investment and when you see the payback. But, you know, we certainly have conversations that are fairly detailed and granular level, even within the R&D side, about where do we think we're seeing the most success and the most traction and in which area do we want to incrementally lean into versus which areas do you maybe, you know, want to de-prioritize relative to the areas generating the highest returns.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah, If I can just add, it's like, you know, for example, like in the marketing side of this digital programs, we were -- you know, we do a lot of experimentation of what's working. So, you know, we have a certain, you know, return thresholds. And so, if we don't see those programs working, we'll shut them down. Similarly, the sales organization of the certain teams that are outperforming, we'll invest more than other teams that are not and we'll potentially slow it down.\n\nSo, we're just really doing more of the same and just being very rigorous about that.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThat's helpful detail. Thank you for that. Appreciate it.\n\nOperator\n\nThank you. One moment for our next question. And it comes from the line of Phil Winslow with Credit Suisse. Please proceed.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHey. Thanks, guys, for taking my question. Congrats on a great quarter. Question for you, Michael, and a follow-up for Dev.\n\nWhen you think about just new workloads, new applications go-lives, and the trends that you're seeing there, why don't you contrast that with what you've maybe seen in previous quarters or maybe even last year? Obviously, you're talking about just the overall consumption. But curious about the new apps, the go-lives, and the ramp of those. And then in terms of what you can control in go to market, Dev, how do you feel about sales productivity relative to those sort of those new apps, those go-lives, new customers, etc.? Thanks.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah. I mean, I think what we're really seeing in terms of these new workloads and sales productivity is that our customer base is very diversified, both in terms of the types of customers, as well as the types of use cases. That's a benefit of having a general-purpose platform. So, clearly, you know, we have start-ups who are building, but potentially, you know, new industries are disrupting existing ones.\n\nAnd then we have large companies, you know, moving quickly to transform different parts of their business. So, it really vary -- varies. So, you know, clearly, with the platform play now, we're seeing a lot more interest in search and search workloads and consolidating search workloads on top of MongoDB. We're seeing a lot of interest in time series, being able to, again, have one unified developer experience.\n\nTime series leads to things that what I talked about as application-driven analytics, where people want to be able to get meaningful insights of their business, automates human decision-making into applications. So, those use cases are getting more and more popular with customers. But then we have still a lot of the classic bread-and-butter use cases that customers are using us for. And in terms of sales productivity, what I would say is it's really a function of, you know, the quality of their pipeline and how quickly they can add new workloads to our platform and how quickly we can acquire new customers.\n\nSo, we're really focused, and the sales team is very, very focused on both things, acquiring new customers and acquiring new workloads. It's less about, you know, is it -- does one workload provides a better ROI than another. It's really a function of the customer's requirements and what they're most interested and focused on.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nAnd, Phil, just to the cohort part of your question, it really -- it's probably easiest to think about in the context of when you bring a new customer on and you think about the changes that we made a few years ago and how that drove incremental velocity. We continue to see, you know, good and consistent behavior with those cohorts. I would just remind you and call out that those changes and where sort of the bulk of the customer has come from is more in the midmarket, right? And so, those tend to be spending less than the average direct sales customer. And so, just important to keep that in mind as people are building their models and thinking about the long-term impacts of that.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nAwesome. Thanks for the details and congrats again. Really awesome.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nThank you.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThanks, Phil. \n\nOperator\n\nThank you. One moment for our next question. And it comes from the line of Jason Ader with William Blair. Please proceed.\n\nJason Ader -- William Blair -- Analyst\n\nYeah. Thank you. Hey, guys. So, how do you interpret the bounce back, especially midmarket European enterprise, when seemingly, you know, macro is getting worse? Then I have a follow-up.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah. So, the first thing I'd start off with, Jason, is it really relates to the underlying usage of the application, right? If you think about sort of what drives consumption within Atlas, I think that's the critical thing. And so, when you think about the usage, we're seeing stronger underlying usage. You know, we were always in a growth environment, but we saw in Q2 was slower growth in the midmarket and in Europe.\n\nThose rebounded again, not all the way back to historic levels, but improved levels relative to Q2. Part of our thought process, which we shared, you know, in the prepared remarks, is that we believe it's a bit of an emerging seasonal trend, you know, which particularly, you know, relates to sort of people coming back from, you know, summer vacations and things like that because you'll recall, in our September call, we talked about August being, you know, in line with what we'd seen in Q2. And so, that sort of suggests the improvement that we saw in September and October. We saw that same dynamic in the year-ago period.\n\nAnd while we only have a couple of years, you know, that aren't COVID-affected, where we've got Atlas at scale, that's kind of our best current working theory. But we can see it in terms of the underlying usage of the applications. The other thing I'd say more broadly, you know, from a macro standpoint that I think is impressive is on the new business side. We continue to win there.\n\nWe continue to have our value prop, you know, resonate. We haven't seen sort of this increase in deal cycles and other things like that that others have seen. We obviously are monitoring the situation closely, but we've been really pleased from that standpoint.\n\nJason Ader -- William Blair -- Analyst\n\nRight. And one quick follow-up for you, Dev, just on cloud marketplaces. Is that something that you guys are going to be able to talk about in terms of, I don't know, any metrics, growth rates, percentage of business going through cloud marketplaces because it does seem like, broadly speaking, more third-party software is going through these marketplaces and it seems like that's a really good thing at a lot of levels?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah. I'm not sure that we're going to be sharing like quarterly stats on how things are going, but we'll definitely provide color. I think what -- the fact that across all three hyperscalers, customers can go to their consoles and be able to sign up for Atlas is a meaningful thing. It gives us an access to a whole new customer base that we may not have direct relationship with and also speaks to the popularity of customers wanting to use MongoDB in the cloud.\n\nAnd so, I think those two things, you know, have really driven that. There's not many companies who can say that they are on the consoles of all three hyperscalers.\n\nJason Ader -- William Blair -- Analyst\n\nThank you, guys.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThanks, Jason.\n\nOperator\n\nThank you. One moment for our next question. That comes from the line of Tyler Radke with Citi. Please proceed.\n\nTyler Radke -- Citi -- Analyst\n\nThanks for taking the question. I wanted to ask you first about the EA performance. Obviously, a really strong number on pretty tough comps. As we think about Q4, it looks like you're guiding Q4 to be flat sequentially from Q3, which, in the last two years, you've kind of got it up, you know, 7% last year and 4%.\n\nIs there something you're seeing in terms of timing on the EA business that would drive a sub-seasonal guide for Q4 or maybe you're just layering in more macro conservatism given the environment out there? But if you could just kind of unpack your view on the EA business and overall outlook in the Q4. Thanks.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nSure. Thanks, Tyler. We obviously don't guide by product, but maybe a couple of things I can say about Q4. First of all, as I mentioned, it was obviously an incredibly strong EA quarter with EA growing 26% year over year.\n\nAnd so, you know, as we look at it at Q4, you know, that -- it doesn't make a ton of sense to, as we look at the business, to think that we're going to meaningfully improve sequentially, you know, from an EA perspective given how incredibly strong, you know, Q3 was. And then we talked a little bit on the Atlas side around Q4 doesn't benefit from the seasonal tailwinds that Q3 does. And so, I think on a sequential basis, those are the key factors to keep in mind.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. And it sounded like you talked about some -- certainly some improvements in consumption on Atlas. But if I look at the sequential dollar growth in Atlas in Q3 versus Q2, it was down a bit. Could you just kind of square, you know, with improving, you know, expansion rates, why would the sequential dollar adds be down? Is it kind of a function of new business or just help us understand the moving pieces there?\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah, I think it's mostly a reflection of the starting ARR. So, you're basically starting with, you know, the compounding slower growth. And so, when you think about the entry point, whether it's, you know, Q3 in terms of for the second half of the year or Q4 for the final quarter of the year, you've seen, you know, several months of slower growth. And so, that means that the beginning ARR is, you know, lower on an absolute basis.\n\nAnd even if the growth rates were to revert, the number would be lower just by virtue of the fact that the starting ARR is lower.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. [Operator instructions] And it comes from the line of Fred Havemeyer with Macquarie. Please proceed.\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nHey, thank you very much. I was interested also in cloud marketplaces and just kind of a follow-up around that. With the announcement of cloud marketplaces, even today, you're showing more integration with new -- for example, today, like Microsoft's entire data platform. What is it that is drawing these -- or what are you doing correctly here that's drawing these hyperscalers that have their own competitive database offerings to not just sell your products but potentially partner with MongoDB and provide it through the platform? And I have a follow-up as well.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah. Fred, I think what that really speaks to is just the power of the MongoDB platform and the product market fit that's evidenced by how popular we are. I mean, we are truly the most popular modern data platform in the world. And so -- and a lot of -- majority of those users tend to run MongoDB in the cloud.\n\nSo, each of the hyperscalers see a lot of MongoDB usage on each of the clouds. Yes, you're right. In the early days, they tried more to compete than to partner. And frankly, a lot of people, you know, when we first went public, were skeptical about how we could actually build a cloud business when trying to compete with the hyperscalers.\n\nObviously, we've proven the ability to do that. And I think that's also evidence of the fact that customers are also more discerning and they're not just going to, you know, take the a la carte in many choice. They're going to be very judicious in their evaluation process. And given our -- the value we provide, I think you're seeing the hyperscalers recognize that.\n\nAnd by the way, the hyperscalers also benefit from our growth. They benefit both from the underlying consumption of storage and compute of Atlas, as well as those customers that they win who are running Atlas workloads in their clouds, then by other ancillary services themselves. So, it ends up truly being a win-win relationship. And I think that's why you're seeing the hyperscalers essentially engage with us more deeply.\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nThank you. And then the follow-up is -- it's multicloud again related. But I wanted to ask about multicloud clusters because I think it's one of the more unique offerings that you have in Atlas out of the box. Just generally, could you help us -- or just describe where you're seeing customer adoption trends with your multicloud cluster capability and replica set capabilities?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah. I mean, the trend is -- I mean, the -- what we're seeing is there's a lot of customer interest in this capability. One, depending on the customer's needs, they could be -- they may have a preferred hyperscaler, but they're expanding into a geographic region where that hyperscaler may only have one region or no regions and they want some diversity across hyperscalers in case that region goes down. And so, they want the benefit of being able to quickly switch over to another hyperscaler.\n\nThe other thing that we see is a lot of these -- obviously, as these hyperscalers compete with each other and offer a differentiated set of services, customers want to be able to leverage some services offered of one hyperscaler versus another, even though maybe their preferred hyperscaler does not offer such a service. And then third, there's always the benefit of avoiding lock-in and being able to diversify their workloads across different hyperscalers. And again, just to be clear, the multicloud cluster essentially enables customers to run one app or one workload across multiple clouds. So, that is profoundly different than what most people can offer today.\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nOK. Thank you for that and congratulations on a strong quarter.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThanks, Fred.\n\nOperator\n\nThank you. One moment for our next question. It's from Mike Cikos with Needham and Company. Please go ahead.\n\nMike Cikos -- Needham and Company -- Analyst\n\nHey, thanks for taking the question, guys. I had a two-parter to start, and I just wanted to come back to the Atlas consumption trends improving quarter over quarter in Q3. It sounds like things really began to improve in September. We just wanted to see, was it stable from there on out, or did you see continuing strength even from September when we think about how October and November played out? And then on a relative basis, are there certain pockets of the market which have maybe a larger delta versus those historical consumption trends you're talking to? And then I do have a follow-up.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah. So, generally, I would say it was broad-based, as we described. You know, the rebound, you know, was most perceptible in the sense of, you know, the midmarket globally and Europe, but only because those are the areas where we had seen, you know, slower growth that we called out, you know, in Q2. And we talked about, like I said, August being in line with Q2.\n\nAnd so, September and October were stronger. And then just to continue, you know, I don't want to get into like a day-by-day, you know, reading here, but we did see that behavior. And so, you know, that shows up in the results. And that's also consistent with what we saw sort of in the year-ago period, hence the commentary about this emerging seasonal trend.\n\nMike Cikos -- Needham and Company -- Analyst\n\nThank you for that. And I -- the follow-up I had, I just kind of wanted to paint out a scenario for you guys and just down -- to soundboard an idea, if you will. I'm looking at where we have the 4Q guide today, call it, this year-to-year growth rate you guys are targeting for about 26% at the midpoint. And the reason I'm bringing this up, if I think about how this year has played out, you guys are going to have a tough comp in the first half of next year with 50%-plus growth that you guys delivered in the first half this year, as well as strength from EA.\n\nAnd so, the reason I'm bringing this up is if I look at next year, the consensus is currently at, call it, mid to high 20% growth rate versus the exit velocity of this year, where we're looking at 26%. And at least from a qualitative perspective, can you provide us any directional comments as far as whether or not that appears to be the right ballpark? Is that aggressive? How should we be thinking about next year's growth?\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah, I think the key thing is, you know, we'll obviously update that in the March call. We've tried to give you the best way to land the land as we can for the current fiscal year and what we see for Q4. It certainly is, you know, a fluid and uncertain macroenvironment. We're monitoring that closely, and we'll obviously update everyone, you know, in the March call around our outlook.\n\nMike Cikos -- Needham and Company -- Analyst\n\nGreat. Thank you very much, guys.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThank you, Mike.\n\nOperator\n\nThank you. One moment for our next question. And it comes from Steve Koenig with SMBC Nikko. Please go ahead.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nHi, gentlemen. Thanks for taking my question. I'll just ask one here. Congrats on the quarter and the rebound here.\n\nI'm wondering when it comes to new customers and or new workloads, you know, given kind of the macroenvironment and the pressures on business, you know, both SMB and enterprise, what are you guys seeing in terms of customer behavior with respect to how they size the deals or the versions they choose? You know, how does kind of that economic sensitivity manifesting itself in terms of those new deals, you know, kind of pricing-wise or, you know, kind of a scale of the deal? Thanks very much.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. So, Steve, thanks for your question. We haven't seen any discernible change in deal dynamics in Q3. And clearly, our EA results, you know, in our opinion, have demonstrated the power of our platform and the ability for customers and the interest of customers running workloads anywhere.\n\nWhat I will say is, you know, we've been through -- I personally have been through, you know, in a public company context, you know, 2008 and also lived through 2000 as well. And, you know, in these kinds of situations, we definitely recognize that there's more scrutiny by customers on deals and probably approval levels go up the food chain. And so, what we are obviously working closely with our sales teams on is to making sure that they rigorously qualify their forecasts and to make sure that they really understand the decision process that customers have to go through to get deals done. But that is something that, you know, we have, you know, lived through in previous cycles and that was something that we're going to be very focused on.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nGot it. Great. Thanks a lot, Dev. Congrats again.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThanks, Steve.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nThanks, Steve.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Turits with KeyBanc. Please proceed.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, guys, congrats on the quarter. I want to come back to seasonality. So, you know, there's all different seasonality in different parts of your underlying business. From a -- to the extent your customers are B2B customers, I guess I get why, you know, coming back from vacation, it makes sense to get projects going again.\n\nBut I would also think that in B2C, as we go into the holiday season, that you would get a boost out of that also. So, why wouldn't we see sort of continuing, you know, a very typical fourth quarter of positive seasonality at this point given how much of your business is focused on consumption?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah. Thanks, Michael. Just to clarify, I wouldn't say it's coming back and starting new projects. What we're talking about here again is the underlying usage of the database.\n\nAnd so, whether it's internal applications or B2B applications or consumer-facing applications or whatever, what we see is an increase in the underlying database activity. So, this is a different dynamic than people kicking off new projects, right? It's reflecting the underlying activity in the workload or in the application. And given that we've seen this now for two years in a row, you know, we're highlighting it, you know, given the behaviors, you know, that we're seeing and want to call that out for folks as what appears to be an emerging seasonal trend.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nAnd, Mike, can you quantify the impact of -- on rev rec-upfront rev rec of the shift to a larger percentage of -- or a large percentage of multiyear EA deals because, obviously, that pulls things forward a bit in terms of rev rec? So, how much just from that shift could we have seen in terms of benefits in the quarter?\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nYeah, we're not going to quantify an exact number. You know, part of this is also based off of, you know, we assume some level of multiyear deals, you know, in our forecasts, you know, in our guidance, obviously. We saw a little bit more than that. It was material enough to bother to call out just so people don't, you know, extrapolate inaccurately.\n\nAnd so, that's why we wanted to make sure people understood the dynamic.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK. Thanks, Mike. Thanks, Dev.\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nThanks, Michael.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThank you, Michael.\n\nOperator\n\nThank you. One moment for our next question, please. It comes from the line of Will Power with R. W.\n\nBaird. Please go ahead.\n\nWill Power -- Baird -- Analyst\n\nGreat. Thanks for taking the question. Maybe just bigger picture, I know you touched on this a bit, but as customers increasingly focus on TCO, you know, in this environment, I'm just kind of curious how much more aggressive customers are getting at moving legacy databases and workloads over to Mongo versus maybe what you've seen, you know, six, nine months ago. Any real change in pace of that type of activity?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. So, Will, thanks for your question. We recently had a customer advisory board where we had some our more -- some of our larger customers with us for a number of days in Europe. And I would tell you the feedback there was that there's even more interest in moving off legacy platforms to more modern platforms in this environment because the cost structure and the brittleness of those architectures really are inhibitor for those companies to be able to move quickly and to seize new opportunities or to respond to new threats.\n\nAnd so, in this environment, there's actually even more interest. We're actually seeing that also in, say, an industry like financial services, where they're starting to move to the cloud at scale. And that's a catalyst for them to be more aggressive in modernizing their tech portfolio. And that's -- you know, that's more of a recent phenomenon.\n\nAnd we're obviously pleased about the engagements we're having with that vertical as well.\n\nWill Power -- Baird -- Analyst\n\nThat's great. Thank you.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThanks, Will.\n\nOperator\n\nThank you. And I'm not showing any further questions in the queue. I would like to turn the call back to Dev Ittycheria for his final comments.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThank you. So, we're really happy with our new business performance and see it as evidence that our value proposition resonates with developers, IT decision-makers, and our partners. We're obviously pleased to see the rebound in Atlas consumption during the quarter and expect the continued macro impacts. And so, we're closely monitoring consumption trends, and we will deliver another year of operating margin expansion despite the macro headwinds.\n\nAnd we are committed to profitable growth. With that, thank you for your time today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Denyeau -- Investor Relations\n\nDev Ittycheria -- President and Chief Executive Officer\n\nMichael Gordon -- Chief Operating and Financial Officer\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nJason Ader -- William Blair -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nMike Cikos -- Needham and Company -- Analyst\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nWill Power -- Baird -- Analyst\n\nMore MDB analysis\n\nAll earnings call transcripts"
}