{
  "companyName": "Viomi Technology Co Ltd",
  "companyTicker": "VIOT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/22/viomi-technology-co-ltd-viot-q2-2022-earnings-call/",
  "content": "Viomi Technology Co Ltd (VIOT -1.83%)\nQ2 2022 Earnings Call\nAug 22, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for Viomi Technology Co., Ltd.'s earnings conference call for the second quarter of 2022. [Operator instructions] I would now like to turn the call over to your host, Claire [Inaudible] from the company's IR department. Please go ahead, Claire.\n\nUnknown speaker\n\nThank you, Anita. Hello, everyone, and welcome to Viomi Technology Co., Ltd.'s earnings conference call for the second quarter of 2022. As a reminder, this conference is being recorded. The company's financial and operating results were issued in a press release earlier today and are posted online.\n\nYou can download the earnings press release on signup for the company's email distribution release by visiting the IR section of the company's website, ir.viomi.com. Participating in today's call are Mr. Chen Xiaoping, the founder, chairman of the board of directors, and the chief executive officer; and Mr. Thai Wickham, the head of our finance department.\n\nThe company's management will begin with prepared remarks and the call will conclude with the Q&A session. Before we continue, please note that today's discussion will come to forward-looking statements made under the Safe Harbor provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's actual results may be materially different from the views expressed today.\n\nFurther information regarding this and other risks and uncertainties is included in the company's annual report on Form 20-F and other filings filed with the United States Securities and Exchange Commission. The company does not assume any obligation to update any forward-looking statements except as required by law. Please also note that Viomi's earnings press release and this conference call include discussions of unaudited GAAP financial information, as well as unaudited non-GAAP financial measures. In addition, Viomi's press release contains a reconciliation of unaudited non-GAAP measures to the unaudited most directly comparable GAAP measure.\n\nI will now turn the call over to Viomi's finder, the CEO, Mr. Chen Xiaoping. Mr. Chen will deliver his remarks in Chinese followed immediately by the English translation.\n\nMr. Chen, please go ahead.\n\nXiaoping Chen -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThank you, Mr. Chen. I will quickly translate our founder's remarks before discussing our financial performance for the second quarter of 2022. Hello, everyone.\n\nThanks for joining our second quarter 2022 earnings conference call. In the second quarter, our total net revenues reached RMB 924 million, in line with our previous guidance. The year-over-year decline in revenue was mainly due to two factors. First, this year, we've cut off the selling of some branded sweeper robots, which had a high prior-year basis for the comparison.\n\nSecond, since the beginning of the year, owing to widespread COVID-19 recurrences, market consumption continued to decrease in the second quarter, along with the soft demand industrywide. To support the release of premium new products and our high-end brand transformation, we continued to enhance our brand promotion and the increased advertising spending during the second quarter. In addition to the launch of a large number of elevator and print ads, we reached more targeted young groups by parenting with Tmall and becoming a co-sponsor of the well-known variety show, \"Design Ideal Future,\" broadcasted on Mango TV platform. Our investment in branding and product promotions during a relatively late period in the macro environment resulted in the temporary operating loss in the second quarter.\n\nBut we believe these measures will help us to build a long-term brand awareness. Furthermore, judging from our performance during the 618 shopping festival and the sales of our high-end products in recent months, our marketing investment over the past few quarters has boosted the contribution of high-end products to our sales and enhanced our trending technology branding positioning. In the second quarter, we continue to execute our high-quality business operations strategy: first, continue to streamline SKUs and optimize our product mix; second, focus on core business and product lines to build best-selling products; and third, implement cost control and efficiency improvement measures in production and the supply chain. This effort lead to ongoing optimization of our business operations with gross margin increasing by about 1% year over year, representing consecutive year-over-year improvement since the fourth quarter of 2020.\n\nDespite COVID-19 recurrences and the way consumer spending experts, excluding considerable pressure on our sales, we've made significant progress in both product innovation, channel expansion, and strategic cooperation. In addition, we continue to develop our one-stop IoT home solutions, further solidifying the foundation for our long-term production enhancement and the branding influence. First, with respect to our products, we introduced a series of new AI products at our strategic new products launch event in March, including Space Pro, our all-space AI air conditioner featuring formaldehyde removal; Boss, our large-screen refrigerator with AI fitness functionality; our Royal series of AI laser interactive smart screens incorporating 4K ultra-high definition display; Super 2, our 2000G super large-flux water purifier which generates ultra-micro bubbles to remove pesticide residues; and our Royal series of AI twin-tub washing machines. Among them, the air conditioner, water purifier, and interactive smart screen came to market in the second quarter.\n\nWe also introduced a series of new smart home devices, such as EyeLink, our smart lock with upgraded 3D facial recognition technology, as well as HomePad Plus, our AI screen-based control interface for managing all smart home appliances across scenarios. These new AI-equipped products provide our consumers with a superior smart home experience and have received favorable market feedback and reviews. Furthermore, sales growth and product influence among our mid- to high-end products are also increasing. During the recent domestic 618 shopping festival, some of our mid- to high-end products topped the e-commerce sales charts in their respective categories, such as our Space series of air conditioners, Super series of water purifiers and 21Face AI large-screen refrigerators.\n\nMeanwhile, based on our one-stop IoT home solutions, we are accelerating the implementation of our premium bundled home solution offerings across the nation. After our offline merchants signed whole-home solution orders ranging from RMB 200,000 to RMB 400,000 with customers in Beijing, Guangzhou, Changsha, and Kunming and some offline merchants in Chengdu, Zunyi, Yinchuan, and some other cities followed suit in the second quarter, recording multiple high-end whole-home solution orders exceeding RMB 200,000 and RMB 300,000. Our consumers' recognition and adoption of our premium AI products and our bundled home solution offerings are a testament to the success of our phased transformation into a premium brand and our investment in research and development for our AI products. The successful launch of our new AI products, which received a positive market feedback and the adoption of bundles on solution offerings was not possible without our team efforts in technological innovation and further research and development.\n\nAs of June 30, 2022, our accumulated global patent applications and the registered patents reached more than 5,400 and 3,300, respectively. Our research and development achievements have also been recognized by the industry and professional institutions. In July, the intelligent [Inaudible] of our EyeBot AI range hoods' visual detection module won the 23rd China Pattern Excellence Award. Also, in April, we took the silver at 8th Guangdong Patent Award with one of our water purifiers with the integrated waterway module technology.\n\nThese awards are not only the recognition of our technological innovation capability but also the formation of our intellectual property strength. Second, we continued to execute our larger store, better merchant channel strategy. In the second quarter, we cooperated with our newly signed offline merchants and opened additional Viomi 4S and 5S flagship stores in provinces including Hunan, Anhui, and Guizhou, etc. These flagship stores enhanced our trending technology branding positioning through unified storefront decoration and immersive scenario experience, and helped implement our one-stop IoT home solutions.\n\nOn to our overseas business. In the second quarter, our softer international macro environment, including the increase in oil and bathrobe material prices, lead to sluggish demand in the European market and brought certain challenges for our overseas sales. At the same time, we made positive progress in channel optimization and our mid- to high-end transformation. We have established a stable cooperation with newly joined large international agent and expanded the market in Southeast Asia with the trend of high-end sweepers sold overseas.\n\nThe sales cooperation of the mid- and high-end models has further increased. As we progress through 2022, we will further enrich the product offerings of intelligent cleaning products and simultaneously roll out some other categories of products in overseas markets. Third, we continue to deepen our strategic cooperation with more channels in the second quarter to promote the integrated and the stable development of the smart home industry. In the first half of this year, we built partnerships with Jingdong.com, Tmall, and China Telecom.\n\nIn May, we expanded our strategic cooperation with KUKA, one of the leading domestic home design enterprises. KUKA and Viomi will jointly integrate smart home ecology and a whole house of customization business, while accelerating the popularization of our one-stop IoT home solutions to facilitate the integration, intelligence, and the quality upgrading of home scenarios. In addition, we are exploring strategic cooperation with additional channels and companies to create a more convenient and the smart living experience and promote the development of smart home ecology for family. We successfully navigated the challenges caused by the pandemic and the weak macro industry environment in the first half of the year and made progress in developing new products and enhancing brand awareness.\n\nMoving forward, we will continue to focus four aspects; first, streamlining SKU and continuously optimizing product portfolio; second, devoting more resources to improving product confidence building, best-selling products, and providing a more immersive scenario experience; third, creating more offline immersive consumption and facilitating and implementation of our one-stop IoT home solution to lay out the foundation for user experience improvement and the long-term brand value development for implementing more disciplined cost and expense control measures to lay a solid foundation for long-term healthy growth and create value for our customers and shareholders in the long run. Thank you. That concludes our founders remarks. Now, Mr.\n\nThai Wickham, head of our finance department, will go over our second quarter 2022 unaudited financial results and our third quarter outlook in more detail.\n\nWickham Thai -- Head of Finance\n\nThank you. Now, I'll go over the detail of unaudited financial results of the second quarter of 2022. Net revenues were RMB 924.2 million compared to RMB 1,658.9 million for the second quarter of 2021. Net revenue is in line with the company's previous guidance.\n\nIn addition to the overall weaker consumption environment, the decrease was mainly due to the complete cutoff sales of Xiaomi-branded sweeper robots this year, as well as its high prior-year base for comparison, and the ongoing product portfolio adjustments in some categories. Revenues from IoT at Home portfolio decreased by 54.2% to RMB 524.5 million from RMB 1,146.3 million for the second quarter of 2021. The decline was primarily due to a complete cutoff of sales of Xiaomi-branded sweeper robots, as well as SKU adjustments for some categories. Revenues from home water solutions decreased by 17.4% to RMB 180.9 million from RMB 218.9 million for the second quarter of 2021.\n\nThe decline was primarily due to the decreased demand of water purifiers. Revenues from consumables decreased slightly by 1.9% to RMB 100.3 million from RMB 102.2 million for the second quarter of 2021. Revenues from small appliances and others decreased by 38.1% to RMB 118.5 million from RMB 181.5 million for the second quarter of 2021, primarily due to product portfolio adjustments within this category and the decreased demand for small premises products. Gross profit was RMB 204.5 million compared to RMB 351.8 million for the second quarter of 2021.\n\nGross margin increased to 22.1% from 21.2% for the second quarter of 2021, primarily driven by the company's continual effort to shift business and product mix toward higher gross margin products and partially offset by the decreases in selling prices of some products from clean-up due to the total portfolio adjustment in this quarter. Total operating expenses decreased by 14.6% to RMB 254.6 million from RMB 309.7 million for the second quarter of 2021, primarily due to the year-over-year decrease in selling and marketing expenses. In more detail, research and development increased for the second quarter of 2021, mainly due to the increase in research and development efforts and related salaries and expenses, as well as the increased input in new product development. Selling and marketing expenses decreased by 24.6% to RMB 162 million from RMB 214.9 million for the second quarter of 2021, mainly due to decrease in marketing expenses, partially offset by the increased expenses on advertising activities to enhance the company's branding recognition.\n\nGeneral and administrative expenses decreased by 20.3% to RMB 22.9 million compared to RMB 28.8 million for the second quarter of 2021, primarily due to a decrease in estimate allowance for accounts and notes receivables recognized in the current period. Net loss attributable to ordinary shareholders of the company was RMB 39.6 million compared to net income attributable to ordinary shareholders of the company of RMB 46.1 million for the second quarter of 2021. Non-GAAP net loss attributable to ordinary shareholders of the company was RMB 33.9 million compared to non-GAAP net income attributable to the ordinary shareholders of the company of RMB 59.5 million for the second quarter of 2021. Additionally, our balance sheet maintained healthy.\n\nAs of June 30, 2022, the company had cash and cash equivalents of RMB 816.3 million; restricted cash, RMB 46.8 million; short-term deposits of RMB 10 million; and short-term investments of RMB 237 million. Now, let's turn to our outlook. For the third quarter of 2022, we currently expect net revenues to be between RMB 740 million and RMB 840 million. We estimate that the year-over-year change in revenues will be mainly due to the uncertainty pertaining to the potential effects of the COVID-19 recurrences, as well as the potential impact of overall market demand in the third quarter of 2022.\n\nThe above outlook is based on the current market conditions and reflects the company's current and preliminary estimates of market and operating conditions and customer demand, all of which are subject to change.\n\nUnknown speaker\n\nThis concludes our prepared remarks. We will now open the call for Q&A session. Our founder and Mr. Thai will join this session and answer questions.\n\nOperator, please go ahead.\n\nOperator\n\n[Operator instructions] The first question today comes from Hildy Ling with Morgan Stanley. Please go ahead.\n\nHildy Ling -- Morgan Stanley -- Analyst\n\nHi. Thank you, management for the presentation. I have three questions, allow me to ask. So, the first one is about the expectation for the second quarter -- not for the second quarter but the second half of this year in terms of the sales and also margin expectation.\n\nAnd what do you think about the key drivers behind the such sales expectation? So, this is the first question. The second one is about the overseas market expansion or overseas sales. We are seeing that the macro has been quite volatile. But Europe market -- the European market is quite weak, but the U.S.\n\nmarket has been relatively more resilient. And there seems to be a little bit of improvement in the inflation as well or less pressure from that. What do you think about the overseas trend -- overseas sales trends nowadays, and what's your expectation in the second half of the year? The third question is about the robot vacuum segment. How is that performing in the first half of this year? And how do you see for this segment to perform in terms of the demand in the second half? [Foreign language]\n\nWickham Thai -- Head of Finance\n\nOK. Thanks for Hildy's questions. For the first question regarding the sales and margin expectation, yes. In terms of revenue guidance for the second half of this year, as usual, we don't give specific guidance, especially under the macro environment with more uncertainties due to COVID-19 and the macro market, but we expect the revenues to be driven for several perspectives.\n\nFirst, the sales of our new high-end products have been increasing, increasing over the past several months. And some SKUs hit the best solidness during major promotion season. We estimate our AI-centric premium products will help to drive the lead to long-term revenue growth. Second, we have been preparing for exporting additional product categories, including some base compliance to overseas market in the near future, which will partially or partly mitigate the impact from the reconsumer finance and help drive the growth in the short term.\n\nWith respect to gross margins, we still estimate it to maintain a stable level. Let's say, at least over 20% for the whole year. As we will continue to promote premium products with higher margins and take product portfolio adjustments, we expect the overall gross margin to be a reasonable level in the midterm. For the second question about the overseas sales, from our observation, we estimate the overall overseas consumer demand will still be relatively weak, not only in the U.S.\n\nbut especially in Europe. As we see, due to the international geopolitics, the increase in prices of crude oil and raw materials, alongside the falling euro exchange rate, the overall consumer sentiment in euro is relatively low. And we expect this to churn into the second half of this year. While we are taking some actions to mitigate the impacts of weak consumer sentiment in overseas market, first we see the Southeastern Asian market is relatively dynamic, and we see a growing market with great potentials.\n\nSo, at this moment, we will increase the sales of our products in Southeastern Asia. Second, in the following months, we will start to sell additional product categories in additional sweeper robots, which we think could help drive the growth for our overseas markets. We will share more details regarding this due course. For the third question about our sweeper robotics, the sales of our own-branded sweeper robots were relatively weak compared to the same period of last year mainly due to the overseas market, including international geopolitics, the increasing prices of crude oil and raw materials, alongside with the euro exchange rate, such we mentioned just now.\n\nEuro is very -- we expect this trend to the second half of this year. However, as we discussed previously, we are making some efforts to mitigate this impact, like we will increase the sales in Southeastern Asian market. And second, in the following months, we will sell additional product packages in addition to sweeper robots like some big businesses, which we will share more details regarding this in due course. Thank you.\n\nHildy Ling -- Morgan Stanley -- Analyst\n\n[Foreign language] Sorry, allow me to follow up a little bit of a question. In terms of the revenue and net profit contribution, how much of it is coming from overseas market? And if we think about the in the future, is company planning to expand -- put more focus in the domestic market or put more focus in the overseas market? Thank you.\n\nXiaoping Chen -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nI'll quickly translate Mr. Chen's answer. We are quite optimized about our overseas revenues for the second half of the year. As we mentioned before, except of the cleaning products, we plan to introduce new categories of products by these appliance to overseas markets.\n\nAnd we are looking for the overseas revenue percentage to achieve more than 20%, although the revenue percentage of the overseas market of the first half of the year is around 10%. Thank you.\n\nHildy Ling -- Morgan Stanley -- Analyst\n\n[Foreign language] Thank you very much. That's all for me. Thanks.\n\nOperator\n\nThe next question comes from Alex [Inaudible] with CICC. Please go ahead.\n\nUnknown speaker\n\nThank you for your presentation and the meeting. My first question is how is the company's current cooperation with Xiaomi? What is the contribution from the top products through Xiaomi in the company's revenue? What is the outlook for related future revenue growth? Will the future cooperation continue to expand or adjust? And my second question is, in terms of the smart home solution, what is the contribution of the new smart home solution in the company's revenue. Could you give me information about how the updated demand account for the revenue? My third question is, in the second quarter of 2022, is there any performance pressure brought from the real estate? How does the company view the impact from the real estate industry in the future in China? [Foreign language]\n\nWickham Thai -- Head of Finance\n\nOK. Thank you for questions. For the first question about Xiaomi business, firstly, we always maintain stable cooperation with Xiaomi and the revenue contribution of Xiaomi-branded business has been stabilized around 40% over the past several quarters. And we expect it to maintain at this level in short to midterm.\n\nIn terms of categories we cooperate, despite the Xiaomi-branded sweeper robots, we scaled back due to our relevant source strip. We don't have material changes on other categories we cooperate. We currently cooperate on home water solutions, smart kitchen products, and some other small currencies. We will maintain the current cooperation and see if we have further reciprocal opportunities to explore cooperation and additional categories.\n\nAnd for the second question about the home solution, first of all, the IoT at Home solution offering is one of our selling metrics with bundled sales and certain services. And so far, it's not separately calculated as a revenue disclosure sector. The premium bundle offerings we recently started promoting mainly through our offline merchants. As we previously shared, our offline merchant partners -- our offline market size home solution orders ranging from RMB 200,000 to RMB 400,000 with customers in Beijing, Guangzhou, Changsha, and Kunming in the first quarter and accomplished multiple high-end home solution orders, assisting RMB 200,000 and RMB 300,000 in the second quarter in Chengdu, Zunyi, Yinchuan, and some other cities.\n\nAnd regarding your question about the impact from real estate, we are not directly impacted by it as we don't have direct cooperation with real industry or in terms of the declaration for [Inaudible]. But our sales are indirectly impacted to second degree as an influence on the overall demand for home appliances for new apartments. We observed the impact on the overall industry's trending mill as some cities have implemented policies to stimulate real estate industry, though it takes time to recover. In addition, within the home appliances industry, in particular, the smart home trends demand, is less dependent on the real estate than before with the increasing young people starting to replace the old ones with the smart home products.\n\nSo, we think the size of incremental housing markets and smart home industries also rely on the stock housing market, which is more flexible than traditional home plans industry. Thank you.\n\nXiaoping Chen -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOK. I will quickly translate -- basically translate our founder's response. So, for the first question, our cooperation with Xiaomi is quite stable by now and in the near future. And now, we are -- recently, we are working on new cooperations to introducing new categories to the market.\n\nAnd we are looking forward, the Xiaomi part revenue would be increasing to our total revenue. And about the second question, the three small questions are actually one topic of the macro environment. The growth industry is decreasing. It brings a new challenge to our company.\n\nAnd to detail the new supply to being out the new consumer needs, we aim to improve the unit price per customer. And we are looking forward to enhance the bundled sales offering, and we are looking toward the base bundled sales of revenue to be 30% industrywide. Thank you. OK, that concludes our response to your questions.\n\nThank you.\n\nOperator\n\nAs there are no further questions now, I'd like to turn the call back over the company for any closing remarks.\n\nUnknown speaker\n\nOK. Thank you, once again, for joining us today. If you have further questions, please feel free to contact us through the contact information on our website or The Piacente Group, the company's investor relations consultant.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nUnknown speaker\n\nXiaoping Chen -- Founder, Chairman, and Chief Executive Officer\n\nWickham Thai -- Head of Finance\n\nHildy Ling -- Morgan Stanley -- Analyst\n\nMore VIOT analysis\n\nAll earnings call transcripts"
}