{
  "companyName": "Comtech Telecommunication",
  "companyTicker": "CMTL",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/30/comtech-telecommunication-cmtl-q4-2022-earnings-ca/",
  "content": "Comtech Telecommunication (CMTL)\nQ4 2022 Earnings Call\nSep 29, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to Comtech's fourth quarter fiscal 2022 earnings conference call. As a reminder, this conference is being recorded, Thursday, September 29th, 2022. I would now like to turn the conference over to Mr. Robert Samuels of Comtech.\n\nPlease go ahead, sir.\n\nRobert Samuels -- Vice President, Investor Relations\n\nThank you, operator, and good afternoon, everyone, and thanks for taking the time to dial in today. I'm Rob Samuels, Comtech's head of investor relations. Welcome to Comtech's conference call for the fourth quarter and full year of fiscal year 2022. Today, I'm pleased to introduce Comtech's new chairman, president, and chief executive officer, Ken Peterman.\n\nAs many of you know, Ken joined our board as an independent director in May of this year. Given his decades of experience in satellite communications, mobile networking, cybersecurity and aerospace and defense technologies, as well as his demonstrated ability to transform businesses and drive market-leading growth, he was the right guy at the right time to become our CEO. Ken's been on the job for 50 days now, and is working hard to fully familiarize and integrate himself with complex organization, people, challenges and many opportunities. Before I turn things over to Ken, let me remind you of the company's safe harbor language.\n\nCertain information presented in this call will include, but not be limited to, information relating to the future performance and financial condition of the company, the company's plans, objectives and business outlook and the plans, objectives and business outlook of the company's management. The company's assumptions regarding such performance, business outlook and plans are forward-looking in nature and involve significant risks and uncertainties. Actual results could differ materially from such forward-looking information. Any forward-looking statements are qualified in their entirety by cautionary statements contained in the company's Securities and Exchange Commission filings.\n\nNow, I am pleased to introduce the president and chief executive officer of Comtech, Ken Peterman. Ken?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nThanks, Rob, and thanks again, everyone, for taking the time to dial in today. I genuinely appreciate your interest in and support for the transformational efforts already underway, as we open an entirely new chapter at Comtech. In a moment, I'll take some time to not only introduce myself, but to discuss the strategic approach I'm taking to unleash the energy, the creativity and the innovation that exists among our people at Comtech. There's a clear opportunity to deliver technology-enabled communications capabilities that will truly change the game for our customers, and at the same time, help enable us to realize the full potential that exists in our expanding and evolving global communications markets.\n\nThis strategic approach is one that I developed, refined and applied previously in my career, and I'm excited to apply it here at Comtech for two key reasons. No. 1, it is directly applicable to our current organization, our culture and our emerging market environment. And, number two, quite simply, it works.\n\nBut first, let me quickly turn it over to our CFO, Mike Bondi, to review our financial results for the quarter. Mike?\n\nMike Bondi -- Chief Financial and Accounting Officer\n\nThanks, Ken. As is evident from our reporting this quarter, and as we have been discussing on our last few earnings calls, we have formally resegmented our business in Q4 to better align it with our products, services and end markets. Our two new segments, satellite and space communications and terrestrial and wireless networks better represent who we are as a company and where our future is headed, based on evolving industry trends and how Ken intends to manage the business at this time. Our satellite and space communications segment designs, builds and supports a variety of sophisticated communications equipment that meets or exceeds the highest standards for performance and quality by businesses and governments worldwide.\n\nIt has four product areas, satellite modem and amplifier technologies, Troposcatter and SATCOM Solutions, space components and antennas, and high-power amplifiers and switches. Our terrestrial and wireless networks segment is a leading provider of the hardware, software and solutions critical to any modern 911 public safety and modern mobile network operator infrastructure, as well as for application services requiring the specific location of a mobile user's geospatial positioning. Is organized into four product areas, next-generation 911 and call delivery, Solacom call handling solutions, trusted location and messaging solutions, and cybersecurity training and services. We hope this resegmentation will help you better understand Comtech and its long-term prospects.\n\nFor Q4 fiscal 2022, we recorded $127 million of consolidated net sales, of which $76.8 million were reported in our satellite and space communications segment, and $50.2 million were recorded in our terrestrial and wireless networks segment. The consolidated fourth quarter sales represented a 4% increase over last quarter and our third consecutive quarterly increase. Compared to the year ago quarter, our consolidated Q4 fiscal 2022 net sales declined $18.8 million or 12.9%, the large majority of which related to lower revenue in our satellite and space communications segment. Consolidated net sales for fiscal 2022 were $486.2 million, of which $279.7 million were related to our satellite and space communications segment and $206.5 million were reported in our terrestrial and wireless networks segment.\n\nConsolidated gross margins were 35.9%, reflecting a decline from the 38.2% we achieved in the third quarter of fiscal 2022, and 37.8% we achieved in the fourth quarter of fiscal 2021. This decline primarily reflects lower sales in our satellite and space communications segment and changes in overall product mix and services. For fiscal 2022, consolidated gross margin slightly increased to 37% as compared to 36.8% for fiscal 2021. As explained in more detail and reconciled in our Form 10-K filed earlier today, we utilize a non-GAAP measure that we refer to as adjusted EBITDA.\n\nDuring Q4 fiscal 2022, adjusted EBITDA was $12.7 million, a 13.4% sequential increase from Q3 fiscal 2022. As a percentage of net sales, adjusted EBITDA was 10%, an improvement from the 9.2% we achieved in Q3 fiscal 2022. For the full year, adjusted EBITDA was 8.1%, a decline from the 13.2% we achieved in fiscal 2021. Adjusted EBITDA margin in the more recent period reflects lower net sales, a general rise in costs due to an inefficient global supply chain, and inflationary pressures, as well as increased investments in R&D in fiscal 2022.\n\nQ4 fiscal 2022 adjusted EBITDA does reflect a decrease from the $26.5 million or 18.1% of net sales we achieved in Q4 of fiscal 2021. This decrease primarily reflects the impact of lower sales in our satellite and space segment. Overall, our consolidated Q4 revenue and adjusted EBITDA were ahead of our guidance provided last quarter, and we're pleased to have met our targets, particularly in light of an economic environment that continues to be challenging. Now, let me return the call back over to Ken.\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nThanks, Mike. The entire team did a tremendous amount of work to resegment our business and to better align it with our emerging market opportunities, our strategic direction and our enterprisewide improvement initiatives that we believe will increase operational performance and enhance shareholder value. This is important in terms of aligning how we report our performance with our products, services and end markets, representing who we are as a company, and allowing us to see with clarity our long-term future growth opportunities. I encourage everyone to review our shareholder letter in both our Form 10-K and 8-K filings made earlier today, which explain and describe this resegmentation in more detail.\n\nFinally, unlike the past, where we have given annual guidance, we're only going to provide guidance for Q1. We know that we need to rebuild investor confidence. And in order to do so, we will set realistic targets that we believe in, and then hopefully exceed. We're not going to get drawn into longer-term outlooks where our visibility is inherently lower and even more so today given the current challenging operating environment.\n\nSo taking current and expected business conditions into consideration, we are targeting the following for Q1 fiscal 2023. Our consolidated net sales are expected to grow between 1% and 3% sequentially. And our consolidated adjusted EBITDA margin is expected to approximate 8%. Again, I want to thank the entire Comtech team for all their hard work and efforts these past few quarters, executing our business plans in a challenging environment.\n\nToday, Comtech has entered the first quarter of our fiscal 2023 year with a significantly strengthened senior leadership team, which certainly includes me, committed to making rapid, aggressive and significant changes on three key fronts. First, to our enterprisewide processes, platforms and tools and the way we operate every day as a business, standardizing our enterprise around common tools and platforms enable collaboration, and an ability to manage our business more efficiently and more effectively. Second, to our operational performance and the way we manage risk, collaborate together and execute as a business. Improving our operational performance strengthens the foundation upon which our business can achieve sustained long-term growth.\n\nAnd third, to our strategic thinking, market assessment and enterprisewide focus necessary to position ourselves to exploit a global communications market that is itself evolving in real time. Now, taking a step back. At the top of the call, I said -- I introduced myself and my strategic approach to building and growing businesses. So first, I'm new here, but I spent decades leading some of the most demanding, sophisticated and successful communications businesses in the world, including those at ViaSat, ITT Exelis, Collins Aerospace, and Raytheon.\n\nAnd I've done so in a wide variety of diverse market environments. I've also consistently grown those businesses by adhering to a fundamental strategic belief. Technology companies need to be led by technologists who understand the art of the possible, and can apply cutting-edge technology to solve customer problems, enhance customer outcomes and create unprecedented customer value in innovative ways. The most successful technology companies are those that simultaneously unleash both creative genius and pragmatism, setting lose talented people who understand and are committed to bringing the art of the possible to bear directly on solving difficult, even nearly impossible customer challenges.\n\nWhen you look closely at the businesses we at Comtech are successful in, it is because -- and this is not an exaggeration, we help our customers solve some of the most difficult and challenging communications problems on the planet, and whether those problems relate to our customers' terrestrial networks, on the ground or their satellite assets deployed in the space. As long as this takes place on solid operational footing, I firmly believe, growth, profitability and value creation will follow. And when we create value for our customers, we invariably create value for ourselves, and crucially for you, our shareholders. The most unique and invaluable ingredient in determining success is a culture of engineering excellence, technology leadership and unbridled creativity and innovation.\n\nThese past few weeks, I have traveled across the country, even across the Atlantic, to meet face-to-face with our people, engaging directly and personally at every level of the organization. And I can tell you without a doubt, there's no question that Comtech has it. What we need to do, and what I'm doing right now, is making sure the foundation I talked about, the foundation anchored on a solid operational footing, is in place to support both near and long-term growth. Now, while Comtech has already built up strong capabilities in each of our end markets, I feel an acute sense of urgency to make changes, which will further accelerate and unlock our potential as an organization.\n\nIt is absolutely clear to both myself and each person on my senior leadership team, what we need to do operationally to ensure that the internal machinery of Comtech's business, everything from supply chain management, risk mitigation, utilization of common enterprisewide processes, increased project management discipline, and even our passion for customer fulfillment, is significantly improved, so that can comfortably support a business that is much, much larger and much more capable than the one we have today. That means, every leader on my watch has been empowered to ask hard questions, make candid evaluations, operate agilely and execute rapid decision-making to improve virtually every aspect of our business. It means, Maria Hedden, our newly appointed COO is working nonstop to centralize our operations, supply chain, strategic sourcing and contract management. Maria has redefined organizational level KPIs, those are key performance indicators, to focus our efforts, appropriately prioritize resources, identify and mitigate risks, eliminate redundancies, leverage synergies and improve efficiencies.\n\nAnd it is my expectation, this will ultimately translate into a permanent significant competitive advantage for Comtech. It also means Jennie Reilly, our head of human resources, has launched Comtech's first comprehensive people strategy to fill current and emerging skill gaps in engineering, business processes, systems design and integration, to solidify succession planning, strengthen our talent pipelines, and generally apply the same level of dedicated focus to managing our people trajectory in the same way that we manage our business operations and our technology road maps. It means we needed, and we have created the role of chief growth officer, a first for Comtech, and one that has been filled by Anirban Chakraborty. Previously, Anirban had been extremely successful as a senior vice president of strategy and business development.\n\nAnd in this new position, he'll be working across our organization to provide our customers with unprecedented insights and creative technology-enabled solutions based on Comtech's best-in-class SSatellite and TTerrestrial NNetwork cCommunications technologies. Roughly, a dozen crucial initiatives have been launched in my first 50 days that I've been CEO, because I keenly understand and share the same sense of urgency and passion that our employees, leadership partners and shareholders all feel. As we move fast to improve our processes and our operational performance and deliver near-term improvements that are right in front of us, we'll create an enduring competitive advantage for ourselves and our customers going forward. This sense of passion and urgency is shared across the organization up to -- and including the board, and it is refreshing, energizing and invigorating.\n\nFinally, in parallel with these operational initiatives, let me offer my strategic view of the company and where we are positioning ourselves. As I look at Comtech's two areas of undisputed expertise, they are in terrestrial and wireless network infrastructure and in satellite and space communications. Historically, there's been a distinct separation between these two communications domains, with different networking protocols, different devices, even different spectrum and bandwidth allocations assigned to each. Now, as I look at where the world is headed in terms of seamless global connectivity, what I see is the convergence everywhere of terrestrial and satellite communications network infrastructures.\n\nWe are in an era of vast and increasing demand for always-on assured seamless connectivity. The demand for the Internet of Things is growing exponentially. The number of connected devices at the edge is exploding, empowering us all to be safer, more effective and more productive in every aspect of our lives. And our customers want and need global communications infrastructures with not only the capacity to handle this increasing IoT load, but to maintain assured, secure and seamless connectivity all the time, regardless of geography, regardless of external conditions, and regardless of any other imaginable complexity that may exist.\n\nThat means, historically, disparate networks will all ultimately seamlessly blend together and hybridize. It means something big when an Apple personal device is suddenly capable of satellite communications, or that a terrestrial telco like T-Mobile forges a partnership with a LEO satellite operator like Starling. We believe that Comtech's people and technologies are uniquely positioned in this market today, to navigate, facilitate and exploit the blending of these terrestrial wireless and satellite network infrastructures on a global scale, delivering the technology-enabled capabilities to meet these customer-driven hybrid connectivity objectives, and significantly benefit from the convergence of these terrestrial and satellite communications domains, leveraging this emerging market inflection point by helping to make hybridized connectivity a global reality. Finally, and most importantly, Comtech's people are clearly ready to move together toward this next new chapter for our business.\n\nAt the same time, we all understand that it is our responsibility to earn our shareholders' confidence and deliver value. My goal as CEO is to give everyone at Comtech the tools, the environment and the empowerment they need to do exactly that. Before I close, I want to encourage you all to review both our filings and our shareholder letter, which go into additional detail about our exciting new chapter and the work already underway at Comtech. And as Rob said at the top of the call, we intend to improve our connectivity with our shareholders.\n\nPlease reach out to us to connect, take the time to review our corporate blog called Signals, which is designed to offer meaningful intra-quarter insights into our people, our products, our many new initiatives, our thought leadership and our end markets. I said there was a lot of hard work to do, and there is, but we have the hardest part of the equation as a business solved. We have the right people, and we have the right technologies, and we have a clear view of where our markets are going and how we fit in, which makes this, for me, the most exciting job imaginable. Thank you again for your time and attention.\n\nI look forward to hearing from you all. Rob?\n\nRobert Samuels -- Vice President, Investor Relations\n\nThanks, Ken, and thanks to everyone for dialing in today. As Ken said, there are additional details about our strategy and performance available in our shareholder letter and other SEC filings today, and we'll provide ongoing insights in Signals. And as a reminder, we intend to be as responsive as we can with investors going forward. So for anyone with questions, please reach out to me directly, and let's connect.\n\nOperator, we can now open up our call for questions?\n\nOperator\n\n[Operator instructions] We'll move first to Joe Gomes with NOBLE Capital. Please go ahead.\n\nJoe Gomes -- NOBLE Capital Markets -- Analyst\n\nGood afternoon and welcome aboard, Ken.\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nThanks, Joe.\n\nJoe Gomes -- NOBLE Capital Markets -- Analyst\n\nSo I glanced at the letter here when it's come out. Just one of the things that you put in it are many challenges facing the company. And I was wondering maybe you can kind of give us what you see as the biggest near-term challenges and how you're going about to handle those?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nSure. I'll tell you. I think, Joe, largely, this builds on the experience that I've had previously, OK? I've got a track record of taking businesses that are operating in silos and bringing those teams together to create sustainable and profitable growth by leveraging technology to meet the continually evolving needs of global markets. I have -- we've moved from silos -- businesses that are in silos to one enterprise, so that we can step up and punch our weight, so that we can realize the synergies, eliminate the overlap, better manage our risks collectively, and improve our operational performance.\n\nWe've got a track record of that. Secondly, a track record of now that we could operate as a collective enterprise and not operate as individual silos. We can expand our addressable markets and move up the food chain, because we're operating on a stronger operational foundation, but also because we're able to address customers' problems more comprehensively. And in my experience, that improves operations of our core business.\n\nIt also grows revenue fast and frankly, grows EBITDA faster.\n\nJoe Gomes -- NOBLE Capital Markets -- Analyst\n\nMaybe last quarter, we had talked to some on the 911 market opportunities, and some of them had been kind of moved out of the fourth quarter, and we're hopeful that they would be reengaged here in early fiscal '23. I'm just wondering what the status of those opportunities were in the 911 market?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nWell, Joe, I'm going to speak to the key wins that we had here in the fourth quarter. And I think that it comes in three key areas for us. First of all, in an incumbent position, we had a next-gen 911 customer expand our scope in a statewide employment -- deployment. And that's important that your existing customers see you favorably and flow additional work scope to you.\n\nThe second one, we won a new multiyear contract for Canadian province, and it's a provincewide hosted, managed multi-PSAP 911 system. So we've also won new customers and new geography. That's item two. Item three, we've moved technology forward by establishing licensing agreement with a tier one MNO to provide cloud native messaging platform.\n\nAnd that moves the needle, OK? So for us, that takes our capabilities to the cloud and puts us on a path to keep pace with 5G and other network infrastructure opportunities. Mike?\n\nMike Bondi -- Chief Financial and Accounting Officer\n\nKen, I'll add to that, too, is, Joe, you probably referred to two opportunities specifically that we did shift out in our thought process to 2023. We are still tracking those items. But in terms of our outlook for Q1, I would say, nothing new to report right now, and it's not factored into our guidance that we just explained for Q1.\n\nJoe Gomes -- NOBLE Capital Markets -- Analyst\n\nAnd one more, if I may, on the satellite business. We had, again, previously talked about the contract with a LEO, MEO, and I know here in the shareholder letter you talk about some key wins here in there, with a new LEO and a MEO satellite network. Maybe you could give us just a little more color or detail on those, and when you might start to think you see some revenue generation from those types of contracts?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nWell, we did have two key wins in the satellite and space segment, OK? And frankly, we're developing and providing modems for leading LEO and MEO providers, and that's the usual stack of equipment for us. It's not just modems, it's gateways, amps, antennas and those kinds of things. Mike, you may want to add some color to that?\n\nMike Bondi -- Chief Financial and Accounting Officer\n\nSure. And the opportunity set here -- we really can't specify exactly what our contract entails. We're bound by confidentiality, and it's something that's competitive. But we're very excited about winning the strategic opportunity.\n\nIt's growing a relationship that we definitely want to see grow over time. And we'll have more to report on that in FY '23 downstream.\n\nJoe Gomes -- NOBLE Capital Markets -- Analyst\n\nHey, great. Thanks. I'll let someone else ask questions. Ken, welcome aboard.\n\nLook forward to seeing how it plays out here in the future.\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nThank you, Joe.\n\nOperator\n\nAnd we move next to Greg Burns with Sidoti & Company. Please go ahead.\n\nGreg Burns -- Sidoti and Company -- Analyst\n\nGood afternoon. Just a quick follow-up on the last question. So the two wins mentioned in the letter, the LEO and the MEO operators, those are new to this quarter? Because I know you had previously talked about a LEO opportunity you're aligned with. So I just wanted to make sure that I'm understanding that correctly.\n\nMike Bondi -- Chief Financial and Accounting Officer\n\nYes, in the prior disclosures, we've been talking about one particular contract that we won. And so, we're well on our way with that contract. The item that we're referring to in the shareholder letter is a new opportunity that we secured a position on, and we're doing work here. And this is an added aspect to the overall relationship.\n\nGreg Burns -- Sidoti and Company -- Analyst\n\nAnd then, on the terrestrial side of the business, why were the margins down this quarter? And what do you see the sustainable EBITDA margins of that business being?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nYes, in terms of the chart, you're probably looking at the shareholder letter, and you do see a drop off in Q3 and Q4. I'd also point you to the bottom of that page, you probably see the bookings rising up nicely in Q4. Here, I think it's a story of where, as a reminder, we won some very large contracts a few years ago, to develop the first 5G location-based platforms for tier one mobile network operators, those contracts sort of in the first and second quarters of '22. We're nearing their completed phase, not 100% done, but they are moving through their life cycle and we're starting to now shift gears toward what's in our backlog as of July 31.\n\nSo I think we'll see a return and improvement in the margins over time. But right now, we're just sort of shifting gears. And I also want to point out, we are spending money on R&D to secure these types of wins. So we are making investments along the way here as well.\n\nGreg Burns -- Sidoti and Company -- Analyst\n\nAnd then in terms of the guidance, I guess, a sequential decline in the consolidated EBITDA margin. What are the factors driving that, even though revenue is going to be up?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nYes. I think, Greg, it's still a challenging environment. We have a new CEO at the helm who's doing an evaluation. We're facing rising costs and inflationary pressures.\n\nSo I think we're just trying to not get too far ahead of ourselves. We also had, in the fourth quarter, as we always do in the fourth quarter when we do the share units in lieu of cash incentives. You have a little bit of a pop there. But I think, overall, we're just trying to be cautious about the environment that we're in as we move into FY '23.\n\nGreg Burns -- Sidoti and Company -- Analyst\n\nAnd then just lastly, you announced an agreement or a contract to deliver equipment to Ukraine. Is that -- I know earlier this year, you had talked about some orders from Ukraine being delayed, and that was -- I think at the time, you lowered your revenue guidance by about $35 million for that. Is this that opportunity? Has that been realized? And now you're going to -- I guess, is that the same opportunity? And what is the kind of the revenue potential of that contract?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nSure. You are correct. We had multiple opportunities actually in this area. And as we said before, we did not think we lost those opportunities.\n\nWe thought it was a challenging environment for defense spending, as people were retooling their budgets. We stayed close with our customer. We've actually donated a few comets in the fourth quarter. We thought that was the right thing to do, and it translated to a good relationship that we're building with our customer.\n\nAnd so, the press release you saw probably a few days ago is an aspect of that relationship. And as we said, we think there's strong demand for this product.\n\nGreg Burns -- Sidoti and Company -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nAnd we move next to George Notter with Jefferies. Please go ahead.\n\nGeorge Notter -- Jefferies -- Analyst\n\nHi. Thanks a lot, guys, and welcome to the company, Ken. Congratulations on the new role. I guess I wanted to ask about the shareholder letter.\n\nYou mentioned the strategic committee that's being formed within the board of directors. I guess, I'm just curious in your words, what the thought process is behind the strategic committee? Are you looking at making changes in the product segments or makeup of the company in terms of product lines? Anything you can share there would be great.\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nYes, sure. We're driving that -- we're really opening a new chapter, OK, at Comtech, and that chapter involves moving beyond operating as individual businesses in silos and unlocking the shareholder value that comes with those businesses operating collectively together. That gives us the opportunity to punch with the full way to the enterprise. I talked to you about our COO, Maria Hedden taking the lead on centralizing operations, supply chain, strategic sourcing so that we can deal more effectively with our supply chain because we can -- it amplifies our voice, right? We're also operating on common processes so that we can collaborate more effectively together.\n\nThat opens the door for us to move up the food chain and offer our customers a more comprehensive solution. The strategic committee is valuable to me as our markets evolve, and as we launch these new strategies, and develop the business thesis that will enable us to operate the business that we've always had more effectively, but potentially take advantage of the market convergence that we spoke about, with the terrestrial wireless market blending together with the satellite market, and how we might prosecute those opportunities that are rightly suited and rightly timed for us, so that we can unlock that shareholder value in a more comprehensive way at a higher level in the food chain.\n\nGeorge Notter -- Jefferies -- Analyst\n\nFair enough. Thank you very much.\n\nOperator\n\nAnd we'll move next to Asiya Merchant with Citigroup. Please go ahead.\n\nAsiya Merchant -- Citi -- Analyst\n\nHi. Good morning. Good evening. Thank you for the opportunity and welcome aboard, Ken.\n\nI guess, with the sequential growth that you guys are seeing in your fiscal 1Q -- typically, fiscal 1Q does tend to be the lowest quarter going back a few years, pre-pandemic. Should we expect sort of this year to kind of exhibit that where 1Q for you guys will be kind of the lowest quarter for you guys? And then just maybe if you could break it down between the two new segments that you have, the guidance that you're quoting, where should we kind of be modeling that sequential growth? Is that more in the terrestrial side of things, just given some of the design wins that you've talked about?\n\nMike Bondi -- Chief Financial and Accounting Officer\n\nYes, in terms of our guidance, this is a change for us to only look out 90 days when we're giving out guidance at this point in time of the year. I would like to say, you could probably think of Q1 resembling Q4 in terms of distribution of the revenues with the concept that our terrestrial business has a nice flow of recurring revenue. And so, some of the growth you'll see -- as the whole economy improves over time, you would think that we would improve as well. But I think we'll hold our comments to just the first quarter right now and kind of not get ahead of ourselves.\n\nAsiya Merchant -- Citi -- Analyst\n\nAnd then just in terms of pricing, I think you talked about a challenging environment with your adjusted EBITDA coming down sequentially. Just -- are you able to -- I mean, if you can give us some color on how the negotiations are going with your customers, are you able to pass on these price increases related to components? Or are you getting a lot of pushback? And if there is any color between the two segments, where do you expect the margin impact?\n\nMike Bondi -- Chief Financial and Accounting Officer\n\n Yes. I think, it's -- a good place to start is with our backlog. I mean, we have over $600 million in funded backlog today. And a lot of that does relate to our terrestrial and wireless networks segment, which -- To break that down, that's sort of our 911 business where we have long-term contracts in there.\n\nSo those contracts were set a few years back in terms of the whole negotiation of those contracts. It does take some time. So while we did have escalators in there, I don't think we were figuring this level of inflation. So we will have some gross profit impacts over the course of maybe the next year or so, as we're still winding those contracts down.\n\nBut certainly, as we get opportunities for new proposals, we are taking into account the current environment and trying to be smarter about how we price those contracts with levers to improve our profitability. So I think that's probably where it will be impacted most is in our terrestrial segment in our 911 business. But our satellite ground station product lines and some of the other product lines, they do have a book-to-ship element to that. And so, in this environment, we are looking to increase prices when and where possible, keeping in mind that it's a very competitive environment.\n\nAnd we don't want to shoot ourselves in the foot, as we had some experience last quarter with one particular customer, and we didn't get a good reaction. So I think we're going to be very mindful and strategic about how and when we do that.\n\nAsiya Merchant -- Citi -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAnd we'll move next to Mike Latimore with Northland Capital Markets. Please go ahead.\n\nMike Latimore -- Northland Capital -- Analyst\n\nGreat, thanks. And congrats on the new role here, Ken.\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nThanks, Mike.\n\nMike Latimore -- Northland Capital -- Analyst\n\nKen, you mentioned this kind of hybridized world. Can you give a couple of use cases that are -- maybe have the biggest addressable market where Comtech can sell something that combines satellite and terrestrial technology? Like what would be some IoT use cases that kind of maybe jump out and might have the biggest opportunity or where you have the most differentiation? And then maybe just tie that into how you see that helping you move up the food chain? Maybe elaborate a little bit more on what that means?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nOK. So our value proposition in terrestrial wireless among the MNOs, the mobile networks operators, is in location-based services, short message service centers, wireless emergency alerts, satellite backhaul, OK? And now we're moving into cloud native platform solutions with the contract win that we just talked about a few minutes ago. Those cloud-native platform solutions are just adaptable in the satellite ecosystem that they are in the terrestrial wireless systems. So that's one area.\n\nSecondly, in the other direction, our satellite communications value proposition has typically been in equipment like modems, amplifiers, bucks and antennas. But importantly, our RF expertise in those domains, millimeter wave frequency equipment, is now becoming applicable in the terrestrial wireless space, because those frequency bands, those spectrums are being reapplied to 5G, OK? So we're seeing the opportunity for the businesses to work together to improve the value proposition on both sides. Finally, I'll say that we've traditionally thought of ourselves as a 911 public service market player, and we serve that market very effectively. But these value propositions that we bring in the 911 public safety sector are directly applicable to the much broader orders of magnitude larger market that is transforming the 5G network infrastructure globally.\n\nSo as we look to extend the relationships that we have in our traditional 911 markets, we see the opportunity to play a bigger role in the broader markets beyond public safety.\n\nMike Latimore -- Northland Capital -- Analyst\n\nAnd, I guess, maybe somewhat the reverse of that almost, but to the extent you have -- do have two separate businesses that you're reporting, is it clear that one segment or the other would have a kind of higher growth rate over the long term, or too early to say on that?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nWell, I'll say this, this convergence of satellite and terrestrial  Com's infrastructures, and us moving to be one Comtech and punch our way at an enterprise level, to be clear, it's the early days of that. But one of the reasons I created the role of chief growth officer is to have a very senior individual among my leadership team whose role is to look across those two markets, bring enterprise technologies forward, and apply them to the market in innovative ways. So I would tell you that there's kind of three answers. I think first one, each of those segments have high growth potential as we start to look at ourselves differently, as one contact with the new segmentation.\n\nBut then, when we bring the two segments together, we think we can operate in a convergence environment at the enterprise level, and we think that's going to open up additional markets for us.\n\nMike Latimore -- Northland Capital -- Analyst\n\nAnd I think just last one minor topic. I think your Arizona manufacturing center was supposed to be opened pretty soon. You know the status of that?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nSure. I'll tell you what, I've toured it, and I'm extremely impressed. I've been in this business a long time. I've seen a lot of manufacturing facilities, and I think this one lays the ground for us to support the growth in the future.\n\nMike can speak to it. I don't know -- Mike wants to speak to it, too. So I'll let him have the floor in a minute, but I'm very impressed about what's going on there.\n\nMike Bondi -- Chief Financial and Accounting Officer\n\nYes. And working with Maria, our COO, who's overseeing that migration, it is progressing very nicely. As Ken had mentioned, we are expecting to be fully in -- operational in FY '23. I think we still have a few more things to do, but we are seeing a lot of the functions migrating over as we speak.\n\nAnd so, we're very encouraged that we're getting near the end of that.\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nYes, people are in the facility.\n\nMike Latimore -- Northland Capital -- Analyst\n\nOK, great. Thanks a lot. Good luck.\n\nOperator\n\n[Operator instructions] We'll move next to Chris Sakai with Singular Research. Please go ahead.\n\nChris Sakai -- Singular Research -- Analyst\n\nHi. Good afternoon. Ken and Mike. My question is in regards to, I guess, the satellite and space and terrestrial and wireless.\n\nIt looks like adjusted EBITDA margins in satellite and space are getting better, but margins in terrestrial and wireless are declining. Can you help us understand why there's this divergence here between the two segments?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nSure. Chris. In terms of the satellite and space segment, Q4 was influenced by some work that we were doing in the EEE space components part of the business, as we're delivering on the first phase of a major project. We also had some comet orders go out in the fourth quarter on another opportunity, not Ukraine, which also helped provide some uplift there.\n\nAnd also, timing of our R&D investments in the fourth quarter contributed to a higher EBITDA margin for space. On the flip side, terrestrial, as I was explaining earlier on the call, we did have a mix of business that we're nearing completion on, as we're starting to now shift gears and work on the next phase for our customer who is migrating and virtualizing their 5G platform. So I think you're seeing a little bit of a timing issue. We do have -- at this point, won some sizable orders that are in our backlog as of July 31.\n\nAnd as we start performing on those contracts, I think you'll see us improving there.\n\nChris Sakai -- Singular Research -- Analyst\n\nAnd then, as far as bookings are concerned for terrestrial and wireless, was this a timing issue again as far as this increase in Q4?\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nYes. In terms of the order flow -- I mean, we've always said -- we are in some niche markets, and we also have some large lumpy contracts that are difficult to predict. We know -- we feel confident that we will get them. It's just a matter of timing, what quarter.\n\nBut yes, in Q4, there was a good push with our customer base to position ourselves on some long-term contracts here. So we are excited with the bookings flow that we saw in the fourth quarter. And it's just a function of timing on these large contracts.\n\nChris Sakai -- Singular Research -- Analyst\n\nAnd then it looks like -- so terrestrial and wireless network revenue is kind of -- it looks stagnant. What are you guys doing to get that to grow?\n\nMike Bondi -- Chief Financial and Accounting Officer\n\nI would recharacterize it, if you could, to say steady, not stagnant. It's nice recurring revenue. And we are in the process of rolling out three major deployments with Pennsylvania, Arizona and another state. And as we're completing the implementation phase, the first phase of the projects, and turning on the PSAPs to the recurring services, I think you'll start to see the benefit of that over time.\n\nSo we're making good progress on Pennsylvania. We're getting deeper into our Arizona implementation, and we've been working on South Carolina. So I think it's just a function of where we are in the life cycles of those contracts.\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nAnd the growth opportunity is, one, taking a new geography; two, up gunning the geography that we're already servicing, and then driving beyond the current generation to the next generation that supports the Internet of things, and creating the capability to make sure that a digital device can make a 911 like call in the future and supporting that type of device density, speed, low latency that the market demands, and we're doing that.\n\nChris Sakai -- Singular Research -- Analyst\n\nOK. Thanks for the answers.\n\nOperator\n\nAnd it does appear there are no further questions at this time.\n\nRobert Samuels -- Vice President, Investor Relations\n\nThanks, operator. Well, we really appreciate everyone's interest in Comtech today. If you have any other questions, please don't hesitate to reach out to me or check out our Signals blog on our investor relations page. Thanks very much again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRobert Samuels -- Vice President, Investor Relations\n\nKen Peterman -- Chairman, President, and Chief Executive Officer\n\nMike Bondi -- Chief Financial and Accounting Officer\n\nJoe Gomes -- NOBLE Capital Markets -- Analyst\n\nGreg Burns -- Sidoti and Company -- Analyst\n\nGeorge Notter -- Jefferies -- Analyst\n\nAsiya Merchant -- Citi -- Analyst\n\nMike Latimore -- Northland Capital -- Analyst\n\nChris Sakai -- Singular Research -- Analyst\n\nMore CMTL analysis\n\nAll earnings call transcripts"
}