{
  "companyName": "Seer, Inc.",
  "companyTicker": "SEER",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/seer-inc-seer-q2-2022-earnings-call-transcript/",
  "content": "Seer, Inc. (SEER 2.11%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Seer second quarter 2022 earnings call. [Operator instructions] I would now like to turn the call over to your host, Carrie Mendivil. You may begin.\n\nCarrie Mendivil -- Investor Relations\n\nThank you. Earlier today, Seer released financial results for the quarter ended June 30, 2022. If you've not received this news release or if you'd like to be added to the company's distribution list, please send an email to investor@seer.bio. Joining me today from Seer is Omid Farokhzad, chairman, chief executive officer and founder; David Horn, chief financial officer; and Omead Ostadan, president, will join for Q&A.\n\nBefore we begin, I'd like to remind you that management will make statements during this call that are forward-looking statements within the meaning of federal securities laws. These statements involve material risks and uncertainties that could cause actual results or events to materially differ from those anticipated. Additional information regarding these risks and uncertainties appears in the section entitled Forward Looking Statements in the press release Seer issued today. For a more complete list and description, please see the Risk Factors section of the company's quarterly report on Form 10-Q for the quarter ended June 30, 2022, and in its other filings with the Securities and Exchange Commission.\n\nExcept as required by law, Seer disclaims any intention or obligation to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. This conference call contains time-sensitive information and is only accurate as of the live broadcast, August 9, 2022. With that, I'd like to turn the call over to Omid.\n\nOmid Farokhzad -- Chairman, Chief Executive Officer, and Founder\n\nThanks, Carrie, and thanks, everyone, for joining us this afternoon. We continue to make strong progress across all areas of our business as we ramp our commercial footprint, expand our installed base on the Proteograph Product Suite and work closely with customers and key thought leaders. As the body of data expands to show the power of unbiased plasma proteomics at scale, we're driving our research and development road map to further advance the capabilities of our technology. We ended the second quarter with $3.6 million in revenue and more than $456 million of cash on our balance sheet, continuing to drive momentum in our business while remaining well-positioned to execute on our multiyear strategic plan.\n\nNow more than 18 months since we started our phased commercialization and six months following broad commercial release, we're seeing accumulation of evidence that our technology addresses significant unmet needs. Across a wide range of research applications, our customers are seeing promising early results that they believe are unlocking biological insights never seen before. We expected that our customers' work would span discovery, translational and clinical research applications, and we are pleased to see an expanding number of customers undertaking projects in translational or clinical research relatively soon after acquiring the technology. To date, the majority of samples run by our customers are in clinical research and involve clinically relevant biomarkers.\n\nThese projects span a wide range of complex diseases in studies across early cancer detection, biomarker discovery, aging and cell rejuvenation and the impact of environment on human health, among other applications. Now with that larger context, I would now like to share some updates on our execution against our five key objectives to drive growth in 2022 and beyond. As a reminder, these objectives are: first, supporting customers with an industry-leading experience while helping them to systematically scale their use of the Proteograph Product Suite for projects of increasing size and scope; second, expanding our global customer network and installed base of instruments; third, continuing to build out our team, commercial capabilities and geographic footprint; fourth, driving our product road map to enable more applications for our proprietary engineered nanoparticles; and fifth, expanding our partnership efforts to make it even easier for customers around the world and across markets to adopt our technology. Now to the updates.\n\nLet's start with how our customers are using the Proteograph and review some specific examples of the progress they're making. In the first quarter of 2022, we saw 11 posters and presentations at scientific conferences. Since then, with the busy spring conference season, our customers, as well as Seer scientists have presented 28 posters at nine additional industry events across the United States, Europe and Asia. These events spanned the genomics and proteomics space and included conferences such as AACR, AGBT, ESHG and ASMS.\n\nImportantly, about a third of these presentations were from our customers. Now this is pretty remarkable when you consider that most of our customers have had the Proteograph in their labs for a relatively short period of time. For example, at the American Society of Mass Spectrometry, or ASMS, conference in early June, there were multiple presentations and posters featuring the Proteograph Product Suite, including several by our customers. At a high level, the most common themes were, first, the Proteograph Product Suite is enabling an entirely new approach to interrogating the proteome at a depth and scale not previously possible.\n\nSecond, this capability is allowing researchers to see more of the proteome, especially low-abundance proteins, than they had previously been able to see across similar cohorts. And third, this is enabling researchers to access peptide- and amino acid-level protein variant information, which is necessary to perform high-resolution proteogenomics and only possible through large-scale deep and unbiased proteomics. To illustrate this, I'd like to share some specific highlights from customers' posters. Starting with PrognomIQ, they found novel biological signatures for pancreatic cancer with multiple statistically significant differences in protein abundance among 92 cancer and 104 healthy subjects in a case-controlled multiomic study.\n\nThis result was very exciting because despite the moderate size of the sample cohort, they achieved a high predictive power driven by their biomarker signatures compared to other pancreatic cancer studies published to date. PrognomIQ observed that the strong detection of changes in biological signals and the breadth of the signals greatly enable identification of novel biological markers in clinical studies of practical size. This is in part due to the low technical noise relative to biological signals that the Proteograph enables across thousands of proteins in the proteome. You can hear more from PrognomIQ on this study also at the upcoming AACR Pancreatic Cancer Conference in mid-September.\n\nMoving to Evotec, a Seer center of excellence and one of the global leaders in providing drug discovery solutions on a stand-alone basis or through holistic, fully integrated drug discovery solutions, they presented a poster revealing that, on average, more than 5,000 proteins were detected using the single-shot data independent acquisition, or DIA, analysis across 105 patient samples, with more than 3,000 proteins in individual samples. The poster also highlighted an unprecedented depth of detection for low-abundance proteins such as cytokines, a class of protein known to be increasingly important in development of certain therapeutics, that were previously not accessible in their unbiased workflows at scale. And finally, in a collaboration between Seer, Weill Cornell and SpaceX, the Proteograph was used for deep protium interrogation of the four civilian astronauts from the Inspiration4 crew, looking at time points before and after space flight. The poster showed 50 differentially abundant proteins, primarily indicative of oxidative stress and metabolic pathways.\n\nThey're excited by these findings, which address the open-ended question of what happens to human physiology at the molecular level as a consequence of space travel. Importantly, the Proteograph provides information as to what protein variance may be affected, by how much, and how this correlates with other omic changes of interest. These posters highlight the unique value proposition of the Proteograph Product Suite to enable access to the vast depth of the protiome which was previously very limited. In a paper published in 2017 titled \"Revisiting Biomarker Discovery by Plasma Proteomic\" by Professor Matthias Mann, one of the leaders in proteomics, evidence was presented that the majority of the 117 FDA-approved protein biomarkers that were known at the time of their publication were biased toward the most abundant 300 plasma proteins.\n\nThis is because, historically, these were the proteins that could be readily interrogated at scale using shallow proteomic workflows without the complex immunodepletion and fractionation protocols. The authors proposed that if the proteome could be interrogated to an arbitrary depth of 1,500 proteins efficiently and at scale, an additional 280 protein biomarkers could be discovered and validated. Here is why Seer is uniquely positioned to enable this. The Proteograph enables efficient and rapid access to the plasma proteome with peptide- and amino acid-level resolution at depth and scale never before possible.\n\nAnd the Proteograph provides a high level of reproducibility, enabling discovery power from practical cohort sizes, making it possible to identify even small changes or more complex biomarker signature comprising groups of protein variants across populations. The combination of this depth and scale [Inaudible] would have been made possible in genomics to allow at-scale functionalization of genomic variants and the discovery of novel protein content. Customer data on deep plasma proteomics and the putative biomarkers they are seeing appears to support Professor Mann's hypothesis. Larger cohorts are likely to reveal even more novel biomarkers, finding statistically significant differences in proteins and protein variants.\n\nWe're in the very early days of this expansion in novel content discovery, and I expect to see a massive deepening of our understanding of the proteome and, thus, biology in the years ahead. As more third-party data enters the public domain over the coming months and years, we expect it will have a network effect in accelerating adoption. We also expect adoption will accelerate across multiple markets in parallel, as we see growing interest in the Proteograph across a broad range of applications, including biomarker discovery, target identification and drug development and early disease infection. This interest spans a broad range of disease families, including neurodegenerative diseases, oncology, cardiovascular disease and other complex diseases, reproductive health, aging and veterinary medicine.\n\nIt is clear there is a strong need for deep unbiased proteomics, and it's exciting to see the emergence of our customer data and the traction we are progressively gaining. Now turning to our growing installed base. We continue to see strong interest across geographies, with our pipeline of qualified leads roughly equal between academic and commercial customers. As we have previously stated, the sales cycle for our commercial prospect is shorter relative to academic prospects, driven by how each segment receives fundings for their projects.\n\nOver time, we do expect the percentage of academic customers in our installed base to increase as more and more grants are submitted and approved for projects leveraging the Proteograph Product Suite. Despite the ongoing risk of COVID and the uncertainty around supply chain, we were able to increase our installed base across North America, Europe and Asia in the second quarter, expanding global access to the Proteograph Product Suite. As an example, Bertis, an innovative South Korean proteomic-based precision medicine company, which recently established a U.S. presence, has added the Proteograph Product Suite to complement and accelerate the discovery and translational mass spec-based clinical test development capabilities by scaling the scope and increasing the resolution of future studies.\n\nWe are proud of the growing body of customer data and expect to see a number of them submit manuscripts before the year-end. Customer-driven proof points are essential in developing the market for any first-of-its-kind product. We believe that as more third-party data enters the public domain over the coming months and years, the differentiated value proposition of the Proteograph Product Suite to provide novel insight into the proteome and to enable the next generation of multiomic studies will become more established. And finally, we made important progress with our partnership, namely, the Proteogenomics Consortium, which, as a reminder, is a first-of-its-kind partnership that we established with Discovery Life Sciences and SCIEX.\n\nThis is a multiyear collaboration with three phases for expansion where Discovery will set up, expand and offer deep unbiased proteomic capabilities to their existing and new genomic services customers, with a plan to ramp up to an annual capacity of over 100,000 samples. Discovery recently received the Proteograph and SCIEX's ZenoTOF 7600 instruments at their facility in the Boston area and is in the process of installation and validation using 500 internal samples for a proteogenomic study. We expect that they will begin running initial customer projects as early as the fourth quarter of this year. We believe the Proteogenomics Consortium will accelerate proteogenomics projects at the protein variant level with the type of scaled, streamlined, expert operations to match nearly any customer's needs.\n\nAs we expand our footprint globally with what is already a disruptive product, we're also pushing on the next set of innovations to further extend the capabilities of the Proteograph Product Suite. These innovations span a broad range of capabilities, including workflows, assays and, importantly, software and informatics. With our recent release of the next version of the Proteograph Analysis Suite, PAS 2.0, we're enabling the first-of-its-kind proteogenomic workflow that maps proteomic peptide-level data to genomic data to identify sample-specific variant peptides not captured in canonical reference databases. Customers can move easily off genomic endpoints and access meaningful data to enable peptide-level disease association, further functionalizing our understanding of genetic variation and moving closer to phenotype.\n\nPAS 2.0 empowers high-resolution proteogenomics, something that is uniquely enabled by our technology and is not possible with targeted methods. We're continuing to expand our software feature, streamlined data management across our workflows and leverage the power of our proprietary engineered nanoparticles to lay a road map into the future. We're also expanding what can be done with the Proteograph with exemplification of proprietary engineered nanoparticle-based approach across sample types and model organism, including cell culture and cell lysate, mouse and pig, as well as standardizing workflows across mass-spec platform. This flexibility and accessibility would enable the Proteograph to elucidate novel insight for biomarker discovery and proteogenomics at scale across more customer groups.\n\nAs we work to expand this flexibility, we expect to see an acceleration of the work of the scientific community to unlock immense biological insight. As we work closely with our customers, focus on our goals and drive execution against them, we are committed to providing a continuous stream of product enhancement and improvement to customers that will expand access to novel biological content and set a pace for innovation in proteomics. With that, I will now turn the call over to David.\n\nDavid Horn -- Chief Financial Officer\n\nThanks, Omid. Total revenue for the second quarter of 2022 was $3.6 million, representing an increase of 171%, compared to $1.3 million of revenue in the second quarter of 2021. The increase in second quarter revenue was primarily due to increased sales of the Proteograph Product Suite and its related products. Product-related revenue for the second quarter of 2022 was $3.5 million, including related-party revenue of $1.1 million, and consisted of sales of SP100 instruments, consumable kits and platform evaluations.\n\nRelated-party revenue of $1.1 million represents product sales to PrognomIQ. Total gross profit, inclusive of grant and other revenue, was $1.6 million for the second quarter of 2022, representing a gross margin of 44%. As we have discussed, we expect gross margins to improve over time with increasing product volumes and continued cost reduction initiatives. We continue to target long-term gross margins between 70% and 75%.\n\nTotal operating expenses for the second quarter of 2022 were $25 million, including $8.4 million of stock-based compensation, compared to $17.4 million, including $6.4 million of stock-based compensation, in the second quarter of 2021. Research and development expenses for the second quarter of 2022 were $10.9 million, an increase of 57%, compared to $6.9 million in the second quarter of 2021. The increase in R&D expenses was primarily due to an increase in product development efforts related to the Proteograph Product Suite, including $2.6 million in employee compensation costs and other related expenses, including stock-based compensation, due to growth in research and development personnel and an increase in expenses related to the build-out of our facilities to support our R&D efforts. Selling, general and administrative expenses for the second quarter of 2022 were $14.2 million, an increase of 35%, compared to $10.5 million in the second quarter of 2021.\n\nThe increase in SG&A expenses was primarily driven by a $1.4 million increase in employee compensation and other related expenses and a $700,000 increase in stock-based compensation. Other increases are attributable to an increase in professional services and consulting fees and our facility expansion. Net loss for the second quarter was $22.8 million, compared to $16.6 million in the second quarter of 2021. We ended the quarter with approximately $456.1 million in cash, cash equivalents and investments and continue to be disciplined about our level of spend and the rate of return that we will earn on our deployed capital.\n\nWith our extremely strong balance sheet, we believe we are well capitalized to execute on our strategic plan for many years to come. Turning to our outlook for the year. We remain focused on building our business over the long term and achieving our strategic objectives each year. We're encouraged by the feedback we have received from our customers, as well as the breadth and quality of our pipeline.\n\nWhile we have managed to navigate the complexities of COVID, especially in China, and uncertain macroeconomic conditions globally, we remain cautious and vigilant as we aim to successfully navigate the coming months. With that said, we continue to expect revenue to be in the range of $14 million to $16 million in 2022. We realize the opportunity in front of us is significant, and we remain focused on thoughtfully deploying capital to develop the market for a first-of-its-kind technology that is opening new avenues of investigation into biology across a range of applications. At this point, I would like to turn the call back to Omid for closing comments.\n\nOmid Farokhzad -- Chairman, Chief Executive Officer, and Founder\n\nThanks, David. We're at a pivotal time in proteomics. It is inspiring to support our customers as they generate data that is redefining what's possible in deep proteomics, enabling first-of-their-kind studies and opening up a new gateway to the proteome. I have never been more excited about the opportunities that lie ahead of us.\n\nWith that, we will now open it up to questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Derik De Bruin, with Bank of America. Your line is open.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nHey, good afternoon. Thank you for taking my call. So a couple of questions. Just wondering, from your customers that have been doing experiments, what's sort of like the reorder time? Meaning, when they do an experiment and then they come back to do the next iteration of it, I'm just curious what's the time lag.\n\nHow quick are the iterations in the experiment going on? Is there a lag as people are doing more data analysis? Is it taking more data analysis? Just give me a sense on what the turnaround time is between experiments.\n\nOmid Farokhzad -- Chairman, Chief Executive Officer, and Founder\n\nSure. Omid here. So I think that depends on the customer type. As you remember, the number of customers are relatively small.\n\nSo the point I'm going to make, it may change over time. So typically, a customer gets the Proteograph, runs a relatively small study, maybe in the tens of samples, to understand the platform, the way it operates. That data set then prompts them to get the resources to run a larger sample. It may be in the tune of many tens of samples or hundreds of samples.\n\nAnd then those samples get run and then the data analysis part of it that follows before they kind of build on. I would say a case in hand would be if you look at the way Oregon Health, for example, played out. They were the first customer to receive the instrument. They ran a relatively small, in the 10s of sample size, study that they then presented that at a conference.\n\nThat formed the basis for them to secure the resources, which, by the way, is not just funding, it's also access to samples, because these sites are -- they don't necessarily have the number of samples, as you can imagine, ready to go. So they secured the funding and the sample to then run about a 1,000-sample study. That study took approximately just a little bit north of a quarter to complete and now they're in the data analysis part of it. So I would say that's probably representative of a robust customer if you can think about it.\n\nNow there are customers that are even more aggressive than that, if you would. A customer like PrognomIQ, obviously, knows the technology well. They hit the ground running with a large number of samples, and those study sizes have only grown and my expectation is they will continue to grow. The other point I would make there related to it is it's also a function of external data being presented.\n\nI think that's going to facilitate this for these customers to be able to access resources and also the samples to run. Progressively, we're seeing customers present data. So if you look at the most recent ASMS conference, 17 posters got presented: 10 of them were from Seer; four from PrognomIQ; two from Evotec; one from Cornell. Of that 17, there were four talks: two from PrognomIQ, one from Seer; one from Evotec.\n\nWe're increasingly seeing customer presentations and customer data that's going to then pave the road for larger and larger studies to get done at a sharper slope.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nGot it. So just a couple of ones here. So is that $1.1 million run rate in PrognomiIQ, is that a good sort of, like, number to use going forward for the next couple of quarters? Or are you expecting to see them scale higher?\n\nDavid Horn -- Chief Financial Officer\n\nDerik, it's David. PrognomIQ, if you look over time, what that related-party revenue is, and you're right, that is all PrognomIQ, it's been fairly consistent. We do think, certainly our anticipation that it will continue. But again, it really depends on PrognomIQ and if at some point they decide to pause and do another, setup for another study or what.\n\nBut we do have some visibility that it will continue at least in the short term. And again, it's something where we hope over time that that will continue to trend down a little bit just as an overall percentage of revenue as our non-PrognomIQ customer base grows. So that's -- again, it's been a strong pull-through from PrognomIQ, certainly. I would also caution you, Derik, that they're not like a typical customer, if you will.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Understood. So while I have you, what were the number of units sold in the quarter?\n\nDavid Horn -- Chief Financial Officer\n\nWe're not going to give the quarterly units, Derik, as you know. We will give you kind of where we sit at the end of the year, as we gave you at the end of last year. But again, we feel good with where we are to being on pace for that.\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from Tejas Savant, with Morgan Stanley. Your line is open.\n\nNeel Ram -- Morgan Stanley -- Analyst\n\nHi, this is Neel on for Tejas. Congrats on the launch of your your protegenomics workflow. Any color you can provide us what the early customer feedback and how you may anticipate this release to influence potential purchasing decisions or possibly pull forward some decision-making on the academic side, giving you longer sales cycles?\n\nOmid Farokhzad -- Chairman, Chief Executive Officer, and Founder\n\nI'm sorry. Can you, if you don't mind, just repeat your question one more time for me?\n\nNeel Ram -- Morgan Stanley -- Analyst\n\nSure. Just wanted to know about any early feedback on PAS 2.0 and how you anticipate it influencing sales cycles or potentially pulling forward purchasing decisions.\n\nOmid Farokhzad -- Chairman, Chief Executive Officer, and Founder\n\nSure. Let me maybe answer the first half of it, which is what the PAS is and the feedback that we're getting, and then its implication maybe on the commercial. I might ask Omead to also provide an input on that. So first of all, the PAS programs really enable for the user to access proteogenomic content.\n\nSo it gives them the workflow that lets them get peptide-level information and match it against genomic data to identify sample-specific variants of peptides that's obviously a mechanism to identify variants of protein. And then these variants would not be present in canonical reference databases. So these are really new content that the PAS enables for the customer to get. And it's very easy to use.\n\nSo this all gets presented in an interactive table plot. Visualization is very easy. It gives information in terms of where the peptide is in relation to its gene structure, the peptide domain, the functional regions. So it really kind of makes it very easy for the customer to be able to connect genomic information and functionalizing it at the protein variant level of information, at peptide- and amino acid-level resolution, at a scale that was previously not possible.\n\nAnd the customers find this really compelling. Omead, do you want to maybe comment on implication on the commercial side from a customer perspective?\n\nOmead Ostadan -- President\n\nSure. We don't really see PAS 2.0 directly impacting our revenue for the balance of this year; in particular, because it was already -- it's currently included as a part of the overall Proteograph Product Suite offering. So for this year, we don't expect it to have any material impact. Suffice it to say, as more of these self-analysis tools come out, it makes the overall workflow simpler and more intuitive.\n\nAnd over the course of time, we would expect that is going to have a positive impact in both adoption and the rate at which customers can not only execute experiments but extract useful information out of it.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Dan Brennan, with Cowen. Your line is open.\n\nKyle Boucher -- Cowen and Company -- Analyst\n\nHi, good afternoon. This is Kyle on for Dan. Thanks for taking my questions. I wanted to sort of jump into the sales funnel here.\n\nIn a slowing economy, have you noticed any delays or push-outs of any customer purchases to date? And maybe after this, can you give us a sense for your confidence about getting to around 35 box placements this year? Thank you.\n\nOmead Ostadan -- President\n\nSo let me start on the first part of it. I mean, in terms of pushbacks or delays on the parts of the customers, I think overall, I would say, obviously, you've seen numbers for the first two quarters of the year. We've managed to execute, I would say, really well. Now that is in the face of just some real factors out there in terms of COVID, particularly in terms of the lockdown and the impact that has had in China, as well as macroeconomic issues that have played a role certainly, I would say, ex-U.S.\n\nmore, but I think increasingly inside the U.S. I wouldn't say we have seen any material pushback in terms of purchasing decisions. But suffice it to say, these sales cycles are taking a lot of required focus on our part to make sure we execute on time. So, so far, we've managed to actually execute through those headwinds, I would say, quite well.\n\nAnd in terms of the boxes, I'll turn that over to David just so that he reiterate it. I think maybe perhaps reiterating what he was saying, that we're going to provide our number retrospectively at the end of the year, but we feel good about the overall plan that we laid out at the beginning of the year. David, do you want to comment on this any more?\n\nDavid Horn -- Chief Financial Officer\n\nNo, I think that's right, Kyle. Again, I think we feel good about where we are. But again, we're not going to provide any detail until probably the -- well, it will be the year-end call in February. So stay tuned.\n\nKyle Boucher -- Cowen and Company -- Analyst\n\nGreat. Thank you. And then just one more on sort of the publication side. Can you just remind us what the big key publications we should be looking out for? And are you viewing these sort of incremental validation of the platform? Or could they be meaningful drivers to adoption?\n\nOmid Farokhzad -- Chairman, Chief Executive Officer, and Founder\n\nGot it. Kyle, Omid here. Look, we're seeing both an acceleration in the pace of presentations and publications both in terms of breadth of topics and also the number of presenting customers, right? So if you look at ASMS, for example, the number of posters, talks being presented by number of different customers, quite different than a quarter ago or two quarters ago. And I actually think that slope will continue to increase.\n\nAs we head into the second half of 2022, we have another robust conference season, a number of presentations forthcoming at the American Society of Biochemistry and Molecular Biology, at the International Society of Mass Spec, at the ASAG, at the iHUPO. And you'll see talks, presentation from both Seer and Seer customers. Now similarly, publications are going to continue to increase as well. So as mentioned before, there should be a sea of publications coming in 2022.\n\nSo I expect that to be out in the second half of the year. Similarly, we're now seeing at least a handful of customers with manuscripts that are now in preparation that are going to be submitted, and I expect a number of those manuscripts to be submitted in the second half of the year. So while I consider what's happening today in terms of both the pace and the quality to already be quite high and the insight that's gaining to be quite robust, I think that slope is just going to continue to be sharp in the upward direction, and I don't expect any slowing of that.\n\nKyle Boucher -- Cowen and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nAnd I'm not showing any further [Inaudible]. I would like to turn the call back over to our host for any remarks.\n\nDavid Horn -- Chief Financial Officer\n\nThanks, everyone. Appreciate you taking the time today, and look forward to being in touch.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCarrie Mendivil -- Investor Relations\n\nOmid Farokhzad -- Chairman, Chief Executive Officer, and Founder\n\nDavid Horn -- Chief Financial Officer\n\nDerik De Bruin -- Bank of America Merrill Lynch -- Analyst\n\nNeel Ram -- Morgan Stanley -- Analyst\n\nOmead Ostadan -- President\n\nKyle Boucher -- Cowen and Company -- Analyst\n\nMore SEER analysis\n\nAll earnings call transcripts"
}