{
  "companyName": "Ichor Holdings Ordinary Shares",
  "companyTicker": "ICHR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/ichor-holdings-ordinary-shares-ichr-q2-2022-earnin/",
  "content": "Ichor Holdings Ordinary Shares (ICHR -1.18%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to Ichor's second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. Later, we will conduct a question-and-answer session and instructions [Audio gap] [Operator instructions] As a reminder, this conference is being recorded. I would now like to introduce your host for today's conference, Claire McAdams, investor relations for Ichor.\n\nPlease go ahead.\n\nClaire McAdams -- Investor Relations\n\nThank you, Devin. Good afternoon, and thank you for joining today's second quarter 2022 conference call. As you read our earnings press release and you listen to this conference call, please recognize that both contain forward-looking statements within the meaning of the federal securities laws. These forward-looking statements are subject to a number of risks and uncertainties, many of which are beyond our control and which could cause actual results to differ materially from such statements.\n\nThese risks and uncertainties include those spelled out in our earnings press release, those described in our annual report on Form 10-K for fiscal 2021, and those described in subsequent filings with the SEC. You should consider all forward-looking statements in light of those and other risks and uncertainties. Additionally, we will be providing certain non-GAAP financial measures during this conference call. Our earnings press release and the financial supplement posted to our IR website today, each provide a reconciliation of these non-GAAP financial measures to their most comparable GAAP financial measures.\n\nOn the call with me today are Jeff Andreson, our CEO; and Larry Sparks, our CFO. Jeff will begin with an update on our business and a review of our results and outlook, and then Larry will provide additional details of our second-quarter results and third-quarter guidance. After the prepared remarks, we will open the line for questions. I'll now turn over the call to Jeff Andreson.\n\nJeff?\n\nJeff Andreson -- Chief Executive Officer\n\nThank you, Claire, and welcome to our Q2 earnings call. Q2 revenues were $330 million at the upper end of our guidance range and were up 12% from the first quarter. After several quarters of supply chain challenges that limited the industry's availability of components and appreciably constrained our output, we were pleased to see several areas of improvement in Q2. These improvements, along with strong operational execution and improving factory efficiencies enabled us to achieve record output and very strong financial results.\n\nAs expected, we saw gross margins bounce back to 17%. With the higher revenue volumes now absorbing the investments we have been making to increase capacity across our footprint. These investments include adding to our manufacturing head count, as well as our physical capacity. Given the head count we have in place today and the sequential growth we see the remainder of the year, we expect to deliver continued gross margin expansion at these revenue levels.\n\nWith continued close management of operating expenses, we exceeded the upper end of our profitability targets and reported earnings of $0.98 per share. We completed our clean room expansion in Austin during Q2, and we have enough brick-and-mortar in place in our weldment business to support the next several years. Selective expansions of capacity for strategic growth areas continue important, as well as in our machining business in Minnesota and Mexico all in support of a $425 million level of capacity per quarter. Compared to a quarter ago, concerns about the sustainability of these unprecedented levels of wafer fab equipment spending have increased.\n\nA number of reports since our last call have indicated a slowdown in consumer-driven segments of the semiconductor industry, declining memory prices, and an inventory correction, all ahead of an expected recession. Therefore, as a management team, we must balance managing the near-term business outlook, while ensuring that we are investing for the future. We are working in lockstep with our customers to plan delivery schedules, optimize the supply chain and meet their end customers' demand. While we are all focused on the long-term demand signals that will impact our outlook for the next two to three years, given our current visibility, we expect to continue to achieve sequential revenue growth in the third quarter and through the forthcoming quarters as well.\n\nDespite the supply chain improvements and higher factory output levels achieved in the second quarter, customer demand continues to outpace supply, and we expect the unmet demand will continue to carry over into the forthcoming quarters until the supply chain catches up with demand. Industry forecast recently tempered expectations for WFE growth in 2022 to now about 9% or 10% growth over 2021. As a result of the limitations within the supply chain. Now that our output levels have picked up considerably and given the continued increases in output expected in both Q3 and Q4 of this year, we are well on track toward achieving our growth objective established earlier in the year of around 20% revenue growth for 2022.\n\nRevenue growth for Ichor approaching 20% this year would reflect faster growth compared to overall WFE. Given the relatively strong performance of etch deposition and EUV throughout this year, as well as the addition of IMG. I'm very pleased with the performance and growth trajectory of our IMG acquisition. They are seeing growth across their customer base, which includes semi, defense, and aviation, including commercial space.\n\nWe now expect IMG to contribute between $75 million and $80 million of revenue for the full year. As I mentioned, as we look ahead to 2023, we are working in lockstep with our customers in planning delivery schedules through the next several quarters. Visibility continues to extend much further than historical cycles, Lead times remain elongated. And even with looming recessionary concerns, the majority of wafer fab equipment purchases are considered critical investments in technology and capacity and so far.\n\nWhile there are some delivery schedule adjustments to align the supply chain. At this time, we are not seeing any pushouts of demand. Therefore, even though we have not experienced any changes in customer demand so far, we have a variable operating model and can quickly adjust. Should we begin to see any softening in demand or delays in our customers' delivery schedules, we have a number of levers.\n\nWe can utilize to adjust to any changes in volume, and we have a strong track record of managing the company profitability through periods of lower revenues. In the meantime, we continue to focus on investing in strategic and gross margin-accretive capacity additions and close partnership with our customers in order to expand our share of our served markets, demonstrate strong operational leverage and make continued progress toward our long-term profitability objectives. Now, I'll provide a brief update on the progress on some of the new products and in particular, the next-generation gas panel and chemical delivery systems. For our next-generation gas panel, we are still in the qualification phase for our first evaluation unit that shipped to a new customer.\n\nWe had planned to ship our second beta unit by midyear, and now expect to ship it by the end of August. This unit is shipping to an existing customer for a new application that is expected to outgrow the WFE market over the next several years. As a reminder, both of these gas panel beta units are fully configured with Ichor content. We would expect both of these evaluations to extend up to a year.\n\nWe remain confident and highly encouraged by the progress we are making with our customers for these proprietary gas delivery systems. In our chemical delivery business, the two evaluations remain underway with a North American customer. We continue to work with this customer as we move through the evaluation phases for both programs. As we said on the last call, these evaluations are expected to compete -- completed in early 2023.\n\nIn summary, in a very challenging operating environment, the operations team did a very good job of maximizing output to address the customer demand we are experiencing. With our current visibility, we are expecting to report sequential growth in record-setting revenues for the forthcoming quarters. For the full year, we are well on track to deliver on our objective to outperform industry growth and deliver record results for both revenue and earnings per share. And with that, I'll now turn the call over to Larry.\n\nLarry?\n\nLarry Sparks -- Chief Financial Officer\n\nThanks, Jeff. First, I would like to remind you that the P&L metrics discussed today are non-GAAP measures. These measures exclude the impact of share-based compensation expense, amortization of acquired intangible assets, nonrecurring charges, and discrete tax items and adjustments. There is a very helpful schedule summarizing our GAAP and non-GAAP financial results, including the individual line items for non-GAAP operating expenses, such as R&D and SG&A, in the Investors section of our website for reference during this conference call.\n\nSecond-quarter revenues were a record $330 million, up 12% from Q1 and 17% higher than Q2 of last year. Revenues increased in every business segment and with every key customer, both sequentially and year over year. With revenues at the upper end of expectations, gross margin of 17% also reflects the higher end of our guidance and a 100-basis-point improvement over Q1. Q2 operating expenses were $22.9 million, in line with our forecast and up about 2% from Q1.\n\nThe resulting operating margin was 10%, up 160 basis points from Q1. Interest expense was $2.1 million, largely as a result of higher interest rates and the increase was partially offset by positive foreign exchange adjustments as a result of the strengthening U.S. dollar. The total interest and other expense was $1.5 million.\n\nOur tax rate was 10% for the quarter, lower than forecast, which drove upside in earnings per share above the high end of our guidance range. The resulting earnings per share was $0.98 for Q2, $0.04 above the high end of the guidance range. Now, I will turn to the balance sheet. As expected, cash conversion of working capital improved in the second quarter compared to Q1.\n\nInventory turns were flat quarter over quarter and receivables DSO improved four days to 44. We generated $9.4 million in cash flow from operations. With $11 million of capex in the quarter, free cash flow was slightly negative. We increased borrowings on our revolver and the net increase in total debt was about the same as the net increase in total cash at $13 million and $12 million, respectively.\n\nGoing forward, we expect strong free cash flow generation given the revenue forecast, along with the working capital investments we've made year to date. Now, I will turn to our third quarter guidance. With revenue guidance in the range of $320 million to $360 million, our Q3 earnings guidance is $0.85 to $1.11 per share. At the midpoint of $340 million in revenue, which is up 3% sequentially and up 29% year over year, we are expecting gross margin improvement of about 30 basis points compared to Q2.\n\nOur Q3 operating expenses are expected to be approximately $500,000 higher than Q2, consistent with prior expectations that our quarterly opex run rate would be moving up a bit with incremental investments in R&D, audit, and IT. We expect our interest expense will be approximately $3 million in the third quarter, reflecting the recently announced increases in interest rates. Our tax rate in Q3 is expected to be in the range of 11% to 12%, and we estimate our fully diluted share count to be approximately 29.1 million. Finally, we continue to expect capex to be around 3% of revenues for 2022, which reflects the higher levels of investments required to support our machining business.\n\nWe expect to deliver improving free cash flow performance as we move through 2022. Operator, we are ready to take questions. Please open the line.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] One moment please while we poll for questions. Our first question comes from the line of Tom Diffely with D.A.\n\nDavidson. Please proceed with your question.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nOK. Thank you. I appreciate the chance to ask a question today. So, Larry, maybe first on the guidance.\n\nSo, obviously, revenue up 3% or so, quarter-over-quarter EPS flat. It looks like that's a combination of slightly higher expenses and a slightly higher tax rate are those the main drivers?\n\nLarry Sparks -- Chief Financial Officer\n\nThat and also the interest expense is up approximately $900,000 quarter to quarter.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nOK. And then what's driving the increase in the margin itself? Is that mix? Or is it efficiencies?\n\nLarry Sparks -- Chief Financial Officer\n\nThere's a little bit of efficiency there, a little bit of volume, and also our mix as we continue to drive machining revenue higher.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nGreat. OK. And then, Jeff, maybe just a clarification first. You gave guidance for hitting the 20% to bogey for this year's revenue growth ahead of the industry.\n\nDoes that include the IMG $75 million to $80 million? Or is that excluding that?\n\nJeff Andreson -- Chief Executive Officer\n\nThat includes it. And yeah, so -- you know, I mean, obviously, we're dealing in a constrained environment and stuff. So, I think those results are actually pretty good. But yes, IMG, we're really happy with what's going on there, and they've -- they're kind of at the upper end of our expectations now of what we said kind of going into the year --\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nAre there particular capacity constraints there?\n\nJeff Andreson -- Chief Executive Officer\n\nNo, we're doing pretty well there. I think we have some more capacity to get there. We've added some capacity also in there as part of our investments this year as well.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nGreat. And then as my final question, when you look at the beta system shipping here in August, or later in August. Does that system reflect kind of the full Ichor content over time? Or will it continue to rise as you add developed individual components?\n\nJeff Andreson -- Chief Executive Officer\n\nYeah. That particular -- the first two have about as much components as we're going to drive to. And most of the -- I'll call it, the higher IP value-added parts or things that we've designed in flow control valves seems like that the blocks.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nGreat. OK. That's nice to hear. And you said it was going to take about one year, you thought, for the beta sites to care of the volumes.\n\nJeff Andreson -- Chief Executive Officer\n\nAs you know, you put them on a lab tool and they've got to run for up to a year as long as they need to run across different processes and things like that, and we'll keep you up to date as we progress through those.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nGreat. Thank you very much.\n\nJeff Andreson -- Chief Executive Officer\n\nThanks, Tom.\n\nOperator\n\nThank you. Our next question comes from the line of Patrick Ho with Stifel. Please proceed with your question.\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nThank you very much, and nice work on the good quarter. Jeff, maybe first off, in terms of some of the moving pieces in the demand environment, as well as supply constraints. Would you -- I know you said in the prepared remarks that it's the supply constraints that are eliminating deliveries. From your perspective and from your angle at Ichor, how much do you believe supply constraints are limiting you in terms of potential revenue output that you can't do in 2022 because of the supply constraints?\n\nJeff Andreson -- Chief Executive Officer\n\nWell, I mean, we haven't actually put a number on it, but it's a large enough number that it's going to take us a few more quarters of supply increasing. I think the supply constraints have kind of greatly narrowed down to kind of, I'll call it, electronic components largely. We still are fighting some of those types of things. But I haven't really put a number on it other than to say that I think we'll be pretty close by year-end if we continue sequential growth.\n\nThat's barring no significant changes that we see today. We're not expecting anything as we look at it today, but as the world is a little different now. But anyway, so it may take into the first quarter of next year, all depends on how quickly some of these other suppliers go.\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nGreat. That's helpful. And maybe as my follow-up question for Larry, in terms of the supply constraints and the moving pieces with gross margins, what would be the biggest variables or the biggest impact for continued improvement through the rest of this year? Is it simply the efficiencies really coming into play? Or are there absorption benefits? What's going to be the biggest influence to potential gains through the rest of this year?\n\nLarry Sparks -- Chief Financial Officer\n\nI think it's a combination of volume efficiencies and leverage. We should see that as we continue to go, as Jeff mentioned, through the coming quarters. And also, I think the logistics costs, which are probably the largest, you can call it COVID, you can call it supply chain related I'd say that looks like it's getting a little bit better. So, I think when we look at where we are today and kind of the outlook and some of the comments because also with the supply chain issues, we do a lot of expediting, some of which we can recover with our customers, but some of it's we share.\n\nSo, I'd say those are probably the largest components of what we see as an improvement, along with our continuing to drive the components and machining business higher.\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you very much.\n\nLarry Sparks -- Chief Financial Officer\n\nThanks, Patrick.\n\nOperator\n\nThank you. Our next question comes from the line of Trevor Janoskie with Needham. Please proceed with your question.\n\nTrevor Janoskie -- Needham and Company -- Analyst\n\nYeah. Hey, guys, this is Trevor Janoskie on for Quinn Bolton. I wanted to clarify the outlook for the sequential growth in the coming quarters. Did you mean fourth quarter greater than third quarter and first greater than fourth? How far out does that -- does that comment extend?\n\nJeff Andreson -- Chief Executive Officer\n\nWell, I'll give you our view as we look at it here today, but we're seeing sequential growth through the end of the year. 2023, obviously, there's a lot of news out there right now. But as we look now, that is -- they have some sequential growth. I wouldn't say there's a big step function in there anywhere, but we're seeing sequential growth and outlook in our outlook.\n\nTrevor Janoskie -- Needham and Company -- Analyst\n\nOK. Thank you. And as my second question, I'm wondering if recent conversations point toward your customers becoming more cautious with respect to the current memory spending outlook.\n\nJeff Andreson -- Chief Executive Officer\n\nI think the way you think about the memory spending outlook is that, yes, there's some caution there, but there's also a lot of this unmet demand is in other segments. And so, as we kind of look at it, there's a little bit of softening in memory. And obviously, we listened to the Micron call today and everybody on this call, I'm sure, has too. So, we know that some of the DRAM pricing in memory is clearly softening.\n\nBut there's strength in other areas. And as we kind of said in our prepared remarks, a lot of this is being driven by both incremental demand in foundry and logic, which is just remaining very, very strong as they kind of migrate down the node to node. And you're seeing increases in the total amount of equipment they need to put out the same wafer. So, there's still a lot of things moving, way too early to tell you about 2023 much other than my prior comments to the outlook that I just mentioned.\n\nSo, I think through this year, we'll see sequential growth right now. We believe that Q1 will be larger than Q4, but things can change between now and then. So, I'm not ready to guide all of 2023's outlook.\n\nTrevor Janoskie -- Needham and Company -- Analyst\n\nOK. Very helpful. Thank you.\n\nJeff Andreson -- Chief Executive Officer\n\nYeah. Thanks for everything.\n\nOperator\n\nThank you. Our next question comes from the line of Krish Sankar with Cowen. Please proceed with your question.\n\nRobert Mertens -- Cowen and Company -- Analyst\n\nHi. This is Robert Mertens on behalf of Krish. Thanks for taking my questions. I guess just first, could you provide an update on the IMG business? Did you mention what the contribution was in the quarter? I'm just trying to break out away from the 70- to 84-year in comment.\n\nJeff Andreson -- Chief Executive Officer\n\nNo. What I did mention was that we thought the revenue would be kind of in the $75 million to $80 million range now, which is in the upper half of what we thought entering the year. We haven't talked specifically about breaking out that specifically from a profitability, but you can assume it's about the same as we talked about in our machining business. So, which is kind of high 30s to low 40s depending on the product and the mix and all that stuff.\n\nRobert Mertens -- Cowen and Company -- Analyst\n\nOK. That's helpful. And then just in terms of the margins, the target getting back toward the 18% sort of exiting that year, is that still sort of how you're thinking about it?\n\nJeff Andreson -- Chief Executive Officer\n\nWell, obviously, that's what we're driving to. I think when you look at a lot of what we see as the unfulfilled demand that is in the gas integration space. And so, those carry kind of lower margins. So, mix will have an impact.\n\nIf we kind of see our revenue continue to grow, as Larry alluded to, on the machining business, we could get there. But I think at this point, it might be a bit of a stretch given just some of the constraints we see. And as they improve, we're just going to catch up on the gas pox. So, the mix might hurt us a little bit.\n\nBut it's not out of the question.\n\nRobert Mertens -- Cowen and Company -- Analyst\n\nOK. That's helpful. Thank you. I appreciate it.\n\nJeff Andreson -- Chief Executive Officer\n\nThanks for everything, Robert.\n\nOperator\n\nThank you. Our next question is a follow-up question from the line of Tom Diffely. Please proceed with your question.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nYes. Thank you. So, Jeff, a quick question. If memory does slow and demand shifts from memory to logic next year, I assume your combination of inventory and capacity are pretty fungible, but I wanted to double-check.\n\nSo, that was indeed the case.\n\nJeff Andreson -- Chief Executive Officer\n\nYeah. It's absolutely fungible -- depending. Obviously, every site can support at all out of each one of the big areas. I would say, Singapore has got kind of a larger, what I would call, etch component than some of the other sites, but I think it's largely all fungible.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nOK. And then finally, when you look at the CHIPS Act, is there any direct assistance to you? Or is it going to be indirect through your customers?\n\nJeff Andreson -- Chief Executive Officer\n\nWell, you know, that's a good question. I haven't dug through the specifics of what might be available to us. We'll be doing that now that it's been signed and past. I think that in general, you'll see a bit of a tailwind, how big it will be and over how many years, I don't know, but I think it's just additive to what we're seeing today.\n\nSo, it's a good step forward and it's not going to have any negative impact on us. Either way, we're going to end up some favorable tailwind out of that.\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nOK. Thank you, and congrats on the continued growth in the quarters ahead.\n\nJeff Andreson -- Chief Executive Officer\n\nThanks. Appreciate it, Tom.\n\nOperator\n\nThank you. Our next question is from the line of Michael Mani with B. Riley. Please proceed with your question.\n\nMichael Mani -- B. Riley Securities -- Analyst\n\nHi. This is Michael Mani on for Craig Ellis. Thanks for letting us ask a question. My question is on your capacity increases in the next couple of quarters.\n\nSo, I know I think you mentioned that you were targeting $425 million a quarter in terms of capacity. Could you just walk us through when you expect timing around that goal? And maybe what milestones are needed to get there in terms of -- with all our facilities in Mexico and elsewhere? Thank you.\n\nJeff Andreson -- Chief Executive Officer\n\nYeah. I mean, I think that when you look at kind of the footprint, most of the brick-and-mortar plans are kind of in place. So, now it's about fit up and fill up. And so, those can be toggled with the outlook faster or slower.\n\nAnd that's how we kind of think about it. We want to look at the brick-and-mortar and make sure it's there. Great example is in the last downturn, we did a bunch of the facilitization of an incremental floor in our Singapore facility. And then as we needed it, we turned it on.\n\nSo, that's kind of how we approach our capacity add. So, to give you a specific time is probably middle of next year is probably as fast as we can move to get all of that in place, and it will be coming into place as we go along.\n\nOperator\n\nThere appear to be no further questions at this time. I'd like to turn the floor back over to Jeff Andreson for closing remarks.\n\nJeff Andreson -- Chief Executive Officer\n\nThank you for joining us on our call this quarter. I'd like to thank our employees, suppliers, and customers for their ongoing dedication and support as we continue to execute against this historically strong demand environment for our industry. Our upcoming investor activities include the D.A. Davidson Big Sky Summit on August 22, the Needham Virtual SemiCap Conference on August 25, and the Jefferies Annual Semiconductor Conference in Chicago on August 30th.\n\nWe also look forward to our next quarterly call scheduled for early November. Operator, that concludes our call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nClaire McAdams -- Investor Relations\n\nJeff Andreson -- Chief Executive Officer\n\nLarry Sparks -- Chief Financial Officer\n\nTom Diffely -- D.A. Davidson -- Analyst\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nTrevor Janoskie -- Needham and Company -- Analyst\n\nRobert Mertens -- Cowen and Company -- Analyst\n\nMichael Mani -- B. Riley Securities -- Analyst\n\nMore ICHR analysis\n\nAll earnings call transcripts"
}