{
  "companyName": "US Foods Holding",
  "companyTicker": "USFD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/us-foods-holding-usfd-q2-2022-earnings-call-transc/",
  "content": "US Foods Holding (USFD -0.64%)\nQ2 2022 Earnings Call\nAug 11, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the 2022 quarterly earnings call. Today's conference is being recorded. At this time, I would like to turn the conference over to Snehal Shah. Please go ahead, sir.\n\nSnehal Shah -- Senior Director, Investor Relations\n\nThank you, Tracy. Good morning, everyone, and welcome to US Foods' second quarter earnings call. Speaking on the call today, we have Andrew Iacobucci, interim chief executive officer; and Dirk Locascio, our chief financial officer. Additionally, Bob Dutkowsky, our executive chair, will join for our Q&A session.\n\nWe will take your questions after our prepared remarks conclude. Please provide your name, your firm and limit yourself to one question. Our earnings release issued earlier this morning and today's presentation slides can be accessed on the Investor Relations page of our website. During today's call, and unless otherwise stated, we're comparing our second quarter results to the same period in fiscal year 2021.\n\nIn addition to historical information, certain statements made during today's call are considered forward-looking statements. Please review the risk factors in our 2021 Form 10-K for a detailed discussion of these potential factors that could cause our actual results to differ materially from those anticipated in those statements. Lastly, during today's call, we will refer to certain non-GAAP financial measures. All reconciliations to the most comparable GAAP financial measures are included in the schedules on our earnings press release as well as in the appendices to the presentation slides posted on our website, except that we are not providing reconciliations to forward-looking non-GAAP financial measures as indicated therein.\n\nThank you for your interest in US Foods, and I will now turn the call over to Andrew.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nThanks, Snehal, and good morning, everyone. Thank you so much for joining our call. As I mentioned last quarter, my commitment as interim CEO is to continue the momentum coming out of our first quarter and to deliver on our long-range plan, which we introduced in February. Today, I'm pleased to report that US Foods continues to make progress against our plan and delivered strong earnings growth in the second quarter.\n\nLet's turn to Page 3, where you will find three key takeaways from the quarter. First, our Q2 results demonstrate good progress on executing our long-range plan. I'd like to thank our hard-working associates across the country for being a critical part of this progress and for continuing to serve our customers despite the challenges facing our industry. Second, US Foods continued its market share momentum from Q1, again delivering market share gains in key customer types.\n\nAnd third, our results further reinforce our confidence to deliver strong results despite the challenging macro environment affecting our industry. While US Foods and the industry as a whole continue to face headwinds related to inflation in food costs and fuel, as well as a challenging labor market, we remain well-positioned to win in this marketplace. On Page 4, you will see key highlights from the second quarter. First, net sales for the quarter grew at 15% year over year, and we saw continued gross profit per case strength, driven in large part by progress on our long-range plan initiatives that we will discuss momentarily.\n\nAs a result, adjusted EBITDA grew 11% on the quarter. On supply chain optimization, we continue to make significant strides as a result of the investments we are making in the business. We continued the implementation of new warehouse selection technology in our facilities, and we're on track to complete this in September. Additionally, freight income per case continues to gain momentum as our inbound logistics initiatives progress.\n\nLastly, we're driving month-over-month improvement in our service levels to customers, while operating in a very challenging and fairly stagnant vendor supply environment. Our customer service levels, although still just shy of pre-pandemic levels, have improved nearly 120 basis points through the start of the year. Moving on, we continue to invest in enhancing the customer experience. US Foods has led the industry for over 10 years in this area, and digital is paramount to our success.\n\nWe are launching our next-generation digital tool, which we call Moxi, which is all about increased speed, confidence, and control for our customers. This is a step change to the customer experience from performance and ease-of-use perspective. Moxi will begin rolling out in the third quarter, and we are excited to bring you more updates in the coming quarters. In Q2, we continued to expand our Chef'Store footprint, as well as assortment on our US Foods direct online marketplace.\n\nAnd last but not least, our team-based selling approach and value-added services continue to be differentiators and are helping us drive share gains in key customer types. A recent example is renewing our strategic partnership with Toast. This collaboration demonstrates our commitment to building deeper relationships with our customers by providing the right technology solutions to save time and improve the customer experience. Finally, I want to focus on the significant continued progress that we're making on environment, social and governance, or ESG.\n\nWe recently launched a partnership with Calera, one of the world's leading hydroponic indoor vertical farming companies, to expand our portfolio of local farms that we source from to support our served local program. Launched in 2018, the served local program is designed to better connect US Foods' customers with local farmers, producers, and manufacturers. Additionally, we remain committed to reducing the environmental footprint of our operations, and recently announced a science-based climate goal to reduce absolute Scope 1 and 2 greenhouse gas emissions by 32.5% by 2032 from a 2019 base year. We are working to reduce emissions by optimizing routing to reduce miles driven, deploying new lower carbon footprint vehicle technologies, and investing in alternative fuels.\n\nPlans include converting our compressed natural gas vehicles, or CNG, to renewable natural gas and introducing 42 new CNG vehicles to our fleet by the end of 2022. In addition, our California broadline distribution center fueling stations have been converted to providing renewable diesel fuel for our Vista, Corona, Livermore, and La Morada diesel fleet and our newly opened Sacramento facility leverages renewable diesel fuel at its on-site fueling station. We also plan to introduce 30 new electric trucks into our La Morada, California fleet by 2023. In our facilities, we continue to optimize the efficiency of our building operations by investing in renewable energy and adopting energy-efficient equipment and technologies.\n\nPage 5 illustrates why we believe US Foods is well-positioned in the current environment. It starts with our diversified customer mix. Specifically, while restaurants represent over half of our sales mix, we are very focused on other customer types such as healthcare and hospitality to continue to propel our business forward. Health care and hospitality were about a third of our business prior to the pandemic, and we would expect them to return closer to that level as these two customer types fully recover.\n\nWe are also driving market share gains in key customer types, independent restaurants continue to perform well and case volumes are well above 2019 levels. As you may recall, US Foods is relentlessly focused on growing with the right customers, leading to ongoing optimization of our customer mix to ensure we are gaining market share profitably. And as a result, we continue to exit a small number of lower margin and/or more complex primarily chain customers and typically replace that business with more profitable and more flexible IND, healthcare or hospitality business, as well as chain business that is a better fit and less complex. We are continuing to improve margins of our existing chain business to reflect the current operating environment.\n\nIn healthcare, we are pleased to report a positive trend in the case growth relative to 2019. This is a result of new business wins and improved bed occupancy rates in the senior living segment, as well as retail shops opening back up in hospital settings. In hospitality, we continue with significant year-over-year growth. Given the recent macro backdrop, we will be closely monitoring development in this customer type as the increased inflation levels and work-from-home trends impact customers' willingness to travel.\n\nAs a pure-play U.S.-only business, we are well-positioned to leverage our differentiated tools and capabilities to support the growth of our diverse customers. As I mentioned earlier, this differentiation has historically enabled us to win share in our key customer types and we expect it will continue to enable us to do so. Customers are telling us that they appreciate our service and commitment to helping them grow and to fight through these difficult times. To them, US Foods does much more than just deliver groceries.\n\nAdditionally, as a reminder, in rising inflationary periods such as these, US Foods is able to pass much of this inflation through via our contracts and pricing tools. Also, as the healthcare and hospitality customer types continue to return to 2019 normal levels, we will benefit from these tailwinds via top-line growth and supply chain efficiencies. And lastly, it's important to note that US Foods has a track record of resiliency during challenging economic times. For instance, during the recession of 2008, 2009, US Foods maintained essentially flat earnings and saw our case volume hold up reasonably well, declining only by mid-single digits.\n\nWith that, let's turn to Page 6 to walk through how our strong performance in the quarter translates into progress on our long-range plan to drive profitable share gains, expand margins and improve operational efficiencies. We are on track to meet or exceed our targeted growth rate of 1.5 times the market. We are continuing to win in the marketplace as demonstrated by our share gains in key customer types. As I noted earlier, the US Foods team-based selling approach continues to be a differentiator relative to our competition and is an important ingredient in our customers' success.\n\nThe continued expansion of our cash and carry business, Chef'Store, illustrates the power of our omnichannel strategy. During Q2, we opened a new store in Lynchburg, Virginia. We expect still to open four to six stores this year, and are building our capabilities to accelerate that pace in future years. This strategy allows our broadline customers to fill urgent needs between deliveries during the week to help meet demand.\n\nIt is also an excellent way for potential customers and consumers to get to know the outstanding lineup of US Foods' private label products and high-quality fresh offerings. Turning to the margin expansion or optimization pillar, we had strong gross profit results again this quarter. As we shared on our last call, we are seeing significant momentum with our inbound logistics program initiatives. This program continues to drive significant efficiencies and meaningful freight income expansion.\n\nAdditionally, US Foods continues to grow its exclusive brand penetration rate. For Q2, organic penetration grew by approximately 80 basis points versus the prior year. Our cost of goods program is also performing well and ahead of schedule, with approximately 25% of our total vendor spend already under consideration. Turning to operational efficiencies.\n\nWe are making solid progress in the midst of a very challenging macro environment. First, as a result of our continued focus on routing optimization and network planning, cases per mile across our network are modestly above 2019 levels despite case volume being down mid-single digits compared to 2019. While that is a significant achievement, we still have significant opportunity ahead. As I mentioned earlier, US Foods is on track with our warehouse selection technology rollout, which is expected to be completed later this quarter.\n\nI'm excited about this rollout as it will continue to support our warehouse team members and enhance the selection process, leading to better productivity and job satisfaction. Similarly, our outbound service levels to customers continue to deliver month-to-month improvement, which is a testament to the hard work of our associates, given the vendor fill rates remain challenged. It's important to note that the warehouse labor environment remains challenged for us and our industry. However, we are confident that we have the right plans in place to address turnover and associated productivity headwinds.\n\nOn Page 7, you will see a summary of our strategic imperatives as we enter the second half of 2022. We are encouraged by our LRP momentum, and we'll continue to update you on the performance of our 3 pillars of profitably growing market share, optimizing gross profit, and improving operational efficiency. We are and remain relentlessly focused on building upon our first-class customer service program and platform. We will continue to make investments in our business to provide an enhanced and differentiated service platform at US Foods.\n\nAnd finally, as we create value for our shareholders, we will remain prudent around our capital allocation priorities. Our focus continues to be investing in the business, reducing our leverage, returning cash to shareholders, and pursuing tuck-in M&A opportunities. We will continue to execute against these priorities and focus on driving long-term growth ahead, and thus, expect to create significant shareholder value. We've made strong progress against our plan to date, and expect to continue building on this momentum.\n\nAnd with that, I'll pass it over to Dirk to review the financial performance.\n\nDirk Locascio -- Chief Financial Officer\n\nThank you, Andrew, and good morning. I'll walk through some highlights on our second quarter and then spend time on several key macro considerations that continue to be a factor in our industry and the broader economy, as well as on our 2022 outlook. I'm on Page 9. Overall, we're very pleased with our second quarter financial results.\n\nThey demonstrate the continued progress we are making against our plan initiatives and outcomes. Adjusted EBITDA grew 11% from the prior year to $368 million for the quarter. In addition to strong EBITDA dollars, our adjusted EBITDA per case was above Q2 of 2019. Q2 adjusted EBITDA was the best quarter relative to 2019 since the pandemic began.\n\nSo we're very encouraged with the outcome, which we believe demonstrates the actions we're taking are truly delivering results. Adjusted diluted EPS increased as well, and was $0.67. Q2 net sales were $8.8 billion, which was an increase of 15% over prior year. Total case volume was flat to prior year and food cost inflation was 15%.\n\nOur Q2 year-over-year case growth was negatively impacted roughly 375 basis points by the mid-2021 exit of the grocery retail business, we temporarily added during a pandemic and a small number of strategic exits. As you'll recall, Q2 2021 was also the strongest quarter from a volume perspective since the pandemic began with a very strong recovery. I'll talk more about volume on the next page. We continue to drive robust gross profit dollar growth again this quarter.\n\nOur adjusted gross profit dollars increased 14% from the prior year, and we generated strong adjusted gross profit per case for the quarter. opex remained higher as we continue to invest in staffing and work on improving supply chain employee retention. Reducing turnover remains a top priority for us as we face the challenges higher turnover presents, similar to many other companies. Looking at Page 10.\n\nWithin volume, independent cases were flat to prior year after growing nearly 80% in the prior year. We had 35% hospitality growth and 2.4% healthcare growth, offset by 8.7% lower chain volume and the retail exit impact I noted earlier. Our chain decline was driven largely this quarter by a smaller number of lower profitability and more complex strategic exits. We expect volume to improve through half two.\n\nThe combination of the retail exit and the lower margin strategic exits was about a 375 basis point negative impact on total case growth and had a small impact on net EBITDA. We continue to focus on the health and quality of our customers and on the opportunistically growing with chains while increasing our margins. We delivered share gains again this quarter in key customer types. Specifically, for independent restaurants, Q2 share gains were among the strongest we've seen since the pandemic began, demonstrating we are winning in the market.\n\nI talked about volume compared to 2021. However, I know most of us continue to focus on volume relative to 2019 as well as a key anchor of a normal environment. Q2 2022 total case volume was approximately 6% below 2019, which is a more than 200 basis point improvement from Q1. Independent case growth was 4% above 2019.\n\nHealth care cases were about 7% below 2019, demonstrating continued improvement. And hospitality was approximately 15% below 2019, which also has further improved from Q1 results. We're continuing to improve relative to 2019, and are encouraged by the continued share gains in key customer types. On Page 11, through Q2 and as we look at half two, the macro environment remains challenging for our entire industry and our customers.\n\nStarting with labor. The labor market continues to be better than it was in 2021 from a recruitment perspective. In the second quarter, we continued to hire for expected volume growth. Our markets are broadly in a very good position when it comes to staffing.\n\nAs I talked about last quarter, the primary challenge remains retention, which is not unique to us. Turnover remains higher than it's been historically. For reference, our warehouse turnover is nearly double what it's been historically, and roughly half of that workforce has been with us for less than a year. New associates are significantly less productive than tenured associates.\n\nAnecdotally, our understanding is that our retention challenges are very similar to other companies. A positive is that it likely isn't permanent, and we are taking steps to address it, such as limiting hours work for new hires to allow them to ease into the job and retraining our frontline supply chain managers and supervisors on effective management and employee engagement practices and processes. As planned and as Andrew noted, we're finishing the deployment of our new warehouse selection technology and deploying processes, leveraging our continuous improvement team to make the jobs a little easier. With turnover remaining high, we aren't making as much progress on productivity improvements as we expected.\n\nHowever, we are focused and are seeing a number of signs of improvement throughout our network, some of which Andrew discussed earlier. Inflation, whether fuel or food, is something we are watching closely. Food cost inflation continued in the quarter with year-over-year inflation of 15%. Year-over-year inflation has slowed and sequential inflation continues to be below the peaks of mid-2021, which is a positive.\n\nInflation in Q2 has been more in the grocery categories and other categories, and we've continued to be successful in passing it through to customers. We don't expect the supply chain challenges that remain for our industry more broadly that they are likely to be resolved in the near term. We've made continued progress improving our service levels to customers through Q2 despite stagnating vendor service levels. Our Net Promoter Score data indicates our service levels continue to be as good or better than others as we continue to identify and act on ways to improve service for our customers.\n\nOverall, volumes remain solid. However, we will continue to watch for behavioral changes. Week-to-week results can vary, and we're watching for trends. Independent growth versus 2019 has continued to be 3% to 4% above 2019 in recent weeks.\n\nHealth care continues to slowly improve and has been roughly 6% below 2019 in recent weeks. Hospitality remains mid-teens below 2019 and has shown continued improvement in recent quarters. We are strategically taking share in key customer types and continue to watch the macro environment for changes in demand. The macro environment remains a challenge.\n\nHowever, our business and industry has recovery tailwinds from healthcare and hospitality, and we are seeing share gains in key customer types. We also benefit from serving many customer types and eating away from home as a staple in most people's routines, which makes it quite resilient, potentially even more than in prior downturns. We are pleased with the strength of our Q2 results and we expect to continue making meaningful progress and specifically on actions to improve the continued high turnover in supply chain. We're reaffirming our 2022 fiscal adjusted EBITDA, adjusted diluted EPS, capex, and net leverage guidance provided in February.\n\nHowever, we now expect higher interest expense to be $245 million to $255 million for the year as a result of the Fed's more aggressive interest rate increases through 2022. And finally, we still expect to achieve the higher end of the earnings outlook range, assuming there's not another Omicron-like wave or macro slowdown. I talked about our Q2 earnings, macro factors, and our outlook. Now on Page 12, I'll just spend a moment on our capital structure.\n\nWe reduced our net leverage compared to the second quarter of 2021 as well as the first quarter of this year. Our net leverage ratio was 4.2 times at the end of the second quarter, which is a 1.2 turn reduction from a year ago and 0.1 turn reduction from the first quarter of this year. Net debt dollars are relatively flat as we've continued to necessarily invest in working capital via increased receivables from inflation, as well as additional inventory due to the vendor supply challenges we and the industry continue to face. Leverage reduction is one of our four components we outlined as part of our capital allocation strategy Andrew noted earlier.\n\nWe continue to make progress toward our leverage goal of 2.5 times to three times net leverage, and are committed to achieving it. Our business has strong cash flow generation, which we expect to use for debt reduction in our other stated priorities. Just in closing, I'm pleased with the significant progress we're making, which we demonstrated in our Q2 results. Now back to Andrew.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nThanks, Dirk. In conclusion, US Foods continues to make progress in executing our long-range plan. Despite ongoing challenges in the macro environment, we continue to deliver positive results. This is a testament to the hard work of all our associates at US Foods, and I thank all of them for their continued focus on execution and dedication to serving our customers.\n\nWith that, operator, please open up the line for questions.\n\nOperator\n\nThank you, sir. [Operator instructions] We will now take our first question. Please go ahead, caller. Your line is open.\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nThis is Lauren Silberman from Credit Suisse. I wanted to ask about independent case growth. Volumes up 4% versus '19, I believe you said, which looks like an acceleration from 1Q. So can you talk about what's driving that underlying acceleration? How much is coming from new customer acquisition versus wallet share is where are you running with independent customer accounts versus '19? And then you mentioned, I think, case growth remains 3% to 4% above '19 in recent weeks.\n\nCan we assume you're not seeing any meaningful shift in customer behavior trends? Thank you.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYeah, Lauren. It's Andrew. Thanks for the question. I'll try and remember the parts to it.\n\nSo remind me if I miss any of them. Yes, I think overall, we feel very good about the momentum we're seeing in our independent restaurant growth. And I would say that the growth is being generated through, I'd say, a pretty balanced mix between increasing penetration with the existing customers, as well as going after new. We are still slightly down in terms of our customer count versus '19, but we are seeing a significant improvement in our share of wallet as we move forward.\n\nThat momentum and sort of the improvement, I think, you would attribute to really, given the market itself, has probably been largely flat from one to two. We've actually seen a pretty sizable, as Dirk mentioned, one of the best share improvements we've seen and certainly significantly better than we were in Q1 in terms of our market share in the I&D segment. So feeling, I think, really good about the momentum. We haven't seen, as Dirk mentioned, a meaningful change in behavior, although obviously, that is something we're monitoring very closely.\n\nBut the fact that we've been able to gain share in this environment also gives us some optimism that we will be able to mitigate the impact, if any, of any slowing of demand on the independent segment. Did I cover all your questions? Or was there any...\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nYeah. You did. You're great. If I could just ask one more.\n\nDoes that the long-term targets? I know a lot of uncertainty in the environment. Should we see a more challenging consumer environment? What gives you confidence in delivering on the longer-term guide or to what extent is sort of that macro uncertainty being factored in? Thank you.\n\nDirk Locascio -- Chief Financial Officer\n\nLauren, this is Dirk. So ultimately, I think the important thing to come back to is our focus in the plan, which is control the controllables, and we put a plan in place that we feel very good about. We're continuing to execute. Our last two quarters have really shown good progress against that.\n\nAnd I think that the thing that we've learned during COVID is you need to be agile, nimble or if you want to put it. And so as we see the environments adjust, we'll adjust accordingly, but we're continuing to execute against our plan and very pleased with the progress we're making.\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nThank you very much.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nIt's Ed Kelly at Wells Fargo. I just wanted to start with a quick follow-up on case volumes. Can you just provide a bit more color on the decision to exit some of the lower margin contract accounts? I mean, obviously, this has been part of your strategy in the past, so it's not new. But on the other hand, you still have -- you do have volumes below '19.\n\nI'm just kind of curious as to the calculus there. And then as we think about the back half, I think Dirk mentioned you expect case volume to improve. So I just want to make sure what you're saying there. Do you -- are you saying that you expect organic total case volume to be up in the back half?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nHi, Ed. It's Andrew. Why don't I start, and I'll ask Dirk to maybe weigh in on additional detail. As far as the case bowing picture, I think we do feel and have sort of approached things, as we always have, of saying we want to grow in the right way, which is a profitable case growth.\n\nAnd given the environment we are in, we've been working very closely with our customers, particularly the larger chain groups to ensure that we are -- we have arrangements that are reflective of the environment we're operating in. Our goal in all of those conversations is to continue to drive the business forward and work together. But where we aren't able to find an operating model and an arrangement with those customers, we have made the decision in a relatively small number of cases to exit. And that is something that we would do, but we would do it typically as a last resort.\n\nAs far as the back half, maybe I'll turn it to Dirk to talk a little bit about how we're thinking about that.\n\nDirk Locascio -- Chief Financial Officer\n\nSure. So Ed, we would expect to see continued improvement relative to 2019 from where we've been trending, assuming a stable macro environment and continuing to improve against that. I think the other point is we're very pleased with the strength of our independent volume and the continued share gains that Andrew talked about. On the chains and then a small number of education customers, this has been part of the plan.\n\nAnd so I think we've been deliberate. Of course, there is the retail business that we picked up during COVID that I talked about last quarter. So there should be no surprises on that. But on the chains and the education, I think on that one, our focus has been to be opportunistic on those who were the right fit from a financial and complexity perspective.\n\nAnd I think even as one of our competitors has talked about, and you see where they have dedicated chain facilities, they are breakeven. It really is one we're being opportunistic versus just growing for the sake of growing in a particular area is the right answer. And we're seeing that show up in higher EBITDA per case. We're seeing this show up in earnings growth and continued improvement there.\n\nSo we believe our strategy is the right one, and we're going to continue to focus on growing with independent healthcare and hospitality and then be very thoughtful and opportunistic on the other customer types.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you.\n\nDirk Locascio -- Chief Financial Officer\n\nThanks, Ed.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nHi. It's John Glass from Morgan Stanley. First, if I could just further more clarify in cases that I had a real question. Is this the last quarter you're going to be lapping the grocery exit so that shouldn't be a factor in the back half? And can you quantify what the impact of those chain restaurant exits? Because I assume that will impact future, four quarters or three quarters.\n\nSo just what's the quantum of that. And the question is what you're doing to reduce labor turnover, improve efficiency, I understand about training in hours and etc. But is there something more meaningful? I mean, your biggest competitor talked about going to a four-day work week, for example, is one way to do that. Are there bigger ideas that can really advance that turnover and efficiency and lifestyle to make this more attractive job that you're contemplating? Thanks.\n\nDirk Locascio -- Chief Financial Officer\n\nGood morning. I'll start with the first part, and then maybe Andrew can talk about the second part on retention or turnover. On that one, for the quarter, there will be some impact. It will be lesser in the third quarter from the retail exit, and then that will be the last quarter it's impacted.\n\nBut just for reference, out of the roughly 375 basis points impact in Q2, in order of magnitude, about two-thirds of that is the retail and about one-third of it is the chain exits. So that helps you size up the impact across there. I think the other thing to -- when you look at year over year, that's important, too, on the chains is if you go and you see we were kind of at the peak last year in Q2 with chains where we had onboarded some of the new customers, we hadn't yet exited some of the planned exits. So again, this is all sort of part of the plan, but hopefully, that's helpful on the go forward.\n\nAndrew, you want to talk about retention?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYeah. Sure. And I think, on the labor front, we feel good about our staffing situation. We are substantially staffed in almost all our markets at this point.\n\nAnd what continues to be the challenge, as Dirk mentioned, is our ability to stand the turnover type. We are aggressively exploring and implementing flexible shift lengths to allow our colleagues to be able to have a schedule that fits their needs. We've also taken some steps to significantly reduce shift lengths our new hires. We find that's typically where the greatest turnover comes from is from that group because it's a tough job, let's face it.\n\nAnd our ability to minimize those early shifts to get them -- allow them to sort of harden themselves to the work, I think, is helping a lot in that area. And then really importantly, because we all know that turnover is much a function of who you work for as anything else, we've taken some pretty aggressive steps to really invest in leadership training and development for our frontline leaders, our supervisors, and managers. They are really the critical linchpin in that relationship in markets where we've seen turnover in a better position that typically it's a direct result of that strong leadership. And so we've seen it's early days to really start to see significant results from that.\n\nBut we have seen some very promising signs coming out of that leadership training, and we expect that to continue.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nPeter Saleh -- BTIG -- Analyst\n\nGreat. Thanks. It's Peter Saleh from BTIG. A number of restaurants have talked about seasonality returning to the industry, something that they haven't had since 2019.\n\nAre you guys seeing that as well? Are you seeing seasonality? Did you feel like trends maybe slowed a little bit during the summer? And are you expecting that to kind of pick up and get back to normal seasonality as we head into the fall?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nHI. Pete. It's Andrew. Thanks for the question.\n\nI think we would say it's a little hard to tell given the volatility that still is out there. But overall, I think there is certainly a little bit more normalcy returning to the rhythm of our business, which I think is a positive sign. But again, I think right now, it's a little hard to declare it as a trend.\n\nPeter Saleh -- BTIG -- Analyst\n\nGreat. And then just on the food cost inflation, I know this quarter was 15%. I think that was a little bit a couple of hundred basis points less than what you saw in the first quarter. What are you anticipating in terms of food cost inflation in the back end of the year?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYeah. Thanks for the follow-up. I think we are -- it's obviously hard to predict where we expect things to go. I think we've certainly seen a slowing in the rate of increase, but we don't -- we certainly don't expect deflation anytime soon.\n\nBut we are watching it very carefully, not only from a cost of goods standpoint, but also in terms of the impact it's having on demand, and ultimately, our customers. So we have felt pretty good about, not only the ability of our organization to pass along that those inflation costs through the cost plus pricing that we typically have in our contracts, but we've also made really great strides working with our customers to help them manage through the inflationary environment, which is something that I think really has paid some big dividends as we continue to help them with ways to address some of their menu types to steer clear of more inflation impacted categories to look at portion sizing and other factors as well. And that's really something that, again, is really true to the brand of US Foods, something that we really are very proud of.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThank you very much.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nNicole Miller\n\nGood morning. This is Nicole Miller from Piper Sandler. Thank you for your time. The first question, you've addressed turnover.\n\nBut I was wondering to compare and contrast kind of the truck driver, DC selector, and also the salesperson tenure turnover. And the real question is, when they work in concert, when you're at your best in any one market locally or in terms of execution, what kind of wallet share gains can you achieve versus where you stand at average?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nHi, Nicole, it's Andrew. Thanks for that question for that excellent question. So I think your first question is how has turnover varied across a driver versus selector versus seller. And what I would say is we've seen very consistent turnover within our sellers, in fact, even a little bit less than usual we've seen in past years.\n\nDrivers has seen considerably less increase in turnover versus pre-pandemic levels. It's the selector area where we've seen, as I think Dirk mentioned, twice the turnover rates that we saw pre-pandemic. So that's really where the bulk of the -- when we talk about turnover, that's really the main place that we're seeing it. And your second question, which is a great one, around the relationship between the three.\n\nCertainly, the driver and seller relationship is an incredibly important one, because both have such a significant impact on our customer experience. And that's why I think seeing -- especially seeing the reduction in an already lower level of turnover in the driver community has been very positive. And one of the things we've actually started to do more intentionally is really creating a working relationship between the driver and the seller to ensure that any feedback that comes from either of them is pass along to the other, and that's actually really, I think, pretty significantly enhancing the relationship that they have with our customers as a consequence.\n\nNicole Miller\n\nThank you. And then just how would you characterize the inbound fill rates to you the outbound sell rates to your customers? And is there an opportunity to backhaul with your drivers?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYes. So we have seen continued improvement in our customer service level, which is the thing we're most concerned about. And what I think is most sort of positive in that trend is that we've been able to do so with vendor fill rates that have been largely flat relative to where they were to start the year. There's been a bit of an improvement, but not significant.\n\nAnd it's been, I think, a real achievement on the part of the replenishment organization to be able to drive that continued month-over-month improvement in our service level to our customers despite the fact that we are still seeing pretty poor service from an inbound. And the particular challenge there is that the nature of those fill rate challenges. It tends to change from day to day and week to week. It's not always the same categories and so a little bit of a moving target.\n\nBut generally speaking, I think we feel very good about the progress that we've made in handling that.\n\nDirk Locascio -- Chief Financial Officer\n\nTo your second part, just on the backhaul, we definitely -- we backhaul a meaningful portion of our inbound cases ourselves. And that, along with a number of the other initiatives we have going, are contributing to the very strong results we've seen in our inbound logistics or freight income year to date. But that remains a focus.\n\nNicole Miller\n\nAnd just the last one, deflation. I mean, it may sound silly now because it would require supply outstripping demand and really easing labor conditions, and none of that seems likely. But can you just remind us what happens like by type of contract? How does deflation flow through gross profit? How does it flow through opex, etc.?\n\nDirk Locascio -- Chief Financial Officer\n\nSure. So if it's a product deflation, it doesn't flow through opex as much versus it shows up and up in gross profit. And the portion of our customer contracts that are a fixed markup per case or per pound, etc., in that case, you're still making the same markup, so it doesn't impact profitability at all. If you see it in the portion of our contracts that are a percentage markup over, if you have deflation, it can decrease that profitability a little bit.\n\nWhat we see over time though, oftentimes is a lot of the center of the plate is fixed, which can be more volatile. So that means over time, that's can be a little volatile if it goes up or down, but over time is a meaningful impact. And then on the grocery, a lot of the over time, they tend to go one way from the ultimate manufacturers. So I think when we think through that, we are watching it closely, we have a playbook that we run for inflation and deflation to manage it.\n\nBut as we noted earlier, don't expect inflation to show up sort of broad scale in the near term.\n\nNicole Miller\n\nThank you.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nJohn Heinbockel, Guggenheim. So guys, let me start with drop size really focused on comparable restaurant locations, right, whether they be independent or chain. What are you seeing with drop size, right? I imagine it's up, right, because locations are down, I think. Is it up low to mid-single digit? And then obviously, that's probably two times the incremental margin.\n\nIs that a material benefit to the P&L now and kind of going forward, meaning, I don't know if it's tens of millions of dollars, but is it a material benefit as we sit here today?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nJohn, it's Andrew. You may have to repeat the second half of your question just to make sure I got it. But on the first half around drop side, I would say we are seeing a small increase in our drop size, as I think we've reported for the reason that you mentioned. Remind me the second half of your question.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nWell, because the incremental margin on that, right? It's not your gross margin. But it's got to be two times, 2.5 times normal margin. So that is a clear benefit to the P&L as we sit today, and do you think that will continue?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYes, definitely a clear benefit. We won't quantify the range of it, but it's certainly significant given the incremental cost of those additional cases or the marginal cost of those additional cases are relatively allow. As far as continuing, that's certainly an area, as I mentioned, our share gains, especially in the IND space, have been a pretty good mix of growing share of wallet and new. And we do expect that to continue.\n\nAnd certainly a big focus of the independent seller organization is to continue to grow our penetration with existing customers.\n\nDirk Locascio -- Chief Financial Officer\n\nJohn, just one other thing I would add. I think the other opportunity that still lies ahead is as you see volume continue to come back in healthcare and hospitality. A lot of that shows up with existing customers. And so that helps from a drop size perspective for those customers, which are already pretty attractive from the drop sizes they tend to have.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThe other thing I was going to ask, right, is what maybe makes this environment a little different in some respects than the past, right, is this tightness in labor? So if we get -- I don't think we're going to see deflation, right? But as we get this inflation, do you think either the timing lines up, right, the top line deflates at the same time that labor cost is easing or the environment creates, right, the macro environment creates an easing? Or do you have to kind of tee up some proactive cost outs in case the top line deflates and labor doesn't? How do you think about that?\n\nDirk Locascio -- Chief Financial Officer\n\nSure. I think they're kind of where you're going. There are two separate levers because the top line sort of is more automatic and you manage your way through it. I think the -- as I said, we would expect for the foreseeable future that, to your point, is essentially modest inflation and/or likely not deflation.\n\nI think that shows up a little quicker on the cost side. That is one where you have to be more proactive in the way you manage through that than you do on the GP side. What I'll come back to is what I talked about earlier, is through COVID, what we really learned is, again, the need to be agile. And as we see in that environment, on the product side, we have very good playbooks on how we're running in inflation and deflation.\n\nAnd then on the cost side, always are looking as to how to effectively manage that across the different spectrums of the cost.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nBut John, maybe just to address the question on labor tightens being a benefit. That certainly will be. I mean, one of the challenges that we face with the turnover levels that we are seeing right now is just the costs associated with the recruitment, hiring, and onboarding of those associates, as well as the impact that it has on productivity. So I think that will certainly be an important aspect if we do start to see some loosening in that labor environment.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nOK. Thank you.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nBrian Mullan, Deutsche Bank. Thank you. My question is on the strategic vendor management opportunity. I believe this is an important component of the long-term plan.\n\nMaybe could you just speak to what the organization is doing differently today versus how it managed this area of the business prior? And then just zoom in a bit. Just wonder if you could speak to your degree of confidence in this sitting here in August, maybe relative to how you felt earlier this year. How are the strategies progressing? Are your partners being receptive? Are you finding win-win situations in your negotiations? Just any color.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYeah. Thanks, Brian for the question. I think there's -- first of all, as I said in my remarks, we're feeling very good about the progression of that initiative. We're actually ahead of our schedule on that.\n\nAnd really, the opportunity there and what's maybe a little different today than perhaps in the past, a couple of things. First, we have had -- the volatility of the last couple of years made it difficult to sort of benchmark our cost of goods, as well as precisely as perhaps we've been able to in the past. And so I think this is really a large part is just going back and making sure that we are continuing to be in this competitive position as we can given our scale. And I think in terms of the confidence we feel today versus earlier this year or last, I think, has grown as a consequence of the really very productive nature of the conversations that we've had thus far.\n\nWe have found significant opportunities for mutual wins. I think just given the way the world is right now, there are some opportunities to work more closely together to find ways that will not only help us ultimately from a cost of goods standpoint, but also help our vendors from a production efficiency standpoint. And those are the conversations that have really yielded the greatest fruit thus far.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nThank you. And then just a follow-up, just a question on the permanent CEO search. Understanding there's only so much you can maybe say, just can you comment on how that's going, if the pool of candidates is starting to narrow down in any way? And then related, is there a priority or a preference to find someone from inside the food distribution industry? Or is that not a particular mandate of the board at this time?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nBob, do you want to take that?\n\nBob Dutkowsky -- Executive Chairman\n\nYeah. Good morning. It's Bob Dutkowsky. I think I'll try to take a shot at that.\n\nSo we're really pleased with the progress that we've made in terms of searching for the next CEO. We quickly formed a search committee, we built a spec that we believe can lead the company into the future, we hired a search firm, and started the process. We're really searching for a proven public company C-suite executive. It would be great if they had experience relative to US Foods, but a supply chain executive, for example, not in the food industry could be a very good candidate.\n\nWe're really searching for an executive that has a track record of creating shareholder value, and importantly, one that embraces the culture of US Foods. So we have a really good plan. We're well into the process. The search firm has identified a very strong list of candidates, and we've begun an interviewing process.\n\nSo we're really pleased with where we are with the process.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nHello. This is Jake Bartlett from Truist Securities. Thanks for taking my question. My first is on the chain business and the exit there.\n\nIt seems like very recently, last quarter, we were talking about onboarding chain business. And I'm wondering whether this is maybe an indication that the customers are now that the supply chain may be disruptions or less of an issue and the ability to service the customer is maybe more broadly able to be done, whether this is a sign of pushback on pricing or whether customers generally are feeling like they can now look around for better prices and whether that could be more of an impact as we go throughout the year.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYeah. Jake, thanks for the question. It's Andrew. First of all, I think it's important to say that our net new versus lost in chain is actually up slightly.\n\nSo I wouldn't necessarily characterize this as a net negative. And it certainly doesn't signal in any way a move away from the right kind of chain business, which is where we've seen the growth coming from chains that have more of a urban presence, as well as more of an independent restaurant-type offering have been proven to be very attractive customers and the ones that we are quite happily brought on board. And in addition, as I said, exit is the last resort. We've typically worked with them to find opportunities for the vast majority of our existing customers that has been the outcome.\n\nDirk Locascio -- Chief Financial Officer\n\nJust, Jake, if I could add. This is Dirk. So actually, the exits that we're talking about in chain are where they are part of the strategic exit plan. Our regrettable losses remain quite low across our customer types and continue to have a good pipeline there from a growth perspective.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nGreat. Thank you. And then just one on operating expenses. You mentioned that the training costs are still high over time and may be temporary workers.\n\nI'm wondering what kind of -- what level of cost in the second quarter here that are might not be worth recurring? Just trying to gauge what kind of a benefit we might have as we go forward from the elevated costs that you've seen over the last, call it, a year and a half.\n\nDirk Locascio -- Chief Financial Officer\n\nSure. So the last couple of quarters, we haven't specifically quantified that. But what I will just say is it remains similar to the last few quarters, and it really is largely driven by, what Andrew talked about, the higher level of turnover. And as we see these green shoots in different areas of the business, whether it's productivity or other pieces there that we would expect to build upon those.\n\nAnd we'll talk more about it as we make progress. I think the important thing to take away, though, is even though retention, again, which is a kind of industry and even broader issue, even with that being the case, we are still seeing progress, whether it be the routing initiative that Andrew talked about, whether it be some of the other things there around our process redesign, around inbound receiving product, etc., there, that are showing gains. So we know the things we're doing are generating some gains. Unfortunately, in the macro environment, we and others just are still battling with the retention and continue to be relentlessly focused on things to address it.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nThank you very much.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nJeff Bernstein -- Barclays -- Analyst\n\nGreat. Thank you. This is Jeff Bernstein from Barclays. Two questions.\n\nOne, just on the fundamentals of the business. I think you mentioned no change of late in terms of volumes. But more broadly, I know chain volumes were down close to 10% this past quarter. I'm wondering how much of that is the conscious exits you mentioned, otherwise, any common themes with the accounts that you're seeing anything maybe by consumer income level? Are you seeing any changes or quick service versus casual dining? Any kind of color in terms of the change by account or any color on that chain volume being down that 10%.\n\nAnd then I had one follow-up.\n\nDirk Locascio -- Chief Financial Officer\n\nSure. Jeff, good morning. It's Dirk. So overall, the two contributors mainly to the chain being down, we talked about the strategic exits.\n\nAnd then if you recall, last quarter, we talked about softness in a couple of specific concepts, and we continue to see that, and they happen to be a larger concept. So what we're not seeing is we're not seeing any widespread trends, softening, etc., across different types within the chains. And we see that some -- whether it's in fast casual, QSR, etc., you see winners and losers across the different ones. But not any specific trend that I would call out at this point.\n\nAnd I think the thing in change that we are continuing to see and do is move toward those customers that continue to be a better fit, and we're seeing good results with that.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYes. I think, Jeff, it's Andrew. The other, I think, we would say is that we haven't -- we've been watching carefully for it, but have not seen any meaningful sort of trading down within menu types either. And that's something that, again, when we say no meaningful change in behavior, that's one of the things we look at very closely.\n\nJeff Bernstein -- Barclays -- Analyst\n\nUnderstood. And then in terms of just the broader foodservice distribution industry, I mean, are you seeing rational competitive behavior? I mean, obviously, these are unusual times for, well, for you guys for sure and for the industry more broadly. Just trying to get a sense for how you see the behavior of your competitive set, both large and small.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYeah. I think we would describe it as a rational market right now for sure. There is obviously the volatility that continues as well as the ongoing inflation have both been real challenges. We have not seen any significant sort of irrational behavior at this point.\n\nJeff Bernstein -- Barclays -- Analyst\n\nGot it. And then lastly, Bob, I appreciate your contribution to the question earlier. Just wondering, in terms of the most recent board additions, just wondering, we obviously don't get a look inside the boardroom, but what are the kind of the areas of initial focus? Or would you call it constructive dialogue? Any change in maybe brand direction? Or how those early conversations going as you now have kind of a significant change in some of the members on the board? Thank you.\n\nBob Dutkowsky -- Executive Chairman\n\nYeah. It's a very good question here. We've added five new board members since the beginning of the year. So they brought to the board room a fresh perspective, a different set of skills.\n\nAnd we're really very, very encouraged by the addition of the new board members. They're aggressively oriented to the US Foods and have jumped into their areas of expertise really aggressively. I'll give you one example. We added two executives that have supply chain experience, Jim Barber and Quentin Roche.\n\nBoth of them have engaged with Bill Hancock, our leader of the supply chain, and have brought really interesting ideas around productivity and staffing that are things that we're aggressively deploying. So we're thrilled with the new additions. And really, we now have a very, very strong board in place that we're real pleased with.\n\nJeff Bernstein -- Barclays -- Analyst\n\nThanks for the perspective.\n\nOperator\n\nWe will now take our next question. Please go ahead, caller. Your line is open.\n\nAlex Slagle -- Jefferies -- Analyst\n\nHi. It's Alex Slagle from Jefferies. First, a clarification on the guidance in the release, you talked about continued confidence toward the higher end of the EBITDA range, and wasn't sure if that also applied to the EPS guide or would the leaning on the EPS range move toward the lower end just with the higher interest expense or if there's an offset there.\n\nDirk Locascio -- Chief Financial Officer\n\nSure. Good morning. So yes, confident in the outlook for EBITDA. On EPS, I still expect stronger.\n\nI think that's not quite at the strength of the high end, given the higher interest expense, but still feel like a good strong EPS outcome that likely still leads sort of in the upper half, again, assuming an environment that remains similar to where we're in.\n\nAlex Slagle -- Jefferies -- Analyst\n\nOK. And then a follow-up question on freight and your work optimizing the vendor allowances and everything there and just to get additional color. How the progress in the second quarter compared to the first quarter, which seemed like it was a very solid improvement in the first quarter. And maybe if you have any comment on how your freight income per case compares to '19 levels.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nYeah. Alex, it's Andrew. Thanks for the question. We're very pleased with the progress the team has made on freight.\n\nAnd we would say actually been a slight acceleration versus the very strong progress we saw in Q1 and Q2. And it's a function of really just getting underneath the arrangements we have in place to look not only to take over lanes where they're appropriate, but also to push them back when the profitability equation just doesn't make sense. We've also, I think, made really strong progress. And this is an important, I think, catalyst here is that we've made great progress engaging our vendors on a more regular basis, just given the way in which the freight markets have been volatile of late really over the last two or three years.\n\nFinding ways to kind of get more flexibility in the rate adjustments that our vendors are making, which used to be only really once a year has, I think, been a really important contributor to the progress that we've made.\n\nAlex Slagle -- Jefferies -- Analyst\n\nHelpful. Thank you.\n\nOperator\n\nJust to advise, we only have time for two more questions. We will now take our next question. Please go ahead, caller. Your line is open.\n\nMark Carden -- UBS -- Analyst\n\nIt's Mark Carden on from UBS. To start, are you seeing any changes in how customers are shopping our cash-and-carry stores? Do you see much of an uptick in interest over the past quarter just given some of the macro pressures that are out there? And then, are you seeing any major differences between your legacy Smart Foodservice locations and your legacy Chef'Store ones? Thanks.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nHi, Mark. It's Andrew. Thanks for the question. I would say we haven't seen a really significant change in customer behavior in terms of the composition of it nor the categories they're shopping.\n\nThat's been pretty consistent really throughout. And in terms of between the legacy foods Chef'Store versus foodservice stores again, I wouldn't see a big a big gap in their behavior. We are very pleased since we're on the topic to welcome [Inaudible] to the team. He's now leading that organization, and he comes with a tremendous retail background and has a ton of great ideas and first among them is, as I mentioned in my remarks, is to find an opportunity to really accelerate the rate at which we roll out new Chef'Store because we really are extremely pleased with the performance of that business and really are looking for opportunities to continue to expand it.\n\nMark Carden -- UBS -- Analyst\n\nGreat. That's helpful. And then have you seen much of an increase in private label demand from restaurants and others to help reduce costs and offset some of the pressures that they're facing? Has penetration really picked up relative to the last few quarters? Or has demand remain pretty consistent across the board?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nWell, as I mentioned, we saw an 80 basis point improvement year over year in exclusive brands. We think that is, in part, a function of the better value proposition that it offers our customers. And we are continuing to make sure we are driving that business as aggressively forward as we can. Supply challenges have been a bit of an issue in the past, but we are starting to see that ease up pretty considerably as we've been able to source as needed additional sources of supply for our exclusive brand products.\n\nSo yes, definitely, we believe an opportunity in this environment and one we will continue to pursue aggressively.\n\nMark Carden -- UBS -- Analyst\n\nGreat. Thanks so much and good luck.\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nThank you.\n\nOperator\n\nWe will now take our last question. Please go ahead, caller. Your line is open.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi. This is Kelly Bania from BMO. Just wanted to ask a little bit about how you think case volumes might respond in a moderating inflationary environment? And do you think that inflation is depressing volumes today? And maybe just how you think about that by your different customer segments like, especially healthcare and hospitality, that might be less economically sensitive?\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nHi, Kelly. It's Andrew. Thanks for the question. As we said rule have not seen a meaningful change in behavior over the last couple of quarters in spite of the inflation levels that we're seeing.\n\nSo it's hard to predict what will happen. It's hard to predict how any moderation will occur in which categories. So, unfortunately, I don't have a great answer for you on that. But I think in the main, we feel -- what we do feel good about is our ability even in an inflationary environment to continue to drive market share gains through our great sales organization, as well as the great existing relationships, finding ways to build our share of wallet within those customers.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nGot it. And then just in terms of the healthcare and hospitality, or maybe more the healthcare, I guess. What do you think is the catalyst to really get that back to where you think it can be?\n\nDirk Locascio -- Chief Financial Officer\n\nGood morning, Kelly. It's Dirk. I think on that one, it's just -- a lot of it is continued confidence in people comfort in getting back out to getting their seniors into senior living facilities as bed occupancy rates have continued to very slowly tick up. Also, I think some of it in acute or hospital systems and staffing, they continue to staff up and being able to reopen catering and the like.\n\nSo it really is -- that is one where -- because we have a fair bit of business in healthcare, it means a little slower recovery for us perhaps than some others. But we are seeing that continued improvement really each quarter that goes by. And that continues to be very encouraging. And we think that as we continue -- as people continue to build confidence that, that hopefully continues.\n\nOperator\n\nThat concludes today's question-and-answer session. I would now like to turn the conference back to Mr. Shah for any additional or closing remarks.\n\nSnehal Shah -- Senior Director, Investor Relations\n\nThank you, everyone, for participating today, and we will follow up shortly after the call. Thank you, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSnehal Shah -- Senior Director, Investor Relations\n\nAndrew Iacobucci -- Chief Commercial Officer\n\nDirk Locascio -- Chief Financial Officer\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nPeter Saleh -- BTIG -- Analyst\n\nNicole Miller\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nBob Dutkowsky -- Executive Chairman\n\nJake Bartlett -- Truist Securities -- Analyst\n\nJeff Bernstein -- Barclays -- Analyst\n\nAlex Slagle -- Jefferies -- Analyst\n\nMark Carden -- UBS -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nMore USFD analysis\n\nAll earnings call transcripts"
}