{
  "companyName": "Maravai LifeSciences Holdings, Inc.",
  "companyTicker": "MRVI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/maravai-lifesciences-holdings-inc-mrvi-q3-2022-ear/",
  "content": "Maravai LifeSciences Holdings, Inc. (MRVI 1.49%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to Maravai LifeSciences third quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Debra Hart, head of investor relations. Thank you.\n\nYou may begin.\n\nDeb Hart -- Head of Investor Relations\n\nThanks, Doug. Good afternoon, everyone, and thanks for joining us for our third quarter 2022 earnings call. I'm joined by Carl Hull, our executive chairman and interim CEO; and Kevin Herde, our executive vice president and chief financial officer. Our press release and the slides that accompany today's call are posted on our website and are available at investors.maravai.com under financial information, quarterly results.\n\nAs you can see on Slide 2, Carl will first provide you with a business update, and then Kevin will review our financial results and guidance. We will open the call for questions following the prepared remarks. On Slide 3, we remind you that the forward-looking statements that we make during this call including those regarding our business goals and expectations for the financial performance of the company are subject to risks and uncertainties that may cause actual events or results to differ. Additional information concerning these risk factors is included in the press release we issued today as well as those that are more fully described in our various filings with the SEC.\n\nToday's comments reflect our current views, which could change as a result of new information, future events or other factors, and the company does not obligate or commit itself to update these forward-looking statements, except as required by law. During this call, we will also be using non-GAAP measurements of certain of our results and in providing guidance. Reconciliations of GAAP to non-GAAP financial measures are included in our press release. The metrics we will be discussing in today's call include net income, adjusted EBITDA, income tax expense and adjusted earnings per share.\n\nThese adjusted financial measures should not be viewed as an alternative to GAAP measures that are intended to better enable investors to benchmark our current results against historical performance and to the performance of our peers. Now, I'll turn the call over to Carl.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nWell, thank you, Deb, and good afternoon, everyone. We appreciate having you join us for our call today. Let me now give you a quick recap of the quarter and provide a few business updates before turning the call over to Kevin. Starting on Slide 5.\n\nToday, we reported $191 million in total revenue, $133 million in total adjusted EBITDA and $0.37 in adjusted fully diluted EPS for the quarter. These results were within the range of our expectations. Furthermore, we are confirming our overall expectations for the full year of 2022 and tightening up our previously communicated ranges as we move to close out the year. Kevin will go into more detail on the results and guidance later in this call.\n\nIn the nucleic acid production or NAP business, we saw a revenue decline in COVID-related CleanCap revenue in the quarter of 4% versus Q3 of 2021. In the base NAP business, revenue was down 6% year over year against a strong third quarter 2021 comparison in which we had a large non-COVID order from a customer entering a clinical trial. Our biology safety testing business continues to see intermittent headwinds from the business in China and was down 1% from quarter three last year. Our adjusted free cash flow in the quarter was $119 million.\n\nThe strong cash flow generation leaves us with an all-time record cash balance of $617 million as of the end of quarter 3, up $67 million from quarter 2. This puts us in a great position to fund our long-term strategy via organic investments in our own capabilities while we continue to actively pursue external M&A. We see multiple potential strategic opportunities in our space where we are working to deploy some of this cash. On Slide 6, you'll see our results on a nine-month basis.\n\nRevenue for the first three quarters of the year was $678 million, up 19% compared to the prior year similar period. Excluding COVID CleanCap revenue, our base nucleic acid production business was up 21%, and our biology safety testing business was up 4%. Our top-line growth resulted in adjusted EBITDA of $508 million for the nine-month period, which represents a 75% adjusted EBITDA margin. As we enter the final quarter of the year, we feel extremely well positioned to build on our strong commercial foundation, expand our existing customer relationships and amplify our product and services offerings to support our customers.\n\nOn that theme, let's turn to Slide 7. During the quarter, we announced the first commercially available GMP-grade N1-Methyl-Pseudouridine-5'-Triphosphate, a critical raw material for mRNA manufacturing. This new product extension leverages our existing quality systems and GMP capabilities, including clean room manufacturing, expanded analytical testing and process verification. The demand for messenger RNA modified with N1-Methyl-Pseudo U, as we call it, has risen significantly in the past several years due to its incorporation in both currently approved mRNA vaccines against COVID-19.\n\nN1-Methyl-Pseudo U is a key raw material for the majority of mRNA therapeutics in development today. In fact, it is our most requested modified NTP in mRNA manufacturing. Our GMP-grade N1-Methyl-Pseudo U allows us to address our customers' needs to domestically source critical materials, and we are pleased to add this GMP-grade molecule to our existing offering of chemical capping reagents and other mRNA components. We see this as the first of many GMP-grade reagents to come from our new product development pipeline.\n\nThis product is now available as both a GMP raw material and can also be incorporated into GMP mRNA manufacturing campaigns. These types of new products should continue to bring value to our customers and help improve the quality of manufactured mRNA for years to come. We remain focused on our base nucleic acid production business as the key driver of long-term value creation as we continue to expect innovative mRNA customer growth in both products and services. To illustrate the traction we see from both a product and services standpoint, let me share some evidence of ongoing customer adoption on Slide 8.\n\nDemand for CleanCap mRNA continues to accelerate in all areas. CleanCap reagents themselves, GMP manufacturing services and custom mRNA constructs. One year ago, in the third quarter of 2021, we had 170 CleanCap reagent customers on a rolling 18-month basis. As we close the third quarter of this year, that number is now 273 customers, up 61%.\n\nThese are customers that are of CleanCap as a stand-alone reagent. We ship it to them or their preferred contract manufacturer, and they use our capping analogs in their own mRNA manufacturing process. This could be for research and discovery activities, preclinical development and with our GMP offering clinical manufacturing of mRNA. We also track our CleanCap mRNA discovery customers.\n\nThese are customers at the very earliest stages of their programs who look to trialing to manufacture mRNA on their behalf using CleanCap as their capping method. Their activities are mostly for early research and discovery, including assay development, target identification and in vitro cell models. This group of customers has grown from 464 last year to over 600 customers today. That's up 29%.\n\nAnd among these early customers as they continue through their discovery work, we expect many will mature into the mRNA GMP services business where they would take several of their top candidates and upgrade them to our GMP manufacturing processes, which includes process development, to large-scale manufacturing, phase appropriate methods development and validation and collecting documentation that would support an IND filing. These GMP messenger RNA customers have grown from 53 to 68 over the last year, up 28%. As these customers progress through our GMP services with their preclinical and early clinical phase work, we also want to support them through Phase 2 and beyond, which is why we are building the new Flanders facility. Now let's turn to Slide 9 for an update on those facility expansion plans.\n\nAs we announced in the second quarter, we signed a collaborative agreement with the Department of Defense where they will fund up to $39 million of our planned expansion of the Flanders nucleic acid production facility here in San Diego. This is part of the government's goal of nationwide pandemic readiness for COVID-19 and beyond. We successfully passed the BARDA audit and have commenced billing for reimbursement under our grant for the Flanders construction. We expect to receive our first reimbursement check later this month.\n\nThe Flanders site construction is progressing, and we expect to have partial occupancy for Phase 1 of the project in early first quarter 2023, and Phase 2 occupancy later in the first half of 2023. As a reminder, the first phase will provide us with an additional GMP manufacturing suite with one clean rooms. By moving some of our operations to the new Flanders site from Water Ridge, we will be able to expand the rest of our small molecule platform and a GMP API manufacturing capacity. This will allow us to support our customers through Phase 2 and beyond.\n\nLikewise, the biology safety testing relocation to a new facility in Leland, North Carolina, is progressing nicely toward a move-in date over the holiday break at the end of this year. This new facility more than doubles our operational square footage to support current and future growth. The fully customized design will provide room for a Mass Spectrometry Center of Excellence and specialized cell culture facilities. It will significantly increase our cold storage capacity while providing other R&D, laboratory and automation upgrades.\n\nExtensive process flow analysis has been incorporated in the design to optimize and enhance both our manufacturing and kit packaging operations. Our Pacific Center expansion, which will provide additional warehouse space, light lab and SG&A space is also progressing nicely, with the number of employees and teams already making the move. And that expansion is on track to be fully completed in the early second quarter of 2023. These new facilities are an example of how we continue to make investments to support the long-term growth that we anticipate in our base business.\n\nNow turning to Slide 10 and our COVID outlook. As you all know, our part in supporting COVID-19 vaccines has been amazingly rewarding, and we are very proud of the role that we've continued to play in helping to address pandemic. With about two-thirds of our revenue coming from the use of CleanCap and COVID-19 vaccines in 2022, a central issue in many of our discussions with investors has been the durability of our COVID-related CleanCap revenues into 2023 and beyond. The vaccine space clearly remains in substantial flux and there are still a number of uncertainties around end user demand for these vaccines.\n\nThe uptake for the new bivalent booster vaccines has frankly not been great, with only 19 million people in the U.S. receiving the new booster dose as of October 19. As we discussed last quarter, we were estimating then that COVID-related vaccine production would likely drop by one-half to two-thirds from 2022 levels. That led us to anticipate the 2023 COVID revenues would drop proportionately for us to a range of $200 million to $300 million in 2023.\n\nLooking back to the end of last year as we were heading into 2022, we had excellent visibility into demand from our major customers with whom we had both binding commitments and long-range forecast in place. Today, as we head into 2023, we are not in the same position. Since we do not have those commitments or long-range forecasts from our major customers in hand. Additionally, based on the slow uptake of the new boosters, we believe it is likely that our customers have raw materials on hand as they start the year, which will negatively impact our revenue in 2023, particularly early in the year, as those customers work down any existing raw materials.\n\nAs a result, we now believe that CleanCap COVID revenue from four more Maravai in 2023 could be half of what we most recently anticipated. Our current estimate for COVID-related CleanCap revenues is about $100 million in 2023 with limited shipments in the first half of 2023. Internally, we are also planning around that $100 million annual run rate as a reasonable assumption for COVID-related CleanCap revenue in 2024 and beyond. In my closing remarks, I'll try to touch more on future guidance.\n\nNow turning to Slide 11, our biology safety testing business. Our products and services in this business support high-growth markets in cell and gene therapy vaccines and biologics by providing process-related and impurity analytics, along with offering innovative viral clearance prediction solutions that help our customers ensure the safety of their biopharmaceutical products. We continue to innovate and scale our offerings in BST to ensure superior technical support to offer the highest quality services and products and the most comprehensive catalog products to meet our customers' needs. We anticipate launching our pivotal retrovirus MockV kit later this year, further building on the breadth of our product offerings.\n\nThe MockV technology addresses unmet opportunity for growth in viral and purity detection. Now let me finish with a topic that may be on some of your minds, and that concerns our disagreement with Danaher regarding Trey Martin joining Maravai as our CEO. Following our hiring of Trey, Danaher filed a lawsuit against Trey and Maravai, claiming a violation of a noncompetition agreement and saw a temporary restraining order, which was granted, including Trey from working for Maravai pending a preliminary injunction hearing expected to occur within the next month or so. We are mounting a complete and vigorous defense against the suit.\n\nPublic policy in California, where Trey's resident and Maravai has its headquarters has recognized the unjust impact of similar contractual restrictions that are intended to limit the mobility of former employees. We are disappointed that Danaher has taken this action to try to limit Trey in advancing his career. We remain confident Trey is the right choice to lead Maravai through our next phase of growth. While we can't speculate on the full range of possible outcomes here, one possibility is that Trey will be reinstated as our CEO following the preliminary injunction hearing later this year.\n\nAnother possibility is that he may somehow be limited in roles that he could play with Maravai for up to a year as he completes any remaining post-employment obligations that the court may find he has to his former employer. In the meantime, I'm quite happy to step back into the CEO role, as you can see. I feel that we've been as transparent as we can with you on this matter right now. And I would ask for your understanding as we won't be taking any further questions on this legal matter unless we have something material to announce in the future.\n\nAll right. Now moving on to Slide 12. I'll now ask Kevin to cover more details on our third quarter performance and update our guidance for the balance of the year. Kevin?\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nThank you, Carl. Good afternoon, everyone. I'm happy to review our financial results for the third quarter and to discuss slide updates to our current guidance for the full year of 2022. So starting on Slide 13.\n\nBeginning with the GAAP numbers, our GAAP net income before noncontrolling interests was $100 million for the third quarter of 2022. This compares to $132 million for the third quarter of 2021. Note that certain prior-year amounts were adjusted for the lease accounting standard change required under ASC 842. Income from operations was $117 million in the quarter for an operating margin of 61%.\n\nR&D spend in the quarter was over $5 million, which compares to about $2 million from Q3 2021 as we continue to increase our R&D spend and focus on -- both on work around our CleanCap franchise as well as other novel innovations. Moving to Slide 14. Adjusted EBITDA, a non-GAAP measure, was $133 million for Q3 2022 compared to $155 million for Q3 2021. Our net adjustments from GAAP EBITDA to adjusted EBITDA continued to be a small, only adding less than 6% from our GAAP EBITDA for the quarter, the vast majority tied to the noncash stock-based compensation add-back.\n\nOur adjusted EBITDA margin was 69% in Q3 2022, a little better than our expectations for the quarter based on slightly better gross margins and favorable SG&A expenses. Now to Slide 15. To represent basic EPS, diluted EPS and adjusted fully diluted EPS. Basic EPS is a GAAP measure as net income attributed to our Class A shares divided by the weighted average Class A shares.\n\nDiluted EPS, also a GAAP measure, starts with basic EPS and to the extent that the assumed conversion of Class B shares and other equity awards are dilutive, then net income and weighted average shares outstanding used in the calculation will be adjusted to reflect the dilutive effect of the conversion. The diluted effects of Class B shares and other equity awards were negligible in Q3 2022. Lastly, the simplest and most comparable metric of focus for us is adjusted fully diluted EPS. A non-GAAP measure, which equals adjusted net income divided by the weighted average of both Class A and B shares and other dilutive securities.\n\nOur basic EPS for the third quarter was $0.34, diluted EPS was $0.34 and adjusted fully diluted EPS was $0.37 per share. Our bottom line for the quarter was a bit ahead of our expectations from the higher margins in the quarter as well as lower interest and tax expense, which both benefited from some advanced interest rate and tax planning tactics. Moving to Slide 16, and a few balance sheet items and other financial metric highlights. As Carl noted, we ended the quarter in a record gross cash position with $617 million in cash and $540 million in long-term debt.\n\nOur strong EBITDA performance led to a robust adjusted free cash flow for the quarter of $119 million. That calculation of adjusted free cash flow, a non-GAAP measure, is based on our adjusted EBITDA of $133 million less capital expenditures in the quarter of $14 million. We define capital expenditures as purchases of property and equipment, which are included in cash flows from investment activities, accounts payable and accrued expenses offset by government funding recognized. And to the extent construction costs determined to be lesser improvements recorded as prepaid payments, including portions including accounts receivable and accrued expenses, also offset by government funding recognized.\n\nCapital expenditures in the quarter was consistent with our expectations, reflecting our focused investment in our facilities capacity expansion that Carl had touched on earlier. We continue to expect our net capex, as I just defined it, to be between $50 million and $55 million for the full year of 2022, which reflects about $28 million of anticipated offsets from the Department of Defense pursuant to the collaboration agreement we have with them. Now of this total, about two-thirds will be classified as long-term other assets and the remainder as traditional fixed assets. The remainder of our $39 million current grant will likely offset capex in early 2023 as we complete the Flanders facility.\n\nNow sitting on over $600 million in cash is a great position for Maravai to be. Furthermore, as I briefly touched on our advanced planning results, having an interest rate cap contract, which effectively caps our cash-based interest rate at six and a half percent. Overall, we're in a very strong position to lean into the M&A space over the remainder of 2022 and into 2023. We are currently actively evaluating multiple potential deals.\n\nLastly, as I mentioned last quarter, we have structured Maravai and the vast majority of our contracts and treasury operations predominantly in U.S. dollars and thus are not facing any material foreign exchange impact in 2022. Now to provide some more insights into the business segment financial performance for the quarter, let's turn to Slide 17. Our nucleic acid production business represented 91% of our total revenue in the quarter and generated $134 million in adjusted EBITDA, a 77% adjusted EBITDA margin.\n\nCleanCap revenues from our major COVID-19 vaccine customers were approximately $127 million in the third quarter of 2022. This compares to $131 million in Q3 of 2021. Our base nucleic acid production business, excluding CleanCap revenue from our major COVID-19 vaccine customers was down from Q3 2021 as our prior year had a large non-COVID-related order to one of our customers to support numerous of their non-COVID-related programs. Our biology safety testing business contributed 9% of the company's revenue in the third quarter and continues to be impacted by the ongoing pandemic lockdowns in China and our ongoing decision not to ship into Russia.\n\nOur Cygnus branded products, which comprised virtually all of this segment's business were down $1 million in the quarter. Our biology safety testing business delivered $13 million of adjusted EBITDA in the quarter, a 79% EBITDA margin. Corporate expenses that are not included in the segment adjusted EBITDA totals were $14 million in the quarter, up from the Q3 2021 levels of $10 million, mainly due to investments in key personnel and systems that drive and support growth as well as the additional investments in key leadership positions for both R&D and our commercial areas. We continue to be pleased with our ability to track key talent for all levels of Maravai.\n\nAnd at the end of September, we had a record 604 full-time employees, up 50 employees from June. We continue to add key talent to support our customers and our long-term plans. Now, moving to Slide 18. Our slight updates and tightening of our 2022 financial guidance ranges.\n\nWe now expect revenues of $880 million to $890 million for the current year, including our updated estimate around $600 million to $605 million of revenues associated with CleanCap related COVID vaccine demand. The small movement in midpoint of the revenue range of $10 million or about 1% is tied to the combination of lower COVID-related revenues in 2022 and the lower expectations for our biologic safety testing business for the year. This update and guidance implies a midpoint for our base non-COVID CleanCap business of about $282 million or growth of approximately 17% from comparable 2021 levels. This base growth includes about 3% to 5% growth for our biologic safety testing segment and about 35% to 40% growth in the base nucleic acid production segment.\n\nWe are tightening our full year 2022 EBITDA guidance, a non-GAAP measure to the range of $650 million to $660 million compared to our previous guidance range of $640 million to $660 million, increasing the midpoint by $5 million. Based on this updated adjusted EBITDA guidance, our adjusted fully diluted EPS, a non-GAAP measure, is now updated to a range of $1.76 to $1.80 per share compared to our prior guidance of $1.70 to $1.80 per share, increasing the midpoint by $0.03 per share. Now obviously, with nine months complete, our updated full year 2022 guidance less our reported nine months results provides basically our expectations for the current fourth quarter. To save analysts on the call the stress of making rapid calculations prior to our Q&A, let me way that math out for you all at the approximate midpoints.\n\nFor the fourth quarter, we expect total revenues of approximately $207 million, COVID-related CleanCap revenue of about $127 million, base business revenue of about $80 million which would represent growth of 65% over Q4 of 2021, adjusted EBITDA of around $147 million which would be a margin of 71%, and adjusted EPS of about $0.33. Now on Slide 19, you'll see our other guidance assumptions for the full year of 2022. Adjusted fully diluted EPS is based on the assumption that all Class Bs are converted to Class A shares, which results in a fully forecasted diluted share count estimate of 255 million to 256 million for the full year of 2022. Additionally, our adjusted fully diluted EPS includes certain adjustments that do not reflect our core operations, and are based on an adjusted effective tax rate of around 24%.\n\nAs it relates to the other adjustments needed to get to our non-GAAP adjusted EBITDA range, our expectations for 2022 include interest expense between $21 million and $23 million, depreciation and amortization of $30 million to $32 million, equity-based compensation which we show as a reconciling item to be about $17 million to $19 million and as stated earlier, we expect our net capital expenditures to be about $50 million to $55 million, the vast majority tied to our new facility expansion. Our reconciliation of net income to GAAP EBITDA and from GAAP EBITDA to adjusted EBITDA is presented in our press release and at the end of this slide presentation. In addition, our segment-related information will be detailed in our Form 10-Q, which we plan to file in the next couple of days. So to conclude, we continue to execute financially in line with our expectations and against the 2022 guidance that we initially set for 2022 revenues of $840 million to $880 million back in November of 2021.\n\nThere has certainly been a lot made of the pre-COVID -- COVID pandemic phase and post-COVID pandemic phase for companies like Maravai. Although the future impact of COVID-related demand is still unclear to all, we remain in a great position for the long term. I recently look back to some of our financial models from 2018, and we sit here with the biologic safety testing business that is right about where we projected it to be and the Nucleic Acid Base business well ahead of where we projected it to be. Additionally, we are $700 million ahead of our cash projections and have substantially more capabilities and infrastructure today for our long-term growth and success.\n\nNot only is Maravai much larger, more profitable and stronger business than we anticipated years ago, but the success of mRNA has subtracted a level of marketwide interest and investment much larger and broader than we believe it could be at the end of [Audio gap] global conflicts and uncertainties and rising inflation and interest rates are all macro factors that impact us all in life sciences. We recognize these factors and make decisions understanding the broader markets. However, we also keep a steadfast conviction in our vision, our strategy and remain focused on the long game. We are in a great position to move meaningly forward, and we'll continue to lean in and invest in those people, processes, facilities and systems as well as assets that best position us for our long-term success.\n\nThank you for your time today. Now I'm going to turn the call back over to Carl for some final remarks on Slide 20.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nAll right. Well, thanks, Kevin. In short summary, we have delivered a solid 2022 thus far and look forward to ending the year in line with our stated expectations and quite possibly detailing more about our M&A activities for you. Before we wrap up our prepared remarks, I want to further discuss our current outlook.\n\nWith the lowered expectations for COVID revenues in 2023 and our discussions around the level of COVID-related revenues that we now estimate for our own business planning purposes, we felt it important to provide some additional details around how we see things moving forward. Our base nucleic acid business continues to perform well, as you would expect in this environment. We see continued strong growth in that business based on our capabilities, customer interest and market momentum. We also see our biologic safety testing business resuming broader market growth levels in 2023.\n\nBased on this and the work we are doing for our annual budget and long-term planning process, we believe our Base business will deliver revenue growth of at least 20% for the company in 2023. We see that, that in combination with our estimated $100 million in COVID-related CleanCap revenues, resulting in an adjusted EBITDA margin range of 40% to 50% next year. We will be completing our planning activities in the coming months, and we'll look forward to providing our detailed 2023 guidance as well as our long-term growth and profitability targets as part of our year-end 2022 earnings call in February. Until that time, we are as focused as ever on execution in our business for our customers, providing our employees with a great work environment and career development opportunities and making decisions that we wholeheartedly believe will create long-term shareholder value.\n\nI'd now like to turn the call back over to Doug to open the line for your questions. Doug?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Tejas Savant with Morgan Stanley. Please proceed with your question.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nHey, guys. Good evening. So maybe just to kick things off, Carl, can you just elaborate on how much of the $125 million to $130 million in COVID year in the third and fourth quarter was related to take or pay revenue? Is that a dynamic that we should be keeping in mind as we think about the margin headwinds, particularly in '23? I know you laid out that 40% to 50% EBITDA margin estimate out there. But just trying to make sense of the moving pieces here, the regular decline in COVID versus any take-or-pay dynamics that we should be keeping in mind?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nYeah. Tejas, good to hear from you. I think the right way to answer that question is to tell you that in general, unlike some of the other sort of people who are participants in the CDMO marketplace, we don't settle contracts without shipping products. So I would say, in general, what you see in our margin numbers or our forecast is largely product being shipped.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nGot it. OK, that's helpful. And then we heard from a couple of CDMOs earlier this week, just around elevated cancellations, not or rather no cancellations, but a slowdown in drug pipeline progress. So just curious as to whether you're seeing any of this dynamics start to play out in your customer base at all?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nNo, we really haven't seen it in the mRNA services side of the business, Tejas.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nGot it. Clear enough. And then on the new product launch here with the GMP-grade N1-Methyl-P U, I believe you called it, Carl. A bit of a tongue twister.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nI said, pseudo U, I wouldn't -- I'm not sure let me name PU, but OK, go ahead.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nSo it sounds like a pretty interesting product here and pretty differentiated in terms of the context of mRNA manufacturing. Would you sort of like be in a position to put any dollar amounts in terms of the SAM here, if you will? And how do you see that opportunity ramping in the near term? Or is it just really sort of another arrow in your quiver?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nWell, look, I don't think we could give you SAM data right now. We're certainly not in a position to give you specific guidance on 2023, just yet. But I would tell you that we think this is representative of the trend in the industry, which has more and more big pharma become involved. And I think we've discussed this on previous calls as they become involved in the mRNA field.\n\nTheir expectations and demands in terms of the quality of the inputs that they utilize are increasing and in some cases, increasing rapidly. So we think this is a good exemplar of what might happen in the future and being first to be able to offer those in various products is going to be important to us.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nVery helpful. Thank you, guys.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of John Sourbeer with UBS. Please proceed with your question.\n\nJohn Sourbeer -- UBS -- Analyst\n\nHi. Thanks for taking the questions. So you had mentioned in your prepared remarks some increased raw materials on hand with COVID customers, maybe some destocking there. I guess -- do you see this also in your Base NAP? And is that a factor going into the lower growth trajectory next year?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nNo, John. I don't really think it is. This would be specific to the COVID vaccine area where there was a high premium put by our customers on being prepared for the worst case. It certainly doesn't apply generally to the other RNA therapeutics.\n\nRemember, those are much earlier in their development. So it's not like any of these products are yet being commercialized and people are approaching it from a cost savings point of view. They're trying to just go as fast as they can.\n\nJohn Sourbeer -- UBS -- Analyst\n\nGot it. And I guess on that growth trajectory next year, I guess, can you just maybe elaborate on some of the drivers there year over year? And then the company does have meaningful capacity coming online. Maybe just any color on how some of these projects are maturing and how you can fill some of that capacity?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nKev, do you want to take a shot at that?\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nYeah, certainly. Look, I think that we're really pleased with what we're seeing, the feedback we're getting from our customers, and we certainly tucked on -- touched on the GMP N1-Methyl-Pseudo U. Just to give you some context, I mean, we've had over 150 customers ordering that product over the past three years on an RUO basis. So part of it is going to be conversion and the related pricing increase that comes with that conversion.\n\nWe're already seeing POs and supply greens lining up for the GMP version. So that's just a great example, as Carl said earlier, of how our new capabilities and the increase in quality and the focus on quality is helps drive some of that growth. When you kind of break down, as we've talked about in the past, various things going on with the nucleic acid production. You have that -- all of the synthesis inputs like NTPs we talked about, you have the plasma market, you have CleanCap as a stand-alone product, you have the mRNA services with CleanCap as a CDMO and then other algos and kind of base things like we have with our Glen Research.\n\nThey all have different growth rates, but we continue to be very excited sort of about each of those lines. But as you break it down, really those -- all of those synthesis inputs as well as that mRNA CDMO business is really where we're seeing a lot of the interest today and those are the higher growth lines within that portfolio.\n\nJohn Sourbeer -- UBS -- Analyst\n\nI guess last one for me, and I apologize if I missed this. Did you say how much of the $100 million in 2023 COVID CleanCap has already been booked for next year?\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nWe did not. No.\n\nJohn Sourbeer -- UBS -- Analyst\n\nWould you comment on that?\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nWe're not going to get into that right at this stage. I mean, right now, we have a lot of conversations with our customers just because of a lot of different demand. And we have a lot of different customers within that group, and they all have different dynamics. So it's a little bit hard to generalize at this point.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nBut John, I would say that our experience is probably not very much different from a number of other peers in the space where the prior visibility that we all had going into '22, related to COVID demand is much reduced this year going into '23.\n\nJohn Sourbeer -- UBS -- Analyst\n\nGot it. Thanks for taking the questions.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nYeah. You bet.\n\nOperator\n\nOur next question comes from the line of Paul Knight with KeyBanc. Please proceed with your question.\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nHi, Carl. The Q4 guidance on non-COVID implies a pretty significant year-over-year jump on Q4, because you talk about the dynamics behind that. And then -- the other is when you talk to 2023, you're mentioning low 20s growth, I think you were in kind of in the 30% area of last call. Could you talk to that as well?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nLet me ask Kevin to comment on those and I'll fill in.\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nYeah, sure. Yeah, Paul, as we've talked about before, specifically to Q4, there are a couple of dynamics there. Some of that is a stand-alone CleanCap on non-COVID-related programs. And we've seen that spike up and down.\n\nLast year, we saw it hit a high number in Q3 '21. It will be at a higher number in Q4. That's just based upon our customers' demand for CleanCap for non-COVID specific programs. So have a nice pipeline of CDMO type mRNA services in the fourth quarter, and that's really going to drive that number.\n\nAs it relates to looking forward, I know we talked about some general market trends and what we've seen historically, not getting into specific '23 guidance, but just looking kind of at how we see our long-term growth rates and sort of a baseline for next year. Again, I think we feel real good about the business. We feel real good about our growth rates. When you look at the base business, and I think we're just entering it with what we think is going to be something we can achieve across the business lines.\n\nWe have some components when you look at some of the lines of the business that are just certainly lower grower components of the business. But when you really look at the key drivers, what we're building into and what we see is long-term demand drivers in all go synthesis inputs and mRNA CleanCap services for highly modified mRNAs. Those are at those higher growth rates, which are consistent with the market trends. And then you layer on top of that some of the conversions for quality and other things.\n\nThat's the part that's growing at that 30% to 35%. Some of the rest of the business is growing at lower rates, and that blended average is getting closer to a 20% baseline that we'd like to throw out there for next year. \n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nOK, thanks.\n\nOperator\n\nOur next question comes from the line of Matt Sykes with Goldman Sachs. Please proceed with your question.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nHi. This is Phoebe on for Matt. First, on your capital allocation strategy, are there any specific areas of interest or potential gaps you're looking to fill? And also, could you give us an update on what the landscape looks like at this point?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nWell, generally, I think our view here is that there are other pieces to the puzzle that our customers are looking for, and we try as much as we can to focus in on those areas, whether they be other components that are used to manufacture mRNA or perhaps other nucleic acid-based products and other ways of delivering those products. So reasonably, I think you could expect us to be hanging around the verticals. We've always been interested in acquisitions around the biologic safety testing business. But unfortunately, though, there are not many of those that are logical strategic fit because of the specialized nature of those products.\n\nAnd then I think in terms of the current environment, it's getting better. I would say than it has been for the last six months, I think people are coming to grips with current valuations, maybe not fully, but more so than they were at least initially as the market correction occurred. And I think we do see a large number of opportunities that are relevant to us based on what I just said that we're pursuing. So improving, but not there yet.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nGreat. Thank you. That's helpful. And then recognizing biologic safety testing was negatively impacted by China lockdowns and then also Russia.\n\nAre there any updates you can provide for the balance of the year as we see these dynamics persist?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nNo, because I think they are kind of spotty as we concern is China, and it's just the luck of the draw. So you have large customers through our distribution channel there who happen to be in cities that get affected multiple times. They suffer the difficulties of it. So I would say that there's not much else there.\n\nWe continue to maintain our decision on exiting the Russian market was appropriate and feel comfortable with that.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Matt Larew with William Blair. Please proceed with your question.\n\nMadeline Mollman -- William Blair -- Analyst\n\nHi. This is Madeline Mollman on for Matt Larew. Quick on the raw materials. I know you mentioned that you thought it would impact the first half of the year.\n\nHave you heard anything from your COVID customers about how much inventory they have, like how much higher it might be above normal levels, anything like that?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nNo. And I guess the reason is nobody knows what normal is, right? This is just been going on for one years. So that's a hard one to pin down. But no, we don't have real good visibility onto the customer's individual inventory situation and how they view it.\n\nWe're just reflecting the fact that absent specific sales forecast, we don't want to kind of stick our finger up in the wind and make a guess.\n\nMadeline Mollman -- William Blair -- Analyst\n\nGot it. That make sense. And then looking at the non-COVID mRNA therapeutic pipeline, are there any candidates that you see becoming catalysts in the next couple of years? And can you talk a little bit about how the dynamics for you change as a therapeutic move through the clinic?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nWell, that's an interesting thing. I mean I think people always focus on who are the winners going to be, which is sort of a natural thing, super hard to tell with therapies like this, particularly for those that are directed at rare diseases, because that's just so difficult to anticipate or run pilot clinical trials until you get to your pivotal trial. So I don't think we consider our business to be picking the winners. We believe widely serving the largest number of participants in the early stages is the best way to maximize the probability that we're working with those folks who ultimately do have a game-changing complication.\n\nAnd so we're doing that. The dynamic about what changes over time is -- there's a greater focus, obviously, on quality standards and compliance and moving more into a consultative role as you're developing the procedures and effectively the manufacturing processes that would be used for later stages. So I think the customer expectations of closer collaboration versus a little bit more hands off. Here's my sequence make this for me, which is how I would characterize the early stage, later stage becomes more consultative.\n\nMadeline Mollman -- William Blair -- Analyst\n\nGreat. Thank you.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nOur next question comes from the line of Michael Ryskin with Bank of America. Please proceed with your question.\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. I'm going to try to squeeze in a couple of really quick ones. First of all, your commentary on COVID 2023 and beyond, you're still pointing to about $100 million per year in 2024 and 2025 and so forth.\n\nYour last guide was more of $200 million to $300 million. So given how quickly that's changing and given what you're seeing from other CDMO and bioprocess players, where they're essentially assuming zero COVID bioprocessing pretty quickly, sort of what's the rationale for keeping that in the model? Is it that just further risk of downside? So why not strip it out that?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nWell, Michael, because we don't think COVID demand is going to go away, that's the bottom line. So we're partnered with the team that has roughly two-thirds market share depending on where you look at it of the COVID market, neither they nor we think that market is going to go to 0. But if you think about it on a steady-state basis, what we're doing is reducing it down to about roughly 15% to 18% of what it was at its peak this year. So I think that, that's a reasonable assumption if you back into some of Pfizer statements about what their expected volumes might be an analyst projections there.\n\nI think it triangulates pretty nicely on that. I'm not aware that anybody has that going to zero.\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nOK. And then on the EBITDA margins for next year, 40% to 50%, again, I appreciate your comment on investing in the business and sort of setting the company up the right for the longer term. But that's still on the lower and sort of our assumptions, even if you adjust for the lower COVID contribution, especially if you look at the business we're doing in 2019 and four years later, you've got a lot more volume there. So can you walk us through the bridge there from your EBITDA margin this year coming in the 70% range, but 40% to 50% next year.\n\nIt's a pretty big step.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nKevin, would you like to take that?\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean, look, I think, certainly, the COVID-related CleanCap is a big driver of that, certainly. I mean that is a high-margin product for us. So you complement that with a handful of things.\n\nAnd again, our investments that we're making are really looking out multiple years here. We're just happy to be seeing '23 as a transitional year where you have that decline of high-margin CleanCap revenue contribution in the same period as you're bringing online three new facilities, and continuing to expand your internal organic R&D engine as well as your commercial engine for the long term. I mean so those things just come together all in the same year and lead you at the lower end of that EBITDA range. But again, we're not managing the business for next quarter's EBITDA or even next year's EBITDA specifically.\n\nWe're putting in the things that we feel need to be in place and need to be in place as soon as possible. Take advantage of the opportunity we see over the next three, five, 10 years with where we're playing. So I'm very happy with the investments we're making and how it's setting us up for the long-term success, certainly because of those confluence of factors that I just spoke of. The margins are going to be lower next year, and we hope to bring that up as we grow and as we grow off of the transitional year that 2023 is going to represent.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nYeah. And Michael, I would add on that one to the -- if you step back and look at it, when you think about a pure life sciences company in sort of the cutting edge part of the field that's growing the base business at 20% or greater as we indicated, and delivering margins above 40% on the EBITDA line is a pretty compelling both investment opportunity and a pretty compelling business for us to run. So admittedly, this year is really superior. Next year, it looks pretty darn good.\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nOK. And if I could squeeze in one last quick one. On non-COVID Nucleic Acid piece, you touched on 3Q '21 had that tough compare, which you called out at the time. But so if you just look at this year on a dollar basis, 1Q, 2Q, 3Q, the revenues for non-COVID breakdowns are flat and they actually down sequentially, if it wasn't for that canceled order in 2Q.\n\nSo is this sort of what we should be expecting from just progression over the course of the year because I think we kind of anticipated some sequential ramp as the year went forward. So anything to touch on there in terms of timing through the course of the year, how that should trend?\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nYeah. No, it's really one of those things that doesn't just step nicely every quarter for various reasons. Like I said, sometimes you get bulk orders just for CleanCap, sometimes we have multiple jobs getting wrapped up and getting built out as they relate to our CDMO business. So we just don't haven't got to the point where we have a quarterly rhythm just because we just haven't got enough customers progressing into those later phases that it smoothed it out.\n\nSo we had a very strong Q3 last year, it stepped down in Q4 this year. It's going to step up in Q4. It's just the nature of the business. I think to grow those should smooth out a little bit, but that's just the nature of what we're seeing right now.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nYes, it's a little bit noisy, and that's a lot of the smaller numbers probably as much as anything else.\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nAppreciate that. Thanks so much.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nAll right. Thank you. Doug, do we have anyone else in queue?\n\nOperator\n\nYes, we do. Our next one comes from the line of Dan Arias with Stifel. Please proceed with your question.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nHey, Dan.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nHey, Carl. Just wanted to ask a couple of quick ones here.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nSure.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nJust thinking about some of the out-year drivers that you have working for you to your point prior. One of the things that came out of that Analyst Day that you did or the R&D Day was that there are things in the pipeline that use a lot more CleanCap actually substantially more in some cases. Do you think the '23 is the year where that might start to matter or do we need to just get further down the development pipeline process in order to really kind of move the needle there?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nYeah, that's a thoughtful question. I would say I agree with Kevin on the characterization of '23 is a transitional year. I don't think you're going to see many, if any, of those therapeutic compounds, which is what you're alluding to there get clearance and commercial traction right away. So I think those are more longer-term drivers of demand.\n\nBut certainly, there's a lot of people doing. And as you can see from our customer account numbers in each of the various segments, if you will, they're all increasing robustly.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOK. Helpful. And then just maybe a last quick one. When it comes to Pfizer and the vaccine forecast, do you get that forecast ahead of the guidance for the year? Or do you find out about it basically when we do when they get on the call for investors? I'm just generally curious.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nInteresting question. Let's just say that we do pay very close attention when Pfizer says something one days before our earnings call. Was that clear enough?\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nYeah, fair enough. Thanks, Carl.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nAll right. You bet.\n\nOperator\n\nOur next question comes from the line of Dan Leonard with Credit Suisse. Please proceed with your question.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nHey, Dan.\n\nDan Leonard -- Credit Suisse -- Analyst\n\nHey, Carl. I have 2. So previously, Carl, you gave a $2 billion dose number as the backbone for your 2023 COVID forecast -- COVID CleanCap forecast. What's the new dose number you're assuming behind the $100 million view for endemic COVID?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nI basically divide it by two, since we're talking about moving from $200 million or low end, down to $100 million. So I think it's that degree. There may be some inefficiencies that would cause it to be a little bit higher. But I think that's overall generally a good estimate.\n\nDan Leonard -- Credit Suisse -- Analyst\n\nOK. And then my follow-up, just can you comment at all on margins in 1H versus 2H in 2023?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nNo, we haven't gotten to that point with our guidance yet. So I think that's a stay tuned for the end of the year poll.\n\nDan Leonard -- Credit Suisse -- Analyst\n\nOK, thank you.\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nAll right. Thank you. Doug, anything else?\n\nOperator\n\nWe have one last one from Brandon Couillard with Jefferies. Please proceed with your question.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nHey. Thanks for squeezing me in. Just a housekeeping one for Kevin. The large customer orders that didn't recur in the NAP segment from 3Q last year, could you just size that? And is there another similar headwind on a year-over-year basis in the fourth quarter?\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nNo, we actually had a bit of a down quarter in Q4 of 2021 sequentially there from the run rates we've been seeing in the NAP business in the fourth quarter. So it was a more than $10 million specific order that came through from a customer, again, related to non-COVID demand. We see -- we don't -- we saw that in the third quarter of 2021. We'll have some like -- even though slightly -- it's a different customer this time around in the fourth quarter, driving some CleanCap stand-alone demand in the fourth quarter of this year that's already locked in, in the fourth quarter of 2022 and some continued good momentum on our mRNA services business that will result in that strong Q4 finish to 2022 in the non-COVID business.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nThanks. And last one, Carl, is it safe to say, based on your comments that the CEO transition being in flux won't diminish your appetite or willingness to act when it comes to target assets you'd like to pursue?\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nAbsolutely not. We're fully engaged in the same things that we were looking at a month ago, and our appetite for those deals remains as robust as it was the first time around. Another way of saying, we're not going to let ourselves get distracted. \n\nBrandon Couillard -- Jefferies -- Analyst\n\nVery good. Thank you. \n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nAll right. Thank you. And Doug, I think we can turn it back over to Deb now?\n\nOperator\n\nYes. I'd like to hand it back to Debra Hart for closing remarks.\n\nDeb Hart -- Head of Investor Relations\n\nWell, thanks, Doug, and we want to thank you all for joining the call today. We'll be participating in a couple of financial conferences this quarter. So you can find out more details about that from our website. Feel free to call me with any additional questions.\n\nAnd we hope you all have a great evening. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDeb Hart -- Head of Investor Relations\n\nCarl Hull -- Executive Chairman and Interim Chief Executive Officer\n\nKevin Herde -- Executive Vice President and Chief Financial Officer\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nJohn Sourbeer -- UBS -- Analyst\n\nPaul Knight -- KeyBanc Capital Markets -- Analyst\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nMadeline Mollman -- William Blair -- Analyst\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nDan Leonard -- Credit Suisse -- Analyst\n\nBrandon Couillard -- Jefferies -- Analyst\n\nMore MRVI analysis\n\nAll earnings call transcripts"
}