{
  "companyName": "Baozun",
  "companyTicker": "BZUN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/baozun-bzun-q2-2022-earnings-call-transcript/",
  "content": "Baozun (BZUN 3.11%)\nQ2 2022 Earnings Call\nAug 23, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and thank you for standing by for Baozun's second quarter 2022 earnings conference call. [Operator instructions] As a reminder, today's conference call is being recorded. I will now turn the meeting over to your host for today's call, Ms. Wendy Sun, senior director of corporate development and investor relations of Baozun.\n\nPlease proceed, Wendy.\n\nWendy Sun -- Senior Director, Corporate Development and Investor Relations\n\nThank you, operator. Hello, everyone, and thank you for joining us today. Our second quarter 2022 earnings release was distributed earlier and is available on our IR website at ir.baozun.com as well as on global newswire services. They have also posted a PowerPoint presentation that accompanies our comments to the same IR site, where they are available for download.\n\nOn the call today from Baozun, we have Mr. Vincent Qiu, chairman and chief executive officer; Mr. Arthur Yu, chief financial officer; and Ms. Tracy Li, our vice president of strategic business development.\n\nMr. Qiu will review the business operations and the company highlights, followed by Mr. Yu, who will discuss financials and guidance. They will all be available to answer your questions during the Q&A session that follows.\n\nBefore we begin, I would like to remind you that this conference call contains forward-looking statements within the meaning of the Securities Exchange Act of 1934 and the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements are based upon management's current expectations and current market and operating conditions and relate to events that involve known or unknown risks, uncertainties and other factors, all of which are difficult to predict and many of which are beyond the company's control, which may cause the company's actual results to differ materially from those in the forward-looking statements. Further information regarding these and other risks, uncertainties or factors is included in the company's filings with the U.S.\n\nSEC and the announcement on the website of Hong Kong Stock Exchange. The company does not undertake any obligation to update any forward-looking statements, except as required under applicable law. Finally, please note that unless otherwise stated, all figures mentioned during this conference call are in RMB and the comparisons are on year-over-year basis. It is now my pleasure to introduce our chairman and chief executive officer, Mr.\n\nVincent Qiu. Vincent, please go ahead.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nThank you, Wendy. Hello, everyone, and thank you all for joining us. As you know, in April and May 2022 there was a strict COVID lockdown in many key cities of China including Shanghai, where Baozun is headquartered. In the phase of COVID related logistics interruptions, our team quickly mobilized infrastructures to minimize disruptions and maintain operations.\n\nOverall, as shown on Slide No. 2, our total net revenue declined by 8% year over year, while services revenues increased by 7%, demonstrating once again our resiliency to macro uncertainties. The pandemic has accelerated the need to cope with drastic interruptions and urgency of digital transformation across a wide range of brands that we serve. Please turn to Slide No.\n\n3, the selling trend in the rapid convergence between online/offline, or OmO, Baozun's omni-channel solution enable OmO by integrating brand partners resources including digitalized -- digitized advertisers of brake and motor stores, mobilized sales associates and shared inventories that has become the lifeline of e-commerce during the strict COVID lockdown. We also benefited from the deployment of our intelligent customer service management system, S-ANY, which can support remote execution and enhanced quality. With S-ANY our staff can log into the system from anywhere and the system will keep monitoring real-time data of customer service behavior across channels. With our seamless integrated technology, we are pleased that Baozun has become brand de facto, aid and relief when it comes to overcoming uncertainties and challenges like the COVID lockdowns.\n\nAnd as always, we kept developing additional services. For instance, we updated -- upgraded digital content and enabled more virtual reality functions for one leading sportswear brand and also launched short video services, leveraging our multiregional service centers network. All these efforts helped enrich consumer experience and empower many of our brand partners to success during the 6/18 campaign. Now, please turn to Slide No.\n\n4 to share more about our progress on the business development. During the quarter, luxury and the premium brands continue to surge forward and we also added more subcategories, including outdoor cosmetics and the fast moving consumer goods, thereby enhancing our diversification. Overall, we added a net of 10 new brand partners in the second quarter, and the total number of brand partners for store operations increased to 355. While we prioritized the new partnerships, we inspire existing partners to launch more channels.\n\nBy the end of the second quarter, we operated approximately 40% of our brand partners in omni-channel approach compared with about 33% a year ago, making a milestone in our omni-channel vision. This August our capabilities and track record helped us gain greater recognition in Tencent mini program e-commerce ecosystems. We were honored to be accredited by Tencent as a partner of excellent category for e-commerce operator and independent service vendor, or ISV, for Tencent Cloud Mall, an outstanding category for business development partner, with these recognitions, we became the only service partner that is top listed in both Alibaba, Tmall, and Tencent mini program e-commerce ecosystem. We're now further collaborating with Tencent on several initiatives such as in traffic acquisition and smart new retail.\n\nNext our momentum toward our vision tech of technology empowers the future success. We are seeing strong demand from our clients for technologies and solutions to manage not only retail, but also distribution network. For example, our big successful project with leading electronic giant continue to expand. During the quarter we completed a nationwide integration in mini program and the JD-Daojia for all of office over 3,000 stores, enabling us to generate license revenue in recurrent stream.\n\nWe're now in next phase of incorporating Tmall and Meituan Dianping to this digital platform to fully integrate business flows from factories, to stores and to consumers. Another example is one, we were recently secured world leading sports equipment retailer to co-build its digital operating platform. Thus far we have established a business pipeline with over a dozen of brand partners in technology integration. We believe as brand partners elevate their efforts in digital transformation, technology remains the backbone of our widening competitive advantages.\n\nNow move on to our progress in logistics and supply chain businesses. Despite the disruptions in some areas during the COVID lockdown, we not only were able to uphold operations at our own warehouses, but also guided our brand partners to quickly transit from centralized warehousing to a great management system, We further deepened our cooperation with Cainiao to leverage its established infrastructure and network. During the quarter we started to manage Cainiao's warehouse in the apparel category, got some business referrals in luxury and the premium sector and the launched more RFID based solutions for some of our key sponsor brands. Motivated by these early synergies, we will appraise the existing lines to further streamline and advanced additional strategic objectives.\n\nAnd during all the external uncertainties we were able to demonstrate our resiliency and accountability. Meanwhile, we are executing our midterm plan with discipline. And strategically investing in our business transformation to expand our total addressable market. For example, please turn to Slide No.\n\n5. In brand management, we see a natural move to expand up upstream in value chain, leveraging our digitalization capabilities and growing penetration of e-commerce and marketing insights. Brand management enhance value proposition from end-to-end solutions, which will also in turn enhance our strategic thinking and cultivate a brand-oriented service philosophy. Since last year we initiated our brand management efforts via multiple approaches, including strategical alliance through minority investment and self-incubation.\n\nWe have assembled a diverse and attractive portfolio of seven brands to start with covering two major categories of apparel and accessories, and health and beauty. We are happy to report that we have empowered these brands to a mass of total GMV of approximately 80 million in the first half of 2022. This translated to a year-over-year grow rate of over 50% strongly performing the general retail industry. Finally, on ESG and the sustainable growth turn to Slide No.\n\n6. We issued our second annual ESG report this May and launched an additional set of green initiative, including the introduction of Carbon Neutrality White Paper in June. We are committed to reduce 50% of carbon emission by 2030 compared to the 2021 baseline, and the carbon neutrality by 2050. This quarter we kicked off our public welfare initiatives by co-launching a used-shoes recycling program with one leading national sportswear brand.\n\nAs a leader in e-commerce services, we will always bear in mind to operate responsibly, accountably, and sustainably. We look forward to expanding with our brand partners to mutual successes. I will now pass the call over to Arthur to go over our financials. Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK, thank you, Vincent, and hello everyone. Now, let me first do a quick review of financial of second quarter in 2022. Please turn to Slide No. 7.\n\nDuring the quarter, our total GMV increased by 47% to 23 billion. The strong GMV growth was mainly due to outstanding performance by one leading electronics brand and service fee model. And excluding this particular brand, the adjusted GMV would have grow by 2.4%. Total revenues declined by 8% to 2.1 billion, of which product sales declined 29%, while service revenue increased by 7% compared with the same period of last year.\n\nNow, let's turn to Slide No. 8 for a breakdown of revenue. During the quarter revenue from our traditional e-commerce partner business accounted for 50% of total business. Revenue for warehouse and logistics contributed 29%, and digital marketing and IT solutions contributed the remaining 21%.\n\nThe outbreak of COVID and subsequent strict lockdown in April and May has a general negative impact on our business. However, we are delighted to see that our luxury category still achieved double-digit growth. There was also more resiliency in value-added services where warehouse and fulfillment service revenue increased by 20%, and digital marketing and IT solution declined only 4%. And due to COVID lockdown impact, product sales revenue declined by 29%, reflecting a general weak sentiment in product sales.\n\nAs well as our proactive measures to optimize working capital efficiency. And given the current uncertainty in geopolitical event and micro environments, we believe it is critical to continue to focus on high quality revenue stream to minimize risks in the coming quarters. And as such, we have put more efforts on non-distribution model to grow revenues from value-added services while the emphasizing distribution model on product sales. Now, turn to Slide No.\n\n9. During the quarter, our cost of products decreased by 26% for 602 million, mainly due to a reduction in product sales. Our gross profit margin for product sales was 13.2% for the quarter, mostly due to a change in pricing strategy and adjustments in category mix and the increasing cost related to default and imperfect products. But if we take into account service revenue, our growth -- our overall gross margin improved 7% to 72% driven by higher revenue stream contribution that generates a higher margin.\n\nNow, let's turn to operating cost and expenses on Slide No. 10. Fulfillment expenses were 725 million, an increase of 29%, which was largely due to the revenue growth in warehouse and logistics services, and some incremental cost related to COVID protection for front-end fulfillment staff. We are glad to see our regional service center ramp up and the efficiency of customer service has improved to a point that such cost declined by 2% year over year.\n\nOur sales and marketing expenses were 668 million, an increase of 3% mainly due to increase the business development related staff costs to drive business growth, an offset by efficiency improvement. Technology and content expenses were 112 million, a decrease of 3%. The decrease was mainly driven by the company's cost control initiatives and efficiency improvements, which was partially offset by the company's ongoing investment in technological innovation and productization. G&A expenses were totaled 92 million, a decrease of 6%.\n\nThe decrease was primarily attributable to the company's cost control initiatives and efficiency improvements, and a higher base from the running period for the company's new headquarters in the same period of last year. Now turn to Slide No. 11. Based on the above mentioned item, our non-GAAP income from operations was 47 million during the quarter and non-GAAP operating profit margin was 2.2%.\n\nOnce again, we have prepared a waterfall diagram depicting our analysis of how our top line and bottom line evolved year over year. As a reminder, this analysis is unaudited and should solely be used as supporting numbers to aid discussions. First, on Slide No. 12.\n\nThis waterfall diagram shows our net revenue's walk from Q1 2021 to Q2 2022. In red, you can see that the biggest item impacting our revenue this quarter was product sales. As mentioned earlier, the two major factors contributing to this drop were our continuous efforts in brand optimization and the week product sales due to COVID lockdown, mainly from one key brand in personal care product categories. Revenue from digital marketing and IT services, which we view as value added services declined slightly this quarter by 4%.\n\nThis slight decline in digital marketing and IT revenue can also be attributable to the COVID lockdown that negatively impact several new project launch from brand partners. On a positive note this initiative in value added service led to better profitability. And please follow me to Slide No. 13 for the indicative work of non-GAAP operating profit and cost stream.\n\nAs shown, non-GAAP operating profit from digital marketing and IT improved by 19%. We also generated a positive saving of 15 million from cost optimization, while at the same time we kept investing in new opportunities. We spent 40 million on brand management, overseas expansion and COVID protection and welfare for employees during the lockdown. For our traditional store operation business and warehouse and fulfillment business, the challenging external environment dragged down the overall top line will also triggered higher operating expenses during COVID lockdown.\n\nPlease turn to a Slide No. 14. To counter these highwinds caused by COVID lockdown. We continued our cost transformation and optimization effort mainly focused on four areas.\n\nFirstly, we proactively minimize the risk by diversifying regional service center functions, including store operations, design, digital marketing and technology capabilities. Following our success with regional service center in Nantong and Hefei, we have selected more cities for the next phase of expansion including: Jinan, Chengdu and Enshi. Secondly, we continue to reengineer our business processes by centralizing our operating capabilities where we use one-team to serve multi-brand with similar tasks. We also introduce a couple of new automation and intelligence tools to increase productivity and reduce labor costs.\n\nCertainly we rationalized our compensation incentive for our frontline employees by introducing the Baozun business owner i.e., BBO contact, which was designed to motivate our employees to take ownership of their roles and offer more entrepreneurial incentive for reward performance. And finally, after moving into the new headquarter building we were able to consolidate the office footprint across all departments into one place and further streamline supporting functions, such as finance, administration and procurement to reduce cost. Now, I'd like to turn to Page 15 about our cash flow. As of June 30, 2022, our cash and cash equivalents totaled 3.1 billion.\n\nIn light of the macro uncertainties, we continue to prioritize working capital efficiency enhancement and launched new initiative to further advance our back-end process to improve inventory management, billing and collection activities. As a result, we are pleased to sustain a positive operating cash flow of 405 million during the challenging period of COVID lockdown. Meanwhile, we moved forward with our share buyback assets and purchase of convertible senior notes, which totaled 992 million during the quarter. And lastly, our board of directors has approved us to pursue the voluntary conversion to dual primary listing on the Hong Kong Stock Exchange.\n\nAs of today, we are happy to announce that we have received the acknowledgement from Hong Kong Stock Exchange regarding the conversion to dual primary listing. We expect the primary conversion to become effective on November 1, 2022. After the primary conversion becomes effect, Baozun will become a dual primary listed company on the NASDAQ global selected market. And the main board of Hong Kong Stock Exchange.\n\nAnd becoming primary listed on both exchanges, we anticipate expanding our access to a wider investor base. Overall despite some turbulence in macro environment, our ability to conduct business during the lockdown highlight the flexibility and resilience of our business model. We will continue to prioritize resource allocation, drive cost transformation, and improve working capital efficiency. We believe our solid balance sheet, our improved momentum in value-added service and our well diversified brand partner portfolio will not only prepare us to get through the top market environment ahead, but also enable us to emerge as a stronger business with sustainable long-term growth.\n\nSo this is my financial review section. And that concludes our prepared remarks. Thank you, everyone. Operator, we are now ready to begin the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] And your first question today comes from the line of Alicia Yap from Citi. Please go ahead. Your line is open.\n\nAlicia Yap -- Citi -- Analyst\n\nHi, thank you. Good evening, management. Thanks for taking my questions. I have two questions.\n\nThe first one is related to the progress and traction for the non-Tmall channels. It seems like this quarter, the contributions declined from last year to 24%. Could management share more color, the reasons of this mix and how we should be thinking about the future growth opportunity for all these alternative channel? For this quarter specifically should be, is this suggesting the brands are remain quite resilient or actually returning more to Tmall channels? And then the second question is can you update us on your relationship with iClick? How is the business cooperation with iClick so far? Is the investment and strategic business collaborations working as plan any color the management could provide will be appreciated? Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK, Alicia, I will take your question. So this is Arthur here. So first of all, on the non-Tmall the percentage, so basically the number you have seen is based on including a very strong performance of one major leading electronic brand during the 6/18. And if we exclude this one leading electronic brand, actually non-Tmall represents 48% of total our GMV this quarter compared with 43% last year, which is an improvement of 5% year over year.\n\nAnd this is actually demonstrated our omni-channel strategy has continued to make assets. We also see that more brand is starting to utilizing the non-Tmall channel to grow the e-commerce business. And as we have mentioned earlier, we have made good progress in not only Tencent, but also we made good progress in JD and other private omnichannel as well. On your second question, regarding the cooperation with iClick.\n\nSo basically just a recap the main purpose of us making the investments into iClick is to enjoy the operational synergy by Baozun operating the back-end of operations, and iClick having -- and iClick having a front-end kind of system, which allow us to jointly feed and pitch more customers. So basically the integration we fully completed and we have seen good progress in terms of the joint BD. And as a result, you can see, we mentioned earlier our Tencent ecosystem had made a major progress in this year where we were awarded, I mean, we were awarded two good rating one I mean, in two categories, one in the e-commerce operation, our Tencent ecosystem had made a major program in this year, where we were awarded, I mean, we were awarded to good reaching one, I mean in two categories, one in the e-commerce operations and another in the ISV, both of them is actually in the top category of the Tencent ecosystem and that cannot be achieved without the support along with iClick. So after that, we actually become the only one company in China, which enjoys the top rating in Tmall, which is the six-star rated TP, and also the top rated in the Tencent system making us the best service provider for both the public domain and private domain.\n\nSo this is what we have seen the progress and the strategic kind of opportunity we opened along with the investment into iClick.\n\nAlicia Yap -- Citi -- Analyst\n\nI see this is very helpful. Thank you, Arthur. Congrats on this solid achievement.\n\nArthur Yu -- Chief Financial Officer\n\nThank you, Alicia. Thank you.\n\nOperator\n\nThank you. We will now move to our next question, please, standby. The next question comes from Thomas Chong from Jefferies. Please go ahead.\n\nYour line is open.\n\nThomas Chong -- Jefferies -- Analyst\n\nThanks management for taking my questions. I have two questions. First is about the recent trend. Can management comment about the impact of the macro headwinds and the consumer sentiment to our overall business, and also the trends of different categories in June and July and August so far? And my second question is about our cooperation with China.\n\nCan management provide an update about the cooperation and also share our thoughts about the expansion into Southeast Asia markets? Thank you.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nOK. So maybe Tracy you answer the first one. Then I will take the one about China.\n\nTracy Li -- Vice President, Strategic Business Development\n\nThank you, Jefferies. I'm going to cover the first one. So regarding the digital consumption actually will be monitor closing those three months. After two months, the rough time actually the accumulated consumer demands have had help us to achieve a very successful 6/18 as Vincent mentioned.\n\nAnd since this two months, we can see the traffic and GMV is up from July to August. So the overall of consumption has gradually recovered. Although it hasn't been really recovered to the same level compared with last year, but we think the trend is good. And that is, it is the very similar situation on the consumer sentiment here, the market is facing the challenge of the free traffic shout and the lower readout the conversion, and also the higher rate on cancel and the return cross categories.\n\nAnd I think this is the shared landscape cross different categories, the 5% up and down cross different category, but we can see the platform are taking many initiatives to upgrade the APPs consumer experience like the initial the market delivery addressing one other in those two weeks. So we believe all of those investment will harvest the consumer's preference in longer term. And from Baozun side, actually in the past one quarter, we put a lot of attention on the consumer experience too, were actually working with our brand partner to launch new features, like to digitalize the poster sale, consumer care service. Like we, we have -- many of our clients to enable the cleaning and maintenance service about over 1,000 product so that our consumer can enable to enjoying the same premier service online, offline, and also our design hub to launch the 3D display modeling service, and also the gift card and also the Tmall exclusive capital in the CBD period.\n\nSo all of these tactics I think will help us to communicate with the young generation. And also, I think in the longer term, we will build the competence in the consumer sentiments and the consumption. Yes.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nOK. Thank you, Tracy. I will answer the first -- I mean, the second question. I think this question actually have two parts on the cooperation with Cainiao.\n\nWe are making good progress quarter on quarter. So basically we have operate mainly in three areas. So the first one we have been jointly BD in several luxury and primary apparel brand with some good results and we see that has one of the major opportunity for us incorporating with China. And secondly, Baozun was able to utilize China's national wide capability on logistics and warehouse.\n\nSo during the 6/18, we were able to use the China capability to operate the great management system, which allows the delivery in a faster speed to the customers, so that help us to achieve a good result in the 6/18 campaign. And thirdly, both Tmall and Baozun are actually technology very strong company. So basically, in this quarter we start the operation on the RFID technology and we adapt that technology on a few international sportswear brands, which helps to improve the efficiency and to improve the customer satisfaction. So we see a great future and continued success in working together with China.\n\nOn your second part of the question in terms of expanding overseas markets, so basically since early this year, we have started our -- started to expand outside of China. So so far we have offices in Singapore and also in Paris, in France. And we started to build our footprint in both Asia and outside of China and also Europe with additional people and additional kind of the network on the ground. So as of this quarter, we actually can see about 200 million GMV, which we're generating from outside of China.\n\nAnd this amount is actually growing quarter by quarter. Our international growth strategy is focused on replicating our China e-commerce success and take the learnings we have in China and adjusted for the local practice and also to utilize the local know-how to make it a second generation of e-commerce in each of the markets we aim to operate. And in our approach to grow internationally, we will consider both the organic growth and also the inorganic growth as we mentioned in the past as part of our M&A strategy, so that is about our oversea expansion.\n\nThomas Chong -- Jefferies -- Analyst\n\nGot it. Very helpful. Thank you.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We will now take our next question. Please, standby. And your next question comes from the line of Joyce Ju, Bank of America.\n\nPlease go ahead. Your line is open.\n\nJoyce Ju -- Bank of America Merrill Lynch -- Analyst\n\nGood evening, Vince and Arthur and Wendy. Thanks for taking my questions. I have two questions. The first one is the big picture one.\n\nAs we all know, there is actually a lot of chance in macroeconomic condition in regulation -- in regulatory requirements in industry dynamics and also the competitive markets. So I want to know like from a management perspective, what's the top priority of Baozun right now? Is there any change in the company's strategic direction? And my second question will be regarding the like upcoming Singles Day promotion. I'm wondering like how is the preparation from the brand's perspective? Have we made any plans start to and how is the momentum look like at this time? Yeah, thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you, Joyce. I think maybe Vincent, you can share some high level thoughts on the first question and Tracy you may be able to handle the second one. Yeah? Is that OK?\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nSure, thank you. Yes, Arthur, thank you. Thank you, Joyce, for the question. Yes, talking about the priorities of the strategy, I will pick three.\n\nI think the first one is of course the China e-commerce market, that is which is our core business. I think despite all the negative impact from different angles, we still think the Chinese e-commerce market will be quite robust and there is lot -- still a lot of potential to grow in future. So we will focus, still focus a lot in this area trying to not only to have a more valuable customers, but also make our operations and technologies more efficient to support the future growth. That is number one.\n\nNumber two is we think technology as always we keep investing in this area. And right now we think we're stronger and stronger in the industry. And we want to touch the existing and potential new users through this technology arm. And we are seeing a really good progress in the first half of this year as well.\n\nAnd I think also the charm between this tool is that when this tool can be connect to each other or leverage to each other, we see a very much, much better result of effect of one plus one much bigger than two effect. That means that when we talk to potential technology clients, our experience in China, the e-commerce will help a lot. And when we talk to e-commerce customers, technology will also play a very important role, so I think the charm between the tool is very important. So number three, I think, will be overseas expansion.\n\nAs you'll see, we have a lot of progress too. And we use this business plus investment approach, which Arthur just said organic and inorganic together. So we are quite confident we can continuously make a progress in the second half of this year as well. So I think this is really quite important top priorities for today's work and it's quite in line with our midterm plan.\n\nYes so that is the first part of our thinking. The second one about the double 11 thing, I think Tracy, you can answer this.\n\nTracy Li -- Vice President, Strategic Business Development\n\nYeah, sure. Thank you, Vincent. So actually talking about double 11, I think it's still in the early stage because we have been moving the real stage to talk about the inventory and the investment level, but soon the top conversation with their leadership team on in marketing brands. I think they're ambitious is still there.\n\nIt's still there. They seek for the next second half of the year, I think, most of brands they are new for the launch plan and also the marketing investment is still at the same level right now. But from the attitude part right now, they are still on the fence. For some of the brands, I think they have the healthy economy situation based on their Omni channel landscape and also their product bonus part, their marketing investment and stock level is a little bit higher.\n\nI mean, prepared for the double 11. But we still put close monitor on our line and the cost structures. But at current stage, I think when we see the double 11 in the next maybe three months later, I think, the most important thing is we need a -- I think, we are still in the recovering period actually from Baozun operation plan, point of view we think we need take at least the six-month plan to focus on two things. First is, is to move the focus of a daily sales to margin part and new product part, not that discount concentrate.\n\nAnd the second is on the resource concentration and the stock level and the barge part to put efforts on the big promotion. And the third part is to mitigate actually I mean, the impact of the missing of the top QL host and to build a metrics for new livestream eco ecosystem. So that is the top three, including the daily sales and the big promotion, and also the livestream part. We will build into our six-month plan to work with our brand partner to mitigate the impact of COVID-19.\n\nI hope this will help to solve the problem. And we keep close communicate with them and share more information later.\n\nJoyce Ju -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Thanks a lot.\n\nTracy Li -- Vice President, Strategic Business Development\n\nThank you. Yeah.\n\nOperator\n\nThank you. We will now take our next question. Please stand by. And your next question comes from the line of Charlie Chen from China Renaissance.\n\nPlease go ahead. Your line is open.\n\nCharlie Chen -- China Renaissance Securities -- Analyst\n\nHi, management. Thanks for taking my questions. I got two questions here. The first one is about the performance of some international brand partners from some international apparel brands, financial reports, we can see their performance in China has been rather disappointing as Baozun has been existing long-term partner with some of the key international apparel brands.\n\nWhat is the management strategy to basically turn around this trend? Or is there any other brands that can compensate the revenue shortfall from the international apparel brands? So that's the first question. And the second question is basically is a follow-up question. So Baozun has been the partner of internet marketing for a lot of brands for a long time. So going forward, I want to get some color on how Baozun can sustain the growth or even create the second growth curve? In particular, is there any further penetration that we can do with international brands in China or we should bring some international brands into Chinese market? Or on the other side is there strong enough demand from domestic brands in international internet marketing? Or do we have any plan to bring those domestic brands outside of China to overseas market? So I want to get some color on that.\n\nThank you.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nOK. So on the first one, maybe I will just share some brief thoughts and Tracy, you can add on top of that. So given the current challenge, we are actually looking at two ways of counter the challenge at the moment. Number one is you can see, we put more emphasize on the value-added service, the things like our digital marketing, our IT solutions, and also our logistics and warehouse services.\n\nThese are value-added service on top of the e-commerce operation, which on one hand is going to generate new revenue streams, and also plays a part to helping us to get into more penetration into the new customer base. So that's one. Secondly, we have made a lot of effort and have seen good progress in terms of the BD things last year. We now have established essential business development team across all the different categories.\n\nAnd at this moment we have created a long list of potential BD and which we have seen good opportunity to go further in terms of getting more brand on board with our capability on other. So maybe, Tracy, you want to add more?\n\nTracy Li -- Vice President, Strategic Business Development\n\nSure. Thanks. I think I can add more elements on the second point because actually I think BD has been proven one of the key driving factor for our business right now. We have three highlights in the first half the year.\n\nI think the first one is we have very solid programs on the Jing Dou and website, meaningful program channel with -- actually we're going to have, I think, at least 20 significant store opens by this year and this cross category in luxury and beauty and in sports category. And also in this, we can see from the Jing Dou channel, actually they show relatively higher growth, especially in the 6/18. And their potential on sales haven't been fully unleashed considering most of the store in early stage of the operation. So it should contribute more in our business landscape for next year.\n\nAnd secondly, I think, for the category parts, besides the apparel going digital, we also have very good progressing lifestyle-related category to work with the higher quality brands actually is including foreign and local brands in food and the house leaving things related. So we are able to balance the category mix and the seek sustainable growth. Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nThank you, Tracy. And also, I think for the second question on the second curve in terms of the business, I think it's a very good question. So before we talk about the second curve, actually the main priority for us is to make sure our existing e-commerce business is grow in a very solid way. So basically, as I mentioned earlier, we will prioritize quality over above the kind of the pace of the growth, we will protect our margin and protect our cash flow.\n\nAnd we hope that e-commerce, which as Vincent mentioned earlier, which is strong -- which still presents a quite significant opportunity in the Chinese market, we will tackle this market to protect our existing business and profitability. And on top of that, so we will focus on a few areas, which in line with what Vincent just had our strategic priority. The first one is technology and digital enhanced value-added service. So this is the core capability of Baozun, which we have been building over the last 15 years.\n\nWe have made a big investment and our capability is very unique and highly valued by the enterprise client, which they need our OMS and our kind of the back-end systems to integrate for the e-commerce operations. So given today, many of our enterprise customer pushing into the D2C initiative and also driving the digital transformation, we have seen in the market, a growing demand for those kind of technology solutions, which Baozun is very good position to offer. So that's on the technology. On top of the technology, if we combine the technology kind of the transformation capability we have, and also the e-commerce -- and the e-commerce operation capability we have, we actually will be able to enter into the brand management space by utilizing our digital capability to transform a brand end-to-end.\n\nIn the slides we have showed earlier, the brands we emphasize and we deeply manage end-to-end has showed over 50% growth year over year, which is quite a good result. At the same time, from the learning of managing a brand end-to-end, we will be able to build more experience and more learnings, which we can come back to feedback to our existing PP customers to benefit. So that's where we see the second part of our growth. And then finally, as I mentioned earlier, it's the oversea expansion.\n\nSo basically technology, brand management, and oversea expansion will play a big part in our second curve of growth.\n\nJoyce Ju -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you.\n\nOperator\n\nThank you. [Operator instructions] Your next question comes from the line of Leo You from CLSA. Please go ahead. Your line is open.\n\nLeo You -- CLSA -- Analyst\n\nHi. Good evening, management. Congratulations on the solid results. So I have a question on the margin outlook of the second half.\n\nSo would we expect further margin improvement compared to would we have last year, will we see any further benefits arising from our continuing cost transformation efforts? And also a small question on the use of cash. So how should we think about the capital expenditure in the second half? Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you for the question. I think for the first half, I mean, for the first question on the margin, we will keep driving the cost of transformation and also we will prioritize our cash flow for the improvement in the second half of the year. But in terms of the overall market dynamic there are still a lot of uncertainty, which caused by the potential COVID lockdown and also the slowdown of the overall economy, which has a lockdown impact into the product sales margin and also our -- the overall growth.\n\nSo which I would just only to say, we will travel banks to protect and improve our margin with the initiative we have on the ground, but in terms of the end result, we have to wait and see, but we will keep the market updated when we have see a little bit more kind of coming in toward the later part of this quarter. On the second one, in terms of the cash, so at this moment we actually prioritize the cash above the growth. So basically during the period of uncertainty cash is the key. So on one hand; we're improving our working capital to reduce the inventory level at the same time to increase the speed of collection trying to improve our operating cash flow, at the same time in terms of the investment activities we put a higher quality for our investment in this year.\n\nAnd also given the uncertainty into the Chinese market we actually pulled some of the activity, especially the kind of the consolidation of the similar TP on hold in China. But outside of China, we do look at opportunity to further grow as we mentioned in terms of the investment into the brand management, the investment into the overseas expansion, the two directions that we will keep making the investment. And finally as we have always seen Baozun is a technology company and the investment into the technology will be one of our priority and we think that will help us to build a sustainable business into the future. OK.\n\nOperator\n\nThank you. I'm not sure if Leo You is still connected. I will go to the next question, Sir. Please stand by.\n\nAnd your next question comes on the line of Wan Jihao from CICC. Please go ahead. Your line is open.\n\nUnknown speaker\n\nGood evening, management. My question is also about brand partners. As the macro environment is weak did you lose any big brand partners this quarter due to the operations by themselves or due to foreign brands closing offline store in China? Thank you.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nOK. So maybe I will share a little bit insight and Tracy add more. So basically what we have seen at this moment is the brand partner starting to put more cautious approach in terms of the e-commerce -- how they run the e-commerce. So on one hand given they also focus on the efficiency over the growth and several of the brand partner has put a kind of quality over the growth speed.\n\nThey're actually looking for a stable partner to work with them, to develop a long-term approach. So this is what we have seen the churn has been reduced over the last couple of quarter with the uncertainty increase. And secondly in the China e-commerce market, it's actually the evolvement of this market has changed very quickly. New channels coming out every several quarters, new ways of operating the e-commerce has changed over time to time in a very fast pace.\n\nSo in order to catch the market the brand partner actually need the service provider like Baozun who has the capability to keep in the front of everything is happening on e-commerce. We will be able to learn from the many different brands and will bring that the knowledge and also experience from the e-commerce and adds value to our brand partners. So that gave us a good advantage in terms of keeping and expanding our service into the brand partners. So that's some of the insight I have seen.\n\nTracy, you want to add more?\n\nTracy Li -- Vice President, Strategic Business Development\n\nYes. I think exactly as a strategic partner, actually right now the key about the long-term direction things as well when we are working with our brands to development, I think at least the 18 months the operation plan to conclude the impact of COVID-19. Like in this two or three months is the quite period, how to rationalize the investment and save the effort, test the water that is key. But for the next six months is the recovering period.\n\nAs I mentioned, how to move the focus of the daily sales and how to prepare for the big promotion and to mitigate the top KOL missing issues and about turning into the next year in the developing period and how we can work with the brands to use market, how to see values on the channel content and the marketing campaign to rebuild the brand equity and recall the consumer group. And that is the key, I think in the longer term we work with the brands to support the impact of the COVID-19, yes. Thank you.\n\nUnknown speaker\n\nVery clear. Thank you.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. I will now hand the call back to Wendy for closing remarks.\n\nWendy Sun -- Senior Director, Corporate Development and Investor Relations\n\nOK. Thank you, Operator. In closing, on behalf of the management team we'd like to thank you for all your participant today. \n\nOperator\n\nIt's Wendy for closing remarks. \n\nWendy Sun -- Senior Director, Corporate Development and Investor Relations\n\nTo reach out to us. Thank you for joining us. And this concludes the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWendy Sun -- Senior Director, Corporate Development and Investor Relations\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nArthur Yu -- Chief Financial Officer\n\nAlicia Yap -- Citi -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nTracy Li -- Vice President, Strategic Business Development\n\nJoyce Ju -- Bank of America Merrill Lynch -- Analyst\n\nCharlie Chen -- China Renaissance Securities -- Analyst\n\nLeo You -- CLSA -- Analyst\n\nUnknown speaker\n\nMore BZUN analysis\n\nAll earnings call transcripts"
}