{
  "companyName": "Align Technology",
  "companyTicker": "ALGN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/align-technology-algn-q3-2022-earnings-call-transc/",
  "content": "Align Technology (ALGN -0.58%)\nQ3 2022 Earnings Call\nOct 26, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings. Welcome to the Align Q3 2022 earnings call. At this time, all participants are in a listen mode only. A question-and-answer session will follow the formal presentation.\n\nPlease note this conference is being recorded. I would now like to turn the conference over to our host, Shirley Stacy, with Align Technology. You may begin.\n\nShirley Stacy -- Vice President, Corporate Communications and Investor Relations\n\nGood afternoon, and thank you for joining us. I'm Shirley Stacy, vice president of corporate communications and investor relations. Joining me for today's call is Joe Hogan, president and CEO; and John Morici, CFO. We issued third-quarter 2022 financial results today via Business Wire, which is available on our website at investor.aligntech.com.\n\nToday's conference call is being audio webcast and will be archived on our website for approximately one month. A telephone replay will be available today by approximately 5:30 p.m. Eastern Time through 5:30 p.m. Eastern Time on November 9.\n\nTo access the telephone replay, domestic callers should dial 866-813-9403 with access code 119351. International callers should dial 929-458-6194 using the same access code. As a reminder, the information provided and discussed today will include forward-looking statements, including statements about Align's future events and product outlook. These forward-looking statements are only predictions and involve risks and uncertainties and that are described in more detail in our most recent periodic reports filed with the Securities and Exchange Commission available on our website and at sec.gov.\n\nActual results may vary significantly, and Align expressly assumes no obligation to update any forward-looking statements. We have posted historical financial statements, including the corresponding reconciliations, including our GAAP to non-GAAP reconciliations, if applicable, and our third quarter 2022 conference call slides on our website under quarterly results. Please refer to these files for more detailed information. And with that, I'd like to turn the call over to Align Technology's president and CEO, Joe Hogan.\n\nJoe?\n\nJoe Hogan -- President and Chief Executive Officer\n\nThanks, Shirley. Good afternoon, and thanks for joining us. On our call today, I'll provide an overview of our Q3 results and discuss the performance of our two operating segments, System and Services and Clear Aligners. John will provide more detail on our financial performance and our view for the remainder of the year.\n\nFollowing that, I'll come back, summarize a few key points, and open the call to questions. Our third-quarter results reflect the continued macroeconomic uncertainty and weaker consumer confidence, as well as significant impact from unfavorable foreign exchange rates across currencies that affect our operations. On a constant-currency basis, total Q3 revenues were reduced by $25 million or 2.7% sequentially and $57.4 million or 6.1% year over year, one of the largest quarterly foreign exchange impacts in our history. We remain confident in the execution of our strategic growth drivers despite the continuing economic headwinds.\n\nIn Q3, we reached our 14 millionth Invisalign patient milestone during the quarter, which includes nearly 4 million teenagers and kids as young as six years old, who have been treated with Invisalign clear aligners. In Q3, teen case starts of 200,000 were up 13% sequentially and just off slightly compared to Q3 '21 a year ago with a record 206,000 teenagers started Invisalign treatment. We're also excited to be launching significantly new products and technologies that further enhance the Align Digital Platform, leading the digital transformation are the practice of dentistry. During the quarter, we also began to commercialize ClinCheck Live Update software, Invisalign Practice App, Invisalign Personal Plan, Invisalign Smile Architect, the Invisalign Outcome Simulator Pro with in-face visualization, Cone Beam Computed Tomography with ClinCheck software Invisalign, Virtual AI software, and iTero-exocad Connector.\n\nThese technology advancements represent an important expansion of our digital platform that we believe will help our doctor customers increase treatment efficiency and deliver superior clinical outcomes and patient experiences, positioning us to drive growth when the market inevitably rebounds. We'll be showcasing these innovations next month at the Invisalign Ortho Summit, Las Vegas, the premier education, and networking experience for Invisalign practices with the most peer-to-peer presentations of any Invisalign education event. Through Q3, Systems, and Services, interest in our iTero scanners was good with increased product demos across the regions. Doctors are increasingly recognizing the substantial benefits of intraoral scanning and end-to-end digital workflows with the iTero scanner and imaging systems.\n\nAt the same time, increasing inflation, rising interest rates, and less patient traffic and dental practices are lengthening sales cycles and conversion time. For Q3, System and Services revenues of $157.5 million were down sequentially year over year. On a constant-currency basis, unfavorable foreign exchange reduced Q3 '22 Systems and Services revenues by approximately $4.1 million or 2.5% sequentially and approximately $9.9 million or 5.9% year over year. For Q3, scanner services year-over-year revenue growth was strong across all region particularly due to increased subscription revenue driven by growth of the installed base of iTero scanners.\n\nYear-over-year growth also reflects increased sales of iTero warranties and continued growth of our scanner leasing rental programs. We continue to work closely with our doctor customers to support their practice growth and digital transformation goals. This includes understanding different ways to enable them to navigate to more uncertain economic environment. Over the past year, we've had good success rolling out new leasing programs in Latin America and certified preowned or CPO, as we call it, options in India and North America.\n\nWe're also looking at new opportunities on the capital equipment side for our DSO partners. This is a natural progression in an equipment business with a large and growing installed base. As we introduce new products, there are more opportunities for customers to upgrade to make trade-ins and to provide refurbished scanners for emerging markets, too. We expect to continue to roll out programs that are especially helpful for customers in the current macroeconomic environment.\n\nIt's selling the way doctors and customers want to do business and leveraging our balance sheet. We're still early, we're pleased with the contribution of margin accretion we're seeing. For our Clear Aligner segment, macroeconomic uncertainty and waiting consumer confidence continues to impact the dental market overall, making for a challenging operating environment across the board. For Q3, third-party reports indicate there are fewer new patient visits, less traffic flow and lower orthodontic case starts overall.\n\nOur Clear Aligner volumes further reflect the underlying orthodontic market trends and a shift away from adults toward teens in Q3. Q3 Clear Aligner revenues were down 8.2% sequentially and down 12.5% year over year compared to Q3 '21 year-over-year revenue growth rates of plus 35%. On a constant-currency basis, Q3 '22 Clear Aligner revenues were reduced by unfavorable foreign exchange of approximately $21 million or approximately 2.8% sequentially and approximately $47.4 million or approximately 6.1% year over year. For the quarter, Q3 Aligner volumes reflect a sequential increase in Invisalign shipments from Asia Pacific and Latin America, as well as North America Invisalign teen cases offset by lower volume in EMEA and North America, primarily Invisalign adult cases.\n\nFor Q3, Invisalign First for kids as young as six grew year over year and was strong across all regions. On a trailing 12-month basis, as of Q3, Invisalign Clear Aligner shipments for teens and young kids using Invisalign First up year over year to over 734,000 cases. For Q3, the total number of new Invisalign-trained doctors increased sequentially 8.5% driven by North America and Asia Pacific. In terms of Invisalign submitters, the total number of doctors shipped to for Q3 increased sequentially to 84,400 doctors, the second highest number this year, driven by Asia Pacific and the Americas.\n\nFrom a channel perspective, ortho submitters were slightly, year over year, up, especially from doctors submitting teen cases, offsetting -- offset by a few GP dentists year over year, especially in EMEA. For other noncase revenues, which include retention products such as Vivera retainers, clinical training and education, accessories, e-commerce, and our new subscription programs such as our DSP, Q3 revenues were up both sequentially and year over year. This reflects strong growth in retainers sequentially and year-over-year growth across all regions, driven by more submitters. In U.S., revenues for our doctor subscription program increased sequentially and year over year.\n\nI'm very pleased to see continued momentum in noncase revenues driven by subscription-based programs that we expect to continue to expand across the business. Now let's turn to the specifics around the third quarter results, starting with the Americas. The Q3 Invisalign case volumes for Americas were down sequentially single-digit percentages and primarily due to lower Invisalign bulk shipments. The environment remains challenging and feedback from our customers indicates consumer financing and patient no-shows affecting their practices in Q3, especially with adult patients.\n\nQ3 Invisalign volume also reflects increased case submissions from orthodontic channel and sequential growth in the teen segment. For Q3, teen patients were most resilient, reflecting continued momentum in younger patients with Invisalign First, as well as the new Invisalign Teen case pack. During Q3, Invisalign Teen case packs grew both sequentially and year over year. As a reminder, Invisalign Teen case packs, a new subscription program that enables orthodontists to buy clear aligners and packs in advance.\n\nThey also include exclusive practice development benefits with the Invisalign brand and require an incremental volume commitment from doctors. Teen case packs are currently available in the U.S., Canada, and France, and we expect to be expanded more in EMEA region. Turning to our international business for Q3, Invisalign Clear Aligner volume was down very slightly sequentially, 1.4%, with strong sequential growth for APAC, offset by lower volume in EMEA. For EMEA, Q3 operating environment was challenging.\n\nInflation in the Eurozone is more than 10% and global macroeconomic factors weighed on consumer sentiment and purchasing decisions, especially for adult patients, which compounded the impact of Q3 summer seasonality. Similar to the Americas, doctors in EMEA also reported increased appointment cancellations and the impact of less patients financing their purchases. EMEA teen patients also resilient in Q3 increased sequentially in Iberia, as well as France, where we introduced teen case packs during the quarter. In APAC, Q3 sequential growth was led by China, Japan, and ANZ despite ongoing COVID restrictions and lockdowns in parts of China and Japan.\n\nOn a year-over-year basis, Invisalign case volumes reflected increased shipments across almost all markets, led by Taiwan, Thailand, India, and Korea, driven by increased submitters. In Q3, APAC sequential growth also reflects strong demand from our expanded Invisalign clear aligner product portfolio in China. Recall in late April, Q2, we introduced two new products that better serve the expanding market in China. Invisalign Adult and Invisalign Standard clear aligners leverage our proven technology while broadening our appeal to more consumer segments.\n\nQ3 was the first full quarter offering these new products that provide doctors and patients in China with broader clinical and affordable options for moderate to complex adult cases. Finally, I'm pleased to share that the Invisalign system was recently awarded the Good Design Award for 2022, making it the first orthodontic appliance to win the prestigious award in Japan. In the judge's assessment of the Invisalign system, they emphasized that the opportunity for teeth straightening is high in Japan and cited the barrier to adoption by Japanese consumers is resistance to metal braces and praised the Invisalign system as an orthodontic solution that can improve the quality of life during treatment. We certainly recognize the importance of the Japanese market for digital orthodontics and is one of the reasons we opened our first office in Tokyo nearly 15 years ago and established treatment planning operations in Yokohama a few years ago.\n\nTurning to new innovations, we continue to deliver our technology road map. As I mentioned earlier, during the quarter, we began to commercialize several new products and services that we previously announced would come to market in the second half of 2022. These technology advancements illustrate our commitment to continuous innovation in digital orthodontics, and we remain excited about the transformational projects that we're working on as we continue to drive the evolution of our industry. No other dental company has the experience, including over 14 million patients treated to date to lead the transformation of the practice of dentistry.\n\nOur consumer marketing focus on educating consumers about the Invisalign system and driving that demand to Invisalign doctor's offices ultimately capitalize on the massive market opportunity to transform 500 million smiles globally. In Q3, we built on our successful Invis Is media campaign and continued our launch of the Invis is Drama Free, targeted at teens, and Invis When Everything Clicks, targeted at adults. Our teen campaign, Invis is Drama Free highlights the benefits of Invisalign while humorously juxtaposing them with the significant trade-offs involved with using braces. Our Invis is When Everything Clicks campaign showcases Invisalign treatment transforming smiles and the resulting confidence it gives to young adults.\n\nDuring Q3, we had over 4.3 billion impressions delivered in 14 million visits to our website, a 1.6% year-over-year increase as a result of rightsizing our media investments. We're also rightsizing our consumer media investments across all core EMEA markets, impacting the impressions and unique visits. In U.S., we continued our influencer and creator-centric campaigns, partnering with leading smile squad creators like Olympic Gold Medalist, Suni Lee, Michael Le, Josh Richards, and Marsai Martin. Each of these creators shared their personal experience of Invisalign treatment and why they chose to transform their smile with Invisalign aligners.\n\nMost recently, Suni Lee shared her positive experience with Invisalign in major media programming include Good Morning America, people.com, resulting in over 93 million impressions. We continue to invest in consumer advertising across APAC region, resulting in a 72% year-over-year increase in impressions and 29% year-over-year increase in unique visitors. Our ongoing campaigns were omnipresent across the top social media platforms such as TikTok, Snapchat, Instagram, and YouTube to increase the awareness of the Invisalign brand with young adults and teens. In Q3, we launched a global plot on the Roblox platform within the popular game LiveTopia creating a fun experience for players to learn about the benefits of Invisalign treatment.\n\nTo date, we had over 5.9 million impressions delivered in over 2.6 million unique visitors on the game experience. Adoption of My Invisalign Consumer and Patient app continues to increase with 2.2-plus million downloads to date. Usage of our key digital tools also continued to increase. Live update was used by 41,000 doctors or more than 395,000 cases, reduced time spent in modifying treatment by 18%.\n\nInvisalign Practice app has been downloaded 314,000 times to date. Further, we received more than 110,000 patient photos in our virtual care capability to date, providing rich global data to leverage our AI capabilities and improve our services for doctors and patients. The investments that we make to drive patient demand and conversion to support our doctor customers is unparalleled in our industry, leveraging the global recognition of the Invisalign system. No other dental company equals our brand strength today.\n\nFor more details on our consumer marketing programs, please see our Q3 '22 earnings and conference slides. Turning to exocad. Overall, I'm very pleased with our progress with the exocad business and its leadership and restorative dentistry. In addition to the iTero-exocad Connector, I mentioned previously, during the quarter, we also introduced iTero NIRI, NIRI is near-infrared technology intraoral camera images and are now automatically imported into dental CAD when designing restorations, enabling technicians to visualize the internal and external tooth structure and optimize the process of margin line tracing.\n\nThe new xSnap module is a model attachment for a printable 3D articulated system, featuring a spherical head, which allows a precisely executed movement. And Ivoclar's Ivotion Dental System, a complete workflow for digital production of high-quality removable dentures is now available on exocad. Together, the iTero and exocad product portfolios help accelerate the digital transformation of dental practices by facilitating the way doctors and labs collaborate to deliver better care for their patients. As part of the Align Digital platform, the integration of iTero's digital scanning and exocad's complete software solution delivers seamless end-to-end digital workflows from diagnosis to treatment, planning, and then fabrication.\n\nCustomers are already utilizing the automated workflows, unlocking efficiencies and productivities, which are more important than ever in the current economic climate. With the recent integration of iTero NIRI and intraoral camera images unique to iTero Element 5D imaging systems and exocad Rijeka software release, Align is redefining restorative visualization and treatment planning for the doctors and labs. We are committed to continuing and innovating in the dental industry to drive efficiency and clinical excellence for the benefit of our customers and their patients. With that, I'll now turn it over to John.\n\nJohn Morici -- Chief Financial Officer\n\nThanks, Joe. Now for our Q3 financial results. Total revenues for the third quarter were $890.3 million, down 8.2% from the prior quarter and down 12.4% from the corresponding quarter a year ago. On a constant-currency basis, Q3 2022 unfavorable foreign exchange reduced Q3 revenues by approximately $25.1 million sequentially and approximately $57.4 million year over year.\n\nFor Clear Aligners, Q3 revenues of $732.8 million were down 8.2% sequentially primarily due to lower volumes, unfavorable foreign exchange, higher promotions and discounts, and product mix shift, partially offset by higher additional aligners. On a year-over-year basis, Q3 clear aligner revenue were down 12.5%, primarily reflecting the aforementioned items, offset somewhat by per-order processing fees and higher noncase revenues. On a constant-currency basis, Q3 '22 unfavorable foreign exchange reduced Q3 Clear Aligner revenues by approximately $21 million or approximately 2.8% sequentially and approximately $47.4 million or approximately 6.1% year over year. For Q3, Invisalign ASPs for both comprehensive and noncomprehensive treatment decreased sequentially and year over year.\n\nOn a sequential basis, decline in ASPs reflect unfavorable impact from foreign exchange that Joe described earlier, as well as higher discounts and product mix shift, partially offset by higher additional aligners. On a year-over-year basis, the decline in ASPs reflect the significant impact of unfavorable foreign exchange, product mix shift, and higher discounts, partially offset by the higher additional aligners and per-order processing fees. As our revenues from subscription, retainers, and other ancillary products continue to grow and expand globally, some of the historical metrics that focus only on case shipments do not account for our overall growth. In our earnings release and financial slides, you will see that we have added our total clear aligner revenue per case shipment which is more indicative of our overall growth strategy.\n\nClear aligner deferred revenues on the balance sheet increased $37 million or 3.3% sequentially and $184 million or up 18.6% year over year and will be recognized as the additional aligners are shipped. During the three months ended September 30, 2022, we recognized $137.2 million that was included in the clear aligner deferred revenue balance at December 31, 2021. The Q3 Systems and Services revenue of $157.5 million were down 8% sequentially, primarily due to lower scanner volume, partially offset by higher services revenues from our larger installed base, and were down 11.7% year over year primarily due to lower scanner volume and lower ASP, partially offset by higher services revenue from our larger installed base. Q3 '22, Systems and Services revenue were unfavorably impacted by foreign exchange of approximately $4.1 million or approximately 2.5% sequentially.\n\nOn a year-over-year basis, System and Services revenues were unfavorably impacted by foreign exchange of approximately $9.9 million or approximately 5.9%. Systems and Services deferred revenues on the balance sheet was up $4.1 million or 1.6% sequentially and up $76.5 million or 40.9% year over year, primarily due to the increase in scanner sales and the deferral of service revenues included with the scanner purchase, which will be recognized ratably over the service period. During the three months ended September 30, 2022, we recognized $13.3 million that was included in the Systems and Services deferred revenues balance as of December 31, 2021. Moving on to gross margin.\n\nThird quarter overall gross margin was 69.5%, down 1.4 points sequentially and down 4.8 points year over year. Overall gross margin was unfavorably impacted by approximately 0.8 points sequentially and 1.8 points on a year-over-year basis due to the impact of foreign exchange on our revenues. Clear Aligner gross margin for the third quarter was 70.9% down 2.4 points sequentially due to lower ASPs and increased manufacturing spend as we continue to ramp up operations at our new manufacturing facility in Poland. Clear Aligner gross margin for the third quarter was down 5.3 points year over year due to increased manufacturing spend for the reasons stated previously, higher freight and a higher mix of additional aligner volume, and lower ASPs.\n\nSystems and Services gross margin for the third quarter was 63.3%, up 3.6 points sequentially due to improved manufacturing absorption and lower freight costs. Systems and Services gross margin for the third quarter was down 2.3 points year over year due to higher inventory costs and manufacturing inefficiencies coupled with lower ASPs, partially offset by higher service revenues. Q3 operating expenses were $475.5 million, down sequentially 4.8% and down 3.7% year over year. On a sequential basis, operating expenses were down $23.9 million, mainly due to controlled spend on advertising and marketing as part of our efforts to proactively manage costs.\n\nYear over year, operating expenses decreased by $18.5 million for the same reasons as sequential, as well as lower incentive compensation. On a non-GAAP basis, excluding stock-based compensation and amortization of acquired intangibles related to certain acquisitions, operating expenses were $443.4 million, down sequentially 4.8% and down 4.9% year over year. Our third-quarter operating income of $143.7 million resulted in an operating margin of 16.1%, down 3.3 points sequentially and down 9.6 points year over year. Operating margin was unfavorably impacted by approximately 1.6 points sequentially due to foreign exchange and lower gross margin.\n\nThe year-over-year decrease in operating margin is primarily attributed to lower gross margin, investments in our go-to-market teams and technology, as well as unfavorable impact from foreign exchange by approximately 3.5 points. On a non-GAAP basis, which excludes stock-based compensation and amortization of intangibles related to certain acquisition, the operating margin for the third quarter was 20.2%, down three points sequentially and down 8.6 points year over year. Interest and other income and expense net for the third quarter was a loss of $21 million, compared to a loss of $14.6 million in Q2 and an income of $0.8 million in Q3 of '21 primarily due to larger net foreign exchange losses from the weakening of certain foreign currencies against the U.S. dollar.\n\nThe GAAP effective tax rate for the third quarter was 40.7% and compared to 35% in the second quarter and 30.9% in the third quarter of the prior year. The third-quarter GAAP effective tax rate was higher than the second-quarter effective tax rate, primarily due to the decrease in profits and changes in jurisdictional mix of income, resulting in lower tax benefits from foreign income tax at different rates and higher than in the U.S. On a non-GAAP -- our non-GAAP effective tax rate was 33.1% in the third quarter compared to 25.6% in the second quarter and 22.2% in the third quarter of the prior year. Third quarter net income per diluted share was $0.93, down sequentially $0.51 and down $1.35, compared to the prior year.\n\nOur EPS was unfavorably impacted by $0.30 on a sequential basis and $0.48 on a year-over-year basis due to foreign exchange. On a non-GAAP basis, net income per diluted share was $1.36 for the third quarter, down $0.64 sequentially and down $1.51 year over year. Moving on to the balance sheet. As of September 30, 2022, cash, cash equivalents, and short-term and long-term marketable securities were $1.1 billion, up sequentially $163.8 million and down $96.8 million year over year.\n\nOf the $1.1 billion balance, $471 million was held in the U.S. and $670 million was held by our international entities. Q3 accounts receivable balance was $859.6 million, down approximately 7.8% sequentially. Our overall days sales outstanding was 86 days, flat sequentially and up approximately 11 days as compared to Q3 last year.\n\nCash flow from operations for the third quarter was $266.5 million. Capital expenditures for the third quarter were $75.3 million, primarily related to our continued investments to increase aligner manufacturing capacity and facilities. Free cash flow, defined as cash flow from operations less capital expenditures, amounted to $191.1 million. We are well capitalized to continue to invest for growth while managing through these challenging market conditions, exiting the quarter with over $1 billion in cash on the balance sheet and zero debt.\n\nNow, turning to full year 2022 and the factors that influence our views on our business outlook. Underlying market dynamics, as well as the reactions to macroeconomic headwinds by central banks, governments, and consumers, remain uncertain. We will continue to focus on those matters that have been central to our historically successful business strategies by managing those things within our control. This includes maintaining fiscal controls and focused delivery on our business model so that we are positioned for success once the difficult operating environment ultimately abates.\n\nWe remain confident in the huge underpenetrated market for the digital orthodontics and restorative dentistry, our technology and industry leadership, and our ability to execute and make progress toward our long-term model of 20% to 30% revenue growth. We expect to be below our fiscal 2022 GAAP operating margin target of 20%, which includes the impact from the current unfavorable foreign exchange of approximately two to three points that was not factored into our operating margin guidance for the fiscal year 2022 when we gave an update on the Q1 '22 earnings call in April. For 2022, we expect our investments in capital expenditures to exceed $300 million. Capital expenditures primarily relate to building construction and improvements, as well as additional manufacturing capacity to support our international expansion.\n\nThis includes our investment in the aligner fabrication facility in Wroclaw, Poland, which began servicing doctors in the second quarter of 2022. In addition, during Q4 2022, we expect to repurchase up to $200 million of our common stock through either -- or a combination of open market repurchases or an accelerated stock repurchase agreement. With that, I'll turn it back over to Joe for final comments. Joe?\n\nJoe Hogan -- President and Chief Executive Officer\n\nThanks, John. As we continue to navigate a macroeconomic uncertainty, weaker consumer confidence, and the lingering impacts of COVID-19 shutdowns primarily in China and Japan, we remain focused on our strategic initiatives, as well as the incredible market opportunity for digital dentistry and our products. We believe our unwavering drive to transform smiles and change lives for millions of people around the world is on one other clear aligner company can match and positions us to better address this market opportunity. Regardless of the operating environment, we are committed to balancing investments to drive growth and long-term strategic priorities that will transform the practice of dentistry and strengthen our business.\n\nThese are uncertain times. Every business is being impacted by macroeconomic environmental uncertainty. In addition, as a multinational company based in the United States with roughly half of our sales outside the country, the negative impact from unfavorable foreign exchange has been like anything I've ever seen in my career. We will continue to invest in digital solutions and demand creation to help doctors and their patients.\n\nWe are committed to doctor-directed care and transforming the industry together while working through these global macroeconomic challenges. Thank you for your time today. We look forward to updating you on our next earnings call. Now I'll turn the call over to the operator for questions.\n\nOperator?\n\nOperator\n\nAt this time, we'll be conducting a question-and-answer session. [Operator instructions] Our first question comes from Jason Bednar with Piper Sandler. Your line is now open.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nYeah. Hey, everyone. Thanks for taking the questions here. Joe, from what we've seen and heard in the market, I think it goes without saying that monthly demand has just been quite choppy here in the U.S.\n\nI think July and September were pretty darn soft; August, maybe not as weak but still not great. I guess did you see a similar level of uneven demand when we look outside the U.S.? And I guess is there anything you'd call out geographically or in any of your channels that was maybe less bad than what you were prepared for three months ago?\n\nJoe Hogan -- President and Chief Executive Officer\n\nJason, we started with not high expectations, to begin with, all right? But I would say the U.S. market panned out the way we thought overall, maybe a little more strength in Latin America, a little momentum despite the elections and some economics there. Europe just wasn't quite as strong as what we thought. And as we tried to explain in my notes that I really feel it's just -- it's the uncertainty that circulates Europe right now and Ukraine situation doesn't help either.\n\nFrom an Asia standpoint, we're affected by COVID again. We saw it in China, even though we had growth in China, which was respectable, and in Japan also, but we saw the market impact in those two areas, too. I felt great about it's a smaller part of the business, but Korea, Taiwan, Thailand, and other businesses that were up significantly, but our major three were still affected, primarily the three is Australia and China, and Japan with some COVID issues. So, it's a way of saying, I think in general, we anticipated where we are, we were hoping for the best year.\n\nBut what really grabs me, too, Jason, maybe I'm giving you too much for your call is that the teen demand, we felt good about overall across the globe in the United States, too. The teen packs did well overall. And obviously, we'll roll that out in other parts of the world, too. The adult -- the impact on the adult cases is what was -- to me, is astounding in the sense, and you see that flow through the orthodontic community, the GP community, too.\n\nAnd that's not just in the United States, we see that all over the world.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nOK. All right. That's really helpful. And thanks for all that.\n\nMaybe Joe or John, just on the margin topic, you are backing away from that 20% margin floor commentary that you had given previously. Fully understanding part of this is FX related. But maybe can you talk about how much of it's tied to the decremental impact from lower volumes. And then you fully understand this is a tough macro environment to forecast.\n\nBut a lot of investors right now are really trying to get comfortable with how defensible margins and profitability are as we look out to 2023, which I hope it's not, but it could very well be another tough year for the business just given the global macro environment we're in. So, just -- are you willing to provide any guardrails around what we can consider for 2023 margins? Or maybe talk about how much flexibility you have in the P&L to offset pressures from lower volumes? Thank you.\n\nJoe Hogan -- President and Chief Executive Officer\n\nJason, it's a fair question. First of all, I'll turn it over to John, but I'm the one that gave that 20% operating margin piece. I had no idea you'd see international currency swings and the way we've seen it. I've been in these jobs for a long time, and you don't expect 25% decreases year over year in currency.\n\nAnd so, obviously, we had to back up on that piece. I feel good about the way we managed our cost I feel good about where we're investing and where we continue to rightsize. John will give you more specifics.\n\nJohn Morici -- Chief Financial Officer\n\nSo, on a constant-currency basis, we expect to be at that 20% or above. It's -- just like Joe said, it's pretty dramatic to see the FX changes that we have. As noted in the comments, we said it going to affect the year by two to three points. So, there's no -- there's a commitment to that margin, and we're investing based on volume that we see and other priorities that we have on R&D and go-to-market activities and so on.\n\nBut it's just that FX piece that we're calling out. But on a constant-currency basis, we feel that that number of 20% still holds from earlier.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nOK.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThanks, Jason.\n\nOperator\n\nOur next question comes from Brandon Vazquez with William Blair. Your line is now open.\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nHey, guys, thanks for taking my question. I wanted to go -- I'd like to go back for a second kind of to the monthly progression just to -- I think what might be helpful to kind of understand underlying market dynamics and maybe you can tease it out a little bit in Americas versus international. Just -- what were you seeing through the quarter when you -- did you exit the quarter and going into Q4, were things stabilizing? Were they getting better? Were they getting worse? Any kind of color you can give us around what the situation is like as we go forward from Q3?\n\nJoe Hogan -- President and Chief Executive Officer\n\nAgain, like on the last call, Brandon, I think it played out the way our expectations, I think were formatted. We talked about teens in the third quarter. And obviously, that's teen season. That played out well from what we anticipated.\n\nAnd as we mentioned before, we think teens are somewhat shielded -- not completely but shielded from the economic environment because of the time window for treatment and parents that want to help their teens through that whole process. The adult segment was the -- we saw the most volatility in for sure, both in the United States, Europe, and in Asia. It's hard for me to tell you that we're -- there's any kind of change from month to month or quarter to quarter. It was pretty consistent from what we've seen.\n\nJohn, would you add anything else?\n\nJohn Morici -- Chief Financial Officer\n\nI mean, that's how we saw it.\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nOK. And then internationally, you guys sound pretty excited about kind of the new product launches within China, specifically offering that new maybe lower-tier product. Can you just talk a little bit about what you're seeing there? How strong has the recovery been in China? How much of that recovery has come from really opening up the product portfolio there? And how should that kind of continue going forward? Thanks.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThanks, Brandon. That's a good question. I mean, China is a very important market for us. As we talked about on other calls, those tier 3 and tier 4 cities have been an important target for us.\n\nWe've known for about two years, we have a hole in our portfolio in those areas, particularly with -- we have comprehensive on top, and then we have a moderate product between it. So, we announced Invisalign Standard, Invisalign Adult. And what this does is it just helps us segment the market. These are not -- they can't handle -- these products can have -- handle cases like Invisalign First scan or mandibular advancement or some of the sophisticated cases we have out there.\n\nWe don't offer CBCT, five-minute ClinCheck, and those kind of things around those products, too. So, we tailor those products for more moderate kinds of cases in those specific areas where public hospitals have been strong. And we -- really good results from the standpoint of what we saw in the uptake that we saw over this last quarter, and we'll continue with that strategy. We feel good about it.\n\nJohn Morici -- Chief Financial Officer\n\nAnd it's about market expansion there. We're selling to more doctors than we've sold to in the past with these products. So, we're really trying to capture more of that market, as Joe said, into tier 3, tier 4 cities, and we saw good uptake from that. And it's something that we know to go to the market and be able to reach these potential customers.\n\nThese are the types of products that we need.\n\nJoe Hogan -- President and Chief Executive Officer\n\nYeah. So, Brandon, I think honestly, I feel really good about our positioning there. China did perform well from a volume standpoint, and we'll continue to update on progress.\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nGreat. Thank you.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Jon Block with Stifel. Your line is now open.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nThanks, guys. Hey, Joe. Hey, John. Maybe just first one for me.\n\nThe 3Q '22 ASP of $1,150 versus $1,220, so I'm counting down 6% Q over Q. Some of that's FX, but I think if I look at your comments, it seems like half of that 6% headwind is FX. And John, I know you said mix, but I'm counting that teen was about 35% of your 3Q '22 cases versus 30% of your 2Q '22 cases and teen is a high acuity comprehensive ASP. I would think DSP is also helping pull out some of the lower ASP cases as DSP ramps quarter in, quarter out.\n\nSo, can you just help me with the ASP movement, what else was it outside of FX? And if it was mix, why mix based on my teen commentary?\n\nJohn Morici -- Chief Financial Officer\n\nYeah. I think you've hit the major pieces, Jon. When you look at it majority was FX. We saw the dollar strengthening, that obviously hits our numbers.\n\nAnd then you look at the other parts, we do have a higher proportion of teen in the third quarter, and that's a help. We also have things that we've done like we answered on the previous call about mix in China and expansion out, and there's offsets to that. But it's primarily FX, and then you have some mix. But from a discounting standpoint, or other things, there was really no overall change to how we've done stuff.\n\nIt's primarily the FX piece and the mix.\n\nJoe Hogan -- President and Chief Executive Officer\n\nJon, one other thing to add to that, too, on the DSP program, we look at that as incremental, not as replacing other business that we've had in the past. So, like we feel good that's an expansion play for us. And I think you see that in the numbers, too.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nOK. So, maybe just quickly on that last point, Joe. Question 1b would be, you don't really think any cases are being pulled out of the case volume number into DSP that's actually having an incremental negative impact to '22? Do you think those are just truly largely incremental? That was 1b, just to be clear.\n\nJoe Hogan -- President and Chief Executive Officer\n\nYeah. You know, I think you learn a business, Jon, never be binary, either or. I'd say the majority of those cases, if you look at it, we're picking up from an ortho standpoint, a lot of retention we never had before. We see orthos doing touch-up cases and all that might have been done in-house at times.\n\nSo, I'm not saying that there's absolutely nothing that would transpose from one to another, but I'd say primarily, we're looking at that as a growth opportunity for us.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nOK, helpful. And then the last question, and it's just where I struggle the most. I think sort of who cares, but my view on teen versus how you guys have positioned it with all due respect. And I get the teen 2Q to 3Q had a good sequential growth rate, but the 1Q to 3Q, because 2Q was weak, was actually below trend on a four-year average throwing out 2020.\n\nAnd Joe, just -- if we can go down that road a little bit more, teen case vols were still down 3% year over year. This whole story is about taking maybe 200 bps of share every year in this market. What do you think overall teen case volume was globally if you guys were down 3%? And maybe just really the questions about market share gains and if you still feel like you've got the momentum there or if that has slowed as of late and what can reaccelerate it? Thanks for your time.\n\nJoe Hogan -- President and Chief Executive Officer\n\nYeah. Jon, again, that's a good question. I think when you talk about first quarter to second quarter, the rhythm that we had there, remember, the normal rhythms we've seen in this business is seasonality, we call it. We have not seen that since really 2019.\n\nAnd so, we had muted signals on teens through 2020, '21. Just -- it wasn't the same. What I liked about -- what I saw in the third quarter was we saw teens come back in the sense of in a pattern of what you'd expect in teen season, Q3, Q4. It's too early for me to dig out the data and tell you how much share we're gaining against wires and brackets.\n\nWell, Jon, we don't talk about a lot or products like -- and we highlighted it here today, when you look at the Invisalign First product line, we're really getting tremendous results out there on young patients, six to nine years old, the phase 1/phase 2 treatments, where often the phase 2 can be a lot less extensive than what the phase 1 was with wires and brackets. So, our different extension devices, so we see a big uptake in that product line from a teen standpoint. We see that as penetration too. We've seen consistent growth from a share standpoint in those teen cases in Americas globally.\n\nSo, we just introduced curved wings mandibular advancement too that's having a really good start in the market, too, to address some cases that mandibular advancement couldn't get in the past. So, Jon, both with technology, with our advertising campaigns, the teen packs, and whatever, I continue to feel good about our movement. We'll have more as we analyze the trends, the share trends, and stuff that we'll be able to share with you, but I do like our position in the marketplace in teens.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nAppreciate it. Thanks.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThanks, Jon.\n\nOperator\n\nOur next question comes from Brandon Couillard with Jefferies. Your line is now open.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nHey, Joe.\n\nJoe Hogan -- President and Chief Executive Officer\n\nHi, Brandon.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nJust a question on just opex and how you're managing headcount, whether you pulled back in any parts of the business globally. And maybe just talk about the levers that might be at your disposal if the environment continues to deteriorate and maybe if there are some areas that would be ring-fenced as far as the potential cuts.\n\nJoe Hogan -- President and Chief Executive Officer\n\nBrandon, it's Joe. Look, first of all, what I protect with my life here are our direct salespeople and also our technology and our engineering team and what we focus on. And so, we've made sure that we continue to reinforce those. There's just other parts of our business, too, that we rightsized.\n\nI mean, obviously, this business is used to growing 20%, 30%. And so, we kind of came into the year with that mindset. We quickly realized it wasn't and so we've taken actions in order to do that. But you see that throughout the business.\n\nDon't forget we also have really strong productivity programs, in manufacturing and all, that really help us during these times. Emory and his team do a terrific job, they help to drive that. John will give you another insight in a sense of how we're managing opex across the business.\n\nJohn Morici -- Chief Financial Officer\n\nSo, we have good insight into our P&Ls across the world. So, we're looking at country by country in certain regions and so on. And like Joe said, from an overall focus, we want to make sure that we're going to market and protecting the sales, make sure our R&D technology is putting out the best products and the best technology going forward, so we protect that. And then we look at what expenses make sense in the short and long term in various regions, various campaigns that we have to make sure that we're getting the return that's appropriate given the market conditions.\n\nSo, we're constantly iterating and changing things, it's no different on the other side of things. When a year ago, we were looking at the growth opportunities. We're looking at it the same type of way kind of on a country-by-country, market-by-market basis is just the other way as it is now. So, we feel like we have a good understanding of our return on investment and a good understanding of the levers that we need to pull or not pull given these conditions.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nAnd then, John, just one follow-up. Can you help me just kind of understand what's going on with the inventory line and why that continues to grow year over year and sequentially? Is there something tied to the new European fab facility that may be driving that? And what we should expect on that line in the next few quarters?\n\nJohn Morici -- Chief Financial Officer\n\nYeah. I think we're kind of getting to -- we kind of get to a point where some of that is due to just the fact that you have a third manufacturing site, and you're going to have raw materials related to that and other in-process inventory and so on there. So, you're going to have some of that. Some of it is also on the iTero side where you're manufacturing and you're doing some things where you're securing supply.\n\nI mean, there's been a lot of talk and we feel good about our supply to be able to components and so on. We've purchased several components just to make sure that we had adequate supply for our forecast and so on. But nothing out of the ordinary other than some expansion that we have with new manufacturing and then making sure that we secured our supply lines, and that's what we've seen in our numbers.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nOK. Thank you.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThanks, Brandon.\n\nOperator\n\nOur next question comes from Jeff Johnson with Baird. Your line is now open.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nThank you. Good afternoon, guys. So, Joe, I want to pin you down a little bit on a couple of things, if I could here, that questions that have been asked. And on the teen packs especially, I mean, look, we know there were so many adult cases last year with the [Inaudible] factor, whatever we want to call it, and stimulus spending and all that.\n\nBut the teen number is obviously the important number. I think we're all trying to focus on here. The down 3%, I think, is what you said year over year, up sequentially. That down 3% year over year on teen cases globally, I mean, how do you feel like that compares to the overall ortho market? Were you better or worse than other teen cases done with brackets and wires when you throw in other clear aligners from the competitors, things like that? Just how are you competing in that teen market right now?\n\nJoe Hogan -- President and Chief Executive Officer\n\nHey, Jeff, it's a fair question. I'd first take it to Europe. I mean, Europe was down substantially for us, too. So, I don't think we've got a clear signal out of there because of the economics and in general.\n\nI mean, we did fairly well in -- from a European standpoint. But third quarter in Europe is never a particularly strong quarter, we're going to pull a signal out of. When you look at the United States, you go to Gaidge data. And you'll see that inside Gaidge Data aligners were down, but Invisalign was actually above what the generic aligners are reported in Gaidge data, which says we continue to do well with our teen portfolio and what we do.\n\nYou see wires and brackets cases actually expanded. But what that is, is you see if they're doing more -- fewer adults -- and you know how orthos have held on to teens for a long time, you get a mix phenomenon there where it looks like they're doing more wires and brackets, but they're not. They're just doing fewer adults, and they mix down in that sense. And then move over to Asia, I've always felt good about Asia is different by country.\n\nBut the COVID overlay in Japan, in particular, but also China. I thought the teen case volume was still reasonable. But it's still hard to pull a signal out of a lot of noise with the COVID shutdowns in all of those countries. So, again, just like in John's question, Jeff, is I do feel great about our portfolio.\n\nI feel good about how we're positioning the product. I think the teen packs are a way to sell the way doctors want to commit in this area, I think we'll continue to get strong there. The future of those teen cases, there's no question it's digital. It's just how we approach it, the products we launch, and convincing doctors more and more that teens will use these and showing them the results that we're seeing all over the world.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nYeah. Fair enough. All right. And then I'm going to jam two questions together, kind of as Jon Block here, I'd call it 2a and 2b and other separate questions.\n\nBut any update on volume-based procurement in China, how we should think about that? And then I didn't see a breakout for Americas versus international doctors shipped to. You provided that in the past. Any way we could get that number this time? Thanks.\n\nJohn Morici -- Chief Financial Officer\n\nWell, on the doctor shipped to, what we've done is consolidated them together to a total. And what we saw, if you looked at international versus domestic, they're both up. And the numbers that we had -- this is actually our second highest ever from a shipped-to standpoint. But we decided to consolidate those together, without giving too much more details on that.\n\nBut they're both up.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nIs that sequentially, John, just to be clear?\n\nJohn Morici -- Chief Financial Officer\n\nYes. Yes.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nJohn, both up sequentially. Sorry, Joe.\n\nJohn Morici -- Chief Financial Officer\n\nYes, yes, correct.\n\nJoe Hogan -- President and Chief Executive Officer\n\nYeah. On sequential, yes. on the volume-based purchasing in China, we have our eyes all over it, Jeff, as you can guess. It represents anywhere between 15% and 18% of our business there.\n\nThe way they're setting this up, pretty much in what we recall, in not our main areas in where we do business in China. I think we've positioned ourselves for this. Strategically, I feel we can make the right move here. Look, I have friends and other medical device businesses, I was in the medical devices for a while.\n\nWe know what this did to stents and hip transplants and different things. I feel like the way they set this up, one is 70% of it will be DBP in those areas, 30% will still be up to the doctors in the sense of what they want to use and how they want to use it. So, what's key here is that we exercise our portfolio and the capacity that we have over there to just have a strategic positioning in that. So, I don't expect any major differences as we move into 2023.\n\nWe'll just have to wait to see how that goes. And as we move into 2024, 2025, how the government -- which way the government moves.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nThank you.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Elizabeth Anderson with Evercore ISI. Your line is now open.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nHi, guys. Thanks so much for the question. I guess my first question is just on equipment line. I noticed you sort of talking more about leased equipment in the quarter.\n\nCan you sort of talk about how that's been growing and sort of what contribution that made to the equipment revenues in the quarter?\n\nJohn Morici -- Chief Financial Officer\n\nYes, I can start with that. It's obviously a strategy that we have. We've got great equipment, great products, and we want to be able to get those to our customers in a way that they want to buy. Sometimes those doctors of ours don't necessarily want to purchase it outright.\n\nThey want to try other things. And so, we've tested in certain markets, just alternatives, kind of the rental model and so on. And we see good uptake. We see them these doctors now wanting to get a scanner to be able to digitize their practice.\n\nSo, it's really at early stage right now, Elizabeth, but it is something that when we think about how we want to go to market, we want to offer alternatives such as leasing or expanding rental or other parts of our business are going to see the certified preowned where you have upgrades and other things that happen as we have a larger and larger installed base, we're going to get some of that equipment back. We want to be able to have a mechanism to be able to use that equipment, use it in other places, and give our customers alternatives, both in terms of the equipment that they can purchase from us and then how they purchase and use that equipment from a financing or maybe leasing or rental options. And we think that they'll end up using our equipment more and more. And then we know that helps from a digital standpoint when they use their equipment, and then they'll end up using more Invisalign.\n\nSo, it all kind of works from an ecosystem standpoint.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. And then just in terms of on the P&L, like one of the things that, obviously, saw the change in SG&A spend in the quarter and how you pulled back on spending there. What about on the R&D line? Do you sort of see an opportunity to pull back on R&D as well going forward? Or is that something you're sort of keener to defend going forward?\n\nJoe Hogan -- President and Chief Executive Officer\n\nElizabeth, it's Joe. We want to defend R&D. Very important part of the business. You can see the programs are rolling out.\n\nThe programs we're rolling out, we didn't do them this year, right? Some of these are three-year-old programs that we've been working on. And so, I don't want to stop the momentum on those. I mean, obviously, we'll take any steps here to preserve the cash flow and integrity of this business that we have to do. But our front lines are our sales organization and technology.\n\nAnd before we go anywhere near those, we want to make sure we do everything we can, then rightsize the business in other areas.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. And then just in terms of my 2b question, in terms of like what you're seeing through the month of October so far, if we're sort of thinking about how the cadence of 4Q is shaping up, would you then expect like the cases to be sort of flat sequentially at this point based on what you're seeing? Or like how do we think about sort of where we are now?\n\nJoe Hogan -- President and Chief Executive Officer\n\nYou know, kind of anticipating that question is, we're not seeing any major change, I'd say, from the momentum that we saw in the second quarter.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nYou mean the third quarter?\n\nJoe Hogan -- President and Chief Executive Officer\n\nI'm sorry, third quarter. That's right, a little bit, yeah.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nThank you. Appreciate it.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Erin Wright with MS. The line is now open.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much. So, how should we think about underlying ASPs going forward, excluding the FX dynamics from here just given some of the mix dynamics you noted? And FX is FX, and that's understandable. But if we do continue to see what we're seeing in terms of the macro environment, what do we think about in terms of trough margins from here? And do you see an opportunity for a sort of recovery near term? Or any sort of margin expansion? Anything you can give us on that front would be helpful.\n\nThanks.\n\nJohn Morici -- Chief Financial Officer\n\nYeah. Obviously -- Erin, this is John. Obviously, gross margin, op margins is a primary concern for us. We want to make sure that we manage things appropriately.\n\nFrom an ASP standpoint, take FX out of this and really FX out of our margin because it's hard to so much coming through from a P&L standpoint. But we're always looking at productivity to be able to help drive the business. And as we scale up Poland is a great example, we'll become more productive there, and that will help our margin. It's kind of in our margins right now as an impact, but it will get better over time through utilization.\n\nWe look at the technology that we have in the business and what it means from an ASP standpoint. And our customers understand that. There's always going to be geographical mix shifts that happen. Certain parts of the world are at different times throughout the year.\n\nBut I don't expect a dramatic shift in our overall ASPs. Take FX out of it from an overall ASP standpoint and then we're really focused on what can we do to look at savings that help us from a gross margin standpoint and see that. And then also on an op margin standpoint for all the opex things that we previously talked about.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nOK. Thanks. And then just going back to Elizabeth's question on the quarterly cadence. Just in the teen market, in particular, what are you seeing in terms of typical seasonality there? And did you see some of that momentum continuing here into the fourth quarter in that particular segment? Or how should we be thinking about the quarter-to-quarter cadence given -- relative to what you typically see from a seasonal standpoint.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThe teen market, predominantly, if we look at the third quarter. Obviously, it bleeds some into the fourth quarter, whatever, but I wouldn't take anything we're seeing right now and project it into the future to change what the normal fourth-quarter sequence could be. So, like I said previously on the question as far as when you look at third quarter moving in the fourth quarter, we're not seeing any meaningful change one way or another.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nOK. Thank you.\n\nJoe Hogan -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Nathan Rich with Goldman Sachs. Your line is now open.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nHi. Thanks for the questions. Good afternoon. If I could go back to margins for a minute.\n\nYou mentioned not changing the target for this year on a constant-currency basis. I guess -- if I could maybe ask the question this way, if we don't see further changes to FX or the kind of overall demand environment, do you think the 16% margin that you saw this quarter on a GAAP basis is indicative of what we should assume going forward, again, kind of -- assuming no kind of changes in the underlying environment?\n\nJohn Morici -- Chief Financial Officer\n\nI wouldn't say -- I wouldn't take that. I think when we're talking about for the full year, we're kind of looking at kind of that on a constant-currency basis, that 20%. And I think Q3, you have impacts with Poland start-up and some other things in the quarter that are impacting that. But when we look at the 20% and what we were calling earlier in the year, we were thinking about that less about the quarters, but on a -- more on a total year basis on a constant-currency basis.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nOK. And the FX headwind for the year on margins is that 2% to 3%?\n\nJohn Morici -- Chief Financial Officer\n\nThat's the way to look at it, Nate. It's -- you know, we're kind of looking at -- as best as we can call it now, we're kind of using the latest FX rates that you have now. It's up to predict what's going to happen in the next two months. But if you took kind of currently and kind of what we've done throughout the year and then use the current FX rates, we think that's a two- to three-point impact.\n\nAnd without that FX rates, we -- our GAAP numbers would have been up to 20%, like we called.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nOK. Thanks for that. If I could just ask a quick follow-up. Joe, I think you had noted less willingness of consumers to finance treatments in both the U.S.\n\nand Europe. How big is that as a percent of case volumes in terms of what's typically financed? And then, you know, how much in particular kind of how might this weigh on demand? And I guess, bigger picture, are there ways kind of in this environment that you kind of see as kind of maybe being best able to stimulate demand just in terms of how you might either help customers or doctors in this environment?\n\nJoe Hogan -- President and Chief Executive Officer\n\nYeah. Nathan, I think what we gave you is basically data that we receive from the marketplace. It's what we're hearing from orthodontists and dentists in general in treatment. We don't have any quantification to say so many patients were seeking funding, they didn't get it or there's so many losses in that sense.\n\nThat's pretty much listed as the reasons why patients have refused treatment or thinking about treatment in the financial considerations of it. John, would you?\n\nJohn Morici -- Chief Financial Officer\n\nNo, I think you're always going to have a mix of -- some patients, they'll pay for it all upfront. Some will finance either through the doctor or some outside group. And I think you're constantly going to have that. We do think as much as we can with our doctors to give them some of the financial flexibility, so that as they maybe have additional terms where they pay us, the doctors, they can maybe apply some of that to their patients, and they can help their patients as well, manage some of the cash flow.\n\nSo, we're aware of it. We do as much as we can. It's just kind of out there. And like Joe said, we don't have a quantification of it, but in tougher economic times, we know that patients will be looking for different alternatives.\n\nJoe Hogan -- President and Chief Executive Officer\n\nAnd, you know, the other part of your question, Nate, about how do we help accounts. We watch payments, we try to help in that sense at times. We try to drive direct Invisalign docs to do a lot of Invisalign. And obviously, our advertising is extremely important to them.\n\nSo, we have our whole lead program to help them drive those things. We just want to be as close to our customers as possible because they're feeling what we feel. And we have strong relationships with many of them, and they're part of the family here. And we work it country by country, doctor by doctor, region by region to see how we can help.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nThanks so much.\n\nShirley Stacy -- Vice President, Corporate Communications and Investor Relations\n\nOperator, we'll take one more question, please.\n\nOperator\n\nOur final question comes from Kevin Caliendo with UBS. Your line is now open.\n\nKevin Caliendo -- UBS -- Analyst\n\nThanks, and thanks for sneaking me in. I appreciate it. So may have found a little bit on the comment around October, saying that the momentum continued. If we think about that, that was sort of down 12%, right, year over year.\n\nI think what we're all looking for is we saw cases flat Q1 to Q2. And then we saw a step down in Q3 despite a stronger teen season. So, I think what we're all trying to figure out here is adjusting for the third quarter strength, seasonality in teen, when do you actually expect to see stabilization globally in cases, meaning either sequentially or year-over-year flatness? Like when do you actually expect that that could happen?\n\nJoe Hogan -- President and Chief Executive Officer\n\nKevin, it's Joe. Look, I think we can sit here and tell you I think we're in pretty volatile economic times. I can't tell you what the dollar is going to be in three months. I don't know what's going to happen in Europe.\n\nI don't know how bad COVID hits China. I don't know what it does in Japan. So, I know exactly what you're asking for and every investor is asking for. And we'd give you that data if we thought we had it, but we are in such a volatile time right now.\n\nWe're just working this thing from month to month. As I mentioned, as we go into the fourth quarter, obviously, there's a rhythm between teens and adults from the third quarter to the fourth quarter. What I mentioned from a continuation standpoint is we haven't seen much of a change between the third and the fourth right now as we move into it. That's about as well as I can tell you of what we're seeing and what we're experiencing, trying to forecast what's going to happen toward the end of the quarter, next quarter, I can't do that.\n\nI don't think anybody here can.\n\nKevin Caliendo -- UBS -- Analyst\n\nAnd if I can just ask a follow-up. There's been a lot of talk about spending and margins in 20% and everything else. And historically, in the past, you guys always just invested to grow. Is it now given the uncertainty of everything that you're just going to manage through a margin or try to manage to the 20% margin ex FX? Or, I mean, is that the strategy? Or is it still to try to get back to the -- what you would need to do normally to hit certain growth targets that you've had?\n\nJoe Hogan -- President and Chief Executive Officer\n\nIt's a growth business, Kevin. If we had good economic times here, I can tell you, we'd be having a much different conversation. So, the challenge with this business is how are we responsible on cost and obviously, a challenged demand environment, but to keep this company very strong because when this market comes back, you just go back in history and take a look, it comes back, and it comes back hard. And we've got to make sure that we're in a good position to be able to field that when it does occur.\n\nSo, you'll see us be, what I call, fiscally responsible, but we'll continue to make sure that we invest and make as many changes as we can around different areas of opex but to protect those key areas where our customer interface and the development of our technology. And actually, the operations capacity we need in this business when this thing does bring back. And that's not just in manufacturing aligners. That's in being able to service customers across the board.\n\nSo, you'll see us balance that well as we should do from a leadership standpoint.\n\nShirley Stacy -- Vice President, Corporate Communications and Investor Relations\n\nWell, thank you, everyone, for joining us today. We appreciate your time and look forward to speaking with you at upcoming financial conferences and industry meetings, including the Ortho Summit in Las Vegas next month. If you have any further questions or follow-up, please contact our investor relations team. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nShirley Stacy -- Vice President, Corporate Communications and Investor Relations\n\nJoe Hogan -- President and Chief Executive Officer\n\nJohn Morici -- Chief Financial Officer\n\nJason Bednar -- Piper Sandler -- Analyst\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nBrandon Couillard -- Jefferies -- Analyst\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nErin Wright -- Morgan Stanley -- Analyst\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nKevin Caliendo -- UBS -- Analyst\n\nMore ALGN analysis\n\nAll earnings call transcripts"
}