{
  "companyName": "Compass, Inc.",
  "companyTicker": "COMP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/compass-inc-comp-q2-2022-earnings-call-transcript/",
  "content": "Compass, Inc. (COMP 5.91%)\nQ2 2022 Earnings Call\nAug 15, 2022, 4:30 p.m. ET\n\nOperator\n\nHello, and thank you for standing by. My name is Regina, and I will be your conference operator today. At this time, I would like to welcome everyone to the Compass, Inc. second quarter 2022 earnings conference call.\n\n[Operator instructions] I would now like to turn the conference over to Richard Simonelli, vice president of investor relations. Please go ahead.\n\nRichard Simonelli -- Vice President, Investor Relations\n\nThank you, operator, and good afternoon, and thank you all for joining the Compass second quarter 2022 earnings call. Today's review of our actual financials will address the continuing operations of Compass, and certain items are presented on a non-GAAP basis. Reconciliations between GAAP and non-GAAP measures for second quarter financials as well as our near-term guidance and long-term targets are included at the back of our Q2 earnings release and the presentation that's posted on our website. Please also see our disclosure on forward-looking statements, which reflects comps is current view of future financial performance, which may be materially different from our actual performance reasons that we cite in our Form 10-K, first quarter Form 10-Q and other SEC filings.\n\nYou should not place undue reliance on any forward-looking statements. All information in this presentation is as of today's date, August 15, 2022, and we expressly disclaim any obligation to update this information. Joining us on today's call will be Robert Reffkin, our chief executive officer; Greg Hart, our chief operating officer; and Kristen Ankerbrandt, our chief financial officer. Robert will provide a brief overview of Compass' results and a discussion of our strategy.\n\nGreg will provide an update on our business, and then Kristen will cover the financial results and outlook in more detail. So thanks again for joining the call, and I turn the call over to Robert Reffkin. Robert?\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nThank you, and welcome to everyone joining our earnings call today. I hope everyone is safe, well and enjoying the summer. Today, we are sharing our financial results for the second quarter of 2022, outlook for the third quarter and full year 2022 and updates on our ongoing expense reduction plans and how they position us to generate positive free cash flow in 2023. To provide context, this year, the Fed took repeated actions, which have had the direct effect of driving down our revenue.\n\nSince June, we've seen the fastest one-week increase in mortgage rates in the history of the United States as well as other economic headwinds growing stronger. This has created an enormous amount of uncertainty for the rest of the year, but we are all hoping for a soft landing. We are preparing for the real estate market this calendar year to be nearly 25% below where industry experts believe it would be just six months ago. Never in my time at Compass have we seen such a big downturn in the market in such a short time.\n\nWe shared with you on our quarterly calls earlier this year, and we have already been taking steps to manage our cash and normalized expenses, so we could deliver positive free cash flow in 2023 and beyond. We are taking new additional actions to adjust to these market conditions. Specifically, we expect non-GAAP operating expenses after commissions and other in the range of $1.05 billion to $1.15 billion exiting 2022. At the midpoint, this would result in a reduction of approximately $320 million from our LTM ended June 30, 2022, period.\n\nWe believe our reduced expenses will enable us to generate positive free cash flow in 2023. Specifically, we plan to reduce our two biggest areas of expense: technology and incentives to acquire agents, while not reducing agent service levels to ensure our existing revenue base is not impacted. Moreover, we recently initiated the zero incentive program, which means we are now recruiting agents without equity or cash incentives anymore. Our ability to do this is a reflection of the value the platform provides.\n\nMy vision for Compass is to create the best place in the real estate industry for agents to grow their business. Over time, we have invested over $900 million to build an unprecedented platform of tools and services to support our outstanding events. We believe we have created a large competitive moat with an enduring advantage over competitors that are unable or unwilling to build the tools that benefit the agents. More importantly, having built the No.1 brokerage in the United States and with the heavy investment period behind us, we have the ability to bring down opex from a position of strength.\n\nGiven the state of maturity of the platform, brand and our market presence, we are able to reduce technology spend and eliminate financial incentives to higher agents without risking retention or agent recruiting. We can now focus on scaling the business and moving to generate positive free cash flow in 2023 and beyond. I recognize that Compass has been fortunate to be able to invest during the strong financing and real estate markets for nine of our first 10 years at Compass. We are now in positioned to pivot during these uncertain market conditions when revenue is under pressure.\n\nSince our Q1 earnings call in May, we have been taking more aggressive action to achieve positive free cash flow. Going forward, I am focusing the company's efforts around the following three objectives: one, generating free cash flow; two, profitably gaining market share; and three, retaining our agents and our principal agent retention continues to be above 90%, even growing quarter over quarter. We plan to maintain our No.1 industry position continue to offer the best productivity enhancing platform of tools and services to our agents. We expect to come out of this downturn an even stronger company with a more profitable and scalable business.\n\nBefore I turn the call over to our new COO, Greg Hart, to walk through the details of where we are taking business, I want to tell you a little bit about him. Greg came to Compass two years ago as our chief product officer. And in partnership with our chief technology officer, Joseph Sirosh, has been responsible for taking our platform to the next level. Not only did we oversee the transformation of the platform into end solution, but he has also been at hard at work overseeing the design and implementation of our back office services platform, which will help drive down the cost of serving agents and help increase margins in the business.\n\nPrior to Compass, Greg spent over 23 years at Amazon building and running global profitable businesses, including launching Alexa and Echo and leading Prime Video, just to name a couple. He brings a wealth of experience from a company known for its operational excellence at scale. And with that, I'll pass it along to Greg.\n\nGreg Hart -- Chief Operating Officer\n\nThank you, Robert. It's good to be with all of you today. I'm excited to be speaking you in my expanded role as COO at Compass after two years on the product side of the business. As chief operating officer, I'm committed to making sure that we can continue to build our incredible offering of tools and services to our agents, while ensuring that we do so within the expense range that our revenue dictates, and that allows us to generate a return on investment.\n\nWhile the residential real estate market is facing headwinds, our core business is outperforming the industry as evidenced by our market share gains our ability to continue to add agents and our industry-leading agent retention of over 90%. We will stay laser-focused on what we can control, especially operating expenses. This year, our revenue has been under severe pressure. So we're taking the appropriate measures to reduce the expense side of business.\n\nAs Robert outlined, we expect non-GAAP operating expenses after commissions and other in the range of $1.05 billion to $1.15 billion exiting 2022. We expect to complete the majority of targeted cost reductions by the end of September and all targeted cost reductions by the end of this calendar year. Going forward, I will work with the team to ensure that we can grow our market share, expand our technology advantage and do so while working to generate positive free cash flow and solid adjusted EBITDA margins over the longer term. With that said, I'm very happy to announce that in September, we plan to launch a significant set of new features to our platform of tools and services.\n\nOur agents across the country will be able to manage all aspects of the transaction from first contact to close in one place without being forced to use third-party software. This is another significant milestone that will further strengthen our agent's ability to maximize their profit. It is also what helps make Compass unique and helps us retain agents. It also helps recruiting them as well.\n\nWe are confident that the solution we have built is the best in the industry for agents to grow their business. Over the years, we have been reducing the financial incentives we give to new agents. As we have highlighted on previous calls, a great many agents have told us that they are coming to Compass for a lower split than were receiving at their prior brokerage. Accordingly, we're not going to be providing equity or cash incentives to attract new agents.\n\nIn addition to the platform of services and tools, we have been improving and expanding upon to help agents grow business. My team has also worked to develop software that standardizes and automates our interaction with agents. I will be talking to you more in the coming months about what we call Compass Services. This will be a way to drive down the cost to serve agents, increase efficiencies and to ultimately improve our margins.\n\nWe are encouraged to see increasing inventory levels, a recent stabilization of mortgage rates and improved stock market performance. We believe that a continuation of these trends can lead to a better real estate market. However, I want to make it perfectly clear, we will continue to evaluate market conditions and expense reduction opportunities in the coming weeks and months, and we'll adjust our operating expenses further, if necessary, to achieve our goal to be free cash flow positive in 2023. If the market gets worse, we will pursue the necessary steps to achieve that goal.\n\nWe are talking a lot about expense control because that's a focus area for us today. But I want to assure you that we are looking at all aspects of the business. We are considering other new revenue streams to grow the top line of the business, as well additional ways to further enhance profitability via process standardization, automation and efficiency. I will now turn the call over to Kristen.\n\nKristen Ankerbrandt -- Chief Financial Officer\n\nThank you, Greg. Our second quarter revenue was $2 billion, up 4% compared to Q2 2021 and our highest quarter to date. Our adjusted EBITDA was a positive $4 million, down from a positive $71 million in Q2 2021. Our revenue growth was affected by the market slowdowns in some of our key markets.\n\nFor example, California, which includes two of our top markets, has seen more transaction decline compared to the national average, and as a result, put more pressure on our top line. Despite this pressure, we still saw an increase in our LTM market share. Our second quarter transactions grew 2% to just under 67,000 ,compared to a 10% decline in NAR transactions during the quarter. In Q2, our gross transaction volume was $77 billion, in line with the prior year period.\n\nThe 2% increase in transactions was offset by a 2% decline in our average transaction value. Excluding California, our GTV grew 17% year over year in Q2. Transactions per average principal agent were 5.2 in the quarter, down from 6.2 transactions in Q2 2021. It's important to remember that we are comparing against one of the strongest quarters in the history of real estate in Q2 2021, and our strongest quarter ever for this metric.\n\n5.2 transactions per average principal agent is still one of our strongest quarters. Despite the declines we've seen in the market, our transactions per average principal agent increased from 12.5 in 2019 to 18.9 in the LTM Q2 2022 period. Turning to expenses. Our higher Q2 expense base was driven by the annualization of key investments we made in 2021 to drive long-term profitable growth.\n\nThese included progress to achieve completion of the Compass platform, launching 27 new markets since the beginning of 2021 and scaling our adjacent services businesses. Our non-GAAP commissions and other as a percentage of revenue was 81.5% in in Q2 2022, up from 80.9% the prior year period. This year-over-year increase was driven primarily by reduced participation in the 2022 agent equity program relative to 2021. Excluding the impact of reduced AEP participation, we saw an improvement in the underlying brokerage economics of the business.\n\nNow as we told you on our May 12 call, in the second quarter, we paused all expansion into new markets and discontinued M&A activity. In June, as market conditions continue to weaken, we initiated a cost reduction plan to better align our operating expenses with our lower revenue expectations. This started with a 10% reduction in our employee workforce as well other cost reduction measures. During the second quarter of 2022, we incurred a GAAP net loss of $101 million compared to a net loss of $7 million in Q2 2021.\n\nIncluded in the GAAP net loss was stock-based compensation expense of $59 million in Q2 2022 compared to $54 million in Q2 2021, also included with a $19 million restructuring charge as a result of the June cost savings actions. We also incurred $6 million of additional depreciation and amortization expense for the noncash write-off of intangible assets associated with the Motus shutdown and the noncash write-off of the remaining fixed assets associated with Motus leases and other exited during Q2. We had $431 million of cash and equivalents on our balance sheet as of the end June. When you incorporate our planned opex reductions, we do not currently see the need for additional capital to fund our current business plan.\n\nAs Robert and Greg mentioned, we intend to bring down our non-GAAP operating expenses after commissions and other expenses to $1.05 billion to $1.15 billion as we exit 2022. At the midpoint, this would result in a reduction of nearly $320 million from our LTM Q2 2022 levels of approximately $1.42 billion. Please see the schedule on Page 7 of the investor deck for more information. While interest rates and broader equity market performance are not within our control, we focus on the metrics that we can control to measure the health of our business.\n\nThese metrics are market share gains, agent acquisition and retention, and these metrics remain strong. In Q2, we increased our national market share by 50 basis points on an LTM basis compared to the prior year. Note that this market share calculation is based on NAR's revised methodology, which is detailed in our earnings release. In Q2, we also added 405 average principal agents, representing 22% growth year over year.\n\nAnd in Q2, we continued to retain our principal agents at our industry-leading rates of over 90%. Now let me turn to our Q3 2022 and full year 2022 outlook. Given the market uncertainty, we are lowering our outlook for the full year 2022 to $6.15 billion to $6.45 billion, which represents revenue growth of negative 4% to positive 0.5% for the full year. Our market assumption for this range is a full year 2022 decline of 9% to 13%, and this incorporates an assumed market decline for the second half of 2022 of 16% to 25%.\n\nWe are approaching the remainder of 2022 with caution. We believe it is prudent to be conservative, particularly as we look to bring down our operating expenses to better align spending with our updated revenue outlook. We are focused on effectively managing our cash position. Our full year revenue outlook is down from our prior of $7.6 billion to $8 billion in Q1, which had assumed market growth of between 1% and 7%.\n\nOur current outlook for the full year 2022 adjusted EBITDA is now a loss of $225 million to $150 million, down from at least break even. Turning to our third quarter 2022 guidance. We expect revenue of $1.4 billion to $1.5 billion and an adjusted EBITDA loss of $85 million to $60 million. This range reflects the impact of macro challenges we have seen in May and June, most significantly peak mortgage rates and stock market declines, which we generally see impacting our business 30 to 60 days out.\n\nLastly, we remain confident in our long-term adjusted EBITDA and free cash flow margin targets of 10% 8% to 9%, respectively. However, the time frame required to achieve these targets could extend beyond 2025, depending on the depth and duration of this market downturn. For clarity, we are suspending our $1.2 billion adjusted EBITDA target for 2025. Despite market challenges in the second half of 2022, we believe we can continue to grow our principal agent base, increase our market share and effectively manage the cost structure to better align it with our updated revenue outlook.\n\nThis will allow us to position ourselves to be free cash flow positive in 2023 in a variety of market conditions. With that, let me turn the call back to the operator to start the Q&A portion of the call.\n\nOperator\n\n[Operator instructions] Our first question will come from the line of Matthew Bouley with Barclays. Please go ahead.\n\nMatthew Bouley -- Barclays -- Analyst\n\nHey. Good evening, everyone. Thank you for taking the questions. Just the first one on the agent recruiting side.\n\nYou talked about sort of removing the incentives there. Does that kind of come with any change in how you're thinking about the commission splits? I guess, is that kind of a more variable way to recruit competitively? Or how else do you kind of think about keeping that recruitment engine going in a world where you're removing the agents?\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nYes. thank you. Great question. We -- the way of context, we eliminated the equity incentive two, four months ago, and it had no impact on our ability to bring on Agents.\n\nAnd given that this is one of the major areas of expense, we decided that any agent that we started talking to as of last Monday that we would give no financial incentive to for -- in any way, and that we -- they would be on our policy for that market, so whatever our policy is. If they were on -- if they had a better current split than our policy, that that they can keep split for one year. So that's the agreement, but then they go to our policy. And so again, no financial incentives to come in.\n\nif their split is better than our policy split, they can have that for one year and then they go to our policy. We already had in the past week over 50 people commit to coming for that, which we feel really good about. And we -- of that, the vast majority team to compass for either the same split or a more company preferential one. So one that's a better split to the company.\n\nEarly data, but all times forced to positive.\n\nMatthew Bouley -- Barclays -- Analyst\n\nAll right. No, that's helpful color. And then I guess just secondly, zooming into the numbers, if I'm just looking at the math right, I think the new EBITDA guide implies that, I guess, the Q4 loss would, I guess, narrow year-over-year, and presumably the cost reductions are a piece of that. Maybe you can kind of bridge to some of that outlook? And then just kind of within the cost savings, sort of run through the timing of as that rolls through the P&L and kind of where we can look for all that?\n\nKristen Ankerbrandt -- Chief Financial Officer\n\nSure. So here's what I would say, we do expect at the midpoint that the EBITDA losses we would see in Q4 could narrow relative to last year. And that is, in fact, exactly as you said, reflecting some of the benefit of the cost reductions that we've been discussing on the call today. So that's the $320 million of cost reduction relative to the opex run rate, excluding commissions and other expenses.\n\nThe timing there, as Greg mentioned, we plan to implement a good chunk of those cost savings before the end September and then the remainder of the savings through the course of Q4. So the timing there will certainly be one factor that will drive the EBITDA number in Q4. The other piece, of course, will just be the revenue. And we are -- wanted to, in our outlook, provide you all with a view of not only what we thought was an appropriate outlook for the business, but also the associated market growth rate.\n\nSo that as you all have your own view of what may happen in the market in Q3 and Q4, you'd be able to translate that into a revenue number for the business. Regardless, our focus is really on 2023, making progress to bringing down the run rate opex number coming out of '22 heading into 2023, all with the goal of ensuring that we are free cash flow positive in 2023.\n\nMatthew Bouley -- Barclays -- Analyst\n\nGot it. All right. Thanks, Kristen. Thanks for all the detail.\n\nOperator\n\nYour next question will come from the line of Brian Nowak with Morgan Stanley. Please go ahead.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nThanks for taking the question. I have a couple. Just the first one on the cost reductions. Rob, you've already talked a lot about being a tech company, a tech platform, etc.\n\nCan you give us some examples of some the areas where you are going to start to, unfortunately, make some cutbacks in investment? And how you think about the technology of the platform evolving through these cost cuts? And then the second one, any update at all on how we should think about the timing of ancillary revenue impact? And I think, Greg, you mentioned potentially other new revenue sources, what are those examples?\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nI'll do the second one and Greg, I think it's perfect for you on the first. On adjacent services, we're still pursuing mortgage. And we expect to be in the majority of markets by the end of this year. We are still pursuing title just not through paused M&A for this period of time.\n\nAnd we're really focused on organic growth and attach. We've implemented an attach working group that meet weekly, where I'm involved in a lot of our senior leaders and I go every week, and it's a real priority of the company to drive margin and attach for adjacent services. We -- the next logical one is home insurance. We are contemplating the right timing given the current environment, but likely a pause.\n\nAnd there is another low cost, very low cost, high profit opportunity, which I don't think we're prepared to share publicly yet, but we probably will over the course of the next month. Greg, I'll let you take the first question.\n\nGreg Hart -- Chief Operating Officer\n\nSure. Thank you, Robert. So in terms of the reduction, as Robert mentioned on the call, we're going to focus the reductions on the two biggest areas of expense that we have: technology and our incentives, to acquire agents, so those are reflected in the R&D and sales and marketing lines, on the P&L that we report. And we're going to do that without reducing agent service levels to ensure that our existing revenue base isn't impacted.\n\nOne of the reasons that we believe that we're in a position to be able to do this is that with the delivery of the end-to-end platform rolling out across all of our national agent base in the coming weeks, that puts us in a position to be able to moderate our investment in R&D. In addition, we've also reached a point on maturity, as Robert outlined his prior answer in terms of our recruiting approach, well, we don't feel the need to give financial incentives to the reasons recruit them. So we're doing an incentive program that Robert mentioned launched a few weeks ago. We're not providing equity or cash incentives, and we've seen great results from that.\n\nAnd so that reinforces our confidence that the platform that we've built is the best in the industry for agents to grow their business and to continue to attract new agents to our platform the company.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thank you both.\n\nOperator\n\nOur next question will come from the line of Jason Helfstein with Oppenheimer.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nThanks. I guess I'll ask two. So the market share was flat quarter-to-quarter, I think at 4.6% on the new metrics. Was this because the high end was more impacted with the decline in the stock market versus kind of overall real estate? And then, I guess, connected to that, it sounds like trends are not -- or trends have not improved since June, but you did talk about kind of a lag.\n\nSo maybe if you just want to opine if mortgage rates kind of kind of stay where they are and the equity market somewhat stabilizes, what does that kind of mean, I guess, as you're just thinking forward broadly without giving guidance? And then just, Greg, can you give us an update on the ability for online closing? Has it been fully rolled out? Or just any other color you can share on that product.\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nGreat. So on the first questions, yes, our market share sequentially quarter-over-quarter has been flat year over year and it's about 50 basis points. The reason why it was flat is largely attributed to as you're able to do the high end has been hit just fortunately, not only not only the high end generally, but also California, where we have -- is our biggest market. The buyer profile there, particularly in Northern California, is more weighted toward the stock market.\n\nAnd so we basically got a double whammy, one, from mortgage rates moving up, but also from their portfolios, stock portfolio is moving down. I guess, as I shared earlier, in July, this is very difficult based on some the trends in mortgage rates as well as stock market from June. However, it does look like July could be the bottom for the monthly year-over-year comp. We have seen members of hope in some markets and market stabilization others.\n\nBut it's very important to note that we aren't putting any of that hope into our planning scenario. And so by way of comparison, a large public company competitor said that this full year, they expect market growth to be 6% 11% down. We're assuming 9% to 13% down. There's still -- there's low inventory.\n\nThere's still buyer demand, but -- and still prices are flat in good markets. They're mostly -- they're down to -- modestly into the more challenged markets. But there's no longer multi offers everywhere like we have before. Days on market are definitely increasing.\n\nAnd so overall, we're still negative on outlook. But the recent trends over the last one or two weeks do suggest things are stabilizing. And again, it looks like July could be the bottom of the month-over-month comp, but we're just not on year over year for the -- on a monthly basis, but we're just not putting any of that new data into our planning forecast. Greg, I'll let you take the second question.\n\nGreg Hart -- Chief Operating Officer\n\nYes. On the second question, it's a great question. Thank you. So the ability to consummate a transaction within the platform in terms of all of the different forms and documents compliance steps and then book that to transmit and receive an offer and e-signature are already live in a number of regions and will roll out across the remainder of our regions by the end of September.\n\nAnd so our agents will be able to go from contract -- sorry, first contact to close, all in one place on the Compass platform, which we're very excited for.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nAnd just a quick follow-up for Kristen, I guess. If I just play around in the model using the kind of implied expense guide, is it fair to assume that comment about free cash flow positive for next year based on the expenses would kind of factor revenue kind of flat to down a bit next year? Is that ballpark?\n\nKristen Ankerbrandt -- Chief Financial Officer\n\nYes. Jason, I think that's fair to say. At this point, we're not providing guidance for 2023 beyond our focus on being free cash flow positive. And as you can see in Robert's comments and Greg's comments and in my comments, we're being very prudent, very conservative here as we're planning for the business.\n\nSo we'll look forward to providing 2023 sort of more information on 2023 at the appropriate time. But I think as your assumptions there, I see how you're getting to that using the numbers and the information that we provided today.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nYour next question will come from the line of Ryan McKeveny with Zelman & Associates. Please go ahead.\n\nRyan McKeveny -- Zelman and Associates -- Analyst\n\nHey, good afternoon. Thanks for taking my question. So parlaying a bit on the question on the recruitment and retention topic, I'm just curious, Robert, so outside of the economic or incentive changes around recruitment, are there any other in the way you're thinking about or approaching recruitment and retention into a slower macro market? And I know new market expansion has been paused, but just curious on kind of the pipeline within existing markets. And ultimately, part of why I ask is, I think historically, what we've seen is industry agent count on an industry basis can obviously flux up and down with just the movements of the housing market.\n\nSo it's ultimately just gauging how you're feeling about, let's say, near intermediate term the ability to keep growing agent count even if the market is down and potentially agent count for the industry pulls back?\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nSure. Thanks for the question. So I think in terms of agent count growth for the industry, I think it is worth noting that virtually all of the agents that we hire top half in the industry, just because the -- we are hiring more mid-tier agents, but we're not hiring agents that -- they do less than $50,000 of GCI. And that's the even tosasu our GCI is approaching the median for the industry.\n\nAnd so given the is we hire are real professional agents, they tend not to leave when the industry is challenged. And so I wouldn't expect us to have departures related to nonprofessional agents, leading industry when things get challenged. In terms of retention, by not expanding to new markets, it allows us to give more focus and support to the items in our markets. So a complaint that you can hear from the agent when you're in big expansion mode is why are you focusing on expansion than us? And so that's not experience actually helps drive more positive retention.\n\nIt's also worth noting that our retention sequentially improved quarter-over-quarter, and it's within 1% of where it was this time last year -- or this this past quarter last year. So there's no sign that retention isn't incredibly strong. It's still in the above 90s. And again, unlike our competitors, our retention numbers based on all of the principal agents not just top half or quartile.\n\nAnd the departures include people, unlike our competitors, that are -- that retire or as a lead for cultural reasons, move industries altogether, move cities that we don't support. And so it's a very high integrity number. And in terms of recruiting, there is no change other than us not offering financial incentives. And there's a sentiment and many great CEOs have said before, in the downturn, you sometimes you stop doing what you should have stopped doing a long time to go.\n\nI think our retention number always showed us that we have strength -- we have more strength than the incentives that were offering. And so this is a real test to show that we can hire in the platform is strong enough where we don't need to give incentives to bring them on. I think of one of the last major criticisms of the company, agents only -- people say agents only come because you give them financial incentives. I'm really excited to see that sentence be eliminated over the weeks and months to come.\n\nRyan McKeveny -- Zelman and Associates -- Analyst\n\nRobert, that's really helpful color there. I appreciate it. So one other question, and this might be for you as well or maybe Greg, but a bit of a high-level one. So with the market cooling off bit, I guess, can you touch on some of the areas that maybe you are leaning in to keep client -- or keep agents engaged with the platform, so whether it's maybe things like training or education even tech adoption.\n\nIf agents, let's say, do have a bit more time on their hands outside of working with buyers and sellers in the current market, is that giving opportunity to lean in on some of these more strategic areas that could benefit the platform on a long-term basis? Just any thoughts there would.\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nYes, I think in the first earnings call of the year, I mentioned that one of the best things that happened recently is the launch of 10x10, which was a coaching program. We've now extended that to 10x10. We have Compass Core every quarter. We have a Coaching Marketplace.\n\nWe're launching a virtual assistant program in the marketplace, and we created an entire group called customer success that rallies around this effort. I think what I mentioned before is that what we did in the past is we trained agents on how to use technology. And what we learned the hard way is no agent wants to learn technology, they want to learn how to grow their business and just so happens that technology is a way to help them. And so the success that we saw early this year has been continued over all of these months.\n\nWe can continue to see strong adoption of our tools through these programs. An example of the most recent one that we just launched, we call it CMA a Day. CMA stands for comparative market analysis, it's a valuation of a home. And so with our agents, we have the CMA a Day for a month where every day, we're asking each one of them to create a CMA and send it to one of their clients and just take years evaluation with some messages around it.\n\nAnd surprise, surprise, it lead to a lot of listings and client engagement. And on top of that, it leads to a seen value in in our CMA and is a digital CMA that connects to their CRM that connects to their marketing collateral, it connects to the overall business tracker and their client pipeline. And so that's an example of the some of the training that we've invested in, and we're going to continue to put more effort behind.\n\nRyan McKeveny -- Zelman and Associates -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from the line of Justin Ages with Berenberg. Please go ahead.\n\nJustin Ages -- Berenberg Capital Markets -- Analyst\n\nHi. Thanks for taking the questions. First, just overall, in general, and I understand that you aren't moving into new markets. But do you view this softer environment as an opportunity to not only go obviously deeper in the markets that you're in, but continue to take share based on some of the programs or incentives that you've outlined to continue to recruit agents?\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nYes. No, absolutely. As I mentioned on the call, one of our top three objectives is continuing to gain market share in the markets that we're in. And when we look at it on a market-by-market basis by MLS, we see very positive trend.\n\nLike the question alluded to earlier, the sequential market share change being flat was largely driven by the top in market in really California.\n\nJustin Ages -- Berenberg Capital Markets -- Analyst\n\nOK. That's helpful. And then second, in -- I understand the opex kind of target for exiting 2020. On the commission side, if I have what Kristen laid out correctly, it seems that if the number of transactions went up then -- where the transaction value played out, then home prices leveled off or went down.\n\nDo you think that could translate to more savings, let's say, on the commissions and other line?\n\nKristen Ankerbrandt -- Chief Financial Officer\n\nSo Justin, it's nice to talk to you. So the way that I would think about it is, first of all, we're all about making sure we are delivering as much productivity for our agents as possible. When we look at the market, we have seen prices -- the price increases start to slow down, which think will ultimately be really positive for the market overall. I think for a little while here, you've had a bit of a disconnect between sellers' price expectations and buyers coming in with less purchasing power just given where mortgage rates are.\n\nSo I think you should expect to see incremental transactions in the market over time, but it is going to take some time for the market to find the right equilibrium, I think, going forward. In terms of as it relates to commission rates, and by that, I mean the commission that buyers and sellers are paying to agents, we have seen that commission rate tick up slightly over the last quarter. And you can see that in the numbers when you run it through your model. But we attribute that to just a tougher housing market, actually drives more transactions to the very best agents and the very best agents are on the Compass platform.\n\nand they are able to really deliver extraordinary results for their buyers and sellers even in these tough times. So that's been that's been something great for us to see in our results and great for our agents to see for their own businesses.\n\nOperator\n\nWe have no further questions at this time. I'll turn the conference back over to management for any closing remarks.\n\nKristen Ankerbrandt -- Chief Financial Officer\n\nThank you all for your time today. We appreciate the opportunity to update you on the business and look forward to speaking to you over the coming weeks. Thank you.\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRichard Simonelli -- Vice President, Investor Relations\n\nRob Reffkin -- Founder, Chairman, and Chief Executive Officer\n\nGreg Hart -- Chief Operating Officer\n\nKristen Ankerbrandt -- Chief Financial Officer\n\nMatthew Bouley -- Barclays -- Analyst\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nRyan McKeveny -- Zelman and Associates -- Analyst\n\nJustin Ages -- Berenberg Capital Markets -- Analyst\n\nMore COMP analysis\n\nAll earnings call transcripts"
}