{
  "companyName": "Globus Medical",
  "companyTicker": "GMED",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/globus-medical-gmed-q3-2022-earnings-call-transcri/",
  "content": "Globus Medical (GMED -0.38%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to Globus Medical's third quarter 2022 earnings call. At this time, all participants are in a listen-only mode. After the speakers' presentations, there will be a question-and-answer session. [Operator instructions] Please be advised that today's conference is being recorded.\n\nI will now turn the call over to Brian Kearns, senior vice president of business development and investor relations. Mr. Kearns, please go ahead.\n\nBrian Kearns -- Senior Vice President, Business Development and Investor Relations\n\nThank you, Stacy, and thank you, everyone, for being with us today. Joining today's call from Globus Medical will be Dan Scavilla, president and CEO; and Keith Pfeil, senior vice president and chief financial officer. This review is being made available via webcast accessible through the investor relations section of the Globus Medical website at www.globusmedical.com. Before we begin, let me remind you that some of the statements made during this review are or may be considered forward-looking statements.\n\nOur Form 10-K for the 2021 fiscal year and our subsequent filings with the Securities and Exchange identify certain factors that could cause our actual results to differ materially from those projected in any forward-looking statements made today. Our SEC filings, including the 10-K, are available on our website. We do not undertake to update any forward-looking statements as a result of new information or future events or developments. Our discussion today will also include certain financial measures that are not calculated in accordance with generally accepted accounting principles, or GAAP.\n\nWe believe these non-GAAP financial measures provide additional information pertinent to our business performance. These non-GAAP financial measures should not be considered replacements for and should be read together with the most directly comparable GAAP financial measures. Reconciliations to the most directly comparable GAAP measures are available in the schedules accompanying the press release and on the investor relations section of the Globus Medical website. With that, I will now turn the call over to Dan Scavilla, our president and CEO.\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nThanks, Brian, and good evening, everyone. We achieved a strong third quarter with growth throughout our business, delivering sales of $254 million, 11% as reported, or 13% in constant-currency growth, with non-GAAP EPS of $0.50, including significant nonoperational headwinds for currency and tax rate that Keith will discuss later in the call. U.S. spine had a great quarter with 9% growth and notable gains across our product portfolio in expandables, 3D-printed implants, cervical and lateral offerings, biologics, and pedicle screws.\n\nThe gains were driven by competitive rep conversions and robotic pull-through. Our competitive recruiting is tracking ahead of prior year. And as we enter into Q4, the strong recruiting pipeline should lead to a record recruiting year, setting the stage for meaningful growth in 2023. I'm pleased with the growth acceleration delivered by the U.S.\n\nteam. Enabling technologies sales were $24 million, up 20% on a constant-currency basis versus prior year, driven by robotic and imaging system sales. We're seeing increased risk in placements both domestically and internationally. This was our highest Q3 since launching enabling tech, surpassing last year's Q3 sales that delivered 124% growth post-COVID.\n\nRobotic procedures continue to accelerate, growing 48% versus prior year and exceeding approximately 40,000 robotic procedures performed to date. The Excelsius3D imaging system rollout is going well as we continue to penetrate the market and increase orders for future deliveries. And in Q4, our pipeline is strong for both robots and imaging systems. ExcelsiusGPS and Excelsius3D are two foundational pieces of the digital ecosystem we have been talking about, designed and built from the ground up to communicate between each component and surgeon seamlessly in the operating room.\n\nThe system provides a scalable and unmatched clinical experience for the surgeons. The successful rollout and market acceptance of ExcelsiusGPS and Excelsius3D validates our direction and strategy. We are making significant progress developing other components of the ecosystem with plans to enhance our offering over the next several quarters to fulfill our goal of changing the way musculoskeletal surgery is performed. On the international front, our spinal implant business delivered a record sales in Q3, growing 25% on a constant-currency basis compared to prior year.\n\nWe delivered double-digit growth in most markets, including the U.K., Australia, Brazil, India, and Poland, where growth rates continue to exceed 40% for each market. I remain impressed with our international team's performance and the potential of our international business to contribute to our long-term growth. Our trauma business delivered another record sales quarter, growing 83% versus prior year and 20% sequentially versus Q2 '22. Trauma performance is driven by sales force expansion and strong uptake in all 14 product lines, delivering high double-digit growth in each product offering.\n\nIn Q4, we have two meaningful launches planned to further strengthen our offerings and fuel continued growth. Our recruiting pipeline is strong entering into Q4. As I mentioned last quarter, despite being faced with supply chain challenges, we've been able to offset vendor delivery delays and supply shortages without significant impact to sales. To remediate the extended vendor lead times, we've altered our ordering pattern to increase inventory levels.\n\nThe electronic component market remains difficult but has been offset so far by our nimble procurement team. In addition to these disruptions, freight surcharges continue to impact our cost of goods. We will continue to seek offsets to mitigate these challenges. Our product development engine continues to make progress focusing on procedural solutions, designing implants, instrumentation, and procedures that will function together with our Globus ecosystem for a seamless and comprehensive approach in spine, trauma, and joints.\n\nAt the same time, we are expanding our solutions to cover the comprehensive continuum of care, supporting surgeons in preoperative planning, intraoperative execution, and postoperative patient care, capturing outcome data that can be used to enhance future surgical planning. While this complex approach has extended development timelines beyond our historical rapid pace, I believe the upcoming launches will have greater significance in shaping procedures of the future. In addition, we've increased our investment in supply chain to boost output, streamline manufacturing, and enhance production capacity, supporting our continued growth. As we move into the final quarter of 2022, we remain focused on three core elements for long-term growth, innovative new product introductions, robot imaging system sales, and competitive rep recruiting.\n\nI'm pleased with the Q3 results throughout the business with high single-digit growth in U.S. spine, strong performance from enabling tech, record international trauma sales, and meaningful progress in bringing the ecosystem and procedural solutions closer to reality. Q4 is all about focus and execution to deliver value to our customers and drive growth. I know we are well-positioned to achieve our mission of becoming the preeminent musculoskeletal company in the world.\n\nI will now turn the call over to Keith.\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nThank you, Dan, and good afternoon, everyone. Globus delivered on a strong third quarter with significant sales growth across its portfolio and is reflective of our continued ability to take share in our markets, remains a testament to our drive, focus, and continued investment in our people and products. Third quarter revenue was $254.1 million, growing 10.6% as reported and 12.6% on a constant-currency basis as compared to Q3 of 2021. Q3 net income was $47.4 million, essentially flat to the prior-year quarter.\n\nNon-GAAP net income was $50.3 million compared to $52.7 million in the prior-year quarter and delivered $0.50 of fully diluted non-GAAP earnings per share, flat to the prior year. Our Q3 result includes $0.07 of nonoperating headwinds driven by a higher tax rate and currency, partially offset by higher investment income and a lower share count. Adjusted EBITDA was 32.6% and includes a 1.7% unfavorable currency impact in the quarter. During the quarter, we generated $20.9 million of free cash flow.\n\nMoving into sales. Our third quarter U.S. revenue was $217 million, growing 9.5% versus the third quarter of 2021, led mainly by U.S. spine.\n\nDan's earlier comments provided insights into the drivers of growth. To help further put that into context, our U.S. spine business has grown 26.1% over the trailing four quarters when compared to the full year 2019. This longer-term growth figure is an important call out given the quarterly COVID impacts we've seen over the past few years and underscores our continued confidence in our U.S.\n\nspine business. International revenue for the third quarter was $37.1 million, growing 17.7% as reported or 31.8% on a constant-currency basis. Strong growth was seen across our spinal implant portfolio, as Dan mentioned earlier. In addition to this implant growth, we've continued to see solid gains in ExcelsiusGPS sales, growing internationally, mainly in Western Europe.\n\nGross profit in the third quarter was 74.2% compared to 74.5% in Q3 of 2021. The slight decline in gross profit was driven by product mix, continued freight inflation, as well as nonoperational currency impacts, partially offset by lower inventory reserves and improved operational spend efficiencies. We estimate inflation had a roughly 50 basis point impact on the quarter between freight surcharges and higher material costs. Q3 research and development expenses were $18.7 million or 7.4% of sales versus $15.9 million or 6.9% of sales in Q3 of 2021.\n\nThe increased spending is predominantly focused on our U.S. spine and enabling technologies businesses and is in line with expectations. These increases are driven by overall headcount growth as we realign and further invest in our product development engine to focus on procedural solutions and expand the Globus ecosystem. SG&A expenses for the third quarter were $106.6 million or 41.9% of sales compared to $96.4 million or 42% of sales in the third quarter of 2021.\n\nThe increased spending is reflective of higher sales and marketing expenses, driven by higher sales volumes, as well as increased travel and meeting expenses, offset by fixed cost leverage. We continue to take a focused approach to managing our SG&A cost structure in a way that delivers against our needs while working to minimize negative inflationary impacts. The effective income tax rate for the third quarter was 22.8%, compared to 13.3% in the prior-year quarter. The increased tax rate was primarily the result of lower tax benefits associated with stock option exercises.\n\nGiven this lower tax benefit, we are now projecting a full year tax rate ranging between 22.5% and 23%. Our cash, cash equivalents, and marketable securities were $909.3 million at the conclusion of Q3. Net cash provided by operating activities was $32.9 million, and free cash flow was $20.9 million, as noted earlier. Year to date, free cash flow was $58.8 million as reflective of continued investments in inventory, as well as sets, machinery, and equipment to further facilitate our ability to drive growth into the future.\n\nAt this time, the company is reaffirming its 2022 net sales guidance of $1.025 billion. However, as a result of continued nonoperating headwinds, we are revising our non-GAAP EPS guidance to $2.03 per fully diluted share versus the previous $2.10. This reflects an additional $0.05 currency headwind and a $0.02 tax headwind versus our previous non-GAAP EPS guidance. Our third quarter results delivered on a strong top-line performance across the business.\n\nSpine realized strong growth in the U.S. and international, trauma continued down its path of above-market growth, and our enabling technologies business demonstrated resilience in delivering its new and exciting technologies to the market. Though we did experience more nonoperating headwinds than previously expected, the business continues to deliver on its strong earnings quality as evidenced in our profitability while maintaining discipline in our approach to costs and expenses, all while investing aggressively within R&D to drive continued future growth. We look to continue to drive execution as we seek to close a strong fourth quarter and build momentum going into 2023.\n\nAs always, thank you to the Globus team for their continued pursuit of for excellence. The best is yet to come. We will now open the call for questions. \n\nOperator\n\nThank you. At this time, we will conduct a question-and-answer session. [Operator instructions] Please stand by while we compile the Q&A roster. Our first question is coming from Matt Miksic of Barclays.\n\nMatt, please go ahead with your question.\n\nMatt Miksic -- Barclays -- Analyst\n\nHey, good evening. Thanks so much for taking our questions and congrats on a really strong top-line quarter here. So, one follow-up, if I could. Just some of the drivers you mentioned, Dan, in the quarter, particularly expandable 3D printed and competitive recruiting.\n\nJust if you could maybe update us on sort of how the mix of expandables and 3D printed have been driving the business? What's been driving that in terms of demand? And what does that do to margin mix? And then just obvious question, given the sort of merger and acquisition activity in the space, how, if at all, do you expect that to create new opportunities in recruiting?\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nThanks, Matt. I appreciate the question. So, just a couple of things. I'm signaling that the growth is really throughout the portfolio.\n\nAnd so, you're right, I said expandables, 3D-printed implants, but also the cervical lateral offerings, the biologics, the pedicle screws. It's really kind of a healthy growth throughout. It's not just one product outgrowing the others. With that, though, I would tell you that the uptake 3D printed has been great and stable itself, the expandable really doing well and driving it that way.\n\nSo, I'm pleased with it. Those drivers beyond just existing, and dedicated surgeons using us is, again, the competitive rep recruiting bringing in and helping us penetrate the market. And as we've always stated, once we put the rollouts out, that pull-through of robots is just a great way to get more volume and lots of good things through. So, it's really, to me, a healthy portfolio that way, and I'm pleased with the mix of growth among the products.\n\nWith recent changes that are occurring in the market, certainly, any time there's a market of uncertainty that that may get some folks jittery. And I think if anything, Globus is considered a stable growth, high investment place, a place that reps would want to be. And so, we'll look at that opportunity. I'm not sure we've seen anything of significance right now, but we'll keep our eyes open.\n\nBut again, regardless of where it's coming from, our goal is to continue to penetrate the market, convert surgeons and reps regardless of where they currently are.\n\nMatt Miksic -- Barclays -- Analyst\n\nAnd one for Keith, if I could, just on margins. It's -- you're not as global as some of the larger global med tech companies in the space that have all been held down and impacted by some of the factors you mentioned, FX in particular. Can you talk a little bit about how you -- we should expect that to kind of carry over into next year? Maybe some of the math is dropping through the P&L on FX given that that was part of the reason for the slight miss to expectations and the guide down on the bottom line?\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nSure. As we -- thanks for the question. So, as we go into next year, I think it's fair to assume that our OUS business will continue to grow faster than our U.S. business as we really grow deeper in the markets that we're operating in.\n\nSo, I expect us to -- we're still primarily U.S., but over time, our OUS business is going to continue to grow and grow. As I think about this year and the currency impacts, last quarter, I talked about having about a $0.09 currency impact, and we felt that we were able to really offset that with the impact of the share buyback and some higher interest income. When I look at Q3 alone, our Q3 currency impact was greater than what we experienced in the first two quarters. So, as I look out, the guidance change going from $2.10 down to $2.03, $0.05 of that is simply because of the higher currency impacts versus what we previously had expected.\n\nMatt Miksic -- Barclays -- Analyst\n\nThat's helpful. Thanks a lot, Keith.\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nStand by for our next question. Our next question is coming from Vik Chopra of Wells Fargo. Vik, go ahead with your question.\n\nVik Chopra -- Wells Fargo Securities -- Analyst\n\nHey, good afternoon, and thanks so much for taking the question. Two for me. First one on capital equipment. Just wondering what you guys are hearing on how hospitals are thinking about their capital budgets for Q4, and any sort of color you can provide on expectations for next year.\n\nAnd then my follow-up question is on 2023, not asking for guidance, but any sort of potential headwinds and tailwinds we should start to be cognizant of as we head into next year? Thanks so much.\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nThanks, Vik. I'll take the first one. I would think with anything, the hospitals still remain under some level of pressure, whether it be staffing or paying for traveling, the thought of recession, different things like that. So, I would just tell you that the selling cycle is probably turning back to what it was pre-COVID, meaning taking about nine to 12 months for where that is.\n\nAnd certainly, we're looking at that. We haven't seen any real stops or hesitation with anything yet to date. Hard to say what Q4 will do. We're sitting at the election night and things could always change in one way or another.\n\nSo, there's some uncertainty out there. But nothing that would be of a concern for us and nothing that we would have reflected in our guidance as we round out this year. I'll let Keith kind of respond, but on 2023, I would just say, I think we'll be in a better spot to discuss that. More in January as we go out and give our guidance and stuff right now.\n\nI'm not sure if there's anything that I would see that I would want to signal out in advance to the investors.\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nYeah. And just a couple of comments that I would add there is just in some of my earlier prepared comments, really talked about third quarter delivering a strong top-line performance really across our portfolio. And as I look ahead, we feel good about our business. That's what that statement was intended to imply.\n\nWe feel good about where we're going from a business, whether it's musculoskeletal or enabling tech. As I think about headwinds or tailwinds going down the P&L, we're going to continue to obviously monitor currency impacts that happen out there, which is really nonoperating but also the impact of inflation. That's something that's real. It's something that's out there.\n\nAs time passes, perhaps the fuel surcharges will change. But right now, I don't really have any further comments to add as it relates to 2023.\n\nOperator\n\nPlease stand by for our next question. Our next question is coming from Shagun Singh with RBC. Go ahead with your question.\n\nShagun Singh -- RBC Capital Markets -- Analyst\n\nThank you so much for taking the question. Dan, I was just wondering if you could elaborate on the recon robotic launch, especially as it relates to timing, soft versus a full launch in '23. What will be unique about it, the value proposition? How should you think about economics? And really what I'm trying to get at is, you talked about the best is yet to come. And I'm just wondering how meaningful this launch could be in helping you drive an inflection in sales in '23?\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nThanks, Shagun. I appreciate the question. So, the big question there is that we need to get that filed and approved from the FDA. So, to call out a timing in 2023 would be difficult right now.\n\nWe'll be hesitant to do it. Certainly, our goal is to have that later in the year. I just don't have a clear line of sight to tell you. I feel strongly if that's Q3 or Q4.\n\nWith that and without talking a lot about the features because it's yet unapproved, I will tell you that I'm excited to bring this forward. I think there's meaningful differentiation in it. I think that it will certainly help us in penetrating this market and offering a very viable solution that's out there, but I'll stop there. We'll get further along in that.\n\nPerhaps later in 2023, you and I can have a deeper conversation about that. \n\nShagun Singh -- RBC Capital Markets -- Analyst\n\nGot it. That's helpful. And then I was just wondering if you could elaborate on the enhancements on additional components that you expect to add to Excelsius -- to the Excelsius platform to maintain and probably enhance your competitiveness, and any timing you can share there. Thank you for taking the question.\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nI think if anything, we continue to evolve and add to it and look to learn and improve with it. I think the closest to come out that will be a significant differentiator is going to be our XR headset or augmented reality. And I think with that, we're going to actually shift how procedures are done, add a great deal of value to the surgeons. And I would think that's probably the biggest upcoming addition into that ecosystem platform that we're looking toward right now.\n\nShagun Singh -- RBC Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nPlease stand by for our next question. Our next question is coming from Richard Newitter with Truist. Richard, please go ahead with your question.\n\nRichard Newitter -- Truist Securities -- Analyst\n\nHi. Thanks for taking the questions. So, just a couple for me. Maybe just on your U.S.\n\nspine growth rate reaccelerated nicely back toward 9%. You've been double digits for a period of years leading into COVID and through COVID and then, obviously, there's some distortions. That 20% growth rate you threw out, thank you for that. But how should we think of the go forward? What is the normalized kind of core U.S.\n\nspine growth rate for Globus, especially with all the competitive rep hire momentum you have, you have easy comps sustaining into next year? Just can you give us a sense as to what we should expect and should it even accelerate?\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nThanks for the question. I think as we look ahead to this business from a U.S. spine perspective, we still have a lot of room to grow. We know that our number overall is getting larger, but Dan commented on competitive rep recruiting, as well as the pull-through that we're seeing from robotics and just the development of the ecosystem.\n\nFrom my perspective, we should be a high single-digit grower as we look ahead in the U.S. spine market. We feel really good about where the business is and really feel good about where it's going.\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nYeah. I'd add to that, Rich, that just again, we're approximately a nine share in the U.S. That gives us a lot of runway to go. Obviously, it's predicated on meaningful ways to address unmet clinical needs.\n\nAnd so, at the end of the day, it's going to be about the right products and making a difference that allow us to do that growth. And so we're not going to lose focus on that. That said, for the near future, I would say that that mid- to high single digit in the U.S. is something that we would want to take a look at, OK? \n\nRichard Newitter -- Truist Securities -- Analyst\n\nOK. Thanks. And what about the split between imaging and robots? Or if there's any way you could give us a sense as to whether or not your robot component grew year over year in the third quarter? Just trying to get a sense of what's driving that? Thanks.\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nYeah. I appreciate that. And obviously, for competitive reasons, we're not looking to split that out in any level of detail. And so, I would just tell you, very pleased with our enabling technology growth of both robot and imaging.\n\nBut splitting that out of something I'm going to refrain from doing right now.\n\nRichard Newitter -- Truist Securities -- Analyst\n\nOK. Thanks. And if I could do one more, just how should we think of operating leverage going forward? And where your target EBITDA margin is, especially with some of the nonoperating items that are at play in the P&L. Thanks.\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nYeah. So, I'll take that question. So, from an SG&A perspective, fixed cost leverage, you're -- we're thinking 1 to 2 points max as we look ahead. As we look at the business going forward, we should be able to get more efficient and drive the business forward without adding a lot of incremental costs.\n\nSo, 1 to 1.5 points is probably where we think leverage will take us.\n\nRichard Newitter -- Truist Securities -- Analyst\n\nThank you.\n\nOperator\n\nPlease stand by for the next question. Our next question comes from Matt O'Brien with Piper Sandler. Matt, you have the floor. \n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nGreat. Thanks for the question. So if I look at Globus pre-pandemic, you were kind of high single-digit, low double-digit top-line grower. You're guiding this year to 7%.\n\nYou've got all this robotic tailwind, pull-through, trauma, 3D coming, international businesses growing quickly. So, as I look at the straight numbers for next year at 9%, it's back to kind of pre-pandemic level. Do you think about Globus in that kind of pre-pandemic level of revenue growth over the next several years, high singles to low doubles?\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nI think -- this is Keith. As we think about the business, and again, I fall back to some of the things that both Dan and I said, the business is operating and performing across our portfolio. We feel that we have good products coming. Dan commented on some of those.\n\nSo short answer is yes, we feel good about our portfolio. As things happen, it's never perfect for everything to hit perfectly at the same time. But looking ahead, without getting into guidance for next year, I feel good about where we're at and really good about where we're going to go.\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nYeah, I'll second that, too. I think obviously, 2021 as a comparator to 2022 is flowed, as you know, with the post-COVID bolus and all sorts of activities. And I do think that returning to normal, assuming nothing else comes from a pandemic level, that certainly, we would want to expect 2023 to be.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nOK. Appreciate that. And then as I look at the enabling tech business over the last seven quarters, had up the revenue there versus the previous kind of 13 quarters. And I get that there's some 3D in there and everything.\n\nBut you've just done about the same amount of revenue, the last seven versus the previous 13. I'm just -- I'm wondering about -- are you approaching first of all, and I'll give it a shot anyway. I'm not sure if you'll answer this, but around 300 Excelsius systems out in the field. And then Dan, you've always talked about a lot of pull-through revenue coming.\n\nShouldn't we get a huge chunk of pull-through revenue in '23 and in '24 from what we've seen over the last few years specifically? \n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nSo, a couple of things. We won't comment on a number of placements out there. We'll leave you to your math and figure it out in that range. And I think the pull-through that we have seen with robots is one of the reasons why we grow above the market today.\n\nSo again, unless we have other data, I'm still going to call the spine market, roughly 3% growth, possibly 4%. And I think for us to outpace that by 2 or 2.5x is a factor of us using that pull-through, as well as competitive conversions.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nPerfect. Thank you.\n\nOperator\n\nPlease stand by for our next question. Our next question comes from David Saxon with Needham and Company. David, go ahead with your question.\n\nDavid Saxon -- Needham and Company -- Analyst\n\nYeah, good afternoon, and thanks for taking the questions. I wanted to ask about the Stelkast portfolio. Maybe if you can just give an update on how that product line is going? Is it in a good position to be competitive when the robot does launch? Or is there still more wood to chop in terms of getting products to the market?\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nDavid, thanks for the question. There's more work to do to get the products to market. While we have a strong primary cemented knee, our ability to move into cementless knee is needed, media-congruent type things are needed, updating some of our revision systems just to be market appropriate. They're all in play right now and need to be finished.\n\nThey're not all needed for us to make an impact next year. I think next year is really about us finishing up filing and hopefully getting approval for the robot, and with that, starting the placements that allow that pull-through. But really seriously work to be done in all angles. That's one of the reasons also I refrain from talking a lot about it.\n\nI think that will change as we kind of get into next year and get more traction.\n\nDavid Saxon -- Needham and Company -- Analyst\n\nGot it. Thanks. And then on the international business, I didn't hear you say anything about the commercial team in Japan, that's been a drag for a while now. So, maybe just give an update on how that market is doing and whether or not the team is kind of on the right track now.\n\nThanks so much.\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nNo, I appreciate it, and good for you for calling that out. You're right, I didn't leave it out just because I think they're on the stage of stabilizing like we would have thought as we exited Q3. I want to take my eyes on that. I think they'll be fairly neutral in Q4.\n\nAnd I think it's going to be more of a 2023 story as we do that, but the change wasn't meaningful enough in Q3 versus prior year for me to really call anything out at that point. That's why it was removed from my comments.\n\nDavid Saxon -- Needham and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nStand by for our next question. This question comes from Caitlin Cronin of Canaccord Genuity. Caitlin, go ahead with your question.\n\nUnknown speaker\n\nHi. This is actually Kyle on for Catlin. Can you hear me all right?\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nWe can hear you, Kyle.\n\nUnknown speaker\n\nHi, everybody. So, just a lot has been asked. I just wanted to get an updated thought on -- I appreciate the pipeline commentary about the -- going back to maybe a pre-COVID pipeline on the capital side of things. Maybe just help us understand what you're seeing from ordering demand when you think about going to new customers from a multisystem placement perspective, 3D and the robot.\n\nAnd then I'll throw another one in there, as well as just capital allocation updates here. I mean how do you see the market as it stands now? And how should we think about capital deployment on a go-forward basis?\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nKyle, I'll certainly take the first one. We have certainly had several deals where both the ExcelsiusGPS and the Excelsius3D have been placed out into hospitals or hospital systems. And we're pleased with that. They're obviously meant to work seamlessly together.\n\nAnd so, it's nice to see that uptake occurring. I don't necessarily reveal how much. But I think at any given point, that's the goal. Of course, it can also have a 3D system stand-alone by itself.\n\nAnd so right now, we're early on, I can't say there's a big trend with what we're doing. But certainly, multiple units have been placed along with robots to date. With the capital allocation, are you speaking about the hospitals in their plan or us as Globus?\n\nUnknown speaker\n\nJust speaking on Globus, when you think about capital deployment with respect to the strength of the balance sheet and any potential M&A buybacks, things of that sort.\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nI'll take that part of the question. Thanks for asking. So capital allocation, the primary purpose still is to focus on acquisitions, whether it be tuck-ins or something slightly larger to complement our portfolio. That is still the first and primary focus.\n\nSecondarily, obviously, we're going to continue to invest in our business, whether it be through R&D or growing at our supply chain because we continue to grow our business so much, and we drive a lot of vertical integration. You could expect us to spend dollars there. And thirdly, on the share repurchases, we have roughly about $150 million left on our remaining share repurchase authorization. We did not rebuy anything during the quarter, but that's the order that I would put those in.\n\nUnknown speaker\n\nThank you very much.\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nThank you. \n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Kearns -- Senior Vice President, Business Development and Investor Relations\n\nDan Scavilla -- Executive Vice President, Chief Commercial Officer, President of Trauma\n\nKeith Pfeil -- Senior Vice President and Chief Financial Officer\n\nMatt Miksic -- Barclays -- Analyst\n\nVik Chopra -- Wells Fargo Securities -- Analyst\n\nShagun Singh -- RBC Capital Markets -- Analyst\n\nRichard Newitter -- Truist Securities -- Analyst\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nDavid Saxon -- Needham and Company -- Analyst\n\nUnknown speaker\n\nMore GMED analysis\n\nAll earnings call transcripts"
}