{
  "companyName": "RingCentral",
  "companyTicker": "RNG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/ringcentral-rng-q3-2022-earnings-call-transcript/",
  "content": "RingCentral (RNG 0.11%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the RingCentral third quarter 2022 earnings conference call. [Operator instructions] I would like to turn the conference over to Will Wong, RingCentral's vice president of investor relations. Please go ahead.\n\nWill Wong -- Vice President, Investor Relations\n\nThank you. Good afternoon, and welcome to RingCentral's third quarter 2022 earnings conference call. I'm Will Wong, RingCentral's vice president of investor relations. Joining me today are Vlad Shmunis, founder, chairman, and CEO; Mo Katibeh, president and chief operating officer; and Sonalee Parekh, chief financial officer.\n\nOur format today will include prepared remarks by Vlad, Mo, and Sonalee, followed by Q&A. We also have a slide presentation available on our investor relations website that will coincide with today's call, which you can find on the financial results section at ir.ringcentral.com. Some of our discussions or responses to your questions will contain forward-looking statements, including our fourth quarter and full year 2022 financial outlook and our assumptions underlying that outlook. These statements are subject to risks and uncertainties.\n\nActual results may differ materially from our forward-looking statements. A discussion of the risks and uncertainties related to our business is contained in our filings with the Securities and Exchange Commission and is incorporated by reference into today's discussion. RingCentral assumes no obligation and does not intend to update or comment on forward-looking statements made on this call. Unless otherwise indicated, all measures that follow are non-GAAP with year-over-year comparisons.\n\nA reconciliation of our GAAP to non-GAAP results is provided with our earnings release and in the slide deck. Please visit our investor relations website to access our earnings release, slide deck, our GAAP to non-GAAP reconciliations, our periodic SEC reports, a webcast replay of today's call, and to learn more about RingCentral. For certain forward-looking guidance, a reconciliation of non-GAAP financial guidance to the corresponding GAAP measures is not available as discussed in detail in the slide deck posted on our investor relations website. With that, I'll turn the call over to Vlad.\n\nVlad Shmunis -- Founder, Chairman, and Chief Executive Officer\n\nGood afternoon, and thank you for joining our third quarter earnings conference call. We had a solid quarter and exceeded our guidance on every key metric. Total revenue of $509 million was up 23% versus last year and above our outlook of $502 million. We achieved this result despite an increasingly difficult macro environment.\n\nWhile it is hard to predict the exact timing of an economic recovery, we're confident that RingCentral will continue playing a prominent role as businesses rationalize their spend and strive to be more efficient via digital transformation efforts. We serve a mission-critical need and provide customer value as they migrate from legacy systems to the cloud. Additionally, we delivered a record quarterly operating profit margin of 13.5%, up 300 basis points versus last year. This was significantly above our guidance of 12.5%.\n\nLooking ahead, I'm confident in our ability to deliver strong operating results, which includes meaningfully expanding profitability. To this point, we're now targeting operating margin expansion of at least 350 basis points in 2023. This puts us on an accelerated path to achieving our prior commitment of at least a 20% operating margin. Now, let me share the reasons why RingCentral is winning in the UCaaS market.\n\nFirst, we win because we believe we have the world's best cloud phone system. Innovation is part of our DNA. We will continue to make targeted investments in key growth areas, such as AI, analytics, and contact center, and provide differentiated, intelligent, and connected experiences to our customers as they proceed with their digital transformation. These investments will further add to what we believe is the most complete cloud PBX solution in the world, with features for every type of user and use case.\n\nWith over 8,500 private and public applications and an ecosystem of over 75,000 developers, we enable customers to innovate on our platform. This includes over 150 pre-built telephony apps, over 330 pre-built apps for UC and CC, and the most advanced integrated contact center experience. One integration example is with Salesforce. Our integration lets customers make and receive goals, schedule RingCentral video meetings, and quickly assign call dispositions, all without having to leave Salesforce.\n\nCustomers are also able to make and log customer calls from anywhere in the world. With advanced features such as offline and multi-call logging that no other provider has, users can save time which they can allocate to revenue-generating activities. This integration and the hundreds of other integrations we've developed, including with Microsoft, Google, ServiceNow, HubSpot, Zendesk, and others, have helped us become an industry leader. But that's not all.\n\nOther key differentiators include our outstanding 99.999% reliability, which we achieved for the 17th consecutive quarter, as well as our global reach with full availability in over 45 countries and presence in over a hundred countries. We also support a wide range of end points, including from our strategic partners such as Mitel, Avaya, Atos, and Alcatel-Lucent Enterprise. We also have a fully integrated IMS cloud architecture that enables fixed mobile convergence that is a key requirement from some of our GSP partners. Second, we win because of our unmatched partner ecosystem, which is made up of our strategic partners and multiple global service providers.\n\nWe have a proven ability to partner with the world's leading on-prem PBX providers, as well as leading service providers, such as AT&T, BT, Telus, and Vodafone. I am also very pleased to announce our new upcoming relationship with Charter Communications, where we will be launching a joint offering for both SMB and enterprise businesses. Be on the lookout for more details in the coming days. And last but not least, we have over 15,000 resellers spanning the globe.\n\nWe believe this gives us unrivaled access to the large market opportunity ahead of us. Finally, we win because we're known as the leader in our industry. We're proud to be a Gartner Magic Quadrant for the unified communications as a service worldwide leader for seven years in a row, with the last recognition occurring in 2021. Gartner also recognize RingCentral for being ranked No.\n\n1 in all four use cases in the 2021 Gartner Critical Capabilities for Unified Communications as a Service worldwide report, updated August 1, 2022. Additionally, this quarter, The Tolly Group, a leading global provider of testing and third-party validation and certification, conducted a feature-by-feature comparison of analytics capabilities in which RingCentral met 100% of the specification criteria outlined in certain categories. The next closest vendor only met 100% percent in four of the 13 categories. Lastly, Synergy Research Group recently recognized RingCentral as a leader in UCaaS with over 20% market share based on paid seats, which is double the second and third place vendors.\n\nThe big picture is that voice remains as relevant as ever. A good reminder of this is a recent survey of key technology purchase decision-makers, which highlighted that 90% of business leaders prefer to use the phone over other communication tools. This is true across companies of all sizes, with use cases ranging from internal calls and meetings to external client and vendor calls. Of note, we see this in our own customers as well, as more than 95% of our base actively use phone.\n\nWe're just at the beginning of the journey. There are $400 million telephony seats worldwide, and many of those seats are expected to move to the cloud, driven by a number of clearly visible megatrends. This includes the shift to hybrid work, ongoing adoption of mobility by businesses, increasing reliance on distributed workforces, and the desire for an integrated cloud-based UC and CC solution from a single provider. Synergy recently concluded that just 21 million UCCs are in the cloud today, or a single-digit penetration rate.\n\nThis highlights how early we are in the journey when comparing to the number of seats that are still on prem and are yet to be migrated. Looking forward, we will remain laser-focused on delivering a best-in-class UCaaS offering by investing in innovation and driving profitable growth. Throughout the year, we have taken steps to expand our operating margins and drive efficiencies throughout our business. While we recently made the extremely difficult decision to further rationalize our workforce, we believe this will allow us to be more agile and better align our course with our strategic priorities in the current macro environment.\n\nThis decision was not made lightly, and we understand the impact this has on our people and their families. We're taking meaningful action to help ease the transition for our impacted employees. We want to underscore how grateful we are for their hard work and all their contributions. RingCentral would not be where we are today without them.\n\nFinally, I want to reiterate how proud I am of what we as a company have accomplished. Building from two guys in the garage, we're now a $2 billion recurring revenue business with leading share and an unrivaled platform. I believe we're well-positioned to emerge even stronger as the economic recovery begins. Now, let me turn the call over to Mo.\n\nMo Katibeh -- President and Chief Operating Officer\n\nThanks, Vlad. Q3 results were solid as we continue to execute despite a more challenging economic backdrop. We had solid new deal activity, highlighted by multiple $1 million-plus TCV wins. We also saw good activity from strategic partners, and our contact center attach rate was again over 60% for our large deals.\n\nLet me give you a few examples of our recent wins. First, a win at HealthComp with our newest strategic partner, Mitel. HealthComp is one of the nation's largest third-party benefits administrators. They chose RingCentral to be their communications partner for both UC and CC as part of their enterprisewide digital transformation.\n\nOur integration with Teams, which they currently use, was key in helping us win this deal. This is in addition to our leading voice and advanced e-fax, SMS, and integrated contact center capabilities, which Teams does not offer. Relative to our contact center, HealthComp is now able to expand customer outreach to all channels, including voice, chat, email, social, and 30-plus digital channels. And importantly, we enabled HealthComp to save money by routing calls to the first available agent, which also reduced agent idle time, as well as by enabling them to utilize analytics to determine productivity opportunities.\n\nWe continue to see customers like HealthComp choose RingCentral due to our best-in-class integrated UCaaS and CCaaS platform. Second, in the current environment, cost savings are also an important catalyst in driving purchasing decisions. For example, a large Fortune 500 company in the logistics sector with operations in over 50 countries selected Avaya Cloud Office by RingCentral to help them consolidate disparate systems created over many years. Multiple IT teams were required to maintain these systems, which also ran on separate carriers, resulting in higher operating costs.\n\nMoving to RingCentral's cloud infrastructure will enable them to quickly replace outdated equipment and improve collaboration and communication, all while showing an overall reduction in the total cost of ownership by 30%. I also wanted to highlight a number of wins in the education sector, including a nearly 5,000-seat win at the University of North Dakota and an over 3,000-seat win at a large Midwest university. This continues the trend that we've seen in the last few quarters, with many thousands of seats being added across school districts and universities. Now, turning to our partners.\n\nOur strategic channel and GSP partners also continue to be a key part of our go-to-market motion. Both Mitel and Avaya again grew new seats sold quarter over quarter. On the channel side, we saw a quarterly record number of leads generated, and we expect those leads to translate into opportunities and sales over time. Also, our channel partners continue to drive incremental new deal activity and were part of over 60% of our $1 million-plus TCV deals this quarter.\n\nChannel partners enjoy working with RingCentral because we offer flexible paths to the market depending on their business needs and individual customer use cases, while also providing tools and training to help them succeed. Regarding our GSP partners, we continue to see positive growth, are beginning to ramp with Vodafone in Europe, and, as Vlad stated, we're excited to begin working with Charter. And finally, we continue to invest in expanding sales internationally. We landed multiple $1 million-plus TCV deals outside the U.S., including with Healius, one of Australia's leading healthcare companies.\n\nAnd we expect more as we ramp in the coming quarters in years ahead. Now, let me provide you with an update on what we're seeing in the market today. Leads, pipeline, and win rates remain strong and stable. That said, sales cycle times for our upmarket customers, which reverted to pre-COVID levels last quarter, elongated incrementally in Q3, as customers required additional approvals before making purchase decisions.\n\nThis also resulted in smaller initial purchases. We anticipate that this behavior will persist until the macro environment becomes less uncertain. These factors, along with the stronger dollar, were headwinds to our business this quarter. Of note, overall churn has remained stable throughout the year, and overall ARPU remained stable and over $30.\n\nSonalee, will discuss in more detail how these trends are impacting our near-term financial outlook. Looking forward, the market remains large and under-penetrated. And we believe our leading product, ability to drive cost savings, and unmatched partner ecosystem will continue to resonate with customers. And importantly, our focus on profitable, efficient growth puts us in a stronger position going forward to capture that opportunity.\n\nTo summarize, we had a solid quarter despite the current macro environment. Our leading product continues to differentiate us from others, and our focus on execution and driving profitable growth sets us up well for the future. Now I'll pass it over to Sonalee to discuss our financials and guidance.\n\nSonalee Parekh -- Chief Financial Officer\n\nThanks, Mo. I'll provide highlights from the third quarter and then discuss our business outlook for the fourth quarter and full year. I am very pleased with our Q3 results, which were above guidance across all key metrics. Subscriptions, revenue of 483 million was up 25% year over year and above our growth outlook of 23% to 24%.\n\nOn a constant currency basis, subscriptions revenue rose 27% year over year. Once again, overall and new acquisition ARPU held steady. Customers value our differentiated offering, which was the primary factor in the continued resilience of our ARPU. Subscription gross margins remain in the top tier of software peers and were again over 82%.\n\nMoving to ARR. ARR grew 25% year over year to 2.05 billion. On a constant currency basis, ARR grew 28%. Given the recent strengthening of the dollar, particularly versus the British pound, which is our largest exposure, currency represented a $19 million headwind this quarter relative to the second quarter.\n\nAs a reminder, we adjust our entire ARR base using currency rates on the last day of each quarter. Now, moving to profitability, operating margin was a record 13.5%, up 300 basis points versus last year and a full 100 basis points above our prior outlook. This is the third consecutive quarter that we have solidly exceeded our operating profit margin outlook, which demonstrates our ability to execute on our strategy of driving efficient growth. Our margin improvement was and will continue to be driven by four main levers.\n\nOne, we are seeing the benefits of operating leverage as we scale above $2 billion in recurring revenue. Two, we are prioritizing more efficient labor spend and taking further steps to improve the productivity of our workforce. As Vlad noted in his opening remarks, we have made the extremely difficult decision to reduce our full-time workforce by approximately 10% to ensure our cost base is aligned with our strategic priorities in the current environment. Three, we are rationalizing program spend, such as marketing and lead generation activities, to ensure they meet our hurdle rates, as well as being judicious around all discretionary spend.\n\nFour, we are consolidating vendors to simplify our procurement process, as well as drive savings across all functions. Now, moving to our balance sheet and cash flow. We ended the quarter with 305 million of cash on hand. This is inclusive of $20 million of shares repurchased during the quarter.\n\nWe generated free cash flow of 21 million in Q3 and 88 million year to date. Note that our free cash flow includes one-time cash outflows related to third-party relocation efforts and efficiency actions we took in Q3. Excluding these one-time items, our year-to-date free cash flow would be 119 million or a margin of 8%. During Q3, we recorded a 125 million noncash charge related to our Avaya prepaid commissions balance, given their recent public disclosures.\n\nPlease refer to our third quarter Form 10-Q for additional details. We will continue to monitor the Avaya situation and take financial actions accordingly. As Mo noted, the number of ACO seats that Avaya sold continue to grow quarter over quarter. Now, turning to guidance.\n\nThis outlook is reflective of what we see in the market today. As Mo noted, leads, pipeline, and win rates remained strong and stable. Overall churn also remained stable. However, sales cycle times for upmarket customers elongated incrementally in Q3, as customers required additional approvals before making purchase decisions.\n\nThis also resulted in smaller initial deployments. While our SMB segment is proving to be resilient in the current climate, we believe enterprise customers are being more cautious, given the current economic landscape. And we don't expect this to change in the near term. Taking this into account, for the fourth quarter, we expect subscriptions revenue growth of 19% to 21%; adjusted for constant currency, we expect subscriptions revenue growth of 22% to 23%; total revenue growth of 17% to 18%; adjusted for constant currency, we expect total revenue growth of 19 to 20%; non-GAAP operating margin of 14%, which reflects 350 basis points of year-over-year improvement; and non-GAAP EPS of $0.59 to $0.60.\n\nNote our workforce reduction actions will result in GAAP-only restructuring charges of 10 million to 15 million related to employee severance and benefit costs, which we expect to incur in the next two quarters. For the full year 2022, we are reiterating our subscriptions revenue growth outlook of 27% to 28%. Adjusted for constant currency, we expect growth of 29%. Additionally, we expect total revenue growth of 25%.\n\nAdjusted for constant currency, we expect growth of 26% to 27%. Lastly, we are once again raising our operating margin and EPS outlook. We now expect full year non-GAAP operating margin of 12.4%, up from our prior outlook of 12%; and non-GAAP EPS of $1.97 to $1.98, up from our prior range of $1.91 to $1.95. Throughout 2022, we have shown our ability to consistently deliver strong and improving profitability.\n\nAt the start of the year, we guided to operating margins of 10.6% for 2022. We now expect operating margins of 12.4% for the full year 2022, or up 220 basis points. Further, we plan to exit Q4 with an operating margin of 14%, which is up a full 350 basis points year over year. Looking ahead, we now expect operating margins to expand at least 350 basis points year over year in 2023, which accelerates our path to achieving our target of at least a 20% operating margin.\n\nWe expect to generate a significant amount of cash flow over the next few years. This will provide us with increased flexibility as we look at capital allocation going forward, including our capacity to make strong ROI investments and increased optionality on addressing our March 2025 converts. To summarize, I am very proud of the quarter we delivered. RingCentral is well-placed to navigate the current environment, and we have the financial profile and flexibility to invest in the significant opportunity ahead of us, while continuing to grow and expand profitability in a meaningful way.\n\nWith that, let's open the call for questions.\n\nOperator\n\n[Operator instructions] And our first question will come from Kash Rangan with Goldman Sachs. Please go ahead.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nHey. Thank you very much. Nice job on the operating leverage and good cost discipline here. I'm curious to get your take on retention trends among small businesses.\n\nThere's been a little bit of concern if there's layoffs, etc., which continues to pervade affected install base. Not that that is what you're experiencing, but I'm just curious to get your take on how you see the strength of the SMB ecosystem and your install base. I would really appreciate the long sales cycle of the enterprise market. I'm more concerned about the SMB side.\n\nThat's it. Thank you so much.\n\nVlad Shmunis -- Founder, Chairman, and Chief Executive Officer\n\nSure, Kash. Yes. Hi. Vlad here.\n\nGreat to have you on. It's a fantastic question. I'm glad you that you asked. I'm glad with that.\n\nLook, I think many folks underestimate resiliency of SMBs. And as you know, you know, we've been through cycles, and I've been through cycles. We started out as an SMB company. We're now multichannel, multi segment, so we have a much wider exposure.\n\nBut to your question, SMBs are fine. Now, to be clear, we -- earlier in the quarter, in the first month of the quarter, we saw some elevated fraud. Not really during fraud. But everything has stabilized, and it seems to be steady as you go for now.\n\nI'll let Mo provide more detail. But I can tell you, in these turbulent times, I think that the wider your base, the better is my take.\n\nMo Katibeh -- President and Chief Operating Officer\n\nKash, thanks for the question. Yeah. To answer the other part of it, our overall net retention remained stable and above 100%. And we're going to continue to monitor SMB for any signs of a slowdown.\n\nBut as Vlad said, it's showing resilience. And even in terms of what we've seen so far in October is that small SMB continues to be pretty resilient. Sonalee, anything you'd like to add?\n\nSonalee Parekh -- Chief Financial Officer\n\nYeah. And, Kash, the other thing I'd just say is that, certainly, from a collections point of view, we've seen absolutely no impact in terms of the SMB base. Actually, if anything, collections have been stronger this quarter than in most recent quarters, and also no change to the bad debt expense on that count either.\n\nMo Katibeh -- President and Chief Operating Officer\n\nNext question, please, operator.\n\nOperator\n\nOur next question will come from Meta Marshall with Morgan Stanley. Please go ahead.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. You know, appreciate all of the guidance that you gave on 2023. Just how should we think about growth in 2023 with kind of the operating leverage that you're planning on showing? And just how much of how you look at growth in 2023 is impacted by macro versus kind of objectives to gain operating leverage? Thanks.\n\nSonalee Parekh -- Chief Financial Officer\n\nThanks, Meta. I really appreciate the question. So, clearly, you did call out the operational leverage that we've gotten to for 2023. As you know, we don't typically guide to revenue growth at this point in Q3 for next year.\n\nWhat I would say, just in terms of the trade-off you pointed to, we don't really see it as a trade-off. We feel like we can drive the operational leverage that's really inherent in a SaaS model when you scale to the size that we now are, you know, 2 billion plus of recurring revenues. In terms of the macro, you know, we did talk to certain trends Mo alluded to in his script. Sales cycles elongating to sort of the levels we saw pre-COVID.\n\nWe are seeing heightened approvals and sometimes multiple approvals certainly for our larger customers and, you know, some impact from smaller initial deployments on deal sizes. And that did, you know, incrementally worse Q3 and Q2. We also have a bit of FX impact in the quarter. And if you look ahead, you know, we have a further FX impact if you look at our Q4 guide.\n\nIt's about an additional 1 point of pressure on top line. But what I'd say is, you know, you've heard us talk this year about driving efficient growth. And, you know, we did 300 basis points of expansion in Q3. We're now guiding to a further 350 basis point year over year in Q4.\n\nAnd we've really tried to outline for you an accelerated path of getting to that at least 20% OP margin that we alluded to last time we posted earnings. So, we've now laid out a target, really, of about 700 basis points of improvement over, say, eight or so quarters. And 2023 will be a further 350 basis points on top of where we ended -- where we will end 2022. So, I think, really, we're getting the benefits of scale.\n\nAnd then, we're also looking, you know, at all aspects of the business and being super disciplined around those margin levers that I called out in my script. You know, obviously, a lot more efficient around labor spend. You did see that today. We made the extremely difficult decision to let 10% of our full-time headcount go.\n\nThat, obviously, will have an impact mainly in Q1 of next year. But we're really being disciplined on all aspects of the P&L. And, you know, as we look to 2023, we really expect to see that operational leverage kick in on OP margin, OP growth, and you know, also fall to free cash flow as well. So, we don't really see it as a trade-off.\n\nWe are driving efficient growth, and that's the way forward.\n\nOperator\n\nOur next question will come from Ryan MacWilliams with Barclays. Please go ahead.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nThanks for taking the question. And I'd like to reiterate, pleased to see the improving margins. Sonalee, what could the restructuring actions mean from a dollar perspective for next year, or how you think about that? Thanks.\n\nSonalee Parekh -- Chief Financial Officer\n\nYeah. Thanks for the question, Ryan. So, I think in my script, I was quite specific about the restructuring charge that we take as a result of the actions. So, that's anywhere between 10 million and 15 million.\n\nAnd that will be a gap only, below-the-line charge associated with the restructuring. In terms of how to think about, you know, the overall impact of the headcount action, we've guided to 350 basis points of margin improvement for next year. And I said just now to Meta that, you know, we'll see a significant uptick really in Q1 from those headcount actions. And what I would say is, you know, labor is, you know, a fairly strong or fairly big contributor to the overall margin improvement.\n\nBut we're also going to post improvement in areas like spend in marketing, rationalizing procurement spend. You know, there's a list of over 50 initiatives that we're working on now. So, the increment will really be very broad-based across the P&L. But in terms of the headcount action, you should expect 10 million to 15 million of P&L charge.\n\nAnd then, obviously, the benefit will go through from Q1 and, you know, increasingly throughout the year.\n\nOperator\n\nOur next question will come from Michael Turrin with Wells Fargo. Please go ahead.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey, great. Thanks. Appreciate you taking the question. Vlad, you've seen cycles before you started this business in 1999.\n\nCan you put some context around how your playbook changes? It looks like there are some quicker actions you're making here. The margin emphasis is clear. But anything else you'd point us and investors to that's informing your decision process here based on prior cycles? Thank you.\n\nVlad Shmunis -- Founder, Chairman, and Chief Executive Officer\n\nSure. Sure. Well, to be clear, I didn't know cycles prior to '99, but there were some cycle problems in '99. Look, my general belief and understanding is that cycles come and go.\n\nSeasons come and go. And, you know, eventually, sanity prevails. We're obviously in a very different macro. RingCentral, with a sizable player in the large market, and we are obviously not immune.\n\nOK? Having said that, we have a very strong core belief that what we do matters. We're solving a real need for many, many hundreds of thousands of businesses and many millions of end users. I believe we've shared our end user count of over 5 million. That is the largest pure play in the industry.\n\nOK? And -- which guides at approximately 2x of actually paying users. So, that's a major asset. OK? Not anyone else can really boast that in our space. So, what are our priorities? It's, firstly, to make sure that our user base continues to enjoy our services, including our absolutely unrivaled reliability, five-nines reliability, unrivaled security, and, of course, our differentiated feature set, where we simply check more boxes for more people than anyone else in our space.\n\nThat's our No. 1 priority. Secondly, we believe that, again, this cycle will also end. There will be another expansion.\n\nWe want to be set up well for the goodness that will undoubtedly come to be at some point in time. OK? And we can discuss if it's next year or the year after. But, you know, life will go on. So, what does this mean with respect to your question.\n\nWe are absolutely going to continue our innovation strategy and innovative efforts. The cutback that we've announced has largely spared our R&D force. OK? And the areas that are interesting over and above what I just mentioned, which is keeping the lights on, basically. But there is a lot happening in AI.\n\nThere is a lot happening in analytics. There is a lot happening in our platform. If you look through the prepared remarks, I think we specifically called out our largest UCaaS developer ecosystem. OK? Which is both, in terms of number of software engineers who have used our API, which is in the, you know, what -- I would say about 75,000 of them, as well as many hundreds of actually prepackaged apps and integrations sitting in our app gallery.\n\nThose are all differentiators. Those are all strengths, and we will be redoubling on those. OK? And so, that's on the R&D side. I think I already mentioned, if not I'll repeat, deeper, better UCaaS, CCaaS, or cloud phone system, cloud contact center integration.\n\nOK? That's definitely an area of emphasis for us. And look, on GTM, you know what? Life goes on. OK? We just announced a very, very major relationship with Charter Communications. Charter is obviously one of the U.S.\n\nleading MSP cable service providers. We could not be happier or more proud with this. We hope there is more to come. For now, up until now, we have been quite successful, I would say uniquely successful, with global service providers.\n\nBut that's basically your telcos, AT&T, BT, Vodafone, like that. Here, it's a major win in what is really, you know, next adjacent market. So, we will continue those efforts. We will continue onboarding and enabling new resellers, as well as we will continue in addressing, you know, what is still the juiciest market to yet go through digital transformation, which is 400,000 -- sorry, 400 million on-prem PBX seats that are still sitting there on-prem and with overall cloud market penetration in the 5% range, about 20 million.\n\nSo, we have our hands full. And I tell you what, it's great that we're at the scale where we are, $2 billion growing, profitable, joining to be -- to much more serious profitability effective immediately, certainly in '23 and beyond. We'll be fine. We'll survive this one, come out stronger.\n\nOperator\n\nOur next question will come from Michael Funk with Bank of America. Please go ahead.\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you for the questions tonight. So, I don't think the comment on the sales cycle was surprising. I heard that quite a bit this quarter.\n\nI did think that your tone around funnel in the business in general is actually more constructive than we've heard otherwise this quarter from other companies. So, just wondering if your partner relationships maybe are helping with the resiliency in your business. [Inaudible] also when you're getting through the partner relationships.\n\nMo Katibeh -- President and Chief Operating Officer\n\nGreat question. Thank you much for it. Yeah. As we called out, we're very proud of our broad go-to-market approach.\n\nWe're offering our customers multiple paths to the cloud, whether that's from the GSP community, Vlad articulated charter joining that group; whether it's our VAR channel community, 15,000 plus strong; as well as our strategic partnerships with the legacy PBX on-prem providers. And to your point, yeah, absolutely. We've called out that multiple million dollar wins have come from those partnerships. We're continuing to work well across all three of those dimensions to address the cross-segment opportunity that exists in this extremely lowly penetrated market.\n\nThanks for the question.\n\nOperator\n\nOur next question will come from Peter Levine with Evercore ISI. Please go ahead. Yeah.\n\nPeter Burkly -- Evercore ISI -- Analyst\n\nYeah. Hi, guys. This is actually Peter Burkly on for Peter Levine. Appreciate you taking the questions here.\n\nI'm just curious, you know, given Avaya's financial situation right now, I'm curious if you could share any potential risk to the ACO partnership. And then, maybe, you know, any contractual provisions you have in place protecting that partnership from any change in control or restructuring with Avaya.\n\nVlad Shmunis -- Founder, Chairman, and Chief Executive Officer\n\nYeah. Look, I'll take it to the high level. Vlad here. Again, Mo will, of course, detail.\n\nBut look, at the high level, we have all kinds of contractual provisions in place. But, you know, we'll just have to see how Avaya, you know, proceeds. And, you know, we are rooting for them to stay an independent company and to continue as a going concern. You know, as a reminder, they're still the world's largest shareholder of on-prem seats, both in UCC and CC.\n\nOK? That's a big thing. They're still a very large company with something like $2.5 billion in revenue and sticky customers. Very importantly, for our relationship, is the fact that they do not have a UCaaS offering. ACO is their only UCaaS offering, and they are contractually barred from having another one.\n\nAnd regardless of what happens, you know, with the company moving forward, you know, we know that, for the last three years, that they've signed their exclusive arrangement with us. They were not supposed to have been working with UCaaS, and we have never been -- you know, we never heard that they were and just, you know, no ramblings to that effect. So, what this really means is that their approximately 100 million installed seats, which is what they've been disclosing publicly, are largely still up for grabs, you know. And our position is and understanding is that while we would very much like for Avaya to survive the difficulties and to continue under the current arrangement.\n\nBut. In the unfortunate event that it does not start to me, it still doesn't change the fact that those-on prem customers need to go to the cloud. RingCentral is still undisputed leader in unified communications as a service, and also the fact that, through our multiple years of working closely with Avaya, we believe we are in the best position to support their customer base, including their end points, where we believe we are in a very advantageous position given the work that already took place. So, that's where we are on Avaya.\n\nI can also mention that even through all of these well-publicized difficulties, of theirs, not ours, to be clear, OK, but Q2 -- I'm sorry, Q3 grew quarter over quarter over Q2. And Q2 grew quarter over quarter over Q1. So, there is clearly demand. And, you know, let's say we're cautiously optimistic.\n\nMo?\n\nMo Katibeh -- President and Chief Operating Officer\n\nVlad, I think you hit it all. I mean, just to recap, ACO seats that Avaya sold has continued to grow sequentially quarter over quarter for the last several quarters. We're the only UCaaS provider that is compatible with Avaya endpoints. ACO is a bright spot for Avaya, and there are tens of millions of seats out there.\n\nAnd we have a right to win. We are the obvious choice for those customers as they're looking to migrate to the cloud at whatever point is appropriate for them. Thanks for the question.\n\nOperator\n\nOur next question will come from James Fish with Piper Sandler. Please go ahead.\n\nJames Fish -- Piper Sandler -- Analyst\n\nHey, guys. Thanks for the question. I just want to touch base on the Avaya prepaid commission write-down. What would prevent it from being the rest of the prepaid commissions that are left there? Could we see another further write-down is really what I'm asking? Or did we actually work through that 375 now with the 125 write-down? And additionally, I understand why you guys would be seeing a slowdown in the mid-market and SMB side, but why did enterprise, as a segment here, slow the fastest this quarter? Thanks, guys.\n\nSonalee Parekh -- Chief Financial Officer\n\nThanks. I'll just take the first question on the Avaya noncash write-down, and then I'll hand over to Mo just on enterprise. So, in the quarter, we recorded 125 million noncash charge related to the Avaya prepaid. And that was as a result of their public disclosures, and we felt it was prudent to do in the circumstances.\n\nIt doesn't in any way mean we're stepping away from their commitment to us. As Vlad just outlined to you, on a commercial basis, we actually saw more seats this quarter versus last quarter and the quarter before. So, in terms of the commercial arrangement, we are still transferring seats, actually, at an accelerated pace. In terms of, you know, any further write-down, it's really hard for me to give you any color on that, apart from the fact that, you know, like any other prepay or any other asset, we will evaluate it based on new information every quarter and do the impairment testing that we do and -- you know, as we did in this case.\n\nSo, not really much else to add there.\n\nMo Katibeh -- President and Chief Operating Officer\n\nTo pick up and hit on the second part of the question around enterprise, you know, one thing to keep in mind is that sequentially, quarter over quarter, we did see about $20 million of exits, which is predominantly in that enterprise space. And then beyond that, it's the reasons that I articulated during my prepared remarks, which is, hey, look, while leads and pipe and win rates remained strong and stable, we have consideration of the trends that I outlined in the second quarter, which is modestly elongated sales cycles. Very much aligned with what we were seeing in pre-COVID, as well as earlier -- I'm sorry, smaller initial deployments in the enterprise space. And look, I mean -- I think every company is resembling that remark right now.\n\nLike within RingCentral, we've recently changed our own purchase order process to give Sonalee and I even more visibility in what's being approved. And we're seeing that same dynamic play out across the board due to the uncertain macro. Thanks for the question.\n\nOperator\n\nOur next question will come from Siti Panigrahi with Mizuho. Please go ahead.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nThanks for taking my question. I just want to dig a little bit into the macro question, especially, you talked about slowdown. Did you see, toward the end of the quarter, that slowdown? And when I look at enterprise growth deceleration and you talked about sales elongation, did you see any deals that got slipped and you expect that to close maybe in Q4?\n\nMo Katibeh -- President and Chief Operating Officer\n\nOK. So, let me address both prongs of that. Generally, what we see is, especially upmarkets, a more back-end-loaded quarter. I mean, that's been historically true, and it's remained.\n\nThe elongated sales cycle, additional approvers, all the things that I just articulated, certainly, do play into deals that, you know, one might have expected to hit in one quarter roll into the next. That's been true for both third quarter and second quarter and, frankly, you know, unlikely to change. And it's something that we factor in as we got for our fourth quarter. And something will factor in as we go into '23 as well.\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nOur next question will come from Matt Niknam with Deutsche Bank. Please go ahead.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nHey. Thank you for taking the question. I know we talked a little bit about Avaya. But I'm just curious, in terms of the partnership with NICE, any update you can share in terms of how that's faring, whether you're seeing more success with cross-sell there at the lower end or upper end of the market? And then, maybe secondly, I think, Sonalee, you alluded to this, but -- and I know we're several years away, but any initial thoughts you can share on how you're planning on addressing the roughly 1.65 billion in upcoming '25 and '26 maturities, just given where rates are today? Thanks.\n\nMo Katibeh -- President and Chief Operating Officer\n\nOK. I'll take the NICE question, then turn it over to Sonalee. You know, first and foremost, I'll say we're seeing continued success in attaching contact center to our largest deals. You know, as part of the prepared remarks, we talked about continuing to see 60% plus of our largest deals, having contact center attached.\n\nAnd I really think that speaks to two things. One is the pretty amazing integrations we built as part of our UCaaS platform, as well as the buying behavior that we're seeing in the market, where more and more, especially mid-market up customers want to buy these two products together because it allows for a much-improved end customer experience -- employee experience by allowing integration of both customer-facing employees and the ability to seamlessly transition customers and back-office employees. Think of it as a contact center-like technology, if you will. And that's really the power of the integrations that we've built and why we're continuing to see strong wins there.\n\nWith that, let me turn over to Sonalee to talk about the second question.\n\nSonalee Parekh -- Chief Financial Officer\n\nThanks, Mo. Thanks for the question, Matt. Yes, of course. You know, capital structure is always top of mind for a CFO.\n\nAnd, you know, in terms of the actual converts themselves, as you quite rightly pointed out, they're not due -- you know, the first one comes due over two years from now, March 2025, and the second one in March 2026. And what I would say is, if you think about the financial profile that we outlined for you today and particularly around that expansion of OP margin, which will, you know, also drive free cash flow expansion, and you think about the optionality that that will give us in terms of how we decide to fund the business going forward, it's really a picture of a strengthening financial profile. Today, I'm really happy with, you know, the converts because they -- you know, we don't pay anything for them at 0% interest. But I feel like the flexibility we have to address them only gets better and will only get better from where we are today.\n\nSo, thanks for the question.\n\nOperator\n\nOur next question will come from Tim Horan with Oppenheimer. Please go ahead.\n\nTim Horan -- Oppenheimer and Company -- Analyst\n\nThanks, guys. Can you talk about the overall competitive and pricing environment? Are you seeing Microsoft or Zoom or anyone else getting more aggressive or less aggressive? Thanks.\n\nMo Katibeh -- President and Chief Operating Officer\n\nWell, thanks for the question, Tim. This is Mo. What I'll tell you is, as we said in our prepared remarks, we are continuing to see overall ARPU staying strong and steady over $30. This has been a very consistent metric that we've given for three quarters in a row now and, you know, I think something that speaks to the resilience of this product set in the marketplace.\n\nTo the second half of your question, I articulated that our win rates have remained steady and strong as well. So, when you think about those two things together, what I would tell you is, you know, broadly, no, we're not seeing any elevated levels of competition that's resulting in deal loss or ARPU degradation. Thanks for the question.\n\nOperator\n\nOur next question will come from Brian Peterson with Raymond James. Please go ahead.\n\nBrian Peterson -- Raymond James -- Analyst\n\nThanks for taking the question, and I appreciate all the commentary, especially all the way out into 2023. Mo, I just wanted to double click on one of your comments. You're not alone in seeing sales cycles expand. I'd love if you could open up on that maybe a little bit more in terms of, is that more on the net new side? Or has the expand motion -- with your enterprise customer base, has that slowed down a bit as well? Thanks, guys.\n\nMo Katibeh -- President and Chief Operating Officer\n\nGood question. What I'll tell you is that, you know, this modulates a bit quarter to quarter. But essentially, approximately, 60% of our new bookings comes from acquisition, and approximately 40% comes from net upsell. We're generally seeing those two things move together with no meaningful change over the last few quarters.\n\nAnd so, you know, as you think about the trends that I articulated there, they're playing out across the board, whether it's, you know, a new shift from on-prem to cloud, or as people are thinking about spending incremental dollars, expanding what they have today. Thanks for the question.\n\nOperator\n\nOur last question will come from Matt Stotler with William Blair. Please go ahead.\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nHey, team. Thank you for taking the question. We get a lot of inbound from investors on your stock-based comp as a percentage of revenue. You know, it had an increase there for some time into the -- well into the 20s.\n\nAnd it seems to actually be coming down over the last several quarters. I would love to just get an update on how you're thinking about, you know, plans to continue reducing that and where, ultimately, you'd like that to kind of settle out in terms of percentage of revenue.\n\nSonalee Parekh -- Chief Financial Officer\n\nThanks. I'll start, and Mo may want to add a comment or two. But you're absolutely right. It is something that we have been focused on.\n\nAnd, you know, if you think about where we're guiding for full year '22, you should see about a 400 basis point improvement in stock-based comp as a percentage of revenue. And, you know, the reason that the spend was elevated is partly by virtue of, you know, when we gave out those grants, it was at a much higher stock price. It is something that we manage and evaluate, you know, as a management team. And what I would say is it will continue to be, you know, one of the levers we use to incentivize our employees.\n\nWe think it's really important for our employees to be aligned with all of you, all of the shareholders. And, you know, so it is something that we continue to use. But you should expect that number as a percentage of revenues over time to stabilize. You won't see as strong an improvement as you saw this year.\n\nYou know, we made a big step change. But over time, that should stabilize. And then, you know, secondly, just in terms of, you know, SBC, the flip side of that is we also use buybacks at times. And you saw this quarter in my prepared remarks that we did $25 million -- $20 million of share buyback this quarter.\n\nAnd, you know, that helps to offset the dilution as well. So, I don't know if you have anything to add, Mo.\n\nMo Katibeh -- President and Chief Operating Officer\n\nNo, I think you nailed it. I mean, coming into the year, we guided to about 200 basis points of improvement. We expect to be exiting the year, you know, closer to 400 basis points, which shows discipline that we've enacted and Sonalee talked about. And to the second half of your question, I do expect that to continue trending down over time.\n\nWe have taken some operational actions this year. While continuing to use SBC as a key retention and compensation tool, we have been able to take actions that, over the next several years, as new stock vests, I would expect that to continue trending down into the teens range. And then, to Sonalee's point, stabilize, you know, call it, BAU staff levels then. Thanks again for all the questions.\n\nI turn it back over to the operator.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWill Wong -- Vice President, Investor Relations\n\nVlad Shmunis -- Founder, Chairman, and Chief Executive Officer\n\nMo Katibeh -- President and Chief Operating Officer\n\nSonalee Parekh -- Chief Financial Officer\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nRyan MacWilliams -- Barclays -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nPeter Burkly -- Evercore ISI -- Analyst\n\nJames Fish -- Piper Sandler -- Analyst\n\nSiti Panigrahi -- Mizuho Securities -- Analyst\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nTim Horan -- Oppenheimer and Company -- Analyst\n\nBrian Peterson -- Raymond James -- Analyst\n\nMatt Stotler -- William Blair and Company -- Analyst\n\nMore RNG analysis\n\nAll earnings call transcripts"
}