{
  "companyName": "CorMedix Inc Common Stock",
  "companyTicker": "CRMD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/cormedix-inc-common-stock-crmd-q3-2022-earnings-ca/",
  "content": "CorMedix Inc Common Stock (CRMD 6.30%)\nQ3 2022 Earnings Call\nNov 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the CorMedix Inc. third quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Daniel Ferry from LifeSci Advisors.\n\nThank you, and over to you.\n\nDaniel Ferry -- Investor Relations\n\nGood morning and welcome to the CorMedix third quarter 2022 earnings conference call. Leading the call today is Joe Todisco, chief executive officer of CorMedix, and he is joined by Dr. Matt David, executive vice president and CFO; Dr. Phoebe Mounts, EVP, general counsel, and head of technical operations; and Erin Mistry, SVP of commercial.\n\nBefore we begin, I would like to remind everyone during the call, management may make what are known as forward-looking statements within the meaning set forth in the Private Securities Litigation Reform Act of 1995. These statements are subject to certain risks and uncertainties and include but are not limited to any of the following: any statements, other than statements of historical fact regarding management's expectations, beliefs, goals, and plans about the company's prospects, including its clinical development program, manufacturing activities, and NDA approval for DefenCath in the U.S. or other product candidates, future financial position, future revenues, and projected costs, and potential market acceptance of DefenCath or other product candidates. More specifically, forward-looking statements include any statements about our clinical development plans and the timing, costs, progress, results, estimates and interpretations thereof, projections as to the company's future capital raising, spending, and cash position, expectations as to the timing and nature of anticipated regulatory actions, possible product licensing, business development or other transactions, any commercial plans and expectations, market projections for our current product candidates, and expectations as to manufacturing and product component costs.\n\nActual results may differ materially from these projections or estimates due to a variety of important factors, including, but not limited to, uncertainties related to clinical development, regulatory approvals, and commercialization. These risks are described in greater detail in CorMedix's filings with the SEC, including the latest 10-Q filing, copies of which are available free of charge at the SEC's website at www.sec.gov or upon request from CorMedix. CorMedix may not actually achieve the goals or plans described in these forward-looking statements and investors should not place undue reliance on these statements. Please note that CorMedix does not intend to update these forward-looking statements, except as required by law.\n\nAt this time, it is now my pleasure to turn the call over to Joe Todisco, chief executive officer of CorMedix. Joe, please go ahead.\n\nJoe Todisco -- Chief Executive Officer\n\nThank you, Dan. Good morning, everyone, and thank you for joining us on this call. Over the last three months, the company has continued to make excellent progress on all fronts, working diligently in support of our CMO as they implement corrective actions to the deficiencies received during a June FDA inspection, as well as undertaking multiple steps to build out the team, processes, and systems to be ready for commercialization as quickly as possible following a potential FDA approval. While Phoebe will provide a more detailed regulatory update and specifics around potential resubmission timing, I am very pleased with the efforts undertaken by our CMO these last three months to address the concerns cited by FDA during the site inspection, as well as the work our team is doing to mitigate compliance risk by creating alternative supply chain options for resubmission.\n\nMy goal is to secure final FDA approval of the DefenCath NDA in 2023, and we are mobilizing all resources needed to increase our probability of success. From a commercial standpoint, in addition to building out systems and processes for commercial operations, we are actively engaged in multiple pre-launch activities, such as disease state education and awareness, key opinion leader engagement, and early stage strategic discussions with key customers, such as large health systems and IBM. This past week, the company exhibited and presented an abstract at the American Society of Nephrology Annual Meeting, which took place during Kidney Week. The abstract highlighted data generated by CorMedix during a retrospective analysis of data pulled from multiple clinical and claims databases that track kidney failure patients.\n\nOur analysis highlighted the significant incident of and morbidity and mortality associated with catheter-related bloodstream infections, or CRBSIs in catheterized hemodialysis patients. As the company broadens its presence at upcoming medical conferences and events, we intend to bring attention to the high incidence and severity of CRBSIs in the hemodialysis community, a critical unmet medical need for which DefenCath can be a solution. During our last earnings call, we were happy to announced that the Center for Medicare and Medicaid Services or CMS published in the federal register the condition net technology add-on payment, or NTAP, reimbursement for DefenCath. This past Monday, we were also happy to announce that CMS published in the Federal Register a revised NTAP increasing the upper limit of reimbursement from $4,387.50 per average hospital stay to $14,259.38.\n\nThe original NTAP calculation from CMS was based upon three vials of DefenCath utilized per catheter lock during three dialysis sessions. The revised NTAP is based upon a longer duration of hospital stay in which an average of 9.7 vials of DefenCath would be utilized. The NTAP for DefenCath is calculated by CMS as 75% of the expected wholesale acquisition cost, or WAC of the product, and is conditioned upon final FDA approval of the DefenCath NDA prior to July 1, 2023. While CorMedix is working to attain NDA approval as quickly as possible, to mitigate the risk of approval delay beyond the July 1 cutoff, the company also recently announced their submission of a duplicate NTAP application to CMS which would be applicable should the company attain NDA approval after July 1, 2023.\n\nAs the criteria to obtain an NTAP are objective in nature and the company successfully met the criteria during the last application, and the criteria have not changed, the company expects to remain eligible to receive NTAP for DefenCath should NDA approval occur after July 1, 2023. The inpatient segment, though smaller than the outpatient segment in terms of lumen lock volume, has substantial potential dollar value due to higher price elasticity in comparison to the outpatient segment. The inpatient segment is not only plagued by high incidence of CRBSIs in its catheterized hemodialysis population but there is an extremely readmission rate for recurring CRBSIs within 30 days. The combination of high incidence and high readmission rates for recurring infection results not only in adverse patient outcomes but adverse financial outcomes for hospitals and health systems.\n\nThe fallout from the high incidence and readmission rates, coupled with the NTAP reimbursement in healthcare facilities, provides a compelling justification for meaningful inpatient utilization and uptake. As the initial phase of our launch will focus heavily on the inpatient market segment, [inaudible] NTAP and CMS' subsequent revision of the upper limit is a significant value driver for DefenCath and essential to driving market uptake. While our NTAP is specific to inpatient reimbursement, we continue to take a two-pronged approach with respect to outpatient reimbursement. First, we remain committed to our efforts to secure our transitional drug add-on payment adjustment, or TDAPA as soon as practical after securing our anticipated FDA approval.\n\nTDAPA is an incremental payment to the renal dialysis service bundle allocated by CMS to outpatient dialysis clinics. While we do see TDAPA as a viable reimbursement pathway to drive utilization of DefenCath, we believe there are compelling arguments that DefenCath does not fall within the scope of products and services calculated as part of the dialysis bundle under the current statute and therefore should be reimbursed separately by CMS as an outpatient drug product with a unique J-code. We believe a unique J-code and separate reimbursement better incentivizes dialysis operators to utilize the product for the betterment of patient outcomes. To be clear, any decision to separately reimburse DefenCath or grant DefenCath TDAPA is ultimately at the sole discretion of CMS, but we will be working diligently over these next few months, along with other key stakeholders, such as dialysis operators, health systems, and patient advocacy groups, to make these arguments to CMS.\n\nFinal FDA approval of DefenCath is required before we are able to submit a formal application for TDAPA or a unique J-code, and the estimated timing to a decision from CMS is approximately six months from submission of the application in both instances. At this time, I'd like to turn the call over to Phoebe, who will provide an update on regulatory affairs and manufacturing. Phoebe?\n\nPhoebe Mounts -- Executive Vice President and General Counsel\n\nThanks, Joe, and good morning, everyone. As we discussed on our last earnings call, the company received a complete response letter, or CRL, in August which noted no product-related issues or deficiencies in the new drug application. However, the CRL stated that the NDA could not be approved in its present form until successful remediation of compliance deficiencies at both the CMO and the supplier of heparin API filed in the NDA. To mitigate risk, we are developing three alternative pathways for NDA resubmission.\n\nThe first pathway is based on resolution of compliance actions at both the CMO and the supplier of heparin API filed in the NDA. As we have previously discussed, the FDA conducted a preapproval inspection of the CMO's facility in June and subsequently issued a Form FDA 483 with four observations. The CMO developed a corrective and preventative action plan to address the four observations that included more than two dozen individual corrective actions on the part of the CMO. As of the date of this call, the CMO has informed CorMedix that it has implemented all but one of those corrective actions and is on track to close out the remaining item by the middle of December.\n\nWhile FDA has not yet communicated the classification of the 483 as voluntary action indicated, or VAI, or official action indicated, or OAI, it has engaged with the CMO in reviewing and verifying documentation on corrective action and completion. We are encouraged by FDA's active participation in the resolution process. Also discussed previously, the supplier of heparin API filed in the NDA received a warning letter in June for deficiencies associated with operations, buildings, and equipment that are unrelated to their manufacture of heparin. The warning letter received by the API supplier contains customary language that FDA may withhold final approval of new applications referencing the manufacturer until the warning letter is resolved.\n\nIt is important to note that FDA has authority to exercise discretion on when to withhold new approvals based on risk assessments. The API supplier has provided CorMedix with periodic updates and has represented to the company that all corrective actions are on track for completion by the end of January 2023. We remain hopeful for a timely resolution of compliance concerns at both the existing CMO and heparin API supplier as this remains our fastest pathway to securing NDA approval and commercialization. Should those compliance concerns be resolved, we believe it would be a Class 1 resubmission of the NDA with a 60-day review clock because no new information would be submitted in the NDA.\n\nAs Joe mentioned earlier, the company is working diligently on contingency plans for our supply chain in the event that compliance concerns linger at either of the CMO or the API supplier. The second pathway provides an alternative in the event that our CMO obtains compliance clearance but the warning letter at the API supplier remains an obstacle. We are in the process of validation of manufacturing at our existing CMO with heparin from an alternative API supplier. Should our CMO obtain compliance clearance before March, we expect to be ready to resubmit the application from the current CMO with manufacturing data for a new API source by the beginning of March.\n\nAs this filing incorporates new manufacturing data, it would be a Class 2 resubmission with a six-month review cycle. The third pathway to NDA resubmission addresses the event where neither our existing CMO or the current API supplier is able to obtain compliance clearance by March. We have entered into a partnership with Alchemy, a U.S.-based aero manufacturer to quality Alchemy as an alternate manufacturing site for DefenCath. Data from Alchemy, which would also utilize a new heparin API source, should be ready for submission by the end of March.\n\nAs this submission also involves new manufacturing data, it would be a Class 2 submission of the NDA with a six-month review clock. While we remain hopeful of a timely resolution of compliance concerns at both our existing CMO and API supplier, these three work streams provide the company with multiple alternatives to pursue a DefenCath NDA approval in 2023. I would now like to turn the call over to Matt, who will provide a financial update for the quarter. Matt?\n\nMatt David -- Executive Vice President and Chief Financial Officer\n\nThanks, Phoebe. I am pleased to be here today to provide an overview of our third quarter and year-to-date 2022 financial results, as well as an update on our cash position. The company has filed its report on Form 10-Q for the third quarter ended September 30, 2022. I urge you to read the information contained in the report for a more complete discussion of our financial results.\n\nWith respect to our third quarter of 2022 financial results, our net loss was approximately $6.9 million or $0.17 per share, compared with a net loss of $8.6 million or $0.22 per share in the third quarter of 2021. The lower net loss recognized in 2022 compared with 2021 included a decrease in R&D expenses, partially offset by an increase in SG&A expenses versus the third quarter of 2021. Operating expenses in the third quarter of 2022 decreased approximately 19% to $7 million, compared with $8.6 million in the third quarter of 2021. R&D expense decrease by approximately 51% to $2.3 million, driven by a decrease in costs related to the manufacturing of DefenCath prior to its potential marketing approval, and to a lesser extent by a decrease in consulting fees.\n\nSG&A expense increased approximately 21% to $4.6 million, compared with $3.8 million in the third quarter of 2021. This increase was primarily attributable to an increase in costs related to market research studies and pre-launch activities in preparation for the potential marketing approval of DefenCath. With respect to our year-to-date 2022 financial results, total operating expenses during the nine months year-to-date of 2022 amounted to $22.3 million, compared with $21.7 million in the first nine months of 2021, an increase of 3%. R&D expense declined 21% to $7.8 million, driven by a net decrease in costs related to the manufacturing of DefenCath prior to its potential marketing approval, as well as net decreases in personnel expenses, consulting expenses, and clinical trial expenses.\n\nSG&A expense increased approximately 22% compared with the first nine months of 2021, driven by increased costs related to market research studies and pre-launch activities in preparation for the potential marketing approval of DefenCath, an increase in legal fees mainly due to the securities litigation and higher personnel expenses. We recorded net cash used in operations during the first nine months of 2022 of $18.2 million, compared with net cash used in operations of $15.3 million in the nine months of 2021. The difference was primarily driven by an increase in net loss and a net decrease in accrued expenses and accounts payable for the period. CorMedix remains in a good position from a balance sheet perspective.\n\nThe company has cash and cash equivalents of $59 million as of September 30, 2022. This includes approximately $11.7 million raised during the nine months year-to-date 2022 through our ATM program and approximately $0.6 million from the sale of unused New Jersey NOLs. We believe our cash and cash equivalents gives the company flexibility to fund its operations at least through 2023 after taking into consideration costs related to manufacturing activities and costs related to the potential commercial launch of DefenCath. As Joe and Phoebe have discussed today, we remain optimistic about our progress toward an anticipated FDA approval for DefenCath in 2023.\n\nWe believe that our current cash and equivalents, as well as the various mechanisms available to us for future financing, allows CorMedix to be prepared to execute on its goals, including bringing DefenCath, to patients following an FDA approval. I will now turn the call back over to Joe for closing remarks. Joe?\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Matt. As I look toward our next few months, I believe the company is in a strong position to execute on its key objectives. We are making great progress on our commercial strategy as well as shoring up our supply chain to hopefully secure final NDA approval during 2023. DefenCath has the potential to address a critical unmet medical need and, if approved by the FDA, can significantly improve patient outcomes while also having an impact on the health equity disparity that is pervasive in our healthcare system.\n\nCatheter-related bloodstream infections, or CRBSIs, place a heavy financial burden on the U.S. healthcare system estimated at roughly $2.3 billion per year of incremental costs. Hemodialysis patients with a CRBSI have double the rate of hospitalization versus non-infected HD patients, with an average duration of stay that is four times longer and a three times higher fatality rate. In addition, African-Americans represent under 14% of the U.S.\n\npopulation but account for more than 35% of the patients undergoing hemodialysis. To that extent, African Americans are disproportionately at risk for a catheter-related bloodstream infection compared to other demographic groups. DefenCath in clinical trials reduced CRBSI occurrence by 71% in hemodialysis patients compared to the existing standard of care. I remain confident in our ability to bring this product in order to address the significant unmet medical need.\n\nThank you for your continued support of and interest in CorMedix.\n\nOperator\n\nThank you. Ladies and gentlemen, we will now be conducting our question-and-answer session. [Operator instructions]We have our first question from the line of Joon Lee with Truist Securities. Please go ahead.\n\nUnknown speaker\n\nGood morning. This is Oslon on for Joon. Thanks for taking the questions. Was wondering if you could just describe your commercialization strategy, specifically what type of settings you think about targeting first given the variable CRBSI rate across different healthcare systems.\n\nThank you.\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Oslon. As we kind of mentioned in the script, the initial focus of the launch is going to be on the inpatient hospital segment where we're going to be building a team that is focused on getting the product on formulary in those hospitals' IDNs, working through PDT committee, getting it into the prescribing guidelines and then pulling through for utilization at the individual hospitals. The inpatient part of our focus is due to the clarity that we have right now around reimbursement -- we've got really strong reimbursement, we're very excited about CMS' revision of the upper limit of NTAP reimbursement, and we're going to focus heavily on the inpatient segment in the early part of our launch. On the outpatient side, that's going to come a little bit later as we get more clarity around the outpatient reimbursement.\n\nThat will have an impact on how do we price and how do we build out our outpatient team.\n\nUnknown speaker\n\nThank you. And then when might we find out the FDA classification of the European CMO, the VAI, or OAI? Thank you.\n\nJoe Todisco -- Chief Executive Officer\n\nI'll ask Phoebe to comment on what she thinks. We would not be informed of that. The CMO would be the one that is informed directly. But, Phoebe, why don't you go ahead and give any thoughts that you might have?\n\nPhoebe Mounts -- Executive Vice President and General Counsel\n\nYes. It's a question everyone's asking, and unfortunately, there is no statutory timeline by which FDA needs to communicate that. I am personally of the mind that because the CMO has been very diligent in providing FDA with updates on the implementation of its corrective action plan and the FDA has been engaging in dialog with them on execution of the corrective action plan, that not having FDA through any red flags by coming up with a classification is good news, so I think the important message is that the corrective actions are underway, the FDA is engaged in the process, and hopefully, it will have a good outcome very quickly.\n\nUnknown speaker\n\nThank you. That's all from me.\n\nOperator\n\nThank you. Your next question is from the line of Jason Butler with JMP Securities. Please go ahead.\n\nJason Butler -- JMP Securities -- Analyst\n\nHi. Thanks for taking the questions, and appreciate all the color this morning. The company has done quite a lot of work building awareness of DefenCath with the outpatient providers. Can you talk about what your perspective on the level of awareness and education on inpatient prescribers is of the DefenCath data, and can you talk about work that you are or can do to ensure that, or minimize the risk that formulary approvals get extended?\n\nJoe Todisco -- Chief Executive Officer\n\nThank you, Jason. We're engaging in a large amount of, call it, pre-launch activities right now -- disease state education awareness, as I talked about our presence down at ASN. What we are doing is engaging with key stakeholders to educate more on the unmet medical need that CRBSIs present, and that opens the door for discussions that could be had around DefenCath as a potential solution. We're laying the groundwork now, we're starting to have conversations at the IDN level, at the hospital level, and those are going to continue as we build up toward launch.\n\nWhat was the second part of the question, Jason? I apologize.\n\nJason Butler -- JMP Securities -- Analyst\n\nJust any work that you can do to -- we've heard through the pandemic that formulary approval timelines have been extended. Is there work that you can do ahead of approval to, I guess, mitigate that?\n\nJoe Todisco -- Chief Executive Officer\n\nSure, and I'm going to let Erin comment momentarily as she's largely focused on these initiatives. But the conversations that I mentioned now, the meetings with stakeholders, meeting with IDNs, engaging with payors, putting ourselves in a position where the process through the PNT committee can -- hopefully the timing can be minimized to the extent possible. We're going to have to go IDN by IDN and health system by health system, right, and work through -- each process is different at each health system. Erin, you want to provide a little bit more color on some of the activity that your team has going on?\n\nErin Mistry -- Senior Vice President, Commercial\n\nSure. Thanks, Joe. Yes. I think it's very similar to what Joe said.\n\nThere is a layer of segmentation work that has been done and will continue to be refined over the next couple months. The key hospitals that have high CRBSI rates, that have high readmissions, that have a lot of initiatives around these types of patients, those are the key focus areas, and to get into those systems, you really need to understand the inner workings of that specific system. Just as Joe mentioned, each one is a little bit different and nuanced, and so we have the ability to really start to talk with these folks. We've talked to several of them already and will continue to do so heavily over the next couple months, in combination with the disease awareness campaign, which we've started that digital campaign in Q4 and will continue to identify more data.\n\nWe have a lot of inpatient data that we've come out with recently, and as we continue to get more and more data, there is a lot of wind at our backs for the initiatives that we're trying to push through. Another piece of this is the economic component, right, so we will continue to drive that economic discussion with PNT members, with value committee members, and key physician champions within the hospital systems.\n\nJason Butler -- JMP Securities -- Analyst\n\nGreat. That's helpful. Thanks for taking the questions.\n\nOperator\n\nThank you. Your next question is from the line of Serge Belanger with Needham & Co. Please go ahead.\n\nSerge Belanger -- Needham and Company -- Analyst\n\nHi. Good morning. Thanks for taking the questions. First one for Phoebe on the regulatory issues, just curious what's your expectation for the need for FDA reinspection across the three different pathways your outlined, and then secondly, I guess for Joe, you got news this week that CMS was revising the NTAP reimbursement significantly higher.\n\nJust curious what that means to the opportunity in the hospital inpatient segment, and then I guess it'd be great to know what do you think the average stay of the patients are in the hospitals and how this change in reimbursements would affect the usage of the product. Thanks.\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Serge. All right. Phoebe, do you want to go first on the reinspection question?\n\nPhoebe Mounts -- Executive Vice President and General Counsel\n\nAbsolutely, yes. Thanks, Serge, and thanks, Joe. Obviously, FDA has discretion on whether or not it will require an on-site inspection to assess the effectiveness of corrective actions. That's always a focus in developing corrective actions and submitting progress reports to the agency.\n\nIt's imperative that you convince the agency that not only have you developed good appropriate corrective actions but that you're executing on the plan, and that those corrective actions are being effective to resolve any deficiency the agency identifies. That has been part of the strategy all along as to provide documentation to the agency to make it very clear that there is progress being made, that the deficiencies are being remedied. We are very hopeful that FDA can evaluate implementation of the corrective actions without needing an on-site inspection, but again in these days of COVID concerns, the agency continues to remind folks that on-site doesn't necessarily mean a physical visit. They have the option to do remote interactions as well, so the other important part of that dialogue is what's the timing if the FDA does need to do an inspection, and that's obviously something that the CMO and our existing heparin API supplier are engaging in dialogue with FDA on.\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Phoebe. Serge, just to answer -- to address the question on the CMS revision of NTAP, we do actually think it was an incredibly important part of the value proposition for DefenCath in the inpatient market. The original NTAP, while we were happy with the NTAP being granted, the CMS had made the determination based on what we saw as the minimum usage for DefenCath in a chronic setting. The label is expected to be for chronic hemodialysis.\n\nThe minimum for chronic is seven days or more, so our minimum utilization in a hospital theoretically would be three vials over the course of one week of dialysis. That said, we believe the average stay is likely closer to 13 days, where patients are dialyzed -- some are dialyzed daily, some every other day, some every three days, and we took a weighted average based on the data that we've seen and we came up with a calculation of 9.75 vials, so what that means is if the hospital is utilizing DefenCath in the treatment of a patient in an inpatient setting, had the original NTAP calculation been in place, if a patient was in the hospital for three weeks, the maximum reimbursement to the facility would have been the approximately $4,400. Now if they're there for three weeks, they have the opportunity to be reimbursed $14,000, so it is a meaningful incentive to the institutions and to the healthcare facilities to utilize the product, so we do think it's very important.\n\nOperator\n\nThank you. Serge, do you have any further questions?\n\nSerge Belanger -- Needham and Company -- Analyst\n\nI'm good. Thank you.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the live question and answer session, and I'd like to turn the call back to Daniel Ferry for written questions. Dan, over to you.\n\nDaniel Ferry -- Investor Relations\n\nThank you, operator. Joe, we have a few written questions here for you. The first one, and I know Phoebe touched on this briefly, but if you could, please walk us through the various scenarios for resubmitting the NDA. And the follow-up question there would be what gives you confidence that CorMedix may see approval in 2023?\n\nJoe Todisco -- Chief Executive Officer\n\nOK. Thanks, Dan. I actually think I want to address the second question first in terms of our confidence for getting approval in 2023. As Phoebe mentioned in her script, the CRL that we received had not product-specific observations or deficiencies, so we're of the understanding that the only remaining step here is the compliance status at the CMO and the API facilities.\n\nTo that extent, we've created three pathways. We believe we are on target to resubmit by the end of March, and certainly, there can always be minor delays in calculating and generating stability data, but we believe we're on track and if it's a Type 1 submission, it could be a 60-day review. If it's a Type 2 submission, it should be a six-month review, so that's what's guiding our thoughts around timing and why we're hopeful to get an approval in 2023. I think also, Phoebe did a really good job of clearly walking through the three pathways that we are pursuing to get -- for resubmission in the first quarter, and the fastest path to market, as we said, remains a compliance clearance by FDA of both the CMO and the API facility.\n\nIf both of those events, those compliance clearances do come in the first quarter of next year, we could be in a position to resubmit with a Type 1 submission and a 60-day review clock. That's why that remains the fastest pathway to market. Now the other two pathways, as Phoebe laid out, one would be the existing CMO with a new API source, and that would be for an instance where the CMO gains clearance but our API site remains under warning letter. This gives us the ability to resubmit from the existing CMO, would still be a Type 2 resubmission, however, it's new manufacturing data but would only be new API data as opposed to a new site and API data, so we wanted to create that flexibility and give us that option for resubmission.\n\nThen the third pathway, as we've talked about through our agreement with Alchemy, we've given ourselves the ability if neither the CMO nor the API supplier are able to gain compliance clearance in the first quarter, we believe we'll have the ability to resubmit from Alchemy a Type 2 submission.\n\nDaniel Ferry -- Investor Relations\n\nExcellent. Thanks, Joe. The next question would be along the lines of Alchemy. How are you thinking about Alchemy, as well as the alternate supplier of heparin, as playing a role going forward in the regulatory process?\n\nJoe Todisco -- Chief Executive Officer\n\nOK. Yes. I do want to actually make sure that we're clear that Alchemy is going to be a part of our ongoing supply chain regardless of whether or not we utilize them as the primary filing in terms of gaining or hopefully gaining FDA approval, as we talked about in our third scenario, or if we ultimately utilize them as an alternate manufacturer to mitigate supply chain risk from having our product come only from one site, so we're really looking at them, as well as a long-term partner, as we would with our alternate supplier of heparin API. We want to make sure that we always, for key components and key materials, maintain two sources of supply.\n\nDaniel Ferry -- Investor Relations\n\nOK. Excellent. More along the lines of the balance sheet, given the anticipated approval in 2023, how is the company thinking about financing?\n\nJoe Todisco -- Chief Executive Officer\n\nOK. I'm going to let Matt jump in and comment on cash.\n\nMatt David -- Executive Vice President and Chief Financial Officer\n\nSure. No problem. Thanks, Joe. Thanks, Dan.\n\nAs you can see from our latest filing, CorMedix has been judicious regarding the use of our ATM program, so we believe we're in a good position with cash and equivalents and this can take us through the initial stages of the commercial launch. That said, we are always keeping an eye on alternative sources of capital just to make sure that the company has sufficient funds to execute on our plans forward.\n\nDaniel Ferry -- Investor Relations\n\nOK, great. The last question for Joe, and we get this question a lot from investors. Joe, what do you think investors are missing about the CorMedix story?\n\nJoe Todisco -- Chief Executive Officer\n\nThat is a good question. I do get that a lot as well. Obviously, over the last 30 to 45 days, we've had a lot of conversations with investors, and I think what is most underappreciated and not fully understood is the value proposition around our inpatient launch strategy. I realize this is something we've started talking about only probably a quarter or two ago and really started to shine a spotlight on it with data, but it's a compelling value proposition.\n\nI think the reimbursement through the NTAP is significantly higher than what anyone had anticipated, and even though the volume of that market is lower than the outpatient side, the value of that reimbursement creates a multibillion-dollar market opportunity, so our ability to gain market share and drive value, I think it's a significant value driver for the company and I think that that's something that, again, is not fully appreciated or understood. I think even some of our coverage has yet to include it in their updated models. And hopefully, that will be forthcoming. But this is the core focus of the initial phase of our launch, and I think it's a real value driver for the company that needs to be better appreciated by investors.\n\nDaniel Ferry -- Investor Relations\n\nThank you, Joe. Operator, this concludes the written question portion of this call. You may now close the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDaniel Ferry -- Investor Relations\n\nJoe Todisco -- Chief Executive Officer\n\nPhoebe Mounts -- Executive Vice President and General Counsel\n\nMatt David -- Executive Vice President and Chief Financial Officer\n\nUnknown speaker\n\nJason Butler -- JMP Securities -- Analyst\n\nErin Mistry -- Senior Vice President, Commercial\n\nSerge Belanger -- Needham and Company -- Analyst\n\nMore CRMD analysis\n\nAll earnings call transcripts"
}