{
  "companyName": "Criteo",
  "companyTicker": "CRTO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/criteo-crto-q3-2022-earnings-call-transcript/",
  "content": "Criteo (CRTO 0.31%)\nQ3 2022 Earnings Call\nOct 28, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to Criteo's third quarter 2022 earnings call. [Operator instructions] I would now like to turn the conference over to Melanie Dambre, director of investor relations. Please go ahead, ma'am.\n\nMelanie Dambre -- Director, Investor Relations\n\nGood morning, everyone. [Audio gap] based on a number of factors affecting Criteo's business. Except as required by law, we do not undertake any obligation to update any forward-looking statements discussed today. For more information, please refer to the risk factors discussed in our earnings release, as well as our most recent Form 10-K and 10-Q filed with the SEC.\n\nWe'll also discuss non-GAAP measures of our performance definitions and reconciliations to the most directly. Comparable GAAP metrics are included in our earnings release published today. Finally, unless otherwise stated, all growth comparisons made during this quarter are against the same period in the prior year. With that, let me now hand it over to Megan.\n\nMegan Clarken -- Chief Executive Officer\n\nThanks, Melanie. And good morning, everyone. Thank you, all, for joining us today. We're intentionally keeping today's prepared remarks relatively brief as we look forward to sharing more with you at our upcoming investor day on Monday.\n\nWe also look forward to meeting with many of you in person over the coming weeks. Today will be the opportunity for us to discuss the substantial progress we've made on our transformation journey to reposition Criteo as a pure play -- from a pure play retargeting business, to a platform play focused on commerce media, platform that is self-service and not reliant on third party signals. We show you how our commerce media platform is coming to light, how we plan to unlock its growth potential with our integrated go-to-market strategy, and why we believe we'll win in retail media and, more broadly, in commerce media. We'll also discuss our midterm financial outlook and our plans to drive profitable growth and long-term shareholder value.\n\nTurning to our third quarter highlights. We reached several important milestones this quarter, including the closing of our IPONWEB acquisition and the soft launch of Commerce Max, our self-service and first-of-its-kind demand-side platform, or DSP. Starting with IPONWEB. It's only been three months since we closed the strategic acquisition, and we're pleased with the progress of our integration and IPONWEB's business performance.\n\nOur teams are coming together, and we're very energized by the unique opportunities to shape the future of commerce media together. IPONWEB enhances our scale and brings our complementary capabilities on both the demand and the supply side to accelerate the execution of our commerce media platform strategy. The recent launch of Commerce Max demonstrates the progress of our integration. Commerce Max combines the power of retail media tech and IPONWEB's DSP capabilities.\n\nCommerce Max empowers brands and agencies to find valuable commerce audiences on retailer websites and activate on-site sponsored and display ads. It extends to commerce audiences that exist off-site, across the open internet, leveraging multiple channels, including video and CTV. Our Commerce Max DSP also provides closed-loop measurement capabilities that help marketers understand what performs, why, and how in near real time. Our value proposition is unique.\n\nAnd our clients, including some of the largest brands, agencies, and retailers worldwide, have been enthusiastic about what we're bringing to market. We expect Commerce Max to be instrumental in the growth of off-site for retail media in future years. Moving to our third quarter performance, we delivered constant currency contribution ex-TAC growth of 14%, in line with our expectations. In retail media, a highly differentiated technology and superior offering continue to drive our momentum with existing and new clients.\n\nWe have a solid pipeline. In head-to-head testing, retailers are shifting from competitors to Criteo. We recently announced a three-year exclusive partnership with MediaMarktSaturn, Europe's leading consumer electronic retailer across 13 countries. We won after delivering the best performance in a competitive RFP.\n\nIn the Americas, we signed new deals with large retailers, including Giant Eagle and Metro Canada. And we're seeing traction and upselling retail media off-site and display with existing clients. We also expanded our retail media footprint in APAC, with the addition of [Inaudible] Japan, and Chemist Warehouse Australia. In addition, we onboarded close to 100 brands this quarter.\n\nIn a tough macro environment, brands want to get as close to the point of sale as they possibly can, and there's nothing closer than advertising on the retailer's site. In marketing solutions, we experienced mixed trends with more moderate or more targeted spending from several clients across regions. In this environment, we benefit from a diversified client base. As we approach the holiday season, our clients are facing challenges related to high inflation and macroeconomic uncertainties.\n\nWhile we experienced an early start to the holiday season last year, we've seen several marketers and brands slow down their spend. Despite this, they continue to prioritize performance and rely on our solutions to drive sales and return on ad spend. A perfect example of this is what we have recently -- is that we've recently joined the Shopify Plus Certified App Program, which simplifies and automates Shopify merchants' ability to leverage our acquisition and retention solutions. While it's still early days, we saw a 30% increase in the number of new Shopify merchants using Criteo this quarter compared to the number of merchants we added in the second quarter.\n\nThese merchants come to us for performance as they typically benefit from three times more traffic and five times more sales when using our solutions. Lastly, we're excited to explore new ways to extend our commerce value proposition to social platforms. We're now actually testing new use cases for brands, marketers, and retailers. We'd like to access this ad inventory on Facebook and Instagram globally.\n\nWe look forward to sharing more in the coming months. As we enter the fourth quarter and prepare for 2023, we remain laser-focused on execution to capitalize on the significant opportunities ahead of us. And we remain committed to cost discipline. We believe that we have laid the groundwork for long-term sustainable growth.\n\nAnd we are pleased to see that our vision resonates with the industry at large. I also want to express my sincere gratitude to all Criteos globally, including those who joined us from IPONWEB, for their tremendous commitment and hard work to deliver exceptional service to our clients and realize our vision. With that, I'll now turn the call over to Sarah, who will provide more details on our financial results and our outlook. Sarah?\n\nSarah Glickman -- Chief Financial Officer\n\nThank you, Megan. And good morning, everyone. Starting with our financial highlights for Q3 2022, revenue was $447 million and contribution ex-TAC was $213 million. Reported contribution ex-TAC reflects significant financial exchange headwinds.\n\nThe weakening of currencies against the U.S. dollar resulted in a year-over-year $28 million unfavorable forex impact. At constant currency, Q3 contribution ex-TAC grew 14% on top of a tough comp with 14% growth in Q3 2021. This includes organic growth of 5% and growth from IPONWEB at 9%.\n\nOur organic growth is driven by retail media, up 32%. And commerce audiences, which we previously referred to as audience targeting, up 29%, as part of marketing solutions, up 1%. The growth of retail media and commerce audiences, combined with the addition of IPONWEB, accelerated the shift of our top-line mix with non retargeting solutions representing 41% of contribution ex-TAC in our third quarter, up from 33% in Q2 and up from 28% a year ago. Client retention remains high at close to 90%.\n\nTurning to our business segment in retail media, revenue was $41 million. And contribution ex-TAC grew from 32% at constant currency to $37 million. As a reminder, we had 65% growth in Q3 last year, including our Mabaya acquisition for online marketplaces. Our growth this quarter was primarily driven by our U.S.\n\nclient base and CPG, our largest and fastest growing vertical. This was partially offset by lower online traffic on certain retailer sites and softness in France. Growth from existing clients remained strong with same retailer contribution ex-TAC retention at 133%. We are excited about our new retailer wins, which we expect to fuel our growth in 2023 and beyond.\n\nThe marketing solutions revenue was $387 million and contribution ex-TAC was up 1% at constant currency to $158 million, with growth in commerce audiences, partially offset by lower retargeting. Retargeting was down 5% year over year, or up 4% when excluding the impact of the suspension of our Russia operations earlier this year, and the impact from the loss of signal. This quarter, we saw a $14 million signal loss impact, including iOS, as expected, and a faster-than-expected roll-out of explicit consent in Europe. Our underlying growth [Inaudible] was primarily driven by continued momentum in travel, including client win-backs, honest performance in Asia-Pac, and most markets in EMEA, partially offset by softer trends in France and for certain large clients in the U.S.\n\nOverall, our full funnel value proposition allows us to capture incremental budgets with an increasing number of clients, transitioning to always-on audience strategies to acquire and retain customers. Thirty-three percent of our live clients use more than one Criteo product today, compared to 29% a year ago. We expect to continue to benefit from more upselling and cross-selling activities with our integrated go-to-market strategy. Lastly, IPONWEB delivered mid-teens growth for two months of contribution this quarter, in line with our Q3 guidance.\n\nWe delivered an adjusted EBITDA of $50 million in Q3 2022. As expected, non-GAAP operating expenses increased 15%, including investments in sales, R&D, and product coverage. Moving down the P&L depreciation and amortization decreased 14% in Q3 2022, and share-based compensation expense increased 59%. Our income from operations was $4 million and our net income was $7 million in Q3 2022.\n\nAs you recall, last quarter, we accrued 60 million euros as a provision for loss contingency related to the canal regulatory matter. We are now in the process of submitting our response. This is an accrual and will be reviewed each quarter as we move through the administrative process. We anticipate resolution of this matter in 2023.\n\nOur weighted average diluted share count was 63.2 million. This resulted in diluted earnings per share of $0.10 and adjusted diluted EPS of $0.53 in Q3 2022. In a difficult macro environment, we benefit from a strong financial position with solid cash generation and no long-term debt, including about $744 million in total liquidity as of the end of September, and financial flexibility to execute on our growth and capital allocation strategy, following the acquisition of IPONWEB. We entered into a new and expanded five-year revolving credit facility of 470 million euros in September, which replaces a former 294 million euros facility.\n\nThis underscores the confidence of our global banking partners in our balance sheet and our business outlook. The primary goal of our capital allocation is to invest in high ROI, organic investments and value-enhancing acquisitions and to return capital to shareholders via our share buyback program. Since the beginning of 2022, we have repurchased 2.2 million shares at an average cost of $26.70 per share. We have accelerated our share repurchases since the completion of our IPONWEB acquisition and have $121 million left on our share buyback authorization.\n\nTurning to our financial outlook, which reflects our expectations as of today, October 28th, we remain prudent, given the persistent uncertainties in the macro environment. For 2022, we now expect contribution ex-TAC to range between 10% to 11% at constant currency. This comprises organic growth of approximately 5% and inorganic growth with IPONWEB contributing approximately 5% to 6%. Organically, we now expect contribution ex-TAC growth of approximately 35% for retail media, given softer online traffic, lower brand spend, and a slower integration of some of our newly signed retailers, and contribution ex-TAC growth of approximately 20% to 25% for commerce audiences.\n\nWe now expect our 2022 adjusted EBITDA margin to be approximately 28% to 29%, reflecting the lower contribution ex-TAC in Q4, which is our largest quarter, and the lower EBITDA profile of IPONWEB. As we communicated at the start of 2022, with our focus on sustainable growth and our continued transformation to our commerce media platform, we have invested in high-ROI projects, including new skillsets. Clearly, we also have initiatives to enable productivity and efficiency. Given the tougher macro and the IPONWEB integration, this is a heavy-focus area.\n\nGiven the further weakening of the euro and yen against the U.S. dollar, we now estimate the impact of forex to lower contribution ex-TAC by $90 million by 2022, or approximately 10 percentage points, compared to our previous forecast of $60 Million. This includes $10 million in Q1, $21 million in Q2, $28 million in Q3, and an estimated $31 million impact in Q4. As a reminder, close to 30% of our contribution ex-TAC is exposed to the euro.\n\nAnd approximately 10% of our contribution ex-TAC is exposed to the Japanese yen. There was no change to our capital expenditures, and we continue to expect free cash flow conversion of about 45% adjusted EBITDA. For Q4 2022, we are cautious given the impact, the slower macro environment on consumers, our clients and the expectation of lower budget, especially in retail. We expect Q4 contribution ex-TAC of $275 million to $280 million, growing by 11% to 13% at constant currency.\n\nThis assumes flat organic growth and IPONWEB inorganic growth. Importantly, we expect retail media to continue to show strong growth despite the challenging macro environment. We assume a loss -- a signal loss impact of approximately $9 million. We expect adjusted EBITDA of $90 million to $95 million reflecting the lower top line.\n\nLooking ahead to 2023, While there is macro-economic uncertainty, we expect to continue to deliver growth, healthy profitability, and solid cash generation. We expect our broad and diversified client base and our performance-driven offering to contribute to the relative resilience of our business. We are disciplined in managing our headcount and our expenses, and we have a clear plan for the integration of IPONWEB. We expect our adjusted EBITDA margin to remain in line with 2022 levels, given the full year impact of the IPONWEB business.\n\nOver time, we have a plan to drive operating leverage from scaling and transitioning, to more self-service solutions, as well as synergies. As I've said before, and as with any transformation, our path won't be linear. But we remain focused on the execution of our strategy to create the world's leading commerce media platform to drive long-term sustainable growth and shareholder value. We look forward to sharing more at our investor day on Monday.\n\nAnd with that, I'll turn over to the operator to begin the Q&A session.\n\nOperator\n\n[Operator instructions] Our first question comes from Matt Thornton with Truist Securities. Please go ahead.\n\nMatt Thornton -- Truist Securities -- Analyst\n\nSarah and everyone, maybe, two, if I could, First, maybe you could just help us understand what you're seeing out there just from a linearity standpoint as we exit 3Q and kind of through October. I'm just kind of curious what informs your 4Q outlook. Any color there would be helpful. And then, just secondly, around retail media, out of all the different revenue buckets, a little bit more of a decel there.\n\nI'm just curious if that's just pure year-over-year comp, or if there's anything you're seeing changing there from a competitive and/or other standpoint. Any color on those two would be great. Thank you.\n\nSarah Glickman -- Chief Financial Officer\n\nYes. So, thank you for the question. In terms of Q4, I mean, what we're seeing, and we saw this in Q3, and I would say we're seeing this from all retailers, is there's more targeted and more moderate spend. And, you know, what we do see is, of course, there's an orientation toward performance marketing.\n\nBut with the pullback in consumer spending, you know, there's less brand dollars. And I would say that's just more cautious focus on budgets. So we expected a pullback, and we saw a pullback from Q3 spend and a more focused spend in Q4 for holiday season. Last year, we saw early spend for holiday spending, and that we haven't seen this year.\n\nAnd consistent with external measurement, they expect the holiday season to be muted versus last year. We're seeing the same trends. So, that's the reason for our caution. It's less spend, you know, from our customers overall.\n\nAnd that's largely due to less spend by consumers and less online traffic.\n\nMegan Clarken -- Chief Executive Officer\n\nYeah. I'll add a little bit of color to it. Just to sort of reiterate what Sarah said, one of the sort of signals that we saw was from Prime Day. And usually, what we see and what we saw last year was when different shopping days come up.\n\nThere's a halo effect. And so, retailers, more broadly, in Amazon use that opportunity to do their own discounting on that day. And they see sale based on -- good sale based on that, you know, based on the fact that Amazon has a Prime Day. We didn't see that this year, which was really interesting.\n\nIt was -- it was telling in terms of consumer spend. It's not that retailers didn't try. But what we're looking forward to is seeing Cyber Monday and Black Friday coming up, to see whether or not there's a shift there, to see whether or not there's a list there compared to the halo effect that we didn't see from Amazon Prime Day. So, we're just being cautious because we have a lot of data at our fingertips.\n\nWe see trends, we see signs. We want to make sure that we take those into account when we look at, you know, our performance -- potential performance going forward. On the retail media front, look, there's really solid growth there. It's a very, very solid story.\n\nAnd commerce media is the big place to be right now if you're a retailer, if you're an advertiser and you want to swing toward somewhere where you're going to see those results. And so, again, while we remain cautious because we see a slower ramp-up in terms of the time it takes retailers to come on board, just the caution that they're applying to their strategies, there is no doubt in our mind that commerce media is the winner, as you compare it to the other advertising platforms in terms of search and social. So, we're extremely optimistic still on our strategy around commerce media. We're just making sure that we're prudent and cautious, given what we see in the marketplace around consumer spend and retailers' reaction to that.\n\nSarah Glickman -- Chief Financial Officer\n\nYeah. Just that one piece of color on the consumer spend, more of it on more essential goods, so less on apparel, toys, and hobbies. And those are obviously the huge areas for us, but also for people spend overall. And then retailers' effect year on year has decreased as a sector.\n\nWe've seen that -- well, you know, we clearly see that with other earnings coming out. And so, we've applied that within our assumptions in terms of the spend that we expect to see for Q4.\n\nOperator\n\nThe next question comes from Sarah Simon with Berenberg. Please go ahead.\n\nSarah Simon -- Berenberg Capital Markets -- Analyst\n\nGood morning. I've got two questions. First one is on Q4 outlook again. I mean, you talked about being cautious and so on.\n\nSo, are you assuming in your guidance that things deteriorate from the current level of trading that you see now? That was the first question. And the second one is the expanded debt facility. Should we read anything into that? I mean, clearly it's a tough environment, probably more companies are going to fall over. Are you feeling like you might want to step up the pace in terms of M&A? Or is it just they offered you more money so you've taken it and we shouldn't read anything more into it than that? Thanks.\n\nSarah Glickman -- Chief Financial Officer\n\nI'll take the second question first. We started to renegotiate our credit facility earlier this year, actually, I would say before the financial markets became more shaky. We had a high level of interest from global partners, including new partners in the Americas, that wanted to be part of the facility. And so, we increased the facility largely as a way to ensure that we had the right level of flexibility going forward.\n\nWe are incredibly robust on our balance sheet. Our cash flow generation needs for day-to-day operations. We do have an M&A pipeline, but we continue to focus on. And most of those would be tuck-ins as we've always said for key capabilities that will help us to accelerate.\n\nBut no issues at all in terms of our balance sheet, our cash generation, and our operational leverage from our own operations. For Q4, yes, we have seen that the level of spend is more cautious. So, we have, in Q4, moved the numbers down, I would say, week over week. That does not mean that we don't have fantastic high-five moments within that.\n\nBut when we look overall, we're seeing softness in key categories. So retail, apparel, huge areas for us that we don't see as much spend. And we're seeing country by country, America's large retail, Asia-Pac, France being, I would say, lower light, with some big highlights in terms of return back to growth for some of our other markets, including the U.K. U.K.\n\nis more resilient than we've seen over the last few months, so we'll see what happens there. So, that's our caution. I would say it's in line with everyone else's caution, so I don't see anything that different when I read the transcripts of others in terms of what we're seeing ourselves. The benefit we have is we're closest to the point of sale in terms of performance advertising.\n\nAnd so, we do see and expect to see that there will be continued performance advertising for Q4 going into a holiday season that may be shorter and less exciting than the last two years, given that we're out of COVID, and people are less on their desktops and phones than they were a year or two years ago.\n\nSarah Simon -- Berenberg Capital Markets -- Analyst\n\nYeah. OK. But would you say that in your guidance, you are assuming that things get worse from here, or you're basing it on kind of what you've seen in October and assuming that that trend is consistent?\n\nSarah Glickman -- Chief Financial Officer\n\nYeah, I would say we're not seeing the early pickup of holiday spend that we saw in the last two years. So, last year, we went from a cyber 20 -- you know, we went from cyber 6 in the traditional pre-COVID model to cyber 20 in '21 -- sorry, '20, to cyber 30 last year, and we're not seeing that right now. Of course, we're not in the peak holiday season, but we haven't seen the early spend that we benefited from last year. And we are seeing year on year, budgets are down.\n\nWhereas last year, they were massively up. So, that's the trend that we're seeing. Yeah.\n\nSarah Simon -- Berenberg Capital Markets -- Analyst\n\nOK. All right. That's helpful.\n\nSarah Glickman -- Chief Financial Officer\n\nI wouldn't say, of course, I think it's reality.\n\nSarah Simon -- Berenberg Capital Markets -- Analyst\n\nYeah. OK. That's helpful. Thanks.\n\nOperator\n\nThe next question comes from Richard Kramer with Arete Research. Please go ahead.\n\nRichard Kramer -- Arete Research -- Analyst\n\nThanks very much. Megan, since you mentioned Prime Day, can you talk a little bit about Amazon, both as a competitor to curtail but also as sort of the poster child or example of how some of your large retail clients might be looking to build material advertising businesses of their own, and how you might be helping them with that. And I guess one other question, you know, given your comments, Sarah and Megan, about the timing of spend resuming being so uncertain and cautiousness, can you talk about what you're doing to bring new logos on board this year, sort of to position yourself now for the growth that you might like to see in 2023? Thanks.\n\nMegan Clarken -- Chief Executive Officer\n\nYeah. Great. Thanks. Thanks, Richard.\n\nGood to hear you. It was very encouraging, I think, from our standpoint to hear Amazon advertising still performing, you know, really solid results that they posted yesterday. They are the poster child for retail media. They attract a lot of brands.\n\nThey're part of sort of a brand strategy spend on their sites. And they do it very, very well. And they've been doing it for a long time, reasonably. So, we've always said, I think, that we see ourselves as the Amazon advertiser in the open internet.\n\nAnd that's the way we think about, you know, our business. And the reason why this is important is that brands cannot just confine themselves -- confine might be a strong word, but to Amazon, because Amazon is a competing retailer, and they need to be able to advertise, sell their own advertising on their own site, and also extend across the internet, so they need a platform that enables them to do that. Which means that it's not necessarily that we're going to disrupt their advertising on Amazon, but to be more complementary so that they can light up their own advertising business and expand that to their brands out and across the open internet. They wouldn't necessarily rely on Amazon to do that.\n\nAmazon's reach is not the same as Criteo's reach, particularly when it comes to how many consumers we can reach across the open internet and how well we know those consumers and know whether those consumers are on there by a journey. They're shoppers, and, therefore, they're a very valuable consumer to reach. So, we have, I would guess, a complementary but extremely strong offering as compared to Amazon advertising. But to your point, they're a poster child, and we're there as the complementary alternative that comes from supplementary supplier to Amazon.\n\nOur retailers are leaning into this space incredibly heavily right now because it is a new opportunity for them. They see the results that Amazon have enjoyed. They see the growth of Walmart and Walmart Connect, and they see the serviceable addressable market that is available to them if they just line up their own capability. And that's where they turn to Criteo to help them to do that.\n\nWe're seeing just solid quarter-after-quarter performance here of our retail media business. The logos that we've brought on board in terms of not just retailers but brands and the strength of that relationship with agencies is just continuing to prove to us that we're exactly where we need to be. And we'll continue down this route. More to come on Monday.\n\nRichard, I'm looking forward to seeing you there.\n\nRichard Kramer -- Arete Research -- Analyst\n\nOK.\n\nMegan Clarken -- Chief Executive Officer\n\nOn the second piece, I'll get Sarah to speak to it.\n\nSarah Glickman -- Chief Financial Officer\n\nYeah, I mean, just in terms of -- we've had some win-backs. We can't announce the names. But I would say massive retailers in the U.S. have come back to Criteo due to our performance.\n\nSo, we've seen not only new logo wins. MediaMarktSaturn was one of those. As we start with the new logo, we have some other new logos. We have just one that we will be announcing soon in Europe, as well as in the U.S.\n\nAnd we have win-backs. Brands, also, we've increased the number of brands. And more to come on Monday, when we share some of those brand metrics. But in terms of same retailer contribution ex-TAC, I mean, I'll return to the 133% in Q3.\n\nThat's an average of 137% over the last four quarters. And what we see for 2023 is not only the contribution from existing retailers, which is, for the most part, where we benefited from this year in terms of our growth, but also new contributions from both sides, retailers coming on board. Most retailers have a Q4 code freeze. So, typically we tend to see more of that uplift going into the new year.\n\nAnd that's what we expect to early 2022 as well.\n\nRichard Kramer -- Arete Research -- Analyst\n\nThanks.\n\nOperator\n\nThe next question comes from Mark Kelley with Stifel. Please go ahead.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. Good morning, everyone. Can you just talk about media for just one second? Can you just remind us when that kicks in? Is that the '23 timeline that you outlined? And I guess when can we expect someone of that size to be material? And then, you talked about synergies and your ability to gain some operating leverage, you know, perhaps beyond 2023.\n\nCan you give us a sense where those synergies might be at? I think IPONWEB, I think the employee base was relatively small already. So, any thoughts there would be great. Thank you.\n\nSarah Glickman -- Chief Financial Officer\n\nYeah, we -- in terms of timing, that's the partnership between us and MediaMarkt. So, we do expect those revenues to start coming in, in 2023. However, we don't -- we haven't given guidance for 2023, so I don't want to be too precise on when we expect to see that revenue coming in. In terms of the synergies, we have a clear plan with the integration of IPONWEB.\n\nWe're already working through with ourselves and the IPONWEB team. We do see two things. One is the revenue synergies that we expected from integration of their platforms with ours, and a lot more to come on that on Monday in terms of our new offerings, which is the commerce media platform, and our joint capabilities driving that. In terms of our own cost base, we have, as you know, for a long time enjoyed a high margin, retargeting managed service business.\n\nAnd as we transition more to self-service, clearly, there are efficiencies in place that come with that. Also, we have already invested in those solutions that is going to set in 2022. And so, we anticipate enjoying the benefit of that on our top-line growth. And also, as they look at their organizations to ensure that they're fit for purpose, focused on growth, and focused on high ROI clients, we have segmented our clients to enterprise clients and growth clients.\n\nAnd we have made some changes in our organization to ensure that we're fully aligned to our customers, to their needs at a CMO level so that we ensure we drive the commerce media platform story at the right levels to ensure that we're selling a platform as opposed to, in the past, individual product plays. Overall, we anticipate that the 2023 will continue to invest not only in the high ROI growth investments, particularly in Asia and in retail media, but also that we'll start to see where the infrastructure that we need to drive that change will be invested in. So, data centers is an area of focus for us. We have taken out a lot spend over the last couple of days, about $20 million on our data center, the radio that we're doing.\n\nNext year, some of which will be capex. Some will be opex. And there's infrastructure around how we ensure that we can bill and collect and account for all our new platform, along with IPONWEB. So, some integration of new capability to upgrade our internal infrastructure on systems.\n\nWe're looking to be world class, so it's exciting times to be.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nThat's great. Thanks, Sarah.\n\nOperator\n\nOur next question comes from Doug Anmuth with JPMorgan. Please go ahead.\n\nUnknown speaker\n\nHi. This is Katie on for Doug. Thanks for taking the questions. So, first, I just wanted to dig into privacy.\n\nIt looks like it's going to be, you know, a $5 million or $10 million headwind worse than anticipated this year. Can you just walk through what's driving this higher and how you're thinking about, you know, some of those incremental headwinds into 2023? I think you previously mentioned not expecting a big year-over-year impact. So, just curious if that's still the case. And then, secondly, just looking at Google's privacy standoff.\n\nSome recent reports have suggested that the FLEDGE product has received some mixed reviews. So, just curious if there's anything you can share in terms of your feedback from testing the FLEDGE product. Thanks.\n\nMegan Clarken -- Chief Executive Officer\n\nHello. On the second question on the FLEDGE, that's a topic we'll address on Monday. So, I'll leave that question for Monday, when we'll have Todd presenting. In terms of the privacy impact, we have seen a higher increase related to explicit consent, so that was very small for us at the beginning of Q1, Q2.\n\nAnd we were -- that was about $4 million of the incremental headwind in Q3, and we're anticipating that to be about 3 million in Q4. In terms of the 2023 privacy incremental impact, we are not seeing any large incremental impact. So, we don't anticipate anything that's incremental to 2022 expectations. Overall, we went from $55 million to about $60 million.\n\nAnd most of that will be in Q3.\n\nUnknown speaker\n\nOK. Thanks.\n\nOperator\n\nThe next question comes from Tim Nollen with Macquarie. Please go ahead.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nThanks. I've got a question which I'm guessing you'll probably also be addressing on Monday. So, just answer as you see fit, please. But it's about your off-site retail business, which you mentioned at the top of the call and you've spoken about before.\n\nAnd I'm just curious if you could enlighten us a bit more as to what you're doing in off-site, how you differ from others, and I guess where you see the competition last year.\n\nMegan Clarken -- Chief Executive Officer\n\nYeah. Thanks for the question, Tim. It will be addressed on Monday. But let me give you a couple of -- some, you know, top-line notes on it.\n\nOff-site for us is -- well, for our clients, is their ability to partner with their brands or offer their brands, advertising off the retailers' sites. Because the retailers realize that if they just stick to the traffic that comes to their sites, they'll never get enough reach for those brands. And so, they extend that advertising out across the open internet. And so, Commerce Max for us has been our ability to line up the DSP that the retailers can use to manage this for their brands.\n\nOur ability to reach -- and we reached today about 725 million daily active users of which we have unique insights into where their commerce audience is, meaning are they audiences that are on there by a journey? Are there audiences that are shopping as opposed to audiences that might just be communicating with each other on social platforms or researching something that has nothing to do with a purchase intent? So, we're really very focused on commerce audiences. And we have capabilities through the datasets that we have access to, to be able to really narrow in on these very valuable audiences. They come to life for the retailer and the brand through the DSP, through Commerce Max. So, it's a very unique proposition that we offer.\n\nThere is nobody really doing, you know, solid off-sites capability right now for retailers. So, this is very new for retailers. And there is certainly a big differentiator for us in our ability to do closed-loop reporting. In other words, being able to report for them the effectiveness of their on-site, sponsored ads, with the display ads, with their search, plus their off-site -- their expansion to offsite ads for the retailer in near real-time measurement capability.\n\nAnd that, you don't see anywhere. So I don't want to be a spoiler here because there's more to come on this on Monday. But there's a lot of reasons why you would point -- or you would come to Criteo for retail media or off-site versus anybody else.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nOK. Thanks. We look forward to Monday then.\n\nMegan Clarken -- Chief Executive Officer\n\nThanks, Tim. Yeah, great.\n\nOperator\n\n[Operator instructions] Our next question comes from Mark Zgutowicz with The Benchmark Company. Please go ahead.\n\nMark Zgutowicz -- The Benchmark Company -- Analyst\n\nThank you. Good morning. So, we've heard a few prominent DSPs talk more about their relationships with retail media networks. And I'm curious if you can discuss what may remain sort of your relative advantage here and, perhaps, how Commerce Max may enable you to corner this market a bit more? I know you just talk about, you know, closed loop.\n\nThat's certainly a relative advantage. But also curious about what your go-to-market now is with Commerce Max in place. Thanks.\n\nMegan Clarken -- Chief Executive Officer\n\nYeah. Look, retail media -- being a retail media provider is more than what a lot of people think that it is. And we've been doing this for a long time. We acquired a company called HookLogic, and we've been focused on this for six years now, which is probably longer than anybody else.\n\nPlus, from a global perspective, we have people on the ground in those markets, you know, that have local relationships in those markets. And so, we have this, you know, footprint of people who know retail media backwards. That's the starting point. The second is, to do retail media is to integrate with the retailers.\n\nIt's not just about lighting up the DSP that the retailers can use. You have to have deep integration into the retailers data sets, from their catalog data, through to the SKU data, to their loyalty card data, to their CRM data. It just goes on and on. Because you have to do a job for the retailer, which is, you know, line up the right promotion at the right time.\n\nIs the product actually available? Is it in stock? Is it in stock in that geo location? Is the -- how can we continue to stay engaged with the consumer by giving them a recommendation for something else that they might like? All of these things are disciplines that come with being able to do retail media. And there's only a couple of players out there that can actually do that. So, you know, that's sort of the -- that's the crown root for us, is that don't underestimate what it means to be a player in the space. And the first mover advantage for us is the deep integrations that we already have with over 160 retailers around the world, some of the biggest names on the planet.\n\nFrom there, it's extending out the services. Like I just talked about, the retailers now need to be able to extend beyond their own walls to offer advertising to the brands, to take them off-site, to get them in front of more consumers who are actually on their buying journey. And that's what Commerce Max is all about. So, again, I don't want to be a spoiler for Monday.\n\nI'm looking forward to the team taking you through what that looks like. It's really very cool and exciting, and I look forward to seeing you there, Mark.\n\nMark Zgutowicz -- The Benchmark Company -- Analyst\n\nYeah, likewise. Thanks, Megan. I look forward to seeing you all as well on Monday. Take care.\n\nMegan Clarken -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThis concludes the question-and-answer session. I would now like to turn the conference back over to Melanie Dambre for any closing comments.\n\nMelanie Dambre -- Director, Investor Relations\n\nThank you, Megan and Sarah. This now concludes our call for today. We look forward to seeing many of you at our investor day in New York on Monday, and we will also webcast the event live. Have a great day, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMelanie Dambre -- Director, Investor Relations\n\nMegan Clarken -- Chief Executive Officer\n\nSarah Glickman -- Chief Financial Officer\n\nMatt Thornton -- Truist Securities -- Analyst\n\nSarah Simon -- Berenberg Capital Markets -- Analyst\n\nRichard Kramer -- Arete Research -- Analyst\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nUnknown speaker\n\nTim Nollen -- Macquarie Group -- Analyst\n\nMark Zgutowicz -- The Benchmark Company -- Analyst\n\nMore CRTO analysis\n\nAll earnings call transcripts"
}