{
  "companyName": "Evolent Health",
  "companyTicker": "EVH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/evolent-health-evh-q3-2022-earnings-call-transcrip/",
  "content": "Evolent Health (EVH 0.94%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to Evolent Health's earnings conference call for the third quarter ended September 30, 2022. As a reminder, this conference call is being recorded. Your host for the call today from Evolent Health are Seth Blackley, chief executive officer; and John Johnson, chief financial officer. All will be archived and available later this evening and for the next week via the webcast on the company's website in the section entitled investor relations.\n\nWe will now hand the call to Seth Frank Evolent's vice president of investor relations. Please go ahead.\n\nSeth Frank -- Vice President, Investor Relations\n\nThank you, and good evening. The conference call will contain forward-looking statements under the U.S. federal laws. These statements are subject to risks and uncertainties that could cause actual results to differ materially from historical experience or present expectations.\n\nA description of some of the risks and uncertainties can be found in the company's reports that are filed with the Securities and Exchange Commission, including cautionary statements included in our current and periodic filings. For additional information on the company's results and outlook, please refer to our third quarter press release issued earlier today. Finally, as a reminder, reconciliations of non-GAAP measures discussed during today's call to the most direct comparable GAAP measures are available in the company's presentation available in the investor relations section of our website or in the company's press release issued earlier and posted to the IR section of the company's website, ir.evolenthealth.com and the Form 8-K filed by the company with the SEC earlier today. During management's presentation and discussion, we will reference certain GAAP and non-GAAP figures and metrics that can be found in our earnings release, as well as a summary presentation available on the Events section of Evolent's IR website at ir.evolenthealth.com.\n\nAnd now, I'll turn the call over to Evolent's CEO, Seth Blackley.\n\nSeth Blackley -- Chief Executive Officer\n\nGood evening and thank you for joining the call. We'll begin by summarizing our third quarter 2022 results, update you on the business and on Evolent's three core operating priorities. John will discuss the numbers in more detail and share our updated guidance. As always, we'll then take your questions after the prepared remarks.\n\nStarting with our overall quarterly results, I'm pleased with the results where we delivered another quarter of strong organic growth and profitability. Our consolidated results were at or above expectations with continued momentum toward achieving our goals in 2022 and beyond. For the quarter ended September 30, 2022, Evolent Health's total revenue was $352.6 million, growth of approximately 58.5% over the same period of 2021. Year-over-year organic revenue growth was approximately 49%, excluding the two-month contribution from IPG, which closed at the beginning of August.\n\nThird quarter adjusted EBITDA totaled $28.1 million, an increase of $14.3 million, or over 100% growth compared to one year ago. Revenue for the quarter was in the middle of our Q3 guidance range, while adjusted EBITDA came in at the high end of the outlook. Consistent with our expectations and have communicated across this year, Evolent consolidated revenue and adjusted EBITDA was positively impacted in Q3 from the timing of variable performance-based earnings. John will cover these segment details in more detail in his section.\n\nTurning to Evolent's key metrics for membership and PMPM pricing. We ended the third quarter with 19.5 million lives, compared to 14.7 million one year ago, or a growth of 32%. Growth was driven primarily by New Century Health across both technology and services and the performance Suite. By segment, as of September 30, 2022, we had 2.1 million lives managed in Evolent Health Services and 17.4 million lives in our clinical solutions segment, which includes New Century Health and Evolent Care Partners.\n\nThese figures correspond to 1.6 million lives in Evolent Health Services and 13.2 million in the clinical segment at the end of the third quarter in 2021. In addition, we are providing additional disclosure on cases and average costs for the Vital and IPG businesses on a go-forward basis. John will review those metrics in detail in his section. Before I move into updates on our three core operating priorities, let's talk about the macro environment.\n\nWith inflation approaching a 40-year high, it's more important than ever for risk-bearing healthcare entities to identify ways to deliver high-quality care as efficiently as possible. We believe that one of the best ways to do that is through value-based care which aligns incentives across the system through clinical IP, scaled services, and technology. Despite the savings and quality improvements over the last decade, the value-based care movement has only penetrated a small fraction of the healthcare system. According to recent estimates, less than 7% of primary care revenues in 2021 were linked to value-based arrangements.\n\nAnd for specialty care, the percentage is even lower. We believe this landscape underpins the significant opportunity for Evolent Health given our position as one of the leading and most proven value-based care organizations in the country. With that backdrop, let's talk about our progress against Evolent's three core operating priorities to guide our operating strategy of, one, strong organic growth; two, expanding margins; and three, optimal capital allocation. Starting with organic growth, we are pleased to announce today three new operating partners, bringing our total to 13 for the year versus our target of six to eight.\n\nThe first two agreements are the addition of the Performance Suite at Molina for two large states, both of which will go live in the first half of 2023. One of the states will go live for both oncology and cardiology, and the other will go live for cardiology. Inclusive of these two new states, the Molina relationship will contribute over $180 million of clinical segment revenue in 2023. We're pleased with the impact we're having on this partner and also note that our 2023 revenues with this partner still represent less than a quarter of the total opportunity, illustrating the power of growth that exists across our installed customer base.\n\nAlso, pleased to announce the addition of a large multispecialty group practice in Washington state to our Evolent Care Partners Network. This organization has a long-standing presence in eastern Washington state with over 60 primary care and specialty providers, and over the last several years, has been building out its value-based care capabilities and contracts of local payers. This practice was drawn to Evolent Care Partners for its proven track record of supporting similar organizations' transition toward risk-based arrangements and its long-term vision for partnering across payer lines of business. In addition to signing new partnerships, we continue to grow within our installed base.\n\nFor example, we have signed a new contract with a large national partner and current customer of New Century Health to launch the Vital Decisions product across a number of geographies. While this revenue contribution from these sorts of cross-sell is modest, these arrangements contribute above-average incremental adjusted EBITDA, and we believe they also validate our ability to drive sales momentum after acquiring new specialty assets. With regard to our broader growth objectives for 2023 and beyond, we're seeing significant expansion of our weighted sales pipeline, especially in the value-based specialty business. Related early feedback on the IPG platform has been positive, and we're seeing confirmation of the primary deal thesis.\n\nFurther driving our pipeline expansion is a trend that our customers prefer fewer specialty partners, thereby unlocking multispecialty sales opportunities across New Century, Vital, and IPG. Translating strong pipeline growth into strong earnings growth is our second core operating priority. Our adjusted EBITDA grew by more than 100% versus last year, and over 70% of that growth was organic. Our adjusted EBITDA expansion has come from revenue growth, fixed cost leverage, and the maturation of our clinical solution customers.\n\nRegarding product mix, pro forma for IPG, over two-thirds of Evolent's adjusted EBITDA year to date comes from fee-based products delivered through our technology and services assets, with the balance from the risk-based offerings in the performance suite. While the performance suite remains an incredibly important opportunity for us and is the highest PMPM adjusted EBITDA dollar available to the company, we believe this balanced approach where we realize earnings across geographies, lines of business, and different business models is the best way to drive sustained earnings growth and shareholder value. Our third operating priority is optimal capital allocation. We've articulated three principles regarding Evolent's capital allocation strategy.\n\nAnd to reiterate those, they are, one, investing in innovation within our core business; two, strategic and accretive M&A and three, maintaining a disciplined balance sheet. We remain focused on these principles today and into the future. Let me give you an example of the first area around innovation. We're constantly seeking to improve our ability to partner with health plans and clinicians to align toward the best outcomes.\n\nDuring the quarter, in strategic collaboration with one of the largest national payer organizations in the country, we developed an enhancement to our technology and services suite that we refer to as Pathways Leveling, which further differentiates our highly differentiated platform for medical oncology management. With this innovation, we combine an advanced alternative payment model with nuanced evidence-based pathways, dividing potential treatment regimens up into four distinct categories. This allows for improved physician engagement and allows us to focus our highest-value interventions like peer-to-peer consultations more accurately. It also allows us to provide even more real-time updates to reflect the latest efficacy and effectiveness data.\n\nOur second principle for optimal capital allocation is strategic and accretive M&A. The additions of IPG and Vital and Evolent specialty unit helped raise our collective profile within our target market and has opened up additional opportunities for expansion. Our clients are looking for long-term solution partnerships, not vendors or fragmented pieces of the value-based care puzzle. As I mentioned in my opening remarks, we saw a confirmation of this cross-sell thesis and our recent expansion of the Vital Decision solution to a large national customer who is a New Century client.\n\nAnd we're seeing early momentum with IPG as well. Selective M&A can also increase value creation within our existing products. For example, we find that by integrating New Century Health authorization data with the Vital Decisions platform, we significantly increased the number of individuals identified for the advanced care planning service. In fact, over 80% of the cancer and cardiology patients using Vital Decisions were identified using New Century Health data inputs.\n\nThese are individuals who may have otherwise not been identified for our Vital Decisions advanced care planning services in the first place. Further, once we've identified candidates for Vital Decisions, we have observed significantly higher patient engagement rates. Those patients who respond to our outreach and, we believe, benefit from the service when we jointly deploy Vital Decisions along with New Century Health. Regarding IPG, the acquisition closed in August, and we're pleased with the pace of integration, which we believe will allow us to drive cross-sells and new logo conversions for the platform.\n\nJohn will talk about our third capital allocation principle of maintaining a disciplined balance sheet in more detail, but I'm pleased to have ended the quarter at approximately two and a half times net leverage on a pro forma basis and continued strong cash generation to fund the next phase of our growth. In summary, we remain focused on our core principles to drive shareholder value and are particularly excited by the opportunity in front of us within value-based specialty care. We have a unique opportunity in this market to continue to emerge as the only payer-agnostic multispecialty partner with a deep focus on clinical intellectual property and the breadth to serve the highest-priority challenges facing health plans and providers as we transition away from fee-for-service and into value-based care. Now, I'll hand the call to John to take you through the numbers and discuss our updated outlook.\n\nJohn Johnson -- Chief Financial Officer\n\nThank you, Seth. As we turn to the numbers, our headlines for the third quarter are strong, in particular, adjusted EBITDA, consistent with our focus on growing overall earnings. I'm also pleased to note that we achieved positive net income for the first time, an important milestone in our ongoing maturation as an enterprise. There are four areas where I will focus my comments for the quarter, and then I'll turn to guidance.\n\nFirst, our continued strong revenue growth. As we have launched our New Century Performance Suite across multiple new markets, we've added more than $140 million in annualized revenue since the first quarter of this year. This growth, earned by delivering strong results for our partners, will propel our overall earnings expansion in the years to come. As a reminder, our performance suite margins do not immediately drop to the bottom line but ramp over time.\n\nFor example, our year-to-date margins for performance suite clients who went live during 2021 are approximately 10%, consistent with our margin maturation expectations. Second, as you know, we derived some of our revenue across all of our business units through performance-based arrangements, including shared savings. This quarter was a tale of two cities on this dimension. In Evolent Health Services, we had strong earnings driven, in part, by approximately $3 million of gain share and the recognition of revenue associated with implementations for Bright Health.\n\nIn Evolent Care Partners, shared savings for the 2021 performance year came in at the low end of our expected range. The underlying clinical performance was strong and consistent with our thesis. Medicare beneficiaries who were with ECP for both 2020 and 2021 had total risk-adjusted medical expenses that were 7% lower than first year beneficiaries. These savings, along with constructive quality metrics, like lower ER visits and more time spent with primary care physicians relative to national Medicare, is consistent with strong operational performance.\n\nThis performance, however, was offset by the effect of COVID on healthcare utilization during the first wave of the pandemic, for which the MSSP attribution model did not adjust. CMS estimated that, not including such an adjustment for entities like Evolent Care Partners, had the effect of increasing 2020 shared savings by about 1% and decreasing 2021 shared savings by the same amount. Had CMS included such an adjustment in their model, ECP would have shown a 2021 savings rate of 3.6% versus 2020 rate of 2.8%. In dollars, this pandemic-driven impact represents a delta of approximately $10 million in shared savings and is the primary driver of the year-over-year decline in third quarter clinical segment adjusted EBITDA.\n\nWe believe this dynamic will be isolated to this unique and now historic comparison period, and we remain optimistic on the underlying value of the model to drive earnings growth and value in the years to come. Third topic. With the acquisition of IPG, now in our reported financial results, we are updating our volume metric disclosures to provide additional detail for investors to model the business. The financials of our advanced care planning and surgical products, Vital Decisions and IPG, respectively, are principally driven by case volumes and revenue per case.\n\nAs such, beginning this quarter, we are reporting two new metrics, total case count per period and average revenue per case. Vital Decisions lives will no longer be reported in the tech and services suite metric. The investor presentation on our website provides updated technology and services lives and PMPM disclosures quarterly since the acquisition of Vital in the fourth quarter of 2021 to exclude those lives for comparability. Finally, let's talk about the balance sheet, where there are three things to note.\n\nFirst, in the quarter, we converted the majority of our 2024 convertible notes early. The loss on debt retirement on our P&L represents the present value cost of the remaining coupon and a small inducement for the early conversion. Second, excluding cash deployed for acquisitions in the quarter, our cash flow was approximately flat to Q2, impacted in part by the timing of working capital that were normalized in Q4. We also expect a minimum of $20 million in cash remaining at Passport to return to the parent by the end of the first quarter of 2023.\n\nAs we think about cash flow, as a reminder, we have two main recurring uses of cash outside of adjusted EBITDA: cash interest, which currently runs about $6 million per quarter; and capitalized software development of about $8 million per quarter. Excluding transactions, one-time items, and working capital fluctuations, this translates to approximately 50% conversion from EBITDA into cash on a go-forward basis. Third, balance sheet item. With the acquisition of IPG and our first quarter of positive net income, we have released a portion of the valuation allowance on our deferred tax assets, resulting in a $46 million noncash benefit in the quarter.\n\nA portion of these tax attributes now on our balance sheet is covered by a tax receivable agreement with our pre-IPO investors. So, we also recognized an offsetting $43 million noncash liability. At our current course and speed, we do not anticipate becoming a cash taxpayer until at least 2024. Now, let's turn to a few detailed numbers before talking about guidance.\n\nAt the segment level, clinical solutions revenue grew 53.7% to $245.3 million, up from $159.6 million in the same period of the prior year. Third quarter 2022 adjusted EBITDA from clinical solutions was $16.3 million, compared to $23.9 million in the prior year and in line with our expectations. Turning to operating metrics for clinical solutions. Lives on platform and performance suite was 2.5 million, compared to 1.5 million in Q3 of the prior year with a PMPM fee of $27.02 versus $34.16.\n\nThe change in PMPM is driven by a mix shift as we add more Medicaid and commercial members to the platform. Lives on platform and our technology and services suite was 14.9 million, compared to 11.7 million last year with a PMPM fee of $0.29 versus $0.36 in Q3 of '21. Similar to our performance suite PMPMs, this decrease was in line with expectations as we have also seen faster growth in Medicaid and commercial lines of business. Total quarterly cases associated with advanced care planning and the IPG business totaled 12,800 for the third quarter.\n\nAverage revenue per case totaled approximately $2,200 for the quarter. Note that average revenue per case will vary quarter to quarter based on a host of factors, including payer mix, surgery intensity and types, and geographical variants. Evolent Health Services segment results were strong. Third quarter revenue, net of intercompany eliminations, increased 70.8%, to $107.3 million, up from $62.9 million in the third quarter of 2021.\n\nThe addition of Wright Healthcare drove segment year-over-year growth. EHS adjusted EBITDA performance of $18.5 million compared to a loss of $3.4 million in the prior year. Membership in our performance suite for Evolent Health Services was 2.1 million compared to 1.6 million in Q3 of '21 with a PMPM fee of $16.41 versus $13.19. Finally, corporate costs were flat at $6.8 million in both the current quarter, as well as the same quarter in the prior year.\n\nWe remain disciplined on our cost structure and expanding our consolidated adjusted EBITDA margin as we continue to grow. Turning to the balance sheet. We finished the quarter with $156.8 million in cash, cash equivalents, and investments, including $30.7 million in cash held in regulated accounts related to the wind down of Passport. Excluding cash held for Passport, we ended the quarter with $126 million of available cash, a sequential decline of $32.6 million versus June 30, '22.\n\nCash deployed for capitalized software development in the quarter was $8 million. We also deployed $28 million in cash for purchase of IPG in August. Excluding this payment, available cash would have decreased by $4.6 million for the quarter, driven by working capital fluctuations. We expect to be meaningfully cash flow positive in Q4.\n\nTurning to guidance. We are pleased with our progress against our financial objectives for the year. We now expect total revenue for the year to be between $1.33 billion and $1.35 billion. With continued strong core business performance, we are narrowing our full year adjusted EBITDA range to between $98 million and $103 million.\n\nFor the fourth quarter, specifically, we are forecasting total revenue of $361 million to $381 million, and we are forecasting consolidated adjusted EBITDA of $24 million to $29 million. Now, I will turn the call back to Seth for closing remarks.\n\nSeth Blackley -- Chief Executive Officer\n\nThanks, John. In summary, I'm pleased with our continued progress across all fronts, including sales execution, product development, and optimal capital deployment. Before we move into Q&A, I'd like to highlight two enhancements to our leadership structure. In September, we named Dan McCarthy, president of Evolent Health, reporting to me, to oversee the company's value-based specialty operations and strategy.\n\nDan has been instrumental in leading the successful and seamless integration of IPG and Vital Decisions, as well as driving the growth of New Century Health. Partnering with John and me, Dan will help lead the strategy to further deepen the capabilities of our value-based specialty platform and our target specialties. Filling out our leadership team and reflecting the company's purpose and a value-driven culture, we recently welcomed Kali Beyah as Evolent's chief people and brand officer. Kali reports to me and will oversee our talent and marketing functions.\n\nOur human capital is one of Evolent's greatest assets, and Kali will take the leadership reins to further bolster our culture and elevate our talent operations to the next level, as well as refresh our brand identity to reflect Evolent's unique team, mission, and impact. Kali joins us from the global marketing firm Huge as global chief people officer and before that, Delta Air Lines, where she serves as the head of talent. We congratulate Dan, and welcome Kali to Evolent. And with that, we'll move into Q&A. \n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] At this time, I will pause momentarily to assemble our roster. And our first question will come from Anne Samuel of J.P. Morgan.\n\nPlease go ahead.\n\nAnne Samuel -- J.P. Morgan -- Analyst\n\nHi, thanks. I was wondering if you could maybe provide some color on your expectations just for revenue contribution from the new announced partnerships today. And now that you're at 13 partnerships announced for the year, maybe a little bit of color on how we can think about growth for next year. Thanks.\n\nJohn Johnson -- Chief Financial Officer\n\nGreat. Hey, Anne. I'll start on some of the revenue specifics and hand it to Seth to talk about next year. Taking them in turn, the expanded Molina partnership that we announced together, we expect will contribute between $35 million and $40 million of run rate revenue.\n\nThat'll go live sometime during the first half of next year. On the Evolent Care Partners announcements, this is our 15th partner added to the ECP stable here, this is about average size. So, we'll see that contribution, as you probably remember, largely in '24 based on performance year 2023. Seth can talk about growth.\n\nSeth Blackley -- Chief Executive Officer\n\nYes, Anne, happy to. I'd tell you on the '23 growth front, obviously, our target is always to meet or beat the mid-teens target. We've been in the 30s or 40s or higher organic growth for a while. If you look at what we've signed year to date, I'd just say we're very well set up for achieving our goals for next year.\n\nAnd then by the way, we've also got a really big pipeline, the biggest pipeline we've had, which will potentially affect '23 and certainly beyond. I think part of that pipeline, one of the things I like about it, Anne, is that it's a very diversified group of blue chip large health plan names. And I think that diversification is an important part of sort of how we grow. So, I think the takeaway is we're well set up for next year and beyond.\n\nAnd I think the pipeline is feeling quite good just in terms of what we'll deliver for next year, but also in the years after that.\n\nAnne Samuel -- J.P. Morgan -- Analyst\n\nThat's great to hear. And then maybe just one other one. I was hoping you could provide some color on what the recent changes for MSSP might mean for Evolent.\n\nJohn Johnson -- Chief Financial Officer\n\nYeah, absolutely. I'll take that one. So, the rule has been out for a day. So, we are still digesting it.\n\nBut I'd highlight three things. The first and most relevantly, actually, for our quarter is the dynamic that I mentioned in my prepared remarks around the shifting of value from '20 to '21 or vice versa. CMS saw that, too, and included in the final rule is a six to their model that had it been in place, our '21 results would have been meaningfully higher. So, we're pleased with that.\n\nPleased with some of the changes that they're proposing around the nuanced way that they calculate the risk adjustment for these sorts of populations and also around how they handle rebasing for ACOs like ECP. So, overall, I think a generally positive rule. And I think most importantly, for our macro perspective, it feels like it reinforces this overarching thesis of the continued push to value.\n\nAnne Samuel -- J.P. Morgan -- Analyst\n\nOK. Helpful color. Thank you.\n\nSeth Blackley -- Chief Executive Officer\n\nThanks, Anne.\n\nOperator\n\nThe next question comes from Charles Rhyee of Cowen. Please go ahead.\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nYeah. Thanks for taking the question, guys. Hey, Seth, obviously, Molina is a very big partner with you guys. Great success so far.\n\nYou made the comment that with $180 million contribution from Molina, it's still only 25% of the opportunity. I feel like you're up to seven states. And if I'm not mistaken, I don't think Molina is in more than 13 or so. Can you talk about sort of what -- when you go into a state with someone like Molina, what percentage of the lives are you typically being asked to manage in the performance suite side? I'm guessing that it's not everybody.\n\nMaybe walk us through and then how that expands over time.\n\nSeth Blackley -- Chief Executive Officer\n\nYeah, happy to, Charles. So, I think there's a couple of different things. One is when you enter a state, yes, you may not have all the lives for a couple of different reasons. And I think each state is its own specific set of facts and circumstances that we work with the plan on.\n\nI think those lives are generally opportunities for the future. I wouldn't say there are big swaths that, hey, we just can't do anything with. And so -- but there may be some specifics around this state or that state as to why sell lives may not be in, to your point. But then the other cut on the data is also kind of which specialties, right? So, we have both cardiology and oncology available to us.\n\nSome of those states don't have all -- both specialties. The opportunity is to be in both specialties. And obviously, with IPG, with Vital, there are other things that we can be doing as well. That 25% number was sort of and pre-IPG and pre -- thinking about Vital, so the total opportunity is probably a little bit bigger even now, but it is cuts on the geographies, as you said, of course, the populations within the geography and then the specialties that go against the population that we are serving.\n\nSo, we work with the plan to kind of get it right and make sure we have the maximum impact. And I think the thing I'd probably care most about is that we're doing a good job for the partner, for the customer, right? And we're taking good care of the patients in turn. And I think the validation we feel from the growth even getting to, say, 25% penetrated is excellent. We're happy about that.\n\nI think similar conversations going on with other partners and plans. And again, it all stems from doing what we said we're going to do, delivering and creating value for patients and our customers. And I just think we're in a strong place on that front.\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nThat's helpful. And maybe just two other quick questions. One, I know you mentioned that a greater mix shift to Medicaid kind of calls out the decline sequentially in PMPM. It still seems rather significant relative to between first quarter and second quarter.\n\nMaybe is there anything else in there that we think of it? And is this really -- should we expect that as the mix grows, we should be tempering our assumptions for PMPM in performance suite?\n\nJohn Johnson -- Chief Financial Officer\n\nCharles, it is just mix. And it has to do, as you can imagine, with the prevalence of the diseases in our specialties with the different populations. Medicare is much higher prevalence of oncology, for example, than does moms and babies Medicaid plan. I think where we are now, you can just see from our revenues, is pretty nice mix.\n\nSo, I don't know if I model it going down any further. But I think the -- you will see, as we grow, depending on the composition of that growth, the PMPMs go up or down.\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nGot it. OK. Thank you very much.\n\nOperator\n\nThe next question comes from Sean Dodge of RBC Capital Markets. Please go ahead.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nYep. Thanks, guys. Good afternoon. Maybe just starting on margins.\n\nJohn, before you mentioned establishing some operations in the Philippines, and I just want to better understand how meaningful of a cost savings driver that could be over time. Maybe can you give us a sense of how fast you can scale headcount there? And then I guess the work that you'll be doing there, is that something that you'll be transferring from out of U.S.-based sites, so there will be a pretty meaningful kind of wage rate differential as that work gets ported over?\n\nJohn Johnson -- Chief Financial Officer\n\nHey, Sean. So a couple of things I'd say just on the macro question of thinking about our operations from a global lens, one of the biggest gating items, as you can imagine, since we work with a lot of government-funded payers, is partner permissions. So that's something that we take very seriously and really think through as we scope the size and scale of what we can do offshore. I think that said, we view the opportunity to expand our operations in the Philippines across both customer service and certain clinical like intake functions as pretty meaningful over a multiyear span.\n\nI think we would also view it as it's not a sort of light switch, as you know. It's a process as we have stood up our operations in Pune, India, which are now quite large, we would anticipate doing something similar. I also would say by virtue of being a growth company and meaningfully expanding our operations, it sort of enters into our planning as we think about next year, as we think about '24, and so on.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK. That's helpful. Thank you. And then in Evolent Care Partners, you've got the ACO lives there and then you had the full capitation ones like with the Blue Cross plan.\n\nWhat's the outlook like for Evolent any more full capitation relationships in lives? Are you having a lot of those conversations now? You mentioned the continued kind of conversion of value-based care. How meaningful of a growth driver should we think about that potentially being over the next 12 to 24 months for Evolent?\n\nSeth Blackley -- Chief Executive Officer\n\nHey, Sean, it's Seth. I can take that. I think it's still an opportunity for us. We are in conversations on different opportunities on that front.\n\nAnd I think you should consider it as something that is in the pipeline and is an opportunity. So, I think what's interesting is, in particular, when you look at Medicare Advantage plans, the opportunity to take on a capitation arrangement through the primary care network that's sort of a very proven model in the marketplace, and there are going to be lots of opportunities on that front for any network that has the capability to manage costs. So, yes, I would say that is in the pipeline for us and certainly will be an opportunity.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK, great. Thanks again for taking the questions\n\nOperator\n\nThe next question comes from Ryan Daniels of William Blair. Please go ahead.\n\nRyan Daniels -- William Blair -- Analyst\n\nYeah. Guys, good evening. Thanks for taking the question. Maybe a strategic one for you, Seth.\n\nAs we think about the product offering and how it's advanced with some of the M&A activity for New Century, have you thought about how you approach your go-to-market strategy? Meaning are you going more with bundled approaches, selling multiple offerings as one contract? I assume at least some of them thinking Vital Decisions in oncology, for example, might have a bit of a value multiplier effect, if you can tag those on with an initial contract.\n\nSeth Blackley -- Chief Executive Officer\n\nYeah, Ryan, I think it's a great question. The answer is yes. We are definitely going with a more bundled approach. Sometimes that's what the payer wants.\n\nSometimes it isn't. But I'd say in general, there's this big theme, Ryan, that we've talked about, which is if you look inside a typical large blue-chip health plan, they could have many, many partners across different specialties. And the fragmentation of that partnership model for those payers is not a lot of fun for them to deal with. But I think more importantly, it misses out on valuable integration opportunities for the patient.\n\nAnd you flagged it, right? Vital Decisions and end of life with oncology and cardiology is a great example. But you can think of lots of other examples that also fall into that same concept. And so, I'd just say in general that our payers are pushing us to do more, want us to do more. They were very positive as we brought the IPG example to the table on the MSK front.\n\nAnd so, we are going with more bundled conversations. I would just say that the thesis, Ryan, if you remember, some of those M&A transactions that we could actually grow the revenue rate of the combined business more consistently over time than anybody could on their own because again, the payer wants to buy bundles. So, I think that thesis has been proven out with what's happening with Vital and even the very early conversations with IPG. And we feel good about that thesis and feel like it's a structural advantage we have given that we now have multiple specialties in one place.\n\nSo yes, answer is yes, and we're going to kind of lean further in that direction over time in terms of bundling things together.\n\nRyan Daniels -- William Blair -- Analyst\n\nOK. Very helpful color. And then maybe one for John. If we think of this year and the new contract wins at 13 versus the six to eight guidance, a lot of them clearly won't be generating revenue until 2023, some of which probably won't contribute materially to profits until 2024 given the revenue recognition and shared savings models.\n\nDoes this have an impact kind of on where you initially thought EBITDA would come in? Because you do have those start-up costs without the associated revenue. So, kind of are you getting more revenue for the future but incurring a little bit more cost at present to allow that? Thanks.\n\nJohn Johnson -- Chief Financial Officer\n\nYeah. No, it's a great question. As we look at our multiyear trajectory here, what we laid out back in the fall of 2020 was growing in the mid-teens and getting into the mid-teens from an EBITDA margin perspective at some point during 2024. And if you were to roll forward that sort of math from where we were in 2020, that would have given an EBITDA target run rate sometime in '24 of between $150 million and $200 million.\n\nI would say on that metric, that feels like a good target for us. To your point, the way that we are getting there is by faster growth with a lot of performance suite business that has this multiyear margin curve and slower percent EBITDA margin expansion. But the way that we're really oriented to run the business is focused on consistent dollar earnings growth. And I think that's what you'll see from us going forward.\n\nRyan Daniels -- William Blair -- Analyst\n\nVery helpful. Thank you, guys.\n\nOperator\n\nThe next question comes from Sandy Draper of Guggenheim. Please go ahead.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nGreat. Thanks very much. First question, John, and I think this is, unfortunately, a shame on me, not a shame on you. I thought with MSSP, you accrued some revenue during the year and then you trued up when the numbers came in, but it sounds like maybe I was off there.\n\nDoes all the revenue come in, in the year after? Or is there some level of accrual?\n\nJohn Johnson -- Chief Financial Officer\n\nYeah. It's not a shame on you. It's a technical accounting question. Look, so the accounting rules on this one are quite clear, which are you only recognize revenue if it is more likely than not that you will not have a reversal.\n\nA sentence that only an accountant would write. The -- what that means for us is for something like the MSSP shared savings, as we are getting data across the year, we are booking, to your point, toward a revenue number that we expect we have an extremely high likelihood of achieving. What that meant for us this year is with the final numbers came through, there wasn't a lot left to recognize. And so that was sort of consistent with my commentary in the prepared remarks.\n\nSo that's the way that we think about it. It's how we're oriented with all of our risk-based products.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nOK. Got it. That's helpful. And then my second question or follow-up is for Seth.\n\nI'm not sure I quite understood. In the prepared remarks, you talked about the balance and I think of something like two-thirds of EBITDA was for one segment versus the other. And I guess the message I was getting was you're trying to balance out the mix of business, and you don't want to be overweight in any one customer segment where if something goes wrong, it has a big EBITDA hit. And I'm thinking here about what happened with Bright was potentially a bigger customer, but when they're dropped out of individual and family, wasn't a big EBITDA impact on that side.\n\nSo, I was just trying to understand exactly what you said. And are you actually sort of trying to titrate what's in your pipeline? Or is it just sort of this is the way it's developing in terms of the mix? Thanks.\n\nSeth Blackley -- Chief Executive Officer\n\nYeah, Sandy. Good question. So maybe answer the margin question even more broadly. I think the comment I made was that two-thirds of our EBITDA is coming from technology-oriented fee-based products.\n\nAnd a third is from our performance suite products. And I think that's important. We've gotten questions from investors, \"Hey, how much is tied to these risk-based arrangements or performance-based arrangements?\" We want to be really clear that actually the majority of the company is actually on a technology-oriented fee-based business model. And that, we think, is a good balance, I'll call it, in terms of how we are able to forecast and think about it.\n\nI wouldn't say we're titrated, it's just what the business is. We'll add more performance suite over time. We'll have more technology over time. So, I think that's kind of part one of the question.\n\nI think the broader margin maturation of the business -- when we have two-thirds of the business is tech services and a third is performance suite. The next question is, OK, for the third that's performance suite, how is it doing, right? And I think that we talked today on the call about the fact that the 2021 cohort of our performance suite products is approaching 10% on the EBITDA line. And that's, we think, great validation for that third of the business, Sandy, also performing well and having the margin ramp that we wanted to have. So, I'm now connecting it back to John's earlier comment of in 2020, we said, \"Hey, by 2024, we're going to be here with the base business.\" We're on track for that at IPG.\n\nWe're on track. And I think with the tech services piece continuing to mature the way it is, that part feels good. And then we have some data now on the one-third that is the performance suite risk-based side that feels very consistent with the margin maturation model that we've been putting out now for over a year as to what that ramp looks like. So, I think -- I hope you're taking away from this that we feel confident in the margin ramp of the company.\n\nThat should be the big takeaway, and we're getting more and more data to confirm kind of where we're going and how we feel about that.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nGreat. Really helpful, Seth. Thanks.\n\nSeth Blackley -- Chief Executive Officer\n\nWelcome.\n\nOperator\n\nThe next question comes from David Larsen of BTIG. Please go ahead.\n\nDavid Larsen -- BTIG -- Analyst\n\nHi. Congrats on a good quarter. I think I heard you, Seth, say that Molina is generating about $180 million in annual revenue. But then I think I heard John Johnson say that the expansions for Molina would result in about $40 million of additional revenue in 2023.\n\nDid I hear all that correctly?\n\nJohn Johnson -- Chief Financial Officer\n\nSo, it's going to be $180 million for next year for all of Molina. The expansions are $40 million on a run rate annualized basis, David. So, we won't have all of that $40 million next year because it's starting at some point in the first half of the year. So, whenever it starts, you can kind of do the math on what we actually get from that.\n\nBut whatever that number is, will be part of the $180 million, and that was -- those are the two comments.\n\nDavid Larsen -- BTIG -- Analyst\n\nOK. Great. And then, John, I think I heard you say basically that your EBITDA would have been $10 million higher this quarter if it wasn't for the adjustments in the CMS sort of calculation. Is that correct?\n\nJohn Johnson -- Chief Financial Officer\n\nBroadly speaking, if it weren't for the lack of an adjustment is the way that I would phrase it, David. Our read of the new model that CMS just rolled out yesterday is that it would have corrected for this issue. But the -- it was the lack of an adjustment for sort of quirk of the attribution methodology in the CMS model.\n\nDavid Larsen -- BTIG -- Analyst\n\nOK. So, it would have been $10 million higher except for that irregularity. OK. And then for Evolent Health Services, I think the EBITDA came in at $18.5 million this quarter.\n\nIs that up from $8.2 million in 1Q, and that's a very significant increase? Is that correct? And can you just remind me sort of what's driving that? I mean is it just sort of the growth of the overall business?\n\nJohn Johnson -- Chief Financial Officer\n\nYeah. Two main things in that, David. Your numbers are right. The first was the recognition of some gain share in the quarter from some of our performance-oriented partnerships within EHS; and the second was, as you know, a lot of our implementation work in EHS is driven back half weighted.\n\nAnd so, we tend to recognize more implementation revenue in the back half, and that was true this quarter and contributed nicely to the EHS earnings. Now, I will say, just on the topic of implementations, of course, we stopped all Bright Health implementations on October 11. And that does have an impact on our Q4 guide by the order of a couple of million from not having those implementations sort of active that we had planned on. As we look into next year, as we mentioned on Bright, to circle off on that.\n\nThe -- we anticipate roughly flat revenue for that customer year over year.\n\nDavid Larsen -- BTIG -- Analyst\n\nFor Bright, flat next year. OK. And then just -- yeah, just one more quick one, and then I'll hop back in the queue. Are you reaffirming the mid-teen EBITDA guide margin for some time in 2024? I think I heard you say that yes, you are.\n\nAnd then are you still sort of planning at least 15% organic revenue growth going forward even after accounting for the change in the Bright Health Group deal? Thank you.\n\nJohn Johnson -- Chief Financial Officer\n\nYep. The growth first and then EBITDA. So, growth, yes, we still believe that the mid-teens are better, is a good target for this business for a couple of years to come. On the EBITDA side, what we've been saying for a while is given the pace of our growth and the amount of that growth that has come from the performance suite, which has a lower margin than percent margin, although higher dollar margin, does the tech and services suite, we would expect to reach our sort of EBITDA dollar opportunity in 2024 but probably with more growth and less EBITDA percent margin expansion.\n\nDavid Larsen -- BTIG -- Analyst\n\nOK. Great. Thanks very much.\n\nOperator\n\nThe next question comes from Richard Close of Canaccord Genuity. Please go ahead.\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nYeah. Thanks for the question or questions. Just to be clear, on the tech and services, the change from third quarter to fourth quarter of the lives, that's all just really pulling out the Vital Decisions and putting it in this case's metric now?\n\nJohn Johnson -- Chief Financial Officer\n\nThat's correct. Net of that change, it would have ticked up modestly.\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nOK. Great. And then, Seth, you talked about the pipeline being larger than ever. And then you made some comments on diversification.\n\nCan you talk a little bit about the diversification of the pipeline, what exactly you're seeing? And maybe comment on the Blue Cross Blue Shield opportunities going forward.\n\nSeth Blackley -- Chief Executive Officer\n\nYep. Sure, Richard. So I think the main comment is just when you look across the pipeline, while we've, over time, had some very significant additions with existing customers or even large new ones, I think the way I would characterize the current pipeline is across a lot of different logos and really some new names that we haven't talked about in a while, which I think is a good thing for the company just in terms of continuing to grow from different places and having lower and lower customer concentration over time, those sorts of things. So, I think that's the main way I would characterize it.\n\nCertainly, the Blue Cross opportunity, Richard, is part of that. I think one of the factors with the Blue Cross world is that they, maybe more than even the national plans, like to do a little bit more one-stop shopping on the specialty side. And so, our ability to do bundle, and going back to the question earlier from Ryan, I think, is a positive in that segment. And so, we're seeing some acceleration, I would say, with our Blue Cross opportunities recently.\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nOK. Thank you.\n\nSeth Blackley -- Chief Executive Officer\n\nYep. You're welcome.\n\nOperator\n\nThe next question comes from Jessica Tassan of Piper Sandler. Please go ahead.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nHi. Thank you so much for taking the question. I was hoping you can maybe help us understand just how the sales process at Molina works. So, are you guys a national partner at this point? Are you selling state by state, or from one plan to another via referral? And then just of Molina's 19 states, how many have you either engaged and successfully contracted or engaged and not contracted? So, how much -- I guess just what is the untapped opportunity remaining there?\n\nSeth Blackley -- Chief Executive Officer\n\nYep, yep. Hi, Jessica. So generally, I'll answer this question generically, whether it's really any of the national plans that we're partnering with or in conversations with. It often is a combination of a national relationship and dialogue along with a state-based sales process.\n\nAnd so, you need, I think, least common denominators. You've got to at least be kind of approved at the corporate level, I'll call it. And then it's up to us to go have the conversations and build the consensus on a state-by-state basis with the state leadership, also the national leadership to actually get agreement on next state, next state, next state. And it depends on what that plan's objectives are, what they're trying to accomplish in that given year, who has capacity, who may be going into an RFP cycle.\n\nThere's lots of different nuances as to kind of which states get prioritized and which don't. I think I've said this a bunch over the quarters, which is we really like this model because -- it builds deep relationships, and it's very sticky. It's not a single signature at corporate. It is a very deep embedded relationship where we have to create value for the corporate teams, but also the state-based teams.\n\nWe love it that way. So, that's sort of how it works and also a model that we really like. In terms of Molina, specifically, I think we're less than halfway across the number of states that they have. I don't want to get into plan-by-plan details on which states we're engaged with and which ones we are and things like that.\n\nBut we're well less than half in terms of the states that we're kind of in place with today, Jessica. And I think the 25% number is a really good number in terms of revenue penetration relative to the opportunity.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nThat's really helpful, and a high hit rate. I just wanted to switch to -- I think you guys noted in the press release that Vital has been integrated into an MCH oncology contract. Can you just go through what the revenue model is for a multiproduct sale like that, the revenue model, and then also the EBITDA model as well? Thanks.\n\nSeth Blackley -- Chief Executive Officer\n\nYeah, I'll start with that, and John may add on that one, Jessica. So, there's two ways with Vital that we roll it out. One way is if in the example we gave on the call tonight. They're a New Century Health tech and services customer.\n\nThey also want to have the Vital platform deployed. Then we will have a tech and services like fee-based model, right? It is more on a case level as we've talked about in the past, but it sort of comes out to a reasonable per member per month kind of fee that has the sort of high margins that are typical of that kind of product. And so, we get paid those fees. They're not huge on the revenue line, but they're pretty helpful and significant on the EBITDA line.\n\nThat's the first way. And that's one of the things that we talked about tonight, showed up like that, given that customer. In other instances, which we've talked about in the past, in some ways, the model that's preferred is where there is a performance suite opportunity or a client that's already live, meaning we are taking the risk for cardiology or oncology. We can switch on Vital Decisions.\n\nWe don't get paid for it, but it's part of the value proposition that helps deliver for the patient and for that plan on what we're accomplishing. And there, we recognize no additional revenue, but we hopefully recognize additional profitability through the performance of the performance suite, right? So, those are sort of the two models. I think we have a stat that Vital -- the number of cases in Vital is up by more than 35% since we acquired it. And I think that's a good way to look at both together, right? You got -- whether we're getting paid or not getting paid, the number of cases that we're engaging on is a good metric, is up by about 35%, 36% since we acquired it.\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nThank you.\n\nSeth Blackley -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Jailendra Singh of Truist Securities. Please go ahead.\n\nJailendra Singh -- Truist Securities -- Analyst\n\nThank you. And thanks for taking my questions. First, a quick clarification for John on your comment about $150 million to $200 million EBITDA for '24 still being a good number. Just want to make sure that does include contribution from IPG, right? It's not just based on only organic growth.\n\nJohn Johnson -- Chief Financial Officer\n\nThat was a target that we had out there for our base business. So, we would add IPG on top of that.\n\nJailendra Singh -- Truist Securities -- Analyst\n\nGot it. OK. Then my main question here, like, I mean, clearly, a great number of partnerships, now 13, spending well ahead of expectations of 6% to 8% initially. Would you say that with the recent M&A transactions providing opportunity and given other industry and macro drivers, you highlighted this momentum could continue going forward? Or would you say that 2022 has been an exceptional year and the annual target of six to eight partnerships still the right figure to keep in mind going forward?\n\nSeth Blackley -- Chief Executive Officer\n\nYeah, Joan, it's Seth. It's a great question. It's similar to the question we get a lot of, \"Hey, you've been growing it 35%, 40%. Is the mid-teens too conservative?\" I think we're -- we like to give conservative numbers and hopefully beat them.\n\nThat's sort of our objective and how we manage the business. I do think that metric, in particular, given the number of products we have that as we look in the future, we feel really good about beating that number. And I think we're going to continue to likely exceed that number. So, whether we rebase it or start to think about it in a slightly different way, we haven't decided yet.\n\nThat will be for 2023. But I'd be surprised if we're not above that number again next year.\n\nJailendra Singh -- Truist Securities -- Analyst\n\nOK. And one last quick follow-up here on the -- Clearly, with the part of Bright contract update for the EHS business and some strong pipeline and growth you've seen in New Century business, how should we think about your strategic investment dollar allocation between the two businesses? Just trying to understand if there has been any changes in your view around the long-term opportunities in the EHS business.\n\nSeth Blackley -- Chief Executive Officer\n\nYeah. Great question. I think one of the things that we've been saying for several quarters now is that we have focused our M&A capital around the specialty opportunity and tremendous growth opportunity, low-market share, good products. We have market leadership.\n\nAnd I'd say nothing has changed on that front, meaning we're going to continue focusing our M&A capital there. The Evolent Health Services business is actually a great business. It's not set up to do M&A around it anyway. And the job there is to do a good job supporting our customers and we think it can be a steady contributor.\n\nIt also happens to have, whether it's the Philippines operation, the Pune operation, our technology team, our utilization management teams that sit inside of that unit, also happen to be capabilities that are really important for the specialty opportunity, right? So, there is some cross-support between the business units as well. These aren't silos completely. And so that's the other dimension that I'd used to answer your question, which is, yes, we're focusing our capital dollars on specialty, and we have been for a while, not at the expense of Evolent Health Services. We don't need to do it over there as much, but I also think there are ways, and we'll begin doing this to utilize those capabilities to support this big-time growth opportunity that we have on the specialty side.\n\nJailendra Singh -- Truist Securities -- Analyst\n\nPerfect. Thanks, guys.\n\nSeth Blackley -- Chief Executive Officer\n\nOK. Great. I know we're getting close to time here. Any other questions in the queue?\n\nOperator\n\nThere are no further questions at this time. \n\nSeth Blackley -- Chief Executive Officer\n\nOK. Great. Thanks, everybody. John and I look forward to connecting with you over the next couple of days.\n\nHave a good night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSeth Frank -- Vice President, Investor Relations\n\nSeth Blackley -- Chief Executive Officer\n\nJohn Johnson -- Chief Financial Officer\n\nAnne Samuel -- J.P. Morgan -- Analyst\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nRyan Daniels -- William Blair -- Analyst\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nDavid Larsen -- BTIG -- Analyst\n\nRichard Close -- Canaccord Genuity -- Analyst\n\nJessica Tassan -- Piper Sandler -- Analyst\n\nJailendra Singh -- Truist Securities -- Analyst\n\nMore EVH analysis\n\nAll earnings call transcripts"
}