{
  "companyName": "General Mills",
  "companyTicker": "GIS",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/21/general-mills-gis-q1-2023-earnings-call-transcript/",
  "content": "General Mills (GIS -0.63%)\nQ1 2023 Earnings Call\nSep 21, 2022, 9:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the General Mills first quarter fiscal 2023 earnings Q&A webcast. [Operator instructions] As a reminder, this conference is being recorded Wednesday, September 21, 2022. I would now like to turn the conference over to Jeff Siemon, VP of investor relations. Please go ahead.\n\nJeff Siemon -- Vice President, Investor Relations\n\nThank you, Kelly, and good morning, everyone. We appreciate you joining us today for a Q&A session on our first quarter fiscal '23 results. I hope everyone had a time to review our press release and listen to our prepared remarks and view the presentation materials, which were made available this morning on our IR website. It's important to note that in our Q&A session, we may make forward-looking statements that are based on our current views and assumptions.\n\nPlease refer to this morning's press release for factors that could impact forward-looking statements and for reconciliations of non-GAAP information, which maybe discussed on today's call. I am here with Jeff Harmening, our chairman and CEO; Kofi Bruce, our CFO; and Jon Nudi, group president of our North America retail segment. Let's go ahead and get right to the first question. Kelly, can you please get us started?\n\nOperator\n\n[Operator instructions] And our first question comes from Andrew Lazar with Barclays. You may proceed with your question.\n\nAndrew Lazar -- Barclays -- Analyst\n\nThank you. Good morning, everybody.\n\nKofi Bruce -- Chief Financial Officer\n\nGood morning.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nGood morning, Andrew.\n\nAndrew Lazar -- Barclays -- Analyst\n\nMaybe to start off, I think the area that diverged from expectations the most in the quarter was certainly on gross margin, which actually expanded modestly year over year. I was hoping you could provide a bit more detail on sort of the drivers of this performance. And maybe more importantly, how do you see the sustainability and sequential cadence of margin performance through the remainder of the year?\n\nKofi Bruce -- Chief Financial Officer\n\nSure, Andrew. This is Kofi. I would just note we are pleased with the start on margins for Q1. The primary driver, just as we think about kind of where we are, the HMM cost savings plus benefits from price/mix, offset inflation, deleverage and our other sort of operating costs we have taken on in this environment to show modest expansion in the quarter.\n\nI think as we look forward, we are not going to give guidance largely in recognition still of the fact that we are in a highly dynamic environment and still vulnerable to supply chain disruption. So as we think about the operating environment, there is still a high degree of volatility. The biggest variables, as you can imagine, as we think about the gross margin progression for us are going to be volume performance on the level of disruption and as we obviously would just take note of the inflationary environment, where we just noted that we are expecting modestly higher inflation for the year. So that's kind of the table setting.\n\nAndrew Lazar -- Barclays -- Analyst\n\nOK. And then I guess second, I am curious of some of the volume declines that you are seeing just based on elasticity in, let's say, North America retail. Do you have a sense for how much of that is due to, let's say, the loss of promoted volume versus base or full price volume just given that you and others are not promoting as much in light of current service levels? And I guess I asked this, because it could help us get maybe an even better sense of the health of sort of the underlying business, if you will?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYes. Jon Nudi, do you want to take that?\n\nJon Nudi -- Group President, North America Retail Segment\n\nYes, good morning, Andrew. So as we look at the unit declines, the vast majority of that is due to promotional pulling back and not so much frequency, but really adjusting our price points. So in most categories, it's up to about 75% of the unit decline is due to promotional pullback.\n\nAndrew Lazar -- Barclays -- Analyst\n\nOK, very helpful. Thanks so much.\n\nOperator\n\nOur next question comes from David Palmer with Evercore ISI. You may proceed with your question.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nHi. I am trying to think of a good follow up on gross profit, because obviously that was very impressive this quarter. I am wondering how are you viewing your gross profit performance, your gross margin performance versus your plan so far, maybe you could speak to that? And I am wondering to what degree would you be teasing or have us tease out perhaps some benefits that might not repeat in the future, some things that are outsized benefits such as some of the market share gains in your higher margin categories or perhaps promotional activity that you don't feel like will be as favorable anything that you would do to caution us on gross margins?\n\nKofi Bruce -- Chief Financial Officer\n\nYes. I think sort of broadly beyond the quality, let me get to the front part of your question. In the quarter largely the -- what was sort of unexpected on gross margin was the level of volume and on the back of the elasticities that Jon just alluded to, which were lower than we expected going into the quarter and into the beginning of the fiscal year. So that resulted in less deleverage pressure.\n\nSo that flowed through to gross margin. I think as a cautionary note, well, I would certainly be in the front of the line along with all our business leaders, including Jon to want the environment stabilized, I think supply chain disruption is still very, very real, categorically well above historical levels and the cost of servicing volume in this business even as we think we are doing it competitively in our North America business is just higher and will remain higher until we see that stabilization. So that probably is the first and primary cautionary note. And the second is obviously the interaction of pricing and volume and elasticities in this environment remains, still hard to read because we are in a historical period and it is hard frankly to coalescence.\n\nSo those are sort of the cautionary notes and they all have pretty reasonably significant impact on gross margins. I think the last thing is, as we noted in the scripted remarks, we did flag some other headwinds that potentially will flow through to operating margin, including increased investment on the business to sustain long-term growth and the cost of the expected cost of the recall on Haagen-Dazs.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nAnd if I could just squeeze in just a follow-up on your – the supply chain comment, was there improvement through the quarter such that your so-called exit rate, supply chain friction was less at the end of the quarter than it was at the beginning of the quarter that gives you hope that, that will be less going forward? And I will pass it on. Thanks.\n\nKofi Bruce -- Chief Financial Officer\n\nYes, sure. So a fair question. As we entered the year, we expected a very modest improvement in the level of supply chain disruption. The quarter effectively played out in line with those expectations and with the expectations we set at the beginning of the year, which are we are still expecting a categorically higher level of supply chain disruption than our historical experience.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThanks.\n\nOperator\n\nOur next question comes from Chris Growe with Stifel. You may proceed with your questions.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nThank you. Good morning.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nGood morning, Chris.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nI just had a question if I could. And I think you have an expectation that elasticity will increase from here. I think that's a very prudent assumption. I am just curious if you are seeing any signs of that or any indicators that would increase that -- that would indicate that elasticity is increasing or maybe some categories where you are seeing it perhaps that give you a bit of a warning sign for the business overall.\n\nIt seems like it's going pretty well across the industry. I just want to see if there is anything that we are missing here?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nChris, this is Jeff Harmening. I mean, I don't think that – I don't think you have missed anything so far. As Kofi alluded to just a minute ago, elasticities have been more favorable to us than we had anticipated in the current environment, particularly as consumers have traded to away-from-home meeting to more at-home eating consumption. It's just a matter of as we look through the year, we would anticipate that elasticities would become a little bit less favorable than they are right now, but still more favorable than they would have been historically, but so far, we haven't seen really any change in elasticities, which for us was a positive for the quarter.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nThat's great. Thank you. And I know we have had a few gross margin questions. It was quite a great performance there.\n\nI just was curious maybe Kofi to you and to the phasing questions around the gross margins, do you still have price increases that are going into place that need to take place to offset the inflation? And I guess related to that, you had this increase in inflation, does that prompt you to take more pricing at retail overall? Thank you.\n\nKofi Bruce -- Chief Financial Officer\n\nNo, I appreciate that. We have most -- the vast majority of our pricing in the market to address or announced to address the inflation that we see, including the revised modest provision up in the inflationary guidance. And the last round being in our North America foodservice business, where we have taken some additional steps to address cost of goods as we saw more inflation in the quarter than we did price/mix. So I think we are in a place where we feel comfortable we have got this sort of bounded.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nOur next question comes from Cody Ross with UBS. You may proceed with your question.\n\nCody Ross -- UBS -- Analyst\n\nHey, good morning. Thank you for taking our questions. I am just going to nitpick a little bit here. You noted supply chain headwinds in pet.\n\nCan we unpack that a little bit, which brands and categories are you seeing the most impact? And I am just a little bit surprised that given the pet demand that you are seeing or demand in the pet category, you were not able to deliver total sales dollars in line with the fourth quarter of last year?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYes. So let me take that, Kofi, and I'll unpack it a little bit and then if you want me to unpack it even more let me know. But I would say first, I would remind everybody on the call that we grew our pet business double-digits yet again in the first quarter and then we have increased our pet sales of $1 billion over the last four years. And so while it may not have been the run-rate in Q4 is still growing at double-digits.\n\nSo I guess that would be my first bit of context. The second I would always say is that I think it's also important to remember that Q1 last year, our sales were really, really strong. And that's not only because we had capacity, but also we are working off some inventory. So we are selling not only everything we could make first quarter of last year, but we are also drawing down inventory levels, a product we had made previously.\n\nAnd so the comparisons are particularly difficult by the way as they are in the second quarter of this year as well. And so the comparisons are really difficult. When we look at -- so when we look at our performance, I would say our supply chain improved modestly throughout the quarter in pet. Our service levels improved modestly in line with our expectations.\n\nAnd we actually grew share in the wet pet food category and we lost share in treats and dry and that's where we don't have the capacity.Just to answer your question just a little further, as a reminder, we anticipate having more capacity for treats coming online in the third quarter in January of this year and then dry is going to take another few quarters to get in line. And that's important to note because as we think about our second quarter in pet, we will have a lot of costs from increasing service in the business, whether it's through external supply chain or through adding capacity on treats and warehouse space and all those things, but we won't yet have the sales associated with it. So you can expect our second quarter pet to be a little bit challenged, but we're highly confident that will rebound in the third and fourth quarters of this year.\n\nCody Ross -- UBS -- Analyst\n\nAnd that's 2Q Pet margin that you're referring to, not sales? I just want to make sure I understand that.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYes. I would say primarily the margin piece, yes.\n\nCody Ross -- UBS -- Analyst\n\nGot it. That's helpful. And then one more quick question, if I may. You noted in your prepared remarks plans to step up brand building and investments for growth.\n\nWhich categories and brands do you see the most opportunity? Thank you.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nWell, I would say, over the long run, we see the most opportunity in our global brands and our local gen businesses. And so that they include businesses like pet and Haagen-Dazs and Nature Valley probably the biggest upside potential, but also some of our local gen businesses like Totino's where we highlighted during the quarter and we are adding capacity is now a $1 billion brand for us, Pillsbury, which is a $1 billion brand, [Inaudible] in China. So the biggest areas of opportunity for us are going to be probably the ones that you would anticipate, which are big billion-dollar brands in global categories as well as some of our local gem brands that I just mentioned.\n\nOperator\n\nOur next question comes from Steve Powers with Deutsche Bank. You may proceed with your question.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nHey, thanks. Good morning.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nGood morning.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nI want to hit on gross margin again. And then a follow-up on pet. On the gross margin, so acknowledging the uncertainty around volume progression and the supply questions, Kofi, you mentioned. We just focused on the phasing of run rate inflation relative to pricing benefits and HMM benefits.\n\nDo any of those things get tougher from 1Q before they get better? Or it feels like you're relatively well caught up between pricing and productivity benefits relative to the rate of inflation as we run through the first quarter. So I'm just trying to get a sense of, a, if that's correct and then, b, the only thing that can get worse for some reason before they get better?\n\nKofi Bruce -- Chief Financial Officer\n\nWell, I would say, broadly, we are modestly higher on inflation in the front half and modestly is probably appropriate. But I think on balance, it is still a relatively balanced year in terms of our inflation call between 14% and 15%.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nSteve, I'd just say, from a pricing standpoint, we will start to roll over more meaningful pricing in the back half of this year. And obviously, we saw a strong price/mix come through in Q1 that's likely similar in Q2 and then it decelerates as we start comping more meaningful step-ups last year.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nYes, OK. That's fair. Thank you very much. And then on the Pet question, given sort of the tightness of supply, and it looks like you're obviously making efforts to bring supply online.\n\nBut it feels like the real relief isn't going to come at this point until fiscal '24. We've seen competitors in the space start to buy up capacity to sort of accelerate that and get incremental capacity online sooner. And I just wanted to kind of play that off to you and just get a sense for -- is that something you would consider as you think about capital allocation and M&A strategies is adding capacity through acquisition, something that's on the table? Or are you more inclined to just stick to building it out and working through co-packers.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYes. Thanks. Very fair question. Let me make sure.\n\nThere is one point I want to make sure or clarify because you talked about relief coming in fiscal '24. I would say, I think about it in two pieces. And I'm not trying to nitpick, but I think this is important. Our tree we're lacking capacity and treat and dry.\n\nOn treats, we will bring on external capacity in the third quarter of this year. So we don't need to wait until fiscal '24 for treat capacity, and we are really short on that. We bought a great business on Nudges and True Chews and so forth, we are branding at Blue Buffalo. So we are really excited about what we can do.\n\nWe just need the capacity, and we don't need to go out and buy additional capacity for that because we will have what we outcome in January. One the dry, it is true that it's going to take a while for us to get dry capacity. And if something became available, whether it's through external supply chain or buying or another source the question, would we be willing to look at that, absolutely, we'd be willing to look at that if it would speed up our rate instead of doing it internally. We haven't had that option yet present itself, but we're at two, we would certainly evaluate that and the speed to market of that and the cost relative to doing it ourselves.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nGreat. OK, thank you very much.\n\nOperator\n\nOur next question comes from Jason English with Goldman Sachs. You may proceed with your question.\n\nJason English -- Goldman Sachs -- Analyst\n\nHey, folks. Thanks a lot, and congrats on a strong start to the year. I'm going to come back to pet, but was really a different question. So first, the capacity that you're going to be bringing on and dry, can you give us some context in terms of like quantify how much is this is going to add for you in fiscal '24.\n\nJeff Siemon -- Vice President, Investor Relations\n\nJason, we said it's going to be about upwards of $150 million of capital that we're putting in. We talked about that on the Q4 call. But beyond that, we haven't we haven't quantified what percentage of additional capacity, but it will be a meaningful chunk to add.\n\nJason English -- Goldman Sachs -- Analyst\n\nOK. And you are not alone, right, Nestle is adding, [Inaudible] is adding, Hills is adding, as Steve mentioned, both organically and inorganically, Simmons is adding, Phelps is adding, like it's a plenty of small manufacturers, there is a lot of capacity. It seems like it's coming in like the wake of COVID as we start to anniversary a pull-forward pet adoption. In other words, it seems like it's coming at a time when there is not a lot of volume growth in the industry.\n\nHow does this play out? And as we think forward, what's the risk that gets pretty darn competitive with an overbuild of capacity and becomes a pretty promotional category.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYes. I understand the rationale behind the question. But I mean promotional activity in pet really is in a very productive effort because demand is pretty inelastic and consumers tend to be very loyal. I would also add that even pre-pandemic, as you probably realized, Jason, you probably remember this, is that we were growing Blue Buffalo double digits already even in a category that was barely growing in terms of pound before that.\n\nAnd the most important thing to remember is not the trend of the pandemic, but it's a humanization trend, which I know you well remember. And that's been going on for 15 years or so and Blue Buffalo is very well positioned to grow in that market. So even in the face of a category that sees low growth in pounds, Blue Buffalo participates in the fastest-growing part of a very attractive category with the best brand. And so we're confident no matter what happens in the rest of the category.\n\nThat Blue Buffalo is going to be well positioned as we look to the future.\n\nJason English -- Goldman Sachs -- Analyst\n\nYes. No doubt. I'm not arguing that premiumization should fade away. And to that point, you've got double-digit growth this quarter.\n\nI think everyone has double-digit growth because the inflation out there. Can you unpack maybe that that price/mix line then for us? Like how much of it just pass-through of higher cost? And how much of it is the mix, the premiumization that you're talking about?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nIt's really a combination. So we have seen meaningful pricing SRM actions on the business obviously, the business itself is high mix, but the largest amount is really what we're seeing from an SRM standpoint in the quarter.\n\nJason English -- Goldman Sachs -- Analyst\n\nGot it. Alright. Thanks a lot, guys. I will pass it on.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nThanks.\n\nOperator\n\nOur next question comes from Bryan Spillane with Bank of America. You may proceed with your question.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning, guys. Wanted to ask a question about foodservice. And I guess, looking at the margins in the quarter, I know you called out in the press release that maybe pricing has lagged outside of flower milling. So can you just talk about a couple of things.\n\nOne, how much pricing do you think you're going to need to recover margins? Can margins sort of recover in the course of fiscal '23. And then maybe separate from that, is there any, I guess, like stranded cost or dis-synergy related to the resegmentation that's kind of reflected there. So is it more than just inflation? And is there any like stranded cost or anything related to the resegmentation that's affecting it in the near-term?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nSo I'll have Kofi probably get into the specifics of this, but this is Jeff. Let me just -- it's a lot to unpack in food service this quarter. I guess one of the takeaways top line I would share with you is that we have high confidence in our food service business and certainly and the fact that we can grow it into the future and that the margins will improve. So I want you to know there is nothing fundamentally mass in our food service business.\n\nHaving said that, there is a lot going on in this particular quarter. So probably let Kofi explain a little bit of that.\n\nKofi Bruce -- Chief Financial Officer\n\nSure. And let me just start with your reference to index flower pricing or index pricing on our bakery flower, so as a reminder, that is profit neutral, dollar profit neutral. So as prices go up to cover costs, it just flows through at a fixed dollar profit. So as you think about that, a good chunk of the price/mix you saw in the business, which was about 21 points was actually driven by index pricing.\n\nOn the rest of the business, we did not see enough price/mix come through to fully cover the inflation in the quarter. We subsequently have additional pricing to work with pass-through to the customers. And we would expect in the balance of the year, we will continue to see improvement in the margin prospects for the business. To your question about stranded costs, so just as a reminder, we decoupled the convenience business, primarily focused on convenience stores and other smaller convenience channels and put that into North America retail as part of the snacks business.\n\nAnd with that, we actually moved administrative structure as well. So there isn't really an overhang from stranded costs, all of that kind of went with the business. So this is a pretty fair representation of the underlying food service business margins.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nOK. So some of this is just the math of flour prices going up, you get the dollar profits, but it's profit neutral. And the rest is really just going to be catching up to inflation, I guess in the non-flour milling piece? Is that a good way to say that?\n\nKofi Bruce -- Chief Financial Officer\n\nThat is exactly the way I would put it. You have got it.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nAnd, Bryan, just to maybe put a finer point on that pricing going up for index pricing with no incremental profit dollars coming with it is actually margin negative for the segment in the quarter to the tune of about 200 basis points. So margin which is obviously a big portion of -- you are seeing that flow through in this quarter.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nYes. Perfect. Thanks, Jeff. Thanks, guys.\n\nAppreciate it.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nOur next question comes from Jonathan Feeney with Consumer Edge. You may proceed with your question.\n\nJonathan Feeney -- Consumer Edge Research -- Analyst\n\nHey. Good morning. Thanks very much. Two questions.\n\nFirst, I wanted to dig in on the 14% to 15% expected COGS inflation. Could you comment, if you can, any more about kind of how much of that is input costs relative to all the other structural inflationary things in Japan? Just a flavor for that or is input cost the vast majority of that would be helpful. My second question would be more broadly in the U.S. promotional levels, merchandising levels or if you want to use the syndicated data, something like 10 points off their pre-COVID normal.\n\nAre retailers expecting they get back to that pre-COVID normal at some point? Thanks.\n\nKofi Bruce -- Chief Financial Officer\n\nYes. Well, let me start on the front part of the question, and then I will hand the second part probably to Jon or Jeff. Just as you think about our call on modestly higher inflation, we are seeing a couple of things go on, but primarily it reflects the burden of higher labor, energy and transportation costs on our suppliers, in particular, on items in our COGS that have high conversion. So, think about your value-added ingredients such as nuts, fruits, flavors, etcetera, so the pass-through impact of that.\n\nSecond is that as we have been working our way through the quarter and on the expectation that we will see higher volume flow-through as a result of slight lower elasticities than expected. We have outstripped coverage in some areas. So, we are actually buying out in the back of the year at and exposed to more spot market prices. So those are the primary drivers as we think about it.\n\nAnd then just as a reminder, we started taking coverage positions at the turn of the calendar year for this year. And our coverage position is still reasonably strong relative to the spot prices. So, we are effectively pretty in the money as you think about our coverage. So, those are some of the critical things just as you think about the guidance and how we are thinking about the balance of the year on inflation.\n\nAnd then I will let Jon or Jeff handle the second part of your question.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYes. This is Jeff. Let me take that one. I think as I said at a conference a couple of weeks ago, we think the risk of promotions ramping up significantly over the next couple of quarters is quite low.\n\nAnd the reason is that you kind of have to believe three things to be true in order to see a lot of promotions increase. The first, you would have to think that this inflationary cycle were different than the ones we have seen before. And I was running a business in the last inflationary cycle here at General Mills. And what we see is that there isn't really a sharp increase in promotions coming out of an inflationary cycle.\n\nSo, you have to think that the environment would be different. The second thing is you have to believe the disruption in the supply chain are going to change significantly from where they are now. And the third is that you would have to see COGS inflation not only decelerate, but also get to absolute deflation. And the fact is that I think you need all three of those things, we don't see any of those things as we see right now.\n\nWe just increased our guidance on inflation a little bit. We have told you that supply chain disruptions remain high, elevated, they are about two times what they were before the pandemic, even if they are below what they were a year ago. And then there is inflationary cycle as we see keep playing out, but that's what we think. I mean that the risk is relatively low given what I just laid out.\n\nJonathan Feeney -- Consumer Edge Research -- Analyst\n\nThanks. Very helpful.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Ken Zaslow with Bank of Montreal. You may proceed with your question.\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nGood morning, guys.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nGood morning.\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nTwo questions. One is, what are your expectations for your innovation progression this year and next relative to the last two years?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nI would say in aggregate, we would expect our levels of innovation to roughly flow the same as they have in prior years. I would say the one exception to that would probably be our pet business. Clearly, when you are capacity constrained innovating when you are capacity constrained is a little bit difficult. And so in pet, we would see our innovation weighted to the second half of the year, and we will talk about that more in December.\n\nWe are actually quite pleased with some of the innovation we see coming. A lot of it is on our established businesses and some of it some new products. But in pet, I would say that we probably have more coming in the second half of the year than the first half of the year. But in general, the innovation timing is roughly similar.\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nBut you don't think that you will accelerate given your supply constraints being a little bit ease. I would have thought you would have told me your innovation will actually accelerate over the next two years, given all the things that have happened between the consumer and the -- but I hear what you are saying. I am just curious. And then my next question is as you go forward in a couple of years, can your gross profits expand if elasticity becomes what you think it's going to be and volumes don't kind of subside a little bit, or do you truly need the volume operating leverage because that seems to be one of the points you pointed to as a key core reason for gross margin expansion.\n\nSo, I was just trying to get a little color on that, and I appreciate your time.\n\nKofi Bruce -- Chief Financial Officer\n\nSure. I appreciate the question. This is Kofi. So I would just note.\n\nOur gross margins are down still relative to the pre-pandemic. So, in fiscal '19, probably about 140 basis points or so and I think the goal for us during this inflationary period has really been to drive our HMM cost savings between roughly 3% to 4%. And our price mix benefits from SRM to be enough to offset inflation. And I think actually, as we measure it, we have done a pretty good job of kind of covering the inflation with the combination of those two things.\n\nThe reason our gross margins are down versus that period is because of the cost of dealing with supply chain disruptions and the additional cost to operate and serve the business in this environment. So, those costs, when the supply chain environment stabilized are the things that we would expect to be able to take out in relatively short order with targeted HMM and productivity actions as well as changes in our supply footprint. And that, I think gives us confidence that as we step out of this environment, we will be able to get our gross margins back to sort of pre-pandemic levels in a more stable environment.\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nOK. Appreciate it. Thanks, guys.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nOur next question comes from Michael Lavery with Piper Sandler. You may proceed with your question.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nThank you. Good morning.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nGood morning.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nYou have mentioned consumers shifting back to more food at home as part of what's probably softening elasticities, but your organic growth in food service outpaced North America retail. And even going back a few years, I know there are some moving parts, maybe the comparisons aren't all perfect, but it looks like even against fiscal 1Q '20, it's growing faster. Is that driven by inflation and index pricing, or is there just that much momentum in food service? Maybe help us reconcile just how strong the numbers look versus some of the very logical color about consumer shipping back to more homes.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nMichael, you are right in the sense that it is logical to assume that the food service will move in a different direction than with our retail business, given the trend at at-home consumption. But there are two things playing into this for the quarter and one thing playing over this more generally. In the quarter, remember, we have a lot of index pricing on bakery flour, which really inflates the sales number on our food service business. I mean the accounting is right, but it makes it look higher than it would be otherwise.\n\nAnd so that really all of our growth this quarter in food service is a result of that index pricing. That's the first thing I would tell you. The second is that even given that, though, our food service business doesn't move in perfect correlation, inverse correlation with our retail business because we have a really big school business. And so we are not only servicing restaurants, we have a significant part that we sell cereal and yogurt and other baked goods through our education, and we are really, really good at that.\n\nAnd so that demand tends to be a little bit more inelastic. And so even though it may seem logical in the face of it, they have food service inversely with retail, and point of fact, ours doesn't move perfectly that way for that reason, even if we take out of consideration the index pricing.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. That's helpful. And then can I just follow-up on -- you called out higher SG&A in pet as one of the margin drivers or having an impact on margin. What maybe is behind that? I guess I am just curious because if there is the capacity constraints on two of the biggest pieces of that business, it wouldn't seem like it's higher marketing.\n\nIs it just a sort of a step-up in the G&A, or what's behind the SG&A curve there?\n\nKofi Bruce -- Chief Financial Officer\n\nYes. No, we have had, along with most of our retail businesses, modest increases in our spending behind data and analytics. So, that would be a big chunk of, as you think about what's driving SG&A growth in the comp. That would be more of it.\n\nAs you know, obviously, we have maintained modest levels of increases in media as we step through, and we are trying to manage through the supply pressure on this business.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nAnd, Michael, the one other thing is you have got now a full quarter of the Tyson business that we acquired last year. So, there is a bit of step-up in SG&A just by the math of adding an incremental business there.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. Thanks for all of that.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYou bet. OK. I think we are going to go ahead and wrap up there. I appreciate everyone's time and good questions.\n\nAnd please feel free to follow-up over the course of the day with the IR team, and we look forward to being in touch next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Siemon -- Vice President, Investor Relations\n\nAndrew Lazar -- Barclays -- Analyst\n\nKofi Bruce -- Chief Financial Officer\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nJon Nudi -- Group President, North America Retail Segment\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nCody Ross -- UBS -- Analyst\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nJason English -- Goldman Sachs -- Analyst\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nJonathan Feeney -- Consumer Edge Research -- Analyst\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nMore GIS analysis\n\nAll earnings call transcripts"
}