{
  "companyName": "ShockWave Medical",
  "companyTicker": "SWAV",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/shockwave-medical-swav-q2-2022-earnings-call-trans/",
  "content": "ShockWave Medical (SWAV -0.92%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Shockwave's second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this call is being recorded for replay purposes. I would now like to turn the call over to Debbie Kaster, vice president of investor relations at Shockwave, for a few introductory comments.\n\nDebbie Kaster -- Vice President, Investor Relations\n\nThank you all for participating in today's call. Joining me today from Shockwave Medical are Doug Godshall, president and chief executive officer; Isaac Zacharias, president and chief commercial officer; and Dan Puckett, chief financial officer. Earlier today, Shockwave released financial results for the quarter ended June 30, 2022. A copy of the press release is available on Shockwave's website.\n\nBefore we begin, I would like to remind you that management will make statements during this call that include forward-looking statements within the meaning of federal securities laws, which are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Any statements contained in this call that relate to expectations or predictions of future events, results or performance are forward-looking statements. All forward-looking statements including, without limitation, statements relating to our sales and operating trends, business and hiring prospects, financial and revenue expectations and future product development and approvals are based upon our current estimates and various assumptions. These statements involve material risks and uncertainties, including the impact of the COVID-19 pandemic that could cause actual results or events to materially differ from those anticipated or implied by these forward-looking statements.\n\nAccordingly, you should not place undue reliance on these statements. For a list and description of the risks and uncertainties associated with our business, please refer to the risk factors section of our annual report on Form 10-K on file with the SEC and available on EDGAR and in our other reports filed periodically with the SEC. Shockwave disclaims any intention or obligation, except as required by law, to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. This conference call contains time-sensitive information and is accurate only as of the live broadcast today, August 8, 2022.\n\nAnd with that, I'll turn the call over to Doug.\n\nDoug Godshall -- President and Chief Executive Officer\n\nThanks, Debbie. Good afternoon, everyone, and thank you for taking the time to join us to review Shockwave's results for the second quarter of 2022. We are pleased to share the results of another strong quarter delivered by our global team. Our customers continue to witness the significant benefits of using IVL to treat their patients, which help mitigate the headwinds of the contrast of supply and staffing challenges that have been topical across our period this quarter.\n\nSales in the second quarter of $120.7 million represented increases of 116% from the second quarter of 2021 and 29% from the first quarter of this year. We witnessed growth across almost every sector this quarter. U.S. peripheral once again demonstrated its strength, up 35% from the first quarter of 2022.\n\nU.S. coronary and our international business grew sequentially at 25% and 26%, respectively, over the first quarter. The solid performance and contribution from each of these areas is a compelling testament to the strength of our business as a whole. Perhaps the most meaningful statistic for our team is that we were able to help improve outcomes in over 35,000 patients across the globe last quarter.\n\nLater in the call, Isaac will provide additional details regarding market dynamics, but I will begin with some commentary around the quarter. Our footprint outside the U.S. continues to expand. In fact, our international revenue has more than tripled since our IPO in 2019.\n\nWe are now commercial in over 60 countries. And though most of our international revenue comes from Europe, we are seeing early signs of our agent expansion, we'll be able to contribute meaningfully going forward. On the heels of the approval of coronary IVL in Japan in March, our Chinese JV was granted approval for both our peripheral and coronary products in China in May. There are over 1.5 million PCIs and over 270,000 peripheral procedures performed in China each year, both of which have been growing in double digits.\n\nDespite the significant prevalence of calcium, the utilization rate of existing calcium modification devices is extremely low in China, under 1% for both coronary and peripheral procedures. Literally, this represents a great opportunity for Shockwave and for our physician partners in China to improve outcomes for their patients. They have already been multiple events promoting IVL including an initial virtual launch event that had an audience of 1,500 physicians. One of the other highly impactful events was the China Interventional Therapeutics, or CIT, Conference in June.\n\nCIT is the largest scientific congress in Asia dedicated to interventional cardiology. And it was fortunate that the conference was held just as we were initiating our launch. The team was able to engage in person with over 100 leading Chinese KOLs and over 10,000 online participants who are able to observe IVL, live Shockwave cases, demos, symposia, training, workshops and in-depth interviews. As with so many things in China, the scale is quite remarkable.\n\nMoving to Japan, one of the largest interventional meetings of the year, CVIT, was held in Tokyo in July and IVL carried today. The meeting was 90% remote, but the room for our symposium were packed. The physicians are eager to have access to IVL, and we are now fairly certain MHLW will be granting us reimbursement in the December cycle.Turning now to our near-term pipeline. We have spoken briefly in the past about the L6 catheter, which will offer even larger diameters than our M5+ catheter with 10- and 12-millimeter diameter sizes.\n\nThe goal was to create a tool that further enhances outcomes in the complex calcified disease beyond even what the M5+ can address such as the more severe common femoral lesions and the transition into the iliac bifurcation. We are in discussion with FDA regarding the regulatory pathway, and we'll provide an update on the expected timing once we have a bit more visibility. We also continue to generate and disseminate high-quality clinical data supporting our products. During the quarter, we had multiple publications and presentations and a particular note were the 1- and 2-year results of the DISRUPT PAD III randomized clinical trial, which were presented at the Sky Conference in Medi.\n\nThese data confirmed that IVL's unique mechanism of action delivers significantly more luminal gain with lower dilatation pressures and a significantly lower rate of infections versus PTA. While we achieved statistical significance in both the predefined primary and secondary endpoints, one of the additional treating aspects of the results was to see the Kepler-Meier curves continue to diverge in two years, suggesting that the benefits of IVL may actually improve over time. This certainly resonates very well with our customers and correlates with their anecdotal observations. Taken together, the successful achievement of our primary and secondary endpoints confirmed that IVL provides a superior vessel prep versus PTA and excellent long-term outcomes in calcified vessels preserving future treatment options.\n\nOur commercial efforts received most of the attention but none of this would have been possible without key strategic decisions and the nearly flawless performance of the teams behind the scenes in operations and quality. As a result, their great work, we have unfortunate enough to avoid being impacted by supply chain issues, rather remarkable given the extraordinary growth we have witnessed and the current macroeconomic challenges around the world.Continuing the approach of getting at the front, we just broke ground in Costa Rica and have signed agreements to build our own facility there, which will substantially increase our capacity and will complement our current Santa Clara and contract manufacturing volumes. We expect to be online sometime in 2024. And when it is up and run, we will use that location to manufacture our establishing more mature products.\n\nWe believe this operation strategy will position us to continue to deliver new products to market faster and do more effectively manage our cost of goods and will also facilitate our future growth and scaling. Given the results we have witnessed in the first half of the year, we now anticipate delivering top line revenue in the range of $465 million to $475 million for the full year of 2022, representing growth of 96% to 100% from 2021. With that, I will turn the call over to Isaac, but before I do, I want to take a brief moment to recognize what he has contributed since joining us over four years ago. Anyone who has followed our story closely, is likely aware of how instrumental he has been in driving commercial execution.\n\nBehind the scenes, Isaac has been a tremendous strategic partner for me and the rest of our leadership team. In acknowledgment of a significant effect, I was pleased to be able to promote him to president, chief commercial officer for a couple of months. I look forward to continuing our partnership as we seek to improve outcomes for patients globally and to creating a compelling sustained growth business for years to come. Following Isaac's comments, Dan will share more details on the broader business and financial results.\n\nIsaac?\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nThank you for the kind words, Doug. I will add a bit of color to Doug's comments on the quarter. We had a solid quarter across the board, despite some of the challenges that our industry peers have mentioned. While COVID seems to be pretty much under control as it relates to the impact on hospital procedures, the contrast shortage with a new challenge in Q2.\n\nThankfully, by June, the issue is pretty much behind us. While we are still seeing staffing shortages, the impact of this has delayed procedures. We do not see it impacting total procedures, more of a shift of a few weeks versus losing cases. Our U.S.\n\nsales team continues to execute at the highest level and effectively work through all the challenges that have been thrown in front of them. In terms of the new above-the-knee product, M5+, our plan remains to phase out M5 and replace it with M5+ later this year or early next. The launch continues to go very well, and our customers are appreciating the upgrades that M5+ offers in combination with the value proposition as they weigh the benefits of the excellent clinical performance and improved features of M5+. We have been successful in obtaining back approvals for M5+ and once customers use the product, they don't want to use M5 anymore.\n\nIt's been a really nice validation of the work our marketing and R&D teams have done to develop a nextgen product that satisfies our customers unmet needs. As we pass the anniversary of the launch of coronary IVL in the U.S., that business continues to outperform expectations. During the second quarter, reorders represented 95% of the C2 revenue in the U.S. indicating that the use of IVL continues to grow with existing customers.\n\nThis high reorder rate also reflects the fact that we have penetrated a significant portion of our target accounts. And while we are still working to add new accounts, we are increasingly turning our attention going deeper within existing accounts. I am really pleased with the progress our team continues to make as they focus on getting broader physician supporters within existing accounts. We continue to add to our U.S.\n\nsales team in the first half of the year. As we said earlier, most of the new hires are field clinical specialists in existing territories. This helps with our efforts to teach more physicians and staff and the accounts about the proper use of IVL. One advantage of having such a relatively simple and easy-to-use device confers, particularly during this time of staffing shortages, is that nurses and techs who are new to the hospital are quickly able to learn the system and efficiently assist physicians during the cases.\n\nDuring the first half of 2022, 68% of our U.S. accounts purchased both coronary and peripheral products, 17% purchased only coronary and 15% purchased only peripheral. Our goal continues to be to have all of our customers using both coronary and peripheral IVL. Internationally, Doug hit a lot of the highlights, but I will add a few more details.\n\nWe have had solid growth in our international business. We are especially pleased with the performance of our direct teams in the U.K. and France. They have done an impressive job contributing to our growth after their transition from distributors.\n\nAs we go direct, we generally see improved performance across the portfolio but particularly in peripheral since that is a more complex cell than coronary and distributors are less likely to take the time required. The U.K. is a prime example where we are seeing a market uplift in peripheral sales resulting from both greater attention by the field team as well as from multiple meetings, courses and peer-to-peer selling. Our JV in China is well prepared for the launch of peripheral and coronary IVL and the initial promotional events and cases have gone extremely well.\n\nIn terms of reimbursement in China, IPO will be used in procedures that are already reimbursed in that country, namely PCI and peripheral vascular procedures. The level of reimbursement for these procedures varies depending on the province. As with most procedures in China, there's also an out-of-pocket payment component that comes from the patient. Over time, the JV will work to get IVL-specific codes in place that will have incremental reimbursement for procedures in which IVL is used.\n\nAgain, this is a relatively complex process as there is variability across the country, and it will take time. What is important is that we do expect to have strong initial uptake of IVL with the current reimbursement and we will seek to improve the reimbursement specific to IVL over time. In Japan, we continue to receive very positive feedback from the market. We have been conducting our initial free of charge cases with KOLs, and they have gone very well.\n\nPrior to reimbursement, we are limited to only a few cases per center at a limited number of centers. We really look forward to being able to launch coronary IVL in Japan in 2023. With that, I will turn the call to Dan to review the financials.\n\nDan Puckett -- Chief Financial Officer\n\nThank you, Isaac. Good afternoon, everyone. Shockwave Medical's revenue for the second quarter ended June 30, 2022, was $120.7 million, a 116% increase from $55.9 million in the second quarter of 2021. U.S.\n\nrevenue was $100.1 million in the second quarter of 2022, growing 133% from $42.9 million in the second quarter of 2021. Coronary products contributed $72.1 million to U.S. revenue in the second quarter of 2022, a 174% increase from $26.4 million in the second quarter of 2021. Peripheral products accounted for $27.7 million of U.S.\n\nrevenue, a 68% increase from $16.4 million in second quarter of 2021. Generators accounted for $0.2 million of U.S. revenue in the quarter. The growth in U.S.\n\nrevenue was driven by increased utilization at existing accounts, new account adoption of IVL and continued sales force expansion. International revenue was $20.7 million in the second quarter of 2022, a 59% increase from $13 million in the second quarter of 2021.International revenue for the quarter included $3 million of sales to our Chinese joint venture. These sales represent a stocking order for the JV as they ramp up inventory for both peripheral and coronary products prior to launch. International revenue from coronary products was $15.7 million in the second quarter of 2022, a 51% increase from $10.3 million in the second quarter of 2021.\n\nInternational revenue from peripheral products was $4.2 million in the second quarter of 2022, a 78% increase from $2.4 million in the year ago quarter. Generators accounted for $0.8 million in international revenue in the second quarter of 2022. The increase in international revenue over the prior year period reflects continued geographic expansion including China, growth in customer demand and the expansion of our direct sales force in Europe. Because the contribution from China in the second quarter of 2022 is an initial stocking order, we'll share some revenue details that exclude China for this quarter.\n\nExcluding the stocking order, total international revenue was $17.7 million in the second quarter of 2022, which represents growth of 36% from the year ago period. Excluding the JV stocking order, international revenue from coronary products was $14.4 million in the second quarter of 2022, a 39% increase from the second quarter of 2021. Excluding the JV stocking order, international revenue from peripheral products was $3 million in the second quarter of 2022, a 27% increase from the second quarter of 2021. Looking at total revenue by product line.\n\nOur coronary products accounted for $87.8 million of total revenue in the second quarter of 2022 ,compared to $36.7 million in the second quarter of 2021, representing a 139% increase. Our peripheral products accounted for $31.9 million of total revenue in the second quarter of 2022 ,compared to $18.8 million in the second quarter of 2021, a 70% increase. In addition, the sales of generators contributed $1 million in revenue in the second quarter of 2022 ,compared to $0.4 million in the second quarter of 2021, 150% increase. Total revenue, excluding the JV initial stocking order was $117.7 million for the second quarter of 2022, a 111% increase in $55.9 million in the second quarter of 2021.\n\nGross profit for the second quarter of 2022 was $104 million ,compared to $46 million in the second quarter of 2021. Gross margin for the second quarter of 2022 was 86% as compared to 82% in the second quarter of 2021. Improvement in gross margin was primarily driven by product mix as well as continued improvements in productivity and process efficiencies. Total operating expenses for the second quarter of 2022 were $74.4 million, a 61% increase from $46.2 million in the second quarter of 2021.\n\nSales and marketing expenses for the second quarter of 2022 were $40.5 million ,compared to $25.7 million in the second quarter of 2021. The increase was primarily driven by sales force expansion. R&D expenses for the second quarter of 2022 were $20.8 million ,compared to $11.8 million in the second quarter of 2021. The increase was primarily driven by headcount growth.\n\nGeneral and administrative expenses for the second quarter of 2022 were $13.2 million ,compared to $8.6 million in the second quarter of 2021. The increase was primarily driven by higher headcount to support the growth of the business. Net income for the second quarter of 2022 was $25.6 million ,compared to a net loss of $0.4 million in the second quarter of 2021. Basic net income per share for the second quarter of 2022 was $0.71.\n\nDiluted net income per share for the second quarter of 2022 was $0.68. We ended the second quarter of 2022 with $224.9 million in cash, cash equivalents and short-term investments. At this point, I'd like to turn the call back to Doug for closing comments.\n\nDoug Godshall -- President and Chief Executive Officer\n\nThank you all for joining us for the call today and for your continued support in Shockwave. We are very proud of the progress we've made and are excited for the things to come for Shockwave, our customers and our investors. With that, we'll open the call to questions. \n\nOperator\n\n[Operator instructions]Our first question comes from the line of Travis Steed of Bank of America. Travis Steed, your line is open.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nIt's an awesome quarter. I think I'll start with op margins, the 24.5% this quarter. Just curious like where you see peak operating margins for this business and like why you can't be there by the end of this year. I don't know if there's anything you want to call out on opex spending or how to think about that going forward or kind of what you're going to do with some of the extra cash, that would be great.\n\nDoug Godshall -- President and Chief Executive Officer\n\nDan, do you want to start?\n\nDan Puckett -- Chief Financial Officer\n\nSure. I'll start. So we've said long term -- at full scale, we're going to be shooting for the upper 20s, lower 30s on operating margin. We definitely had a strong quarter.\n\nIn the near term, we're going to continue to invest in the business, in R&D, sales and marketing. So we're not looking to optimize. We're looking to grow. With that said, we're getting good leverage out of the business.\n\nSo we we're pleased with the performance. Maybe Doug, you can take it from there.\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. No, I agree. We're -- just this morning, we're discussing additional R&D hires. So this enables us to continue to build our R&D portfolio and as best we can parallel process projects instead of working in series as we have traditionally, which will hopefully enable us to be at that sort of two-plus product launches per year and derisk those product launches even more aggressively.\n\nWe look at opportunities outside the company, obviously. But so far, we don't find things that we like more than the opportunities in by the company in terms of how we -- we'd want to be using our cash. So we're -- it's helpful, obviously, to continue to build up cash reserves at this juncture and give us flexibility for how we want to invest and build out the business into the future.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nThat's helpful. I think the follow-up question would just be on the top line, the guidance raise, $12.5 million beat this quarter. I think for the second quarter in all you're beating -- raising guidance by more than a beat. So think about how like the confidence in the coronary versus peripheral business from here giving you the confidence to raise the guidance? And what do you think about like some of the quarter trends, April, May, June, July, kind of love to see how the quarter kind of shipped out.\n\nI know other companies calling out staffing doesn't seem as big of an issue on your end?\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. And I'll tag team with Isaac on this. Obviously, we saw some contrast issues in late April or early May. We think those largely flushed through this quarter -- this past quarter.\n\nAs we said several months ago, we think staffing is sort of the new norm and that it's there's sort of a baseline staffing challenge that we -- that's going to live with us for the foreseeable future. So in January, it was worse because you had COVID plus the staffing shortage. And now it's just sort of tight staffing across the economy.Isaac, maybe you want to touch on coronary peripheral.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nSure. I think the -- consistent with what Doug just said, we feel good about what we're seeing on coronary trends, both internationally and in the U.S. I think the second quarter on international was organically a really strong quarter for us and made us feel good that, yes, I think you're on the right track in Europe and kind of the older Asia businesses. On the peripheral side, we're really pleased with the way the M5+ launch is going, both internationally and in the U.S.\n\nThe product performance is good and the features and benefits are really well received by the customer. So I think we got good continued strength in coronary, nice product launch with M5+ internationally. And then last piece, Travis, just as you know, the kind of reimbursement tailwind we have from the uplift in the abovethe-knee reimbursement in the U.S. this year.\n\nAnd that's not something that just turns on 1 quarter. We get the 1 quarter benefit, but I think our team is just you feel that tailwind behind you as kind of every month and it's building as physicians understand and hospitals understand that this is not -- the above-the-knee Shockwave procedure now is not procedure where they're going to lose money.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nThanks for that. And congrats again on a great quarter.\n\nOperator\n\nOur next question comes from the line of Larry Biegelsen of Wells Fargo. Larry Biegelsen, your line is open.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nGood afternoon. Thanks for taking the question. I'll echo Travis'. Congratulations on another strong quarter here Doug, Isaac and Dan.\n\nSo just to start out, maybe a little bit of color on the Q3, Q4 cadence and what you're assuming is in 2022 for China? And Doug, I'd love to hear some just high-level thoughts from you on 2023 growth drivers, staying away from guidance, but I'm interested to hear what kind of contribution you think Japan and China could have next year?\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. So we -- I'll let Isaac sort of wander to China to include a little bit more detail. we are -- as we just clarified, we are anticipating Japan reimbursement in December, we weren't sure if we get lucky and get it in the September cycle. MHLW is really busy.\n\nSo we didn't get lucky, it will be December. But in a way, that's fine because we're really -- the team in Japan is building both in scale and momentum so that they'll be fully staffed and ready for reimbursement come December so that it will be a full-on 2023 launch. We expect it will be a methodical rollout in Japan, although the nice thing is we've got a lot of KOL engagement now. Everyone will have done their -- the cases that we're allowed to do in the limited launch.\n\nYou have a restricted on how many cases every physician can do during this limited launch phase, so free of charge phase. So we'll be well on our way with the China launch or our JV will be by the time we start launching in Japan. So Japan will be a key growth driver in '23. We'll be fully through our transition from M5 to M5+.\n\nSo that will -- as we build momentum of M5+, we envision that being an important growth driver through 2023 as we'll -- as Isaac described, the sort of what we think will be a multiyear tailwind of uplift in above-the-knee reimbursement. And then thirdly, well -- as fourth if you got China, but really transition that we are making on our U.S. sales team from coronary account acquisition to coronary account penetration. And that's really the driver and the focus now is if you've got one key user at a site, how do you both increase their utilization rate and expand to more users at a site so that you've got everybody firing on all cylinders.\n\nAnd as we look at accounts that are using IVL at the rate that we think is appropriate well above 10%, which is a very, very small number of accounts. It's those where everybody is on sort of the IVL bus and using it as a routine part of their clinical practice on a broad spectrum of their patients. And so that's the real opportunity we have to have coronary be a growth driver once again in 2023 as it has been in '21 and '22. And Isaac, I'll let you sort of add color maybe even on the Q3, Q4 part of Larry's question.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nSure. Larry, so I think Doug hit it well on what the elements of the growth drivers are. And I think importantly, it's multifaceted and just kind of continuing layering in and building on what we've started internationally on multiple fronts. On this year's guidance, Q3, Q4.\n\nQ3 seasonal, it is the lowest procedure quarter of the year for the procedures we're involved in. So we think we'll see a step up Q3 versus Q2, and then Q4 is generally a very strong quarter for the industry. And so we expect again to see a step-up between Q4 and Q3.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nThat's helpful. Just one follow-up. You talked about looking at external opportunities, but you -- I think you said something to the effect, you haven't seen something that's attractive, I can't remember the words you used. But what kind of lens are you looking through when you're evaluating external opportunities.\n\nThanks for taking the questions.\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes, sure. So one of the challenges that external opportunities have as we -- any dollar we spend externally has to be $1 better spent than the internal opportunities that we are resourcing and the -- I think we're probably pushing about 25 internal projects right now, some very exploratory and very different than IVL, some more iterative. So we have a very interesting internal blend of the important performance upgrade kind of projects like M5+ that will refresh the product line, enhance performance and improve customer satisfaction and make it a lot harder for somebody who might show up on the market in whatever a year from now to compete with us with new opportunities that are going to bring incremental patient populations into our fold. So when we look at those opportunities and could spend money on external acquisitions, most of the external acquisitions, they cost more and they don't always have the same certainty that some of our internal ones -- that all of our internal ones.\n\nThat said, we -- Isaac and I both did M&A in our prior lives for multiple years. So we're reasonably familiar with it. And so what's really nice about our current situation as we look at our external opportunities is we're not -- we feel no pressure. We don't feel like we need to do M&A because of the strength of our portfolio, it enables us to be very selective and hopefully steer away from really crowded spaces that are stampeding toward commoditization.\n\nWe like the -- what we've been able to accomplish here in terms of creating a new market with IVL. And obviously, there's a rare opportunity, it would be hard to find another one of these. But we're open-minded, but we also recognize that M&A is a distraction and a lot of times deals don't work. So we want to make sure if we do something that has got a really high likelihood of success.\n\nAnd so we're being thoughtful and careful about doing anything externally that would in any way distract from the mission of hand. And Isaac, I don't know if you want to color on that.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nRight. No, Doug, I think you said exactly what I would say. No color.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nAll right. Thanks for taking the questions, guys.\n\nOperator\n\nOur next question comes from the line of Adam Maeder of Piper Sandler. Adam mater, your line is open.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nCongrats on another really nice quarter, and congrats, Isaac, on the promotion, very well deserved. Maybe just to start with a couple of housekeeping questions. The first is just around pricing. And curious if you're able to kind of provide any color around pricing dynamics for our models in Q2.\n\nI think M5+ carries a premium for U.S. ATK. So just any color there? And then the second question is around the C2+ product. What's the latest update there? Can you remind us if you're in Europe or is that expected to launch shortly? And then remind us on U.S.\n\ntimelines for that technology. And then I had one follow-up.\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. So you're correct. M5+ is selling at a price premium to M5. We anticipate full conversion of M5 to M5+ certainly by this time next year, probably sooner than that.\n\nAnd thus far, all of our products are showing really encouraging price stability, both in the U.S. and internationally. The C2+ is still awaiting MDR approval for a limit to where -- after which we'll start a limited launch in Europe. The -- I think the Europeans are trying to prove how efficient the FDA is because the MDR process is mind numbingly up, too, and expensive.\n\nSo we are -- we keep thinking we're close. And if we're right, this time, then we will be starting a limited launch a couple of months from now. And assuming all goes well, then we'll start working through an FDA process. We want to make sure that we didn't miss anything and that there's no changes we want to make before we get into the U.S.\n\nAnd so that -- the FDA timeline is as yet undefined because we want to make sure we're through the product before we commit to a PMA supplement.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nThat's very helpful, Doug. I appreciate that. And then for the follow-up, I wanted to ask about U.S. peripheral.\n\nI think I heard 35% sequentially quarter over quarter. Can you guys maybe just flesh that out a little bit more in terms of what you saw? How much of that is M5+, how much of that is the reimbursement change, which I know takes a couple of quarters to kind of fully be digested by customers? And then there was some talk about contrast and staffing on the headwind side, but obviously, you guys put up a really nice number. Would just love to hear was that more impactful to the peripheral business versus coronary? Just any additional color on that topic would be great.\n\nDoug Godshall -- President and Chief Executive Officer\n\nSure. You want to take this one, Isaac?\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nSure. The -- we're very pleased with the peripheral business in the U.S. and the work the team is doing to continue growing it. On the second quarter, we still have our below-the-knee product, which continues to grow sequentially.\n\nAnd then with M5, M5+, we saw both a contribution of the ASP increase and the unit volume increasing. So I think the overall kind of stability, durability and growth in that business feels intact to us. And as we go -- as we keep moving forward, I think having the story around what M5+ brings to the table, how that is helping customers who have been using M5 do more and then kind of satisfy some of the requests they've had through our marketing and R&D teams. And that, coupled with the improving economics, it's just going to really help -- help it feel like a business that's going to be a long-term partner for peripheral procedures.\n\nAnd so it's definitely a strong part of the portfolio.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nThat's helpful. And if I could just follow up quick on contrast. I mean, coronary versus peripheral, just any.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nYes, we saw -- I think you saw generally a flattening kind of as we went -- sequentially, April was good relative to March. May, which is usually a very strong month, with sequentially in the U.S. kind of on par with April, and then in June, we saw revenue kind of tick up again sequentially as expected. So I guess -- and it's a guess, so I mean it's hard to kind of parse this out, but peripheral procedures were impacted more.\n\nYou can kind of look at the curves, I think coronary procedures impacted less. But that was generally, I think, behind our team and the hospitals had their kind of had surety to contrast supply for the ones that were using GE by early June. And so it seems like something that was transient in the quarter probably cost a little bit of peripheral revenue, maybe a little coronary, but less than peripheral, but nothing that really punched a hole in the quarter at all.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nThat's great to hear. Thanks for the color.\n\nOperator\n\nOur next question comes from the line of William Plovanic of Canaccord Genuity. William Plovanic, your line is open.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nGreat. Thanks. Good evening. Can you hear me, OK?\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nYup.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nSo first question is just on the guidance, basically, the governors' consensus for the back half of the year is unchanged. And just -- I know people have already asked, but a little color on that. And I think Isaac already gave us a little directional. Is it that Q3 would be up and then Q4 from Q2 and then Q4 up further.\n\nBut in terms of Q4, that would kind of guide to Q4, not really much different than where we are today. Is there something you're seeing that we should be thinking about it? Or should we view this as conservatism? And then I have a couple of follow-up questions.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nYes, you want me to, Doug?\n\nDoug Godshall -- President and Chief Executive Officer\n\nI'm not reading it same way, but yes.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nI follow what you're saying, Bill. We I think the new guidance contemplates not just the first half actuals, including the second quarter beat. But plus consensus, but we moved up above where consensus was in the second half. I don't have your model had -- in front of me right now, but we can definitely look at that with you offline.\n\nI think the -- relative to consensus, we expect Q3 to be above consensus, and we expect Q4 to be above consensus, and we expect both Q3 to be above Q2 and for Q4 to be above Q3. So we're definitely feeling like in the second half that there's -- the tailwind from the first half will continue blowing through the second half, and that's why we're above where consensus was in the second half.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nOK. And then any stocking from China that we should expect in the second, third quarter or fourth quarter?\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nNo, that's done. So with the JV in the second quarter, and this is more of a June event brought in enough coronary and peripheral products that they can feel good about their inventory that they're carrying and then push that into the sales channel. So we think all -- any revenue we get from China in the second half will be organic revenue. It won't be material, kind of a 10% threshold for the business, so we won't call it out, but we just wanted to be clear on the second quarter, third quarter comp that we did define that as stocking revenue because it's relatively large -- quite large compared to any other small stocking order distributors typically do.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nOK. And then on coronary, just -- can you help us, we're, what, 1.5 years into the U.S. launch. And we all went out with our models and expectations.\n\nBut any difference on the usage in moderate or severe any potential updated thoughts on potential TAM increasing or decreasing given all the experience you have at this point. Yes, basically, what have you learned? Do you think this is going to penetrate deeper than the original expectations and what usage look like today?\n\nDoug Godshall -- President and Chief Executive Officer\n\nWe can go back and forth on this, Isaac. I am -- it certainly has been a -- the uptake and speed of uptake has been a real pleasant surprise from -- really from day 1 and continues to be. It's almost impossible for us to know what patient is moderate, what patient is severe. I mean, docs use it when either they're certain they need it or when something else doesn't work and then they bring in Shockwave to sort of successfully finish the case, whether that's a balloon or an atherectomy tool that didn't quite get the job done.\n\nAnd we see a fairly substantial range of utilization rates and the vast majority of our large, large customers are using us sort of less than 5% of the cases and some of our smaller accounts are using us north of 10%. And so there's a huge upside in almost every account, certainly, every count that matters to get anywhere close to what we even what we originally modeled in terms of the utilization rate and penetration. And so we're -- I don't think we've meaningfully altered our view of what the potential and potential TAM is for the opportunity. It's really hard to know, I'd say one thing is certain.\n\nEverybody we talk to tells us they treat a lot more calcified patients than they used to and used to meaning like a decade ago, not three decades ago. And so calcium prevalence is on the upswing, which is certainly timely for the coronary launch.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nYes. And maybe just a little bit more color on that. We have, as you know, Bill, a sales model where we have all of our sales team, from territory managers to the clinical specialists. We have them all pushed -- focused on coronary and peripheral.\n\nSo last year, it was a more heavy focus on the coronary side of the business with M5+ and L6 this year. There's a reasonably heavy focus on the peripheral side of the business. I think the -- so as we go forward, it's important for us to balance all the legs of the stool with the sales force. And if we targeted the sales force, it's something I said only work on that, it would probably grow faster, and we could make a product line go faster, but really, our intention is to grow these things appropriately, keep them balanced, relatively balanced and kind of see the continued growth from increased penetration and what new products can bring in each category and see it over the next three, four, five years.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nOK. And then lastly, if I could squeeze this in. Just the AMA, CPT editorial proposing coronary IVL codes for the agenda for the September meeting. Just any thoughts if you think that coronary specific codes would have higher or lower reimbursement? And what is granted, then what's our granted under the add-on payment today? Thanks for taking my questions.\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. And thanks, Bill. As -- so the -- as everyone knows, the CPT panel process is confidential. So whatever we know, we're not going to talk about other than it is on the agenda.\n\nThe -- and the CPT code for hospital procedures only pertains to physician payment. So certainly, we would be thrilled if there were a Level I CPT code. So physicians might get paid a little bit extra to do an IVL outpatient procedure. I mean right now, I think they get paid something like $60 extra to do atherectomy.\n\nSo it's not a big number that's going to come through. And certainly, it is not a number that will or won't drive adoption of IVL. So it's unrelated to the transitional pass-through and it's unrelated to where we will land in terms of the APC level once the transitional pass-through sunsets in 2024. And certainly, throughout that period of time, CMS will be collecting cost data on Shockwave, on IVL use, and we're confident based on the current APC levels and the cost of the IVL device that will fall into a good APC level once the other side of the transitional pass-through.\n\nAnd that's what will matter a lot more than whether we do or don't have a Level I CPT code for physician payment.\n\nOperator\n\nOur next question comes from the line of Cecilia Furlong of Morgan Stanley. Cecilia Furlong. Your line is open.\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nGreat. Good afternoon and thank you for taking the questions. Congrats on another very strong quarter. I wanted to ask on M5+, specifically utilization in the BTK region? And really what you've seen in early days, just the complementary nature to S4.\n\nAnd as you look out, just how you're thinking about S4, the relative growth versus overall peripheral once you really kind of get fully launched with M5+?\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. So we are seeing M5+ utilization below the knee. It's slightly higher profile than S4, but for any of the proximal lesions below the public deals, it's a very attractive device because of the speed of the pulsing and the longer treatment segment than S4 has. And so we're tracking the smaller sizes, the 35 and 40 that would get you below-the-knee.\n\nAnd so we're counting that as a below-the-knee device, and we're assuming it's being used below-the-knee, although we don't know with certainty where all of the cases are being done. We have so many cases going on now. In terms of S4, it's been a really impressively durable product, I think the way Isaac team worked through sort of balancing the compensation, the commission plan last year to ensure that everyone was selling S4 and M5 and C2 to keep all three products attended to has really paid off by now a continued strength of S4 and continued presence in the below-the-knee segment, which I think further facilitates the introduction of M5+, below-the-knee is because we stayed engaged with below-the-knee, didn't get totally swept into the coronaries and above-the-knee segments. And we continue to reinforce the below-the-knee, above-the-knee, coronary balance through our commission plan.\n\nIt's just that now mfp and S4, the smaller of M5+ and S4 both through count as was the cases of how folks are compensated. And long term, we envision a portfolio below-the-knee products inclusive of S4 and a portfolio of above-the-knee products portfolio of coronary products or multiple products for each, each geography.\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nGreat. And if I could follow up as well, just on China and if you could speak to as you think about just the relative rate of rollout of coronary versus peripheral, how you view the Chinese landscape, just antennas in place versus what we've seen either in Europe or the U.S., either from a reimbursement standpoint, other dynamics that could really push ahead of the other. And thank you for taking the questions.\n\nDoug Godshall -- President and Chief Executive Officer\n\nPleasure, and thanks for the kind words, Isaac I'll let you touch on China.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nSure. Yes, I think China went from a unit split between coronary and peripheral, I think, look similar -- I think, look similar to what we're seeing overall in Europe, and that's -- you've got 70% or 80% coronary and then 20% to 30% peripheral. And depending on the country, kind of that wobbles around a little bit. So it's early in China that I think we'll know a lot more certainly by -- next quarter, but certainly by the end of the year on what the adoption of the above-the-knee -- excuse me, the coronary and the peripheral products look like.\n\nBut our estimate right now is it's probably not too different from the mix we see internationally from a unit base get kind of 20 to 30 versus 70 to 80.\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nThank you for taking the questions.\n\nOperator\n\nOur next question comes from Michael Polark of Wolfe Research. Michael Pollock, your line is open.\n\nMichael Polark -- Wolfe Research -- Analyst\n\nHey. Good afternoon. Can you hear me?\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes.\n\nMichael Polark -- Wolfe Research -- Analyst\n\nOK. thanks. So I'm just curious, I want to double-click on the coronary in the U.S. Again, this transition to going deeper with existing accounts.\n\nI'd love to better understand kind of what the major hook there is. Is it just making sure you're touching all the users at that account. You've been focused on one or two, and there's a handful of others that need the TLC that those key leaders have gotten so far? Or is there an element here where you also need to focus on different case types, different patient profiles where there's been low-hanging fruit picked so far, but some more complicated cases are on the come and your sales force can focus on driving adoption there. Just a little more anecdote and color around what's going to move the needle on this effort over the next year or so?\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. Yes. I mentioned some of the things we're looking at, which is making sure that we're not having a sort of unitary user and driver at a center, but Isaac and his team are really drilling in on this to better understand how we're going to continue to expand and where is it working and where do we have -- which is almost everywhere, where do we have a significant upside opportunity. So Isaac, maybe walk through how you guys are doing this work.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nYes, sure. So I think it's early for this type of work. And the reason I say that is we've anniversaried the launch in March. And then had new payments put in for the hospital, NTAP and the TPT put in after that.\n\nSo I think it's the right time to start looking across our accounts and seeing what behavioral differences there are in terms of utilization. And then why those things occur where we're doing that work now, but it's going to be some mixture of going broader within the physician base at that account and including going broader with nurses and tech so that they understand how to use it, and it's not at all a barrier when the physician calls for Shockwave, and I think we can do that work very well, but that also requires us to focus and decide when and where to focus our teams, particularly the field clinical specialists on that effort and that in contrast to the effort that they would have launching M5+ and teaching that in the accounts, for instance. So that's part of it. I think you're going to see as, again, the reimbursement becomes more and more understood, NTAP and TPT are a little -- it takes a little while to explain those things, especially when you don't start with them, that accounts loosen up a little bit over time.\n\nSo that's going to be part of it and continuing to educate on what the reimbursement situation looks like. And then from a use case standpoint, I think you hit the nail on the head there. There's sort of the most obvious use cases and those get talked about. But as the clinical team and our investigators are going to be publishing what else -- what can we see from, for instance, the OCT data we have from CAT 3 and CAT 4 and what lesions did it work on and which lesions? And how does that compare to what the gestalt is or where it works.\n\nI think we're going to get some tailwind out of this, you can see on the imaging -- intravascular imaging in these cases that it's -- IVL is working very well in cases where maybe a physician didn't think it would work so well and hasn't used it there and then we can go and reinforce that message.\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. I think case point, there is -- coming out of our initial launch in Europe, there was this perception, which turned out to be a misconception that IVL only worked in concentric short lesions didn't work in eccentric lesions. So where the calcium is sort of biased toward one side of the artery. And if you look at our OCT, the more enhanced imaging data that we have, we work astonishingly well across almost every kind of calcium type and leisure morphology as long as there's calcium.\n\nI mean we're a really nice balloon if you don't have calcium, but probably a little too much tech, but we've -- ever since we've got that OCT data last year, it's been -- one of our main education points is to drive to the understanding that we -- our outcomes are almost identical eccentric versus concentric. And so getting -- preventing ourselves from being pigeonholed into, well, I'm just going to save IVL for this one specific use case, I think, is one of the most important undertakings we'll have going forward is to continue to build out the understanding that don't just use us for that concentric lesion or don't just use us for an under expanded stent, which is where you maybe use us there's a broad array of use cases, concentric, eccentric, long, short, etc., where -- I mean, the beauty of our devices sort of consistency, safety, ease of use across calcified lesion subsets.\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nI think just one other point on that. That will take some time to do. And the reason is because we want to make sure that the data are there to support what we're saying. More importantly, that physicians who have done those cases believe the data because it's consistent with their anecdotal experience.\n\nAnd then the peer-to-peer aspect of that in conjunction with a company rep saying something, then having that peer-to-peer aspect where physicians they respect are saying that too. That takes time, but it's the right work to be doing, and we're happy to be doing it.\n\nMichael Polark -- Wolfe Research -- Analyst\n\nJust a follow-up on this, and Doug, you already asked this question. I'll just be little more precise, I have U.S. coronary procedures in the quarter about $15,000, $60,000 a year type of run rate. The TAM kind of worked up here has been over the midterm potentially 100,000, 200,000, if not 300,000 procedures available to IVL.\n\nI mean are those still the right numbers to think about sitting here running at 60,000 a year. It's still a product in the U.S. that can be at least 100, if not a couple of hundred over the next, say, five years?\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes, I think we have to continue to -- if we rest on our laurels and are still selling the currency to four years from now, then probably not. We have to make it work better, add features, refresh it, just like we do with M5+ come up with new versions. And yes, I think it's not on -- I think most physicians would say at least 15% of their cases ought to be getting some sort of calcium modification. So that gives you about 150,000 cases.\n\nIf -- as they think about it, they'll start drifting into maybe it's more like 20%, 20-plus percent. But I think we've got to continue to strive to make our product better with regularity so that they're eager to use it more often. Current product is really good. I think we can make it even better.\n\nMichael Polark -- Wolfe Research -- Analyst\n\nOK.\n\nOperator\n\n[Operator signoff]\n\nDoug Godshall -- President and Chief Executive Officer\n\nThanks, everybody, for your time.\n\nDuration: 0 minutes\n\nDebbie Kaster -- Vice President, Investor Relations\n\nDoug Godshall -- President and Chief Executive Officer\n\nIsaac Zacharias -- President and Chief Commercial Officer\n\nDan Puckett -- Chief Financial Officer\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nMichael Polark -- Wolfe Research -- Analyst\n\nMore SWAV analysis\n\nAll earnings call transcripts"
}