{
  "companyName": "Live Oak Bancshares",
  "companyTicker": "LOB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/live-oak-bancshares-lob-q3-2022-earnings-call-tran/",
  "content": "Live Oak Bancshares (LOB -4.00%)\nQ3 2022 Earnings Call\nOct 27, 2022, 9:00 a.m. ET\n\nOperator\n\nThank you for standing by, and welcome to Live Oak Bancshares third quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. [Operator instructions] I would now like to hand the conference over to general counsel and chief risk officer at Live Oak Bank, Greg Seward.\n\nGreg Seward -- Chief Risk Officer and General Counsel\n\nThank you, and good morning, everyone. Welcome to Live Oak's third quarter 2022 earnings conference call. We are webcasting live over the Internet, and this call is being recorded. To access the call over the Internet and review the presentation materials that we will reference on the call, please visit our website at investor.liveoakbank.com and go to today's call on our event calendar for supporting materials.\n\nOur third quarter earnings release is also available on our website. Before we get started, I would like to caution you that we may make forward-looking statements during today's call that are subject to risks and uncertainties. Factors that may cause actual results to differ materially from our expectations are detailed in the materials accompanying this call and in our SEC filings. We do not undertake to update the forward-looking statements to reflect the impact of circumstances or events that may arise after the date of today's call.\n\nInformation about any non-GAAP financial measures referenced, including reconciliation of those measures to GAAP measures, can also be found in our SEC filings and in the presentation materials. I will now turn the call over to James Mahan, our chairman and chief executive officer.\n\nChip Mahan\n\nThanks, Greg, and good morning all. I will kick off today's earnings call describing how we think about capital and a potentially declining economy, followed by BJ on results, and we'll close with Huntley describing how we operate the business and where we are going. Let's move to the next slide. Here are some household names indicating a recession may be around the corner.\n\nBezos says batten down the hatches. Goldman's CEO says there's a good chance for a recession. And Jamie Dimon says, a recession is likely in the next six to nine months. Next slide.\n\nCertainly, the world is not coming to an end. It is our belief that capital is king in any environment. Therefore, a properly managed balance sheet yields a flight to quality for our customers, our folks and you, our shareholders. None of us has a crystal ball.\n\nThere is little doubt that uncertainty is everywhere from runaway inflation to higher interest rates to an unsettling political environment, and we could go on and on. The truth is we operate one of the most highly leveraged, highly regulated businesses on the planet. In the baseball business, batting 400 gets you to in the hall of fame. Making 60% of your shots in basketball does the same thing.\n\nIn our business, making good loans over 99% of the time is essential. Let's talk about recessions on the next slide. Reflecting on the recessions that I have lived through, one glaringly comes to mind, and that is the third from the bottom, the recession in the early 2000s. I had started an Internet banking software company in the late '90s, and I was sitting on the runway at Atlanta's Hartsfield Airport, enroute to meet with the senior management team at the ABN AMRO Bank in Amsterdam.\n\nWe were No. 25 for takeoff. My company's market cap was higher than Delta's, and we were losing $60 million a year. How could that possibly be? I met with the ABN AMRO team at the airport for an hour, took the same plane back to Atlanta and called an emergency board meeting.\n\nIn the next several weeks, we raised over $300 million from our customers that were using our software and not from Wall Street, then the dotcom crash. Without that capital, I'm not sure the company would have survived. Recessions provide lessons learned. We are often asked how will your small business customers handle the downturn? How will your origination engine operate? If the past is a proxy for the future, how have we managed your balance sheet these past 14 years? Let's take a look at that on the next slide.\n\nOrganic growth in our equity account is accelerating. So let me unpack this slide for you a bit. If you'll follow the blue boxes above the timeline, you can see that since inception, we have grown considerably while absorbing little dilution. The bank was capitalized in 2008 with $13 million.\n\nShortly thereafter, we issued $5 million in preferred stock, followed by the sale of 24.9% of the business in 2014 to Wellington Asset Management, while we converted from an S to a C corp. A $50 million dividend was paid to the original shareholders, thereby recouping their original investment plus some. We then took the company public in the summer of 2015 and completed a secondary offering in the fall of '17. Along the way, we created Encino and spun off its 65% ownership in the early days to existing shareholders.\n\nFrom inception, we have raised $243 million, and the shareholders' equity at the end of Q3 was a little over $800 million. Note the blue line from our fintech investments had a great deal to do with our non-dilutive capital generation. So let's examine that on the next slide. Here's a bit more color on our fintech profits.\n\nSince 2015, we have invested $52 million in all companies noted above. We have received $163 million in cash from the exits of Finxact and Payrails and the sale of $15 million of Greenlight shares at a cost basis of $1 million. In addition, the value of all other private companies totaled $158 million based on the last round of financing. We are confident of investor support at those levels, notwithstanding current market conditions.\n\nMoving on to the next slide. Just as we did last quarter, we would like to reiterate just how good we are at lending to small businesses. The average charge-off ratio for other SBA lenders is over 13x hours, while 66% of the $20 billion in loans we have originated since inception have been within the SBA 7(a) program. So if we have proven that we can grow the business organically in a unique way, are there other arrows in our quiver, if economic challenges arrive? Let's move to the capital side.\n\nThe conservative nature of this slide goes beyond the Tier 1 capital ratio of 13.2%. Our adjusted capital ratio, which equals Tier 1 capital plus allowance for credit losses plus the fair value mark divided by our unguaranteed loan exposure equals an unprecedented 22.9%. The addition of implied pre-tax value of fintech investments mark-to-market adds another $158 million to the frenzy. While SBA premiums have declined, our mark-to-market profit on our guaranteed portfolio has historically been in excess of $100 million.\n\nExcess capital is freedom and flexibility. Let's move to the continuum cycle. Next slide. So what does all this mean? First of all, there is no evidence of a recession yet, we are loitering in the first column.\n\nIf the downturn occurs and credit losses begin, bank credit officers typically react and underwriting guidelines change dramatically. This has always created an enormous opportunity for us to not only stand by our existing customers but allows us to actively seek new opportunities as the competition pulls back. Again, if any of this occurs, there will be a flight to quality, and we will be in the thick of it. BJ, let's talk results.\n\nBJ Losch -- Chief Financial Officer\n\nExcellent. Thanks, Chip. Good morning, everybody. We'll start with quarter highlights on slide 13.\n\nAs you can see, our earnings per share were $0.96, driven by strong net interest income and loan growth, which we'll talk about a little bit more. And of course, the previously announced Payrail gain. Net interest margin of $3.84 held up very well again in the quarter, declining just five basis points from the second quarter despite 150 basis points of rate hikes during the third quarter. Our net interest income growth, you'll see is up 26% year over year on 23% loan growth.\n\nLoan production, again, changed $1 billion and pipelines are still near all-time highs and credit quality remains quite strong despite the uncertainty of the economic outlook. Our core business performance, along with continued success with our ventures investing, as Chip highlighted, continues to add significant tangible book value per share at 15% year over year. Turning to slide 14. You see our adjusted results and the notable items that make up those adjustments.\n\nThe biggest which, of course, is the Payrails gain. Another one I'll quickly highlight is the renewable energy tax credit impairment as we've had a few of these over the last several quarters. These investments are a good thing and a net positive. When we make these investments, the accounting treatment is to impair a substantial portion of it immediately, which flows through the expense line.\n\nThis is more than offset by a larger reduction to our tax expense and effective tax rate over the course of the same year. That is why we adjust out the expense when looking at adjusted PPNR or pre-tax earnings and also while our effective tax rate is lower than statutory rates. We'll continue to have more of these investments from time to time, including one in the fourth quarter that we currently estimate to be about $12 million. Adjusted PPNR was up 21% due to strong net interest income growth of 5% linked quarter and higher fee income driven by $9 million of gain on sale income versus $5 million in Q2, which more than offset continued investment in people and technology.\n\nAs I said earlier, credit remains quite healthy. while our allowance for credit loss reserve coverage stayed steady overall at 123 basis points, net charge-offs were actually lower in the quarter to only $1.7 million. Provision was up quarter-to-quarter due to strong loan growth, along with portfolio and macroeconomic changes as we proactively look ahead to a potentially less benign credit environment. Breaking down the components of revenue on slide 15.\n\nYou'll see total revenue growth up 12% year over year despite significantly lower gain on sale income, thanks to 26% year over year growth in net interest income. As we discussed on last quarter's call, we've seen secondary market dynamics for guaranteed level sales shifting rapidly due to the current aggressive Fed rate tightening cycle. As you know, we moderated sales in the second quarter. And this quarter, we saw modestly better opportunities in SBA variable rate sales, but the market for fixed rate sales remains unattractive.\n\nAgain, it's important to understand that this income is not permanently lost. We simply earn it over time in the form of spread income as evidenced by our strong loan and net interest income growth. Because of the flexibility we have with strong capital and liquidity levels, we are more than happy to hold more high-quality assets and will remain patient with secondary market sales until further normalization. Turning to slide 16.\n\nYou'll see our loan originations remain diverse across our multiple verticals with particular strength in both some of our most established small business verticals such as vets, investment advisors and agriculture and in some newer verticals such as our SBA General Lending Group and our middle-market sponsor finance group. In Energy & Infrastructure, solar remains quite strong, and while bioenergy lending is down from last year, both of these should benefit significantly going forward due to the clean energy incentives in the recently passed inflation Reduction Act. Balance sheet trends look great as discussed on slide 17 and 18. And as you can see on slide 19, and as I mentioned earlier, the net interest margin again held strong at 384.\n\nAnd while we still expect some compression as the Fed continues to raise rates rapidly, we continue to be encouraged by the resiliency of the margin. Our lenders have done a great job adjusting loan pricing upwards with market funding costs, and our deposits team has continued to fund our growth with disciplined yet competitive pricing with betas remaining just under our assumed range of 70%. Turning to expenses on slide 20. We've been incredibly pleased with the quality of talent that has joined Live Oak in our various groups across the company.\n\nGoing forward, while our need for talent will continue as we grow, we've largely worked through our hiring bubble to rightsize our lender support to accommodate our significant step-up in production post pandemic. And in addition, as we have discussed, we accelerated our technology hiring this year, thanks to the Finxact gain. That is also largely complete. Going forward, we will continue to be opportunistic on hiring, particularly for revenue producers but we expect to see our expense growth moderate into 2023.\n\nCredit trends, as I discussed on slide 21 look great, having 43% of your total loan portfolio government guaranteed is both a great comfort and a great responsibility that we take very seriously. Nonaccruals and past dues remain at historic lows, as do net charge-offs. But we know there's clouds on the horizon. So we'll continue to be proactive with our outreach to existing customers.\n\nWe have strict well-established concentration limits for higher risk portfolios and verticals, and we're doing stress testing on those portfolios with various recession scenarios to anticipate impacts. Set a recap, production top to billion, pipelines are strong. Balance sheet is profitable and growing. Guaranteed loan sales opportunities are modestly improved, but still muted.\n\nExpense growth is moderating, Credit quality is great, and our ventures investments have and should continue to provide us with organic capital and optionality. So with that, I'll turn it over to Huntley for some additional color on the business.\n\nHuntley Garriott -- President, Live Oak Bank\n\n Thanks, BJ. I'm going to wrap up today by focusing on three questions. The first is how our small businesses are doing overall. The second is what's the opportunity for us at Live Oak to serve them.\n\nAnd then, third, what are we doing to address that? We get a lot of questions about the overall health of small business given where we sit. And three years ago, we started a quarterly survey of small businesses, along with Barlow Associates. Its one of the preeminent research firms serving small businesses. And we wanted to share a bit of information from their most recent survey to give you a sense of how small businesses are feeling, but also it indicates some of the opportunities that we have to serve them.\n\nPeople say that we're at the tip of the spear as it relates to small business in America. And if that's the case, so far, small businesses are waging a pretty impressive battle. So on page 23, you can see the overall sentiment certainly has deteriorated, which shouldn't come as any surprise. Although interestingly, it looks as if views on the economy may have bottomed out recently, although they still remain decidedly negative.\n\nExpectations of the financial performance of companies have also deteriorated but remain more positive than views of the overall economy. It's clear that the majority of small businesses expect a slowdown and are positioning themselves for a weakening economy. And that's still in contrast, as Chip and BJ referenced, with our current credit performance, which remains outstanding. Looking at the right-hand side of this page, we see that only 20% of the surveyed small businesses applied for credit in the past year.\n\nAnd if you drill down a layer deeper into that data, you'll see that the majority of those that applied apply for working capital, not the growth capital that we typically provide. So the opportunity for us to serve small businesses with working capital products and deposits can dramatically expand our addressable market. You've likely heard the term 'silver tsunami' to reference the generational shift among small business owners occurring in the U.S. On the bottom right, you can see that almost one-third of small business owners expect to transition ownership of their company in the next five years.\n\nThese change of control transactions are right in our wheelhouse, both for lending, but also an opportunity to change primary banking relationships. And while the uncertainty in the economy and volatility in the market has put some of these transactions on hold, we believe the overall macro trend of small business acquisitions will continue to provide us significant opportunities. Anecdotally, across our portfolio, we hear a consistent set of concerns, labor markets, inflation, supply chain being at the top of the list. And while we see overall sentiment more cautiously, we also witness every day the resiliency and entrepreneurial spirit of our small business owners as they navigate this cycle.\n\nSo what's the opportunity for us? Turning to page 24. The SBA data says there's 32 million small businesses in the U.S. But we know the majority of these are very small solopreneur businesses. We look at our primary market as the roughly 6 million small businesses in the U.S.\n\nthat have between 200 and 500 employees, which generate, on average, $100,000 to $10 million of revenue each. Currently, across our small business lending, our savings and our new checking businesses, we serve about 17,000 small business customers. So you can see our market share is pretty tiny. And if you add to that, very few of our customers, who we actually have multiple products with, are repeat customers.\n\nAnd you can see that despite being pretty good at what we do, we still have a lot of runway to better serve small businesses and deepen these relationships. So what are we doing to address this? On slide 25, first and foremost, we continue to invest in our lending franchise. Over 15 years, we've built a small business lending platform that effectively marries great people and great technology, and we continue to work to improve that every day. You've seen over the last year, expense growth related to hiring, not only in new lenders but also in folks needed to support the process.\n\nAnd while we still will be opportunistic on new hires, we're in a really good place overall. And you can see the production numbers and our pipelines reflect that. You'll also see that headcount and expense growth, as BJ mentioned, are going to slow down into next year. We're also in the process of finalizing the migration to a new loan origination platform, still leveraging Salesforce and nCino, but with some pretty high-powered enhancements that we've built in-house.\n\nThe new platform is designed to further reduce application to funding cycle time, improve efficiency and deliver a best-in-class portal for our customers and partners. We're already observing some enhancements in key areas, and we're excited about what we can accomplish on modern architecture. The timing of this couldn't be better as it allows us to better react to potential changes in the SBA programs that are being contemplated. Turning to the deposit side.\n\nWe're particularly excited about the success we've had generating business savings in CDs. With over 10,000 customers now and over $1.8 billion in deposits, it's becoming an increasingly important part of our funding at almost 30% of our total deposits, but also a critical component of our customer acquisition strategy. As we introduce more products and services, we have a growing base of customers to better serve. So the wait is finally over.\n\nWe officially have a checking account in the market. This product offers balance protection, improved account funding, next-gen bill pay and QuickBooks integration among other features. And our marketing efforts have really just started, but we're seeing, on average, 40 to 50 new accounts a day, and we currently sit at over 1,300 accounts and about $10 million in balances. So we're off to a good start.\n\nWhile this product serves a smaller end of the small business market, our next milestone is to deliver a treasury management product, which we expect in Q1, that will allow us to serve the upper end of our customer base as well. We're also excited about the start of our first specialty deposit vertical, serving 1031 exchanges, and we ended the quarter with about $60 million in checking balances, and we're actually close to $100 million already as we move into the fourth quarter. So a couple of big wins on the technology front, but we're certainly not slowing down, bringing our entire platform together on modern architecture anchored by our modern Finxact core remains our top priority. We believe that will open up incredible opportunities for us in areas like embedded banking, customer insights and payments.\n\nIn the short term, we'll continue to deliver treasury management capabilities, working capital solutions and our initial embedded banking partnerships. So where does that leave us. On page 26, I think BJ summed this up well. Our lending platform is solid.\n\nCredit quality is excellent, although we remain vigilant and are certainly not declaring victory. Secondary markets are strong enough to support our balance sheet. We remain a premier destination to work in both banking and in financial technology. Deposit businesses are starting to yield tangible results, and we remain confident in our technology strategy, both on the investing and the software development front as we continue to build the small business bank in the future.\n\nSo with that, let's move to questions.\n\nOperator\n\n[Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from the line of Stephen Alexopoulos of J.P. Morgan. Your line is open, Steven.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nHey, good morning, everyone. I want to start first on the cost of deposits. If we look at the cost of interest-bearing deposits, it is around 1.5% in the quarter. If we look at your online rates, it looks like it's between 2.75%, 3.75%.\n\nSo first, how quick does the overall cost of interest-bearing deposits move into that range? And do you expect more incremental funding to come from the online savings, right, which is the lower end, or more from CDs, which is the upper end?\n\nBJ Losch -- Chief Financial Officer\n\nSteve, it's BJ. So, our team has really done a great job managing deposit rates up through this point. It started off slow in terms of beta as we all would have imagined, but it's significantly heated up probably in the last four quarters. What helped in terms of our overall deposit costs, both last quarter and this quarter is that a lot of the big moves in rates from the Fed happened toward the latter part of the quarter, which meant that there wasn't nearly as big of an impact on the overall portfolio in the quarter as you would have expected.\n\nI think now with the Fed moving earlier in the quarter, going into the fourth, as well as what they did in the third, you're going to start to see our portfolio costs move more toward where our spot rates are today. In terms of the mix, we still believe that savings is really where we're seeing most of the volume. We have had and tried some attractive offers more in the 12 to 24 month range on the CD side, but there just hasn't been a lot of appetite for that, given how rapidly online savings rates have been going up. So we certainly expect deposit cost to continue to rise, but on the left side of the balance sheet, loan yields, we are very, very pleased with what our lending officers have been able to do to adjust quickly.\n\nWe're seeing loan yields really start to move. October 1st was a big deal for us because that's when our quarterly adjusting loans, of which we have quite a bit, adjust up 150 basis points. So our loan yields are keeping up with our deposit costs growing, and that's why we've been able to do such a good job on holding the net interest margin, and we expect that to continue.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nSo BJ, if we stay with that, previously, we talked about on these calls, 350, 375 NIM for the fourth quarter. How are you trending in that range? And can you frame for us what 2023 could look like? Where could NIM bottom?\n\nBJ Losch -- Chief Financial Officer\n\nYes. So as we said last quarter, I expect it more to be at the higher end of the range. I still feel very good about that based on, again, what I just talked about a little bit. As rates -- as the Fed stops, its tightening cycle or at least slows it down significantly, we think that our net interest margin starts to stabilize as well.\n\nAnd again, because we're cycling through and readjusting our loan yields, in particular, to the market and funding costs, we think the margin stabilizes into 2023, depending on when the Fed stops raising rates, we could start to see it modestly moving up again.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nGot you. OK. And then, finally for me on the expenses, just following up on that slide indicating that spending requirements are moderating a bit. I mean, the growth rate has been very elevated on expenses.\n\nCan you help us think about what's a reasonable growth rate of expenses from here?\n\nBJ Losch -- Chief Financial Officer\n\nYes. So if you look at adjusted expenses up 30% year over year because of our bubble. I think that should come down by at least 25%, if not more, in terms of the rate of growth. And so, we still see very healthy revenue growth, both from net interest income, as we just talked about.\n\nBut then into 2023, starting to see further normalization on the gain on sale. So strong revenue is far outpacing the expense, but the expense will moderate.\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nOK. Thanks for taking my questions.\n\nOperator\n\nThank you. Our next question comes from the line of Crispin Love of Piper Sandler. Your line is open, Crispin Love.\n\nCrispin Love -- Piper Sandler -- Analyst\n\nThanks. Good morning, everyone.First, on the venture portfolio. You've had some nice exits from M&A year-to-date. But I'm just curious how you're looking at the full portfolio.\n\nChip, you made some comments earlier in the call to make it seem like you're confident in the current valuation there. So I'm just curious for the key reasons for that as VC-backed companies broadly are seeing lower valuations and less activity there?\n\nChip Mahan\n\nSo Neil Underwood has joined us on the call and Neil just got back from Money 2020 for four days' worth of what is the current state of the FinTech business. I think my comments, Neil, to turn this over to you, are more about how well we know these companies, how will we know the other investors on those boards and how they seem to be, at least from my perspective, recently, very supportive of the current, and some of these valuations are as much as a year old. So why don't you take that and maybe say a word about the future.\n\nNeil Underwood -- President, Live Oak Bancshares\n\nSure. First of all, the reason we were out there, as you guys know, Canopy and Live Oak Ventures or two of our investment vehicles and filling the top of funnel for Live Oak Ventures is equally as important to -- as looking at expanding Canopy. And so, when you look at Live Oak Ventures, I think Chip nailed it, it's really the quality of the investors around the table and the timing for which we got into these investments. Many of these investments we've gotten into many, many years ago.\n\nAnd the last valuations can actually stand up. Clearly, there has been a discount across the board on mostly, what we see are mostly of the B2C, the heavy, heavy discounts. If you recall, our strategy is around B2B selling to banks, bank infrastructure, payments, tech and so forth, which has held up pretty strong from a revenue perspective and a growth perspective.\n\nCrispin Love -- Piper Sandler -- Analyst\n\nThanks, Chip and Neil. I appreciate the color there. And then, just one more on the interest-bearing deposits. BJ, are you able to give any color on what spot rates currently are for deposits?\n\nBJ Losch -- Chief Financial Officer\n\nYou mean just what savings rates are and those types of things.\n\nCrispin Love -- Piper Sandler -- Analyst\n\nYes, exactly. Kind of like what you're seeing right now.\n\nBJ Losch -- Chief Financial Officer\n\nYes. So really, where we're at in terms of online deposit rates for savings is more in the 2.25% range is what we're seeing for the more established online banks moving up pretty quickly. I think today, actually, it's higher after our recent moves. So it's 2.75% today, APY, and that's kind of where some of the largest online players are and one-year CD rates more in the 3.75% range.\n\nCrispin Love -- Piper Sandler -- Analyst\n\nAll right. Thank you. I appreciate you taking my questions.\n\nOperator\n\nThank you. Our next question comes from Michael Perito of KBW. Your line is open.\n\nMichael Perito -- Keefe, Bruyette and Woods -- Analyst\n\nHey, good morning. Thanks for taking my questions. I wanted to start on the business second launch. So the customers are already up to 1,300.\n\nIt sounds like from the 70, 75 at the end of the quarter. I mean, do you guys have a sense of like what the average balances on these deposits that are coming over as we try to type of frame a growth opportunity here over a realistic time period?\n\nHuntley Garriott -- President, Live Oak Bank\n\nYes, Mike, sure. So we've got about $10 million in balance across 1,300 accounts. So they're in the $5,000 to $10,000. The majority of them are in the $5,000 to $10,000 range.\n\nSo like we said, the smaller end of small business right now. And that's what we're seeing. I think as we go to market, ideally start to push up a bit with that. But like we said on the call, this product doesn't have the treasury management capabilities some of the largest small businesses need, and we'll be coming at that end of the market in the first quarter, which we think is where we'll get to some of the more significant balances in the market.\n\nMichael Perito -- Keefe, Bruyette and Woods -- Analyst\n\nDid the marketing like kind of branding and sales effort need to change at all as you try to make that transition? Or is it pretty consistent across both customer bases, it's more just the product capability that needs to evolve as you target the bigger businesses.\n\nHuntley Garriott -- President, Live Oak Bank\n\nYes. I mean, look, the marketing itself is pretty consistent across our brand and who we serve. In certain verticals, we'll be able to go a lot deeper with a broader product set and do some more targeted marketing and sort of building out these community banks in some of these verticals that we've spoken of. What we have now is a more, call it, a mass market, small business product, and we're kind of marketing that accordingly.\n\nMichael Perito -- Keefe, Bruyette and Woods -- Analyst\n\nOK. And then, the 1031 exchange balances, the $60 million, are there any other verticals that could become upsize that are on your radar that you can share with us at this point? And then just secondly, kind of as a backup to that, just on the embedded finance side. Any timing updates on whenn you think those numbers could start to really maybe impact the NIM and the financials a bit more, the growth opportunity there, rather?\n\nHuntley Garriott -- President, Live Oak Bank\n\nSure. So on the specialty deposit side, we are looking at a handful of them. The HOA space is one that we spend a fair amount of time on. And I think it's obviously a reasonably competitive marketplace but trying to figure out exactly where our niche could be and where we can differentiate ourselves and have some ideas there, we've been spending some time on.\n\nSo that's probably the one that's the next, the closest behind 1031, and it actually dovetails into some of the work we're doing in embedded banking where, looking at areas where software providers in a space may lead us to deposit opportunities in some specific industries that maybe we're not in so far. And I think HLA can be a nice example of that, for an example. We should have pilots. We're in pilots now.\n\nWe've got a couple of small ones that are up and running. But we think it's going to be into next year before we really start to see embedded banking numbers that move the needle on our balance sheet.\n\nMichael Perito -- Keefe, Bruyette and Woods -- Analyst\n\nAnd not to put you guys on the spot but let me asking Steve's question in a different way here. I mean, what do you guys think. Obviously, your noninterest-bearing mix is below where you'd like it to be, right? I mean are you guys thinking at all about where you think that mix can move next year? Or is there any kind of framework or guide rails around that you think that's reasonable that we should be thinking about? As you kind of like take everything you just said together, Huntley and think about all the growth opportunities cumulatively?\n\nBJ Losch -- Chief Financial Officer\n\nYes. So I think we sit today at maybe 3% of our deposit mix in noninterest-bearing, which is negligible. Next year, it moves up modestly, but not meaningfully, maybe a couple of percentage points. But I think if we're sitting here five years from now, it's probably 10 times the size in terms of mix that we're at today.\n\nSo I think what Huntley just talked about with our title mass market, small business type products rolling out early next quarter, our larger treasury management offering and then embedded, I really think that by the end of 2023, you'll really start to see some momentum, particularly from the first two. And then, embedded as it layers in over the next 12, 24, 36 months really driving our future growth and that shift in mix.\n\nMichael Perito -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. And then, just lastly for me, maybe a question for Chip. But just from a high level, right, I mean, if you think about the second, third quarter, hopefully, we're in the last quarter of who knows what 2023 has in store, but the last quarter of the 75 basis point Fed hikes as we move toward the end of the year here. Just curious how you guys, as we think about next year and kind of where the margin environment is, hopefully, a stabilization in the SBA secondary market once we're through these massive Fed hikes, I mean, any updated thoughts on the balance between selling and holding loans as we look to next year? Because it's been a little choppier on a percentage basis recently just because of the environment.\n\nJust curious if there have any updated thoughts there that we should be mindful of?\n\nChip Mahan\n\nSo I'll start that, and you guys can add to that. I mean, I think what we have talked to our lending officers about. And remember, our lending officer base is expanding daily. I mean we've added, what, 12 or 15 lending officers just this year, primarily in the SBA area.\n\nAnd certainly, the secondary market for fixed rate SBA paper has been a blood bath and a disaster recently. And so, our lending officers are now being quite successful on the variable rate side because there are a number of borrowers out there that are saying, like, this thing may turn. Maybe I should not take an 8% 25-year fixed rate, maybe ought to get a low floater here. And then, the prices for those loans in the SBA second day market have held up and are coming back quite nicely.\n\nSo I think we're seeing more lending officers being more aggressive on, a bit lower, right? Not two or two and a half over prime, but something slightly less than that. And I think we'll see that continue over the next several quarters. And you guys may want to add to that.\n\nBJ Losch -- Chief Financial Officer\n\nYes. As a matter of fact, Chip, to your point, over the last three quarters, we've seen our percentage of variable rate production double over the last three quarters. So I think, yes, there was a lot of demand for fixed and fixed adjusting production. But to your point, customers are starting to maybe see the crest.\n\nOur lenders are doing an excellent job providing customers options. And many times, the customer wants the variable rate option because near term, the rate is lower, and they also think that it could float down over the course or the term of the loan. So all of that, I think, is pretty good. On broadly, just thinking about our gain on sale income and mix, though we didn't necessarily want the tightening cycle to happen like it did, we've gone from maybe 15% to as much as 20% of our income in any given quarter being gain on sale to down to about 6% to 8%.\n\nWe've been intentionally moving that down as we've originated to hold more. But this has given us a step-down opportunity, if you will, to kind of reset the base and then be a lot more thoughtful about what we keep and what we sell and, quite frankly, give us a lot more flexibility going forward to maximize our gain on sale across our different portfolios. So I think that's going to help us in terms of more consistent earnings going forward.\n\nMichael Perito -- Keefe, Bruyette and Woods -- Analyst\n\nAwesome. Thank you guys for taking my questions. I appreciate that.\n\nBJ Losch -- Chief Financial Officer\n\nMike, Thank you.\n\nOperator\n\nAt this time, I'd like to turn the call back over to CEO James Mahan for closing remarks. Sir?\n\nChip Mahan\n\nThanks to everyone for joining this morning's call. And as always, we'll see you in 90 days.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGreg Seward -- Chief Risk Officer and General Counsel\n\nChip Mahan\n\nBJ Losch -- Chief Financial Officer\n\nHuntley Garriott -- President, Live Oak Bank\n\nSteven Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nCrispin Love -- Piper Sandler -- Analyst\n\nNeil Underwood -- President, Live Oak Bancshares\n\nMichael Perito -- Keefe, Bruyette and Woods -- Analyst\n\nMore LOB analysis\n\nAll earnings call transcripts"
}