{
  "companyName": "Stoneco LTD",
  "companyTicker": "STNE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/19/stoneco-ltd-stne-q2-2022-earnings-call-transcript/",
  "content": "Stoneco LTD (STNE -0.63%)\nQ2 2022 Earnings Call\nAug 18, 2022, 5:00 p.m. ET\n\nOperator\n\nGood evening, ladies and gentlemen. Thank you for standing by. Welcome to the StoneCo second quarter 2022 earnings conference call. By now, everyone should have access to our earnings release.\n\nThe company also posted a presentation to go along with this call. All material can be found at www.Stone.com on the investor relations section. Throughout this conference call, the company will be presenting non-IFRS financial information, including adjusted net income and adjusted free cash flow. These are important financial measures for the company, but are not financial measures as defined by IFRS.\n\nReconciliations of the company's IFRS financial information to the IFRS financial information appears in today's press release. Finally, before we begin our formal remarks, I would like to remind everyone that today's discussion might include forward-looking statements. These forward-looking statements are not guarantees of future performance, and, therefore, you should not place undue reliance on. These statements are subject to numerous risks and uncertainties that could cause actual results to differ materially from the company's expectations.\n\nPlease refer to the forward-looking statements disclosure in the company's earnings press release. In addition, many of the risks regarding the businesses are disclosed in the company's Form 20-F filed with the Securities and Exchange Commission, which is available at www.sec.gov. I'd now like to turn the conference over to your host Rafael Martins, VP of finance and investor relations at StoneCo. Please go ahead.\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nThank you, operator. And good evening, everyone. Joining us today on the call, we have our CEO, Thiago Piau; and our chief strategy officer, Lia Matos. Today, we will present our second quarter 2022 results, discuss some recent trends, and provide an updated outlook for our business.\n\nI will now pass it over to Thiago so he can share some highlights of our performance. Thiago?\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Rafa, and good evening, everyone. In the second quarter, we demonstrated consistent execution, combining strong growth with improving profitability. We produced a strong performance in both TPV and revenue growth while improving our operating margins in both of our segments. We achieved total revenue of 2.3 billion reais, which was 5% above our guidance and up 83% year over year, excluding the negative revenue impact from the credit product in the second quarter '21 in pro forma for Linx.\n\nOn the profitability front, our adjusted EBT margins increased sequentially from 4% in the first quarter to 4.6% in the second quarter, driven by improved operating efficiency in our financial service and in our software businesses. As we noted previously, following the partial sale of our stake in Banco Inter, we decided to stop adjusting the bond financial expenses in order to result from the second quarter onwards. As a result, our adjusted EBT in the second quarter reached 107 billion reais, 19% higher than our guidance of over 90 million reais. In our financial services segment, we were especially encouraged by five factors: first, the strong evolution of our payments client base, which crossed the 2 million mark with an acceleration of net adds in the quarter; second, the strong MSMB TPV group of 78% year over year, driven by both our active client base growth and a continued improvement in go-to-market strategy for TON and Stone product; third, we were able to continue increasing our take rate while we increase our average TPV for both Stone and TON products sequentially; fourth, the expansion of our banking platform, generating more engagement and increasing opportunity to monetize clients in the future; and finally, efficiency gains in costs and expenses.\n\nAs a result, the financial services segment revenue grew 3.4 times year over year and 102%, excluding the effect associated with the credit product last year. At the same time, EBT margins in the segment increased 3.8% in the first quarter to 4.3% in the second quarter. In our software segment, revenue growth pro forma for Linx reached 23%, mostly driven by a strong performance in our core software. I'm encouraged by the margin evolution is software with sequential improvement of almost 300 basis points in EBITDA margin, which reached over 15% in the quarter.\n\nThis improvement was the result of continued efficiency gains in back-office synergies, even though we continue to invest in our distribution, customer service, and marketing capabilities. We expect to continue ramping up our software margins in the second half of the year. I'm pleased with the consistency and direction of our results in the second quarter, and I think this is a solid step forward to producing strong results by year-end. Looking to the second half of the year, we maintain our focus on building on these achievements.\n\nWith that said, I will now pass it over to Lia, who will provide more details about our second quarter performance and strategic updates. Lia?\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nThank you, Thiago, and good evening, everyone. As Thiago just summarized the main financial and operating highlights, I will dive a bit deeper into the drivers of our performance. Starting on Slide 7, I will focus on our client base trends. During the quarter, we reached over 2 million MSMB clients with net adds of 196,000, driven by strong commercial performance in both TON and Stone products despite some churn impact from our continuous pricing initiatives.\n\nWe have continued optimizing our commercial strategy to onboard smaller clients onto our TON product, while we focus the Stone product on bigger SMBs. This approach addresses our clients' needs more effectively and provides superior unit economics for us. As you can see on Page 8, the strategy has led to better quality in our client base for Stone and TON, both of which grew average TPV over 30% year over year. This, combined with our client base growth, resulted in an MSMB TPV of 69.9 billion reais, 3% above our guidance for the quarter and 78% higher year over year.\n\nAt the same time, we improved our monetization with take rates increasing sequentially from 2.06% to 2.09% in the second quarter. On Slide 9, we highlight the continued expansion and engagement with our banking platform. On top of the growth in number of clients actively using our digital banking account, I want to highlight the sequential improvement in ARPAC, which reached 39 reais per month this quarter compared to 33 reais last quarter and three times higher year over year, mostly driven by higher interest rates on average deposits from clients' bank accounts. I also want to briefly update you on the performance of our legacy portfolio.\n\nThis quarter, we received 134 million reais of cash inflows, which decrease the fair value of the credit portfolio on our balance sheet to 129 million reais. On Slide 10, we will move on to our key accounts business. As we show on the left side of the page, TPV from key accounts had a slight decrease during the period as we continue to deprioritize sub-acquirers. On the other hand, the TPV growth in platform services was strong at 95% year over year.\n\nDue to this mix shift and the increase of CDI rates, take rates have increased sequentially to 0.86%. Now, let's shift to our software segment on Slides 11 and 12. Softer revenue in the second quarter of '22 reached 351 million reais, representing 23% year-over-year growth pro forma for Linx. At the same time, adjusted EBITDA also improved, reaching 53 million reais with 15.2% adjusted EBITDA margin compared to 12.3% in the first quarter and 9.2% in the second quarter of '21 pro forma for Linx.\n\nWe expect profitability improvements to continue throughout the year as we capture efficiency gains and back-office synergies even while we continue to invest on several fronts. On Slide 12, I want to highlight the main drivers of this performance and the progress of our software strategy. First, software revenue growth was driven mainly by core revenue growth that was up 28% year over year, driven by the higher number of POS/ERP locations and average ticket, as well as the consolidation of [Inaudible]. This result was partially offset by the digital business, which decreased revenues by 6%.\n\nIn order to strengthen our strategy of helping our software clients to sell through multiple channels, we concluded the acquisition of Plugg.To, which streamlines integrations with marketplaces. We believe we have a huge opportunity here to help our clients become truly omnichannel and increase their sales. The second point I want to highlight is that we're gaining scale and improving margins. With annualized revenues of 1.4 billion reais, we continue to generate operating leverage from our integration efforts and efficiency gains in costs and expenses.\n\nAnd we expect this trend to continue in the second half of this year. Finally, we see significant room to grow organically and through new investments in our core POS/ERP products, cross-sell financial services to our existing client base, and help our clients sell more through multiple channels. Now, I would like to pass it over to Rafa so he can discuss in more detail some of our key financial metrics. Rafa?\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nThanks, Lia. Before I go over our financial results, I would like to clarify that as anticipated in our last earnings release, from the second quarter 2022 onwards, we will no longer adjust our results for the financial expenses related to our bond. To allow for like-to-like comparison, we have included in our earnings material historical numbers in the same criteria that we are now adopting. That said, starting on July 13, I would like to highlight a few key points.\n\nAs you can see, our results are consistently improving with revenue and margins from both our financial services and software segments increasing sequentially. Our adjusted net income was 76.5 million reais, compared with 51.7 million reais last quarter, a 48% sequential improvement. For the rest of the year, we expect profitability to keep increasing while balancing it with healthy growth levels. As we have already detailed our top-line trends, I would move directly to July 15 to focus on our costs and expenses pro forma for Linx.\n\nFollowing the trend we started seeing last quarter, we gained leverage in most of our costs and expenses line both quarter over quarter and year over year, with cost of services and selling expenses being the highlights for the quarter. We'll focus on our quarter-over-quarter evolution which better shows our current trends. Cost of services as a percentage of revenue decreased 540 basis points, driven mainly by lower data center costs, efficiency gains related to our registry business, and lower D&A. In administrative expenses, we had a small gain in efficiency as a percentage of revenue.\n\nAs our business kept growing, we had higher third-party services expenses, which was the main responsible for the absolute growth in this line. As we continue to rationalize G&A growth, we expect to continue gaining leverage in this line over time. Regarding selling expenses, this line decreased almost 400 basis points as a percentage of revenue, as our marketing expenses returned to more normalized levels. We'll keep investing in our growth through commercial efforts in the second half of the year.\n\nFinancial expenses with the bond included in the previous quarters for comparison purposes presented a sequential growth of around 710 basis points as a percentage of revenue, mainly due to three factors: first, the further increases in CDI rates that increased on average 20% quarter over quarter; second, a larger mix of prepayment revenue; and finally, our decision to increase the duration of our funding lines. Lastly, other expenses as a percentage of revenue, had an increase of almost 190 basis points, mainly explained by the write-off of assets from the discontinued Linx Pay business in the amount of 16.6 million reais, the write-off of POS equipment, and other smaller effects. We are encouraged by the trends we are seeing, and we will keep looking for opportunities to be more efficient in the second half of the year. In addition to our P&L evolution, this quarter, we continued to generate cash and improve our liquidity.\n\nOur adjusted net cash improved by 195.6 million reais in the quarter and 455.6 million reais in the first half of the year, reaching 2.6 billion reais. With that said, I'll pass it back to Thiago so he can provide you with additional updates about our team and our outlook for the third quarter. Thiago?\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Rafa. Before we move to our outlook for the third quarter, I would like to give an update about some additional changes to our executive team. Marcelo Baldin, our chief financial officer, is departing from the company after five years of services, building out our finance functions and helping the company execute on its IPO. Baldin will be replaced by Silvio Morais, who was named our interim CFO.\n\nSilvio, who has extensive experience in finance, including serving 20-plus years as controller at Ambev, will temporarily step down from our board to assume his new duties. Also, Tatiana Malamud was appointed our chief legal officer, a new role which will serve as part of the executive committee. Tatiana has 30 years of experience as in-house counsel and head of legal departments for different financial institutions, as well as deep experience in capital markets. We would like to thank Baldin for his valuable contributions to Stone over the past five years and wish him success in his new endeavors.\n\nI'm excited to have Silvio join the management team and benefit from his significant experience in finance. Also, I would like to welcome Tatiana to our team and look forward to her developing this critical new role for the company. Finally, let's move to Slide 16, where we will share with you our third quarter outlook for the business. We expect a total revenue and income above 2.4 billion reais, representing a year-over-year growth above 63.3%.\n\nFor MSMB TPV, we expect volumes between 73 billion and 74 billion reais with year-over-year growth between 41.4% and 43.3%. Finally, regarding adjusted EBT, we expect more than 125 million reais without adjusting for the board financial expenses compared to 106.7 million reais for the second quarter. We still have a long path ahead of us, but we believe the consistent results achieved in the first half of the year demonstrate we are on the right track. We will encourage outlook for the second half of 2022 in which we continue to expand margins while keeping strong growth levels.\n\nWith that said, operator, can you please open the call up to questions?\n\nOperator\n\n[Operator instructions] And our first question today will come from Tito Labarta with Goldman Sachs. Please go ahead.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nHi. Good evening, everyone. Thank you for the call and taking my questions. A couple of questions.\n\nI guess, first on the take rate on -- MSMB take rate, we saw a little bit more expansion this quarter. Just help us think about, you know, are you done with repricing there? Is any more room to reprice? Is this kind of the take rate that we should expect from here? Because you also saw, like, net margin ads accelerate. Just help us think about repricing versus, sort of, merchants avenue, ability to add more merchants. How is, like, the competitive environment to allow you to do that? And second question, you know, good job on costs and expenses, definitely seeing some improvements there.\n\nIs there more to do? Help us think about how that can evolve from here. You know, where else can you save on costs and control expenses to improve margins from here? Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nHi, Tito. Thiago here. I will start with the first part of your question. Thank you for all the questions.\n\nIf I miss something, please help me here to remind all the points. So, first, regarding take rates. We have continued to reprice clients according to CDI. In the second quarter, repricing efforts were a little bit smaller than what we did in the first quarter.\n\nBut now, in the third quarter, we have intensified the repricing efforts. And so far, we are doing very well. We expect that in the third quarter, the improvement in take rates will be greater than the improvements that we had in the second quarter. So, I think that we had the time to adjust our pricing policy to the value proposition of both TON and Stone product.\n\nAnd I think that we are performing well, the client base is performing well. And the net adds that we have shown this quarter, I think that proves our ability to navigate this environment. We are seeing a better performance in terms of commercial activities that we were expecting. So, we expect better net adds for the third quarter, too.\n\nRegarding competition, what I can say here is that in payments, it has been the same dynamics as always. We see the six main players in the market being rational regarding prices, which is good. In the banking and credit, we continue to build capability to allow us to compete head to head with incumbent banks. So, we still have a lot of room in these additional financial services to our clients.\n\nAnd in software, competition tends to be more vertical-specific and very fragmented, Tito. We continue to consolidate the industry, given the strength of our solution and the strength of the team. So, there's no big news in competition. But I think that the six main players in the market that dominate the majority of the market share are being rational in terms of pricing.\n\nAnd I think that this is positive for everyone. In terms of cost and expenses, we are improving the discipline in the way we manage capital allocation and opex in our business. So, we expect to continue to gain leverage in our lines. So, we expect a better second half of the year in terms of discipline in managing opex.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nGreat. Thank you, Thiago. That's, you know, very clear. Maybe just one quick follow-up on the competitive environment.\n\nYou mentioned that everybody's being more rational now. How long does that rationality last? I mean, do you think, you know, once rates come down and people start to get more aggressive again, is everybody just kind of normalizing for the higher interest rates? Just to help us think kind of long term how competition can evolve, just given how competitive it's been in the past?\n\nThiago Piau -- Chief Executive Officer\n\nThe players were impacted by the CDI almost in the same way. There are some differences in terms of capital structure between players. But in the end of the day, I think that when the interest rates were moving up very, very fast and the competitors are trying to see what each other were doing, there was some delay on the pricing strategies of all the players. But I think that now, it is behind us.\n\nWe are not pricing our products based on competition. We are pricing our products based on the relationship we have with our clients and the evolution of our solutions for them. But we are seeing that the other players are more stable in relation to pricing and their strategy. So, I think that these dynamics we have today will continue.\n\nIf interest rates goes down, of course, some of that it will be moving to clients. But I think that the industry will keep margins when interest rates ease. That's what I expect.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nThat's great. That's very clear. Thanks a lot, Thiago.\n\nThiago Piau -- Chief Executive Officer\n\nThanks, Tito.\n\nOperator\n\nAnd our next question will come from Josh Siegler with Cantor Fitzgerald. Please go ahead.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nYes. Hi. Thanks for taking my question. So, the average revenue per active client in banking continued to trend higher.\n\nDo you believe there's more room for it to expand in the back half of 2022 as interest rates remain elevated?\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nHi, Josh. This is Lia. Thank you for the question. I think the short answer is yes.\n\nSo, as we continue to see our clients engage further with our banking solution, I think there's a few drivers there, right? Number one is average deposits are, of course, a big impact in the ARPAC, as I just mentioned, the evolution in the quarter. And that is correlated with interest rates. So, as long as interest rates go up, that monetization will improve, but also average deposits are trending upwards. And also, as we deploy more features and help our clients in new banking solutions, that also will contribute positively to monetization.\n\nSo, I think the trend in monetization in banking as we see it is very positive going forward.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nGreat. Thank you for the color there. And then if I could just have a follow-up. MSMB TPV came in above your expectations this quarter.\n\nWas that largely driven by higher TON ads. Or did average spending per merchant also surpassed your original outlook? Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nHi, Josh. Thiago here. I think that the positive surprise was the average TPV on both products. We were already expecting these improvements in net adds.\n\nAnd we are adding net ads in all clients tiers from the micro merchant space to the SMB and the medium clients. In all ties of clients, we are -- we have a positive net ad. But the average spending per merchant on both Stone and TON products came a little bit above our expectations. And this was a positive.\n\nI think that the client base has a better quality now. Let's see how this movement will continue for the second half of the year. As I said, we expect to continue improving our net addition of clients because I think that we are managing the client base and the new sales much better now. Let's see how the average will behave, but I think that this trend will continue.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nGreat. Thank you very much.\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Josh.\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nThanks, Josh.\n\nOperator\n\nAnd our next question will come from Mario Pierry with Bank of America. Please go ahead.\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nHi, everybody. Congratulations on the results. Let me ask you two questions. One is on the efficiency gains that you talked about.\n\nI would assume a lot of these gains is coming from the incorporation of Linx, right? And there was a significant overlap. Can you talk about how much of the Linx cost base has been reduced, or how much do you expect to reduce? And, you know, just trying to get a better feel here for how much more cost savings we can see. And the second question is related to financial expenses, where they are running close to 1 billion reais per quarter now. But it seems to us that interest rates in Brazil are close to a peak.\n\nSo, just can you give us some type of sensitivity of your financial expenses to movements in interest rates in Brazil? That'll be very helpful. Thank you.\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nHi Mario. Rafael here. Thank you for the question. So, regarding your first question of efficiency, I think it's important to highlight that we are gaining efficiency not only in Linx and software business, but also in the financial services front.\n\nSo, if we look at both segments, we are having opex efficiencies there. We do have an improvement in margins in software, right? They beat the margin. It went up from 12% to 15% this quarter. So, yes, we are capturing cost savings in the software front.\n\nBut also, some of the cost efficiency we had, for example, we had lower data center cost efficiencies with our registry business, our banking business, also, some cost efficiencies. So, we do have cost efficiencies related to the whole business. And as Thiago said, this is something that refers to the whole StoneCo. When we think about financial expenses, as you said, our financial expenses, they tend to increase both with the average interest rates in Brazil and also the growth of our business.\n\nSo, if you look at our TPV, the consolidated TPV grew 9% quarter over quarter. The CDI increased, on average, 20% quarter to quarter. And if you add up those two changes, you'll see that it's pretty much what our financial expenses increased. So, as the CDI rate tends to flatten, of course, it does have a benefit into financial expenses.\n\nBut, of course, as Tiago said, we do adjust pricing policies also accordingly. So, I think that over time, you should see financial expenses stop increasing as a percentage of revenue as we have seen over the last year when the CDI sort of flattens.\n\nThiago Piau -- Chief Executive Officer\n\nRafa, can I add some comments here? Mario, Thiago here speaking. Just to make 100% clear, when interest rate goes down, if it happens, we expect that we are close to the peak, as you said. If the trend in interest rates change and interest rate goes down, we expect a direct part contribution to our margins. So, if we have an ease in interest rates, we expect to capture this as benefits in our margins and our results.\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nOK. That's clear. Just a follow-up then. On your headcount, can you talk about your total headcount today versus like two quarters ago or versus one year ago, when you integrated Linx?\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nHi, Mario. Rafael here. Yeah. So, the headcount today is a little over 14,000 people.\n\nIt's pretty much flattish over the last half year. This is a result, as we commented off opex discipline, right? So, the headcount is pretty much flattish. The increase in personnel expenses that you'll see in our results is pretty much the adjustments we have to do, both legally and bringing in new talents and more senior people. But overall headcount is pretty much flattish.\n\nThiago Piau -- Chief Executive Officer\n\nMario, this is Thiago --\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nDo you see -- hi. Sorry, Thiago. Go ahead.\n\nThiago Piau -- Chief Executive Officer\n\nThiago here, just a comment. As I told you last quarter, I think that we already have the infrastructure we need in terms of people, both in distribution and logistics customer service to attend our client base and the growth that we have projected for the medium short term. And we are improving our productivity in the way that we design our processes. And now, we have a new wave of growth, adding more products to our clients that we expect not to increase our number of people.\n\nSo, we expect to continue to gain leverage in the personnel expense line.\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nOK, guys. That's very clear. Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Mario.\n\nOperator\n\nAnd our next question will come from Kaio Prato with UBS. Please go ahead.\n\nKaio Prato -- UBS -- Analyst\n\nHello, everyone. Thank you for the opportunity for asking questions. So, I have two here on my side, please. I think you completed a new partial sale of your stake in Banco Inter this quarter.\n\nThe first one is, can you please confirm this to us? What about the impact in our earnings and cash? And what is your current stake in Banco Inter today? And what is your strategy on these going forward? And second, we see that your cash generation was negative in this quarter again, and it's close to 700 million cash burn year to date. So, just wondering if you can share with us what your view about that. When do you expect to return to a positive cash generation? And what should be the main drivers for these going forward, please? Thank you.\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nHi, Kaio. Thank you for your question. So, regarding the partial sale of the stake in Banco Inter, you're right. We had a little under 5% stake of Banco Inter.\n\nWe have today around 4%. So, basically, we sold the 1% stake that we had before. This was -- we received those proceeds at the end of June, so there's a very small effect in terms of those proceeds. And of course, when you look at the mark-to-market that we have, after we have sold, the mark-to-market refers to the stake we have remaining.\n\nSo, as we have mentioned in the past, this is an investment we have made back then. And this is like not the core of our strategy right now to look at it. We have admiration for the Inter team. But this is not a big focus now.\n\nAnd we keep the stake we have in the Banco Inter. Regarding your second part of the question, we have actually generated cash and increased liquidity this year, almost 0.5 billion reais. So, our adjusted net cash position is 2.6 billion reais. So, that's --when we expect, of course, to continue to generate cash, our lower capex in the second half of this year versus the first half, and the ideas that our business continues to generate cash.\n\nThiago Piau -- Chief Executive Officer\n\nKaio, Thiago here. Just an additional color. We made just one partial sale of Banco Inter when we choose to receive the cash option when they migrated to Nasdaq. So, there was -- we have no news regarding our investment in Banco Inter.\n\nWe remain at the same position we had. And we talked to the mark in the last earnings call. So, there is only one sale when we choose the cash option in their migration in Nasdaq, and no updates on that.\n\nKaio Prato -- UBS -- Analyst\n\nOK. Thank you very much.\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Kaio.\n\nOperator\n\nAnd our next question will come from Geoffrey Elliott with Autonomous. Please go ahead.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nHello. Thanks very much for taking the question. You mentioned being 5% ahead of the outlook you provided. But in the sense, you were kind of further ahead really in June because the outlook was given at the start of June.\n\nAnd I guess, at that point, you had pretty good visibility into the April and May numbers. So, can you help us understand where did you perform better than expected? Was it a particularly strong June? And then is there anything we can read into that as we look out into the third quarter? Thank you.\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nHi, Geoffrey. Rafael here. Thank you for the question. So, I think, yes, along the lines that what you Thiago mentioned regarding the TPV that we saw a better performance than expected, I think we did see a strong June, as you mentioned.\n\nAnd that's pretty much the reason why we delivered a number that is higher than the previous guidance. So, yes, when we look at top line, both TPV and revenue became above what we initially expected.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nAnd given the strength in June, is there anything we can extrapolate from that? I guess, were you performing better than you expected in June? And can we kind of read through from that into July, August, September?\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nYes. I think that we -- that the guidance we have provided for the third quarter already has some of those improvements versus the initial expectation. So, as mentioned, when we look, for example, at the take rate evolution, we see a bigger evolution in the third quarter compared to the second versus the evolution we had now from the second -- versus the first. So, I think we have incorporated those effects already in our guidance.\n\nAnd we are very committed to that guidance.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nThank you.\n\nThiago Piau -- Chief Executive Officer\n\nCan I add a comment here? Geoffrey, Thiago here speaking. That's a great question. I think that in our outlook for the third quarter, what we actually hear is that although we are comparing our growth to tougher comps because every quarter it is harder to continue to grow at the same pace because the pace of TPV is big. But we are seeing that at the top of the range, we will be growing 3% on MSMB TPV, but total revenue would be growing at 63.3% at the top of the guide.\n\nSo, I think that here, we show our ability to improve take rate through this guidance. And we are committed to the top of the range of the guidance.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nThank you.\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Geoffrey.\n\nOperator\n\nAnd our next question will come from Neha Agarwala with HSBC. Please go ahead.\n\nNeha Agarwala -- HSBC -- Analyst\n\nHi. Thank you for taking my questions. Could you please give us an update on the software? How are you integrating the Linx products to your own SMB client base? Have you started cross-selling Linx products to your client base? And how is the process going? And the second question is on your service business. Is that something -- you already mentioned that you're trying to design a product and you do a pilot.\n\nHow is that coming along? Thank you so much.\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nHi, Neha. Lia here. I understood you make two questions. One regarding software and one regarding credit, right.\n\nNeha Agarwala -- HSBC -- Analyst\n\nYes, Lia. Perfect.\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nGood, good, good. OK. So, let me start first with software and how we see penetration of financial services evolving into our software client base. So, the penetration of financial services into our software client base has evolved sequentially.\n\nAnd this had a positive impact on the growth of platform services TPV, the 95% growth year on year on platform services TPV because that's where we account for the TPV within our software client base. But to be clear, we still see a lot of opportunity not only in acquiring but Pix in integrating banking through the ERP. And when the time is right, in credits. So, a few updates on the product side, Neha.\n\nWe have made good recent advancements in product integration. So, regarding Pix integration to the POS, which is, you know, when Pix is integrated as a payment method, and they can be reconciled as a payment method which greatly facilitates reconciliation for the client. We have a big coverage of Linx POS with Pix enabled. The second point is native integration of Stone banking into the ERP is a recent advancement that we have made.\n\nIn the majority of the verticals, we have integrated the ERP to our Stone banking. And it really facilitates clients cash management workflows. We also have integrated our reconciliation platform to most of the vertical ERPs. And we had made also advancements in integration of mobile POS in some verticals where this really improves productivity in the store by streamlining checkout process.\n\nSo, these are examples of recent advancements we've made in integrations. And we expect naturally that these will help us strengthen our software value proposition in the verticals that we offer them. When we think about credit within the software base, we think that this is an opportunity to address a little bit longer term because our priority and credit right now is focused on SMB clients within the Stone products. But if you -- I think we've talked about this before, right? If you look at the Linx client base, there's a big fraction of clients that are middle of the pyramid there.\n\nSo, what we call the system within the SMB space. And we think that there's an opportunity there to leverage the software data to be more assertive in giving credit to those clients. And regarding where we are on credit itself, I think the message is the same that we gave last quarter. So, on the working capital product, we started testing in a very small scale the product and the system improvements that we have made.\n\nWe're really in test mode right now to test systems, collateral, the user experience, some features, the enhancements that we've done in the product. And the idea is to continue these tests to run a full cycle before we actually decide to scale. So, I think our plans haven't changed, and we are on track regarding those plans. We're also on track to start a pilot very soon with our credit card product and continue this pilot throughout the second half of the year.\n\nSo, I think those are the main messages regarding software and credit, Neha.\n\nNeha Agarwala -- HSBC -- Analyst\n\nCould you -- [Inaudible] which had some operation problems. Is that working better now? Is that something that you are keeping an eye on to see how that is improving?\n\nThiago Piau -- Chief Executive Officer\n\nHi, Neha. Thiago here. Can I go on, Lia?\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nGo ahead.\n\nThiago Piau -- Chief Executive Officer\n\nOK. So, Neha, regarding the registry of receivables, I think new big update here. We continue to follow the evolution of the three main players closely. We are integrated with the three of them, both in terms of our credit products, and, now, we are starting to pay more attention in using the registry of receivable to create products, to prepay receivables for our clients with buyers.\n\nBut we don't feel that we have a system that is stable enough in order for us to incur in the risk only looking to that receivables that are being processed by the registry. So, we are still being careful on that. But I think that in the second half, that industry will evolve, and it will open big opportunities for us, both in terms of prepaying receivables that clients have with other requires. And this is a very big opportunity for Linx, for example, and to improve our collaterals in the credit fraud.\n\nSo, let's see what the second half of the year will bring.\n\nOperator\n\nAnd our next question will come from Pedro Leduc with Itau BBA. Please go ahead.\n\nPedro Leduc -- Itau BBA -- Analyst\n\nThank you so much for hosting the call and taking the question. Two for me, please. One, just seeing your guidance figure for 3Q revenues, 2.4 billion, that's almost flat in respect to 3Q mid-single, low-single digit expansion at most, which maybe it's just you guys being conservative because of what we just heard, net adds strong, further repricing, business evolving. It seems like this deceleration, I can't really reconcile on, unless there's a big drop in the key accounts to come.\n\nJust like to pick your brains around this. Maybe it's just conservatism or what you're seeing so far in the quarter. That's that. Thank you.\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nHi, Pedro. Rafael here. Thank you for the question. So, I think that we as you said, I think it's an important point, when we look at our revenue, we do have MSMB revenues and key accounts revenue in the financial services.\n\nOf course, key accounts revenue, they are more volatile. And also, we are discontinuing some of the sub-acquiring business, so they can be more volatile. And of course, we want to make sure that will reach the guidance that we give. And of course, the guidance is above 2.4.\n\nBut I think that this is the best number we have right now that we are very confident that we will reach. But overall, when we look at the growth that this guidance implies, it is still a very strong growth year over year, over 60% growth in revenue, that we think is a healthy base versus the improvement in profitability that we want to have. So, as Lia and Thiago mentioned, we are balancing growth and profitability in the second half of this year still. And we want to keep that consistent pace.\n\nSo, this is sort of the net effect of all those elements in our business.\n\nPedro Leduc -- Itau BBA -- Analyst\n\nRafa, super clear. Thank you. And the other question is a little more on the strategic business side. I recently saw you guys bring in Rodrigo Cury, former BTG banking retail or digital banking lead, former -- before that, he was a part of the big retail bank as well.\n\nAnd I've seen you guys mentioned banking services a couple of times in this call. Can't avoid thinking that you have all this budget to spend global maybe to boost that avenue as well. Am I correct in the line of thinking that this should be a major attention point for you guys in the near future?\n\nThiago Piau -- Chief Executive Officer\n\nHi, Pedro. Thiago here. Yes, you are right in the line of thinking. We want to be a protagonist in financial services for merchants in Brazil.\n\nWe are creating big efforts to improve our client base with the main projects. We're on top of that, transform the company, being perceived for our clients as the main financial provider to all their needs. And one of the big steps we are doing is improving our team and improving our ability to create new products, integrate it in a very simple way for our clients. So, I think we have the capability, the distribution, the culture, and, now, the team to execute.\n\nSo, let's see how we will evolve for the next six months and a year. But I believe that the new team that we are bringing with Rodrigo as well, Marcus, combine it with the pool of talents we have here, and with Gregor, will be a big boost in our strategy and our evolution. So, yeah, that's the direction we are heading.\n\nPedro Leduc -- Itau BBA -- Analyst\n\nSuper clear. Wish you guys much success, and talk to you soon again. Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Pedro.\n\nOperator\n\nAnd our next question will come from Domingos Falavina with J.P. Morgan. Please go ahead.\n\nDom Falavina -- JPMorgan Chase and Company -- Analyst\n\nThank you. Good evening, Thiago, and Lia, and Rafa, whoever else is there. My question is just kind of trying to pick your brains on the pricing and what you guys take into consideration. So, when we look at your -- in your revenues, it basically grew about 9% q-on-q, which is good as about in line with what we saw TPV growth.\n\nBut when we had financial expenses, it basically shrank 1% q-on-q. And the part that I struggle a little bit is hearing you say that, you know, your price is not based on competition, which has, from what I hear, improved in the margin, but instead based on the relationship with your existing clients. So, I guess my question is, when you're pricing this or are you baking in, you know, there's rising financial expenses -- and I'm not adding all the financial expenses because it's pretty hard to locate majorly where your booking prepayment versus the banters or other weighted average cost of funding. And I guess, to a certain extent, like, if you're not really pushing that hard on this price adjustment, if you're seeking that kind of, you know, take rate all-inclusive, inclusive, I mean, if that's a figure you're satisfied with because we did see a good compression q-on-q.\n\nAnd lastly, like, what exactly is your, you know, senior management's main goals or, you know, remunerated on, if it is on TPV growth or if it is on profitability? Because, obviously, we're seeing a big shift in investor sentiment on that kind of position. Thank you.\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nHi, Domingos. Rafael here. Very, very good question regarding the financial expenses. So, when we look at the second quarter, we saw less contribution.\n\nIf you look at the change in our pre-tax profits, we saw less contribution from revenue, net of financial expenses. And the improvement in profitability was mainly from opex discipline. I think that in the third quarter, this dynamics will be a little different because we have a -- we expect a better dynamics of revenue net of the financial expenses, and that there's always some lagging effect between how the CDI evolves and brings the financial expenses versus our pricing. What we try to do is always to look -- and to your question about how we see it, we look at the unit economics of our clients and the returns we have from investing our CAC there.\n\nAnd we have some hurdles that we look. So, after the CDI increases, we do adjust prices to adjust accordingly. So, I think that lighting effect may have some impacts there. I think one other effect that you have in financial expenses this quarter, we have taken the decision to have a little longer funding lines.\n\nSo, this also has some negative effect there. So, it's not 100% the funding costs that we have in our clients. So, this also has impacted there. And I think Thiago would like to add to that answer.\n\nDom Falavina -- JPMorgan Chase and Company -- Analyst\n\nLet me see if I understood you right before I go ahead. So, opex [Inaudible] too. So, congrats on that. But if I understand you right, basically, the wave of price adjustments comes a little bit behind.\n\nSo, when I look at that take rate inclusive of financial expenses, if nothing drastic happens, the expectation is that it moves up. So, you continue to recompose that margin.\n\nThiago Piau -- Chief Executive Officer\n\nYes. Hi, Domingos. Thiago here. Let me add on that.\n\nSo, first let me talk about the cadence of repricing. We did a significative improvement in the first quarter. And we don't want to create too much stress both in our client base and our team. So, the improvements that we did in the second quarter was smaller because it's hard for you to keep improving prices frequently in your client base without stressing the relationship.\n\nThat's why we took long for the clients to adapt to this new reality. And now, on July and August, but basically on August, we did another significant movement already. And I think that we did it well. So, created some space for those two big movements.\n\nI think that was good to the client base and to the team. So, I think that we are now creating more predictability in the way that we execute our price strategy. And with a big client base, that's really important. So, it was a big jump in the first quarter.\n\nA little bit smaller one on the second quarter. And now, we improved the pace back again on the third quarter. And I think that that strategy is performing well both in the base and in commercial activity. So, that's the scenario you're seeing.\n\nAnd you were right when you see that revenue less funding costs was basically in line with last quarter. And there's this effect that Rafa just mentioned. But we increased the duration of our funding lines a little bit, too, mainly because of the macro environmental actions in Brazil. We think that it was good to be a little bit conservative and improve duration in our funding lines, so we did it.\n\nSo, there's some of that effect in that line, too. You will see in third quarter a different effect. So, you will see in the third quarter revenues growing faster than funding. So, we are managing this thing appropriately.\n\nDom Falavina -- JPMorgan Chase and Company -- Analyst\n\nNo, very clear. Thank you, and good to know you look at that ratio as well. Appreciate it.\n\nOperator\n\nAnd the next question --\n\nThiago Piau -- Chief Executive Officer\n\nDomingos, just one last comment -- sorry. Domingos, your last question. You asked, what is the focus of management, if it's TPV or revenue or profitability? We are focused on the quality of the client base, and we are focused on profitability. We will continue to grow at a fast pace.\n\nYou see that we are committed to net adds. But if we have to choose today our focus, our focus is to improve profitability, balancing better our growth with profitability. And I think that we are delivering that. So, we will continue to evolve in our pricing.\n\nSo, that's where we have our minds here.\n\nDom Falavina -- JPMorgan Chase and Company -- Analyst\n\nVery clear. Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nI'm sorry that I forgot to answer previously.\n\nDom Falavina -- JPMorgan Chase and Company -- Analyst\n\nNo, it's good.\n\nOperator\n\nAnd the next question will come from Jeff Cantwell with Wells Fargo. Please go ahead.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nHey. Thank you. I appreciate you squeezing me in. I wanted to ask -- good to hear from you.\n\nI wanted to ask you about your software revenue and really talk about your software EBITDA, which, it looks like it's up about 300 basis points sequentially to 15%. So, can you just sort of give us a little more color on what's driving that expansion in the margin there? And then any color you can give us on the go forward from a margin perspective for the software piece of it would be great. Thank you very much.\n\nThiago Piau -- Chief Executive Officer\n\nHi, Jeff. Thiago here. Two main things. One, we are integrating our portfolio of companies into Linx management system, creating one big business unit that combines all of our software businesses.\n\nAnd I think that this group provides us an ability to continue to grow at the pace we are. I think that in the medium term, we expect to continue to grow at this pace, but improve margins. We've got 15% EBIDTA, which was -- I think that we can get to 20% weekly. I expect to have positive news about margins close to 20% at the end of the year.\n\nSo, I think that the discipline that the team has to provide efficiency to all of our software products and continue to reinvest behind growth and improve our customer service to clients in software is really performing well. So, if we continue to grow at this pace, which is, I think, it's a healthy level to the medium term and continue to improve margin. And I believe in our ability to get close to 20% EBITDA margin in the end of the year. It would be a very good first step.\n\nAnd next year, we have to continue to improve our efficiencies and continue to improve or cross-sell in our base. So, I think that those are the two main things.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nOK. Great. And just to follow up on that, can you sort of prioritize or explain what are the biggest drivers to get from 15% to 20%? Is that, you know, top-line growth? Is it something with the efficiency that we should be aware of? I just wanted to drill down, you know, on that area to the best we can. Thanks again.\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nHi, Jeff. Rafael here. So, I think it's a combination of those elements. So, the fact that we are able to grow, have strong growth organically does help to dilute G&A expenses.\n\nI think this is number one. We have been able to improve efficiency in some costs like, for example, cloud cost negotiation. So, I think those are the main drivers of the margins there that we see. And of course, when we -- we do have less-mature solutions in our software business, not only Linx.\n\nAnd as those solutions mature and grow, and we expand them and integrate into Linx itself, I think that also contributes to a higher margin. So, remember that we have invested in software solutions in the past that were basically zero margins. And as we evolve those solutions, they gained traction. We are able to get more mature and also increase margins.\n\nSo, I think those are some of the main elements that should help us there.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nOK. That's perfect. Thank you for all the color, and appreciate it. Congrats on the results.\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Jeff.\n\nOperator\n\nAnd this will conclude our question-and-answer session. I'd like to turn the conference back over to Thiago for any closing remarks.\n\nThiago Piau -- Chief Executive Officer\n\nI would just like to say a big thank you to the -- to our team for the amazing work in the quarter and for the support of our shareholders. We expect a very good second half. We are very excited of our business, and see you next quarter. Thank you very much.\n\nBye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRafael Martins -- Vice President of Finance and Investor Relations Officer\n\nThiago Piau -- Chief Executive Officer\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nKaio Prato -- UBS -- Analyst\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nNeha Agarwala -- HSBC -- Analyst\n\nPedro Leduc -- Itau BBA -- Analyst\n\nDom Falavina -- JPMorgan Chase and Company -- Analyst\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nMore STNE analysis\n\nAll earnings call transcripts"
}