{
  "companyName": "Motorsport Games Inc.",
  "companyTicker": "MSGM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/motorsport-games-inc-msgm-q2-2022-earnings-call-tr/",
  "content": "Motorsport Games Inc. (MSGM 35.18%)\nQ2 2022 Earnings Call\nAug 10, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to Motorsport Games, Inc. second quarter 2022 earnings call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation.\n\n[Operator instructions] As a reminder, today's conference is being recorded. I would like to the turn conference over to Ken Godskind from Motorsport Games. Please go ahead, sir.\n\nKen Godskind -- Director of Operations\n\nThank you, and welcome to Motorsport Games second quarter 2022 earnings conference call and webcast. On today's call are Dmitry Kozko, Motorsport Games' executive chairman and CEO; and Jon New, its chief financial officer. By now, everyone should have access to the company's second quarter 2022 earnings press release filed today after market close. This is available on the investor relations section of Motorsport Games website at www.motorsportgames.com.\n\nDuring the course of this call, management may make forward-looking statements within the meaning of the U.S. federal securities laws. These statements are based on management's current expectations and beliefs and involve risks and uncertainties that could cause actual results to differ materially from those described in these forward-looking statements. Except as required by law, the company undertakes no obligation to update any forward-looking statements made on this call or to update or alter its forward-looking statements, whether as a result of new information, future events, or otherwise.\n\nPlease refer to today's press release and the company's filings with the SEC, including its most recent quarterly report on Form 10-Q for the quarter ended June 30, 2022. For a detailed discussion of certain risks that could cause actual results to differ materially from those expressed or implied in any forward-looking statements made today. In today's conference call, we will refer to certain non-GAAP financial measures such as adjusted EBITDA as we discuss the second quarter 2022 financial results. You will find a reconciliation of these non-GAAP measures to their most directly comparable GAAP measures, as well as other related disclosures in the press release issued earlier today.\n\nAnd now, I'd like to turn the call over to Dmitry Kozko, chief executive officer of Motorsport Games. Dmitry?\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nThank you, everyone, for joining us on our Q2 2022 earnings call. I'd like to start today with a quick reminder that we are a product-driven business. Our products include creating official racing games and esport experiences under some of the world's most valuable Motorsport brands like NASCAR, INDYCAR, 24 Hours of Le Mans, BTCC, and others. Therefore, our efforts and resources are prioritized to go toward providing racing fans with good experiences.\n\nWe believe we made good progress with product releases in Q2 and development of our future product releases in upcoming quarters. In Q2, we released our anticipated next-gen console upgrade to all NASCAR 21: Ignition holders, even allowing users with new and previous generation consoles like PS4 and PS5 to play together via cross-gen capability, all while continuing to bring quality of life improvements to our 2021 NASCAR game, while we continue to work on our 2022 and 2023 versions. Our rFactor 2 platform continues to deliver predictable and exciting quarterly content drops and allows us to use our expanding rFactor 2 platform to conduct our own esport events like Formula Pro Series. These steady content releases bring official license content such as cars and tracks to our fan base while allowing us to create on-track activations at INDYCAR and recently announced BTCC events throughout the year.\n\nThese on-track activations not only allow our fans to try rFactor 2 and its licensed INDYCAR or BTCC content but also provide us valuable hands-on fan feedback that helps us progress on the development of both the official INDYCAR and BTCC game. We plan to be at five to 10 more races this year between NASCAR, INDYCAR, and BTCC events. As a reminder, our official INDYCAR game is slated to launch on all major platforms on time in 2023, and our official BTCC games on all major platforms in 2024. Back to our NASCAR franchise for a minute.\n\nWe have a pretty packed content and game release schedule for the upcoming months. We are bringing a 2022 season update to our NASCAR 21 console game, as well as addition of 2022 teams and drivers to our current NASCAR mobile game and maybe even one of our older Heat titles. Also, we are launching a brand-new NASCAR 22 game for a Nintendo Switch in Q4 that we're pretty excited about. Our previous Switch game was highly rated, and we are thrilled to continue to bring the NASCAR to the Nintendo Switch platform on a similar annual release schedule as we do for our other mass market consoles like Xbox, PlayStation, and of course, PC via Steam.\n\nLook out for more details about the NASCAR 2022 for a Nintendo Switch in just the upcoming days. Our product roadmap remains largely on schedule. The only potential change at this point is the timing of our next car craft release on one of the major consoles. It was originally planned for a 2022 release date.\n\nHowever, this will likely move into 2023 due to potential opportunities we're exploring with the first-party platforms and their potential interest in exclusive title release next year. We continue to recruit and hire development talent across our worldwide studios while exploring cost-saving opportunities in other areas. Liquidity remains a concern and area of focus for the management team, and we continue to explore all our available finance options. For now, let me pass it on to Jon to go over our financial results.\n\nJon New -- Chief Financial Officer\n\nThank you, Dmitry. I'd like to share summary financial highlights for the second quarter of 2022. Revenues for Q2 2022 were $2 million compared to $2.2 million for Q2 2021. The $200,000 or 10% quarter-over-quarter decrease reflects $300,000 lower gaming sales and $100,000 increase in esports revenues primarily from the 24 Hours of Le Mans esports event held in January 2022.\n\nQ2 2022 net loss was $7.5 million compared to Q2 2021 net loss of $6 million. The $1.5 million increase in net loss was primarily due to $900,000 increase in Q2 2022 development expenditures, $800,000 increase in sales and marketing spend, $600,000 in foreign currency losses, $200,000 decrease in gross profit, $200,000 increase in interest, $100,000 increase in impairment intangibles and $100,000 in depreciation and amortization. The increases in Q2 2022 expenses were partially offset by a $1.4 million reduction in general and administrative expenses. That was driven primarily by $1.1 million payment made in Q2 2021 for the settlement of certain stock appreciation rights that did not repeat in Q2 2022.\n\nQ2 2022 adjusted EBITDA loss was $4.9 million compared to Q2 2021 adjusted EBITDA loss of $3.7 million. The $1.2 million increase in Q2 2022 adjusted EBITDA loss was primarily driven by the same factors as the increased Q2 2022 net loss. Revenues were $5.3 million and $4.7 million for the six months ended June 30, 2022, and 2021, respectively. That's an increase of $600,000 or 13% period over period.\n\nFor the six months ended June 30, 2022, revenues from our Gaming segment increased $200,000 or 5% to $4.9 million compared to $4.7 million for the six months ended June 30, 2021. Revenues from our esports segment increased by $400,000 for the six months ended June 30, 2022, when compared to revenues for the six months ended June 30, 2021. The increase in our Gaming segment revenues compared to the 2021 period was primarily due to a $700,000 in higher game sales and an increase of $600,000 in additional revenues earned through the development of simulation platforms using our rFactor 2 platform for third parties. These increases were primarily offset by $1.1 million in retail pricing concessions.\n\nThe increase in our esports segment revenues was primarily driven by the 24 Hours of Le Mans esports event held in January 2022. We see continued revenue from our back catalog, and we also see there is a revenue tail stretching out several years from launch with our back catalog product offerings. The net loss for the six months ended June 30, 2022, was $23.5 million compared to the six months ended June 30, 2021, net loss of $20 million, a $3.5 million increase in net loss was primarily due to $9.4 million increase in goodwill and intangible asset impairment, noncash; a $2 million increase in development expenditures; a $1.5 million increase in sales and marketing spend; a $1.4 million decrease in equity method investment income; a $900,000 increase in foreign currency losses; $600,000 lower gross profit; and $200,000 in higher interest expense. This was offset by $12.7 million of lower general and administrative expenses and $1.4 million of lower equity method income.\n\nFor the six months ended June 30, 2022, adjusted EBITDA loss was $10.5 million compared to $6.5 million adjusted EBITDA loss for the six months ended June 30, 2021. The $4 million increase in adjusted EBITDA loss was primarily driven by the same factors as the increased net loss for the six months ended June 30, 2022, compared to the six months ended June 30, 2021. We expect to experience operating losses for the foreseeable future as we continue to incur expenses to develop new game franchises. The company's existing cash on hand is insufficient to fund its current operations for the next 12 months.\n\nWe are currently seeking debt and/or equity financing. We also have the ability to modify our product roadmap to decrease the short and/or long-term need for working capital. As Dmitry said, our priority is to continue rolling out fun, well-performing, revenue-generating games for racing fans worldwide while managing our liquidity. Thank you for joining us today.\n\nAnd now let's go to questions. Operator?\n\nOperator\n\nThank you. And at this time, we will be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for questions. Our first question comes from the line of Jason Tilchen with Canaccord Genuity.\n\nPlease proceed with your question.\n\nJason Tilchen -- Canaccord Genuity -- Analyst\n\nYeah. Thanks for taking the question. I have two. The first one is, just wondering on the expansion pack that's coming in September, there's any details that you can share about some additional features that maybe could be coming with that? And then on the NASCAR Ignition title for next year, is there any better sense of the timing of that? And any update on the development progress there?\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nJason, thanks for the question. So we are planning to announce some of the details about our 2022 season expansion pack relatively shortly here. We're still slating September/October time for that release. We hope that with that release, we will be able to bring people back into our NASCAR 21: Ignition game and kind of rejuvenate their interest since the game has been essentially fixed for some of the really irritating issues that some folks experienced during the launch period.\n\nSo we're really looking forward to it and more details will be announced really soon here. And as far as timing of our 2023 release, we are currently slated to release that during summertime, continuing to bring our efforts to bring that title closer to the beginning of the NASCAR season. That one will be a rebuild. It is something we've been currently working on.\n\nIt is a shared platform, our shared Motorsport Games common engine that we've been working on diligently here which will be shared among our other racing franchises like INDYCAR, Le Mans, and BTCC. And as I mentioned, it is slated as right now to be released around the summer next year.\n\nJason Tilchen -- Canaccord Genuity -- Analyst\n\nGreat. That's very helpful. And then just one other one. You mentioned that you're still exploring the funding options, both debt and equity, potentially on the table.\n\nIs there any sense of maybe a timeline for when that decision could be made or maybe have to be made? And then in the press release, you talked about potential cost-control initiatives or changes to product roadmap. Just wondering if there's any sense -- if there's anything at the top of that priority list should either of those scenarios come to vision, what may be on the table?\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nSure. This is a priority for management team and the company right now in terms of making sure that we solve our liquidity concerns. There continues to be multiple options. We have not made any decisions -- and as soon as we do, of course, that will be an announceable event for us.\n\nSo we look forward to bringing that to the market. Now as far as different cost-cutting initiatives, mainly, we looked at all the different type of G&A expenses, different groups of vendors that we could currently do without just to make sure that we continue to invest in the product development, which continues to be our utmost priority for us. So you would think of anything that has to do with the product releasing and the quality of that product being released will be where our resources will be focused and anything else that is not that, we will explore any and all types of cost-cutting opportunity to continue to be as lean as we possibly can.\n\nJason Tilchen -- Canaccord Genuity -- Analyst\n\nGreat. Very helpful. Thanks a lot.\n\nOperator\n\nOur next question comes from the line of Michael Kupinski with NOBLE Capital Markets. Please proceed with your question.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nThank you. And good afternoon, everyone. Dmitry, you mentioned that you've taken some costs out of the business, particularly in G&A. And I was just wondering, can you give us an idea of what the current burn rate per month might be for the company?\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nI'm going to let Jon unmute.\n\nJon New -- Chief Financial Officer\n\nHey, Mike. How are you?\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nHi.\n\nJon New -- Chief Financial Officer\n\nYeah, you can look at our cash flow and you can see that operating cash flow $12 million for the six months. So that's pretty consistent. So you're dealing with $2 million a month burn there and coming down slightly through reductions. So call it $2 million for the six months, a month.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. OK. And then, Dmitry, if you can just talk a little bit about just following up on the previous caller's question? You have a promissory note with Motorsport Network based on available liquidity. Do you know what their available liquidity might be at this point? Do they have this $12 million?\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nYeah. OK, great. Thanks, Mike, for the question. So while the $12 million line of credit from Motorsport Network remains in existence.\n\nGiven the current state of the global financial markets, we assessed the risk of exposure to nonperformance of this lender. And at this time, we're really not relying on this line as a potential source of liquidity. As we believe that there might be a substantial likelihood that any funding request by us will not be necessarily fulfilled for this foreseeable future.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. And then in terms of the available options, then, what do you see then as the best available option at this point might be? It sounds like you're continuing to keep your title rollouts pretty consistent with what you had before. Do you feel comfortable then that there are other available funding options? Or do you think that it's more likely that maybe some of the timing of the titles might slip a little bit as you kind of look at the product roadmap and the liquidity issues?\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nWe continue to prioritize our product release schedule and anything and all types of investments that are related to us delivering the products and quality products on time. Therefore, so far, you don't see any of these material changes to our product release cycle. Our financing options are continuing to be explored. We haven't made a decision as to which one.\n\nAnd I would like to do this relatively quickly just to make sure that we'll continue to invest in additional opportunities that we want to explore. And right now, those, let's call it, additional auxiliary opportunities are not something we could explore until we improve our liquidity position. So, therefore, I'd like to really come to a resolution here relatively quickly.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. And then the other options would be that you could seek partners, right, in terms of looking at some of the products and the rollouts and things like that. Are there -- what are the options in terms of seeking partners for specific products and product rollouts?\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nCorrect. That is apparel option that we're exploring. We have had conversations with some name brand partners who could potentially be in the publisher type of role for some of our selected titles. We have not come to any sort of decisions.\n\nWe're continuing to explore that as an additional option and see if us partnering with somebody, not only helps us with the distribution and reach for some of our titles, which would be kind of qualification No. 1, we would look from a publishing partner, but also could potentially improve our liquidity position if there's some upfronts or other types of normal customary things so that could become available. But nothing has been settled yet. Those discussions are active and we continue to explore any and all of those type of opportunities.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nAnd Dmitry, I guess the biggest concern for some investors would be that another company would come in and just buy the company at current levels. I mean, it would -- with the valuation there is trading, it would just -- it would look pretty compelling. What are the -- I mean, at this point, you're not interested in selling the company and you think that there's obviously significant upside with these products that as they roll out that would create a lot of shareholder value. I just wanted to hear your thoughts in terms of the potential and seeing interest from others about just buying the whole company at this point?\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nPriority for us is to deliver great products to our fan base, right? We have not created enough products for each one of our franchises to really sort of showcase what we're capable of, right? Some of that abilities will be showcased next year when we have at least three more franchises and markets. So it's not just NASCAR, but we'll have NASCAR, INDYCAR, and Le Mans. I think only at a point in time where we have multiple franchises in the market, we're able to showcase efficiencies and economies of scale on what our Motorsport Games engine is able to deliver, and that, of course, to potentially translate into our financial results. Only then I think we could have meaningful conversations with strategics to give us something that could be considered a fair market value.\n\nIf we're looking at our current market cap, I'm not sure that, that potentially reflects that right now, but that is just a personal opinion.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nOK. Great. That's all I have. Thanks for all the color.\n\nAppreciate that.\n\nOperator\n\nThank you. [Operator instructions] And it looks like we have reached the end of the question-and-answer session. [Operator signoff]\n\nDuration: 0 minutes\n\nKen Godskind -- Director of Operations\n\nDmitry Kozko -- Executive Chairman and Chief Executive Officer\n\nJon New -- Chief Financial Officer\n\nJason Tilchen -- Canaccord Genuity -- Analyst\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nMore MSGM analysis\n\nAll earnings call transcripts"
}