{
  "companyName": "Smith Micro Software",
  "companyTicker": "SMSI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/smith-micro-software-smsi-q2-2022-earnings-call-tr/",
  "content": "Smith Micro Software (SMSI)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day and welcome to the Smith Micro second quarter 2020 earnings conference call. All participants will be in listen-only mode. [Operator instructions]. After today's presentation, there will be an opportunity to ask questions.\n\n[Operator instructions]. Please note, this event is being recorded. I would now like to turn the conference over to Charles Messman vice president of investor relations and corporate development. Please go ahead.\n\nCharles Messman -- Vice President of Investor Relations and Corporate development\n\nThank you, operator, and good afternoon everyone. We appreciate you joining us today to discuss Smith Micro Software's financial results for second quarter ended June 30, 2022. By now you should have received a copy of the press release with the financial results. If you don't have one and would like one, please visit the investor relations section of our website at www.smithmicro.com.\n\nOn today's call we have Bill Smith, our chairman of the board, president, and chief executive officer; and Jim Kempton, our chief financial officer. Please note that some of the information you'll hear during today's discussion consist of forward-looking statements, including without limitation those regarding the company's future revenue and profitability, our future plans, new product development, new and expanded market opportunities, future product development, migration and growth by our new and existing customers, operating expenses, company cash reserves and the expected impact of last year's acquisition of Avast family safety mobile business, on our business strategy, operations and financial positions going forward. Forward-looking statements involve risks and uncertainties which could cause actual results or trends to differ materially from those expressed or implied by forward-looking statements. For more information, please refer to the risk factors included in our most recent filing Form 10-K and in our subsequent filings on Form 10-Q.\n\nSmith Micro assumes no obligation to update any forward-looking statements, which speak to out managers beliefs and assumptions only as the date they are made. I want to point out in forthcoming prepared remarks we'll refer to specific non-GAAP financial measures. Please refer to our press release disseminated earlier today for a reconciliation of these non-GAAP financial measures. That said, I'll turn the call over to Bill.\n\nBill?\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nThanks, Charlie. Good afternoon and thank you for joining us today for our 2022 second quarter conference call. Over two years ago in February of 2020 Smith Micro embarked on a mission to takeover absolute industry leadership and the delivery of digital family lifestyle solutions for wireless carriers around the world. The first step of this journey was the acquisition of Circle Media's carrier business, through which we gained contracts with T-Mobile, US, and Sky in the UK.\n\nA little over a year later, in April of 2021, we concluded the second acquisition. This time we acquired Avast family safety business securing additional contracts with Verizon, AT&T, and WINDTRE, a Hutchison property in Italy, as well as additional business with T-Mobile US. While the additional contracts significantly expanded our business space, the acquisitions also provided significant intellectual properties which afforded us the opportunity to leapfrog our product offering to be the absolute best available. As we have discussed on prior investor conference calls, when we set out to consolidate the best features of the acquired technology into our SafePath digital family lifestyle platform we had to significantly grow our engineering teams to meet that goal.\n\nThe exciting news is that, we are quickly approaching the completion of our mission. In March of this year, we completed the integration of the best of the Circle code base which culminated in our launch of the first release of SafePath 7. We are now about to complete the integration of the best of the Avast code base into SafePath 7 as well. This has been a massive undertaking for our engineering teams and the successful completion will allow us to migrate all of our customers to the same SafePath platform going forward.\n\nThe achievement of the migration will also result in another profound effect on our business, as it allows us to significantly reduce our operating expenses beginning in the current third quarter. We expect that the full effect of the cost optimization will be realized by the start of the second quarter of 2023. As we have stated during our previous earnings calls, since the acquisition from Avast, we also anticipate a rebound of our gross margins into the 80% to 90% range. After all customers are fully migrated.\n\nThe resulting profit margin should fall in the mid 20% range. None of this is new as we've stated this consistently since the acquisition from Avast. What is new is that we are at a point in time when the mission is virtually complete and the acquisition synergies can start to be realized. We expect to release the last build of the legacy Avast Ring platform in Q4 of this year with required updates to support the latest Android and Apple iOS releases.\n\nThere will be no new releases of the legacy Circle platform. And we will officially end of life the Avast platform in midyear 2023, by which time we will have no remaining customers on the platform. This means that all customers will be operating on the SafePath platform. Overall, we are anticipating that these synergies would result in a quarterly operating expense reduction of over $3 million versus Q2 2022, by the end of Q1 2023.\n\nNow, a quick recap of our Q2 quarterly results. Revenue of $12.7 million for the quarter came in relatively flat when compared to Q1 2022. This revenue softness represents the continued decline of legacy Sprint revenues from both the CommSuite and safe & found product families. Spread CommSuite revenues were essentially end in Q3 2022.\n\nThe non-GAAP loss was slightly higher than guidance due to additional contract engineering being deployed to complete the migrations to SafePath. As you can tell, we've been quite focused and we are very excited to begin the next phase as a company, a period that should bring strong recovery, operating results and exciting growth for the company's business case. Now, let me turn the call over to Jim to detail our second quarter results. Jim?\n\nJim Kempton -- Chief Financial Officer\n\nThanks, Bill and good afternoon everyone. As a reminder, we acquired the Avast family safety mobile business in April of 2021, which impacts the period over period comparisons that I'll be covering today. Now I'll cover the financial details for the second quarter of 2012. For the second quarter, we posted revenue of $12.7 million, compared to $15.9 million for the same quarter last year, a decrease of approximately 20% as a result of the decline in CommSuite revenues coupled with a decrease in Family Safety revenues.\n\nWhen compared to the first quarter of 2022, revenue was essentially flat. Year-to-date revenues through June 30, 2022 were $25.4 million versus $27.3 million during the second quarter of last year. The $1.9 million decrease is due to the decline in CommSuite revenues offset by the increase in family safety revenues resulting from the acquisition from Avast in April 2021. During the second quarter of 2022 family safety revenue decreased by about $1 million or 9% compared to the second quarter of last year, primarily as a result of the reduction of the legacy safe & found platform revenue related to the continued attrition of legacy Sprint subscribers driven by T-Mobile's acquisition of Sprint.\n\nFamily safety revenues decreased 2% sequentially compared to the first quarter of 2012. During the second quarter of 2022 CommSuite revenue was $1.4 million, which decreased approximately $2.5 million, compared to $3.9 million in revenue produced in the second quarter of last year. Revenue from CommSuite was essentially flat sequentially compared to the prior quarter. As we've discussed on prior calls, the decline in legacy Sprint subscribers on the CommSuite platform is driven by those subscribers having the option to move from Sprint to the T-Mobile network for voice services.\n\nAs more and more subscribers transition off to Sprint network, CommSuite revenues have continued to decline. Given the current revenue trends for the subscriber base, we are expecting very modest amounts of revenue from the legacy Sprint subscribers in the third quarter. After which we would anticipate this revenue stream would be essentially exhausted. Boost formerly owned by Sprint is now part of DISH.\n\nWith the contract that we execute with DISH during the first quarter, we are expanding our relationship with DISH on the CommSuite platform with the goal to increase CommSuite subscribers over time. ViewSpot revenue was approximately $1.1 million for the second quarter of 2022, which increased by approximately $300,000 compared to the second quarter of last year and up approximately 16% compared to the first quarter of 2022. ViewSpot revenue is comprised of both fixed and variable components. The fixed portion of the revenue is related to license fees and is generally the recurring component of the revenue.\n\nThe variable portion of the revenue is related to device and promotional campaigns. And the timing and volume associated with this portion of the revenue stream is less predictable. With the launch of SafePath 7 in the first quarter as one of the Tier 1 U.S. wireless carriers and the expected migration in another Tier 1 U.S.\n\ncarrier to this platform later this year we believe that we have a significant opportunity to grow the subscriber bases at our U.S. Tier 1 carrier customers in the coming quarters. However, while we are seeing pockets of marketing efforts at certain carriers, we are not expecting a significant increase in subscribers in the third quarter given the activity to date. We continue to expect that growth will be aligned with the timing of several marketing initiatives, which we will anticipate will be initiated by our carrier customers later this year.\n\nAs such, we expect consolidated revenue for the third quarter to be lower by 5% to 10% compared to the second quarter of 2022. For the second quarter gross profit was $9.1 million, compared to $12.6 million during the same period last year. Gross margin was 71.5% for the second quarter compared to 78.9% in the second quarter of last year. The gross profit of $9.1 million in the second quarter was flat with the gross profit produced in the first quarter of 2022.\n\nIn the third quarter, we expect gross margin to be down by 1% to 2% from the current run rate due to the anticipated decline in revenue. Our longer-term goal for gross margin is to be back in the range of 80% to 90%. To achieve this goal we will optimize third party applications and service contracts used by the combined business upon the migration of our family safety carrier customers onto a single family safety platform. Once we can fully transition all the carriers off the Avast Ring platform onto our SafePath platform, we expect to be able to realize synergies that will help us drive our gross margins toward our targeted gross margin.\n\nGiven the revised timeline of one of the migrations that Bill will be discussing in his commentary, we expect that these synergies will likely not be fully realized until the second half of 2023. For the year-to-date period ended June 30, 2022 gross profit was $18.2 million compared to $22.4 million during the corresponding period last year. Gross profit was 71.5% for the June 30, 2022 year-to-date period. GAAP operating expenses for the second quarter were $17.5 million, a decrease of approximately $200,000 or 1% compared to the second quarter of last year.\n\nThe decrease was driven by a decline in amortization expense and acquisition cost, as the acquisition of the Avast family safety mobile business was completed in the second quarter of 2021, partially offset by the increase in contractor costs associated with the SafePath migration and the increase in severance costs in the second quarter of 2022. GAAP operating expenses for the year-to-date period ended June 30, 2022 was $33.6 million, an increase of $2.8 million or 9% compared to last year. Non-GAAP operating expenses for the second quarter were $14.1 million compared to $12.9 million in the second quarter of 2021, an increase of approximately $1.3 million or 10%. Sequentially, non-GAAP operating expenses increased by 6% from $13.4 million in the first quarter of 2022 due to the increase in contractor costs related to the SafePath migrations.\n\nAs a frame of reference, the contractor costs associated with the migrations was approximately $1.4 million during the second quarter. We expect third quarter 2022 non-GAAP operating expenses to decrease from the second quarter by 4% to 6% because, as Bill had mentioned, we anticipate completing the development related to our SafePath migrations this quarter and anticipate eliminating substantially all of the development contractor resources by the end of this quarter. We have already begun ramping down the resources associated with the migrations and released a portion of these resources in June and July. We also anticipate a much more significant decline in operating expenses in the fourth quarter as a result of the completion of these development activities.\n\nNon-GAAP operating expenses for the year-to-date period through June 30, 2022 was $27.5 million, an increase of $5.5 million or 25% compared to last year, primarily driven by the addition of the Avast business in April 2021. The GAAP net loss for the second quarter was $8.5 million or $0.15 loss per share, compared to a GAAP net loss of $5.2 million or $0.10 loss per share in the second quarter of last year. The non-GAAP net loss for the second quarter was $5.1 million or $0.09 loss per share, compared to a non-GAAP loss of approximately $300,000 or $0.01 loss per share in the second quarter of last year. The GAAP net loss for the year-to-date period was $15.5 million, a $0.28 loss per share, compared to a GAAP net loss of $8.4 million or $0.17 loss per share for the prior year-to-date period.\n\nThe non-GAAP net loss for the year-to-date period ended June 30, 2022 was $9.4 million or $0.17 loss per share, compared to a non-GAAP net income of approximately $400,000 or $0.01 of diluted earnings per share last year. Within today's press release we have provided a reconciliation of our non-GAAP metrics, the most comparative GAAP metric. For the second quarter the reconciliation includes adjustments for intangible asset amortization of $1.6 million, stock compensation expense of $1.1 million and severance-related costs of approximately $700,000, including approximately $600,000 of additional stock based compensation expense. For the year-to-date period, the reconciliation includes adjustments for intangible asset amortization of $3.2 million, stock compensation expense of $2.2 million and the severance-related costs of approximately $700,000.\n\nDue to out cumulative net losses over the past few years, our GAAP tax expense is primarily due to certain state and foreign income taxes. For non-GAAP purposes, we utilized a 0% tax rate for 2022 and 2021. The resulting non-GAAP tax expense reflects the actual income taxes expense during each period. From a balance sheet perspective, we reported $5.4 million of cash and cash equivalents as of June 30, 2022 and no borrowings under our line of credit, which had a maximum funding capacity of $7 million.\n\nEarlier today in order to supplement our liquidity, we announced the closing of a $15 million convertible note transaction primarily with [Inaudible] capital management, a longtime shareholder of Smith Micro. We've also entered into an agreement to complete a $3 million equity offering off the shelf with [Inaudible] again as a key participant. These transactions will provide additional liquidity to the company as we complete the migrations to SafePath enbridged the company to the expected ramp in revenues that we're anticipating in the fourth quarter of this year and in 2023. In conjunction with entering into the convertible note transaction we terminated the Wells Fargo revolving credit facility.\n\nThe key terms of the convertible note transaction include a December 31, 2023 maturity coupled with amortization payments beginning April 1, 2023. Amortization that can be paid either via cash or equity at the company's election, if paid in cash, the repayment is a 103% of the amortization installments. If paid in equity, the equity is subject to a discount from the market price during the amortization period. The notes bear interest at 6% and our paid quarterly, the conversion feature is at $3.35 per share, which represents a 12% premium to the average of the last five closing price of the stock through August 10.\n\nWarrants were issued in conjunction with the notes, with the strike price also at $3.35 per share. These warrants have a five year term and represent 50% coverage on the notes. Regarding the equity transaction, we're expecting the transaction to close tomorrow, subject to customary closing conditions. For the agreement, we will sell in aggregate of $3 billion of common stock at $2.65 per share, together with an equivalent number of warrants with a strike price of $2.65 per share.\n\nSimilar to the capital raise from the notes transaction we expect to use the proceeds of the equity offering for general corporate and working capital purposes. For additional information, please refer to the 8-K filed earlier today related to these transactions. This concludes my financial review. Now back to Bill.\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nThanks, Jim. So I started out by talking about how we are progressing on our plans to consolidate the very best of our acquired technologies into our SafePath platform and the resultant streamlining of operations to reduce our overall operating expenses. Our drive to profitability requires both cost containment, as well as customer revenue growth. Now let's focus in on how we can plan to grow our revenues going forward.\n\nIndustry data indicates that all three Tier 1 carriers in the US had between $15 million and $20 million multi-line family plan subscribers. While there are thousands of other subscribers at each carrier's universe that are interested in digital family solution, let's just focus in on the multi-line users first. Since we believe this group represents the most likely source for SafePath subscribers. Based on our customer discovery efforts, we believe that SafePath subscriber population in the range of 3 million to 5 million subscribers seems to be attainable for each of our three Tier 1 customers by 2025.\n\nTo achieve this ambitious goal we have built out a strong marketing team at Smith Micro to develop best practices for promoting safe path. This team works with our carrier customers to develop coordinated marketing campaigns that are multi-faceted by design to grow each customer's SafePath user base. We see this as a very important service that we provide to our customers. It also feeds the enabling engine to meet our goals.\n\nAdditionally, we have developed a strong product roadmap designed to deliver new innovative capabilities to the SafePath platform going forward. Much like SafePath drive and SafePath home, these new features will deliver new platform services to an already best of class solution. The SafePath platform today and extending into the future supplies a group of turnkey family offerings that when deployed properly can deliver impressive revenue growth. Now let's take a look at updated project status by customer.\n\nAs we discussed on our last call, we launched the first version of SafePath 7 at T-Mobile in late March of this year, which was a successful migration effort from the legacy Circle product onto our SafePath platform. We continue to partner closely with our counterparts this customer as we prepare for the next phase, during which we will enhance the product with more features and functionality to fuel growth of subscribers. While this phase has not moved forward as quickly as we had anticipated, the launch of these product enhancements should help drive the subscriber growth that we envision. We also completed some additional work around the legacy safe & found product to bring it up onto the SafePath 7 platform, which we expect will help reduce the churn we have been experiencing over the past few years and stabilize the revenue streams associated with this product offering.\n\nAs we look at Verizon, we remain focused on our efforts to migrate the solution to the SafePath platform. Since our last call, we have been requested by the customer to add an additional feature to the code base, not required for migration which is going to push the launch of Verizon on SafePath to late Q1 or early Q2, 2023. However, the core SafePath development efforts related to this client are nearing completion, which will allow us to reduce our investment in resources as I noted in my opening remarks. While I'm disappointed that we were not able to launch this product into the market by the end of the year, I am satisfied with where we are in the process.\n\nOn the marketing side, we continue to push forward with new initiatives to build out a long-term multi-channel approach to drive new subscriber growth. Throughout the quarter, we have rolled out several different types of campaigns to raise awareness of Smart Family, not only to potential new subscribers, but also to the Verizon employee base. These campaigns are a critical step in our marketing plan as we gain more visibility across the entire Verizon organization, particularly as we look to take advantage of Horizon infrastructure already in place, such as retail stores, care organization, CRM and digital. For example, a back-to-school campaign is presently being promoted across several channels simultaneously through different groups within Verizon.\n\nThere is still work to be done, but we are making good progress as we identified the different Verizon teams, get to know their internal processes and execute different initiatives. This will help us prioritize the smart family platform throughout the entire Verizon organization, which we expect to help drive subscriber growth. From an AT&T perspective, we remain very bullish on the opportunities ahead. First, the progress of the migration efforts remains on target as we work toward a successful launch before the end of 2022.\n\nOur core SafePath development efforts are nearing completion, which should allow us to significantly reduce our operating expenses over the coming quarters. We also are continuing our awareness activities throughout different organizations within AT&T. They can assist marketing efforts, delivering promotional budgeting and assist in training the support organization. OK.\n\nLet me briefly talk about ViewSpot. Now that the development phase of ViewSpot studio is complete and we've upgraded our current customers onto the platform, we can shift our focus to growing ViewSpot revenues going forward with a new feature set. This new feature set delivers a more fluid user experience for rolling out new retail campaigns, as well as a wealth of new analytical features for real-time reporting of carrier retail operations. As Jim mentioned in his prepared remarks, our CommSuite solution in Sprint continues to decline as we had anticipated.\n\nThe revenue decline from the legacy business is partially complete. On the DISH front, we continue to push forward as they roll out their new network offerings, which we see as future upside potential for the product in 2023 and beyond. Before I conclude my comments, let me speak briefly about the capital raise that we announced earlier today. [Inaudible] capital management has been a meaningful shareholder of Smith Micro for many years.\n\nThis raise, as Jim said, is comprised of $3 million of equity funding and $15 million of convertible debt and provides the company the opportunity to bridge our capital resources into 2023 when we expect to resume the creation of free cash flow. At the same time this funding has replaced $7 million revolving line of credit that we had established with Wells Fargo Bank, which we terminated in connection with the capital raise. We are thankful once again for the support of [Inaudible] capital as we believe the capital raise positions us for breakout growth in 2023. In conclusion, this is an exciting time for Smith Micro, our customers, employees and shareholders as we complete a massive consolidation project and now move forward as the leader in the family digital lifestyle market servicing wireless carriers around the world.\n\nThere is an enormous opportunity in front of us, not only with the big three in the US, but with other Tier 1 carriers in Europe and elsewhere in the world. Now we move to the revenue growth phase that coupled with the cost reduction efforts that we discussed today should drive profitability and the generation of strong free cash flow in 2023. With that said, let's open the call for questions, operator?\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions]. First question comes from Josh Nichols with B Riley. Please go ahead.\n\nJosh Nichols -- B. Riley Financial -- Analyst\n\nYes, thanks for taking my question and elaborating on the status for all the different carriers. In your comments, you did mention that you were pretty optimistic that you're going to see a nice bump back to growth in the fourth quarter, any visibility you could provide into what's going on in terms of the marketing campaigns, specifically at T-Mobile and what gives you confidence that that company is going to flip back to growth before the end of this year?\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nActually it's a combination of both T-Mobile and the efforts going on at AT&T. So it's not a single carrier driven event. I would say that we are working closely with both carriers, there are some strong plans in place and we believe they will be successful. As I said in my prepared remarks, the result already on ongoing marketing efforts underway at Verizon, and we also expect those to bear fruit going forward as well.\n\nSo that's basically how I'd answer that.\n\nJosh Nichols -- B. Riley Financial -- Analyst\n\nAnd then last question. So I think kind of hit on the topline and the opportunities there. On the opex side, so the company is going into cost reduction mode, now that most of the development work is done. Could you kind of just elaborate a little bit on the timing? I think you said like $3 million or something by mid next years, like, is that $3 million a quarter that you're expecting to reduce operating expense from the 2Q run rate or how much is opex can come down over the next 12 months?\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nYes. Again in my prepared comments, everything is in excess of $3 million off of the opex run rate that we have for Q2. And it would be fully in effect we believe by the end of Q1, 2023.\n\nJosh Nichols -- B. Riley Financial -- Analyst\n\nGot it. Thank you. And then last question, just as it was mentioned in the press release. I think you've talked about the three US carriers a lot, but you did also kind of hit on Tier 1 operators in Europe as well, any updates on that front?\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nThere's a lot of that activity as soon as we have something done, we will be -- we will raise to the market as you know, but nothing we can talk about today.\n\nJosh Nichols -- B. Riley Financial -- Analyst\n\nGreat, thanks.\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nThanks, Josh.\n\nOperator\n\nThe next question comes from Eric Martinuzzi with Lake Street Capital Markets. Please go ahead.\n\nUnknown speaker -- Lake Street Capital Markets -- Analyst\n\nHey, this is Kevin on for Eric. Thanks for taking my question. Kind of piggybacking off Josh's question. I know these Tier 1 guys have big marketing push in the second half.\n\nCould you kind of help us to better understand the timing around that as that kind of a maybe a Black Friday thing. And then overall, maybe just generally, what are you hearing from these carriers in terms of the health of the consumer and the appetite for family plan given inflation and whatever else they're battling right now?\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nIt's a great question. But I'm not sure how I can answer it. It really is a question you should be asking to carrier, but let me try to give some color. I would say that our approach to marketing for SafePath going forward is a multifaceted approach.\n\nIn other words, we wanted to see activity in the stores, in the care organizations, online, digital, etc. So it's a multi-pronged overall approach. And this is really based on history, we've seen this in the past, it was a techniques that we saw developed during this very successful growth of the Sprint business a few years ago and we believe it will work very, very well going forward. As far as the overall state of the industry, all the carriers have reported their earnings and all -- I've pretty much to talk to that.\n\nSo I don't know that I can add anything to your question there.\n\nUnknown speaker -- Lake Street Capital Markets -- Analyst\n\nOK. Sounds good. I guess I'll leave it at that. Thanks.\n\nOperator\n\nThe next question comes from Jim McIlree with Dawson James. Please go ahead.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nThank you. Good afternoon. In times past you've talked about the carriers in Q4 focusing on subscriber additions rather than signing customers up for new services. So just wondering if you could talk about that dynamic relative to the AT&T launch, as well as getting more aggressive with T-Mobile in Q4?\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nThat's a good question, Jim. And I will say this, that the primary focus of the carriers, especially at the retail point is focused on customer acquisition and the selling of new plants and new handsets. That said, we still believe that there is a lot of work that can be done now on selling value-added services like what we're talking about with SafePath. When we now talk about -- and I've given you some numbers for the first time, where we're looking at a installed base of 3 million to 5 million subs per carrier for the big three here in the US.\n\nYou're now reaching a very meaningful number, if you look at the Street price for the SafePath offering, it's about $10 per month recurring, you add in other add-on services like home and drive that goes on top as well as IoT. So we're not talking about a small amount of money, you can run the numbers yourself. If you're sitting with 5 million subs times $10 bucks, times $12, this is a meaningful number for any one of our three Tier 1 carriers. So this is something to stay focused on.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nOK, thank you. And secondly on -- you talked a lot about migrating the technology all to one platform. But you still have separate marketing and revenue contracts with the carriers, do those need to be renegotiated as well as part of that technology migration, or is that completely separate discussion?\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nThese are conversations that are on ongoing with all of our customers. As we start to move forward and as we have now expanded out some of our service offerings, like all the added marketing service for best practices and things like that, there is an opportunity to look for additional revenue growth there as well. This is a process that will be on ongoing. I don't think that anything that I've talked about as far as the growth of revenue in Q4 or in the beginning parts of 2023 are really dependent upon that.\n\nThe revenue growth in these earlier periods are going to be driven off the fact that we now have all the customers on a much better product offering with SafePath 7 that gives them a lot more to sell to their customers and we've already seen the response from customers at T-Mobile, they love the new products. So it's just a matter now of getting the marketing efforts to go along with all the positives.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nOK. And my last one. Jim, can you clarify what you said about CommSuite revenues? I thought you said that they go to zero in Q4, but don't you still have Boost revenues from CommSuite?\n\nJim Kempton -- Chief Financial Officer\n\nNo, I was speaking specifically about the legacy Sprint, T-Mobile revenue stream. So based on where we saw the run rates, especially coming out of June. We're expecting that to ramp down in Q3 and be very nominal if anything in Q4, just -- that's specific to the T-Mobile, Sprint revenue stream. The DISH side, we feel that's going to continue at its current rate and we anticipate that in future periods we will have an opportunity to actually grow that revenue streams.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nGot it. Great. Thank you. I appreciate it.\n\nThat's it for me.\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nCertainly. Thanks, Jim.\n\nOperator\n\nThe next question comes from Scott Searle with ROTH Capital. Please go ahead.\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nHey, good afternoon and thanks for taking my questions. Hey, maybe Jim just to quickly follow up on Jim's question. As it relates to comp suite. So, T-Mobile and Sprint coming out of the equation, but how big was that in the second quarter.\n\nJust help us calibrate what that baseline number is. I thought we were kind of getting close to it in the past couple of quarters as it was. And then Bill, clarification on the 3 million to 5 million number or figure that you gave per carrier, was that account was that subscribers that you thought were addressed. I just want to clarify that it was accounts for subscribers or adjustable with each carrier?\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nYes, why don't you go first and I'll follow.\n\nJim Kempton -- Chief Financial Officer\n\nOK. I'm going to answer it this way, Scott, in terms of what we saw is the exit run rate in June for this legacy, Sprint, T-Mobile was under $100,000. So that gives you a pretty good sense of the decline that we were seeing coming out of the quarter. And again, we expect that to be down to nothing or next to nothing by the fourth quarter.\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nGot you.\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nOK. Then Scott -- restate your question –\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nI'm sorry, I just wanted to clarify, Bill, when you're talking about the opportunity of 3 million to 5 million per carrier that's accounts or is that subscribers. I was assuming it was accounts, but I wasn't sure.\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nYes, the way we look at it is a family is a subscription. So when we are talking about million 3 to 5 million, we're looking at family coverage on a go on a go-forward basis. And quickly let me add, as I stated, we think this is attainable by 2025. So we're going to go into a gross growth spurt as we go through '23 and '24 to get to that, so it doesn't happen all at once.\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nGot you. Perfect. And if I could, I'm not sure if I missed this, but in terms of a little bit of a pickup into the fourth quarter, did you give any idea as to the magnitude of how you expect that to pick up in terms of SafePath revenues as we go from September to December.\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nI will try to talk about that more as we get closer to the fourth quarter.\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nGot you. And then lastly if I could. Jim, in terms of the opex coming down, that's $3 million per quarter given where you're expecting gross margins to respond to. I just want to make sure I'm thinking about this correctly that your breakeven then from an operating basis is in the $13 to $14 million range and you're expecting them to generate positive free cash flow in 2023.\n\nSo a ramp above and beyond that as we get into the second half of next year, is that the right way to be thinking about this?\n\nJim Kempton -- Chief Financial Officer\n\nYes. [Inaudible]\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nOK, perfect. All right, thanks guys.\n\nJim Kempton -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Charles Messman for any closing remarks.\n\nCharles Messman -- Vice President of Investor Relations and Corporate development\n\nThank you, operator and thanks everybody for joining today. We look forward to speaking to you on our next call. If you have any questions, please feel free to reach out to us at Smith Micro. Hope everyone has a great day.\n\nThanks again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCharles Messman -- Vice President of Investor Relations and Corporate development\n\nBill Smith -- Chairman, President, and Chief Executive Officer\n\nJim Kempton -- Chief Financial Officer\n\nJosh Nichols -- B. Riley Financial -- Analyst\n\nUnknown speaker -- Lake Street Capital Markets -- Analyst\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nScott Searle -- ROTH Capital Partners -- Analyst\n\nMore SMSI analysis\n\nAll earnings call transcripts"
}