{
  "companyName": "Rocket Companies, Inc.",
  "companyTicker": "RKT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/rocket-companies-inc-rkt-q3-2022-earnings-call-tra/",
  "content": "Rocket Companies, Inc. (RKT 0.29%)\nQ3 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Chris, and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Rocket Company's third quarter 2022 earnings call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions]. Sharon Ng, vice president of investor relations, you may begin.\n\nSharon Ng -- Vice President of Investor Relations\n\nGood afternoon, everyone, and thank you for joining us for Rocket Company's earnings call covering the third quarter of 2022. With us this afternoon are Rocket Company CEO, Jay Farner, our president and COO, Bob Walters, and our chief accounting officer, Brian Brown. Before I turn things over to Jay, let me quickly go over our disclaimers. On today's call, we provide you with information regarding our third quarter 2022 performance as well as our financial outlook.\n\nThis conference call includes forward-looking statements. These statements are subject to risks and uncertainties that could cause actual results to differ materially from the expectations and assumptions we mentioned today. We encourage you to consider the risk factors contained in our SEC filings for a detailed discussion of these risks and uncertainties. We undertake no obligation to update these statements as a result of new information or further events, except as required by law.\n\nThis call is being broadcast online and is accessible on our IR website. A recording of the call will be posted later today. Our commentary today will also include non-GAAP financial measures. Reconciliations between GAAP and non-GAAP metrics for our reported results can also be found in our earnings release issued earlier today as well as in our filings with the SEC.\n\nAnd with that, I'll turn things over to Jay Farner to get us started. Jay?\n\nJay Farner -- Chief Executive Officer\n\nThank you, Sharon, and good afternoon. Welcome to the Rocket Company's earnings Call for the third quarter of 2022. On today's call, I'll share how Rocket is executing on our strategy as we navigate these challenging market conditions, and how we continue to invest in our future. We'll discuss how we're innovating to better serve our clients and partners, and I'll provide an update on the progress of the Rocket platform.\n\nBefore we begin, I'd like to discuss the executive leadership changes that we announced last month. I want to thank our CFO, Julie Booth, who has been a tremendous leader during her 19 years with our organization, helping to guide the company through significant growth and expansion. I'm happy to say that Julie will continue to be with us as a strategic advisor. I'd also like to recognize Angelo Vitale, who has recently transitioned from his role as general counsel and secretary.\n\nAngelo has worn many hats during his 25-year tenure at the company. In addition to being our general counsel, Angelo has also served as CEO launching Rocket Central and as longtime executive vice president. Despite all of that, Angelo is best known as someone our leadership team can go to for trusted advice and sound counsel. On today's call, I'm also introducing Brian Brown, our current chief accounting officer, and incoming CFO and Treasurer, starting November 15.\n\nBrian joined Rocket in 2014 and currently leads the accounting, finance, treasury, and procurement teams. Brian is deeply knowledgeable about our business and has worked as a member of our leadership team for many years. Brian led our operational efficiency efforts this year, helping to reduce our expenses by more than $2 billion on an annualized basis. Brian also played an instrumental role in our IPO and has done an excellent job with our ongoing engagement with the investment community.\n\nI'm looking forward to working with Brian in his new role as chief financial officer, to execute on our strategy and help lead Rocket into the future. I'm also excited to welcome Tina John to her new role as general counsel. Tim joined us in 2020, following our IPO and brings extensive legal experience in securities, capital markets, corporate governance, and public company guidance to the leadership team. With that, I'd like to start by having a direct talk about the current state of the market.\n\nThe mortgage industry continues to face challenging times, 30-year fixed mortgage rates have eclipsed 7%, the highest in decades. The 300-plus basis point increase this year has been the largest and fastest since 1982. Housing affordability is at a 30-year low and weakening consumer sentiment is leading to a rapidly deteriorating home purchase market. While we typically see lower demand for purchase transactions in the fourth quarter, the sequential decline the industry is experiencing has been even more pronounced due to overall market weakness.\n\nAccording to the Mortgage Bankers Association, total mortgage applications are at the lowest levels since the mid-1990s, even lower than the 2008 financial crisis. Over the next several quarters, we expect to see significant separation between the well-capitalized players in the mortgage space, those who have clearly defined long-term strategic plans from those who don't. As we are seeing significant capacity will continue to come out of the system, further industry consolidation will take place, and those who aren't well capitalized will struggle with liquidity. In the end, only the strong will be left standing.\n\nThese cycles are nothing new for Rocket. The company has experienced and successfully navigated through several significantly challenging time periods throughout a 37-year history, each time we've been nimble, pivoting, and operating with flexibility and thoughtfulness that allow us to capitalize with every market shift. And each time, we've also invested heavily in strategies that provide us with a deep competitive advantage when the market corrects. As we continue through the current challenging cycle and when we ultimately emerge, we expect our robust capitalization and superior positions in brand, technology, data insights, client experience, and client engagement, paired with the sheer scale of our existing client interactions to allow Rocket to further expand its market leadership.\n\nHousing will always be critical to the American economy. It's nearly 20% of the U.S. GDP, and we believe there's a huge long-term opportunity for the winner in this industry. The investments we're making today will fundamentally disrupt and transform the way mortgages are done from client acquisition to conversion to loan production.\n\nWe will continue to lead and innovate and further widen the gap between Rocket and other mortgage lenders. In just 2022 alone, more than 2.4 million Americans have transacted with us on the Rocket platform. representing unique clients across homes, loans, Rocket money, and other businesses, showing the true depth and breadth of our reach. The home purchase market, which remains highly fragmented and inefficient represents a significant opportunity for Rocket.\n\nA National Association of Realtors report showed that four in 10 homebuyers are now millennials, 75% of the clients who apply using Rocket's online platform or app, our first-time homebuyers and/or millennials. Rocket Money's clients also share similar demographics, and we continue to nurture and place them on the path to being future first-time homebuyers and rocket mortgage clients. In the past few quarters, we've responded quickly to our clients' needs in these challenging times of high inflation and volatile rates by bringing to market a slate of new innovative mortgage products. The fast rollout relaunch of these products was made possible through the power of our platform and the collaborative efforts of our capital markets, product strategy, technology, and marketing teams.\n\nIn September, we introduced our inflation buster program, which reduces a homebuyer's monthly mortgage payment by 1 percentage point in the first year of their loan. Inflation buster gives homebuyers a reprieve when they need it most in their first year, when they have the highest housing-related expenses such as moving costs and furnishing a home. Inflation buster has resonated with homebuyers and pairs well with our rate drop advantage program, which covers many of the costs to refinance in the years ahead if rates fall.  Last quarter, we placed renewed emphasis on our rate shield program, which gives our purchase clients confidence in a rising rate environment by locking in rates for 90 days while they search for a new home. Our home equity loan product has proven very popular for existing homeowners who are looking to tap the equity currently available in their house without sacrificing the favorable interest rates they have on their first mortgage.\n\nWe are also innovating to better serve our enterprise partners. Last quarter, we announced a new partnership with Santander, which went live in under 60 days. Mortgage volume through this partnership is ramping up quickly, with client applications outpacing initial projections. Over the next several quarters, we will extend our partnership to include full digital capabilities and additional client segments.\n\nTurning to our platform, the Rocket platform and its engagement tools are the engine that will expand the top of our funnel, lift conversion and lower our cost to acquire new clients, thereby driving growth in revenue and profitability over the long term. These tools allow us to keep our clients connected to and active within our brand until the moment they're ready to transact. This helps us eliminate the need to reacquire previous leads or compete directly for new leads, reducing our cost to acquire clients. Rocket can leverage the valuable insights we gain from our platform to make more personalized recommendations.\n\nRocket money, a key component of our platform continues its impressive growth, nearly doubling paid premium members year-over-year. To put the size of the opportunity into perspective, today, we have more than 24 million Rocket accounts, the single sign-on solution for the entire Rocket ecosystem. With these accounts, we have deeper insights into our clients, allowing us to provide a much richer experience through our platform. Last week, we announced our new Rocket rewards loyalty program, a key component of our platform.\n\nRocket rewards gives our clients points for taking certain actions, such as applying for a prequalified approval letter, utilizing mortgage affordability calculators, or reading informational articles about the home purchase process, ultimately helping to drive education and brand loyalty across the Rocket ecosystem. Early signs are very encouraging. Within the first 72 hours, over 70 million points were awarded to both new and existing Rocket clients for completing over 17,000 activities. While you may have seen membership or loyalty programs in other consumer industries such as hotels, restaurants, travel, and e-commerce, this is an industry first, and we believe a game changer for Rocket.\n\nWhen we surveyed our clients, a resounding 88% told us they value a Rocket-affiliated rewards program in a way that would encourage a long-term relationship with our brand. Rocket rewards will continue to create real value for first-time homebuyers, where affordability is the biggest challenge to achieving their goals. With these 24 million rocket accounts and robust engagement tools such as Rocket rewards and Rocket money, we are building ongoing relationships with our clients, engaging with them, reducing our cost to acquire, and extending lifetime value. Our robust capitalization, our fortress balance sheet and most importantly our team members' incredible passion for building these experiences will allow us to not only weather the storm but grow in today's environment and through the market recovery.\n\nThe investments we're making today will create shareholder value as we capture opportunities in the financial services space, the mortgage market, and beyond.  In these turbulent times, we remain focused on fulfilling our mission to be the best at creating certainty in life's most complex moments so that our clients can live their dreams.  With that, I'll turn it over to Brian to go deeper into the numbers.\n\nBrian Brown -- Chief Accounting Officer\n\nThank you, Jay, and good afternoon, everyone. Before we begin, I'd like to echo Jay's remarks regarding Julie and Angelo. I value my partnership with each of them, and I wish them both the best in their new roles. As you heard from Jay, the mortgage industry is facing significant headwinds in the second half of the year.\n\nRocket is operating in this difficult environment from a position of financial strength and with clear competitive advantages. On today's call, I'll cover the actions we're taking to improve our efficiency, including reducing our cost structure by more than $2 billion on an annualized basis. I'll also walk through the investments we're making in the Rocket platform, to continue to grow our business over the long term. It's important to begin by putting 2022 into perspective, rapid increases in interest rates and declining housing affordability are impacting demand for home purchases and refinancing at the same time.\n\nAs of mid-October, industry-refinance applications were down 86% year-over-year and home purchase applications were down 37%. While volume is clearly under pressure, there continues to be substantial excess capacity in the mortgage industry, increasing the competition for every loan. The industry is flooded with loan officers who are struggling to produce. In fact, our estimates suggest that industry volume per loan officer is near an all-time low at less than one loan per loan officer per month.\n\nThe economics are simply not sustainable, and capacity in the industry will continue to come out. Against this challenging backdrop, Rocket's third quarter results landed within our guided range for closed loan volume, net rate locks, and gain on sale margin. We generated closed loan volume of $25.6 billion, net rate locks of nearly $24 billion, and our gain on sale margin was 269 basis points, which was above the midpoint of our guided range. Rocket companies generated $888 million of adjusted revenue in the third quarter.\n\nWe delivered GAAP net income of $96 million, resulting in GAAP EPS of $0.04 per diluted share. On an adjusted EPS basis, we reported a loss of $0.08 per share. Turning to our balance sheet. Rocket's financial strength is a major strategic advantage for us as we weather the current market environment.\n\nWe ended the third quarter with $4 billion of available cash and $7.3 billion of mortgage servicing rights. Together, these two assets represent a total of $11.3 billion of value on our balance sheet, equating to more than $5.50 per share. Our $4 billion of available cash consists of $826 million of cash on the balance sheet and an additional $3.2 billion of corporate cash used to self-fund loan originations. Total liquidity stood at $8.8 billion as of September 30, including available cash plus undrawn lines of credit and our undrawn MSR lines, which includes a new $1.5 billion MSR facility put in place during the quarter.\n\nAs of September 30, our mortgage servicing portfolio included 2.5 million clients with $531 billion in unpaid principal balance. At the end of the third quarter, the value of our mortgage servicing rights was $7.3 billion. This reflects an increase of $1.9 billion year-to-date. During the quarter, the value of the MSR asset increased by $600 million, including a $400 million positive mark-to-market adjustment.\n\nWe also drive considerable recurring revenue from mortgage servicing. During the third quarter, we generated $360 million of cash revenue from our servicing book, which represents more than $1.4 billion of cash revenue on an annualized basis. Net client retention remained over 90% in the third quarter, well above the industry average. Regarding our expenses, we continue to execute a disciplined and prudent approach to cost management, on our last earnings call, we committed to a further reduction in total expenses from the second quarter to the third quarter of $50 million to $150 million, and we did just that, reducing expenses by more than $100 million during the quarter.\n\nLooking ahead to the fourth quarter, we anticipate a further reduction in total expenses of $50 million to $100 million compared to the third quarter. Over the past 12 months, we have taken significant action to reduce our overall cost structure. In fact, if we look at the third quarter of this year compared to the third quarter of last year on an annualized basis, we have reduced our expenses by more than $2 billion or approximately one-third of our total costs.  As we navigate and adjust to the current environment, we're continuing our long-term strategy of investing in our platform with an eye toward the future. Rocket leads with competitive advantages in brand, technology, data insights, client experience, and client engagement.\n\nThese competitive advantages are difficult to replicate and help us drive superior unit economics and increase client lifetime value. We are constantly looking to leverage these advantages to reinvest in our business and drive long-term growth. The investments that we're making in our platform will expand the top of the funnel and bring more clients into our ecosystem. In the past, we've had considerable success retaining our mortgage servicing portfolio, which today represents 2.5 million clients.\n\nDuring the record profitability years 2020 and 2021, nearly half of our mortgage volume came from existing clients already on our platform all in a nominal client acquisition cost, resulting in highly profitable unit economics. The broader Rocket platform, including Rocket money, and the recently announced Rocket rewards program helps expand our reach and increased conversion across the broader universe of 24 million rocket accounts. This is crucial because our platform helps keep our clients connected and active and also helps provide the valuable data and insights needed to make personalized recommendations, so at a size of 24 million accounts and growing, we believe we have a tremendous opportunity in front of us. The platform can also improve our already industry-leading unit economics.\n\nOne of the biggest challenges in the mortgage industry is the cost to acquire a client, which typically runs in thousands of dollars. In contrast, Rocket money can acquire a new client for less than $100, which is a significant difference, by bringing clients into our funnel at a lower cost of acquisition, in engaging and nurturing them in our ecosystem, and building loyalty earlier in their life cycle, we believe this will be a game changer for Rocket.  With a larger top of the funnel and a lower client acquisition cost, higher conversion through deeper client insights and personalized offerings, and client retention with increased lifetime value, Rocket has a significant advantage over others in the space. I would like to emphasize that we are investing with discipline, and we are laser-focused on tracking our progress and success. This is a process I've personally led with our operating leaders and will continue to monitor closely as the CFO.\n\nTurning to our outlook. We will be transitioning to a revenue-based guidance approach going forward. We believe revenue is a better representation of the totality of Rocket's businesses and more closely aligns with how we manage the company. Starting in the fourth quarter, we plan to provide one quarter forward-looking guidance on an adjusted revenue basis.\n\nThis quarter will be the last time that we provide forward-looking guidance on net rate lock volume and gain on sale margin. Rate locks and gain on sale margin will continue to be disclosed in our financial statements. For the fourth quarter, we expect adjusted revenue to be in the range of $600 million to $750 million, closed loan volume to be in the range of $17 billion to $22 billion, and net rate lock volume to be in the range of $15 million to $21 million. We anticipate gain on sale margin to be in the range of 230 to 260 basis points as we expect the impact from promotional products such as inflation buster to contribute to a quarter-over-quarter decline in margins.\n\nHowever, these products are still incrementally profitable to Rocket. The need for innovative products like inflation buster speaks to the affordability challenges that homebuyers are facing today. Our guidance assumes that the core mortgage business will continue to face headwinds given the challenging economic environment and that seasonality will also play a role as the fourth quarter is traditionally a seasonally low quarter, especially for home buying activity. As always, our forward-looking guidance is based on our current outlook and visibility into the fourth quarter, despite broader industry and economic headwinds and a challenging market, we are well-positioned in the current environment, and we'll continue to invest in the business to drive long-term shareholder value.\n\nWith that, we're ready to turn it back to the operator for questions.\n\nOperator\n\nThank you. [Operator instructions]. Our first question is from James Faucette with Morgan Stanley. Your line is open.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much I want to go back to one of the things that you said at the outset and should be self-evident, but you guys have had amazing staying power through multiple mortgage cycles in Rocket's history and as you pointed out, that's really a hard thing to do because they can be so volatile. In terms of your upcoming execution and the like, where do you think this experience is going to prove to be most valuable? How is it driving your decision-making in core business areas? And I guess as part of that, you've done obviously a good job reducing your expense base. But at the same time, you've always talked about trying to take advantage of these peers to gain share.\n\nSo just wondering how you're balancing those out right now.\n\nJay Farner -- Chief Executive Officer\n\nYes. Thanks, James. I'll start and then Brian can jump in as well. And I think we're seeing all of the lessons that we have learned, at least in the 27 years I've been here, come to play at this point in time.\n\nCertainly, the first thing that we've touched on before is just getting close to your business. And so as Brian and the team have done an amazing job of taking expenses out of the business, but it's critical that those expenses don't slow us down when it comes to the long-term vision of what we're creating. And so the only way to achieve that is to be very close to your business, so you can continue to execute on long-term strategies, not get caught up in the day-to-day and chase loans maybe that aren't profitable or make decisions that could harm you six months, 12 months later, but stick to that strategy. So the second piece of that is actually have a strategy.\n\nAnd you heard me today spend a lot of time talking about that. Regardless of what interest rates do, we at Rocket have to continue to grow the platform to allow for our growth, right? We cannot be thinking about when interest rates may come down. We've got to be thinking about how we increase our conversion rates, engage our client base, drive the lifetime value of loans, and that puts us in a position to win in a great market. And so that's exactly what you're seeing us do.\n\nAnd that's exactly what we've been talking about on today's call. Probably the Rocket rewards comments are the most relevant, so if you think about the marketing dollars that we're spending today to drive people in who are thinking about purchasing for refinancing their loan. As we know, many people aren't going to purchase right now. Homes have become more expensive, and there may not be an opportunity to pull cash out or save money on a monthly mortgage payment.\n\nSo how do we keep those clients on their mission to achieve their goal. Certainly, you can have emails and you can have tax message, you can have a brand, but that on its own won't reach the cost to acquire numbers of lifetime value that we need to separate ourselves from our competition. So this rewards program allows our clients, and we saw that in the first few hours or I should say, days of the program, 70 million points distributed, 17,000 actions taken that starts to prove out what we've heard from our client base that a program like this that allows them to participate, engage, ride down cost, and we'll continue to expand the program and the value it has to our platform, that's a critical piece of the puzzle that we've been building. So would we be able to roll out inflation buster, would we be able to roll out the rewards program? Would we be able to rebrand Rocket money? If we did not have these long-term strategies where we were deploying our tech and product strategy resources, we wouldn't. You'd get distracted in the day-to-day movement of the market.\n\nSo that's probably the biggest lesson for me and I think for our leadership team, we cannot control what the 10-year treasury will do on any given day. What we can control is investment in our capital, in the long-term value to differentiate our brand and our platform from everybody else. And so -- and that's exactly what you're hearing us talk about each and every call because that's what we're doing. Brian, I'll let you chime in.\n\nBrian Brown -- Chief Accounting Officer\n\nYes. Thanks, Jay. The only thing I would add is that to be able to do those things isn't an accident either. It's because of the financial strength of the company.\n\nAnd when you look at over $8 billion of equity, over $8 billion of liquidity, and $4 billion of cash on the balance sheet, this is a luxury that others in this space don't have. So this is an enactment that we ended up here. We all knew rates would rise. None of us knew exactly how fast it is, but we're well positioned for this market because of that financial policy and that financial strength.\n\nJay Farner -- Chief Executive Officer\n\nThat's exactly right.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThat's great. Thank you very much.\n\nJay Farner -- Chief Executive Officer\n\nOf course.\n\nOperator\n\nThe next question is from Kevin Barker with Piper Sandler. Your line is open.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nGood afternoon. Thanks for taking my questions. I just wanted to follow up on some of the cost-cutting efforts that you're making. I mean, obviously, you've been very aggressive through the first three quarters, which is typically not like Rocket, and you gave the guidance of $50 million to $100 million.\n\nI mean, would you be willing to cut expenses further going into early 2023, if we continue to have, is pretty aggressive or at least really tough origination market? And then when you think about the cost cuts that you've made here, how much more profitably think you'd be on the long run, if we were to return to like a normal market where we start to see maybe $2.5 trillion of origination.\n\nJay Farner -- Chief Executive Officer\n\nYes. I'll let Brian speak to some of the other ways that we're thinking about cost cutting, but maybe taking -- lifting up about to 50,000 feet and tying into the investments that we're making today, both on the marketing side, the lead generation side, the tech side. The decision-making, of course, is not based on the profitability of a day, a week, or a month. The decision-making is based on the metrics that will tell us that the investments we're making are going to pay off in the long run.\n\nI think Brian touched on the fact that in '20 and '21, nearly 50% of the mortgages that we did were clients that were in our servicing book. So there's virtually no cost to acquire. So if you think about and one of the driving forces for this platform tech build that we've been doing for years now is to think, well, how can we have 5 million clients in our database? How can we have 7 million clients in our database? How can we engage those 24 million people that have already created a Rocket account so as we see rates shift and adjust if there's an opportunity to help folks, we're not marketing to a $2.5 million client base, we're marketing to a $10 million client base, and that's the vision of what we're creating. And then you can take what we've done in the past and think about what that would mean to the profitability of the organization.  So as we're making investments today, the first priority is to have that confidence to say, OK, what we're doing now will lead to that long-term vision, which we know is highly profitable for our organization in the long run.\n\nI talked earlier about at the time, three or four days into the process, we had done $70 million rewards points. I think we're now up to $170 million. So we're watching the growth of this each and every day, clients in engaging, reading, giving us data, and all of that is what we will use to determine and Brian touched on this, are the investments, are the marketing dollars leading to the engagement that we know in the future will lead to the loan origination because when that turns, the profitability we receive is order of magnitude greater than what we might invest today that will not be highly profitable right now because we're focused on what it will be in the future. Brian, I know you touched on this in your remarks as well.\n\nBrian Brown -- Chief Accounting Officer\n\nYes. And I think, Kevin, the way I think about it is the cost reductions and these expense cuts protect those investments that we're making. And just to reiterate, if we look at Q3 to Q3 of last year, it's $2 billion of cost taken out of the system. That's about a third of our cost structure.\n\nIn Q2, we said we take out $200 million and we took out $300 million. In Q3, we said we do $50 million to $150 million, and we did over $100 million. And then to your point, Kevin, we've said another $50 million to $100 million this quarter. If we achieve that, that's $2.5 billion over a year or almost 40% of the cost structure.\n\nSo it's not insignificant and its important work, and we'll continue doing it. But by doing that, it protects the things that are important for us, and those are the growth strategies that Jay talked about.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nSo given those comments, it seems like you would you're constantly looking to improve efficiency to fund a lot of these other projects that will enhance the value of the franchise longer term. Is that right?\n\nJay Farner -- Chief Executive Officer\n\nI think we're seeing today when we go through and we think about the right ways to make the cost and again, Brian can touch on this, it needs to be tied to tech advancements, Bob, for many of our calls talked about Rocket logic, which is a powerful origination tool that we spent years building, what does it do? It makes banking and operations more efficient. So these are the type of things that allow us to be thoughtful about the cost reductions because we're leveraging the tech build that we've got. So we get the reductions without sacrificing the investments in the long-term growth that we know will benefit the company. And again, that's not -- this goes back to James' question.\n\nThis is not the first time we've kind of thought through this. In the 27 years I've been here, we've always taken these moments where the market is contracting and said, \"OK, where do we put the dollars? Where do we put the team members' time and energy and effort that will allow us to have significant market share growth in the future\" and that's the same exact strategy that we're employing today.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Ryan Nash with Goldman Sachs. Your line is open.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nGood evening, everyone. Jay, maybe to ask Kevin's question in a little bit of a different way, but if you look at the way the Fed has tightened financial conditions in the housing market, it sounds like we're going to be in this restrictive territory for an extended period of time. So well, as you said, none of us are rate economists, it's pretty clear that rates are going to be elevated for an extended period of time. So I'm just curious like can you give us sort of a blueprint of how you plan to manage in terms of your willingness to lose money for an extended period of time before taking an even more close look at the organization?\n\nJay Farner -- Chief Executive Officer\n\nYes. I think what we're thinking about more is how we drive efficiency and control the entire funnel. So if you go back to where we were in 2008, we originated mortgages. We did not have a large marketing apparatus.\n\nWe do not have a lead generation apparatus. We do not have servicing. And so that allowed us to only pull a few levers. If you look at what we've been building in the last four or five years, from top to bottom, we control the entire funnel.  And now we're adding the glue that engages clients from the very top through our lower my bills strategies through our Rocket money engagement, the rewards that hold those things together leads us into origination, but then also the servicing component of this.\n\nAnd so Brian has touched on the fact that we'll continue to look and determine where we might be able to continue to remove costs that aren't leading us down a profitable path, either short run, but more importantly, what we're focused on is a long run, but I think the vast majority or energies of this organization are thinking whether the market is a $1.2 trillion market for a year, a $1.5 trillion market for a year, the pressure that, that will put most originators under, the amount of capacity that will come out. I would be curious to see how many loan officers renew up their licenses here this fall. Most activity is done here in November and December. So we know that we are north of I think 5000 or right around that number coming in.\n\nI'll be curious to see how many come out into 2023. So as that contraction occurs, Brian talked about the capitalization that we've got. This allows us to keep investing, to increase the cost to -- or reduce the cost to acquire. And so even if the market remains smaller for a year or two years, that puts us on a path to grow marketing, to grow market share because we've got all these elements that other originators don't have.\n\nAnd I've got to point this out, you're seeing it right now with purchase. Certainly, when rates were pretty low and everyone was looking to buy a home, you can go out there, you can find somebody who is days or a week away from signing a purchase agreement. In a market like today's market, you're going to have to engage with clients who are six months, 12 months, 18 months away from finding their home. So the question is how do you achieve that? And that's -- those are the solutions that we have been working on, bringing them into the top of the funnel with our MLS listings at Rocket homes.\n\nWe'll roll out additional technology products here in the coming quarters that allow those clients to be engaged, have them join rewards, and drive down their closing costs, all while participating more and learning more about Rocket, it gives us a strategic advantage to win those purchase clients and have confidence that our marketing dollars today will pay off in the future, meaning we can continue to spend them. And I don't see anyone else in our industry doing this. And that's why I mentioned in my remarks, that's why I think over the course of the next quarter or two, the separation between our organization and others that are well capitalized that can invest in these long-term strategies to grow their business versus others who of course to have one option, cut, cut that's it. I think that separation is really going to be pronounced as we get into the next quarter or two.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nI guess, Jay, maybe as one follow-up. You referenced in your prepared remarks that as you just articulated, people are going to have to cut, cut. And also, we could start to see consolidations across the industry. We're already seeing people exiting businesses and sell part of the businesses.\n\nAnd I guess, how are you planning thinking about using your relative strength, whether to pick up things or potentially be an acquirer on the cheap? And maybe just talk about what your priorities are from a capital allocation perspective.\n\nJay Farner -- Chief Executive Officer\n\nYes. I'll touch on that, Brian can as well. We're always being strategic and Scott Elkins, who leads those efforts is always reminding us that we've got to be thoughtful because everything you've just mentioned is playing out. For us, if you think about the Rocket rewards program, we just rolled out, our servicing efforts that we've got, some other products that we'll be announcing here in the coming months, it will allow us to have a different effect on top of the funnel lead flow than other originators.\n\nAnd so we'll be thinking about those learnings and then how does that set our strategy for the type of businesses we may want to acquire. Does it mean we won't also look at unique originators that brings something very special to the table, maybe a niche market that we're not able to participate in or not able to participate at the level we want? We just rolled out our manufactured housing lending here in the last 48 hours, a very robust program. We'll be curious to see where that goes, could there be something that surface is there, but it would have to be something strategic for us. The general originators in the marketplace don't really bring something of value to the table that we can't create on our own.\n\nSo that's how I think about it, either a unique company that plugs into all this platform engagement work that we're doing or a niche originator that brings us some market share that we currently don't have reach into.\n\nBrian Brown -- Chief Accounting Officer\n\nAssets, right? It has to be a different audience, different product or differentiating assets but Ryan, one thing I just wanted to go back to in your earlier comments that I think it's worth mentioning. To your point, I'm not trying to be an amateur economist to predict '23. But what I can talk about is what we're experiencing right now in the fourth quarter. And if you think about the fourth quarter, it's also a seasonally low quarter to begin with.\n\nAnd then when you go back and you look over time and you look at fourth quarter compared to third quarter, where home buying and home purchasing represents the majority of the market it's down even more traditionally from Q3 to Q4. And also, Jay made some comments about just the sheer number of loan officers, which is 1 good way to measure capacity.  And we're at a record high in terms of loan officers, and we're at a record low if you do the division and say how many loans per month per loan officer. So those two things make us think that the fourth quarter is not also the new normal. We don't know what '23 will hold not, so we're not making predictions there.\n\nBut it's not fair to base your whole business strategy off a seasonally low quarter ever.\n\nJay Farner -- Chief Executive Officer\n\nWith that excess capacity, I think it's a great point, Brian. I think we're at whatever, seven or 8x what the typical line the industry is doing right now, based on our systems, which give us some efficiency. But this is an interesting quarter the way that home affordability was really hit, some of the lack of price adjusting that is occurring in the seller's market, the steep rise in interest rates, which have driven down refis or driven down the origination fee up so quickly and this capacity of LOs, are still trying to figure out whether they're going to stay in this business or even find a new career. So we got to work our way through this period of time, 90-day period or so we really know more into Q1, yes.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nAwesome. Appreciate all the color, guys.\n\nJay Farner -- Chief Executive Officer\n\nYes.\n\nOperator\n\nThe next question is from Doug Harter with Credit Suisse. Your line is open.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nThanks. Clearly, you have a strong liquidity position. Can you just talk about how you might think about capital return in addition to continuing to invest in the business?\n\nBob Walters -- President and Chief Operating Officer\n\nYes. Sure. I'll start, Doug, and I'm sure Jay will have thoughts, too. But it kind of goes back to the previous, think about what we've said in the capital waterfall, the best dollar we spent is reinvesting in the business.\n\nWe'll continue to be thoughtful around acquisitions, and then we'll return capital, and we're doing essentially exactly what we said we're doing by reinvesting capital into the business right now. And as we talked about, it's not -- we're not here because of luck, we're here because of planning. We knew and have been thinking a lot about these platform investments over the past couple of years, and we planned for it, and we saved the liquidity and capital to do it, to continue to do it while we're being thoughtful on the expense side of the house and looking at things that are not key to the operations of this business.\n\nJay Farner -- Chief Executive Officer\n\nAnd the only other thing I'll add is translating that directly to loan volume to go out and acquire a loan today, especially if you're basically buying the loan. If you don't have any brand, if you don't have any follow-up mechanisms, if you don't have any engagement, you're going to buy the loan, put it on your platform, you've got to think about it as that one-time value. And if you look at the pricing in the industry, without the sale of the MSR, almost immediately, with cash, it is a negative cash transaction for a lender. So we're really trying to think about it completely in a completely different lens, which is, we're acquiring a client that engages on our platform.\n\nThat's why we're talking about the 24 million Rocket account users that we've got in this robust content rewards program that we're going to engage them with because when you have confidence kind of like an Amazon, I signed somebody up, maybe they buy a book today. But I know once I get that book, it won't be but a few months, and now it will be the tie pads and it will be the dog food, and that buying continues to grow. And so we start projecting the long-term value of the clients that you've acquired because of the robust experience you can provide them. That's how we're thinking about where we would deploy our capital, particularly to the acquisition of a client versus simply not that we don't think about buying or marketing and generating a closed loan, but we're not out just trying to buy closed loan volume or drive a closing that doesn't have any long-term value for us.\n\nWe've got to think about the lifetime value of that client that meaning that we can do marketing today to drive people into Rocket money and it may be three years before they make their first home purchase. That's OK. We've got line of sight on that. There may be a situation where we can buy MSRs that others aren't buying because we know we're going to engage them in our platform, using rewards and have a higher capture rate on their next purchase, but it's this full ecosystem that's working together to give us the insight we need to make these decisions.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nThanks.\n\nOperator\n\nThe next question is from Mark DeVries with Barclays. Your line is open.\n\nMark DeVries -- Barclays -- Analyst\n\nYes. Could you discuss the competitive dynamics you've been observing in the wholesale channel? And in an environment like this, given all the market challenges, is it easier or more challenging to sign new partners?\n\nJay Farner -- Chief Executive Officer\n\nWell, I think we've seen -- and I could get this -- I could be off a number or two here, but I think we've seen 50% of the top 10 wholesale lenders kind of come out of the market in the last 12 months. They've either been pushed out by something called the ultimatum or they've decided not -- no longer participate in wholesale.  Wholesale on its own is a very challenging business right now because as we -- as I just touched on, without the sale of that MSR, every loan you're originating is losing you cash. And so from a broker's perspective, what they've seen is a loss of choice. And I don't know, 50% of the brokers out there, give or take, probably have one or two lenders they can rely on now.\n\nSo that means that they are not as price competitive, which will bode well for our retail system as they continue to lose choice. For us, signing up a partner is becoming easier because of the thing I've just mentioned. If you're fighting to save your business, and you're in a situation where your choices continue to get eliminated than you're looking for a new partner, someone who probably is more open to a free market system. And so we're seeing our new partners or partners flipping back there.\n\nBut that business on its own is a very challenged business right now. I think the average broker in America is doing, I know less than one unit a month. I think it's close to 0.6 or 0.7 units a month. And so regardless of what you're earning per loan, that's going to make it tough.\n\nSo as Brian and I mentioned, we'll probably see quite a few licensed originators leave the market as we get into 2023, which will be healthy because it will take out a lot of the capacity because they're struggling because of lack of choice that's been now kind of forced upon them.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. That's helpful. Thank you.\n\nOperator\n\nThe next question is from Derek Sommers with Jefferies. Your line is open.\n\nDerek Sommers -- Jefferies -- Analyst\n\nHi. Good afternoon. Could you provide some commentary on the trends you're seeing in the cash-out refi product and other trends across the product mix spectrum?\n\nJay Farner -- Chief Executive Officer\n\nWell, we're doing quite a bit of cash out. We're doing both first mortgage and second mortgage. It's an interesting situation because as people continue to see their other debt increase, right? So it's always a comparison for clients in general, is the cost of the mortgage payment going up higher or faster than the cost of credit cards, student loans, other debt instruments that they've got. And as we watch savings drop and people will spend more on their credit cards, they're under more pressure.\n\nAnd so although it's not always, of course, the right decision for our client to take cash out of their first mortgage, that's why we have the home equity line loan product that we've rolled out. That's why we have our Rocket loan product that we've rolled out. I think we touched on the fact we've got a beta card in market and other financial products that we'll be rolling out. So as we do marketing, and we're bringing clients in and they're joining our rewards program, and then they're thinking about how they're going to save money in a rising rate market, they have access to all those different strategies to benefit their financial situation, not just cash out on their first mortgage.\n\nBut today, that is the -- if I had to take a guess, I would say that we're north of 90% in the industry in terms of people pulling some form of cash out when they do a refinance.\n\nMark DeVries -- Barclays -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThe next question is from Ryan McKeveny with Zelman & Associates. Your line is open.\n\nKevin Kaczmarek -- Zelman and Associates -- Analyst\n\nThis is Kevin Kaczmarek on for Ryan. I realize it's only been maybe a month and a half, but how is the inflation buster program influencing near-term purchase market share and the associated gain on sale margin?\n\nJay Farner -- Chief Executive Officer\n\nWell, I think it's been very warmly received. We've noticed some competitors copying the program with a different name. So that always tells me that it is getting attention. From our perspective, people visiting the inflation buster website, which we have a direct landing page for that, phone calls, all those things are up.\n\nSo it's much more of a direct response-based advertising model, stuff that we've done for years and years in the past, you can see us -- you'll see us continue to lean into that moving into 2023 with great market but more importantly, a great program. If you're a client today buying a home and your payments going, $300, $400, $500 from where it had been six, seven months ago, that initial savings is very, very helpful as you move in and pay your moving expenses and sign up your utilities and by furniture, etc. So I think somewhere close to 20% of all of the purchase transactions we're doing today are choosing to use that program. And remember, we've only been marketing it now for a few weeks.\n\nSo that's an exciting one and it's a great place to start, and you'll continue to see us launch additional programs that allow our clients to still buy a home even in a rising rate market.\n\nKevin Kaczmarek -- Zelman and Associates -- Analyst\n\nOK. And could you talk about the expansion into the correspondent channel, for instance, looking out a few years into the future, how does it tie in with your broader strategic initiatives? How might we think about growth in volumes and/or market share? And what types of economics or margins should we be modeling in?\n\nJay Farner -- Chief Executive Officer\n\nWell, our focus here and the technology that our team did an incredible job of rolling out this year is really kind of assisted correspondent. So it's not just kind of buying fully closed loans and not participating in any of the processing of that loan. This is a program that gives brokers another opportunity to take -- have a little bit more flexibility in how they're pricing loans, but it's a similar market. Think of the wholesale broker market and the correspondent or assisted corresponded as a piece that I'm going to guess maybe 10% or 12% of the broker market is currently using today.\n\nAnd so having this program allows us to make sure that we can reach any broker that wants to utilize it, if they want to do assisted correspondent, wonderful, if we've got that technology, if they want to stay with the traditional TPO program, we've got that for them as well, but it's yet another tool for us to go out and win market share in the broker community. So that's how I think about it inside of the total broker market share. Now where that's going, we touched on some of the challenges, I think that space will face, but we'll be there with the products for all of the brokers who want to take advantage of these great products that we're rolling forward.\n\nKevin Kaczmarek -- Zelman and Associates -- Analyst\n\nOK. Is it possible that you guys could venture into the delegated underwriting space at some point?\n\nJay Farner -- Chief Executive Officer\n\nWhen we think about and when it goes back to our capital allocation, when we think about all of the opportunities that we've got here on the table and our retail brand, the millions of clients at no Rocket that have already created an accountant Rocket, all the services top-to-bottom funnel that we're building out and have executed or not and now we're just kind of heading together. For us, we balance that against buying a correspondent loan. It really -- it's kind of apples and oranges. We'd rather help that client through the system and then more importantly, retain that client in our servicing book and help them through the lifetime of their loans.\n\nSo you'll probably see us spend most of our energies either helping our existing broker base or anyone who wants to join that broker base and in our retail clients.\n\nKevin Kaczmarek -- Zelman and Associates -- Analyst\n\nOK. Thanks a lot.\n\nOperator\n\nOur final question today is from Arren Cyganovich with Citi. Your line is open.\n\nArren Cyaganovich -- Citi -- Analyst\n\nThanks. I just wanted to ask about the strategy that you had previously talking about originating loans that were essentially profitable and not wanting to chase rate essentially to win business. Is that still your strategy? I mean you said a certain level of fixed costs. So I would assume that having additional volume in this environment might be a net plus, but I'm just curious that tied with kind of taking away the forward guidance on originations and gain on sale margin, if that was tied to that at all.\n\nThanks.\n\nJay Farner -- Chief Executive Officer\n\nYes, it's a very good question. It's a great question to end on here. This is exactly why we've been talking about the platform and the engagement tools that we have for our servicing clients, our lead flow that isn't ready to transact yet because now through our lens, as opposed to thinking, is this a profitable loan today? Yes or no, which again, you see many lenders out there saying, \"I know I'm only going to do this once. I have no mechanism to retain that client long term, but I just need to layer it on my system, and so I'll do it even if I'm going to lose money to do so.\n\nWe have the ability to say, let's understand what our retention rate will be with that client over the long term, with purchase, with refinance, with capturing real estate fees when they purchase a new home through our Rocket homes company, with a personal loan that they may do through Rocket loans with other additional products now that we've built out that technology to be loan agnostic and gives us the ability to add other loan programs for our client base. So we can filter that through and think about the marketing dollar we're spending today and have much greater confidence on the long-term or the lifetime value of that client, so you may see us do alone and someone look and say on that particular transaction, that loan cost the company $500. I'm making this up, Brian, you can jump in. But we know, based on everything else, they've signed up for the rewards program.\n\nThey've signed up, let's say, in the future for a credit card or whatever it might be. We know what the retention rate will be and we can apply that future revenue to still make that marketing decision today. And so that's exactly why when I referenced in my remarks, the excitement around the 300-plus technology people that in like four months built out the rewards program for us, so critical because it's that kind of final glue we needed to watch our client base move from website to website, landing page to landing page, product to product, watch that engagement and then allow us to plug that into our marketing decisions, to spend the right marketing dollar for the lifetime value of the client.\n\nBob Walters -- President and Chief Operating Officer\n\nYes, that's exactly right. And to be clear, when we are talking about acquiring clients, we're talking about in a number of ways through lifetime value men and also through a contribution margin lens. And even at these margins that we're talking about here, we're guiding through to Q4, these are positive loan products on a contribution margin basis, defined as revenue minus direct and variable expenses. You mentioned the fixed cost base, and we've talked a lot about that here.\n\nBut if you think about what makes a platform business a special business, it's superior unit economics, which we have, and we have investments to make them even better and scalability, which clearly we've proven a number of times, including in 2020 and 2021.\n\nArren Cyaganovich -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThat concludes our question-and-answer session. I'll turn it over to Jay Farner for any closing comments.\n\nJay Farner -- Chief Executive Officer\n\nYes. Just thanks, everybody, for the great questions. Really excited about the incredible work our team has done this year. As we touched on in the early part of these questions when times get challenging, the ability for an organization to determine what matters, stay focused, and hold to those priorities is really what separates I think, successful companies from companies that will struggle.\n\nAnd so that's been our team and our tech product strategy, our mortgage bankers, operations, everyone here staying focused on the long-term strategies that will lead to the growth -- continued growth of the organization. So I appreciate everyone who's listening because all of this hard work will pay off for us in 2023 and beyond. We'll see you all at the next call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSharon Ng -- Vice President of Investor Relations\n\nJay Farner -- Chief Executive Officer\n\nBrian Brown -- Chief Accounting Officer\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nKevin Barker -- Piper Sandler -- Analyst\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nDoug Harter -- Credit Suisse -- Analyst\n\nBob Walters -- President and Chief Operating Officer\n\nMark DeVries -- Barclays -- Analyst\n\nDerek Sommers -- Jefferies -- Analyst\n\nKevin Kaczmarek -- Zelman and Associates -- Analyst\n\nArren Cyaganovich -- Citi -- Analyst\n\nMore RKT analysis\n\nAll earnings call transcripts"
}