{
  "companyName": "1-800-Flowers.com",
  "companyTicker": "FLWS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/02/1-800-flowerscom-flws-q4-2022-earnings-call-transc/",
  "content": "1-800-Flowers.com (FLWS 0.21%)\nQ4 2022 Earnings Call\nSep 01, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the 1-800-Flowers.com fiscal 2022 fourth quarter and full year. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Joseph Pititto, senior vice president, investor relations and corporate communications. Please go ahead sir.\n\nJoseph Pititto -- Senior Vice President, Investor Relations and Corporate Communications\n\nGood morning, and thank you for joining us today to discuss 1-800-Flowers.com's financial results for our fiscal 2022 fourth quarter and full year. Those of you who have not received a copy of our press release issued earlier this morning, the release can be accessed at the Investor Relations section of our corporate website at 1800flowersinc.com. Our call today will begin with brief, formal remarks, and then we will open the call to your questions. Presenting today will be Chris McCann, CEO; Tom Hartnett, president; and Bill Shea, CFO.\n\nBefore we begin, I need to remind everyone to some of the statements that we will make today, maybe forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. These statements involve risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the applicable statements. For a detailed description of these risks and uncertainties, please refer to our press release issued earlier this morning, as well as our SEC filings, including the company's annual report on Form 10-K, and quarterly reports on Form 10-Q. In addition, this morning we will discuss certain supplemental financial measures that were not prepared in accordance with generally accepted accounting principles.\n\nReconciliations of these non-GAAP financial measures to the most directly comparable GAAP measures can be found in the tables accompanying the company's press release issued this morning. The company expressly disclaims any intent or obligation to update any of the forward-looking statements made in today's call, any recordings of today's call, the press release issued earlier today, or any of its SEC filings, except as may be otherwise stated by the company. I'll now turn the call over to Chris McCann.\n\nChris McCann -- Chief Executive Officer\n\nThank you, everyone, and good morning. As we noted in this morning's press release, revenues in our fiscal fourth quarter were essentially flat year over year. This reflects the change in consumer behavior that we have seen since last December in reaction to unprecedented inflation in the macroeconomy. Nonetheless, we finished our full fiscal 2022 year with revenues up 4%, compared with the prior year.\n\nThis is on top of more than 40% growth we saw in revenues last year and represents revenue growth of more than 75%, compared with our fiscal 2019, which was prior to the pandemic. Our growth for fiscal 2022 illustrates our ability to retain and build on the gains we achieved over the past two years, despite the continued macroeconomic uncertainty and the change in consumer behavior. In fact, it's important to note that we have essentially doubled the size of our company over the past several years. This reflects the healthy growth that we have seen in our customer file combined with our expanded product offerings and our ever-increasing focus on engaging with our customers through a combination of highly relevant content and unique experiences.\n\nAs I mentioned back in April, during our conference call, we saw our business in the macro economy as having gone through several significant stages over the past few years. Prior to the pandemic or the pre-COVID stage, we made the decision to step up our investments in marketing, particularly in our flagship 1-800-FLOWERS and Harry & David brands to accelerate revenue growth. This enabled us to increase our revenue growth rate from the second half of fiscal 2018 through the first three quarters of fiscal 2020 when we went from low-single-digit to double-digit growth just prior to the pandemic. During that period, we also accelerated the growth of our customer file and our celebrations Passport loyalty program.\n\nThese initiatives along with continued investments in our business platform positioned us well to respond to the surge that we saw in consumer demand when the world changed dramatically in the spring of 2020 with the advent of the COVID pandemic. Through lockdowns, social distancing and the shift to remote work, the resourcefulness, and dedication of our team helped our customers stay connected with the important people in their lives. With the surge in demand, we saw top and bottom line results and our customer file grow the record levels during the pandemic stage. As the world began to emerge from the pandemic last year, the post-COVID stage or late COVID, we once again saw dramatic changes in the macroeconomy and consumer behavior with increased travel, dining out, group celebrations, and other pent-up activities.\n\nWe also saw rapidly increasing inflation, unprecedented disruptions in the global supply chain, geopolitical turmoil, and an extremely tight labor market. As a result, we have seen consumer demand moderate, while steep cost increases and everything from labor to shipping to commodities have impacted gross margins. While inflationary pressures remain, we are beginning to see early improvements in certain areas, including fuel prices that have pulled back in the peak highs albeit still significantly higher year over year, softening in ocean freights, and stabilization of labor rates with some improvement in availability. While we all hope that these positive trends will continue, we have taken proactive steps to address these issues utilizing our balance sheet to invest in our operating platform and continue to build to the future.\n\nThese investments include the automation of our warehouse and distribution facilities, which we've spoken about prior and which reduces our exposure to the labor front and buying and building inventories early to get ahead of the continuing global supply chain issues and implementing logistics optimizing programs to enhance our outbound shipping operations and manage rising rates with third party shipments. As we continue to ramp up these initiatives, combined with strategic pricing programs across our brands, we anticipate they will help us manage rising costs and gradually improve our gross margins and bottom line results during the latter half of the current fiscal year. We have also continued to invest to expand our product offerings, as well as our engagement initiatives. During the fourth quarter, we added to our offering of the multi-brand bundles that our customers have been embracing.\n\nFor example, pairing Harry & David Wine with Shari's Berries confections and 1-800-FLOWERS bouquets continues to be a big hit with customs. We combine Cheryl's Cookies and Wolferman's Bakery gifts to create the perfect brunch bundles. We also began offering same-day delivery of cakes and confections for birthdays and other celebrations and we expanded our selection of house plants, a hot category, particularly with millennials, where we saw double-digit growth year over year. Final choice which we acquired last October also performed well with record-breaking pre-sale demand of our wild-caught copper river during the fourth quarter.\n\nOn the engagement front, we further expanded our interactive engagement in to create a true community through a broad range of non-transactional engagement experiences and content, including our popular Celebrations Pulse, weekly emails, our Chairman's new celebrations chat or podcast, Alice's Table virtual workshops for collaborative design and confection of everything from floral arrangements to charcuterie boards and a growing collection of interactive blogs, including Petal Talk from 1-800-FLOWERS, Table talk from Harry & David, Scrumptious Bites from Cheryl's Cookies, and the Vital Choice blog for all things Wild-caught sustainably farmed and organic. These blogs along with our connections communities, the Life After Loss events series on sympathy topics and a growing number of influencer campaigns enabled us to achieve more than 127 million non-transactional consumer engagements, well past our goal for the year. We know that customers who engage with our content convert 300 basis points to 500 basis points higher than those that do not. In addition, these engagements help us build relationships with our customers beyond the transactions, creating that true community.\n\nCombination of these initiatives and our continued product expansion enabled us to attract more than 1.5 million new customers during the fourth quarter and more than 5 million for the year. Existing customers active in the year grew 5.3% to 7.4 million and existing customers represented 70% of total revenues for the year. In addition, our celebrations Passport loyalty program continued to grow at a double-digit rate during the year with membership now exceeding 1.4 million. We believe the significant size and robust growth of our customer file and our celebrations Passport loyalty program along with our expanded product offerings positions us well to inspire our customers to give more, connect more, and build more and better relationships and continue to grow our business over the long-term.\n\nNow, let me turn the call over to Bill for his review of some of the key metrics from the fourth quarter and our full fiscal 2022 year. Bill?\n\nBill Shea -- Chief Financial Officer\n\nThank you, Chris. Our results for the fiscal 2022 fourth quarter and for the full fiscal year reflect the changes in the macro economy that Chris touched on in his remarks. In terms of revenues, we saw solid upper single-digit growth in the first half of the year, despite challenging year-over-year comparisons. Consumers began to pull back on their spending beginning in December last year as inflation began to rise rapidly.\n\nThis change in behavior persisted and intensified throughout the spring this year, as consumers became concerned with the unprecedented rapid rise in inflation, and growing global unrest. In addition to the effect on demand, these factors along with the challenges in the global supply chain had a significant impact on our gross margins as we have had to absorb steep cost increases in labor, inbound and outbound shipping, fuel and various commodities. Gross margins were also impacted by the higher-than-normal write-downs of perishable inventory due to slowing demand. These factors combined with the higher year-over-year rates from marketing and advertising caused our results for the fourth quarter and the full fiscal 2022 year to be below our expectations.\n\nThe guidance that we provided in this morning's press release for our current fiscal 2023 first quarter reflects tough comparisons we have with last year's fiscal first quarter, which was before the impacts to the global supply chain, an unprecedented surge in inflation, and the cautious consumer spending trend that we have seen through July and August. With that said, over the longer term, we believe we are well-positioned to improve our gross margins and bottom line results. We are already seeing some relief in certain of the high category headwinds that we've been facing, including ocean freight, fuel, and certain commodities. Additionally, our expanded initiatives to automate our warehouse and distribution facilities are coming online to help control labor costs and mitigate labor availability issues.\n\nBreaking down some of the key metrics for the fourth quarter and full fiscal year. For the fourth quarter, total net revenues were 485.9 million, essentially flat compared to 487 million in the prior-year period. Excluding contributions from Vital Choice, which we acquired in October of 2021, total revenue for the quarter was down 1.5%, compared with the prior-year period. For perspective, revenues for the quarter increased 87.3%, compared with total revenues of 259.4 million in the fourth quarter of fiscal 2019.\n\nThis included strong organic growth of 56%, combined with the strategic acquisitions we made during the pandemic. For the year, total net revenues increased 4% to 2.21 billion, compared with 2.12 billion in the prior year, reflecting growth across our three business segments. On an organic basis, revenues for the year grew 2.5%. For perspective, total net revenues grew 76.8% compared with total net revenues of 1.2 billion in fiscal 2019.\n\nAgain, this included strong organic growth of approximately 50%, combined with our acquisitions. Gross profit margin for the quarter was 33.7%, down 700 basis points, compared with 40.7% in the prior-year period, primarily reflecting significantly increased cost of labor, shipping, commodities, and perishable inventory write-offs. For the quarter, operating expenses as a percent of total revenues was 39.2%, representing an increase of 170 basis, compared with 37.5% in the prior-year period. This primarily reflects higher digital marketing and advertising, as well as higher depreciation offset in part by lower incentive compensation and the impact of our non-qualified deferred compensation plan, compared with the prior-year period.\n\nFor the year, gross profit margin was 37.2%, down 500 basis points, compared with 42.2% in the prior year, reflecting the same factors I mentioned for the fourth quarter. Operating expenses as a percent of total revenues was 35.3% for the year, essentially unchanged compared with 35.2% in the prior year as higher marketing costs were offset by lower incentive compensation. For the quarter, adjusted EBITDA loss was 16.8 million, compared with adjusted EBITDA of 30.2 million in the prior-year period, primarily reflecting significantly higher year-over-year cost for labor, shipping, commodities, and digital marketing along with perishable inventory write-offs. Net loss was 22.3 million or $0.34 per share, compared with net income of 13.3 million or $0.20 per diluted share in the prior-year period.\n\nAdjusted net loss was 21.8 million or $0.34 per share, compared with adjusted net income of 13.3 million or $0.20 per diluted share in the prior-year period. For the year, adjusted EBITDA was 99 million, compared with 213.1 million in the prior year. Net income was 29.6 million or $0.45 per diluted share, compared with net income of 118.7 million or $1.78 per diluted share in the prior-year period. And adjusted net income was 32.9 million or $0.50 per diluted share, compared with 122.6 million or $1.84 per diluted share in the prior year.\n\nNow, regarding our segment results. In our Gourmet Food and Gift Baskets segment, revenue for the fourth quarter was 148.4 million, down 2.4%, compared with 152.2 million in the prior-year period. Excluding Vital Choice, which we acquired in October of 2021, revenue for the quarter was 142.7 million. For perspective, revenue for the quarter was up 104.9%, compared with the same period in our fiscal 2019 fourth quarter, including organic growth of 63%.\n\nProfit margin was 23.2%, compared with 38.9% in the prior-year period. Segment contribution margin loss was 23.7 million, compared with segment contribution margin of 4.2 million in the prior-year period. The gross margin decline and segment contribution loss, primarily reflected higher labor, shipping, and commodity costs, as well as higher year-over-year marketing rates and perishable inventory write-offs. For the year, revenue of this segment increased 5.1% to $1 billion, compared with 955.6 million in the prior year.\n\nFor perspective, revenue increased 54.9%, compared with revenue in fiscal 2019, including 40% organic growth. Gross profit margin for the year was 34.2%, compared to 42.9% in the prior year. And adjusted segment contribution margin for the year was 64.9 million, compared with 148.9 million in the prior year. Again, the lower gross margin and segment contribution reflected significant headwinds I've already mentioned.\n\nIn our consumer floral and gift segment, revenues for the quarter increased 0.4% to 299 million, compared with 297.7 million in the prior-year period. For perspective, revenue for the quarter increased 87.2%, compared with the same period in the company's fiscal 2019 fourth quarter and were up 55% organically. Gross profit margin was 38%, compared with 41.1% in the prior-year period, primarily reflecting increased labor and shipping costs. Segment contribution margin was 26.4 million, compared to 41.2 million in the prior-year period.\n\nThis primarily reflected the lower gross margin, primarily with higher year-over-year digital marketing rates. For the year, revenues increased 3.4% to 1.06 billion, compared with 1.03 billion in the prior year. For perspective, revenue increased 112.9% compared with our fiscal year 2019 and were up 62% organically. Gross margin for the year was 39.3%, compared with 41.1% in the prior year.\n\nSegment contribution margin was 104.3 million, compared with 128.6 million in the prior year. Now BloomNet segment, revenue for the quarter increased 3.2% to 38.5 million compared with 37.3 million in the prior-year period. For perspective, revenue for the quarter was up 41.2%, compared with the same period in the company's fiscal 2019 fourth quarter. Gross profit margin was 39.6%, compared with 43.2% in the prior-year period, primarily reflecting higher shipping costs, as well as product mix.\n\nSegment contribution margin was 10 million, compared with 11.3 million in the prior-year period. For the year, revenue increased 1.9% to 145.7 million, compared with 142.9 million in the prior year. For perspective, revenue increased 41.6%, compared with our fiscal year 2019. Gross profit margin for the year was 42.3%, compared with 45.5% in the prior year, and contribution margin for the year was 42.5 million, compared to 45.9 million in the prior year.\n\nIn terms of corporate expense, for the fiscal 2022 fourth quarter corporate expense, including stock-based compensation, but excluding the impact of the company's non-qualified deferred 401(k) compensation plan was 30.7 million, compared with 29.1 million in the prior-year period. For the year, corporate expense, including stock-based compensation, but excluding the impact of the company's deferred compensation plan and the one-time costs associated with the acquisition of Vital Choice was 120.7 million compared with 121.2 million in the prior year. Regarding free cash flow. For the year, free cash flow was a negative 61.7 million.\n\nThis however reflects the significant investments we have made in working capital, primarily non-perishable inventory to stay ahead of potential supply chain challenges and in capex to automate our logistics and distribution capabilities. Turning to our balance sheet. At the end of fiscal 2022 year, our cash and investment position was 31.5 million, compared with 173.6 million at the end of fiscal 2021. The reduction in cash, compared with the prior year reflects our aforementioned investments in inventory and capex, as well as our acquisition of Vital Choice, stock buybacks, and pay down of debt during the fiscal year.\n\nInventory was 247.6 million, up 93.7 million, reflecting our proactive decision to buy and build inventory ahead of the new fiscal year and thereby reduce our exposure to the global supply chain as we plan for the upcoming holiday season. Our term debt balance, net of deferred financing costs, was 162.5 million and we had zero borrowings outstanding under our revolving line of credit. As a result, total net debt at the end of the year was 131 million. Regarding guidance for fiscal 2023, based on a highly unpredictable nature of the current macro economy, we have decided to provide guidance this year on a quarter-by-quarter basis.\n\nThis will include current business trends to date at the time of our regular quarterly results releases. Looking ahead, we anticipate that the combination of the investments in our business platform we have discussed this morning combined with the strong growth we have seen in our customer file and Celebrations Passport program, strategic pricing initiatives, and moderation in several cost headwinds we have incurred will enable us to gradually achieve improved gross margins and bottom line results during the latter half of the current fiscal year. As we have noted in our formal remarks, through the first two months of the current fiscal quarter, we have seen continued cautious consumer spending behavior reflecting the impact of price inflation. As a result, for the current fiscal first quarter, we anticipate revenues will be down in the range of 3% to 6%, compared with the prior-year period.\n\nIn terms of cost inputs, year-over-year cost for labor, shipping, commodities and digital marketing have remained high through the two months of our fiscal first quarter. As a result, we anticipate that our adjusted EBITDA loss for the current period will be in the range of 28 million to 33 million. Importantly, for the full fiscal year, we anticipate reduced capital expenditures, as well as lower working capital needs, compared with the prior year. As a result, we expect to generate a substantial improvement in year-over-year free cash flow.\n\nI will now turn the call back to Chris.\n\nChris McCann -- Chief Executive Officer\n\nThank you, Bill. So to put things in context, during the pre-COVID stage, we invested in our key brands and increased our revenue growth rate from low single-digits to double-digits prior to the start of the pandemic. During the pandemic stage, we were able to respond and benefit from the tremendous surge in demand as consumers who will lock down turn to us to help them stay connected with the important people in their lives. In addition to doubling the size of our business to more than $2 billion, we also more than doubled the size of our customer file and our Celebrations Passport loyalty program.\n\nNow, as we move into the legal or post-COVID stage, we're facing a number of challenges, including unprecedented rapid rise in cost inputs from labor to shipping commodities that have impacted our gross margins. In addition, consumers have become increasingly cautious in their purchasing behavior in reaction to the high inflationary environment. With that said, we achieved 4% revenue growth in our fiscal 2022 year and more than 75% growth we achieved since our fiscal 2019 prior to the pandemic. This includes strong organic growth, as well as contributions from the highly accretive strategic acquisitions of Personalization Mall and Vital Choice that we made during the pandemic.\n\nAlong with our internal focus on creating truly original products, these acquisitions have helped us significantly expand our product offering and provide more ways to help our customers stay connected. Fiscal 2022, we also attracted more than 5 million new customers on top of the nearly 10 million new customers that we have attracted since fiscal 2019. We have also seen our Celebrations Passport loyalty program more than double in size over the past two years, helping to drive enhanced conversion, retention, and frequency. On the cost front, we know the current macro environment is unpredictable and inflation remains high, and we are laser focused on managing those aspects of our cost structure within our control.\n\nWe've been able to use our balance sheet to make investments in inventory and facility automation that have helped us positively mitigate the rising costs that we've experienced. These investments position us to improve our gross margins and bottom line results as macroeconomy costs gradually self-correct over time. Our performance over the past several years, pre-COVID during the pandemic and post-COVID demonstrates our ability to navigate through what has been and continues to be an unpredictable and volatile economic environment. As I've mentioned in past calls, as a company, we have faced challenging market conditions in the past and because of the strength of our unique business platform, combined with our talented and experienced team, we have consistently emerged a bigger, better, and stronger company.\n\nAs a company, we are continuously evolving with an increasing volume of highly relevant digital content, a broadening range of community-building engagement initiatives, the unique gift offerings for every emotion and we are dedicated to helping inspire our community of customers to stay connected and to give more. As we look forward, we are confident that we are positioned to perform well and grow our company while building shareholder value over the long term. In closing, as in my past calls, I'd like to thank all of our associates. Our talented team throughout the company has been hard at work addressing the challenges that we see every day in the macro environment.\n\nWe appreciate our team's dedication and creative thinking as they focus on the importance of engaging with our community of customers to help them give more, connect more, and to build more and better relationships. This concludes our formal remarks. And if the operator will now open the call for questions, please.\n\nOperator\n\n[Operator instructions] And the first question will come from Dan Kurnos with The Benchmark Group. Please go ahead.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nGreat. Thanks. Good morning. Chris, maybe just to pick up on the theme that you're, sort of talking about here highlighting the outlook, the revenue outlook, big picture.\n\nHow much of this, do you think is the pullback is reopening versus macro. And from your vantage point, I think the big concern out there is that there's going to be some, kind of retracement and revenue levels from, sort of the pandemic peak, whereas you guys obviously had pretty strong cohort KPIs around even pandemic new ads. So just can you help us frame the conversation from your point of view over the next 12, 24, 36 months on what you think, kind of the revenue base actually is here?\n\nChris McCann -- Chief Executive Officer\n\nSure, Dan. Good morning, and thank you for the question. And that's what I was just trying to do really is put in context what we've been through for the past couple of years. And as we may start to make investments to grow our business in the pre-pandemic stage, we saw us being able to move the growth rate of our company from a low single-digit to double-digit rates right before pandemic.\n\nAnd because of the strength of the company, we were able to respond to the great surge in demand that came through in the pandemic. And we were able to produce the record results that we did in top line, bottom line, custom metrics, Celebrations Passport membership, etc. So as we look going forward, right now, what we're really being hit with is two things really. The cost pressures that came on and in unprecedented pace last year and we have to get through that, anniversary through that.\n\nAnd as Bill pointed out in his remarks, starting to moderate, hopefully, we're seeing some early moderation, hopefully that trend continues. In addition, as we look at the consumer, the consumer started to get effect we saw it as early as December back in our call at the end of January. I think someone, whether it was you or somebody was saying, well, we look in the canary in a coal mine, seeing the consumer pullback before others. So we had that fact at that play here right now.\n\nWe're starting to see signs and maybe the consumer is starting to recover as fuel cars have dropped. We're starting to see reports come out this week and our consumer confidence starting to improve. So when we step back and look at where we are, we often use a term of bigger, better, stronger company. And we clearly are.\n\nWe're double the size that we were pre-pandemic. We've added many more capabilities. We're becoming much more a content and engagement company. And not to be lost, just that little comment I made in my remarks about when people engage with the content that we produced, they're converting of 300 bps to 500 bps.\n\nThis is [Inaudible] and those who do not. So it shows that that's working. It shows that our passport membership is working. It shows that our cross-brand initiatives, our bundles are working.\n\nWhat we need to do is, so as we look at the next 12, 24, 36 months, we're extremely excited about the position that we're in as a company and know that as we manage through this difficult environment we're in now, we'll come out of this again a bigger, better, stronger company.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nSo let's take that a step further and maybe Bill you can chime in here. Obviously, the cost -- so if we look at -- from 2019, the cost base level is substantially higher, especially due to labor. You clearly have some inputs around freight and commodities that may ease, but I've not seen a third-party carrier yet. Yeah, we're charging $8.\n\nNow, we're going to charge you $5. So with that in mind and given the investments you're making in automation, and other things, like how do we think about the underlying base margin level when you come out of this? And in the short term, what's the incremental margin impact relative to a dollar of revenue that the consumer maybe pulls back on?\n\nBill Shea -- Chief Financial Officer\n\nSo, Dan, maybe I can break down for you. With respect to gross margins, we were 500 basis points down for the year, 700 basis points down in the fourth quarter. You talked about a lot of components of that in the release and in our formal remarks. It is freight, but it's both inbound and outbound freight.\n\nIt is labor, it is commodity, it is commodity for us. It was some inventory right or it was inventory write-off. So we kind of break it down, you know the inventory write-offs probably in the fourth quarter was maybe 100 basis points of our margin. We need to get back and we plan to get back to a more normalized level of inventory write-offs.\n\nWe had anticipated the consumer to be and consumer demand to be stronger than it was. And so, we made certain commitments on perishable inventory. And I've ended up having to write some of that off. We'll get back to a more normalized level on that.\n\nOn the freight side, the probably 300 basis points of our margin is free, but a lot of that is both is inbound, as well as outbound. We're already seeing in the ocean side of it. Significant improvements or reductions in cost. We talked a lot about throughout this past year that we had a quintupling of our ocean rates.\n\nThey've come down. They're probably double what they were two years ago, but there's obviously significantly down from where they were. Last year, it's high. Now, we have to cycle through that because a lot of the inventory we're sitting on was bought during the height of those costs, but we're seeing it dramatically drop.\n\nThe spot markets have dropped dramatically. A lot of these things are -- these cost pressures are somewhat supply and demand. Commodity costs spiked because of inflationary factors, some geopolitical factors, but we're seeing some moderation of that commodity cost probably cost us 200 basis points in the fourth quarter, maybe 100 basis points on the year. We're seeing some moderation there.\n\nSo there are certain items that probably do not self-correct. Labor rates, we've talked about in the past are high and they probably don't moderate. So that's why -- that's one of the reasons -- one of the benefits of the investments we're making in automating our facilities is to help offset that. We have to do more with less of the access to labor and labor rates, the automation investments that we're making are addressing that.\n\nWith respect to outbound freight, you're right, rates are not going to go back down. The third-party carriers are not going to reduce their rates, but there's a big component to that is fuel. And fuel is -- does fluctuate with what's happening out there. We're off the highs of fuel back in, kind of the March, April timeframe.\n\nHopefully, that continues to -- that continues to moderate. The government projections had that continuing to moderate into the future, but we're doing things on those logistics to move inventory closer to the consumer, have inventory in the right spot, challenging the transit times, that exists. So can we use a cheaper service? To get it there, it still needs customers' expectations on that. So there are initiatives that we have in play to help offset some of these costs, but some of these things are macro in nature and just takes time to flush through.\n\nAnd that's why we're talking about the latter part of the year, we believe we should see sizable increases in gross margin.\n\nChris McCann -- Chief Executive Officer\n\nYes. So a key factor there, Bill, just to make sure Dan gets to take away what Bill was saying there. We talked about some of our bigger initiatives of automation, bringing inventory and early producing inventory early to help with the labor front, but there's many other initiatives to help with our cost structure. The logistics are optimizing shipping routes and things like that that Bill just referenced.\n\nSo there's a whole program of work smarter initiatives we have to address the new cost structure that we see going forward.\n\nTom Hartnett -- President\n\nAnd, Dan, this is Tom. Just on the other side of that, we are looking for appropriate strategic pricing initiatives to offset some of these costs. Like Bill said, we do think we're going to have certainly less shrink than we had in the perishable products. And part of the labor this last year was because the supply disruption, I mean, if now we're in a much better position than we were in the prior year.\n\nSo we're not expecting to have people standing around in our fulfillment locations because we can't get one component part.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nGot it. I don't want to go on with this. I just want to -- just two points of clarification, does this change your outlook at some point that you're still targeting double-digit EBITDA margins over time? And on your free cash flow guide, Bill, you said significant improvement, and in the press release, it says the word positive, those are two very different things. So which is it?\n\nBill Shea -- Chief Financial Officer\n\nProbably it's both. This year, we had a negative 61 million in free cash flow, but if you look on our comments on a statement of cash flows, you see the significant investment we've made in working capital. Our inventory is up $93 million year over year. So that's a big investment that we made that goes against the free cash flow.\n\nThat was to address what many companies were looking to address was the supply chain, the global supply chain challenges that had, kind of broken last year. People did not -- and with Tom was referencing, not having all the inventory where you needed it to be, when you got the labor in. So we made that investment, that's a one-time investment. We're now at a high level of inventory.\n\nMost likely that inventory is going to come down this year, but title ultimately to demand, but also the supply chain is improving. We're not seeing the same disruptions at the ports that existed a year ago. So as supply chain improves, companies will get back to more normalized and we will get back to more normalized inventory levels. So that headwind or investment in working capital becomes a tailwind on free cash flow next year.\n\nAdditionally, capex the last two years, we're investing in automation of our facilities, both our Southern Ohio facility and our Atlanta facility. Those for the most part are behind us. So what we have -- so what we're expecting is, the capex that was 66 million last -- 55 million two years ago, 66 million this past year will probably be down around $20 million. That directly affects free cash flow.\n\nSo the combination of working capital. The working capital investments we've made this year and the reduced capex is over $100 million of that will be an improvement over this past year and have us as a positive free cash flow next year.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nAnd the margin question?\n\nBill Shea -- Chief Financial Officer\n\nYes. I mean, right now, Dan, we believe, as Chris mentioned, we are a bigger, better company than we were before. Ultimately over the long term, we're going to get back to sustainable strong growth from a top-line perspective and a lot of the margin pressures do self-correct.\n\nChris McCann -- Chief Executive Officer\n\nIt doesn't change our long-term outlook.\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nOK. That's fair enough. Thank you for bearing with me, guys. I appreciate it.\n\nChris McCann -- Chief Executive Officer\n\nThank you, Dan.\n\nOperator\n\nThe next question will come from Anthony Lebiedzinski with Sidoti & Company. Please go ahead.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nYes. Good morning, and thank you for taking the questions. So on the surface, and I know Bill you touched on this a little bit, but inventories were high, up 61% from last, just curious, how much of this is due to inflation and are there any risks to markdowns or additional write-downs of inventory?\n\nBill Shea -- Chief Financial Officer\n\nThe big step-up in inventory really was a conscious effort on our part to get ahead of the supply chain or the potential supply chain challenges. Again, we all got burned, many companies got burned last year because of the supply chain and we did as well. So we made a big effort. Inventory is up 93 million.\n\nMaybe 10 million or so of that is due to the Vital Choice acquisition, but the rest of it was a conscious effort. Is inventory at a higher value than it was historically? Yes, because our costs were up. So as our costs go up, you know our costs were up across the board 10% plus, double-digit percent that value of the inventory is up that much, but most of it is units. It's non-perishable inventory and it puts us in a good position as we head toward the holiday to execute this holiday.\n\nChris McCann -- Chief Executive Officer\n\nSo we're not expecting the write-down of last year.\n\nBill Shea -- Chief Financial Officer\n\nYes. We expect the write-downs over the next year. Yes.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK, got it. Thank you for that. So given the pressures on the consumer, are you perhaps maybe looking to broaden your merchandising strategy in terms of just maybe having maybe more opening price points, just how do you think about that going forward here?\n\nChris McCann -- Chief Executive Officer\n\nYes, Anthony, I'll ask Tom to take that one.\n\nTom Hartnett -- President\n\nYes, Anthony. It's Tom. Good morning. So we are very much going to market with a broad pricing strategy.\n\nWe want to have price points that meet each consumer's budget needs. And that has been an initiative that's been going on. It's certainly part of our initiative as we do M&A activities, but also we've been expanding our internal product assortment just by product development, where you continue to push and utilize more drop shippers we have our markets place sellers initiative that's going on and growing well. So we're expanding our product assortment widely and again, we're trying to get the right products in front of the customer to meet their occasions and their needs.\n\nAnd that's a big focus around customization and personalization for us.\n\nChris McCann -- Chief Executive Officer\n\nThat's a key factor Anthony. As we look at the expanding product offerings that we have, as Tom pointed out, through development, through marketplace, through acquisition, plus the enhanced customer file and the enhanced passport membership that we have, those are three of the key tenets of what really positioned us well for the future.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. Thanks for that. And then in terms of your wholesale business. I know sometimes that can vary in terms of timing of shipments to retailers between 1Q and 2Q.\n\nWhat are you expecting? What's embedded in your guidance for the first quarter?\n\nBill Shea -- Chief Financial Officer\n\nAnthony, you're right, we do have those orders in play on it. We do believe in Q1 that wholesale should be up slightly over a year ago for the season. Q1 and Q2 combined, we expect wholesale to be up year over year. We have those orders in play, you know the big box guys have ordered up this year over five years.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. Thanks. And then just curious, as far as your appetite for share repurchases, how should we think about that going forward?\n\nChris McCann -- Chief Executive Officer\n\nI think as we've seen in the past, last year we've worked under an increased authorization and we've gone through that. As we look at cash usage, we think the best place to use cash is where we've talked about already where we invest in automation, investing in the business as we have been through M&A activities. So at this point, we don't see our strategy really changing as far as cash allocation is concerned.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. And then lastly, as far as the automation efforts, are you at the tail end of that initiative or I guess in baseball terms, I mean, what inning are you in, in terms of the automation initiatives?\n\nBill Shea -- Chief Financial Officer\n\nYes. The big initiatives, we are very much in the late innings as we're just wrapping up the Atlanta facility as we speak. There will always be incremental equipment that we can buy to help automate various aspects of the business, but the facilities, the Southern Ohio and the Atlanta facility, two big facilities, we're at the tailwind, yes.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. Thank you very much and best of luck.\n\nChris McCann -- Chief Executive Officer\n\nThank you, Anthony.\n\nOperator\n\nThe next question will come from Michael Kupinski with NOBLE Capital Markets. Please go ahead.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nThank you. Thanks for taking my questions. I appreciate that. Obviously, we're in a rising interest rate environment still.\n\nAnd so, the consumer confidence improvement might just be a little bit of a head fake as we, kind of cycle through some of these rate increases. And so, I was just wondering, in terms of your playbook that we've seen in the past, the past economic cycles you've been through and so forth, how is your strategy in terms of expanding product offerings, increasing your marketing spend and so forth kind of weigh that against some of the past cycles you've been in and how you're positioning yourself? Is it similar to the past cycles you've been in or are you doing something differently than what you've done in the past? Just kind of give us some thoughts on that.\n\nChris McCann -- Chief Executive Officer\n\nI think we're always building on what we've learned and what we've done well on the past, Michael, and it's good to hear from you. Thank you. I think as we look at strategies going forward, again, if I reference to pre-pandemic stage, the pre-COVID stage, we saw the opportunity to accelerate customer acquisition based on the marketing costs and the effectiveness that we saw in the market. And therefore, we took advantage of that and invested more money behind Flowers and behind Harry & David specifically and that was paying off very nicely.\n\nOnce we moved into the pandemic, we again because of the costing, we saw the ability to really step on the gas pedal and step up our customer acquisition. I think we -- in this year, we still -- even when things tighten, we still required 5 million new customers on top of the 10 million customers we required since 2019. So we'll always play a nimble game there. And Tom, if you want to add any color here, but we'll always play a nimble game as to where we see the opportunity.\n\nRight now in this current market, we're not seeing the opportunity to accelerate new customer growth, but new customer growth is part of our strategy.\n\nTom Hartnett -- President\n\nYes. I'd say, Michael, good morning. A couple of things there. I mean, obviously, we just talked about our inventory, etc.\n\nWe think because we have such expanded inventory, we have a better catchment for our customers and a bit more opportunities to be relevant. Also, just I think we're as we continue to develop and mature as a company, we continue to get more customer focused in trying to again put that portfolio of products, the right products in front of them. So I think that's a big advantage, compared where we were probably three and four years ago. I'd say, just to echo Chris' point, I mean, we are disciplined around CAC versus LTV and we're watching that and making sure that we still putting forth and going to realize a return on those investments over time.\n\nSo that's an important piece of the equation here.\n\nChris McCann -- Chief Executive Officer\n\nAnd importantly, Tom, you just hit on a point, which is critical. I think people would understand our focus on our existing customer base. We continue to see improvements as we said in the doubling the size of the Celebrations Passport. Again, which comes with that increased frequency, increased retention rate.\n\nThe same thing as customers buying from more than one product category, buying our bundled products, etc. And I think that was reflected in our release and in our remarks where we highlighted that last year, even while we still acquired 1.5 million new customers, which was down from the year before. 70% of our revenue came from existing customers and we saw growth in existing customers. So that's a jewel for us to really continue to mine and get even better at.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. And then talking about your marketing spend a little bit, I did notice that the company was spending on television in the quarter and was just -- did you change a little bit of your marketing spend? Was there a change in the marketing mix? Anything related to that in the quarter?\n\nBill Shea -- Chief Financial Officer\n\nYes. Michael, certainly we continue to move and progress in more top of the funnel and more mid-funnel activities. We're very focused as we started off the call just around creative and content and matching those right pieces with the right ad units etc. And so, yes, in order to gain more share, more reach, we're constantly looking to move up the food chain, if you will on a market activities.\n\nAnd again, we've been -- we're able to do those things in metros pretty effectively so.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. And then just kind of going back to what I asked about before, how's the company's strategy of expanding product offerings while looking into the prospect of an economic downturn at some point, how does that compare to past recessions and in the past cycles? I know that your -- the changes in your product offerings are going to lower-priced products. I think as you kind of look at the inflationary impact, but I was just wondering in terms of the expansion because I think in the past, I think you've, kind of brought down the number of products. And I was just wondering in terms of SKU numbers and things like that, are we looking at the prospects of having the similar number of SKUs, a higher number of SKUs? What can we expect as we go into? What could be even more challenging economic environment?\n\nChris McCann -- Chief Executive Officer\n\nThanks, Michael. I think as we constantly are in conversation with our customers on what products we can bring to the table for them, well, that will continue to guide us. I don't think as we move forward, the recessions will be potentially reducing number of SKUs. If anything, we'll continue to add to the SKUs because we find that the more choice we give and as Tom pointed out earlier, broad price range is working for us.\n\nEven in this quarter, you saw AOV tick up a little bit. A good part of that was from a higher household income customers continuing to buy higher price point products. So even while we're making sure we have the entry-level price points, we need to make sure we're taking care of the customers at the higher end as well. So as we -- and then I think a key factor as we look at product expansion is how do we do that? Whether it's organic development, Tom mentioned earlier, the marketplace growth that we continue see well over 10,000 SKUs coming from third-party vendors right now on our platform, as well as if we see the opportunity for M&A activity will go that way as well.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nAnd then my final question is, I know that last year, we were cycling against some more significant wage rate increases and so forth. Are we now cycling against that or are we still seeing wage pressures?\n\nBill Shea -- Chief Financial Officer\n\nI think we're in a better shape from a labor standpoint than we were this time a year ago. We talked a lot about on various calls the big step up in labor rates that we saw last year versus the year prior and the two years prior to that. So it seems to be more of a stabilization of labor rates and market that seems to be some degree, a stabilization of even the hiring and the availability of labor. With that said, our big hiring for the season is still ahead of us.\n\nSo we haven't hit that yet, but we're certainly sitting in a better position today than we were a year ago.\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nGotcha. Thank you. That's all I had. Thanks.\n\nChris McCann -- Chief Executive Officer\n\nThank you, Mike.\n\nOperator\n\nThe next question will come from Alex Fuhrman with Craig-Hallum Capital Group. Please go ahead.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nHey, guys. Thanks very much for taking my question. Chris, I was hoping you could tell us maybe a little bit about where customer have been starting to pull back in terms of purchasing occasion? Are they still buying for special events in their own lives like anniversaries and birthdays. Curious if one of those kind of areas or self-consumption or just kind of everyday gifting has been impacted more? And just trying to get a sense of if people are still spending on those key events that maybe might suggest they might come back for major holidays like Valentine's Day again?\n\nChris McCann -- Chief Executive Officer\n\nYes, Alex. Thank you. That's exactly why we're continuing to say is that the softness and it's been fairly long since not just this past quarter, but beginning last year, beginning December really, well, post-December, post-holiday is whether we saw the weakness has really been more on those everyday occasions. The birthday, the anniversary is just because occasion, etc.\n\nWe've had a strong holiday season, we had a strong Valentine's season, strong Mother's Day, which proves was good for us, but it's been in those everyday occasions that we've seen the softness. And that's where we've been moving, especially on the food business. But to prior years, we've seen good growth on those occasions. So we've seen a little shift, but that's also what gives us some good optimism as we go forward into this upcoming holiday season is that customers are still stepping up for those really must have holiday gifts.\n\nBill Shea -- Chief Financial Officer\n\nYes. Alex, just a reminder, I think we said in our formal remarks, but a reminder of where we are, even on those everyday occasions, versus three years ago in the pre-pandemics side, our food group, even in the fourth quarter was up over 100% over 2019. So a lot of that is those everyday occasions. So while we're seeing the consumer pullback now year over year over the pre-pandemic.\n\nWe had such large growth during the pandemic stage that was still doubling the size of where we were three years ago.\n\nChris McCann -- Chief Executive Officer\n\nYes, very good point.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nYes, that's helpful. Thank you, guys, very much.\n\nOperator\n\nThe next question will come from Linda Bolton Weiser with D.A. Davidson. Please go ahead.\n\nLinda Bolton Weiser -- D.A. Davidson -- Analyst\n\nYes, hello. Good morning. So just to clarify, Bill, the free cash flow for FY 2023, you're saying it will be positive, a positive number, is that correct?\n\nBill Shea -- Chief Financial Officer\n\nYes. I'm not giving guidance for the year; we've going to give it for the quarter, but free cash flow, we know we have a $100 million plus addition to where last years were because of the investments we made in working capital and the higher capex that we have. So yes, we are saying that free cash flow will be positive.\n\nLinda Bolton Weiser -- D.A. Davidson -- Analyst\n\nOK. And then I'm just -- you've made a lot of reference to FY 2019. And so, I'm going back and looking at the financial back then, and your company is much bigger on a revenue scale than it was then, but your cost structure is also higher. So I'm trying to figure out, like, you know, you had 82 million of EBITDA that year and a 42% gross margin.\n\nWell, your gross margin is a lot lower today. So I'm just trying to figure out. I mean, it seems like you would not be able to earn 82 million today with a higher cost structure. Am I thinking of that correctly? I mean, is there any way to kind of help us think about the differences now today versus FY 2019 and the profit level?\n\nBill Shea -- Chief Financial Officer\n\nWell, Linda, I mean obviously what we've been talking about throughout this fiscal year as we've reported each of the quarters is the challenges we're having on the gross margin side. So yes, we were at 42%, back in 2019, but a lot of the macro issues have caused a lot of the cost inputs for our gross margins to be up. Those are not permanent. We believe those will ultimately self-correct over time.\n\nI gave the example of ocean freight that went from -- again, a few years ago, we were paying $4,000 a container. We went up to over $25,000 a container a year ago. Those things have dropped dramatically. The spot market now is like below 10,000 a container to bring in from China.\n\nSo things -- there were significant cost inputs that impacted our margins. Some of them still exist today, some of them are improving and we think over time they will improve. That coupled with the initiatives that we have in play, as well as what Tom referenced in pricing, we'll start seeing improvements in margin again.\n\nChris McCann -- Chief Executive Officer\n\nRight. So the key factor is, we're recognizing some of the costs, while Bill says will improve, I'm not going to go away, but that's why we have initiatives in place internally to restructure -- to redo our cost structure. Automation being an example of that.\n\nLinda Bolton Weiser -- D.A. Davidson -- Analyst\n\nOK. And I know you said something about gross margin being up year over year, did you mean for full-year -- FY 2022 or FY 2023 or did you mean in FY 2024?\n\nTom Hartnett -- President\n\nThis is Tom. I think Bill just misspoke. I mean he meant to say down when he was describing those gross margins were down in 2022.\n\nBill Shea -- Chief Financial Officer\n\nIf we're talking about 2022, gross margins were down. I think what I said and what we're referencing in our margins is the second half of the year, we expect to see improvements in gross margins year over year in the latter part of our -- latter part of this fiscal year.\n\nChris McCann -- Chief Executive Officer\n\nYes.\n\nLinda Bolton Weiser -- D.A. Davidson -- Analyst\n\nOK. But I mean, the key quarter that was the second quarter. So I mean, it doesn't sound like gross margin can be up in that quarter. Is that correct?\n\nBill Shea -- Chief Financial Officer\n\nYeah. Linda, we're giving guidance on a quarter-by-quarter basis here, right? So we gave guidance for the first quarter. We believe certainly over the longer-term margins are going to improve. We believe the second half of the year margins will improve as we comp against the high points of where the costs were and we're starting to see improvements.\n\nThe higher costs we started to incur started in Q2 last year and obviously peaked in Q3 and Q4. So we're providing the guidance that we're providing so far.\n\nLinda Bolton Weiser -- D.A. Davidson -- Analyst\n\nOK. And I'm just curious about the pricing. You know, I mean, It's a hard business in the sense that margins are thin. You do have a lot of online competitors, but a lot of those are not profitable.\n\nSo they're facing the same types of cost pressures. So I'm curious about why your pricing can't be higher and more offset some of the pressures for you? Is there competitive things that are different today versus a couple of years ago?\n\nChris McCann -- Chief Executive Officer\n\nNo, I think it's mainly not so much. It's not a competitive issue really, it is a marketplace issue. As far as in the product categories that we're playing, what the value perception the consumer has on a product. So we're constantly testing our pricing.\n\nAnd every time we see if the pricing moves to the point where we see a drop in demand, a drop in conversion rate, then we know the consumer is pushing back and that's too far to push on the pricing. So that's why we say we're very strategic about how we look at pricing initiatives. And more importantly, make sure that we're merchandising to give customers the low wage price points they need, but as I pointed out also, we're seeing customers that have higher household income customers spend on the higher price points helping to drive up ALV. So it cuts across the board, but we just -- at the price point that we play in, I don't think you have as much price elasticity as one might think.\n\nTom Hartnett -- President\n\nI think -- This is Tom. The point here is that we -- because of our scale, we do have other opportunities that are competitors in the larger vertical on a larger verticals of brands we don't have. And we've been using that to gain market share and we've seen that growth in Q4 for our largest brands and particularly on the Flowers brand for the year for December, February, May and for the whole year, we've had significant increases in market share and we're going to continue to look at that and hopefully that changes the competitive dynamic over time.\n\nLinda Bolton Weiser -- D.A. Davidson -- Analyst\n\nHave you thought about trading off market share for profitability, giving up some market share to have better profitability?\n\nBill Shea -- Chief Financial Officer\n\nAgain, as far as the most important thing is, send it around the customer and making sure we're focused on a customer and the lifetime value of that customer and having the right product in front of them and when there's the opportunity on an item where we created that appropriate value. We'll take pricing on it.\n\nLinda Bolton Weiser -- D.A. Davidson -- Analyst\n\nOK. Well, thanks very much guys, and good luck with everything.\n\nBill Shea -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Chris McCann for any closing remarks. Please go ahead, sir.\n\nChris McCann -- Chief Executive Officer\n\nI'd just like to thank everyone for joining us today. Certainly, if you have any follow-up questions we're here to take those for you. And I appreciate the time and wish everybody a good end of summer season.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoseph Pititto -- Senior Vice President, Investor Relations and Corporate Communications\n\nChris McCann -- Chief Executive Officer\n\nBill Shea -- Chief Financial Officer\n\nDan Kurnos -- The Benchmark Company -- Analyst\n\nTom Hartnett -- President\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nMichael Kupinski -- NOBLE Capital Markets -- Analyst\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nLinda Bolton Weiser -- D.A. Davidson -- Analyst\n\nMore FLWS analysis\n\nAll earnings call transcripts"
}