{
  "companyName": "Nio Inc.",
  "companyTicker": "NIO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/nio-inc-nio-q2-2022-earnings-call-transcript/",
  "content": "Nio Inc. (NIO -2.40%)\nQ2 2022 Earnings Call\nSep 07, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by, and welcome to the NIO Inc. second quarter 2022 earnings conference call. [Operator instructions] Now like to hand the conference over to Ms.\n\nEve Tang from capital markets. Please go ahead, Eve.\n\nEve Tang -- Investor Relations\n\nGood morning, and good evening, everyone. Welcome to NIO's second quarter 2022 earnings conference call. Accompanying financial and operating results were published in the press release earlier today and are posted at the company's IR website. On today's call, we have Mr.\n\nWilliam Li, founder, chairman of the board, and chief executive officer; Mr. Steven Feng, chief financial officer; Mr. Stanley Qu, senior VP of finance; and Ms. Jade Wei, VP of capital markets.\n\nBefore we continue, please be kindly reminded that today's discussion will contain forward-looking statements made under the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's actual results may be materially different from the views expressed today. Further information regarding risks and uncertainties is included in certain filings of the company with the U.S.\n\nSecurities and Exchange Commission, the Stock Exchange of Hong Kong Limited, and with the Singapore Exchange Securities Trading Limited. The company does not assume any obligation to update any forward-looking statements, except as required under applicable law. Please also note that NIO's earnings press release and this conference call includes discussions of unaudited GAAP financial information, as well as unaudited non-GAAP financial measures. Please refer to our news press release, which contains a reconciliation of the unaudited non-GAAP measures to comparable GAAP measures.\n\nWith that, I will now turn the call over to our CEO, Mr. William Li. William, please go ahead.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nHello, everyone. Thank you for joining NIO's Q2 2022 earnings call.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nNIO delivered a total of 25,059 vehicles in Q2 2022, representing a 14.4% increase year over year. In July and August 2022, NIO delivered 10,052 and 10,677 vehicles, respectively, marking increases of 26.7% and 81.6% year over year. During this period, the company's vehicle production and deliveries were faced with challenges from the COVID-19 pandemic, extreme weather conditions, and supply chain uncertainties. We will work closely with all of our supply chain partners to further accelerate the production and delivery of our vehicles.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nBenefiting from the continued demand growth for premium electric vehicles and new outstanding product and service competitiveness, we believe the vehicle deliveries will witness robust growth in the second half of 2022 with the delivery and production ramp-up of ET7, ES7, and ET5 based on the NT2.0 platform. Hence, the upgraded 2022 ES8, ES6, and EC6, we expect the total delivery in the third quarter of 2022 to be between 31,000 to 33,000 units.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nIn terms of our financial performance, despite the significant increase in battery costs in Q2, the vehicle gross margin reached 16.7%, contributed by the deliveries of ET7 with high specifications. Part of the orders is adjusted prices and refined management of a sales policy.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nNext, I would like to share some recent key highlights of our R&D and operations.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nAt NIO, the first products based on the NT2.0 platform, the ET7, has demonstrated strong product competitiveness in the mid-large premium sedan segment, with its industry-leading software and hardware platforms and the smart digital experience.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nOn June 15, NIO launched the ES7 of mid-large five-seater SUV based on the NT2 platform. Inheriting NIO's high-performance DNA, the ES7 both autonomous driving, handling, and safety performance, creating comfort and the intelligent experiences beyond the expectations. In addition, ES7 offers an electric so far as an option, enabling a new outdoor experience with a touring caravan. Since the start of the user test drive in August, the ES7 has been well received in the market and kicked off deliveries at scale starting from August 28th.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nWe have also launched the 2022 ES8, ES6, and EC6, fitted with the new digital system order, with comprehensively enhance the perception unit and computing power. The three products offer richer digital corporate experience and have strengthened their competitiveness in the market.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nThe mass production preparation of the ET5 and midsize smart electric sedan based on NT2 is also in full swing, while its performance and configuration have been further optimized and enhanced compared with those at the time of the product launch. With pure and progressive design ultimate performance and outstanding intelligent experience, the comprehensive competitiveness of the ET5 far surpasses the peers in the same segment. We're confident that ET5 will become one of the most popular midsized premium sedans. The production order confirmation of ET5 will start from September 9th, and the first batch will be delivered to users on September 30.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nWith regards to digital systems, we released the Banyan 1.1.0 based on NT2 in August with over 60 new features and optimizations. In terms of the digital corporate and the driving experience, this update has introduced more modes under the parking scenario, diversified the audio and video experience in the cabin and further optimize the suspension comfort and the vehicle handling. In the aspect of the advanced driver assistance system, we have further upgraded the environment simulation display and automatic emergency braking, which has to enhance the action experience and driving safety for the users.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nAs for production, we rolled the first batch of ET5 preproduction vehicles off the production lines at NIO's factory two at NeoPark, and we plan to start the mass production this month.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nWith regards to sales and service network, we now have 395 new houses and new spaces in 149 cities across the globe, and 263 new service centers and delivery centers covering 151 cities in the world.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nIn terms of the charging and swapping network, we have built an expressway power swapping network, covering five verticals and three horizontal expressways and four metropolitan areas in China. We have installed 1,094 power swap stations, including 285 situated by the expressways and completed over 12 million battery swaps for our users. At the same time, we have deployed 1,873 power charger stations, including 5,341 power chargers and 5,466 destination charges and connected with more than 5,600 third-party charges, offering over 860,000 times of in fleet for power services. NIO is dedicated to putting in place a power system with chargeable, swappable, and upgradable experiences, making the recharging experience better than refilling.\n\nTo this end, we have been making continuous investments with a vertical and horizontal network across the country and a hub and spoke layout in the metropolitan areas. We aim to bring a more convenient and joyful travel experience for our users.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nOur swap stations are not only efficient recharging facilities but also serve as a virtual power plants. During this summer, we responded to power grid -- we responded to power grid peak shaving in different cities while over 100 stations. In the meantime, up to 60% of the stations are regularly involved in the off-peak charging by increasing the electricity consumption in off-peak hours. To support energy saving and emission reduction, NIO power swap stations will continue to support power great demand response and optic charging in more regions.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nAs for the global markets, with the new ET7 being shipped to Europe in August, the order placement and user delivery of our new products will take place in Germany, the Netherlands, Denmark, and Norway this year.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nOn August 28, Hefei was chosen by our user community as the host city for NIO Day 2022 and the preparation for the events have been officially kicked off. We look forward to sharing with you our latest progress regarding our products and the core technologies at that time.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nAs a player in the smart electric vehicle industry, NIO has been devoted to practicing corporate social responsibility and supporting global sustainable developments. Since the very beginning of our establishment, NIO has been endorsing the Formula Student Electric China. And starting from last year, we began to endorse the formular student autonomous China, FSAC. In August of this year, NIO officially became a partner of a Formula Student Germany.\n\nWe would like to contribute to the development of young talents in the global automotive industry by supporting this event. On August 15, NIO officially entered into a partnership with the United Nations development program, UNDT. As a partner of the Green Park's platforms, the UNDP will conduct in-depth collaborations with NIO in areas such as the environmental protection of protected areas and the natural reserves and supporting social and partnership to encourage young innovators to explore business solutions to advance biodiversity conservation and ecological protection.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nThe second half of 2022 will be a critical period for the delivery and production ramp-up of multiple new products of NIO, which will present huge pressure on the supply chain, production, delivery, and services. The team will work closely with our partners to improve system efficiency, accelerated the mass production and the delivery of our vehicles and ensure high-quality products and the service experience.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nAs always, thank you for your support. With that, I will now turn the floor over to Steven to provide you the financial details for the second quarter. Over to you, Steven.\n\nSteven Feng -- Chief Financial Officer\n\nThank you, William. I will now go over our key financial results for the second quarter of 2022. And to be mindful of the length of this call, I'll reference to RMB only in my discussion today. I encourage listeners to refer to our earnings press release, which is posted online for additional details.\n\nOur total revenues in the second quarter were RMB 10.3 billion, with an increase of 21.8% year over year and 3.9% quarter on quarter. Our total revenues are made of two parts: vehicle sales and other sales. Vehicle sales in the second quarter was RMB 9.6 billion, representing increase of 21% year over year and 3.5% quarter over quarter. The increase in vehicle sales year over year was mainly attributed to higher deliveries.\n\nIncrease in vehicle sales quarter over quarter was mainly driven by higher average selling price. Other sales in the second quarter was RMB 0.7 billion, which is an increase of 34.6% year over year and 8.2% quarter over quarter. The increase in other sales year over year was mainly attributed to increased revenue derived from auto financing services, sales of service and energy packages and sales of used cars. The increase in other sales quarter on quarter was mainly attributed to the increased revenue derived from sales of used cars and auto financing services.\n\nGross margin in the second quarter of 2022 was 13% compared with 18.6% in the second quarter of 2021 and 14.6% in the first quarter of 20225. The decrease of gross margin year over year was attributed to the decrease of vehicle margin and reduction of other sales margins, resulting from expanded investment in power and service network. The decreased gross margin part of the quarter has been attributed to decrease of vehicle margin. More specifically, regarding the second quarter was 16.7% compared with 2.3% in the second quarter of 2021 and 18.1% in the first quarter of 2022.\n\nThe decrease of vehicle margin year over year and quarter-to-quarter was mainly attributed to increased battery cost per unit, which was partially offset by favorable changes in sales mix of ET7. R&D expenses in the second quarter were RMB 2.1 billion, which is an increase 143.2% year over year and 22% quarter over quarter. In credit year over year and quarter over quarter was mainly attributed to the increased patent costs and development countries as we add incremental design and development costs for new products and technologies. G&A expenses in the second quarter was RMB 2.3 billion, which is an increase of 52.4% year over year and 13.3% quarter over quarter.\n\nThe increase in SG&A expenses year over year was primarily to the increase in department costs and costs related to sales and service network expansion. The increase in SG&A expenses quarter-over-quarter was mainly attributed increase in personnel costs and increase in marketing and promotion services, including expenses the latest launch of ES7. Loss from operations in the second quarter was RMB 2.8 billion, which an increase of 272.8% year over year and 30% quarter over quarter. Net loss in the second quarter was RMB 2.8 billion, representing an increase of 360.6% year over year and 37% quarter to quarter.\n\nNet loss attributable to NIO's ordinary shareholders in the second quarter was RMB 2.7 billion, which is an increase 316.4% year over year and 50.4% quarter-over-quarter. Our balance cash and cash equivalents, restricted cash, and short-term investment was RMB 54.4 billion as of June 30, 2022. Now, this concludes our prepared remarks. I will now turn the call over to the operator to proceed our Q&A session.\n\nOperator\n\n[Operator instructions] First question comes from Tim Hsiao from Morgan Stanley. Please go ahead.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So, I've got two questions. The first one is about the component supply crunch. Because the supply bottleneck continuously kept the sales upside of the models like ET7. Should we be concerned about any potential hiccup to the production of models like ES7 and ET5 in upcoming months? And in light of fresh round of the [Inaudible] operating in China, what has NIO team done so far to hedge the risk of potential disruption to the company's upcoming models? And even for next year, we are going to have the NT2.0 upgrade for ES8, ES6, and EC6.\n\nSo, what have we done to avoid this kind of risk to our production? The second question is about the chipset. I just want to learn that, what's your take on the restriction to the export of high-end GPU from companies like NVIDIA and AMD to China? While near term, the impact to the auto industry should be pretty limited, but would that accelerate our new point of semiconductors, the localization in the upcoming models, or even speed up the in-house development of our own chips for functions like autonomous driving in the future? Thank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nThanks, Tim, for your question. Regarding the first question, in the third quarter, especially in terms of July and August, we have some supply chain hiccups. And we believe COVID-19 resurgence in some regions in China in September also effects of our supply chain to some extent. But based on our experience, accumulated throughout the March and the April experience in Shanghai, we believe that the COVID-19 impact is under control compared with that of the second quarter.\n\nRegarding the macro costing components, the yield rate is below our expectation, and this has affected the vehicle delivery to our users. But we have already taken multiple measures to use the yield rate of the micro testing components. For example, we have already sent over dozens of engineers to our suppliers to help them to improve the yield rates, and we have already witnessed some improvements. At the same time, we have also introduced some new partners for the micro testing component.\n\nWe believe we have already resolved this due to some extent, the preliminary stage. And we understand properly in October, we should be able to resolve this issue at once. Of course, we are confident about our delivery in the fourth quarter, and we are confident to achieve our delivery targets for the whole year. Of course, there will be many challenges ahead of us, but we will drive faster to achieve the target and improve delivery performance in the fourth quarter.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nRegarding the U.S. shipment related with the AI training chipset, we believe that this will not have an impact on our business operations. Based on offer estimations, over-computing power is sufficient for our autonomous driving technology in in the aspect of the AI training for now, and we have been working very closely with our partner, NVIDIA. At the same time, we have been keep monitoring the situation very closely.\n\nWe understand, there are also many AI chipsets type companies in China who are working on the mass production of their data chipset. So, we are evaluating a different kind of technical solutions for this AI training chipsets, and we would like to work with different companies on this respect. Basically, we believe that this is not going to affect our long-term strategy.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nOf course, we are building of our core technology and the capabilities, including the chipset. And we believe our target is to build the full stack in-house capabilities in all those key core technologies. We are building our capabilities, and we believe that this is going to help us to mitigate the political risks and the regulatory risks. At the same time, it can also help us to improve our technology powers and also offer gross margin as well.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language]\n\nOperator\n\nThe next question comes from Ming-Hsun Lee from Bank of America. Please go ahead.\n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] What is your latest guidance in the SG&A and the R&D ratio, considering more industry competition and also overall lower sales for the industry. Do you have any new target for your point of sales? Second question, your ET5 and ET7 have very good feedback during the Chengdu auto show. But currently, there is more competition and product iteration in the industry. Will you speed up the new product launch? And also, could you give some guidance regarding your 2023 new model plan? And can you also share, do you have any plan for a third brand? Thank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nThanks, Ming, for the question. Yes, in the industry, we have seen many companies launching good products in the market. But in terms of the investment, we would like to follow our own strategy and cadence. In terms of R&D, of course, this is our long-term strategy.\n\nWe'd like to make decisive investments on R&D. This year, we have ramped up our R&D investment to improve our long-term competitiveness. And also for the SG&A, as a percentage of the revenue, we believe the long-term trend is going down. And we don't expect to change our pace or our strategy just because of the competition in the external environment.\n\nWe would like to make sure we can focus and determined on our own strategy and pace.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nWell, for the ET5, we have already showcased the ET5 in different aspects in the Chengdu auto show and other exhibitions and auto shows as well. We have also received a wide range of media coverage for the ET5. ET5 has attracted a lot of attention of the users, the public, and the media, and we have received very good reviews and feedback from the user itself. Next year, we plan to further launch more products based on the NT2.0 technology platforms, and we plan to upgrade our parent ADV to the NIO Technology Platform 2.0.\n\nWe believe with all the product rolled over to the NIO Technology Platform 2.0, we will be very confident regarding our market performance at that time. Because if we look at the ET7, the ES7 and the ET5, we the comprehensive competitiveness of the NT2.0 technology platform. And we have launched many innovations that have been very much welcomed by our users. Of course, at this moment, I cannot share much details regarding the new product launch, and we would like to say that we are going to accelerate the ramp-up of our new products based on the NIO Technology Platform.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nOK. Regarding the third question, of course, we would like to have more and more users to use of the products and enjoying of our technologies. At the same time, we have to pay attention to the users' needs and advance at different price range and users of a different brand may have a different need regarding the products and the technologies. So, for us, we would like to have more smart EV users to experience our products and enjoy the benefits of those core technologies, and we will make decisive planning regarding this.\n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language]\n\nOperator\n\nThe next question comes from Bin Wang from Credit Suisse. Please go ahead.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language] My first question is the full year volume guidance. As you already previous guide that second half this year, the volume guidance will be 100,000 units. If you're considering your third quarter guidance, that means that in the last quarter, number four quarter, your volume will be around 68,000 units. Is that true, say in October '23 or in November '22 and December '24 to '25, especially about your volume progress? That's the number one question.\n\nAnd then the two is about the order backlog. We actually do some data visit to co-dealers. They told me that three to four months [Inaudible] new products, say, yes, 787 and 85. So, can I assume 15K are ordered for the ES7, 15K for ET7, and roughly 55,000 for ET5.\n\nSo, together, you've got an 8K order backlog. That is the -- is that the right way to think about the order backlog? That's the second question. And last one is about margin outlook in the number three quarter. Basically, the second quarter guidance, previously, that will be declined 3% to 4% q-on-q and right now the margin seems to be better than your guidance, right? So what's your outlook for the number three quarter? You actually have increased the price for two times for the old products.\n\nShould the third quarter gross margin return to a level in the first quarter and this year? Thank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nThanks, Bin, for your question. Previously, I've also mentioned that we will try our very best to meet the delivery target for this year. Of course, this means that the fourth quarter is going to witness a lot of pressure and the challenges on our delivery and supply. We have already started to make the preparation for the delivery starting from the third quarter.\n\nWe believe starting from the fourth quarter, we're going to have the two factories are running to make sure we can support the delivery demand. Actually, starting from the third quarter, we have already kicked off the tooling and the preparations for the mass production of ET5 at large scale in the factory two in the NeoPark. At the beginning, we believe the production capacity of the factory two is a relatively lower compared with the factory one because the factory two will only need to manufacture one product, that is ET5. So, we believe, in the fourth quarter, we are going to break record every month.\n\nAnd we are confident to achieve the record-breaking target for the fourth quarter, and we have been making active preparations to meet this target as well.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nActually, we haven't. Regarding the specific order information, we believe we haven't disclosed this information for a long time because different companies have different definitions and understanding regarding the orders. But what I can say now is that we have a sufficient order backlog regarding the ES7 and the ET7. Actually, for the ES7, we believe the order performance is actually much better than our expectation.\n\nFor the ET5, the waiting time is much longer. Recently, we believe that the bottleneck or the constraints is not about the demand. It's mainly about the production capacity of the supply chain. Of course, for our own production capacity, we believe we have already made sufficient preparations.\n\nBut the main constraint will be in the supply chain.\n\nSteven Feng -- Chief Financial Officer\n\nFor the other question about the --\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nSteven Feng -- Chief Financial Officer\n\nOK. William, yeah. For the third question about the gross profit margin of Q3 and second half year, sure, the company has taken multiple measures to improve our gross margin profit. And we reached the selling prices of certain vehicle models by and ET7, and most of the positive impact will be reflected in Q3.\n\nMost of ES7 starting to be delivered in Q3, our first addition with higher price and margins. So, we expect a slight increase of vehicle margin in Q3. But in short term, we are still facing great uncertainty and challenges regarding the battery cost which will be -- which will have a negative impact to our gross margin. Thank you, Bin.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language]\n\nSteven Feng -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Jeff Chung from Citi. Please go ahead.\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language] So, my first question is about the ET5 production capacity. How many ET5 we can produce in December? And what is the pace on ET5's ramp-up from October to December? This is the first question. And the second question is about the overall production ramp-up from September to December. So, our third quarter guidance implied the September run rate should be accelerated by 15% month on month.\n\nSo, in order to meet our full year's target, the October to December month-on-month revenue has to be at least a 30% level on every month. So, should we expect a straight-line ramp-up or accelerating pace? That's December, November, the portion could be more critical rather compared to October. Thank you.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\n[Foreign language] Thank you, Jeff. Yes, actually, I think for the production capacity ramp-up, everyone understands this will make some time, and there's a process, especially when it comes to new product production ramp-up. At the beginning, it will start at a relatively low volume, and then it can accelerate to a stable level. We have already made sufficient appropriations for the mass production of the ET5.\n\nAnd we believe the ET5 will have the opportunity to surpass the 10,000 units in one month. If we look at December, of course, our internal target for ET5 should be higher than this. For the November and December, we believe we are going to break the delivery record month over month. Especially, we are going to see the peak at December.\n\nPreviously, I have also mentioned in October, the supply chain bottleneck will be resolved for the ES7 and the ET7 and around that time, we will also ramp up the production of the ET5. So, it means that we're going to see the delivery volume to gradually ramp up. But at this moment, we cannot predict with certainty because there are many factors outside of our control. But in the past few years, we have experienced many challenges and extreme situations.\n\nIn the past, we have accumulated lots of experiences. So, our team knows how to handle those challenges and ramp-up of production amid those challenges. We believe in the fourth quarter, of course, we're going to experience any pressure in terms of the supply chain and production, but we are confident to make sure we can meet the target that we set for results.\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language]\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language] So, my question is if the production capacity is 10,000 a month --\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language]\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nOf course, for the reservation orders, there are some fluctuations and uncertainties. But for the production order confirmation, this is the starting point for us to make the arrangement of the actual production of ET5. If you would like to get your ET5 earlier then, of course, you should place your orders as soon as possible.\n\nJeff Chung -- Citi -- Analyst\n\n[Foreign language]\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nOperator\n\nThe next question comes from Edison Yu from Deutsche Bank.\n\nEdison Yu -- Deutsche Bank -- Analyst\n\nFirst one, we noticed that William visited the U.S. last month. And I was wondering, you know, what kind of decisions or perhaps considerations were taken when he was there perhaps earlier entry into the U.S.? And then the second question is the original plan was to introduce a solid hybrid battery pack, I believe, in the fourth quarter. Is there any updates to this? Is it still on track? [Foreign language]\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nThank you, Edison, for your question. NIO is a global setup from day one. Actually, we set up the San Jose R&D center back in 2015. Because of the COVID-19 situation, I haven't been able to visit of our colleagues in the U.S.\n\nfor several years. We actually have hundreds of colleagues here based in the U.S., and we also have colleagues in Europe. So, at this time, I would like to visit our colleagues here in the U.S., and then I will also go to Europe to visit over colleagues over there. For the U.S.\n\nmarket entry, we have been making preparations for a long time. We have been thinking about the U.S. market entry strategy back in 2017, and this has been in planning for almost five years already. We have been thinking about what kind of products should be the best product for the U.S.\n\nmarket, what kind of user experience we should provide, and what should be the right business model for the U.S. market. We believe -- so right now, we have a much clear plan regarding the U.S. market entry, and we have been making comprehensive preparations based on our plan and the strategy for the U.S.\n\nmarket. U.S. market is quite different from the China market and also the European market. The U.S.\n\nmarket is very competitive and regulatory environment is also quite different from China and Europe. We have been making long-term thinking and preparation about the U.S. market entry. And we believe that the right strategy for us is to make comprehensive preparations and patience.\n\nOf course, there isn't much details we can disclose at this moment. But we believe we have a clear strategy for the U.S. market entry, and we just need to be patient for the execution.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nFor the 150-kilowatt-hour semisolids battery pack, this battery pack offers a very high power density, and we are making comprehensive evaluations of this semisolid battery pack. We are making preparations for the production of thus battery pack together with our partners. But according to our current evaluation, we believe that probably we are not going to provide this service to our users in the fourth quarter. And according to the current evaluation, this battery pack will be delayed for several months.\n\nOf course, we have been working with our partners to evaluate the progress. And this is the current situation that we will try to work with our partners to improve the situation.\n\nEdison Yu -- Deutsche Bank -- Analyst\n\n[Foreign language]\n\nOperator\n\nThe next question comes from Paul Gong from UBS. Please go ahead.\n\nPaul Gong -- UBS -- Analyst\n\n[Foreign language] So, two questions from me. The first one is, have you realized that there might be some orders that have been placed by certain people who is not really intending to get the vehicle, but just to jump the queue and try to sell the order to someone else for profit, which might inflate the order and give some misleading information for your production plan, and how do you prepare for that? My second question is regarding your secondary and tertiary brands preparation, [Inaudible] and Firefly. We noticed that there are some orders has been entered with some suppliers, especially from the batteries and other components. Are there more color management can share compared to, let's say, two quarters ago?\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nThanks, Paul, for your question. Regarding the first question, of course, if we cannot meet the user demand in a timely manner then probably some users may transfer their orders to others. But we have very strict policies regarding the order transfer. So, we believe there will be very few cases for the order transfer, and the percentage of order transfer will be quite low.\n\nThis is probably also because of our follow-up mechanism. If you place a reservation order for now, then we'll follow up with you regarding the specific orders and then be converted to the actual production orders. In our current order backlog, we lead the percentage of users who are only placing the orders to make sure they can transfer the orders to others in the future to make a profit. This percentage should be quite low because of all the different mechanisms we have in place.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nEve Tang -- Investor Relations\n\nFor the mass market brand, previously, we have already discussed about our plans for the mass market brand. Currently, the R&D progress is on track. Our plan for the mass market, the product is to follow the schedule and the cadence of our latest technology platform, that is the NIO Technology Platform 3.0. We're going to launch the mass market products based on the NIO Technology Platform 3.0.\n\nYes, probably, from the media and the supply chain, there have been some discussions about the third brand of NIO. Actually, in the past, we have recognized that if we want to accelerate the conversion from the ICE to EV, we will link to provide more products to cater to different user in different segments. And we believe in the past year, we have witnessed tremendous growth in terms of the EV demand at the entry-level market segment, which has also been driving the EV penetration here in the China market. We have realized some interesting opportunities for the business model innovation.\n\nAnd I believe NIO is very good at combining the innovative technologies with the user experience and provide very innovative experience to our users. We have identified some opportunities for us to make innovative technologies and blended together with the business models to provide services to the users and provide a different kind of products to a wider range of user groups and communities. So, at this moment, we cannot disclose much information about it. But what I can say is that we do believe that there are some opportunities about to be explored.\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nPaul Gong -- UBS -- Analyst\n\n[Foreign language] Thank you so much.\n\nOperator\n\nThis concludes our question-and-answer session. I will now hand the call back to Ms. Eve Tang for closing remarks.\n\nEve Tang -- Investor Relations\n\nThank you once again for joining us today. If you have further questions, please feel free to contact NIO's investor relations team through the contact information provided on our website. This concludes the conference call. You may now disconnect your lines.\n\nThank you.\n\nDuration: 0 minutes\n\nEve Tang -- Investor Relations\n\nWilliam Li -- Founder, Chairman, and Chief Executive Officer\n\nSteven Feng -- Chief Financial Officer\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\nBin Wang -- Credit Suisse -- Analyst\n\nJeff Chung -- Citi -- Analyst\n\nEdison Yu -- Deutsche Bank -- Analyst\n\nPaul Gong -- UBS -- Analyst\n\nMore NIO analysis\n\nAll earnings call transcripts"
}