{
  "companyName": "The Wendy's Company",
  "companyTicker": "WEN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/the-wendys-company-wen-q2-2022-earnings-call-trans/",
  "content": "The Wendy's Company (WEN -0.66%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. Welcome to The Wendy's Company earnings results conference call. [Operator instructions] Thank you. Kelsey Freed, director of investor relations, you may begin your conference.\n\nKelsey Freed -- Director, Investor Relations\n\nThank you, and good morning, everyone. Today's conference call and webcast includes a PowerPoint presentation, which is available on our investor relations website, irwendys.com. Before we begin, please take note of the safe harbor statement that appears at the end of our earnings release. This disclosure reminds investors that certain information we may discuss today is forward-looking.\n\nVarious factors could affect our results and cause those results to differ materially from the projections set forth in our forward-looking statements. Also, some of today's comments will reference non-GAAP financial measures. Investors should refer to our reconciliations of non-GAAP financial measures to the most directly comparable GAAP measure at the end of this presentation or in our earnings release. On our conference call today, our president and chief executive officer, Todd Penegor, will give a business update; and our chief financial officer, Gunther Plosch, will share a franchise health update, review our 2022 second quarter results and provide an update on our outlook for the year.\n\nFrom there, we will open up the line for questions. With that, I will hand things over to Todd.\n\nTodd Penegor -- President and Chief Executive Officer\n\nThanks, Kelsey, and good morning, everyone. I am incredibly proud of the entire Wendy system for driving a significant sequential acceleration in our results in the second quarter, which highlights the strength of our underlying business and brand, as well as our commitment to the restaurant economic model. Our Global same-restaurant sales significantly exceeded our expectations, marking a third consecutive quarter of double-digit two-year growth. We once again accelerated versus the prior quarter on a one- and two-year basis, which highlights the momentum that continues to build on our business across the globe.\n\nThis sales growth translated into an almost 300 basis point sequential expansion in our company-operated restaurant margin even as we faced incredible inflationary pressures during the quarter. On the breakfast front, we are very excited to have officially launched breakfast in Canada, giving our fans in that market the craveable breakfast they deserve. Meanwhile, our U.S. breakfast business outperformed the competition with another quarter of morning meal traffic share growth in the QSR burger category.\n\nOur digital business continued to accelerate, delivering global digital sales mix of approximately 10% and growing monthly active users in the U.S. by more than 5%. Our franchisees are operating from a position of strength after achieving record-setting profits across the U.S. and Canada in 2021.\n\nThese results are evidence of our strong system alignment, consistent execution and unwavering focus on delivering profitable growth across our three strategic pillars. As we look ahead, we remain committed to accelerating our business behind these pillars for years to come. Our Global same-restaurant sales accelerated on both a one- and two-year basis in the second quarter, with two-year growth of over 21%. We are entering the back half of the year with a ton of momentum following sequential Global same-restaurant sales acceleration each month of the second quarter.\n\nWe continue to see widespread growth across our International business, achieving a fifth consecutive quarter of double-digit one- and two-year same-restaurant sales growth. This was driven by another outstanding quarter in Canada due in part to our breakfast launch and outperformance across our Latin America and Caribbean region and our largest markets in Asia Pacific. During the second quarter, we also celebrated the one-year anniversary of our first U.K. restaurant opening.\n\nOnly one year later, we have over 20 restaurants in the U.K., eight of which are company-operated. Sales in our company-operated U.K. restaurants held steady quarter over quarter despite macroeconomic headwinds that continue to weigh on the overall market. Even in the face of these industrywide pressures, our development plans are on track, and the long-term opportunity in the region remains fast.\n\nWe now have six traditional franchisees approved in the region who we expect will begin opening restaurants in early 2023. In the U.S., our strong and balanced marketing calendar, alongside the benefit of our strategic price increases, drove our outperformance versus the competition and delivered our 12th consecutive quarter of gaining or maintaining dollar share within the QSR burger category. The relaunch of our fan favorite $5 Biggie Bag delivered a compelling value meal that offers a trade-up option from our other value platforms. We also paired the return of our Summer Salad with a new twist on one of our most iconic products.\n\nStrawberry Frosty was an instant runaway success that drove year-over-year customer count growth as we exited the quarter. We believe our U.S. marketing calendar sets us up to continue delivering strong results in the back half of the year with the craveable innovation only Wendy's can deliver, the return of an old favorite in our ownable and compelling value platforms. We also recently completed a pilot with a third-party pricing specialist and plan to partner with them to support our U.S.\n\nsystem in making strategic pricing decisions backed by rigorous data and analytics. We expect this partnership will drive sales and profit growth while protecting value perception. We believe that our momentum and the strong plans we have in place make us uniquely positioned to compete in this environment and in the QSR category. Now, let's turn to our breakfast business.\n\nWe are thrilled by the customer and franchisee excitement around our breakfast launch in Canada. The daypart met our expectations for the quarter despite overall category pressures and increased competition. We are confident that the addition of this daypart will drive Canadian franchise profitability to new heights. Turning to the U.S.\n\nWe are pleased with our breakfast performance in the context of the overall category, which continued to contract in the second quarter. We were able to maintain breakfast sales volumes versus the prior year and grow morning meal traffic share in the QSR burger category. Our performance was driven by another run of our successful buck biscuit promotion and awareness messaging throughout the quarter. Our sales volumes continue to reach well above our breakeven mark of just over $2,000 per week, driving profit for the company and our franchisees.\n\nWe continue to expect year over year U.S. breakfast sales growth of approximately 10% in 2022 and to reach average weekly sales of $3,000 by year-end. This growth will be supported by the launch of our new French Toast Sticks this month, which we expect to drive incremental visits and add-ons. We will also continue to lean into profitable promotions throughout the back half of the year.\n\nWe know there's a ton of upside ahead of us this year and over the long term, as we look to capture our fair share of the massive QSR breakfast business and we remain committed our $16 million global investment in breakfast advertising this year. Our Global digital sales accelerated versus the first quarter, with Global digital sales mix holding strong at approximately 10%. Our International digital sales mix was approximately 15% as we continue to achieve outstanding results across many of our markets, including Canada, which is seeing strong digital usage at breakfast, and our U.K. restaurants, which reached digital mix of over 70%.\n\nIn the U.S., digital made up just over 9% of our overall sales and accelerated approximately 2.5% versus the prior quarter. This growth was driven by an uptick in mobile orders as we grew our total loyalty members and monthly active users by over 5% versus the first quarter, exiting the second quarter at record highs. We expect our focus on refining our one-to-one marketing capabilities, expanding delivery and mobile order or access and efficiency and fine-tuning our user experience will continue to grow our digital business across the globe. We continue to make progress against our Global unit expansion in the second quarter, now opening 140 new restaurants and reaching a key milestone of 75% Global image activation.\n\nClearly, our franchisees are all-in on investing in the Wendy's brand, and I couldn't be prouder of the team for once again delivering growth in what continues to be a challenging environment. As the second quarter progressed, we reevaluated our REEF development commitment. We now anticipate that REEF will open approximately 100 to 150 Wendy's delivery kitchen locations by the end of 2025, with the majority operating internationally in Canada and the U.K., where sales volumes have continued to meet our expectations. This reduction in our anticipated REEF development is due to a change in REEF's growth strategy, which includes a shift to operating multiple brands from its locations and some recent challenges with opening Wendy's delivery kitchens in certain locations.\n\nIn the U.S., we will continue to test and learn with REEF, with a focus on densely populated, high potential markets. We remain committed to expanding access to our great brand and will continue to be a leader in innovative, nontraditional concepts alongside many franchisees across the globe. Primarily due to this change, we now anticipate 2022 net unit growth of approximately 3% to 4% and expect to reach 8,000 to 8,500 Global restaurants by year-end 2025. This continues to represent a significant step-up versus our historical unit growth performance, and we have made even further progress in solidifying our near- and long-term growth plans.\n\nThrough the end of July, we had over 70% of our 2022 new unit growth open or under construction. We now have well over 200 potential franchise candidates in our pipeline. And we expect our own year opportunity campaign to attract additional interest. This recruiting focus is already paying off as we expect an approximately 10% increase in our Global franchisee count in 2022.\n\nFinally, we recently unveiled a new Global restaurant design that we expect to improve operating efficiency and seamlessly integrate digital access while lowering build costs by almost 10% to improve overall returns. This new design is truly cutting-edge and will focus on optimized layouts that deliver convenience, speed and accuracy for our crew and our customers across all order and fulfillment channels. All these growth initiatives, alongside our strong underlying performance, make us confident in our accelerated unit growth in 2022 and beyond. Our playbook of investing to drive accelerated growth behind our three long-term pillars, to build our breakfast daypart, drive our digital business and expand our footprint across the globe, remains the same.\n\nOur continued growth and success would not be possible without the partnership we have with our franchisees, who we believe are the best in the business. The entire Wendy system is laser-focused on driving the restaurant economic model, which is highlighted by our ability to deliver strong results year after year. I will now hand things over to GP to share a record-setting 2021 and franchise financial results.\n\nGunther Plosch -- Chief Financial Officer\n\nThanks, Todd. We recently finished collecting our U.S. and Canadian franchise financials for 2021 and the breakthrough performance we saw as a company was also experienced by our franchise system. Over the last two years, our U.S.\n\nand Canadian franchisees have set sales and profit records, achieving remarkable acceleration versus pre-COVID results, even in the face of an extremely volatile environment. In 2021, our franchisees achieved high single-digit one-year sales growth which levered up to approximately 10% on a two-year basis. Sales results were positively impacted by strong average check supported by pricing and elevated mix alongside gains in our digital business and our U.S. breakfast business.\n\nThis momentum led to outstanding two-year EBITDA dollar growth of approximately 20% in the U.S. and over 30% in Canada. Additionally, our franchise system has very healthy balance sheets as their lease-adjusted leverage ratios remain below 2019 levels. This firm financial foundation gives us confidence in our ability to weather the headwinds facing the industry today.\n\nThese results support a strong partnership with our franchise system that allows us to focus on great execution aligned together behind our strategic growth initiatives. Now, turning to our second quarter financials. Our second quarter results highlight the strength of our financial formula, as we achieved significant quarter-over-quarter acceleration in two-year global same-restaurant sales and company-operated restaurant margin. Our Global systemwide sales grew 5.6%, supported by strong Global same-restaurant sales growth across both our U.S.\n\nand International segments and continued net unit growth. Despite a sequential increase in commodity pressure, company restaurant margin expanded by almost 300 basis points versus the prior quarter, driven by our pricing actions and strong marketing calendar. In the U.S., this has resulted in quarter two restaurant margin approaching pre-COVID levels in the face of significant macro headwinds. The year-over-year company restaurant margin decrease was driven primarily by commodity and labor inflation of over 19% and almost 12%, respectively, customer count declines and the impact of investments to support our entry into the U.K.\n\nmarket. These decreases were partially offset by the benefit of a higher average check driven by cumulative pricing of approximately 8%. The decrease in G&A was primarily driven by a lower compensation accrual as a result of our overdelivery versus plan in the prior year. This was partially offset by higher salaries and benefits as a result of investment in resources to support our development and digital organizations, technology costs primarily related to our ERP implementation and increased travel expenses.\n\nAdjusted EBITDA increased to approximately $133 million, primarily driven by higher franchise royalty revenue and lower G&A expense. These increases were partially offset by a decrease in company-operated restaurant margin. The decrease in adjusted earnings per share was driven by higher tax rate and high interest expense as a result of our debt rate transaction in the first quarter of 2022. This was partially offset by an increase in adjusted EBITDA and [Inaudible] shares outstanding from our share repurchase program.\n\nThe decrease in free cash flow resulted primarily from an increase in payments for incentive compensation for the 2021 fiscal year paid in 2022, the timing of receipt of franchisee rental payments, cash pays for cloud computing arrangements primarily related to the company's ERP implementation and an increase in capital expenditures. Let's turn to our outlook for 2022. We are entering the back half of the year with a great deal of momentum and believe we have the plans in place to achieve our 2022 financial outlook, which remains largely unchanged. We continue to expect strong Global systemwide sales growth of 6% to 8%, with approximately two thirds driven by same-restaurant sales and the remainder driven by our 3% to 4% unit growth.\n\nTo achieve this growth, we expect a significant step-up in one-year same-restaurant sales in the back half of the year, and our results through July are accelerating as planned. Our adjusted EBITDA outlook of $490 million to $505 million remains unchanged. The impact of the reduction of unit growth expectation is entirely offset by the expected increase in same restaurant sales and higher other income as the result of favorable lease updates. We continue to expect company-operated restaurant margin of 14.5% to 15.5% in for the full year.\n\nThis is supported by the expected acceleration in same-restaurant sales, which is inclusive of an additional pricing action of approximately 2% in the third quarter, and easing inflationary pressures, which we expect to drive significant margin expansion in the back half of the year. We are increasing our outlook for adjusted EPS to $0.84 to $0.88, driven by higher expected interest income earned on our increased cash balance. At the end of the second quarter, we had a cash balance of over $700 million, which provides us with flexibility to manage through headwinds in the broader environment. Finally, we are reaffirming our capex outlook of $90 million to $100 million and free cash flow of $215 million to $225 million.\n\nTo close, I would like to highlight our capital allocation policy, which remains unchanged. Our first priority remains the investing in profitable growth and we are continuing to showcase this. Today, we announced a declaration of our third quarter dividend of $0.125 per share, which aligns with our capital allocation policy to sustain an attractive dividend payout ratio of more than 50%. Lastly, our capital allocation policy gives us the flexibility to utilize excess cash to repurchase shares and reduce debt.\n\nWe repurchased 2.8 million shares in the second quarter and have approximately $198 million remaining of our $250 million share repurchase authorization that expires in February of 2023. We are fully committed to continue delivering our simple, yet powerful formula. We are an accelerated, efficient growth company that is investing in all strategic pillars and driving strong systemwide sales growth on the backdrop of positive same-restaurant sales and expanding our global footprint, which is translating into significant free cash flows. With that, I will hand things back over to Kelsey to walk through our upcoming IR calendar.\n\nKelsey Freed -- Director, Investor Relations\n\nThanks, GP. To start things off, we have two NDRs next week. The first will be held virtually on August 16 with Citi focused on the New York market, and the second will be held in Boston with Credit Suisse on August 17. We'll be back in New York on September 8 for the Goldman Sachs conference.\n\nAfter that, we will have a virtual headquarter visit with RBC on September 15, followed by an investor call on September 22 with Truist. Our final event in the quarter will be an NDR with Stifel on September 29 in Toronto. If you are interested in joining us at any of these events, please contact the respective sell-side analyst or equity sales contact at the host firm. Lastly, we plan to report our third quarter earnings and host a conference call that same day on November 9.\n\nAs we transition into our Q&A section, please note that we have no further comment on Trian Partners' amended 13D filing and would refer you to the statement made in our May 24 press release. Please keep any questions focused on our quarterly results. Due to the high number of covering analysts, we will be limiting everyone to one question only. With that, we are ready to take your questions.\n\nOperator\n\nThank you. [Operator instructions] And our first question today comes from John Glass of Morgan Stanley. John, please go ahead. Your line is open.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThanks. Good morning to everyone. My question, GP, is just around the comp guidance for the back half of the year would assume that you'd essentially double the comp growth rate. Is this -- one, can you just talk about kind of where [Inaudible] to give that context.\n\nAnd can you maybe just sort of throw through kind of the dynamics between the International which has been very strong versus the U.S.? How do you sort of see those two interplaying to get to the 4% to 6% comp, if you will, guiding -- 4% to 5% comp that you're guiding to imply the 6% to 8% system sales, please?\n\nGunther Plosch -- Chief Financial Officer\n\nJohn, you're right, it's actually unchanged. Like we have always said, that in the second half of the year, we're expecting elevated one-year SRS number. We basically have reconfirmed this in our prepared remarks. Why are we confident about this? We were confident about it, first of all, because we have seen that track record now in July.\n\nWe're expecting a step-up in the one-year SRS number for year to go. We have seen that in July. We have shared also in the prepared remarks we have new innovation out on breakfast with a strong marketing program in place for the U.S. So the combination of these two and, obviously, the pricing actions that we have taken and the additional pricing action we are going to take in the third quarter are all reasons why the one-year SRS number is stepping up.\n\nOperator\n\nThank you.  And our next question comes from Lauren Silberman of Credit Suisse. Lauren, please go ahead. Your line is open.\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nThanks so much. I wanted to ask about breakfast, what you're seeing with the breakfast daypart across the industry. And as you build to 3,000 in average weekly sales by the end of the year, what are the most meaningful initiatives to drive that growth this year? And does the current environment change how you're thinking about making investments in the daypart in '23?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes, Lauren, as you look at the breakfast daypart, we do see that the category in traditional QSR burger has softened a little bit, but we're very pleased with our performance within the category. We continue to gain share, which is important to create loyalists to continue to drive our business into the future. And we did see in our business a nice step-up. So in the first quarter, we were running about a little over $2,500 per week per restaurant.\n\nIn the second quarter, that jumped up to north of $2,700. So the trend is our friend despite some of the category dynamics. You're seeing a few more folks either work from home or have the food at the house and then grab the drink on the way to the restaurant or on the way to the office. All that said, we're seeing some nice acceleration in our business.\n\nWe continue to grab share and that's part of making sure we got loyalists that will drive frequency into the future. As far as our investment posture, as we said in the prepared remarks, still committed to the $16 million of spend across U.S. and Canada in 2022. We'll continue to support the Canadian breakfast launch in 2023, but we don't think we need additional support as we talked about in the past in the U.S.\n\nbusiness into 2023.\n\nOperator\n\nThank you. And our next question goes to Dennis Geiger of UBS. Dennis, please go ahead. Your line is open.\n\nDennis Geiger -- UBS -- Analyst\n\nGreat. Thank you very much. Wondering if you could talk a little bit about, GP or Todd, at the back half comp acceleration. And then, I guess maybe just starting from kind of what you're seeing in recent months, in this past quarter and then into July, I know you talked about the acceleration through the quarter on a global basis.\n\nPresumably, that was in the U.S. as well. But just curious as it relates to the low-income consumer or any kind of macro headwinds that might be impacting the business. And then, just again, the offsets to that.\n\nI know you talked about kind of compelling value coming in the back half. But just kind of maybe matching up some of the macro headwinds, if you're seeing any. And then, again, kind of the offsets, the levers there and thinking about your value platform and how you remain resilient?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes. A few thoughts and a little bit of this will be redundant some of the thoughts that GP had. But as you think about this quarter, this was our third consecutive quarter of accelerating two-year on the same-restaurant sales growth. And what we're really pleased is we've now grew or held QSR burger category dollar share for 12 consecutive quarters.\n\nSo we've got a lot of momentum overall in our business. And importantly, we held overall total QSR dollar share within the second quarter. What really given us the confidence has been the sequential global same-restaurant sales acceleration that we saw each month in Q2. And as GP just pointed out, we exited June really strong, had a lot of momentum with $5 Biggie Bag, had a lot of momentum with the launch of the Summer Strawberry with the Strawberry Frosty and the Summer Strawberry Salad, and that momentum continued into July to start the third quarter.\n\nSo we're starting from a position of strength. We continue to see strong check growth. It has been offset a little bit by a decline in customer counts in Q2. And we have seen a little bit of a decrease in mix driven by a reduction in items per transaction.\n\nThat's really due to a decrease in party size and fewer attachments along the way. But when you look at our year-to-go calendar, we said this in the prepared remarks, we've got some really good innovation. We've got a return of an old favorite. We've got French Toast Sticks in the breakfast daypart.\n\nWe've got more to come later in the year. Our dining rooms continue to have more customers come in to sit in them, which is always good for check. We're now at about a 21% dining room mix. And we do expect a double-digit two-year same-restaurant sales comp each quarter this year.\n\nIn the spirit of the state of the consumer, value will continue to be important, but we're really well positioned with a robust and ownable value menu. The work that we've done on $5 Biggie Bag, the trade-up that we're seeing from four for $4, we're not seeing trade down on our menu per se. So we're really seeing our premium and value hanging there quite nicely. And importantly, we held our traffic share with the under 75,000 consumer in the second quarter.\n\nSo our high-low strategy, compelling value, news on the high end has really allowed us to bring that consumer in and stay with us. The piece that we're all watching is we've seen some declines in frequency in the category. But beyond that, we're really confident that we got a lot of loyalty to our brand. And when the consumer gets healthier, we'll drive the business hard going forward.\n\nGunther Plosch -- Chief Financial Officer\n\nYes. So, it was a long answer. The only thing I want to reiterate again is pricing, right? We are -- pricing is another tailwind in the second quarter, as we said. We will price around 2% again in the third quarter.\n\nSo all of that, the cumulative pricing actions we have taken, is another reason why SRS in the second half is going to step up. The flow-through on pricing is good. We are seeing around 80% flow-through. So we're losing a little bit of traffic on the pricing action but net, obviously, a really positive lift to our SRS numbers.\n\nOperator\n\nThank you. And the next question goes to Brian Bittner of Oppenheimer & Co. Brian, please go ahead. Your line is open.\n\nBrian Bittner -- Oppenheimer and Company -- Analyst\n\nThanks. Good morning. I just want to switch gears to the unit growth. You clearly talked about lowering your expectations for REEF, which is impacting your original unit targets.\n\nIn the 10-Q, it states that your new goal for systemwide restaurants is 8,000 to 8,500 by 2025, so 500 lower than previously, which makes a lot of sense. But could some of this reduction as we move forward potentially be offset by stronger international growth than maybe you originally were embedding because we're seeing just such strong comps internationally, you're clearly bullish on the U.K. based on your comments on this call. So I'm just curious if you can maybe talk about where the International growth could go as we look toward 2025 and maybe if it represents potential upside?\n\nTodd Penegor -- President and Chief Executive Officer\n\nSo fair comment. So the real call down that we had in our long-term development outlook was the change in direction in REEF. And it was a big change, and REEF really wanted to shift operating multiple brands from its locations, and they've had some recent challenges with opening some delivery kitchens in certain locations with what it takes to work through the permitting in those markets. So we thought it prudent to call down that number.\n\nWe did not want multiple brands out of our kitchens. We want to dedicate it to Wendy's so we'll be slow and steady. We still think there's a great urban opportunity to continue to provide access to our brand with some kind of concept in those markets. So that's what the call down was with the news that we had today around REEF.\n\nBut on the International front, we do have a ton of momentum. You look at our widespread growth across the globe, you look at the momentum that we have, bringing on franchisees to build alongside of us in the U.K., the opportunity to then move over into Ireland, we're looking at Spain as our next market to get into, we've got momentum in markets like Mexico, we've got momentum in markets like the Philippines. We do think that there's a lot of growth opportunities across the board there. And delivery kitchens in India.\n\nSo that could be an offset over time. It's just going to save some time to work that plan to have the confidence that we can put that commitment out there.\n\nBrian Bittner -- Oppenheimer and Company -- Analyst\n\nThanks.\n\nOperator\n\nThank you. And the next question goes to Jeffrey Bernstein of Barclays. Jeffrey, please go ahead. Your line is open.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nGreat. Thank you very much. I just wanted to ask about the inflation and response, I guess, pricing outlook. From an inflation standpoint, I think you said commodities in the second quarter were up 19% and labor up 12%.\n\nSo I'm just wondering your thoughts. We've heard from others that maybe commodity inflation is peaking on one end to year basis and that labor challenges are easing. So just trying to get your perspective on those in the back half and whether you think the incremental pricing is enough to fully offset that. It seems like you were running 8%.\n\nIn the second quarter, you're taking another 2%. I'm not sure if it's as easy as that's running 10% or what you're lapping. But any color you can provide on the pricing and whether there's any concern of pricing out that lower income consumer in that effort to offset that inflation?\n\nGunther Plosch -- Chief Financial Officer\n\nJeff, yes, so you are right. Commodity inflation in the second quarter was about 19% and our labor inflation was about 12%. We're definitely expecting that numbers are peaking, right? So on a year-to-date basis, our commodity inflation is about, again, 19% and our labor inflation is also above double digits. Our guidance for the year on commodities is about at 15% commodity inflation.\n\nSo basically, if you do the math on it, you're going to find that our commodity is going to step down. So we are basically anticipating that that's going to happen. Why are we confident with this? We have about 90%, nine-zero, of our commodities now locked down. Could there be a little bit of volatility? Yes, but again, 90% confirmed.\n\nThat's why we think the additional 2% pricing action we are taking in the third quarter will be sufficient and appropriate to get into -- to make sure we are reaching our margin guidance for the year.\n\nOperator\n\nThank you. And the next question goes to Jared Garber of Goldman Sachs. Jared, please go ahead. Your line is open.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nGreat. Thank you for the question. I actually just wanted to follow up on Jeff's question. So if we think about the incremental 2% flowing through in the back half of the year, does that get you to 10% pricing? Or is there a dynamic where something is rolling off that we should be thinking about? And then, following that, just kind of want to understand how you thought through the pricing cadence here with all the pressure on the consumer and some other of your peers calling out some lower income consumer pressure in their results and admittedly continued inflation on the consumer wallet with declining traffic seeming in the Wendy's business.\n\nI just want to understand the dynamics underlying the pricing actions.\n\nGunther Plosch -- Chief Financial Officer\n\nJared, there was a lot of questions in one question. Hopefully, I answer them all. So from a mechanical point of view, the pricing with roll-offs that are happening is slightly below 10%. So that's the answer on that one.\n\nYou cannot just add 2% to the 8%, it's slightly below that. Again, we constantly are watching our pricing action. We are not seeing any pushback from consumers. So it's evidence at the highest levels on the progress we are making in the marketplace, holding or gaining market share.\n\nYou have seen also that Todd's remarks as we held traffic share for the income consumer that's earning less than $75,000. So these are all positive indicators. Commodity inflation versus the previous guidance went ever so slightly up. So in order to be really on the safe side, to make sure our restaurant economic model stays intact, we decided to move up one additional price increase here in the third quarter to again make sure the restaurant economic model is protected.\n\nAnd as I said, we are not seeing evidence of a pushback from consumers on our price increases.\n\nTodd Penegor -- President and Chief Executive Officer\n\nJared, one other comment. I think that that gives us confidence, as we talked about the sequential sales momentum in the second quarter into the third quarter. We're also seeing the traffic momentum behind that. So when you think about the construct of our calendar with four for $4 and $5 Biggie Bag and some news on the top end, some great news around things like Strawberry Frosty and French Fries as attachments, those give us confidence that we have a menu construct that can connect to that consumer and we can continue to build on that momentum.\n\nAnd we also are seeing an improving labor market. So we do continue to see staffing improve. We see 90-day turnover levels improving. We see turnover rates coming down.\n\nAll of those things will allow us to drive more throughput as we're focused on speed in our restaurants to make sure that we can serve more customers in this environment to continue to drive more traffic from an operational expectation experience with better service times at the restaurant.\n\nOperator\n\nThank you. And our next question goes to Andrew Charles of Cowen. Andrew, please go ahead. Your line is open.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nGreat. Thanks. Todd, what is needed to execute on targets for 10% breakfast growth and get to that $3,000 in AWS by year-end and really critically drive the habit that is needed here in what you're calling to be a challenged daypart. And PG, just a quick follow-up.\n\nI know you guys called out AWS increased from $2,500 in 1Q to around $2,700 in 2Q. But isn't that part of that just seasonality? My math suggests that both imply about 7% of sales in both quarters so far this year.\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes. So on the breakfast side, we've already got some of that nice momentum. So you think about the step-up from the first quarter of a little over $2,500 per week to a little over north of $2,700, we're well on our way already toward that $3,000 by year-end, clearly bringing news to the category. As you think about French Toast Sticks launch, having a suite savory offering, I think that's going to be a great add-on.\n\nWe also think that actually brings in more family and kid, which we haven't had to date. So that news helps us continue to bring folks in. And then, our operational focus is on speed, how do we continue to drive speed and get you through fast in the morning on that breakfast daypart, how do we get folks into digital so you can actually enhance your speed with digital, how do you actually take advantage of trial through some of the offers that we have in mobile. All of those things give us a lot of confidence that we can continue to build the momentum in the breakfast daypart, break through the clutter.\n\nWe've got our system all in. We still only have five restaurants that have actually opted out based on their trade area, and that's only on a temporary basis. So the systems all in, well above that breakeven mark of $2,000 per week. So we'll continue to lean in.\n\nWe've got the investment that we have on that $11 million incremental that we'll continue to support on top of the contributions from the system. So we feel good that all the tools are there to continue to break through in a more challenged environment at the moment, but a category that will have a lot of upside over the long term.\n\nOperator\n\nThank you. And the next question goes to Chris O'Cull of Stifel. Chris, please go ahead. Your line is open.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nThanks. Good morning, guys. Todd, you mentioned breakfast sales in the industry have contracted and you're taking share, but the industry leader indicated sales had increased in that daypart. So where do you believe you're taking share? And I missed some of the initiatives planned for the second half of the year, but is the price point value expected to play a greater role in growing the breakfast daypart?\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes, Chris, a couple of things. Yes, price point value will play a role. I think we've got some good promoted activity that we'll have on the breakfast daypart that not only drives trial but also drive some nice check in profit. So you will see that sprinkled in, in the back half on top of all the other news that I just talked about.\n\nIf you look at the category, you're seeing more folks consume their food at home and grab the drink on the way. So you're seeing folks grab a C-store beverage or seeing folks go to the traditional coffee houses. A lot of the function of the share growth is when you look at some of the year-on-year comparisons. And there's still a little bit of noise out there in the comparisons.\n\nSo you have seen the overall QSR burger category and breakfast soften. We actually held our growth year-on-year. Others may have started from a little lower base the year before and grow based on their comments. But we feel good with the momentum that we have relative to the industry context that we're competing in at the moment.\n\nOperator\n\nThank you. And the next question goes to Eric Gonzalez of KeyBanc. Eric, please go ahead. Your line is open.\n\nEric Gonzalez -- KeyBanc Capital Markets -- Analyst\n\nHey, thanks for the question. Just regarding to month-to-month comp trends, it seemed like the industry maybe didn't see the same directional progress that you saw in the second quarter. So could you just confirm the industry did flow through the quarter implies [Inaudible] share being decelerated. And on that point, did you see an impact from abnormal seasonality? Some of your peers cited heightened summer travel as a headwind that might roll off in the fall.\n\nSo just wondering if you experienced any of that.\n\nTodd Penegor -- President and Chief Executive Officer\n\nI think the question just is around where is the industry. If you think about QSR burger, we've continued to see really nice sales growth. But traffic has been down year over year within the QSR total industry and within QSR burger. But the trends have been improving as of recent across the category on traffic.\n\nAs you get into some of the seasonality, some of those could play into our favor. You get into back to routine with back-to-school and folks are out and about, that should certainly help on our breakfast business, a lot more folks out traveling. So I think there would be more benefit to some of the seasonality as folks get back into routines later in the year that could potentially help support our accelerated same-restaurant sales growth rate on a one-year basis.\n\nOperator\n\nThank you. And our next question goes to Peter Saleh of BTIG. Peter, please go ahead. Your line is open.\n\nPeter Saleh -- BTIG -- Analyst\n\nGreat. Thank you. I want to come back to the conversation on the unit growth and REEF partnership. Can you just talk about the performance of the REEF units that you currently have? And given the strategic shift over at REEF, are you still committed to just using REEF? Or are you looking at other partners to help expand your unit growth? I mean, is it possible that you come back to us in a couple of quarters with another partner that reaccelerates this development strategy?\n\nGunther Plosch -- Chief Financial Officer\n\nPeter, great question. So from a performance point of view, a couple of data points in the U.K. and in Canada. The AUVs are tracking between $0.5 million and $1 million, so very consistent with the performance ranges that we have previously communicated.\n\nIn the U.S., we are not yet performing, right? We are around $0.5 million and less. It's one of the reasons why there is this shift on strategy to go multi-brand in a vessel which we are simply not comfortable with. And so, as a result of that, we are working with REEF to make this work. As Todd said, we are trying to reposition these vessels into better trade areas.\n\nWe're on a single brand on the vessel, we can achieve similar AUV trends as we are seeing in the U.K. and in Canada. So that's kind of the perspective that I have on REEF.\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes. And I think that the opportunity still is large in urban locations. So whether that's cracking the code with REEF, finding another partner, thinking about other ways to traditionally grow into some of those markets, that will continue to be our focus moving forward. But as GP said, with those relocations, as you think about our closure outlook for the year, it will be a little more elevated.\n\nWe're probably in that 140 restaurant closure area this year. 35 to 40 of those will be REEF's, a lots of those are relocations during the course of the year. So a closure and a new opening to get to about 75 REEF's by the end of the year. And as I said a little bit earlier, we've got a few closures that had happened earlier this year in Mexico and in Indonesia post COVID that have us a little more elevated than in the past, but we still have a really healthy, less than 100 kind of run rate on closures and about 20% to 25% of that is always relocations, excluding the REEF comments.\n\nSo we feel good that we got a healthy mix of opening and closures for the long run.\n\nGunther Plosch -- Chief Financial Officer\n\nSmall correction on Todd's comment. At the end of the second quarter, we had about 70 REEF units. We expect by the end of the year about 65 REEF units. So we have actually, in the second half, more closures than openings.\n\nThat's probably -- yes, I just wanted to clear that.\n\nOperator\n\nThank you. And the next question comes from Brian Mullan of Deutsche Bank. Brian, please go ahead. Your line is open.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nThank you. Just a question on development. I was hoping you could share your current thinking on a potential expansion into other markets in Western Europe. Would you need to build restaurants on balance sheet in new countries? And are you -- would you be willing to do that in the right cases? Or do you think you can get this done entirely with franchisees? What would your degree of confidence be there? Just any thoughts on what this could look like over the next couple of years.\n\nTodd Penegor -- President and Chief Executive Officer\n\nYes, we got a lot of confidence. We don't think we have to do it on our balance sheet. Our balance sheet is really focused on leading the way in the U.K., as we've talked about previously. We've already got a couple of franchisees approved that will be opening restaurants early next year alongside us in the U.K.\n\nAnd then, we got another handful beyond that that have been approved that will start opening restaurants in the U.K. a little bit further down the road. We've got a lot of interest to then move over into the -- into Ireland, really leveraging the expertise operationally that we have with company restaurants in the U.K., the supply chain that we're putting in place. And we got a lot of interest in moving into the continent, as you mentioned.\n\nAnd our first opportunity there will be Spain and we're working with candidates at the moment.\n\nGunther Plosch -- Chief Financial Officer\n\nYes. And as we are having this contact in Ireland and in Spain for us to have the opportunity to host them in England with our company operations there, that's actually sufficient. So they have -- they can touch a restaurant, it's an hour flight. And so, with all of these dynamics we have, we don't see at all that we need to deploy our balance sheet to build company restaurants outside of the U.K.\n\nOperator\n\nThank you. And the next question goes to Andrew Strelzik of BMO Capital Markets. Andrew, please go ahead. Your line is open.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nGreat. Thanks for taking the question. I'd love to hear a little bit more about the new prototype that you mentioned, the new store prototype and how that plays into that lower kind of 2025 unit count target. Is there anything that you could share on the cost of return profile and franchisee feedback as well would be great?\n\nGunther Plosch -- Chief Financial Officer\n\nAndrew. Yes, franchisees are super excited about this. We have a prototype on this down the road. I personally actually walked it.\n\nIt is a very different design. What it does is it actually now has -- finally we're embracing digital in our design. It has a dedicated delivery pickup window. The kitchen is reconfigured.\n\nSo literally, you have to do way less steps to get all your tasks done. So that drives also operating efficiencies. And we are also embracing whole mobile orders with all shelfing and dedicated shelfing units and dedicated parking so that the friction for the consumer is much more reduced and the friction for the crews is much more reduced, and with the design, which is as far as I can tell, state-of-the-art here, we were able then to reduce our investment cost by 10%. And as a result of it, obviously, the returns have improved as well.\n\nTodd Penegor -- President and Chief Executive Officer\n\nLots of input from franchisees across the globe to get to that design. So a lot of buy-in and ownership already. So we do think it will be a super efficient, cost-effective restaurant. And we'll have our first restaurant open in early next year in the Columbus market.\n\nSo we'll be able to showcase that.\n\nOperator\n\nThank you. And the next question goes to John Ivankoe of J.P. Morgan. John, please go ahead.\n\nYour line is open.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. You know, your balance sheet really sticks out for $700 million of cash, I mean, relative to $2.8 billion of long-term debt, which I don't think you have, a principal due for some number of years. $52 million of stock bought back in the second quarter, none in the third.\n\nI mean, I guess, what kind of signaling are you doing with that cash? I mean, there's conservatism and then there's $700 million of cash. I mean, if you could just walk us through, I guess, how you're thinking about capital priorities and maybe how you can make that balance sheet work a little bit harder for you in some way, if that's something that you're considering over the next six to 18 months.\n\nGunther Plosch -- Chief Financial Officer\n\nYes, John, good question. You're right. We are keeping an elevated cash balances. We have declared our dividend that is very competitive.\n\nIt's in line with our capital allocation policy. On share repurchases where, as you rightfully pointed out, we have not been in the market and we are not announcing any specific share repurchase plans for the time being is the only comment I want to make at that point in time.\n\nOperator\n\nThank you. And the next question goes to Jon Tower of Citi. Jon, please go ahead. Your line is open.\n\nJon Tower -- Citi -- Analyst\n\nGreat. Thanks for taking the question. Quick clarification and a question. The clarification on the breakevens on breakfast that's $2,000 a week in average weekly sales, is that for a fully open dining room or just the drive-through? That's the clarification.\n\nAnother question. It seems like the innovation on the core, like the Strawberry Frosty, is really resonating quite well with customers. And I'm just curious how you're thinking about new products or perhaps back-half product news, balancing new product news versus, say, innovation around the core. I know, for example, there's been some press recently related to the pretzel bun making its way back onto the menu.\n\nIs -- how do you balance the new product, like truly new products, versus innovation on the core?\n\nTodd Penegor -- President and Chief Executive Officer\n\nThe clarification question. So the breakeven on breakfast of $2,000 is across all breakfast. So remember, our model is to open the restaurant at 6:30, dining rooms closed until nine, then we open up the dining group for the rest of the day. We've got some franchisees and based on trade area that might open a little bit earlier.\n\nBut on average, for that whole breakfast construct, it is $2,000 as the breakeven point. When you think about kind of the menu, there's nothing better than refreshing and innovating and bringing news to the iconic brands that we have. And when you think about something like a Strawberry Frosty really paired with the Summer Strawberry Salad, not only do we get to have food news, but we actually get the build on the equity that we have talking about Frosty and people know Wendy's for Frosty. So we will continue to make sure that we got a good balance between renovating, doing some great things on the core, bringing some new news, bringing back some fan favorites that we talked about and pace some sequence so it works operationally.\n\nAnd remember, we have made a great lineup that allows us to bring things in and have them work hard on the menu until the consumer gets tired before we bring something else out. So I think we've got a good cadence and a good balance.\n\nOperator\n\nThank you. And the next question goes to Gregory Francfort of Guggenheim Securities. Gregory, please go ahead. Your line is open.\n\nGregory Francfort -- Guggenheim Partners -- Analyst\n\nHey, thanks for the question. Todd, you talked about it a little bit earlier with just the category as a whole. But I mean, traffic's been negative for kind of most of quick-service burger and actually most of QSR the last couple of quarters. And I'm curious where you think that share is going.\n\nWhat dynamic do you think is playing out between QSR? And is it going to food at home or casual dining? I'm just curious your thoughts on that.\n\nTodd Penegor -- President and Chief Executive Officer\n\nThat's pretty simple. It's clearly food at home. I mean, if you think about pre pandemic, about 82% of all meals were consumed at home. During the pandemic, it jumped up to about 85%, and it's been fairly sticky at about that 85%.\n\nAnd I think it's sticky because the consumer has been a little more strapped, so there's a few more meals prepared at home, whether it's bringing your lunch to the office or having breakfast at home. My sense is over time, that will shift back as some of the near-term pressures ease on the consumer. Their overall wage rates have increased, but inflation has been high, so net disposable income has been a little bit pinched in some of the cohorts across the income ranges. But over time, that will shift and that consumer that will have more disposable income will be right in the wheelhouse of continuing to drive QSR and driving Wendy's business, which will drive traffic into the future.\n\nOperator\n\nThank you. And the next question goes to Nicole Miller of Piper Sandler. Nicole, please go ahead. Your line is open.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nThank you. Good morning. I want to come back to Canada. Just in this reporting period alone, I think you might be the fourth concept to mention strength there.\n\nIs that just an ongoing recovery because the market otherwise lagged? Or structurally, have some challengers fallen out and is there an ability to recalibrate your growth opportunities in Canada in terms of both comp and units? And I think the last number I found was like plus or minus 400 stores in Canada, if you could validate that.\n\nTodd Penegor -- President and Chief Executive Officer\n\nWe have just over 400 restaurants in Canada. And we've had a lot of momentum in Canada going back probably four years now. Our average AUVs Canadian dollars are now at CAD 2.5 million. Clearly, breakfast on plan with expectations in Canada and performing quite nicely, which has put another layer of growth on top of our business.\n\nBut we've gained a lot of share over the last four years in the market and are now the No. 3 concept in the QSR burger category in Canada. So there is overall strength in the category, but we're outperforming the category significantly, and that's creating a lot of momentum for us to not only have existing franchisees continue to build but to recruit a lot of new franchisees to build where we have a lot of open space across the market. So feeling good about the future of that business.\n\nGunther Plosch -- Chief Financial Officer\n\nAnd in the call, right, you've also heard this now from me on the franchise financial, it translated, right? Since COVID, the last 10 years, the Canadian sales are kind of up 10% and profits, really outsized growth, 30% growth that creates excitement within the Canadian franchise space and there's obviously a decent amount of interest to push development relatively hard. In Canada, new franchise candidates, and there is a lot of open and wide space in Canada that we can take over as the Wendy's brand.\n\nOperator\n\nThank you. And the next question goes to Rick Smith of Smith Capital. Rick, please go ahead. Your line is open.\n\nRick Smith -- Smith Capital Investments -- Analyst\n\nHey, good morning. I guess this is a bit of a clarification question. But we're halfway through the quarter, why no share repurchases yet? Thanks.\n\nGunther Plosch -- Chief Financial Officer\n\nGood morning, Rick. Yes, we are not doing any share repurchases. We have not announced anything. It has to do with the Trian process that we are going through.\n\nOperator\n\nThank you. And our next question comes from James Sanderson of Northcoast Research. James, please go ahead. Your line is open.\n\nJames Sanderson -- Northcoast Research -- Analyst\n\nHey, thanks for the question. Just wanted to go back to the U.K., to get a little bit more detail on trend there. I think the revenue reported in 10-Q relative to the number of stores in operation was down sequentially, but I think you mentioned steady. So I wanted to understand the FX dynamics.\n\nAnd if you could maybe comment on traffic trend, if the consumer is increasing frequency now that you've had a year in the market, how we should look at that?\n\nGunther Plosch -- Chief Financial Officer\n\nYes, we're definitely happy with the U.K. business, right? We have about 22 restaurants at the moment sitting there, eight company and the rest is franchise REEF units. The comment that we made on the call, that is steady progress versus the first quarter was FX-adjusted. So if you would do that, you would see that comparison.\n\nAnd I have to say, the U.K. consumer is clearly under a decent amount of pressure, right? There is very, very high inflation and that is definitely having an impact on the footfall that is happening in the U.K. Having said all of that, we are -- remain very bullish on the U.K. market.\n\nWe expect to have about 35 restaurants by the end of the year, 10 on the company side, so that development schedule is in place. And the remaining are going to be REEF units.\n\nTodd Penegor -- President and Chief Executive Officer\n\nI agree with all the GP's comments. The other one I'd just put out there is we're continuing to be in start-up mode in that market and opening new restaurants and having preopening costs. And you think about our overall margin construct, there was about a 50-point headwind on U.K. as we ramp up into that market.\n\nSo in the U.S., our margins are running at that 15% mark. But we're absolutely confident that the AUVs overall that we're seeing in both the REEF units and then the traditional units are in a good spot for the economic environment that we compete in with a lot of optimism and a lot of opportunity to grow into the future.\n\nOperator\n\nThank you. And our final question today comes from Jake Bartlett of Truist Securities. Jake, please go ahead. Your line is open.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nGreat. Thanks for taking the question. Mine is about the U.S. business and the momentum there, and this is looking back a little bit.\n\nBut when I look at the three-year comp in the U.S., my math is just 13.5% down from 14.7% in the first quarter. So a deceleration. Your two largest competitors accelerated on a three-year comp. Wendy's also has breakfast in that kind of 2Q three-year comp as well.\n\nSo if you could just maybe provide some context of why you decelerate if you look back that far. Any kind of -- anything particularly to the Wendy's brand that we should think about that maybe is not continuing going forward. And any driver to why that would have decelerated when we've seen general acceleration from competitors?\n\nGunther Plosch -- Chief Financial Officer\n\nYes, Jake, I need to look a little bit at the U.S. on a three-year comp basis. We didn't look at it on a global basis, the three years are accelerating, U.S. I think what's stripping us up is definitely the 53rd week shifting, you might remember that that is creating a shift between the first quarter and the second quarter.\n\nIf you actually adjust for that, you're actually going to find out that on a three-year comp basis, also the U.S. has accelerated. I'm sure when we have the call back a little bit later, we'll compare notes on those numbers.\n\nKelsey Freed -- Director, Investor Relations\n\nThanks, Jake. That was the last question of the call. Thanks to Todd and GP, and thank you, everyone, for participating this morning. We look forward to speaking with you again on our third quarter call in November.\n\nHave a great day. You may now disconnect.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKelsey Freed -- Director, Investor Relations\n\nTodd Penegor -- President and Chief Executive Officer\n\nGunther Plosch -- Chief Financial Officer\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nLauren Silberman -- Credit Suisse -- Analyst\n\nDennis Geiger -- UBS -- Analyst\n\nBrian Bittner -- Oppenheimer and Company -- Analyst\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nJared Garber -- Goldman Sachs -- Analyst\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nEric Gonzalez -- KeyBanc Capital Markets -- Analyst\n\nPeter Saleh -- BTIG -- Analyst\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nJon Tower -- Citi -- Analyst\n\nGregory Francfort -- Guggenheim Partners -- Analyst\n\nNicole Miller -- Piper Sandler -- Analyst\n\nRick Smith -- Smith Capital Investments -- Analyst\n\nJames Sanderson -- Northcoast Research -- Analyst\n\nJake Bartlett -- Truist Securities -- Analyst\n\nMore WEN analysis\n\nAll earnings call transcripts"
}