{
  "companyName": "Signet Jewelers",
  "companyTicker": "SIG",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/signet-jewelers-sig-q2-2023-earnings-call-transcri/",
  "content": "Signet Jewelers (SIG -0.07%)\nQ2 2023 Earnings Call\nSep 01, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Signet Jewelers fiscal 2023 second quarter earnings call. All participants will be in listen-only mode. [Operator instructions] Please note this event is being recorded. I'd like to turn the conference over to Vinnie Sinisi, senior vice president of investor relations.\n\nVinnie Sinisi -- Senior Vice President, Investor Relations and Treasury\n\nGood morning, and welcome to our second quarter earnings conference call. On the call today are Signet's CEO, Gina Drosos, and chief financial and strategy officer, Joan Hilson. During today's presentation, we'll make certain forward-looking statements. Any statements that are not historical facts are subject to a number of risks and uncertainties, and actual results may differ materially.\n\nWe urge you to read the risk factors, cautionary language, and other disclosure in our annual report on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K. Except as required by law, we undertake no obligation to revise or publicly update forward-looking statements in light of new information or future events. During the call, we will discuss certain non-GAAP financial measures. For further discussion of the non-GAAP financial measures as well as reconciliations of the non-GAAP measures to the most directly comparable GAAP measures, investors should review the news release we posted on our website at www.signetjewelers.com/investors.\n\nAnd with that, I'll turn the call over to Gina.\n\nGina Drosos -- Chief Executive Officer\n\nThank you, Vinnie, and thanks to all of you for joining us today. I want to begin by thanking our Signet team. Their passion for building lifetime relationships with our customers and fulfilling our purpose is central to everything we do. I continue to be inspired by their excellence and agility every day, no matter the conditions.\n\nIt's an honor to work at their side. Here are the key takeaways from my remarks today. We believe that Signet's growth strategy and the structural advantages we've created in our operating model enable us to do three things consistently. First, deliver an annual double-digit operating margin.\n\nSecond, invest to achieve market-share expansion. And third, create meaningful shareholder value. Q2 was yet another demonstration of these advantages. Our team delivered $1.8 billion in revenue and $193 million in non-GAAP operating income.\n\nRevenue was down 1.9% versus record setting second quarter sales last year, and up 29% versus the second quarter of our fiscal year 20, which was the pre-pandemic base. Importantly, we delivered operating income within our original guidance range, and our non-GAAP operating margin was strong at 11%, which is nearly 3 times higher than Signet's operating rate in fiscal year 20. So despite a softer top line environment, our structural transformation and the flexibility we now have in our operating model enabled us to leverage SG&A to deliver double-digit operating margin and maintain strategic investments and return capital to shareholders in Q2. Our strategy is working.\n\nWe are winning in our biggest businesses with our diversified portfolio of banners, expanding accessible luxury, accelerating services, and leading in digital. We're able to be strategically flexible, leaning further into the areas of our business with the most growth opportunities driving both customer and shareholder value. Before I get into our results, let me first share some jewelry category context. What we're seeing in our proprietary data is that consumers shopping at lower price points, primarily buying discretionary fashion items or with lower incomes, are being impacted most directly by macroeconomic pressures.\n\nWe believe lower jewelry price tiers are also seeing the most negative impact from deep discounting in apparel and other fashion and discretionary categories. So in general, jewelry price points below $500 are seeing a steep decline, with price points below $1,000 also being negatively impacted. Conversely, higher price point items are showing more strength, and this is reflected in the fastest jewelry growth being luxury price tiers, followed by accessible luxury. What's particularly interesting is that our proprietary customer research for Kay, Jared, and Zales is showing relative strength in what we call considered purchases.\n\nThat is fundamental items over $1,000 like engagement rings, anniversary bands and other sentimental gifts are outperforming their categories. Our strategies around consumer insights, banner differentiation, and tearing up into accessible luxury are allowing us to lean into these trends. So while Q2 was a mix of headwinds and tailwinds, we responded to these precisely as our company is now designed to do. We drove growth in bridal in our biggest banners, especially in the $4000 to $5000 price range where revenue increased 11% versus last year, and all banners grew 15% in aggregate for purchases in the $10,000 plus price range.\n\nWe grew services nearly 7%, which was a higher margin profile and drives traffic to our stores. We reduced core inventory, excluding Diamonds Direct almost 10% versus last year with more efficient, data-driven assortment and flexible fulfillment. This is enabling us to quickly respond to changes in consumer trends, maximize newness, and limit clearance. With that context, let's take a closer look at how we're doing across our four growth strategies, and why we believe we're building a moat of competitive advantage that will lead to long-term profitable share growth.\n\nWinning in our biggest businesses is our first wear-to-play strategy, and bridal is a big part of the story this quarter. We estimate that our bridal share is now approximately 30%. This is a real advantage driven by the high consumer awareness of our banners, our leadership, marketing spending, and personalized always-on-media approach. Our connected commerce presence, which is unrivaled in the jewelry category, ensures that we're uniquely able to meet our customers' needs whenever, wherever, and however they want to engage.\n\nRelevance plus readiness is a powerful combination, and it is precisely the combination we've built with our portfolio of highly differentiated banners, our optimized footprint of brick and mortar stores. And our expanding digital capabilities and experiences. As predicted, 2022 has become the year of the wedding, with 2.5 million weddings expected this year. In addition, with in-person events growing, we've seen an increase in pre-wedding and other wedding-related events, which are great opportunities for gifting.\n\nIn fact, our data suggest that jewelry represents 43% of the gifts shared at wedding-related celebrations, including gifts for the bridal party, mothers, and the couple themselves, making this a $1.9 billion opportunity in the U.S. Because Signet delights so many couples with engagement ring purchases, we're now focused on making the most of all wedding opportunities. We've made changes to our assortment, services, and marketing, and are creating new digital content, online shopping guides, and targeted media campaigns. All to serve our customers throughout their special events, and capture the entire value of the wedding.\n\nOur second where-to-play strategy is to expand the market we play in. And in this economic environment, we are both leaning into accessible luxury while also increasing our value equation for more economically challenged customers. To delight higher-income customers, we've added higher price point items to our assortments across banners. We've expanded concierge-level services like Girard Foundry, which offers customers the ability to design custom pieces from scratch.\n\nWith increased availability of personalized appointment bookings, particularly at tiers and Diamonds Direct. Diamonds Direct is proving to be the strong strategic acquisition we anticipated it would be, delivering $113 million in revenue this quarter, ahead of acquisition expectations. We believe we grew our share of accessible luxury in the quarter more than two points. We are also navigating the impact of inflation and economic pressure on value shoppers.\n\nTo maximize the value of their spend, we are leveraging our scale, our vertical integration capabilities, and our strategic vendor relationships to value engineered pieces that make jewelry more affordable for all our customers. A great example is how we are leveraging lab-created diamonds for a bigger look for less in our fashion pieces. We've also designed innovative new items using diamonds that are more plentiful and have a lower cost basis. Finally, we strengthened our financing offerings, including expanding our 0% down payment promotional financing.\n\nAccelerating services is our third way to play strategy and is delivering strong revenue growth. With first-half sales up nearly 12% versus a year ago, and Q2 up 7%. This performance was driven largely by growth and warranty attachment and repairs. Extended service agreements revenue was driven by a mix of our newer, more customer-appealing bundles, price increases, and higher attachment rates.\n\nRepair growth reflects increasing NPS scores driven by faster turnaround times, team training, and new digital tracking visibility. Further, in the second quarter, we launched several new services based on our consumer research. These included appraisal services at Kay, and the new insurance product at Jared, Kay, and Zales to protect cherished jewelry from theft and loss. We also launched Bridal by Rocksbox, a new premium rental service for brides at all their wedding events, ranging from bridal showers to bachelorette parties to their wedding day.\n\nWe believe this service will help us continue attracting younger and more diverse customers, as well as expand repeat purchases. The Rocksbox subscriber base increased 15% in Q2, illustrating the power of Signet's scale for a newly acquired banner. We continue to be very bullish about the expansion of our Vault Rewards Loyalty program, which is currently in Jared, Zales, and Kay. It's on pace to be rolled out in e-commerce and to more than 1800 Jared, Kay, and Zales stores by this holiday.\n\nThis continues to be a meaningful source of future growth, with transaction values among loyalty team members at Jared's, for example, nearly $600 higher, and repeat rates up 700 basis points versus non-loyalty members. We continue to see services as a billion-dollar business and are steadily making progress toward that goal. Importantly, service margins remain consistent and accretive. Our fourth quarter play strategy is leading in digital.\n\nDigital is our multiplier. It is the capability that creates the most advantage and is most difficult for competitors to match given the investments we've made. It's a multiplier because it makes browsing, shopping, and buying even easier and more fulfilling for our customers who are increasingly looking for an integrated, multi-channel experience, and that leverages our data and scale in powerful and targeted ways to drive conversion. Being the digital leader in jewelry means much more than leading in e-commerce.\n\nWe're leveraging our digital capability and technology to innovate in every part of our business. Now, with industry-leading speed. For example, we've added several new and easy ways for customers to book appointments, which is driving higher levels of customer engagement. In the second quarter, 65% more appointments were booked online versus a year ago.\n\nThis is important because the conversion rate of a merchandise appointment is 3 times greater than for a walk-in customer, and the average transaction value is 30% higher. And we've also expanded virtual try on for more of our key products, which increases conversion rates between three and sixfold. We saw a 22% increase in checkout start rates this quarter versus last year after launching our new mobile first mini bag shopping companion. This makes it easy for customers to see a glance views of their orders, apply discounts, total costs, and progress toward earning loyalty incentives.\n\nIn Q2, more than 20% of customers used one or more of our flexible fulfillment options, including ship to and from store, buy online pickup in-store, or same-day delivery. All of which improved both customer convenience and inventory efficiency. These offerings also drive traffic to stores so that our expert jewelry consultants can further build relationships. We are increasingly linking our digital and physical experiences.\n\nWe now have 28,000 e-tags tracking with diamonds at the store level. This proprietary e-tag ecosystem was developed at Signet. E-tags are innovative and valuable technology for many reasons. First, because our e-tags enable storytelling with a visible QR code, customers can easily access information about each diamond.\n\nSecond, by leveraging emotion sensors and sales data, e-tags give us the ability to dynamically adjust pricing or offer incentives to close a sale within seconds. We can now optimize inventory levels and maximize sales and margin on a nearly real-time basis. Nearly every [Inaudible] diamond at Jared will soon have an e-tag, and we are continuing to expand the technology across other products and banners. With the digital innovation of our proprietary e-tag system, we're essentially adding Internet of things technology to our connected commerce capabilities in a way that no other jewelry company is doing.\n\nWe invested in digital from the beginning of our path to brilliance transformation, and we're not letting up. Our recent acquisition of Blue Nile as a good example. Blue Nile is the pioneer in online diamond marketplace shopping, bringing a new customer cohort to our portfolio, younger, more fluent, and highly diverse. It has the highest brand recognition of any digital pure play jewelry retailer and expands the top end of our accessible luxury offerings.\n\nBlue Nile has unique shopping technology featured, and there are 23 showrooms through which customers are educated by a trained jewelry consultant, and are then able to complete their purchases online. We can learn from this low inventory showroom model. We see incredible synergy opportunities with Blue Nile and James Allen. While strengthening and growing each of their unique banner value propositions, we now expect the Blue Nile acquisition to be accretive through both revenue and cost synergies no later than Q4 of next year.\n\nThe final point I want to make is that a significant factor in our performance from quarter to quarter is the strength of our financial position. We've reset our operating model with significantly reduced fixed costs, such as occupancy through our store fleet optimization, and leaned into zero-based budgeting. Our operating model takes advantage of our scale. That's why we're confident in committing to annual double-digit operating margin with expansion over time.\n\nWe've demonstrated that we have several levers we can poll to respond to changing market conditions, which is precisely what we did in Q2. We're using our financial strength and flexibility to invest in the business in ways that create moats of competitive advantage and that our customers see and delighted by. Whether that's through the value of our assortment, the breadth of virtual shopping journeys we enable, or through strategic acquisitions. We're focused on consistent long-term value creation and our stated capital allocation priorities.\n\nFirst, investing strategically in our core business and acquisitions to expand market-share. Second, maintaining appropriate levels of leverage. And third, returning cash to shareholders. Repurchases and dividends with a goal of being a dividend growth company.\n\nSo I'll close where I began. Signet's Q2 results are a strong reason to believe our core message. We have the strategic clarity, structural advantages, financial flexibility, and a winning culture to deliver consistent, reliable, and sustainable growth and meaningful shareholder value. Signet is strong and growing stronger.\n\nOn that note, I'll hand it over to Joan.\n\nJoan Hilson -- Chief Financial Officer\n\nThanks, Gina, and good morning, everyone. I want to leave you with three messages today that all illustrate the sustainability of our operating model. First, we are confident we can deliver annual double-digit operating margin while growing market-share consistently and reliably. We believe we have the disciplined operating structure and innovative culture to do this year after year.\n\nSecond, with the help of our balance sheet and working capital efficiencies, we believe we are well positioned to make strategic investments that drive long-term growth. And third, we continue to prioritize shareholder returns alongside continued investments. Now turning to second quarter performance. Q2 is a perfect example of how we are effectively managing the top and bottom lines.\n\nWe delivered total sales of $1.8 billion, down 1.9% compared to the record-setting sales performance we delivered in Q2 a year ago. Banter represented almost a third of our comp decline during the quarter, offsetting a strong performance in bridal and accessible luxury. As Gina explained, we are taking full advantage of our strength and bridal, and leaning into higher price points, while at the same time moving the answer out of underperforming malls and accelerating the growth of digital. As previously reported, we saw trends soften across all price points in July, along with weaker traffic.\n\nThat said, for the quarter, our average transaction value in North America was up 10.8% on the comp basis. Sales per square foot was up over 40% compared to the second quarter of FY20, a direct result of our connected commerce strategy, coupled with our fleet rationalization that reduced our store base by 20%. In addition, warranty and repair services were drivers in the quarter and delivered nearly 7% growth. Importantly, we began to see improvement in August as a result of nine comp activities.\n\nNow let's turn to gross margins. Non-GAAP gross margin was 38% of sales, down 190 basis points compared to the second quarter last year. This reflects the leverage of occupancy on a -8.2% comp and the impact of Diamond's direct, which carries a lower relative margin. Importantly, our organic banners merchandise margin was similar to last year.\n\nAdditionally, strategic technology investments and the absence of COVID-related tax abatements from prior year also impacted the change in gross margin. In spite of softer top line, we leverage SG&A this quarter. SG&A was $477 million or 27% of sales, a 90 basis point improvement over last year. Our team managed SG&A in response to shifting market conditions, all while maintaining priority growth investments and returns to shareholders.\n\nThis is driven by our disciplined spend management, our gating approach to investments, lower payroll costs driven by our flexible labor model, and benefits from our enhanced financial services agreements. Non-GAAP operating income was $190 million or 11% of sales, which excludes acquisition-related charges of $6.4 million, and compares to $223 million or 12.5% of sales last year. Please note that last year included $9 million of income, primarily from COVID-related grants. Notably, our Q2 operating margin performance is nearly three times higher than FY20.\n\nLooking back further, this also exceeds our performance seven years ago when we had credit factored into our margin mix. This demonstrates the strength of our transformed operating model. Let's look now at the strength of our balance sheet. We have the flexibility to innovate and invest, and even a softer top line environment because of our working capital efficiencies.\n\nWe continue to deploy capital consistent with our stated priorities. At the end of the quarter, we had $852 million in cash and equivalents. Our focus on cash and working capital efficiencies have enabled us to achieve the following since February 20. We return cash to shareholders through $600 million of share repurchases.\n\nAnd given our stock's current multiple, which we believe is undervalued, we will continue to use our remaining $622 million multiyear authorization. We paid $37 million in common dividends since reinstatement with a goal to become a dividend growth company. We've also invested nearly $900 million in strategic acquisitions, augmenting our accessible luxury tier within our differentiated portfolio. Further, our leverage ratio on a trailing 12-month basis currently stands at approximately 1.9 times EBITDA, well below our previously stated goal of below 3 times and then nearly 50% from FY20.\n\nAnd today, reflecting the strength and confidence in our operating model, we're revising our leverage ratio target to maintain below 2.75 times EBITDA. Now I'd like to turn to inventory, which remains a critical differentiator for Signet. Inventory management is at the heart of our working capital efficiencies. Since fiscal year 20, we've made it a strategic imperative to reduce inventory overall, and we've done it even including Diamond's Direct.\n\nOverall, core inventory is down 13% in the quarter, compared to the second quarter of FY20 or $300 million. And importantly, it's also nearly 2% down to last year, indicating our ability to change quickly in response to macroeconomic shifts. Penetration of clearance inventory at the end of Q2 is down 1.2 last year, and down 8 points compared to FY20. Reflecting the health of our inventory, the inventory turn of 1.5 times at quarter end is turning 47% faster compared to pre-pandemic levels, and it's also improved to last year.\n\nWe continue to use the appropriate levers to maintain a healthy level of inventory and are well prepared for holiday season. We've partnered with our vendors to secure the right inventory, to meet consumer demands and trends. While still maintaining the rigorous inventory management that drives much of our cash and cost discipline. We manage inventory holistically to grow market-share and improve our operating margin.\n\nThis has become a reliable component of our annual double-digit operating margin commitments. So let me move to guidance, and then we're happy to take your questions. We are reaffirming our full-year fiscal 23 annual revenue and operating income guidance. We now expect non-GAAP earnings per share for full year fiscal 2023 in the range of $10.98 to $11.57, including the impact of share repurchases through the second quarter.\n\nOur full year fiscal 23 guidance does not include a material worsening of macroeconomic factors and it does not include [Inaudible], performance. On the third quarter, we expect revenue in the range of $1.46 billion to $1.49 billion, with non-GAAP operating income in the range of $20 million to $34 million. Please note that our strategic shift to an always on marketing model has moved cost to the third quarter, with associated revenue largely occurring in the fourth quarter. Before we open the call for Q&A, I want to acknowledge the capability and commitment that I see in our team day in and day out.\n\nOur team members operate with such commitment to our customers and accountability to our shareholders, and it is genuinely inspiring. What I love most about this team is that they are both high performance and high potential, delivering exceptional performance every single day and striving to be even better without fail. And on that note, we'll be happy to take your questions.\n\nOperator\n\n[Operator instructions] We take our first question from Ike Boruchow from Wells Fargo. Please go ahead.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nHey, everyone. Thanks for the question. Two quick ones. Just on the quarter to date, it sounds like August has gotten a little better.\n\nWhen we look at your Q2 performance versus the Q3 guide, it does look like you're getting a decent slowdown in revenues organically, both one year and on a multi-year basis. So just kind of walk us through the conservatism built in and what you commented on, what you've seen in August. A lot of retailers have seen a little bit of a rebound. And then a quick follow-up is just on the Blue Nile transaction, assuming this does close before holiday, I understand your guidance does not include any any impacts from them.\n\nBut if the deal does close ahead of holiday, would that be a positive or a negative to your [Inaudible] that you're currently guiding to in the fourth quarter? Thank you.\n\nGina Drosos -- Chief Executive Officer\n\nHey, Ike, thanks for your questions. I'll start with the first one. So, when we guided a couple of weeks on the balance of the year, at the time that we announced the transaction with Blue Nile, we really wanted to make sure we were reflecting the current reality of where we see the customer now. And so the low end of our guide was very clearly representing a continuation of the trends that we were seeing, not a material worsening, not including Blue Nile.\n\nWe did see some improvement in August. I think that's really a combination of the customer. We have continued to see some strength, as I said in my remarks, at higher price points and also for considered purchases, especially sentimental gifts and, and bridal, which we saw up 5% in the quarter. So, you know, I think there's some good news as we've come into August, but we didn't reflect any of that in the low end of the guide that we gave.\n\nAnd then, Joan, you want to talk a little bit about Blue Nile. We have already closed that transaction.\n\nJoan Hilson -- Chief Financial Officer\n\nWe closed the transaction recently. Our team has been on the ground over the last week or so, really pulling together and working hand-in-hand with the Blue Nile team to put together our holiday plans. And so it would be premature at this time to talk about our view of, of the fourth quarter. [Inaudible] based on the work that we've done, we're very excited about the opportunities for synergy and the ability to integrate the two banners with the James Allen team, and really leveraging the synergies of back office.\n\nSo lot of opportunity in our view, and just a little premature to really give guidance on the fourth quarter.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question comes from Lorraine Hutchinson from Bank of America. Please go ahead, Lorraine.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good morning. Encouraging to hear about the August stabilization, but I guess I just wanted to see how you were stress testing the model, and maybe hear your view on its sales soften further. Just talk through some of the levers that you can use to offset that leverage to allow you to maintain that goal of double-digit operating margins. \n\nJoan Hilson -- Chief Financial Officer\n\nThanks, Lorraine, for the question. And so our commitment and goal is to maintain an annual double-digit operating margin. And so if you think about what we closed off in in the second quarter, it was a -8.2% comp and we delivered a very strong double-digit operating margin. So how did we do that? Was one strong inventory management, healthy inventories clearance was below last year and clearance sales were below last year.\n\nSo again, healthy margins, as I mentioned, merchandise mix in our organic banners was similar to last year. So really able to leverage and build on the strong inventory disciplines that our teams are working on and have really put as part of our daily operating. The other levers are labor, right? What we said is we have a very flexible labor model. We use data analytics to manage labor to traffic and ensure that our teams we're putting coverage in the stores to support our customers at the right time and in the right locations.\n\nAnd then our spend management, we gate our investments. And it is and it's really gated against our view of where we see the top line trending. We protect priority investments that are critical to long-term growth, and really evaluate each based on our the ability to support our revenue in the short-term with the eye to the long-term, as I mentioned. I would also say that as we're looking forward into the back half, we've applied all of these same disciplines, and we work very closely with our MPI teams and vendors on inventory to ensure that we have the right trends, but we have the flexibility to move receipts should that be needed.\n\nAnd then from the panel perspective, are always on marketing. You know, the shift that I mentioned, the rain for the third quarter is just wanted to amplify that because it's a cost in the quarter that we continue to drive, and the revenue relates to the fourth quarter. And then I would say in the third quarter, recall that as we are our anniversary investments and in the prior year, we don't really get to that investment anniversary until the fourth quarter. So we are very closely watching our investments, and really as we think of our guidance for the third quarter and then the implied guide for the back half, we have considered all of those factors.\n\nThank you.\n\nOperator\n\nThe next question comes from Dana Telsey from Telsey Advisory Group. Please go ahead.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Good morning, everyone. As you think about the gross margin, and now the new buckets of the gross margin, with new businesses entering like Diamonds Direct, how do you think about the shaping of it, whether on an annual basis, a quarterly basis, and what the opportunity is for the levers of gross margin? Thank you.\n\nJoan Hilson -- Chief Financial Officer\n\nThanks, Dana. So gross margin, as I mentioned, our organic banners in the second quarter were similar to last year as we move forward into the back half of the year. You know, we have the same Diamonds Direct mix, which carries a relatively lower margin because of the bridal mix. But also our inventories are healthy, and what that means is that our clearance marks are not as deep.\n\nAnd therefore, our yield on clearance selling is stronger. So that's a lever that we continue to pull and use clearance as a strategic lever for us for promotion, but able to carry our relatively higher margin given the health of the clearance inventory. Then vertical integration is another lever for us to continue to drive, optimize our costs, and continue to drive, expansion in gross margin over time. And then I would also add the value engineering that Gina mentioned in her remarks, as we work with our vendor base in this environment, we continue to value engineer to ensure that we're bringing a beautiful product that's relevant on trend at a cost that enables us to have the right pricing and also bring value to the customer.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Oliver Chen from Cowen and Co. Please go ahead, Oliver.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Gina, and Joan. Thank you. Regarding the lower price point products, what do you see for innovation there ahead and what's necessary in timing on that, and how does that relate to traffic and merchandise margins? And you're calling out promotions and also the reality of the bifurcation of the lower-end consumer. And Joan, as we think about inventory terms, you made a lot of progress there.\n\nWhich parts of the product portfolio have the most opportunity to increase inventory terms? Thank you very much.\n\nJoan Hilson -- Chief Financial Officer\n\nAnd Oliver, to address your inventory turns, there's a couple of things that I would note here. One is that because of the health of our inventory and our consignment inventory position has been substantially lowered from several years ago. We've been able to work more flexibly with our vendors to test product, bring it in on memo, and roll to the balance of our portfolio based on its acceptance by the customers so that it enhances our ability to have the strong newness as well as improved churn. So I think that's something that we'll continue to drive with the merchandise teams, and they're really you know, that's something that we started last year in a smaller way.\n\nAnd really it's really taking hold as we drive through this fiscal year. And then the other is flexible fulfillment capabilities. Our team has done a really amazing job with our fulfillment team, our supply chain team, and our merchandise planning teams, to really integrate our flexible fulfillment capabilities into our purchasing as well as into the fulfillment of products from all of our locations, our stores and our DCs, which really has opened up the selling aperture for us and able to really continue to drive inventory turn there. So that's underway, but still moving up the maturity curve to enhance inventories.\n\nAnd then I think the third would just be this idea of turning inventory more toward just in time and working with our vendors with core inventory products. So we believe that we still have room to go, but you know, it'll take time and it will take more precision across our operation.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you. Best regards. Thanks to all.\n\nOperator\n\n[Operator instruction] We take our next question from Jim Sanderson from Northcoast Research. Please go ahead, Jim.\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nHey, thanks for the question. Just wondering if you could walk us through the back half of the year. How the puts and takes are between overhead expense and gross margin that gets you to a considerably lower dollar operating income in the current quarter and a nice pick-up or acceleration in the fourth quarter. What are the building blocks between those cost centers that get you to the end-of-the-year guidance based on what you're looking at for the third quarter?\n\nJoan Hilson -- Chief Financial Officer\n\nThanks for the question. So when we think about the back half of the third and fourth quarter split, our guidance for the third quarter includes incremental investments that we will anniversary in the fourth quarter. So that's the operating income rate deterioration that you see in the third quarter. But it's largely due to these investments that we will anniversary in the future quarter.\n\nI'd also say that as we're looking at our always on marketing strategy, as I mentioned in my remarks, this feeds marketing costs in the third quarter that are incremental, but the revenue is not generated until the fourth quarter largely. So I think that's the split between the quarters that you're seeing, Jim. And then lastly, things to remember about last year. In the fourth quarter of last year, we had an inventory-related charge based on the reduction in our inventory, we took a charge related to capitalized overhead that is was positioned in inventory.\n\nSo that is a positive for us as we anniversary that this year.\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nThank you.\n\nOperator\n\nThank you. So the next question comes from Paul Lejuez away from Citi. Please go ahead, Paul.\n\nBrandon Cheatham -- Citi -- Analyst\n\nHey, everyone, this is Brandon Cheatham for Paul. Thanks for taking our question. I was wondering if you could talk a little bit about how tickets and traffic trended this quarter. And, you know, when did you start seeing this kind of inflection in the kind of higher price point penetration that seemingly is driving results? And what are your expectations for that price point for that for the rest of the year?\n\nJoan Hilson -- Chief Financial Officer\n\nSo in terms of traffic, we actually saw traffic begin to go down in the spring. So call it March, April kind of time line with a more significant drop after Mother's Day. Brick-and-mortar traffic this year relative to e-commerce traffic has been stronger. That's, you know, customers desire to return to store.\n\nOf course, in our case, it's really not just about e-commerce sales. Digital for us is very much about browsing and preparing customers for their store journey. We have two-thirds of our customers now that are having a multichannel experience with us, but we have seen more purchases and more traffic happening in brick and mortar. And then in terms of that sort of bifurcation of challenged lower price points and growing higher price points, I would say that was most pronounced following Mother's Day.\n\nWe saw that as a big kind of June sort of phenomenon. July, the surprise of July was that higher price points actually became a bit more challenged. But as we've said, we have seen some stabilization in August from now.\n\nBrandon Cheatham -- Citi -- Analyst\n\nOK. And as your guidance assume that the trend kind of continues in the higher price points, are you expecting kind of an inflection in your lower value range?\n\nJoan Hilson -- Chief Financial Officer\n\nSo the way to think about it is our high guide assumes a continuation of the Q2 trend on comp, carries into Q3, and Q4 is positioned with a modest improvement largely from non-comp activities that we're putting in place to improve performance. Our low guide positions, Q3 and Q4 comps similar to the trends that we saw in July and August. And the underlying assumption here is that the macro environment remains constrained in the back half.\n\nBrandon Cheatham -- Citi -- Analyst\n\nThat's helpful. And then I was wondering if you've talked in the past about gaining more share of kind of wedding day related jewelry. I think historically you did a good job of capturing the engagement and then you didn't capture as much of the wedding day as you wanted. So I was wondering if you could kind of talk about how was your penetration on the wedding day-related jewelry going.\n\nWhere do you think that can kind of grow, too, and where you are and kind of that progression? Thank you.\n\nJoan Hilson -- Chief Financial Officer\n\nI would say we're reasonably early in that progression. But our first-party data capture the investments we've made in our consumer data platform. All of that is really a big help to us. So we are, I would say, more than ever, able to not just get to know couples at the engagement stage, but then really stay with them to work toward wedding band purchases and all the different wedding day purchases I talked about.\n\nThe research that I quoted, it's Signet's proprietary research around wedding activities and the fact that 43% of all gifts given around the wedding are jewelry. We think it's a big opportunity for us. We are launching new programs to go after that. So gift guides that help the bride.\n\nYou know, she has a big to-do list coming out of the engagement and working toward the wedding. So the more we can help on that, the better. And I'm excited about some of the other innovations. So I talked in my remarks about what we're doing on Rocksbox and having launched a bridal event rental program.\n\nThat's a great opportunity for brides to be able to wear nicer jewelry than they might have otherwise, for all of their events, whether it's the bachelorette party or announcement of the engagement all the way to the wedding day. And, of course, once she's been looking at those photos for a year or more of that beautiful jewelry, we're certainly then using our data and our targeted marketing efforts to try to drive a choice of that as a great first anniversary gift or birthday gift during the first year. So it's really a combination of the consumer insights that we've developed, the work that we're doing with our CDP to, capture more and more information and be more helpful to our customers throughout the process, and then the assortment that we're putting in place that we think can really help them. So our services business coming to life matched up with data and assortment.\n\nOperator\n\n Our final question comes from Mauricio Serna from UBS. Please go ahead.\n\nMauricio Serna -- UBS -- Analyst\n\nGreat. Good morning and thanks for taking my questions. I wanted to ask just very quickly, you mentioned that you closed the Blue Nile acquisition. So I'm just wondering, like, is that something that will be already be reflected in Q3? or it just does that begin in Q4 and maybe we can provide some guidance around that? And then maybe we could elaborate a little bit more about how you see this acquisition versus specifically the James Allen business.\n\nJust wondering if there's any big customer overlap or anything there that could be leading to some kind of organization between both our formats. And then maybe if you can talk about Q3, you know, the sales outlook, I think it implies roughly 24% sales growth versus 2019. But if you take your guidance for the year, I think that assumes like that 20% growth in Q4. So just wondering, what are you thinking there in the guidance for sales? Thank you\n\nJoan Hilson -- Chief Financial Officer\n\nSo thanks, Mauricio. I'll take the first one and then I'll come back on the guidance. So that Blue Nile acquisition, we closed in the third quarter and it will be reflected in our performance from the point of closing forward. As I mentioned, Mauricio, we were on our teams have been working diligently.\n\nThey've been on the ground there for about a week. And we really been working very closely to develop the forecast and the plans collectively for the balance of the year. So stay tuned on that. But as I mentioned, it is not in our guidance for the balance of this year.\n\nGina Drosos -- Chief Executive Officer\n\nAnd then in terms of incrementality of Blue Nile, we see that as a great market-share growth opportunity. We did a considerable amount of consumer research before the acquisition, and we found that blue Nile has a distinctive cohort younger, more diverse, more fluent than the rest of our portfolio. They also have some different go-to-market models versus our James Allen business. So with 23 showrooms, they have a very low inventory model, but a high touch, high service environment for customers to be able to see styles, try on pieces, really get a feel for what they want, but then they place the order online in a marketplace that's very similar to what we do on James Allen.\n\nSo there are a lot of back office synergies we think that can come to life in this acquisition, which then will give us more fuel to really invest to grow both of these as distinctive banners within our portfolio. And to Joan's point, we did we had our team out meeting with the Blue Nile team the day after we closed. And we've just been so pleased with the caliber of talent in the Blue Nile organization and the excitement that they have to really make this transition a very successful one. So I would say we're off to a good start on that front.\n\nJoan Hilson -- Chief Financial Officer\n\nThen to address the Q3, Q4, as I mentioned, the high guide assumes a continuation of the Q2 trend on a comp basis and it carries that carries into Q3, and modest improvement in Q4 related to non-comp activities that the team has tested and will put in play for the holiday season. On the low end, the guide positions, Q3 and Q4 comps similar to the trend that we saw in July and August. And we believe that's more conservative. And just put out the note again that we did see some improvement in August, which gave us confidence in the [Inaudible].\n\nGina Drosos -- Chief Executive Officer\n\nBut just to be really clear, Blue Nile is not in our guide at this point in time. It's just too early for us to really know what that's going to look like for Q3 or Q4.\n\nMauricio Serna -- UBS -- Analyst\n\nThat's very helpful. And any thoughts on the share repurchase outlook or potential share repurchases, given that you still have over $600 million available?\n\nJoan Hilson -- Chief Financial Officer\n\nWell, what we said is that it remains part of our stated capital priorities, and given our release, I believe our stock is on the value that will remain part of our priorities, and we have a [Inaudible] program and our authorization is fixed on $22 million.\n\nOperator\n\nWe have no further questions left in the queue. I'll hand it back to the management for any closing remarks.\n\nGina Drosos -- Chief Executive Officer\n\nI want to thank everyone, again for joining us today. I hope you took away that Signet has strategic priority, structural advantages, financial flexibility, and a winning culture to deliver consistent, reliable, and sustainable growth, and meaningful shareholder value. Thank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nVinnie Sinisi -- Senior Vice President, Investor Relations and Treasury\n\nGina Drosos -- Chief Executive Officer\n\nJoan Hilson -- Chief Financial Officer\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nBrandon Cheatham -- Citi -- Analyst\n\nMauricio Serna -- UBS -- Analyst\n\nMore SIG analysis\n\nAll earnings call transcripts"
}