{
  "companyName": "Novo Nordisk",
  "companyTicker": "NVO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/novo-nordisk-nvo-q3-2022-earnings-call-transcript/",
  "content": "Novo Nordisk (NVO 0.10%)\nQ3 2022 Earnings Call\nNov 02, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to Q3 2022 Novo Nordisk A/S earnings conference call. [Operator instructions] I would now like to hand the conference over to your speaker today, CEO, Lars Fruergaard Jorgensen. Please go ahead.\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nThank you, operator. Welcome to this Novo's earnings call for the first nine months of 2022 and the outlook for the year. My name is Lars Fruergaard Jorgensen, and I'm the CEO of Novo Nordisk. With me today, I have executive vice president and head of commercial strategy and corporate affairs, Camilla Sylvest; executive vice president and head of North America operations, Doug Langa; executive vice president and head of development, Martin Holst Lange; and finally, chief financial officer, Karsten Munk.\n\nAll of us will be available for the Q&A session. Today's announcement and the slides for this call are available on our website, novonordisk.com. Please note that the call would be webcast live, and a recording will be made available on our website as well. Call is scheduled to last for one hour.\n\nPlease turn to the next slide. The presentation is structured as outlined on Slide 2. Please note that all sales and operating profit statements will be at constant exchange rates, unless otherwise specified. The Q&A session will begin in about 25 minutes.\n\nPlease turn to Slide 3. As always, I need to advise you that this call will contain forward-looking statements. These are subject to risks and uncertainties that could cause actual results to differ materially from expectations. For further information on the risk factors, please see the company's filings for the first nine months of 2022 and the slides prepared for this presentation.\n\nPlease turn to the next slide. In the first nine months of 2022, we delivered double-digit sales and operating profit growth, which has enabled us to raise our outlook for the full year. I would like to start this call by going through the performance highlights across our operations before handing over the word to my colleagues. We continue to make progress across all dimensions of service and sustainability.\n\nOur carbon emissions decreased by 18% compared to the first nine months of 2019, and we continue to reach even more patients compared to the same period last year. Within our aspiration of being a sustainable employer, we expanded the number of women in senior leadership positions to 38% compared to 36% by the end of September 2021. Within R&D, we are pleased with the encouraging phase 2 data with CagriSema in Type 2 diabetes, as well as the successful completion of the pivotal phase 3 program for once-weekly insulin icodec. Both support our aspiration of further raising the innovation bar for diabetes treatments.\n\nMartin will come back to this and all our R&D milestones later in this call. In the first nine months of 2022, we delivered double-digit sales growth, reflecting solid commercial execution across geographies and our therapy areas. While both operating units contributed to sales growth, we saw particular strong sales growth in North America, driven by accelerated demand for our GLP-1 treatments. This has enabled us to increase the outlook for the year.\n\nCamilla and Doug will go through the details per therapy area later. Lastly, Karsten will go through the financial details, but I'm very pleased with our sales growth of 16% and operating profit growth of 14% in the first nine months of 2022. With that, I'll now give the word to Camilla for an update on commercial execution.\n\nCamilla Sylvest -- Executive Vice President, Head of Commercial Strategy and Corporate Affairs\n\nThank you, Lars. And please turn to the next slide. As last mentioned, our 16% sales growth in the first nine months of 2022 was driven by both operating units, with North America operations growing by 22% and international operations growing by 11%. Our GLP-1 sales increased 44% by North America growing 39% and international operations growing 55%.\n\nInsulin sales decreased by 11%, driven by a 7% decline in international operations and a 20% sales declines in North America operations. The U.S. insulin sales declined by 22%, driven by lower realized prices and a decline in volume. Insulin sales and international operations were impacted by the implementation of volume-based procurement in China from May 22, as well as lower sales in EMEA.\n\nObesity care sales grew 75 overall, and international operations extended sales grew 73%. And in North America operations, obesity care sales grew 77%. In the U.S., obesity care sales grew 81%. Rare disease sales grew 2%, driven by a 4% sales increase in international operations, offset by a 3% decline in North America operations.\n\nPlease turn to Slide 6. Our 14% sales growth within diabetes care is faster in all diabetes market. That means we have improved our market share by 1.7 percentage points to 31.6%. We continue to be on track to reach one-third of the diabetes value market by 2025.\n\nThis increase primarily reflects GLP-1 market growth, as well as share gains in both operating units. And please turn to the next slide. In international operations, diabetes care sales increased by 9% in the first nine months of '22, driven by GLP-1 sales that grew by 55%. Novo Nordisk remains the market leader in international operations, with a GLP-1 value market share of 69.6%.\n\nThis is driven by share gains across geographies. Ozempic continues to expand its GLP-1 market share leadership in international operations with a 41.3% market share. While the GLP-1 class is growing more than 40%, GLP-1 penetration remains low at around 4% of total diabetes groups globally. And with that, I will hand over the word to Doug.\n\nDoug Langa -- Executive Vice President, Head of North America Operations\n\nThank you for that update, Camilla. Please turn to the next slide. The U.S. GLP-1 market volume grew by more than 40%, comparing the third quarter of 2022 to the third quarter of 2021, with once-weekly injectable GLP-1s and Rybelsus as the main drivers.\n\nThe recent competitor launch in GLP-1 has supported the continued acceleration in market growth from an NBRx perspective, as well as all-time high levels for our portfolio GLP-1 products during Q3. Measured on total prescriptions, Novo Nordisk has maintained its market leadership with a 52.4% market share. Additionally, Ozempic continues to be the market leader with a 38.7% TRx market share. Rybelsus continues to grow and has now been launched in 43 countries.\n\nIn the first nine months of 2022, it was the second largest contributor to growth in Novo Nordisk after Ozempic. Please go to the next slide. Obesity care sales increased by 75%, with 77% growth in North American operations and 73% in international operations. Furthermore, the global obesity market expansion continues with a volume growth of the global branded obesity market of more than 60%.\n\nWe continue to be encouraged by the performance of Saxenda in international operations. Region EMEA is a key growth driver with 96% growth in the first nine months of 2022. Specifically, the growth continues to be particularly strong in countries that have some level of reimbursement, such as the U.K., Norway, and Israel. In the U.S., obesity care sales grew by 81%, with both Wegovy and Saxenda contributing to growth.\n\nFollowing the previously announced Wegovy supply issues in the U.S., our focus remains to continue continuity of care to the patients that have already initiated treatment. In line with expectations, this has negatively impacted Wegovy prescription trends. Positively, Saxenda prescription trends have accelerated and continue to be at all-time high levels. Regarding Wegovy supply, we expect to make all doses of Wegovy available in the U.S.\n\nin December. We plan to initiate broad commercial activities in the beginning of 2023. Now, back over to Camila for an update on rare disease.\n\nCamilla Sylvest -- Executive Vice President, Head of Commercial Strategy and Corporate Affairs\n\nThank you, Doug. Next slide, please. Our rare disease sales increased by 2% in the first nine months of 2022. This was driven by a 4% sales growth in international operations, offset by a 3% decline in North America operations.\n\nRare blood disorders grew by 6%, driven by NovoSeven, as well as the launch products, Esporect and Refixia. Specifically, haemophilia A products grew by 6%, haemophilia B sales by 9%, and NovoSeven by 6%. Rare endocrine disorder sales declined by 6%. The declining sales were driven by international operations decreasing 2% and by North America operations decreasing by 13%.\n\nThe sales were negatively impacted by lower realized prices in the U.S. And now, over to you, Martin, for an update on R&D.\n\nMartin Holst Lange -- Executive Vice President and Head of Development\n\nThank you, Camila. Please turn to Slide 11. In August, we shared the exciting data from the phase 2 trial for CagriSema in people with Type 2 diabetes. I would like to briefly walk through these results.\n\nThis was a 32-week trial that investigated the efficacy and safety of our fixed dose combination of CagriSema compared to the individual components of Semaglutide 2.4 milligram and cagrilintide 2.4 milligram. All products were administered once weekly. The trial included 92 people with Type 2 diabetes and overweight. And people were equally randomized among the free treatment arms.\n\nIn the trial, the mean baseline A1c was 8.4%. And the mean baseline body weight was 106 kilograms. After 32 weeks of treatment, people treated with CagriSema achieved a numerically higher A1c of 2.18 percentage point compared to a reduction of 1.79 percentage points for people treated with Semaglutide and 0.93 percentage point for people treated with cagrilintide alone. People treated with CagriSema had numerically higher body weight reduction of 15.6% compared to a reduction of 5.1% for people treated with Semaglutide and 8.1% for people treated with cagrilintide alone.\n\nIn the trial, CagriSema appeared to have a safe and well-tolerated profile. Overall, these results indicate that CagriSema reduces blood sugar more than the two motor components alone. And the weight loss seen in the trial confirms the substantial weight lowering potential of CagriSema. Based on the results, potential initiated from the program [Technical Difficulty] in people with Type 2 diabetes during the course of 2023.\n\nNext slide, please. ONWARDS 5 was a 52-week efficacy and safety trial, once-weekly insulin icodec to once-daily basal insulin. This was either insulin degludic or insulin glargine. The trial included 1,085 insulin-naive people with Type 2 diabetes.\n\nThe primary objective of the trial was to demonstrate noninferiority of insulin icodec compared to once-daily basal insulin analogs in reducing A1c at 52 weeks. ONWARDS 5 included a dose-guided, as well as real-world evidence, such as substantial [Technical Difficulty] compared to the other ONWARDS trials. Altogether, we believe that this design will increase your understanding and dialogue of how insulin icodec could make a difference for patients in an actual clinical practice setting. This trial was a [Inaudible] trial, and it achieved its primary endpoint by demonstrating noninferiority in reducing hemoglobin A1c at week 52 with the insulin icodec as compared to once-daily basal insulin analogs.\n\nFrom an overall baseline A1c of 8.9%, once-weekly insulin icodec achieved a superior reduction in estimated A1c of 1.68% compared to 1.31% for once-daily insulin analog with an estimated treatment difference of 0.38 percentage points. In addition, we presented the rates of severe and clinically significant hypoglycemia. In the trial, once-weekly insulin icodec appear to have a safe and well-tolerated profile. In conclusion, we're very pleased to share the positive results from the ONWARDS 5 trial.\n\nThese results confirm the data reading in the previously reported ONWARDS program. The result highlighted that insulin icodec has the potential to be an ideal starter insulin for people with Type 2 diabetes, as well as a very attractive option in combination with mealtime insulin as shown in ONWARDS 4, thus covering the full spectrum of Type 2 diabetes. We expect the filing for regulatory approval of once-weekly insulin icodec in the U.S., in the EU, and in China during the first half of 2023. Can you turn to the next slide? In September, we completed the 24-week main part of the phase 3 trial with concizumab that with the explorer8 in people with haemophilia A or haemophilia B without inhibitors.\n\nThe trial met its primary endpoint, confirming superiority of concizumab prophylaxis treatment compared to no prophylaxis treatment in reducing the annual bleeding rate in both haemophilia A or haemophilia B patients without inhibitors. The secondary confirmatory endpoint of demonstrating noninferiority of concizumab prophylaxis as compared to previous prophylaxis factor treatment in reducing the API was not met. In the trial, concizumab appeared to have a safe and well-tolerated profile with no thromboembolic events reported after the treatment restart following the treatment pause. Based on the results of explore8, we are assessing further development activities and timing of regulatory submissions in people without inhibitors.\n\nNow, staying within rare disease, I'm very excited to share that treatment has been initiated in the first Mim8 phase 3a trial in haemophilia A. This is called FRONTIER 2. Based on the results we saw in phase 1 and 2, we have very high expectations for the trial and the difference that Mim8 make for patients with haemophilia A in managing their disease. Furthermore, we have submitted the document for regulatory approval in the U.S.\n\nfor the treatment of primary hyperoxaluria. The document was part of the Dicerna Pharmaceuticals acquisition we made back in 2021. Within other serious chronic diseases, we have completed a 12-week phase 2 trial of oral PCSK9 in 267 people with a ASCVD or risk of a ASCVD. The trial met its pipeline by demonstrating superiority versus placebo, enduring low-density lipoprotein cholesterol, and appeared to have a safe and well-tolerated profile.\n\nHowever, due to commercial and portfolio considerations, the development of oral PCSK9 will be terminated. Now, let's turn to the other high-level R&D milestones that I did not cover in the previous slides. Within diabetes, we have initiated a phase 1 trial with once-weekly oral Semaglutide, as well as a phase 2 trial with higher doses of Ozempic in the third quarter of this year. The latter is a 49-week trial investigating the efficacy and tolerability of 8 and 16 milligram of Ozempic, respectively.\n\nThe trial is expected to include around 240 people with Type 2 diabetes. Further, in the first half of 2023, we expect results from the currently ongoing phase 3 trial will oral semaglutide 25 and 15 milligrams, respectively. Finally, within obesity, we are very excited to have initiated the phase 3a trial called REDEFINE 1 for CagriSema. REDEFINE 1 is a 68-week trial, comparing the efficacy and safety of once-weekly CagriSema with semaglutide 2.4 milligram, cagrilintide 2.4 milligram, and placebo.\n\nThe trial is expected to enroll approximately 3,400 people with obesity or overweight and comorbidities, and is the first pivotal trial in the REDEFINE market. Further, during the first half of 2023, we expect results from the phase 3a trial with all semaglutide 50 milligram, as well as the phase 1/2 trial results from the ongoing trial with PYY. Altogether, we're looking very much forward to an exciting period with clinical trial initiations, as well as results across other areas. With that, over to you, Karsten.\n\nKarsten Munk Knudsen -- Chief Financial Officer\n\nThank you, Martin. Please turn to the next slide. In the first nine months of 2022, our sales grew by 26% in Danish kroner and 16% at constant exchange rates, driven by both our operating units. The gross margin increased to 84.3% to 83% in 2021, driven by a positive product mix due to increased GLP-1 sales, a positive currency impact of 0.9 percentage points, and productivity improvements.\n\nThese effects are countered by lower-realized prices in the U.S. and China. Sales and distribution costs increased by 28% in Danish kroner and 19% at constant exchange rates. The increase is driven by launch activities and promotional spend for Rybelsus and Ozempic, as well as market development activities for obesity.\n\nThe cost increase is reflecting low activity levels in 2021 due to COVID-19, as well as higher distribution costs. Research and development costs increased by 31% in Danish kroner and 26% at constant exchange rates. The increase is driven by higher clinical activity levels within other serious chronic diseases and GLP-1, as well as the operating costs and amortization related to the acquisition of Dicerna Pharmaceuticals in the fourth quarter of 2021. Administration costs increased by 9% in Danish kroner and 5% at constant exchange rates.\n\nOperating profit increased by 28% in Danish kroner and by 14% at constant exchange rates. Net financial items for 2022 showed a loss of around 5 billion kroner compared to a gain of around 1 billion in 2021. This mainly relates to losses following the appreciation of the U.S. dollar as reflected in the favorable currency impact in operating profit.\n\nThe effective tax rate for the first nine months of 2022 was 20.5% compared to 19.8% in 2021. Net profit increased by 14%, and diluted earnings per share increased by 15% to 18.42 kroner. Free cash flow was 62.5 billion Danish kroner compared to 52.3 billion Danish kroner in '21. The cash conversion in the first nine months of 2022 is positively impacted by timing of rebate payments in the U.S., including provisions related to the revised 340B distribution policy.\n\nIncome under the 340B program has been partially recognized. We continue 2022 with a solid growth momentum and now expect the sales growth to be between 14% and 17% at constant exchange rates. This is based on a number of assumptions as described in the company announcements. The raised guidance reflects expectations for sales growth in both international operations and North America operations and across therapy areas, but mainly driven by diabetes and obesity care.\n\nThe updated guidance is based on the expectation that all the [Inaudible] are available in the U.S. toward the end of the year. The outlook reflects that we expect continued periodic supply constraints and related drug shortage notifications. This is driven by higher-than-expected volume growth for GLP-1-based products, such as Ozempic, and temporary capacity limitations at some manufacturing sites.\n\nWe are gradually increasing our supply capacity and expect this to be sufficient to support a potential continuation of the current sales growth trajectory. We now expect that operating profit will grow between 13% and 15% at constant exchange rates as this primarily reflects the sales growth outlook and continued investments in current and future growth drivers. We are also allocating additional resources to both early and late-stage R&D pipeline activities. As mentioned before, our acquisition of Dicerna Pharmaceuticals is negatively impacted, impacting operating profit growth by around 2 percentage points due to higher operating costs and amortization of intangible assets.\n\nGiven the current exchange rates, most notably strengthening of the U.S. dollar, we expect a positive currency impact for 2022, our reported sales are now expected to be 10 percentage points higher than at CER, and operating profit growth is now expected to be 15 percentage points higher than at CER. The positive currency impact on operating profit of 15 percentage points is partly offset by a net loss on financial items. For 2022, we now expect that financial items will amount to a net loss of around 6.6 billion Danish kroner, mainly reflecting losses associated with foreign exchange hedging contracts.\n\nCapital expenditure is still expected to be around 12 billion Danish kroner, which mainly relates to investments in additional API production capacity at existing manufacturing sites. Our free cash flow is now expected to be between 54 billion and 59 billion Danish kroner, reflecting the acquisition of Forma Therapeutics. The acquisition closed in the fourth quarter of 2022. That covers the updated outlook for '22.\n\nNow, back to you, Lars, for final remarks.\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nThank you, Karsten. Please turn to the final slide. We are very pleased with the double-digit sales growth in the first nine months of 2022 and that we continue to reach even more patients. The strong financial performance in the first nine months of 2022 has enabled us to raise our outlook for the full year.\n\nFrom an R&D perspective, we have now successfully completed the full onboard program with once-weekly insulin icodec, the full results underlying our commitment to further raising the innovation bar in diabetes. We look forward to submitting insulin icodec for regulatory approval in the first half of 2023. In addition, we are excited about initiating the phase 3 program for CagriSema in obesity. This could further strengthen our portfolio of superior obesity products.\n\nWith that, we are now ready for the Q&A. We kindly ask all participants to limit her or himself to one or maximum of two questions. Operator, we are now ready for the first question.\n\nOperator\n\n[Operator instructions] We will now take the first question. It comes from the line of Wimal Kapadia from Bernstein. Please go ahead. Your line is open.\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nWell, great. Thank you very much for taking my questions, please. Actually, I'll skip, we're going supply, if that's OK, and start with the oral weekly semaglutide. Now, this sounds quite interesting.\n\nSo, my question really is, is this just a reformulation of Rybelsus? Will it be for diabetes and obesity? Does it use a SNAC technology? What preclinical work have you seen to suggest the GI tox would be acceptable? And are you really trying to achieve injectable-like outcome? So, I know there's a few bits to that question, but maybe a summary of that asset would be quite helpful. And then, my second question, just to Novo's comment on enough supply of Ozempic to maintain the current trajectory. I guess my question really is how much of the current trajectory is actually being driven by lack of Wegovy supply, i.e., obesity? So, one of your peers yesterday, Lilly, suggested, you know, one-third of their Mounjaro patients were not on diabetes medicines prior to taking the drug. So, unless they are using the drug pre-metformin, that number is one-third.\n\nSo, I guess what is that number for Ozempic? Thank you.\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nThank you, Wimal. First, Martin, on the exciting prospects of all weekly SMA.\n\nMartin Holst Lange -- Executive Vice President and Head of Development\n\nYes. Absolutely. So, you're clearly right. We're very excited about this.\n\nThis is an offering that is, as you rightly point out, Wimal, it's based on our SNAC technology. It's a little more than a reformulation, but we do expect it to allow for a full offering of once-weekly dosing. Our intent is that this would be available potentially in both diabetes and obesity and with an efficacy and safety profile similar to that of injectables. So, I think I heard you mentioned GI tolerability.\n\nThis would be on par with what we've already seen in our subcutaneous semaglutide profiles.\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nYeah. Thank you, Martin. An exciting opportunity underlying all capabilities. Then, Karsten, we added some caveats on potential growth and linked to supplies for next year.\n\nSo, can you put some comments on that?\n\nKarsten Munk Knudsen -- Chief Financial Officer\n\nYeah. So, as we put it into our company announcement, then we're stating that as we're greatly expanding our supply capacity, then we expect to have enough capacity to support a potential continuation of the current sales growth trajectory. So, this is nothing on Ozempic isolation but this is a macro statement for almost all sales growth and supply capacity. So, just to clarify that.\n\nAs to source of business on Ozempic and the read across you alluded to, then when we're looking at source of business on Ozempic, our estimate is that to the tune -- in the U.S. marketplace, to the tune of 40% of new Ozempic business comes from naive patients who have not received their diabetes medication before.\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nThank you, Karsten. And thank you, Wimal. Next question, please.\n\nOperator\n\nThank you. We will now take the next question. It comes from the line of Matthew Weston from Credit Suisse. Please go ahead.\n\nYour line is open.\n\nMatt Weston -- Credit Suisse -- Analyst\n\nThank you very much. Can I ask two questions, please? The first coming back to Wimal and Ozempic capacity. Can I understand the cadence of capacity increases into '23, please? Is there a specific bolus coming online? Or is it very much gradual? And to try and put into perspective your comments about the current trajectory, do you believe you will have capacity to deliver consensus sales expectations for '23? And then secondly, a question about U.S. healthcare reform.\n\nWe're getting close to the abolition of the Medicaid penny rule cap in January 2024. Should we assume that Novo will withdraw penny rule products from the U.S. during next year? Do you have to withdraw that product in its entirety, you can't just step away from Medicaid? And if that is the case, can you redirect that volume to other markets? Or can you use the fill-finish infrastructure for GLP-1?\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nThank you for those questions. So, on Ozempic, you shouldn't expect. That's kind of a one-off event that triggers a step change. So, it's a gradual expansion of capacity.\n\nAnd I'll not go in and comment on our ability to supply against consensus. We will give our guidance for '23 at the full year. And then, Doug, on U.S. healthcare reform and Medicaid changes coming up.\n\nI guess that we cannot be really detailed on what our plans are. But what can you share?\n\nDoug Langa -- Executive Vice President, Head of North America Operations\n\nYes, I think the question specifically was on the MCAP repeal going into 2024. And certainly, we're working on the potential mitigating actions, but I wouldn't want to get into the specifics.\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nYeah. Thank you. Next question, please.\n\nOperator\n\nThank you. We will now take the next question. It comes from the line of Michael Nedelcovych from Cowen. Please go ahead.\n\nYour line is open.\n\nMike Nedelcovych -- Cowen and Company -- Analyst\n\nThank you for the question. So, as has been mentioned, many people are now taking other incretins for weight loss while Wegovy supply constrained. It would seem that switching these people over to the Wegovy, once it's available, could be complicated. And then, the timing of generic Saxenda availability adds further complexity.\n\nYet, investors seem to be expecting the pace of sales of Wegovy, once supply is available, to recapitulate its initial launch trajectory. I'm wondering how you think about these factors? And would you advise us to temper our expectations at all? And then, my second question is, yesterday, Lilly appeared to imply that a weight loss drug with efficacy in obesity-associated conditions, such as sleep apnea and heart failure, might have a route to Medicare reimbursement without the passage of new legislation in the U.S. I don't believe this is Novo's view. But why is that not a reasonable assumption? Thank you.\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nSo, I'll start with a bit of perspective on useable incretins. And then, maybe, Doug, you can talk a bit to what we expect when we come back to the U.S. and launch and, perhaps, what it takes to get an obesity product reimbursed in the public account. So, you mentioned that there's useable incretins now that Wegovy is short on supply.\n\nI would actually say that the majority uptake is on our own Saxenda. We have seen Saxenda doing really, really well, a step change and an uptake as we unfortunately had to slow down the launch curve. So, that really proves that the obesity market is opening up. So, before that, Wegovy really created the excitement about what weight loss potential is possible.\n\nWe saw a much lower uptake of Saxenda. So, we are pleased with what we see, and we believe that we can both [Technical Difficulty]\n\nDuration: 0 minutes\n\nLars Fruergaard Jorgensen -- President and Chief Executive Officer\n\nCamilla Sylvest -- Executive Vice President, Head of Commercial Strategy and Corporate Affairs\n\nDoug Langa -- Executive Vice President, Head of North America Operations\n\nMartin Holst Lange -- Executive Vice President and Head of Development\n\nKarsten Munk Knudsen -- Chief Financial Officer\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nMatt Weston -- Credit Suisse -- Analyst\n\nMike Nedelcovych -- Cowen and Company -- Analyst\n\nMore NVO analysis\n\nAll earnings call transcripts"
}