{
  "companyName": "Conns",
  "companyTicker": "CONN",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/conns-conn-q2-2023-earnings-call-transcript/",
  "content": "Conns (CONN -1.57%)\nQ2 2023 Earnings Call\nAug 30, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning and thank you for holding. Welcome to Conn's Inc. conference call to discuss earnings for the fiscal quarter that ended July 31, 2022. My name is Doug, and I'll be your operator today.\n\nDuring the presentation, all participants will be in a listen-only mode. After the speakers' remarks, you'll be invited to participate in a question-and-answer session. As a reminder, this conference call is being recorded. The company's earnings release, dated August 30, 2022, was distributed before the market opened this morning and can be accessed via the company's investor relations website at ir.conns.com.\n\nDuring today's call, management will discuss among other financial performance measures, adjusted net income, adjusted net income per diluted share, and net debt. Please refer to the company's earnings release that was issued today for a reconciliation of these non-GAAP measures to their most comparable GAAP measures. I must remind you that some of the statements made in this call are forward-looking statements within the meaning of federal securities laws. These forward-looking statements represent the company's present expectations or beliefs concerning future events.\n\nThe company cautions that such statements are necessarily based on certain assumptions, which are subject to risks and uncertainties, which cause actual results to differ materially from those indicated today. Your speakers today are Chandra Holt, the company's CEO; and George Bchara, the company's CFO. I would now like to turn the conference over to Ms. Holt.\n\nPlease go ahead.\n\nChandra Holt -- Chief Executive Officer and President\n\nGood morning and welcome to Conn's second quarter fiscal year 2023 earnings conference Call. I'll start today's call with a review of the quarter and an update on our strategic priorities. Before turning the call over to George, who will review our financial results in more detail. Challenging macroeconomic conditions continued to pressure consumer spending during our second quarter, which disproportionately affected our financial access customer segment and our more discretionary product categories.\n\nWhile we entered the second quarter with a more cautious outlook for the remainder of the year, the retail environment deteriorated further during the quarter. As a result, we have accelerated our efforts to reduce operating costs and lower capital expenditures, as well as continue to maintain conservative credit underwriting. I remain confident in Conns' value proposition and our ability to leverage our best-in-class payment options and industry-leading next-day white glove delivery and our in-house repair service capabilities. We are focused on executing against areas of the business that we can control and we continue to believe Conns can become a best-in-class unified commerce retailer in the future.\n\nI want to use my time today to focus on the near-term dynamics that are pressuring the business, and the actions we are implementing to successfully navigate this period, and emerge as a stronger company. Our second quarter financial results were impacted by two main factors. First, we lapped strong second quarter results from last year, as last year benefited from stimulus programs and higher lease-to-own sales. Second, we are seeing weaker consumer demand for discretionary categories.\n\nWe believe this was driven by inflationary pressures and recessionary fears that have caused consumers, especially lower-income consumers, to focus on household necessities and shift spending away from discretionary products. If these trends continue to disproportionately impact our financial access customers, which include customers who finance with our in-house credit product or third-party lease-to-own product. Second quarter sales to this lower-income consumer segment declined 24% year over year, compared to a 12% year-over-year decline to our higher income fast and reliable customer segment, which include customers who paid with cash or our private label credit card. While the challenging macroeconomic environment has impacted our retail result, our credit segment remains stable.\n\nI am pleased to report another quarter of positive credit segment income before taxes. Certain indicators of portfolio health remain better than pre-pandemic levels. For example, reage accounts as a percent of the portfolio are at the best levels in six years, despite a declining portfolio balance reducing the denominator. In addition, the weighted average credit score of outstanding balances is at the highest level in over 10 years.\n\nAugust, same-store sales are down approximately 27%. We expect third quarter same-store sales to remain challenging as we overlap a positive 20.6% comp for the third quarter last fiscal year. Overall, the dollar amount of retail sales has remained generally stable over the past several months. We expect to see same-store sales improve in the fourth quarter, as we benefit from our growth initiatives and overlap a 6.2% sales comparison in the fourth quarter of last fiscal year.\n\nWe ended the second quarter with over $211 million of cash and available liquidity, which we believe supports the current needs of our business while allowing us to simultaneously invest in our growth strategies and business transformation. We also continue to demonstrate our ability to access the capital markets even during turbulent market conditions. During the second quarter, we successfully completed our 11th ABS transaction since reentering the ABS market in 2015. Our stable credit performance and meaningful liquidity levels support our efforts to navigate this difficult period.\n\nAs a result, we can pursue multiple actions to drive sales, which include investing in our e-commerce channels, pursuing partnership opportunities, and expanding our best-in-class payment options. We are also focused on reducing operating costs, adjusting our merchandising plans, lowering capital expenditures, and continuing to maintain conservative credit underwriting. Looking at our near-term priorities in more detail, starting with our merchandising plans. We are adjusting our merchandising activities by tailoring our category strategies and optimizing our assortment.\n\nThis includes expanding our selection in-store and even further online to offer the latest trends, and broaden our appeal within our appliance category. In TVs, we are adding more value-oriented models to complement our premium assortment in response to shifting consumer demand. We are also building on the success of Dreamspot, our private brand in the mattress category by launching VILLA HILL, our new furniture Private Brand. VILLA HILL will offer our customers high-quality on-trend products at great value.\n\nWe are also focused on pursuing actions to manage and optimize inventory levels and programs are underway to align inventories with our lower sales forecast. We're also conducting an extensive review and prioritization of our cost structure. We expect current initiatives combined with prior actions to generate cost savings of approximately $12 million to $16 million in the back half of this fiscal year, which help offset the investments we are making in our long-term growth initiatives. As part of our cost initiatives, we are reducing our marketing spending while reallocating the remaining marketing dollars to channels that most effectively drive near-term growth.\n\nWe continue to assess our cost structure and we will make necessary adjustments to support our forecasted sales. Our next near-term priority is to delay or eliminate certain capital expenditures, and prudently manage our business during this uncertain economic period. This includes pursuing actions to adjust planned new store openings and distribution center expansions. As a result, we expect to reduce investments and capital expenditures this fiscal year by approximately $20 million compared to our prior expectations.\n\nAnother key priority is to ensure our credit portfolio remains healthy. While we expect normalizing credit trends and a shrinking portfolio balance to put pressure on our credit spread, we entered this period with a strong credit infrastructure and strategy. We are maintaining a conservative approach to underwriting by continuing to target higher credit quality customers and remaining disciplined in our approach to credit collections. We also continue to pursue opportunities to leverage our best-in-class payment options.\n\nWe continue to make progress integrating the lease-to-own technology platform we acquired in the first quarter. We expect to originate our first in-house lease-to-own sales by the end of the fourth quarter. Our lease-to-own transition is an important initiative, as we create a platform that supports the volume of retail sales we expect to achieve this through this payment option. Our recently launched layaway program provides our customers with another payment option and provides us with an incremental opportunity to serve additional customers.\n\nI'm pleased to report that after a successful pilot of our layaway program in Q1, we have rolled this program out across all of Conn's locations, and believe we are well positioned to support layaway sales in the holiday season. With this update on our near-term initiatives, I want to review our long-term growth strategies in more detail, starting with the success of our e-commerce growth plan. During the second quarter, we completed the first phase of our e-commerce platform migration, and we successfully enhanced the front end of our website, including the homepage, search capabilities, and product listing pages. It's important to note that over the course of my career I have led multiple digital transformations, and I've learned that short-term disruptions can occur even during successful implementations.\n\nI'm proud to report that our team did a wonderful job with our Phase 1 implementation, as we increased online conversion, and grew e-commerce sales by 11.5% year over year to a second quarter record of $19.3 million. Phase 2 of our e-commerce platform migration started earlier this month and is focused on improving the cart and checkout experience. The third and final phase of our platform migration is focused on functions that make it easier for our customers to apply for credit and make payments. We expect to complete the replatforming of our website this year.\n\nOnce complete, our customers will see an enhanced website with improved functionality across their online journey. As I've stated in the past, our business is supported by industry-leading next-day white glove delivery and in-house repair service capabilities. I continue to believe our established infrastructure can be the foundation for a much larger business. As part of our growth strategy, we are pursuing multiple partnership opportunities to leverage our powerful logistics capabilities.\n\nWe recently completed a major milestone in our partnership strategy with the launch of our Belk store within a store pilot. As of today's call, we have opened a total of eight Belk partner locations and expect to launch an e-commerce experience on belk.com before the holiday season. This partnership provides us with an efficient way to serve more fast and reliable customers. I look forward to updating investors on this pilot as well as other opportunities we are pursuing in the coming quarters.\n\nTo conclude my prepared remarks, we are taking the necessary actions to navigate a difficult environment that is disproportionately affecting our financial access to customers and our more discretionary product categories. These trends are expected to continue throughout the fiscal year 2023. While we remain confident in the long-term direction of our business, we are extending the timeline to achieve our previously stated financial targets beyond the fiscal year 2025. Over the near term, we are making prudent adjustments to reassess our cost structure while simultaneously investing in our growth initiatives and maintaining stable credit trends.\n\nWe believe this will allow us to successfully emerge from this difficult period stronger, and better positioned to achieve profitable growth. I am proud of the hard work and dedication of our team members. I want to thank our entire team for their commitment to our company, our customers, and our local communities.\n\nGeorge Bchara -- Chief Financial Officer\n\nThanks, Chandra. On a consolidated basis, total revenues were $346.6 million for the second quarter of the fiscal year 2023, representing a 17.1% decrease from the same period last fiscal year. For the second quarter, GAAP net income was $0.09 per diluted share compared to net income of $1.23 per diluted share for the same period last fiscal year. On a non-GAAP basis, adjusting for certain charges and credits, we reported a net income of $0.04 per diluted share for the second quarter compared to $1.22 per diluted share for the same period last fiscal year.\n\nReconciliations of GAAP to non-GAAP financial measures are available in our second quarter earnings press release that was issued this morning. Looking at our retail segment in more detail, total retail revenues for the second quarter were $279.8 million. The 19.4% year-over-year decline in retail revenue was primarily due to the trends Chandra discussed in her prepared remarks, including overlapping the benefits stimulus had on second quarter sales last fiscal year, tighter year-over-year underwriting from our lease-to-own partner, and a reduction in demand for discretionary products. We opened six stores during the second quarter, including four stores with in-store pilots in Belk locations, and ended the quarter with a total of 167 stores across 15 states.\n\nFor the fiscal year 2023, we are now planning to open 10 to 12 stand-alone locations and 15 to 20 stores within the store locations, all within existing markets, which will leverage base costs. The retail gross margin for the second quarter was 34.6%, compared to 37.7% for the same period last fiscal year. A decline of 310 basis points. Approximately one-third of this decline was due to higher freight costs in our furniture category, which we expect to improve in the coming quarters as we realize the benefit of lower freight costs.\n\nApproximately one-third of the decline was due to de-leveraging. A fixed cost is a result of lower sales and the remaining one-third was due to higher fuel and other costs. SG&A expenses in our retail segment decreased by 4%. This decrease was driven by lower variable costs on lower sales and reductions in advertising and labor costs as a result of cost savings initiatives.\n\nAs a percent of retail sales SG&A expenses were 35% for the second quarter, compared to 29.4% for the same period last fiscal year. The retail segment, operating income was $107,000 and included a $1.5 million benefit from a lease modification that occurred during the quarter, compared to the retail segment operating income of $28.7 million for the same period last fiscal year. Turning to our credit segment, finance charges and other revenues were $66.8 million for the second quarter, a 6.4% decline from the same period last fiscal year. The decline in credit segment revenue was due to a 4.9% reduction in the average balance of the customer receivable portfolio over the prior fiscal year.\n\nThe performance of our receivable portfolio remains stable. Recent trends reflect a smaller portfolio balance and normalizing credit trends as we overlap last year's stimulus programs. We believe our strong credit performance heading into this period, combined with maintaining a conservative credit underwriting approach, will help us navigate the evolving economic environment. As a percent of the portfolio, the 60-plus day past due balance was 11% on July 31, 2022, and is in line with our expectations.\n\nThis compares to 7.2% for the same period last fiscal year, which benefited from stimulus programs. The balance of reage accounts as a percent of the portfolio balance was 16.1% compared to 20.4% for the same period last fiscal year. For the second quarter annualized net charge-offs as a percent of the average portfolio, a balance was 13.7%, compared to 11.3% for the same period last fiscal year. During the second quarter of the fiscal year 2023, the credit provision for bad debts was $26.8 million, compared to $10.1 million for the same period last fiscal year.\n\nThe $16.7 million increase in credit provision for bad debt was primarily driven by a smaller year-over-year decline in the allowance for bad debts and a year-over-year increase in net charge-offs. Credit segment income before taxes was $1.1 million compared to $19.5 million for the same period last fiscal year. The reduction in credit segment income before taxes was primarily due to lower credit segment revenue, a higher provision for bad debts, and an increase in interest expense partially offset by lower SG&A expenses. Turning now to our balance sheet.\n\nOur liquidity and capital position remain strong. I am pleased with the successful ABS transaction we completed during the quarter, demonstrating our ability to access capital markets even during turbulent market conditions. We issued and sold approximately $407.7 million in aggregate principal amount of Class A and Class B notes. Due to market conditions and forecasted liquidity needs, we retained the $63.1 million Class B note but could sell this bond in the future.\n\nOn July 31, 2022, we had $531.2 million in net debt compared to $399.9 million for the same period last year. In addition, net debt as a percent of the ending portfolio balance was approximately 50.9% at the end of the second quarter, compared to approximately 36.2% at the end of the second quarter of last year and 59% on January 31, 2020, before the COVID-19 pandemic began. We continue to believe our liquidity and access to capital provide us with the flexibility to support the current needs of our business while investing in our long-term growth initiatives. Before we open the call of questions, I want to review our expectations for the remainder of the fiscal year 2023.\n\nWe now expect a low to mid-teen decline in total revenue compared to our prior expectations of a high single-digit decline for the fiscal year 2023. Our current expectations include a mid-teen decline in annual retail revenue and a high single-digit decline in the credit segment in credit revenue as our portfolio contracts due to lower retail sales financed through our in-house credit offering. We now expect the operating margin for the fiscal year to be between 1% and 2%, which reflects deleveraging on lower sales, partially offset by further cost reduction as compared to our previous guidance. We expect annual interest expense of $32 million to $37 million, which reflects the pricing from our most recent ABS transaction.\n\nGiven the pressures we've discussed, we also expect our full year tax rate to be lower as a result of our reduced profitability outlook. The changes to our guidance reflect an even more cautious outlook and a continuation of softer consumer demand, particularly for discretionary product categories and from lower-income consumers. We remain focused on managing the items we can control and we are reducing expenses to reflect our lower revenue outlook. Beyond our near-term expectations.\n\nWe are excited by the initiatives underway, including strategies to drive e-commerce growth, enhance our credit offering, and expand our value proposition to more customers, including through our partnership strategy. We believe these initiatives will improve long-term sales trends and help us achieve our long-term financial goals. However, as Chandra mentioned, we are extending the timeline to achieve our previously stated financial targets beyond the fiscal year 2025. Finally, I want to share my thanks to all our team members for their continued hard work, service, and dedication.\n\nSo with this overview, Chandra, and I are happy to take your questions. Operator, please open the call up to questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Brian Nagel with Oppenheimer. Please proceed with your question.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi, good morning. Thank you for taking my questions.\n\nGeorge Bchara -- Chief Financial Officer\n\nGood morning.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nSo I want to focus, I think first on, on the retail business, and maybe a few questions all kind of lumped together. I want to -- when you look at the trends from Q1 to Q2, and then you commented on Q3 as well, do you -- are you beginning to see, or do you think you're seeing signs of stabilization, in one tells me to recognize there are a lot of moving parts here, including the difficult comparisons? Then the second question, we've talked a lot over the last several quarters now about how the business, particularly through the pandemic, really flexed to cater to a larger consumer base. And some consumers that were not necessarily least historically shoppers of Conns. How are you seeing that we're now a point away from a pandemic, how is that dynamic playing out? Are those consumers still coming to Conns, as there is a bit more of a reversion there as well?\n\nChandra Holt -- Chief Executive Officer and President\n\nYeah. Thanks for the questions, Brian. In turn -- in terms of your first question regarding the stabilization of the business, we have seen from a dollar run rate standpoint, the business be fairly stable over Q2, and we've seen a slight worsening in Q3, as we're overlapping slightly tougher comps in Q3 than we were in 2Q. But from a general dollar run rate standpoint, we have seen stabilization in the business.\n\nWhen you look at your second question around, where are the customers going? When we look at our customers, we see a bit of a tale of two cities here. We've got our fast and reliable customers, which in Q2 declined roughly 12%, versus our financial access customer who is lower income that declined at twice the rate at 24%. So when you look at what's happening with consumers, the lower income consumers are, we're seeing worse results from that customer segment as they're facing more challenges from the effects of the macroeconomy, such as inflation, where they're having to shift out of discretionary categories to pay for their household essentials.\n\nGeorge Bchara -- Chief Financial Officer\n\nAnd to add to that, Brian, if you were to look at that on a multi-year basis going back pre-pandemic, so if you compare Q2 of that by FY '23 to Q2 of FY '20, that fast and reliable customer segment is up almost 50% compared to where it was pre-pandemic. And that's just being offset by some of the headwinds that Chandra mentioned around the lower-income consumer, which is more than offsetting that growth.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nThat's great. That's very that's very helpful. Then maybe there's a follow-up question -- I mean the third question, I guess would be, with regard to credit. So it's kind of from a perspective of kind of where we go from here.\n\nMake sure I understand this correctly. Is it the plan to you, given the backdrop to tightened credit, which could if that's the case, would represented incremental or potentially an incremental sales headwind as we think over the next few quarters or so?\n\nChandra Holt -- Chief Executive Officer and President\n\nIn terms of our credit strategy, we've been maintaining a fairly conservative credit underwriting strategy. So going forward, I don't anticipate any extreme tightening that will significantly reduce sales going forward. To date, we've been managing our credit in a way that's fairly conservative, and we don't anticipate a big shift going forward.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nGot it. Appreciate it. Thank you.\n\nGeorge Bchara -- Chief Financial Officer\n\nThanks, Brian.\n\nOperator\n\nOur next question comes from the line of Kyle Joseph with Jefferies. Please proceed with your question.\n\nKyle Joseph -- Jefferies -- Analyst\n\nHey. Good morning. Thanks for taking my questions. I know it's early on with the Belk launch, but can you give us a sense of how much you anticipate those locations contributing over time versus kind of average store?\n\nChandra Holt -- Chief Executive Officer and President\n\nSure we are excited about the opportunity that partnerships, in general, bring to our business. We're working on several partnerships right now, and as I mentioned in my comments, we had a major milestone with the opening of our initial Belk store within a store concept. Now we're early, so we just opened those stores a few weeks ago. So right now we don't have any projections to report, but we're looking forward to sharing more details in the coming quarters.\n\nKyle Joseph -- Jefferies -- Analyst\n\nOK. And then, given the evolution of the Belk and it sounds like, less reaging, kind of more conservative underwriting, but also wane macro. Can you just give us a sense of your outlook for either charge-offs or DQs and how that would compare to kind of the pre-COVID vintages we've seen Conn?\n\nChandra Holt -- Chief Executive Officer and President\n\nOverall, we feel that our portfolio is in great shape when you look at some of the portfolio health indicators pre-pandemic levels. George, if you want to hit on a couple of points in terms of delinquencies going forward?\n\nGeorge Bchara -- Chief Financial Officer\n\nYeah, what I would say Kyle is that we do expect to see, and I think Chandra mentioned this in our prepared remarks, we expect to see some pressure on credit spread, which is what I would encourage you to think about, right? As you're looking at the credit business, we expect to see some pressure on the credit spread heading into the back half of this year. And there are two things happening there. One is just you've got a shrinking portfolio balance because we're originating less Conn's credit loans. So that's the denominator of fact that that is causing -- will cause them some relatively higher charge-offs.\n\nAnd then, the other is that we continue to see normalization in credit trends, right? Our portfolio today, if you look at the average FICO it's in the book is 611 compared to where it was pre-pandemic, which is 594. So that's a big move in credit quality in the portfolio. So we feel like we're -- the portfolio is in a good place in terms of credit quality. But we continue to see, the normalization of credit trends, as I know you observed at other companies as well.\n\nKyle Joseph -- Jefferies -- Analyst\n\nYep. Absolutely. And then the last one for me. I know you pointed to kind of your financial access customers really kind of bearing the brunt of the macro pressure.\n\nBut can you [Audio gap] between the store and online? Obviously, you have decent online growth still, even despite the new platform. But just talk about how you're seeing trends online versus in-store based on the customer mix.\n\nChandra Holt -- Chief Executive Officer and President\n\nYeah. Our customer mix online and in-store is similar. The difference with online is because of the platform migration that we're doing, we're able to increase conversion at a greater rate than the demand is declining within the categories. I think the bigger thing to know in terms of what's growing and what's declining is if you combine kind of income levels with product categories, you see a large discrepancy.\n\nSo if you look at our least discretionary category of appliances and when you look at consumers who paid cash, which is generally our highest income consumer, those sales were flat year over year. Whereas if you look at consumer electronics, which is the most discretionary, and lease-to-own, which tends to be the lowest income, we were down 60% in Q2. So you see a great disparity when you combine the discretionary categories with the income level of consumers.\n\nKyle Joseph -- Jefferies -- Analyst\n\nGot it. Very helpful. Thanks for answering my question.\n\nOperator\n\n[Audio gap] For our question [Inaudible] Vincent Caintic with Stephens, Inc. Please proceed with your question.\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nThanks for answering [Inaudible]. The first one is a kind of broad strategic question. To understand the difficult macro [Inaudible]. But then from the discussion, today also sounds like you still remain very optimistic about the opportunities in your markets.\n\nAnd so I'm wondering, kind of the costs and the capex shift to the strategies that maybe is at a long term shift or maybe something that's just kind of timing for this year. And then, when you talk about your costs and your capex, how quickly can you pivot and flex that in the sense of if there are opportunities that show up later this year, or into next year, how quickly could you move? Thank you.\n\nChandra Holt -- Chief Executive Officer and President\n\nYeah. Thanks for your question, Vincent. So we remain very confident in our long-term strategy. Right now, though, we're focused on the near term and making sure that we're operating effectively in the challenging macro environment.\n\nSome of the capital expenditures that we've pulled back on our new stores, distribution centers, and things of that nature. In terms of flexibility, while it does take time to commit to leases and things of that nature, we can, go back and invest additional capital if the macro environment and the overall operating environment becomes easier next year.\n\nGeorge Bchara -- Chief Financial Officer\n\nI would just add, Vincent, that the year has materialized very differently from the way we expected it to materialize at the beginning of the year. So what you're seeing around our actions, around cost and capital are directly responsive to the current environment that we're in relative to where we expected to be at the beginning of the year. And so it's certainly, we're cutting costs to reflect a lower revenue picture.\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nOK. Understood. It sounds like the long-term strategy is still intact. It's just kind of a reaction to the --\n\nGeorge Bchara -- Chief Financial Officer\n\nYes.\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nFor the environment.\n\nChandra Holt -- Chief Executive Officer and President\n\nYeah. And in fact, we prefer that we continue to invest in some of our bigger initiatives. So the e-commerce platform migration is still well underway and we expect to finalize that by the end of the year. We acquired a lease-to-own platform, and we continue to work on that.\n\nAnd expect to underwrite our first lease-to-own -- in-house, lease-to-own transaction by the end of this year. And working on a number of other smaller initiatives that we continue to push forward to make sure that we're driving the business in the most effective way possible.\n\nGeorge Bchara -- Chief Financial Officer\n\nAnd even in spite of that, we're still opening 10 to 12 stores this year. We expect to continue to grow the footprint again next year. Many of the leases that we -- or the stores that we would open next year, we've already signed leases for. So we're still growing the business.\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nOK. Perfect. That's very helpful. Thank you.\n\nAnd relatedly, the second question, on the lease-to-own, so in the press release, the comments about some of the sales being impacted from tightening lease-to-own on some of your partners. I'm just wondering if you could talk about if you had already stood up your own in-house lease-to-own business, where would we be in sales? Because I'm just trying to kind of think about a run rate being better than maybe where it was this quarter. Thank you.\n\nChandra Holt -- Chief Executive Officer and President\n\nYeah, well, that's a great question. When we stand up our lease-to-own business, our plan is to have higher approval rates than a third-party partner, which is part of the upside that we'll get from taking the lease-to-own in-house. The other benefit to taking lease-to-own in-house is the long-term profitability that will have on the business over a multi-year period.\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nOK. Perfect. Thanks very much.\n\nOperator\n\nThere are no further questions. I'd like to hand the call back to management for closing remarks.\n\nChandra Holt -- Chief Executive Officer and President\n\nThank you. I want to take a moment to thank our employees for their hard work and dedication, and thank our investors for their time and following Conns, and interest in Conns. And I look forward to updating everyone next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChandra Holt -- Chief Executive Officer and President\n\nGeorge Bchara -- Chief Financial Officer\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nKyle Joseph -- Jefferies -- Analyst\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nMore CONN analysis\n\nAll earnings call transcripts"
}