{
  "companyName": "Super Group (SGHC) Limited",
  "companyTicker": "SGHC",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/super-group-sghc-limited-sghc-q2-2022-earnings-cal/",
  "content": "Super Group (SGHC) Limited (SGHC 6.01%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning and welcome to Super Group's second quarter of 2022 earnings conference call. Following management's prepared remarks, we will open the call [Audio gap]\n\nLisa Kampf -- Vice President, Investor Relations\n\nEveryone, and thank you for joining our call today to discuss Super Group's results for the second quarter of 2022 and outlook for the year. During this call, we may make comments of a forward-looking nature that are subject to risks, uncertainties, and other factors discussed further in our SEC filings that could cause our actual results to differ materially from our historical results or from our forecast. We see no responsibility to update forward-looking statements other than as required by law. Additionally, on today's call, we may refer to certain non-GAAP financial measure.\n\nThese non-GAAP financial measures are in addition to and not a substitute for measures of financial performance prepared in accordance with GAAP. The reconciliation of historical non-GAAP financial measures to the most comparable GAAP figures are included in the press release issued earlier today and available on the Investor Relations page of Super Group's websites. Also, please note that we have posted a supplemental presentation to the Investor Relations section of our company website, along with the press release, the link to the replay of this webcast, and filings with the SEC. The presentation includes the financial information that will be referred to during this call.\n\nToday, I'm joined with Neal Menashe, chief executive officer; and Alinda Van Wyk, chief financial officer. After our prepared remarks, we will open the call up for questions, and we will also be joined by Richard Hasson, president and chief operating officer. And now I would like to turn the call over to Neal.\n\nNeal Menashe -- Chief Executive Officer\n\nThank you, Lisa. Good morning, everyone, and thank you for joining us today. Super Group is and continues to be uniquely positioned to take full advantage of the projected growth in the global online betting and gaming market, a sector expected to exceed $140 billion by 2025. Our Betway and Spin brand enjoy worldwide reach and recognition.\n\nAnd we are actively working on a number of geographic opportunities that will allow us to deliver future growth. And most importantly, our business is diversified, profitable, and highly cash generative. This quarter, we again demonstrated the benefits of our global model and recently formed a holding company structure, which with good progress made in a number of areas. We grew average monthly active customers to 2.7 million, up 3% from the second quarter of 2021.\n\nWe saw good growth in key markets such as Africa and Asia Pacific. Our sports betting continued to deliver positive growth. We kept a smooth Ontario license process with the transition of Betway into the regulated regime with Spin to follow next week. And we have progressed the U.S.\n\nstate per state licensing of Super Group that is a prerequisite for the acquisition of Digital Gaming Corporation, DGC. Our results of this quarter of net gaming revenue of EUR 316 million and adjusted EBITDA of EBITDA 54 million and for the half year of net gaming revenue of EUR 631 million and adjusted EBITDA of EUR 117 million remain resilient despite the impact of the normalization of entertainment spending patterns post-COVID and the current headwind effects of general economic uncertainty on discretionary spending. We expect that these effects will continue to be felt for the remainder of the year and have updated our guidance accordingly. Alinda will discuss both our results and our guidance in more detail shortly but I want to emphasize two things first.\n\nOne, I believe that our year-on-year results do not properly reflect our treatment over the last 12 months. Our continued progress across the globe is better reflected by growing global tabs on loan growth in active customer numbers. Two, ongoing regulatory change post-COVID normalization will ultimately benefit Super Group because we have an efficient cost structure and only -- over 20 years track record of trading profitably through thick and thin. Importantly, our control over marketing, our products, and our operating costs gives us a number of levers to optimize them.\n\nHere is what we are doing. First, efficient brand spend to maintain global awareness. We will continue to optimize our portfolio of over 60 worldwide partnerships by focusing on profit. Second, we will enter new markets and expand in existing markets, particularly where regulatory changes provide opportunity.\n\nIn the absence of the cost attractive ROI, we will reduce or delay spending. Third, over the next 18 months, as we extract cost efficiencies arising from the formation of the holding company with significant savings to be delivered in 2023. Turning now to some specific market-related updates. In Canada, we are pleased to report the smooth transition last week of Betway from Ontario-regulated environment and we expect Spin to migrate next week.\n\nGiven the regulatory restrictions of public advertising of bonuses in Ontario, we don't expect to see the same level of unsustainable price competition that happened in the United States. We remain confident from past experience that regulation will be favorable for us in the medium and long run, and we hope to see regulation introduced to Canada's other provinces in due course. In the meantime, we will continue to trade as before, and we expect that Canada will continue to underpin our 20-year track record of consistent profitability and cash generation. Some of our historically key Western European markets continue to be on hold.\n\nWe are still awaiting license in the Netherlands in anticipation of launch, and we have not yet concluded the assessment of ongoing viability of casino gaming in Germany post the new regulation. In the United States, our goal of completing the acquisition of DGC remains at the end of this year but is, of course, subject to various regulatory timelines. To recap, DGC is a brand licensee of Betway, currently live in seven states and with secured market access in up to 12. DGC will be tremendous addition to Super Group and the fastest and most efficient way for us to enter the U.S.\n\nWe look forward to completing the regulatory approvals and having DGC become part of Super Group as soon as possible. Moving on to the balance sheet. Consistent cash generation built a strong balance sheet that is an asset to Super Group. For cash on hand, we are considering various opportunities, including investing in brand and other marketing channels to generate profitable long-term growth, M&A for expansion to new and existing markets or the acquisition of useful skills or technology.\n\nDGC is a good example of this, and returning cash to shareholders. Under returning cash, in our first annual general meeting in September, we'll offer the authorization to buy back share. This is a typical and standard step for the company and we want that authorization to be able to act if it's in the country's best -- company's best interest. However, we are paying close attention to the notes closed and any use of this authorization would keep that in mind.\n\nIn conclusion, let me sum it up for you. We believe that online gaming businesses are resilient, but they are not immune to macroeconomic pressures. What Super Group has is a global footprint and a competitive cost structure that we intend to keep and improve. We are experiencing these pressures, but our underlying business is healthy and we continue and will continue to grow over time.\n\nOur balance sheet remains strong, our business fundamentals are sound, and we'll stay focused on long-term opportunities around the world. Thank you. I'll now turn the call over to Alinda for a detailed discussion of our financial results. Alinda?\n\nAlinda Van Wyk -- Chief Financial Officer\n\nThank you, Neal. As you are well aware, 2022 has been a difficult year for many industries, including the global digital gaming industry. With changes in consumer behavior driven by economic uncertainty, revenue growth has slowed down. In the second quarter, Super Group's net gaming revenue was EUR 316 million, down 7% versus the prior year quarter.\n\nHowever, on a consistent basis, excluding European markets that were closed for us this year due to regulatory changes, net gaming revenue in the second quarter had decreased by 5%. Looking at the first half of this year, Super Group's net gaming revenue is down by only 1% from 2021 to EUR 631 million. Back to the positive results. We also experienced a shift in revenue mix.\n\nIn quarter 2 2021, our net gaming revenue was split 50-50 between Betway and Spin. This year during the second quarter, Betway grew to 55% against Spin's 45% and sports betting grew while casino gaming declined. This shift in revenue mix negatively impacts our EBITDA margin owing to Betway's lower operating margin as compared to Spin. Starting with our Sportsbook revenue.\n\nCompared to Q2 last year, Sportsbook revenue increased by 6 million or 6%, mainly due to good growth in key markets in Africa and outback regions. Despite being partially offset by declines in Europe and Canada, growth in sports betting net gaming revenue from Africa and outback markets represent positive momentum resulting from continued good growth on the customer base and retention rates in some of the few markets where it would appear that the COVID lockdowns had relatively limited impact. The growth in APAC impact was also due to the full IPL season during 2022 after the cancellation of the IPL season in 2021 due to COVID. The decline in Europe was mostly due to regulatory changes in Germany and Netherlands and fewer sports offerings in 2022, in particular with limited soccer in June this year.\n\nOn that note, the English Premier League and France Ligue 1 kicked off again last weekend and we are seeing an encouraging increase in activity. We look forward to other major European leagues starting this weekend. In conjunction with our EPL brand partnerships as the home of 380 games, will feature some of Betway's branding, including our sponsorship of Wisdom. Other upcoming events include the T20 Cricket World Cup in October-November, followed by the FIFA Soccer World Cup in November and December.\n\nMoving over to casino. Casino gaming revenue decreased by 29 million or 12%, compared with the same quarter in 2021, of which EUR 4 million can be attributed to the closure of Netherlands with the remainder primarily due to the decline in iGaming revenue in Canada. We believe that the decline in Canada is due to a combination of two things. People are getting back to normal behaviors post-COVID and inflation is putting pressure on spending.\n\nSimilar factors can be seen in several of our markets across the globe, but the impact is felt most in Canada as that is our largest market. Despite all of this, our total average monthly active customers increased over 3% to 2.7 million, compared to 2.6 million in the prior year quarter. Super Group is well on its way to achieving a diverse mass market business. Onto EBITDA.\n\nWe continue to present adjusted EBITDA, which is EBITDA adjusted for fair value adjustments on warrants and earnout liability, associated foreign exchange movements, and non-recurring expenses. On that basis, adjusted EBITDA for the second quarter was down 36% or 30 million to 54 million, compared to 84 million in the prior year period. Looking at the half year, adjusted EBITDA for the six month period was 117 million, a decrease of only 21% from 2021. This quarter, the steeper decline in EBITDA compared to the decline in net gaming revenue resulted from several factors.\n\nBrand licensing revenue declined by EUR 12 million in the second quarter of 2022. On the expense side, variable or direct expenses decreased by 2% as compared to prior year quarter. Gaming taxes and product costs fell in line with revenue, but this was offset by an increase in payment processing and related foreign exchange cost due to growth in markets with those costs structurally higher. Super Group's marketing costs went down by 7 million or 8% on a net basis.\n\nA reduction of our variable marketing was offset by continued marketing investments in partnership deals for long-term brand and revenue growth. General and administrative costs, which is largely fixed in nature, increased by 6 million or 10%. Reason for this increase include nominal annual salary increases, increased technology and infrastructure costs, and the cost of additional corporate governance requirements following our public listing back in January. Looking at our financial position, our balance sheet remains strong with unrestricted cash and cash equivalents of EUR 220 million at the end of June with no debt.\n\nOur cash flow ratio for the year so far is 74%. Onto our guidance. In addition to revising our guidance, to take into account the current conditions, we will be reporting revenue as opposed to net gaming revenue going forward. This is because the structure in Ontario as well as certain other jurisdictions as a company like Super Group operating as an agent of the authorities or the license holders.\n\nWhat that means in simple terms is that our reported revenue will include net gaming revenue in some jurisdictions, agency revenue net of fees in other jurisdictions, and other revenue such as brand license income. Back to the numbers. For the full year, we project revenue for 2022 under the new definition to range between EUR 1.15 billion and EUR 1.28 billion and adjusted EBITDA to range between EUR 200 million and EUR 250 million. For the EBITDA bridge to the original guidance, please refer to the presentation on the website.\n\nI want to emphasize that our new revenue projection is not a pure NGR because of the change you just mentioned. However, NGR still remains at our core. Some of the material assumptions underpinning our revised guidance. Sorry.\n\nI'm just going to go back to the numbers. I just want to reiterate the guidance. The definition for guidance has changed to revenue, as noted. The net gaming revenue -- the revenue guidance will be between EUR 1.15 billion and EUR 1.28 billion and adjusted EBITDA to range between EUR 200 million and EUR 215 million.\n\nSome of the material assumptions underpinning our revised guidance. Firstly, projected revenue has been reduced from prior guidance after taking into consideration expected ongoing pressures from multiple economic and regulatory headwinds, together with some further degree of post-COVID normalization. Brand license revenue for the remainder of 2022 is expected to remain lower at approximately EUR 2 million per month. Brand marketing being kept at the levels consistent with our earlier forecast because our focus on investing remains for the long term.\n\nAnd finally, operating cost is expected to be higher in 2022 due to inflation and additional costs of being a public company. The net effect is that we expect EBITDA margin to be approximately 17% to 19%. This is not the margin that we consider acceptable in the long term and we are actively reviewing and carefully optimizing all of our costs while working to extract the benefit of the holding company structure that we implemented in connection with becoming a public company just over six months ago. We expect some of the benefits from this to accrue this year, but meaningful impact will be noticed in 2023 when we expect to realize EUR 20 million to EUR 25 million decrease in annual overhead costs due to efficiencies.\n\nI also want to briefly touch on our projections. We received some entirely justified critical feedback following our withdrawal of estimates, coupled with a lack of specific details in this time of our call last quarter. We run our global business with a long-term mindset. Making and then possibly adjusting projections in the short term is sometimes something that is new to us, and we have taken steps to improve our ability and comfort in providing more transparency while still protecting our competitive interests.\n\nIn conclusion, results for the second quarter of 2022 are evidence of the difficulties of dealing with regulatory changes, post-COVID normalization, and economic uncertainties. We are focused on implementing a leaner cost structure, carefully balanced against future growth prospects in order to preserve our financial strength as we seek to continue to expand our global footprint and drive existing revenues ever possible, regardless of our challenges. I will now turn the call back to Neal for his final remarks.\n\nNeal Menashe -- Chief Executive Officer\n\nThank you, Alinda. In summary, we generated a healthy level of revenue and EBITDA for the quarter and we remain uniquely positioned in the global online gaming universe. We are digital only. We have a diverse global footprint across sports betting and iGaming.\n\nWe are in control of our tech stack, our data, and our algorithms. We are profitable, debt free, and highly cash generative. And we have a team that's been weathering these types of challenges for over two decades. Some of these challenges may be around for a few quarters, but Super Group is a strong company with a healthy balance sheet and we will continue to go after profitable growth.\n\nThank you. I'll now turn the call over to operator to open the call up for questions.\n\nOperator\n\nThank you. At this time, we will be conducting our question-and-answer session. Also joining the management team today for question-and-answer is Richard Hasson, president and chief operating officer of Super Group. [Operator instructions] Our first question comes from the line of Jason Tilchen with Canaccord Genuity.\n\nPlease go ahead.\n\nJason Tilchen -- Canaccord Genuity -- Analyst\n\nYeah. Good morning. Thanks for taking the question. I just wanted to focus on Canada a bit.\n\nYou mentioned both inflationary pressures and sort of normalizing behavior compared to the COVID impact from last year for the declines there. I'm just wondering if the read through there is that competition from sort of more operators in the market was not a factor there or just less of a factor. And maybe you can just as a follow up, also touch on the delay in the licensing for Spin and whether last quarter you talked about you're still able to operate in as you were previously with regulator knowledge. I'm wondering if that took place throughout the entire period from last quarter to now or if there's any change to that.\n\nThanks. Thanks a lot.\n\nNeal Menashe -- Chief Executive Officer\n\nOK. So I'll take that. So yes, with Canada, as with all other markets, we operate in, there is competition. There's competition in all our markets.\n\nSo for us is Canada is we're the same company as we were a year ago. Canada is all about, obviously, gaming now regulated in Ontario with Betway went last week and then Spin going next week. So up to now they've been operating on the old software and they've now moved over. And Betway in the last seven to eight days is in line with our expectations.\n\nSo Spin's going next week. So we've learned a lot from Betway and then we can implement that into Spin.\n\nOperator\n\nThank you. Question comes from the line of Bernie McTernan with Needham and Co. Please go ahead.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thank you for taking the questions. Maybe to start, if you could talk about the 20 million to 25 million of cost reductions. Just to be clear on the timing, are those all happening in '22? So you'll receive the full benefit in 2030? And then given the cost reductions, is 25% EBITDA margin something that's achievable in '23?\n\nAlinda Van Wyk -- Chief Financial Officer\n\nThanks, Bernie. Alinda here. We started the process and we've -- it was a continuous process anyway since our listing to look at our cost base. In my presentation, I make references.\n\n2022 is where we really started to focus. We will see it in the last quarter coming to fruition. But the impact of the 20 million to 25 million is in 2023 and that will obviously be visible on the margin. And to your question regarding the 25% margin, I mean, obviously, like I said, the 17% to 19% margin is not where we would like to be.\n\nWe're aiming for 20% and continuous growth in that margin by getting all our ratios back intact with a focus on our top-line growth.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nUnderstood and would just love some commentary in terms of what you're seeing from the customer LTVs and -- because of the macro? And what -- in the COVID comparisons, whether it's players turning off altogether, whether people are playing less and engaging less, if it's smaller bet size, less handle. We just like to see what's actually happening underneath the hood.\n\nNeal Menashe -- Chief Executive Officer\n\nFirst of all, listen, it's across the globe. Because we're global, it's not just one country, it's across the globe. So you see different effects in different markets. But definitely from our point of view is it's just that the discretionary spend of our customer is has come down.\n\nBut in other markets, they -- we've got more customers so maybe their spend is slightly down but then we are -- they are spending more over time with us because we've got more customers. So it's definitely a macroeconomic headwind but that's why I said it's -- as this levels out, then -- and post-COVID, we are being [Inaudible]. As I say, we still got 2.7 million users using our software and that's going up.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Mike Hickey with The Benchmark Company. Please go ahead.\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nHey, Neal, Richard, Alinda. Thanks, guys. Good morning or afternoon, wherever you guys are. [Inaudible]\n\nNeal Menashe -- Chief Executive Officer\n\nThank you.\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nThe -- I guess just to double click on the macro again. It seemed like the online casino player was historically been fairly resilient in times of sort of economic distress. And while we have inflation, we also have strong employment. And of course, you're global and I'm looking from a U.S.\n\nlens. So I guess if we could again, I guess sort of understand why it's different this time. And I think you mentioned that perhaps your sports betting client was doing better than your gaming. I think I heard that.\n\nI'm just curious if that's true and why that is.\n\nNeal Menashe -- Chief Executive Officer\n\nSo first of all, gaming's not immune, right. It's resilient but again, we've never seen inflation like this in 40 to 50 years. In our now 20 years, we haven't seen it yet. We've seen downturns in 2008 with financial crisis, but not something that's affected our customer's discretionary spend.\n\nSo -- but because we're global, different markets and including sports have different customer values, etc. But from our point of view, again, it's about what's happening in each of these countries, each of these markets, and how and how the customers are engaging on our platform.\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nFair enough. Inflation's brutal. I agree with you. I guess so.\n\nWhen your players are strained, I mean, how do you adjust your playbook or your app to sort of account for that weakness? I mean, how does that sort of change your whole target? How does that change your promotional activity? What adjustments have you made or do you plan to make for a player that is dealing with macro issues that could extend for another six to 18 months? Then I guess that becomes to your customer accounts again. And it's having more customers spending slightly less but in different markets they are different player. There are baskets, etc., for that. So from our point of view, remember, this business is a mass market business.\n\nThis is not a business of high valued customers. This is a business across the spectrum. So it's about the numbers of customers and your software being able to be superior in those markets and giving them the customer entertainment experience that they want and offering them the right casino games that they like it. But if it's lower bet size games.\n\nAnd remember, our algorithms and everything that we do is based on the -- is individualized to the customers. And then same with sports betting, it's offering them all the different sports events that they would like to bet on. And that's why we're saying when you've got lots of these competitions, for example, last year, this in June, last year we had the euro and now we didn't have the World Cup this year, but the World Cup is coming in November and December. So when you compare this June to last June, it isn't a fair comparison.\n\nSo all of that helps with when bringing the customers into the software and then they'll play better.\n\nOK. Fair enough. The last question for me is on the U.S. market.\n\nI'm sorry if I missed this. Are you -- just sort of the timeline, I guess, on DGC. It seems like it's been hanging out there for a while. Curious -- sorry again, Neal, you mentioned this, but just where you are in closing that transaction.\n\nAnd then maybe just reexamine, given everything that's changed so fast in terms of the macro conditions, how you're thinking about entering the U.S. market today versus six months or a year ago, and how you think about the impact to your '23 numbers. I think, Alinda, originally you're saying it was sort of a these are my numbers. Maybe it was 8 million to 13 million in annual negative adjusted EBITDA impact.\n\nJust curious if that's still the same range you're thinking and if your intent or your playbook or design of going to the U.S. market is the same given all the volatility. Thanks, guys.\n\nRichard Hasson -- President and Chief Operating Officer\n\nHi, there. Richard here. So the closing of the DGC acquisition is still on track for our target, our goal of having that done by the end of the year. As you mentioned before, there are a number of licenses that Super Group needs to be granted before that time.\n\nSo we're obviously working to the timelines of the regulators in those various states. So that remains our goal. In terms of the U.S., our plan remains very much the same. The -- in terms of the 2023 targets, in terms of the 2023 numbers, we expect the range of impact to EBITDA assuming that DGC is within the Super Group for the whole year to be between EUR 50 million and EUR 70 million with our target break even for the end of 2024, beginning of 2025.\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nThank you, guys.\n\nOperator\n\nThank you. Our next question comes from the line of Jed Kelly with Oppenheimer. Please go ahead.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nHey. Great. Thanks for taking my question. Just two, if I may.\n\nCircling back to the macro, can you talk about what regions you're sort of seeing impacting that due to the higher dollar? Because just trying to reconcile with what you're seeing. I know you're global versus what we heard last week from some of the North American operators where they're not seeing an impact and you also heard that in travel as well, particularly Europe and travel in Europe is stronger. So are you seeing more of an impact in APAC and Africa? And then just on the change in the revenue, can you talk about like is that a benefit or can you talk about how that that impacts the financials and the growth rates? Thank you.\n\nNeal Menashe -- Chief Executive Officer\n\nOK. So I'll just say because we -- we're the same company as we always have been. So because we're in the global marketplace across the world, of course, we have currency fluctuations but coming out of Africa, APAC, etc., right. So from us, those currencies are always swinging against the dollar's or the euro's, right.\n\nSo that, we've had anyway and we continue to grow the revenues in those markets despite -- even if it is offset slightly by some currency losses in those markets. But that's the global nature of Super Group and from that point of view. So for us is yes, and we -- I can't comment on our competitors. But remember, we are not in the U.S.\n\nWe are across the world. So we have global factors across the world in the market that we operate in.\n\nAlinda Van Wyk -- Chief Financial Officer\n\nAnd then just on your question regarding the guidance for revenue, we -- the guidance is high quality revenue. I'm being very precise in the reforecast because to make sure that it's a strong, achievable target for all our businesses and to make sure that it's the high quality revenue that comes through and that our teams are very focused on are now achieving for the remainder of the year.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nAnd then it seems that you're going -- you're getting live in Ontario this week. Is there a margin drag or anything we should be thinking about from paying like a higher tax rate or anything now that you're going to be, I guess, on the legalized or not legalized, but regulated -- you'll be a regulated operator in Ontario. How should we think about that in the back half on the margins?\n\nAlinda Van Wyk -- Chief Financial Officer\n\nYeah. So it -- I mean, like previously stated as well, the initial introduction into the regulatory environment is always a bit of an impact on the margin, but we've got all systems in place to make sure that margin is recovered toward the end of the year with the most important impact is that even though you've got -- I referred to it as agency fee, which is the tax that you're implying about, the most important thing is that we that we -- that the costs associated is -- should theoretically come down as well, like better processing capabilities so your variable cost is in line then will be reduced. But also, our cost base is intact for that Ontario transfer and to make sure that our margins for Ontario is as per expectation of our guidance.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nGot it. And then just one more for me. Just as we look out to next year sort of the countries the Netherlands, Germany, where you're having the regulatory headwinds, I mean, do you expect to be operating in those countries next year? And can that actually become a tailwind or how should we think about that? Thank you.\n\nNeal Menashe -- Chief Executive Officer\n\nNo. Well, Germany, we're still operating in Germany. So just there's no casino in Germany but Netherlands, we're still working with the regulator but it's not in any of our guidance for 2022.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nWhat about what about '23 would you be expected to be operating there?\n\nNeal Menashe -- Chief Executive Officer\n\nYeah, yeah. So Germany, yes. And then Netherlands, we have said it all depends on the regulators in that market.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nOK. So that would be an additional market you're live in for next year.\n\nNeal Menashe -- Chief Executive Officer\n\nYeah, yeah, yeah. But Germany, we're currently live with now. We just don't have iCasino. So it depends on the iCasino and the taxes that they want in Germany will then depend if it's feasible for us to do iCasino, iGaming in Germany.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLisa Kampf -- Vice President, Investor Relations\n\nNeal Menashe -- Chief Executive Officer\n\nAlinda Van Wyk -- Chief Financial Officer\n\nJason Tilchen -- Canaccord Genuity -- Analyst\n\nBernie McTernan -- Needham and Company -- Analyst\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nRichard Hasson -- President and Chief Operating Officer\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nMore SGHC analysis\n\nAll earnings call transcripts"
}