{
  "companyName": "TFF Pharmaceuticals, Inc.",
  "companyTicker": "TFFP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/tff-pharmaceuticals-inc-tffp-q2-2022-earnings-call/",
  "content": "TFF Pharmaceuticals, Inc. (TFFP 25.00%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the TFF Pharmaceuticals second quarter 2022 earnings conference call. As a reminder, all participants are in listen-only mode and the conference is being recorded. After the presentation, there will be an opportunity to ask questions. [Operator instructions] I would now like to turn the conference over to Corey Davis from LifeSci Advisors.\n\nPlease go ahead.\n\nCorey Davis -- Investor Relations\n\nThank you, operator. Hello, everyone, and welcome to TFF Pharmaceuticals second quarter financial and business results conference call. With me on the line today is Glenn Mattes, president and CEO of TFF; Kirk Coleman, chief financial officer; Dr. Dale Christensen, TFF's director of clinical development; Dr.\n\nBill Williams of the University of Texas at Austin; and Chris Cano, TFF's chief operating officer. The press release announcing our second quarter results is available on the TFF Pharmaceuticals website. Please take a moment to read the disclaimer about forward-looking statements in the release. The earnings release and this teleconference both include forward-looking statements, and these forward-looking statements are subject to known and unknown risks and uncertainties that may cause actual results to differ materially from the statements made.\n\nFactors that could cause actual results to differ are described in the disclaimer and in our filings with the U.S. Securities and Exchange Commission, including the Risk Factors section of our 2022 quarterly report on Form 10-Q filed with the SEC. And now, it's my pleasure to turn the call over to Mr. Glenn Mattes.\n\nGo ahead, Glenn.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nThank you, Corey. Good afternoon, and thank you for joining us today to review TFF's second quarter operations and recent highlights. During this call, I will provide an update on our overall financial progress, then ask our chief financial officer, Kirk Coleman, to review our second quarter financials. We appreciate all of the positive feedback from many of you on the format we used in our first quarter call.\n\nSo we will take a similar approach today, Kirk and I will provide the formal commentary and then open up the call for questions to the entire team. Please note that we are joined by Bill Williams, Dale Christensen and Chris Cano, who will be available for the Q&A. The second quarter was another period of significant progress for the company. It is important to take a few minutes to focus on our Thin Film Freezing technology and how much we continue to learn about its potential.\n\nAs we have discussed, TFF continues to increase the number of productive partnerships with pharma companies, academic institutions and the government. I am happy to say that the number of open material transfer agreements grew significantly in the second quarter, and we added three additional top 20 pharma companies through our portfolio of active collaborations. As we continue to advance these engagements beyond the initial formulation stage into advanced in vitro or animal testing, stability and production stages, the new data continues to support why we are so enthusiastic about the creation of shareholder value. There is absolutely no question that the growing demand for our technology reflects the versatility of Thin Film Freezing.\n\nWe continue to successfully conduct numerous new feasibility studies across a broad range of experimental and approved drugs with an ever-increasing focus on biologics and complex macro molecules. These include monoclonal antibodies, fusion proteins, mRNA, bacteriophages, siRNA, peptides and peptoids, in addition to small molecules and others. The work we're doing in the vaccine space is particularly exciting and continues to expand. You have no doubt seen the recent news about the need to develop vaccines that can be administered directly to the nasal mucosa and the lung.\n\nI've always said that a major opportunity for the TFF technology is in the second- and third-generation vaccines. The TFF technology is uniquely positioned to enable this to happen. These vaccines are not limited to providing alternatives for COVID-19 vaccines. We are doing work in flu and many other types of infections, including viral, bacterial and fungal.\n\nLet me take a few minutes to remind everyone about the specific advantages of Thin Film Freezing and why it is highly differentiated over other technologies. Dr. Bill Williams, co-inventor of Thin Film Freezing, recently published an article in BioPharm International titled, Improved Formulations to Enable Stable Delivery of Biologics. The article provides a concise summary explaining the unique advantages of Thin Film Freezing of our other dry powder technologies, including freeze drying processes, differences that largely account for our success in forging partnerships at every level of the industry, academia and government.\n\nMany of these statements of work start with a comparison of Thin Film Freezing to other dry powder technologies. It's essential that a manufacturing process has not changed the molecular structure or properties of a drug, so this therapeutic activity is maintained, and that is particularly true in creating a dry powder formulation for biologics. As noted in Dr. Williams review article, conventional dry powder formulation techniques such as shelf freeze drying, spray freeze drying and spray drying are not well suitable for many biologics due to their tendency to result in the protein clumping into larger or inactive structures, a process that's known as aggregation.\n\nIn addition, many biologics are quite fragile and cannot withstand the harsh impact of sheer and stress. Aggregation can negatively impact the activity of the biologic. By contrast, Thin Film Freezing results in particles, which are highly porous with a large surface area and low-density, attributes that help reduce the tendency toward aggregation and ensure optimal bioactivity of the molecule. In addition to avoiding aggregation, Thin Film Freezing also doesn't rely on elevated temperatures during the drying process.\n\nThat is a stark contrast to other dry powder techniques such as spray drying, which require high temperatures in the drying process. This can lead to denaturation of the biologic and does negatively impact the molecules activity. The BioPharma article further notes Thin Film Freezing's applicability in developing novel vaccine formulations, including positive results with mRNA-based vaccines. Our work with materials and specific compounds supplied by our partners show that after withstanding repeated freezing and falling of a dry powder vaccine containing aluminum salts, the Thin Film Freezing vaccine does not show aggregation following a reconstitution.\n\nImportantly, the formulation also maintains drug activity after high temperature storage with immunogenicity of the dry powder vaccine preserved to temperatures as high as 40 degrees Celsius or 104 degrees Fahrenheit. So if the approach to immunization for COVID-19 continues to produce vaccines reliant on cold chain distribution and storage, it is clear that by demonstrating these results, we believe that TFF Thin Film Freezing technology will enable manufacturers to overcome this significant hurdle. The other day, I read that COVID-19 vaccine manufacturers had to destroy over $1 billion worth of product, which underscores the need to solve cold chain supply challenges. At this point in the call, you may be wondering why I'm reviewing these new data.\n\nMy purpose is to answer the many questions I get about what work we are doing with partners as we move toward finalizing agreements. And to help let you all know why we're so very optimistic about the positive direction of the business. A bit more new data before reviewing our business progress. As I touched on earlier, many of our partners are evaluating Thin Film Freezing to improve other vaccine formulations for powder delivery to the lung or nasal mucosa.\n\nThese include those formulations containing the well-known MF59 adjuvant. By way of brief background, MF59 is a liposomal-based adjuvant that enhances the patient's immune response to a vaccine through localized upregulation of cytokines, chemokines and promoting the recruitment of venous immune cells. First approved back in 1997, MF59 is commonly used in pandemic or seasonal flu vaccines. It is generally recognized as having an excellent safety profile and is now licensed in more than 30 countries.\n\nHowever, vaccines containing MF59 must be stored at refrigerated temperatures and are sensitive to accidental slow freeze conditions. Dr. Williams and his team at the University of Texas at Austin, just published another paper in the International Journal of Pharmaceutics, demonstrating that vaccines containing MF59 or AddaVax, which is a preclinical nanoemulsion that has the same composition and droplet size as MF59 can be converted to dry powder form by Thin Film Freezing. By contrast, the research showed that subjecting the same AddaVax composition, the shelf freeze drying led to significant aggregation or fusion of the droplets and the aggregation fusion was mainly due to the slow freezing required by conventional shelf freeze drying.\n\nThin Film Freezing avoids this step and therefore, is much less likely to cause aggregation. Thin Film Freezing also continues to show significant potential for nasal delivery, which, again, will have significant relevance for the mandated future vaccine development. Intranasal vaccination using vaccine dry powders and attractive noninvasive modality with better storage stability and added protection at the mucosal services. Thin Film Freezing has proven viable in enabling the production of dry powders of a larger variety of vaccines, adjuvanted or not adjuvanted, protein-based or nucleic acid-based, for example, the mRNA vaccines and DNA vaccines, as well as live attenuated virus-based and the vaccine powders have desirable properties for intranasal administration.\n\nOne last example, data from Dr. Williams Labs of a recent preclinical study in a rat model using partners material show that it is feasible to induce specific mucosal and systemic antibody responses following intranasal administration of a thin film freeze-dried vaccine candidate. The dry powder was prepared by Thin Film Freezing of a model antigen absorbed on aluminum oxy-hydroxide as an adjuvant. This further demonstrated the ability of the technology to work in a variety of adjuvanted vaccines.\n\nSpecial emphasis was placed on the characterization of the dry powder vaccine formulation that can be realistically used in humans with an intranasal dry powder delivery device. The TFF vaccine powder was found to have good aerosol properties and the vaccine was uniformly distributed within the dry powder. An in vitro nasal deposition study using a 3D printed human nose model showed that around 90% of the vaccine powder was deposited in the nasal cavity. Intranasal immunization in animal studies with the TFF powder vaccine elicited a specific serum-antibody response, as well as a specific IgA response in the nose and lung secretions of the animals.\n\nThus, intranasally administered dry powder made by Thin Film Freezing or vaccines has been confirmed. I repeat, it has been confirmed. Indeed, one additional publication from Dr. Williams Group and the TFF collaborators he worked with, recently received second place for the Best Paper Award 2022 by the Journal of Pharmaceutics.\n\nIn this paper, our team described the formulation of remdesivir and an active analog. I will stop here and say that I can share additional successful data we are producing and working with our partners. Thanks to Bill Williams and the entire team. TFF Pharmaceuticals has become a key partner for pharma and biotech companies evaluating dry powder formulations.\n\nBut our superior technology is only a starting point and a long line of value creation that ultimately leads to medicines with the potential to create significant clinical benefit and outcomes. For each one of our programs, we start with a singular purpose to enable more efficient, targeted delivery of medicine to the patient while minimizing systemic exposure. To accommodate growing demand for our technology, we recently opened a new R&D facility in Austin, Texas, which will provide us with significantly more lab space to develop larger scale production for our numerous partnered preclinical programs. Dr.\n\nDonald Owens, our director of product development, will supervise the facility supported by Dr. John Koleng, TFF's vice president of product development and manufacturing. We're also expanding the product development team in Austin, which will be based at the new facility to support the growing number of partnered preclinical projects. Two additional points.\n\nFirst, we continue to fully partner with all of our colleagues at the University of Texas. Second, we are taking a very efficient approach to funding the new lab space. The costs will be managed within our existing budgets. In addition, we do receive funds from our partners to fund many of the experiments that are part of the expanding material transfer agreements and statements of work.\n\nNow, on to key business updates. First, our two most advanced clinical stage programs, Voriconazole Inhalation Powder and Tacrolimus Inhalation Powder, are currently in open label Phase 2 trials and we expect the initial valuable patient data by the end of the third quarter. As previously discussed, we intend to partner these programs and we're currently working with Torreya Partners to reach out broadly to potential interested companies. I'm happy to report that this process is going well with a number of companies under CDA and or in our product data rooms.\n\nWe will release valuable patient data to those companies under CDA. Given each program's advanced stage of development, we seek partnerships that reflect our significant investment made to date and each product's potential to improve upon the current standard of care. In addition, we are working to build out the clinical supply materials so that prospective partners can remain focused on clinical development and registration strategy. We also expect both the VORI and TAC impact programs to gain more visibility in the very near term.\n\nDr. Bradley Gardiner from the Royal Alfred Hospital in Melbourne, Australia, has been selected to provide a podium presentation on the ongoing compassionate use study of our Voriconazole Inhalation Powder at the International Congress on Lung transplantation, taking place in Paris, France on September 8 and 9. Notably, in this lung transplant patient, we observed the expected lack of drug-drug interactions when administering voriconazole by inhalation, thus the patient did not require dose adjustment of their tacrolimus immunosuppressant, which is not possible with oral voriconazole and demonstrates one of the safety advantages we expect to further demonstrate in our ongoing Phase II study. We remain very excited about the value these two programs are created for TFF and look forward to providing further updates.\n\nLet me now provide an update on the status of inhaled niclosamide powder. I'm happy to tell you that we very recently sent the niclosamide Phase I complete study report to UNION. We believe this study report provides meaningful information to our partners at UNION as they continue to evaluate all of the data and assess TFF's Niclosamide Inhalation Powder. I can tell you that UNION is an outstanding partner and are quite impressed with the results.\n\nThe UNION is working diligently to provide TFF with feedback on their option to license Niclosamide Inhalation Powder and begin a Phase II clinical program in COVID-19 patients. In other updates, our partnership with Catalent is progressing well. Catalent has referred a number of their clients to TFF to begin feasibility work. In addition, we are working with multiple Catalent sites preparing to install TFF equipment for the purpose of developing and manufacturing product candidates.\n\nWe also continue to think strategically about the future of Augmenta 3387. TFF and Augmenta believe there is a therapeutic opportunity for an effective monoclonal antibody potentially in combination with other antiviral therapeutic options. TFF also continues to be increasingly encouraged about the potential for our inhaled cannabinoid product opportunities. We recently produced additional product to be used in further consumer testing.\n\nThe opportunity to partner with TFF on these opportunities has now been presented to Glass House and a broader base of cannabis companies, both in the U.S. and Canada is our goal to determine a specific path forward shortly. As I said earlier, the number of pharma companies with open MTAs has increased, and we added three new top 20 companies during the second quarter. Our datasets are reaching critical decision inflection points with many partners.\n\nOn the legislative front, we are keenly focused on the opportunity Thin Film Freezing offers to the advanced development of therapeutics and vaccines. TFF is working directly with members of the Congressional Appropriations Committee and departments within health and human services. We expect that opportunities will be considered for funding TFF efforts under the language written in the 2022 omnibus budget bill. In addition, as our development projects increase and mature, we now have been able to file funding grants, which help us advance programs already moving forward as a part of our two creatives and our academic partnerships.\n\nFinally, the work we are progressing with DARPA formulating topical and ocular preparations of countermeasures is now in year two, and the preliminary results are promising and the feedback from Leidos is excellent. With those updates, I'd like to turn the call over to our chief financial officer, Kirk Coleman, for a review of our financials. Kirk?\n\nKirk Coleman -- Chief Financial Officer\n\nThank you, Glenn. For the three months ended June 30, 2022, research and development expenses for the company were $5.1 million compared to $2.8 million for the same period in 2021. General and administrative expenses for the three months ended June 30, 2022, for the company were $3.7 million compared to $2.4 million for the same period in 2021. The company reported a net loss for the three months ended June 30, 2022, of $8.7 million compared to a net loss of $4.7 million for the same period in 2021.\n\nWeighted average common shares outstanding basic and diluted for the three months ended June 30, 2022, were 25,373,706 compared with 25,369,144 for the same period of 2021. As of June 30, 2022, we had total assets of approximately $27.9 million and working capital of approximately $21.4 million. At the end of the second quarter, our liquidity included approximately $20.9 million of cash and cash equivalents. And with that, I'd like to turn the call back over to Glenn.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nThank you, Kirk. The second half 2022 reported results promised to be a meaningful period for TFF Pharmaceuticals. I hope that I've given you a flavor for the data that further confirms the potential for our ubiquitous, unique and value-creating Thin Film Freezing platform technology. We are very well positioned to meet our needs, as well as the needs of our pharmaceutical, academic and government partners.\n\nThe unmet needs of pharmaceutical development in this arena is perfectly set up for Thin Film Freezing. Please search out the comments by Dr. Fauci and other vaccine experts emphasizing the need to deliver vaccines directly to the nasal and lung mucosa. What a tremendous set of opportunities this is for TFF.\n\nOur partnering activities continue to expand, we have in place both the personnel and facilities to accommodate this growth. As discussed, our inhaled voriconazole and tacrolimus programs are each slated to reach important clinical milestones, and we are also pleased with the pace of partnership discussions surrounding these two innovative products. Thanks to all of the TFF team for their hard work and positive outcomes and thanks, as always, to all of our investors. And with that, I will turn the call back to the operator and open it up to questions.\n\nOperator?\n\nOperator\n\nThank you. Before going into Q&A, Glenn Mattes has an additional piece of information to add.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nYes. Thank you. I want to take this opportunity to inform our listeners both on the live wire here and on the website that I'm announcing that in our 10-Q today, we did announce that, unfortunately, Malcolm Fairbairn has resigned from the TFF board. I certainly want to thank Malcolm for his counsel, his service and wish him well in his future endeavors.\n\nAnd with that, now, we will open it up to questions. Thank you, operator.\n\nOperator\n\n[Operator instructions] The first question comes from Jonathan Aschoff with ROTH Capital Partners. Please go ahead.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nThank you. Thank you, guys. Glenn, since TFF continues to test CBD formulations with consumers, what are your thoughts about entering the market formally?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nYes. Jonathan, it's been a really interesting six months. We certainly again want to acknowledge that PLUS did a great job in helping us get ready formulation-wise, and we really have now been able to take those samples and test them with consumers and also introduce the technology to other companies. Glad, Glass House has not confirmed their interest at this point.\n\nSo we have been working to go out to different companies. They've been working with our samples. They've been also testing it on some consumers. So we now have a real opportunity to sit back a little bit, look at a strategy of either one or multiple multistate operators to take this into the marketplace.\n\nAnd we're hopeful that that can still happen later in the year. We also have seen an uptick in interest from companies since the vaping is very moved from tobacco. And I think a lot of the companies feel that there is a real opportunity to look at Thin Film Freezing cannabinoid formulations as a healthy alternative. Now, of course, that hasn't seated in yet to the CBD market.\n\nBut I've noted and the folks I work with that are helping to sort of help me map this out a real uptake in interest. So hopefully, by the next quarter's update, I'll have some more specifics there. But we're really seeing terrific response to the product. And I think that's the key here in order for us to take a look at this being a positive contribution to our revenue lines.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nOK. And regarding the compassionate use case report for the lung -- that will be presented in Paris at that lung transplant congress. Do those results from that patient support the treatment hypothesis for IPA and give you confidence for success in the Phase II trial?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nYes. Dale, could you answer that question? You're closest to that data.\n\nDale Christensen -- Director of Clinical Development\n\nYes. Thanks, Glenn and thanks Jonathan. It's a very good question. As we stated previously, we believe that by delivering voriconazole by inhalation directly to the lung, we can increase the local concentration in the lung where you would derive the best therapeutic benefit, and we can also reduce the systemic concentration that's associated with the toxicity and drug-drug interactions from the oral voriconazole.\n\nAnd the patient that we have been treating could not take oral voriconazole or any other azole antifungal due to toxicity and tolerability issues. One of the toxicities was that they had a history of melanoma and there's kind of a black box warning on voriconazole for melanoma. And so, this patient couldn't take it. And so, this patient was having declining lung function.\n\nWhat we were able to do is stabilize the lung function due to effective treatment of the fungal infection, and we were able to do so without the patient having to adjust the dose of their tacrolimus immunosuppression medication. So it showed that we can have efficacy and without the drug-drug interactions. And so, it really does reinforce that treatment hypothesis that we've been working on.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nMy next question is, with the dominant BA.5 COVID variant and data on Paxlovid rebound cases, what do you think that creates in terms of an opening for niclosamide?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nYes. Dale, can you answer that one as well, please?\n\nDale Christensen -- Director of Clinical Development\n\nSure. Thanks, again. Also, a very good question. So with the emergence of the BA.5 variant, it seems to be worse than the previous Omicron versions.\n\nAnd really at 500 deaths a day -- nearly 500 deaths a day in the U.S. And basically, worldwide 65 deaths around the world from COVID in the last four weeks. It very clearly indicates COVID is not over and better treatments are needed. And so, that level of death really isn't acceptable.\n\nAnd many of the patients that die are in high-risk categories, cancer patients, patients who can't take Paxlovid due to drug-drug interactions. And we think that those patients will benefit from inhaled niclosamide because they're -- again, like fluconazole, when we deliver to the lung, you can avoid drug-drug interactions. And we've also seen that from the Paxlovid rebound, it's very clear that BA.5 and potentially future variants will take longer. And so, we're planning to -- when we move forward dose longer in our studies because we can avoid the drug-drug interactions that have great safety, we think that we can prevent the rebound and we'll monitor that during the clinical trials.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nAnd sorry to hog the mic, but two more. Should partnering of VORI and TAC happen, will you bring in new internal development programs and how will you select them? And the last question is, you added three top 20 pharmas. What's that bring the total number to?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nOK. So yes, our goal is always to have an active internal set of products that we're developing. We're not turning into a company that is going to take these things all the way to the finish line. But the goal is to -- just like we're doing with VORI and TAC, take them through meaningful clinical inflection points.\n\nThe 505(b)(2) strategy certainly was the right way for us to go. But strategically, we're looking at potential arrangements that would include co-development and sharing of development like we did with Augmenta where we split development 50-50. Augmenta, we were going to take through Phase I and still naive and then split proceeds from that point on. So we have a number of different options available to us as we seek to -- we kind to refresh and serially look at taking products to the pipeline.\n\nIn general, Jonathan, it takes about $7 million to $12 million depending on the cost of the API to get us to that inflection point. So we have some products that we've been -- and compounds we've been looking at. Jordan Kennedy, who's our lead analyst has been working with some folks on the outside to do some analysis on what the market opportunities might be and what the development programs might look like. So as soon as we created revenue and cleared out the expense for VORI and TAC, we will look to refresh that internal portfolio.\n\nOn the top 20 question, I don't remember the exact number. We were at a majority. So we're somewhere now in the area of -- we'll come back to you on the exact number, I would say, between 12 and 15, probably on the higher side of that. But the good news there is, those companies, many of them are not one-trick ponies.\n\nWe have multiple projects that we're working with them. And those programs are getting -- are quite detailed, some of them in the very last stages of producing data and others that are at the starting gate. And we're really excited about and wish we -- frankly, we wish we could share some of these with you. The big companies are very hesitant to let us disclose and you -- if you knew what we were working on, you can understand the competitive nature of what Thin Film Freezing could be doing for those companies and their compounds in their marketplaces.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nOK. Do you still see the VORI and TAC trials as pivotal? Or is that authentic?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nWell, we certainly feel that the data will be meaningful. And Jonathan, you know that the FDA never says yes, and they never say no, it depends on the data. When we talk to the partner companies that we're already under CDA with and that are in the data room, we certainly talk about what potentially those latter -- those additional studies might look like. And believe me, as you know, those partners will be looking at those as well.\n\nBut we'll start to see it pretty soon on what those data are showing us. And hopefully, we believe certainly that those data will be quite good, and we'll see where that lands us.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nThank you very much, guys.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nBut one thing to note, Jonathan, we have not budgeted for additional trials. So the assumption here is that, the partner would take those -- if those trials needed to be done, would do those trials.\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nUnderstood. Thank you.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nThank you, Jonathan.\n\nOperator\n\nThe next question comes from Daniel Carlson with TW Research Group. Please go ahead.\n\nDaniel Carlson -- TW Research Group -- Analyst\n\nHey, Glenn. Thanks for taking the questions. First off, you're making great progress it appears and bringing in MTAs and potential partners there. But we're still looking at preclinical stuff.\n\nAnd in the past, you've mentioned some pretty large numbers associated with getting these partners into full license agreement. So I'm just wondering, what is the big hurdle in getting from preclinical to in-human trials? And is it the terms or are they too tough? Or just trying to figure that one out?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nNo, the terms are not an issue, Daniel. When we engage with a company, Chris is very clear what the expectations are and what the relationship would look like. So in discussions that we've had with companies that are closer to the finish line and terms are discussed, certainly, there's some negotiation there. But that -- we don't see that as a rate limiting step.\n\nAnd we're -- that's really the bottom line. We're maturing the data before any company is willing to write a check and license it. They want to be sure that we've answered all their clinical questions, and that's where we're at. And sometimes it moves a little bit slower than we want, but the data are being seen in a very positive light.\n\nAnd we don't see the financials as being an obstacle.\n\nDaniel Carlson -- TW Research Group -- Analyst\n\nGot you. That's good news then. The next question I have is like once again, in the past, you've mentioned that you've never lost a bake up, and I'm sure that a lot of these companies are looking at everything out there. And certainly, there has been a lot of stuff in the press about other people trying nasal vaccines, etc.\n\nSo I'm just wondering, is it still the case that every one of the companies you're talking to has not moved forward with alternative technologies and do you guys are still in the running?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nI can't say that they know of any company that informed us that they've moved forward with an alternative technology. There have been a few companies that have decided to stick with the base program before moving on to Thin Film Freezing. We've seen a little bit of an uptick in that, Daniel, in full transparency in these tough times in the capital markets where if things were better, I think these are the smaller- to medium-sized companies. They go into the capital markets to raise funding to do the project.\n\nSo for a few of them we're on hold. But it's become pretty routine and it's almost predictable. Chris and I sit on these calls, you know they're comparing us to the standard lyophilization approaches. And that's why, frankly, I have Bill to do -- provide me with some of the specific data from his trials and publications to reassure the investor that we continue to produce outstanding data better than what you can see with the alternative modalities.\n\nAnd that's now even going beyond, we will or even like three to six months ago looking at nasal delivery or a Dale is doing on the DARPA program. So that was a little bit of a different approach today, but those four papers that I cited and there are others where we're actually using partners' materials, I think give great evidence to that.\n\nDaniel Carlson -- TW Research Group -- Analyst\n\nYes. I was going to ask you about the papers that you published and just what they mean for your commercialization efforts.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nBill, do you have a perspective on that?\n\nBill Williams -- Scientific Consultant\n\nI do. Yes. That's a great question. So our strategy has always been to -- and you can follow our papers is, we are -- our papers are the way that we teach our partners and potential partners about our technology and about potential uses that they can imagine with their compounds that they're working on, they can imagine it in our technology.\n\nAnd so, we look for problems. We look for -- we're very aggressive in studying competing technologies and finding holes in competing technologies where our Thin Film Freezing sits in, and then our papers are a way that we leverage that with partners and potential partners. So it's a critical part of commercialization. And one last thing is, when we have our calls that Chris Cano and others set up, I mean, we're talking with the company's top scientists and they're all science-driven at the point we're talking to them.\n\nAnd so, they want to see our data, they want to see it in publications and also publishing like this, it's a key part for our -- for the company.\n\nDaniel Carlson -- TW Research Group -- Analyst\n\nGot you. And then, Glenn, one last question for me. It looks like -- I think you put some new logos in your slide deck, and you've got three new MTAs or top 20, you mentioned. How does it -- is there a criteria for getting in there, you hitting a certain level of relationship? Or why are some companies in there and others not?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nYes. So Daniel, we certainly don't even approach the subject until we think we have on a meaningful path. The bigger companies are really, really reluctant to do that. We've had some breakthroughs there.\n\nI think those are symbolic of sort of where we're at in terms of the work we're doing with them. We don't fight too hard as they say, no, look, we don't want to do anything to upset the Apple cards here. But when it's appropriate and when we think it's at a reasonable time, we will ask and -- but don't take it that if the logo isn't on there, it doesn't mean that we're in a pretty good place in terms of where we are in working with those companies. So it's -- we started that as a practice of where we can, putting companies or academic institutions on the slide.\n\nWe'll continue to look for opportunities to do that. It just as an indication that we're moving forward. And in this quarter, I wish I can tell you who we signed up with and have new MTAs with, very exciting. But again, realize those three are starting from the starting line, and it won't happen in the next quarter, but hopefully soon enough.\n\nDaniel Carlson -- TW Research Group -- Analyst\n\nGreat. Thanks, guys. Looking forward to second half here. A lot of exciting stuff coming.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nThank you. Operator, do we have any more questions?\n\nOperator\n\nWe do. The next question comes from Michael Okunewitch with Maxim Group. Please go ahead.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nVery good. Thank you.\n\nMichael Okunewitch -- Maxim Group -- Analyst\n\nHey, guys. Thank you for taking my questions. So, I guess, my first question, I'd like to think a bit big picture and just see, given that you've had a lot more partner interaction in particular on the big pharma side, if you could talk about what kind of feedback you're getting on what specifically attracted them to the TFF platform as opposed to other inhalable technologies?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nGood question. Chris, you probably have more of the initial calls. Can you answer that question, please?\n\nChris Cano -- Chief Operating Officer\n\nYes, sure. Thanks, Michael, for the question. So when we're dealing with a big pharma company, right, and engaging with them in discussions, there's usually a product that's been identified, usually a biologic that has a challenge. And so, we -- before we even engage with that partner, we do some diligence, we look at their pipeline and then we come to them with a solution to their problem.\n\nAnd so, whether it is right for inhalation, whether it is for cold chain, now we're even exploring, as we've talked about, intranasal, it really depends on what the partners' program, what their challenge is, and that's where we really focus our efforts because our dry powder offers the solution to their problem.\n\nMichael Okunewitch -- Maxim Group -- Analyst\n\nYes, very much so. And then, just as a follow-up, in terms of that collaboration activity, I'd like to just ask where you see the partners looking to apply the technology. Is this -- are you more looking at reformulations of drugs that are already approved in life cycle management and just improving the profile of their existing products? Or is it more so novel drugs in their pipeline that would work better once you apply the tech?\n\nGlenn Mattes -- President and Chief Executive Officer\n\nYes. So it's a good question. So when I started here almost five years ago and I recruited Chris, that come in shortly after. If you would ask this then, this question, I certainly would have said it would be more reformulation.\n\nAnd -- but now as we sit here today, I'm going to -- I don't have an exact pie chart in front of me. I'd say it's about 80% NCEs and biologics and about 20% to 25% reformulation. Chris, you can -- if I'm way off, you can correct me, but I think that's a fair assessment of where we're at. It's come out much differently than I originally thought.\n\nWe started to reach out to different kinds of companies when we started this. And then, slowly as we began to introduce the technology to companies as well, this is where this whole biologics set of opportunities really exploded for us. And what's unique about that, too, Michael is, we have seen some situations where we've gone as far as successfully formulating, getting into animals and then that new chemical entity isn't quite what the partner wants to see in terms of the outcome. And they'll give us another set of materials in a biologics space.\n\nSo you do like it's kind of out of our hands there because we've done everything we need to do from a technology standpoint. And sometimes, it's come down to, wait a minute, their compound didn't really produce the kind of results that they needed. So it takes you back. They don't walk away from us, but it takes you back to the starting line again.\n\nMichael Okunewitch -- Maxim Group -- Analyst\n\nThank you. And I really appreciate the additional color and congrats in the progress over the quarter.\n\nGlenn Mattes -- President and Chief Executive Officer\n\nThanks, Michael. It's really -- again, I wish as I sit here today, I could tell you who these top 20s are and what we're working on because it's incredibly exciting. So I see that I think we have exhausted the list of questioners, and we're about at the end of the hour. I want to thank all of you for listening.\n\nI want to hope -- I wish you all an enjoyable rest of the summer, and stay healthy. And we really do look forward to ongoing discussions with you. And before or if not, at least at the time we report our third quarter results. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCorey Davis -- Investor Relations\n\nGlenn Mattes -- President and Chief Executive Officer\n\nKirk Coleman -- Chief Financial Officer\n\nJonathan Aschoff -- ROTH Capital Partners -- Analyst\n\nDale Christensen -- Director of Clinical Development\n\nDaniel Carlson -- TW Research Group -- Analyst\n\nBill Williams -- Scientific Consultant\n\nMichael Okunewitch -- Maxim Group -- Analyst\n\nChris Cano -- Chief Operating Officer\n\nMore TFFP analysis\n\nAll earnings call transcripts"
}