{
  "companyName": "Chicken Soup for the Soul Entertainment Inc",
  "companyTicker": "CSSE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/chicken-soup-for-the-soul-entertainment-inc-csse-q/",
  "content": "Chicken Soup for the Soul Entertainment Inc (CSSE -7.25%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to Chicken Soup for the Soul Entertainment second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session. [Operator instructions] I would now like to hand the call over to Taylor Krafchik, Ellipsis IR.\n\nPlease go ahead.\n\nTaylor Krafchik -- Investor Relations\n\nThank you, operator, and welcome. With me on the call today are William J. Rouhana, chairman and chief executive officer of Chicken Soup for the Soul Entertainment; and Chris Mitchell, chief financial officer, to review the second-quarter 2022 results, as well as provide a business update. Following this discussion, there will be a moderated Q&A session open to participants on this call.\n\nDuring this call, management will make forward-looking statements. Forward-looking statements include, but are not limited to, statements regarding expectations, intentions, and strategies regarding the future. Forward-looking statements are based on management's current expectations and assumptions and are subject to known and unknown risks, uncertainties, and other factors that could cause actual results to materially from projected results. Given these uncertainties, listeners are cautioned to not place undue reliance on any forward-looking statements contained in this conference call.\n\nPlease refer to the cautionary text regarding forward-looking statements contained in the content of this call. Additional risk disclosures can be found in the company's filings with the Securities and Exchange Commission. On today's call management will make comments on certain GAAP-based and non-GAAP pro forma financial information. The non-GAAP financial measure the company uses is adjusted EBITDA and Management believes that adjusted EBITDA provides useful information and that it excludes amounts that are not indicative of the company's core operating results and ongoing operations and provides a more consistent basis for comparison between periods.\n\nThe earnings release contains a reconciliation of adjusted EBITDA to net income or loss, which is the most directly comparable GAAP measure. For further information regarding the company's historical financial performance, financial condition, and operational and other informational and risks, please refer to our filings with the SEC, including our quarterly report on Form 10-Q for the quarter ended June 30, 2022, which will be filed tomorrow. I would now like to turn the call over to William Rouhana, chairman and CEO. Bill, please go ahead.\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nThank you, Taylor, and thank you, everybody, for joining us today. We had an outstanding quarter, and we continue to see momentum in scaling our business. We've also been very busy with early integration work on the Redbox acquisition, which, as you know, closed today. And I must say, we keep on doing this closing or announcing deals on the day we announce earnings, and I've got to try to break this pattern because we're always very tired when we have these calls as a result.\n\nI'm going to run through a few highlights from our quarter and then turn to Redbox in the future for our company. Chris will go through some details on the numbers for Q2, and then we will take some questions. We have a couple of visitors with us today, whose names you saw in our press release: Galen Smith, who's our new executive vice chairman, welcome; and Jonathan Katz, who is our new president. Welcome, John.\n\nIn Q2, we really grew quite a bit. Our revenue was up 70% year over year to $37.6 million. By the way, all of these numbers are Chicken Soup for the Soul Entertainment only. They do not include any Redbox results.\n\nOur adjusted EBITDA grew 77% to $5.6 million. Our advertising sales engine is delivering results, both for our owned and operated group of networks and our growing roster of ad rep partners. The ability to do so is a function of everything we've done to scale our business over the last couple of years. Our viewership is growing as we continue to roll out new distribution touchpoints.\n\nWe've reached a total of 110 pre-Redbox. And these viewers are responding to our new tech platform as measured by increasing time spent on our services. And we are releasing original and exclusive content at a faster clip that's fueled by our robust production pipeline in our large library. Incidentally, our original and exclusive content continues to deliver very well.\n\nIt was 22% of our ad impressions in the second quarter. Put it together, and you have many more viewers spending more time with content they can't find elsewhere. That gives us more ad inventory and more value that we can provide to our advertisers. I'm going to spend a minute on our ad sales operation because we're building something very special there.\n\nWe don't talk enough about it, and it's going to be very important to our future. In addition to our strong owned and operated effort, we've built over the past three years, we now have also built a meaningful ad rep business for AVOD companies, and we have 12 ad rep partners. We've sold out our inventory again in the quarter, and we're ready to bring on additional inventory that Redbox's channels provide. Now the ad sales asset we've built is getting attention in the industry.\n\nThis year, we had multiple fast and AVOD services approach us about selling their ads for them. That's a pretty big change in the last year. We were up from six ad rep partners last year to 12 now. And in addition to expanding our ad revenue, these partners open up future strategic opportunities for our company.\n\nOther AVODs have already learned that building an ad sales engine isn't easy. By the way, Microsoft and Netflix will learn that soon. And that gives us a unique opportunity to become a hub that can support the broader free streaming ecosystem. So, we've come quite a long way in a short time.\n\nstarting the Crackle joint venture just three years ago. Our vision around the strategic importance of AVOD amid changing consumer viewing habits is now a growing reality. And as we can see from slowing subscriber growth for premium subscription VOD services, as well as the ongoing cord-cutting trend. Consumers are adapting, they're getting smarter about their subscriptions and content choices, and they are looking for value in addition to quality content.\n\nAVOD solves all these needs in a way that legacy or subscription services cannot quite reach. By the way, our combination with Redbox makes us the single best place for value-conscious consumers to consume premium entertainment. So, that brings us to Redbox. This is a transformative deal that, in effect, accelerates our scale-up strategy by as much as three years.\n\nIn fact, it now makes us the media company for value-conscious consumers, and it begins transforming our financial results right away. As we've disclosed, we now expect to be on a free cash flow positive run rate ending this year, far ahead of our plans as a stand-alone company. And while the financial markets may have been confused by this deal, we and key investors like Apollo are not. Chicken Soup for the Soul Entertainment and Redbox are a truly unique fit.\n\nThe combination creates a fully formed entertainment asset for the streaming era that we don't think you can find anywhere else. The asset includes a large content library, our significant IP ownership, a valuable original production pipeline a fully developed ad sales engine marketing machine with expanded ad inventory, and streaming assets that include our AVOD networks, Redboxes, PVOD, and free live TV channels along with their cash-generating kiosk network. And don't forget the service business. Together, our businesses are an ideal fit and are in a position to tap into the respective value-conscious consumer bases with two great brands or actually more than two that complement each other in many ways.\n\nToday, in conjunction with the closing, we also announced important leadership appointments. I've introduced them already, Galen Smith, the former CEO of Redbox, will become our executive vice chairman of both Redbox and Chicken Soup for the Soul Entertainment and will report to me. We also introduced Jonathan Kates as president of Chiken Soup for the Soul Entertainment. Jonathan is a proven television industry leader who will be responsible for operations that will also report to me.\n\nYou'll be hearing more from Galen and Jonathan as we continue to integrate and scale our combined company. But I also want to take a moment to welcome the rest of the Redbox team. Redbox has phenomenal talent, and we're excited and privileged that we have the senior team joining our Chicken Soup for the Soul Entertainment team. Redbox will file its second-quarter 10-Q tomorrow.\n\nAnd as you'll see, the kiosk business is starting to show renewed growth as the theatrical release market slowly comes back to life. And prior cost-cutting is beginning to work its way into its P&L. An improving kiosk business is important in the early days of this acquisition as it provides a valuable source of cash flow for the company to fund growth of our digital businesses. But Redbox's current performance isn't the reason we bought the company.\n\nWe brought it to the assets to customers and the unique strategic fit. And we've already hit the ground running on integrating Redbox into everything we are doing. For example, we've set our -- we turned our sales force to the task of selling Redbox and inventory. We started folding the Redbox and Chicken Soup for the Soul channel assets into one platform.\n\nAnd we are already integrating Redbox's film content into our screen media sales effort and into our network programming operations. Also, now that we have Redbox's content pipeline, we are adjusting our content strategy from a focus on building more pipeline to optimizing the pace of rights monetization. We now have the flexibility to spread out our content investment without sacrificing our robust schedule. Programming cost is one of several profitability levers we have, and now we have the ability to manage this one well.\n\nSpeaking of content with the addition of more than 11,000 new content assets that Redbox has on their AVOD network, including the recently signed AVOD license for MGM content, we now have 51,000, it's there's a lot, 51,000 AVOD assets. That's pretty amazing. We'll be sharing more soon on our plans and -- but one fun question I know folks will have is how we are planning to manage our remarkable portfolio of brands. Over time, you can expect to see the Redbox brand emerge as our flagship consumer-facing brand in the U.S., where it has strong brand equity.\n\nOne example of where we're heading, we are in the early stages of creating a singular Redbox app, or as I've been calling it a super app that would house all of our streaming networks and be distributed as yet another touch point for our networks and content. As for the Chicken Soup for the Soul and Crackle brands, as I've said before, these brands are well known around the world and will play a starring role as we ramp up our international operations. Overall, our touch point strategy will be expanded to include the Redbox app and fast channels, and that will bring our existing total touch points to 141 with 167 once we complete those under contract. It's really a lot of it.\n\nNow that we've completed the transaction, you'll also see other benefits rolling through our financials, including the end of duplicative public company costs. And over time, the key synergy and operating benefits already discussed that will aid adjusted EBITDA and free cash generation. In addition to operating synergies, we'll have meaningfully reduced capex since we will no longer need to build our own fast channels our fast channel service like the free life TV service Redbox has, or our PVOD and TVOD capabilities. Redbox will not need to build the sales force and neither of us will need to increase our library.\n\nWe also have more than 100 originals in our queue. One aspect of the deal that I want to touch on quickly is the acquisition financing. Not only was this a very low-cost acquisition for us, but we were able to restructure Redbox's debt in a way that provides us additional near-term liquidity, extends maturities, eliminates covenants, and provides flexibility. In short, we are in a good capital position to achieve our plans with all the cash flow benefits I've just outlined.\n\nI'll wrap up with a few observations on the outlook for the rest of the year. We continue to make good progress on our financial goals. We had a fantastic final quarter of stand-alone Chicken Soup for the Soul Entertainment. And at the same time, we're watching the macro environment carefully.\n\nWhile our business model thrives on consumers watching their budget, we also know we're not immune to pressure in ad spend and inflation impacts on expenses. As we sit here today, we do see some emerging caution on the part of advertisers, but not nearly as much as we've heard about in the media. Our increased scale and viewership are also opening us up to political spend in this election season, and we're seeing that activity more than offset any headwinds. For the year, which will include nearly five months of Redbox results, we believe we will exit the year at $500 million revenue and $100 million EBITDA run rate, just as we said before.\n\nIn closing, we couldn't be more excited about the addition of Redbox. It sets the stage for accelerated growth. We're looking forward to our newly expanded team, and it is a really great one. And we're going to build a premium streaming service for the next generation of entertainment.\n\nWe've been right about what's going to happen in the industry, and I think we will continue to be right. I'm going to hand it over to Chris to go over the call and go through our financial performance for the quarter.\n\nChris Mitchell -- Chief Financial Officer\n\nThank you, Bill. As Bill pointed out, we had a terrific quarter, our last quarter as stand-alone Chicken Soup for the Soul Entertainment. We generated all-time record revenue and record Q2 EBITDA, driven by execution on our key growth initiatives. We are in a strong position as we enter our next phase of growth with Redbox.\n\nOn that note, we couldn't be more excited about bringing on Redbox. This deal will add significant revenue, adjusted EBITDA, and cash flow as we believe -- and we believe will drive attractive long-term growth. Turning to the results for the second quarter for CSSE. We reported net revenue of $37.6 million, compared to $22.1 million in the prior-year period, a year-over-year increase of approximately 70%, and compared to net revenue of $29.2 million in the first quarter of 2022 for a sequential quarterly growth rate of 29%.\n\nThe year-over-year increase in net revenue was driven by an increase in AVOD streaming revenues from AVOD rights, a significant increase in ad representation revenues and distribution touch point revenues, and an increase in TVOD revenues. Notably, we saw a meaningful sequential quarterly growth across all of our streaming revenue categories, highlighting our unique positioning in the AVOD ecosystem. Our owned and operated streaming network revenue was driven by our updated apps, which were rolled out across additional platforms as we continue to sell out of our advertising inventory. We also saw continued success with our distribution touch point strategy helping to expand our content reach and drive viewership.\n\nOur Ad Rep partnerships also drove ad sales as we continue to add new partners and expand our existing relationships. In addition, we benefited from an increase in the sales of our content streaming rights to third-party streaming networks, as well as to some of our ad rep partners. It's worth reiterating Bill's comments earlier that we believe the unique combination of chicken super the sol entertainment and Redbox will be in the best position to benefit from the continued growth in the AVOD and fast markets, driving revenue growth in all of the revenue categories that I just mentioned. No other company in the AVOD space has capabilities like ours across all of these revenue categories.\n\nAdditionally, we believe our second quarter performance is especially noteworthy in light of the macro and secular growth challenges facing the broader media and the streaming industries. Moving down to P&L. Gross profit before film library amortization expense and related costs was $20.7 million in the quarter or 55% of net revenue, as compared to $13.5 million in the prior-year quarter or 61.2% of net revenue. Gross profit was $6 million in the quarter or 16% of net revenue as compared to $6.7 million in the prior-year quarter or 30.3% of net revenue.\n\nGross profit margin percent was below the prior-year quarter, primarily due to a few factors. First, a shift in production-related sales mix from high gross margin fee revenue in the prior-year quarter to lower margin, but strategic cost-plus production service revenue in the current quarter. Second, the acceleration of older technology platform cost as a result of launching our new streaming apps. And lastly, the acceleration of program costs for a program that was sold soon after the end of the second quarter.\n\nThe combination of these impacts on our gross margin were unusual, both in size and timing, and we do not expect this set of circumstances to repeat. We believe after normalizing for these unusual factors our gross margins are performing as we've expected them to as we scale the business. We also anticipate seeing our typical seasonal improvement in gross margin as we move through the second half of the year, assuming current advertising revenue expectations hold. Operating loss for the second quarter of 2022 was $16.8 million, compared to an operating loss of $7.8 million in the year-ago period.\n\nThis $9 million variance was primarily due in addition to the impact of lower gross margin to a $3 million increase in compensation expense for the quarter when compared to the 2021 period. Higher compensation expense primarily reflects an increase in headcount including the acquisitions of Sonar and 1091 Media. We also had $2.4 million in higher professional fees for the second quarter when compared to the prior-year period, primarily related to our acquisition of Redbox. Also, other operating expenses increased by $1.6 million in the second quarter compared to 2021.\n\nThis increase was primarily due to an increase in marketing expenses related to Crackle Plus and nonrecurring costs of over $300,000 related to the relocation of our office in California. Our adjusted EBITDA for the second quarter was $5.6 million, compared to $3.2 million in the same period last year, representing a year-over-year increase of 77%. This reflects the scale that we have continued to drive in the business through our viewership growth and our cost-efficient content acquisition, production, and distribution model. In addition to continued scaling benefits as we integrate Redbox, realize revenue, and cost synergies, and continue growing and expanding our original and exclusive content library, we expect to drive further EBITDA growth and margin expansion over time.\n\nLooking at our balance sheet and liquidity position as of June 30, 2022, the company had cash and cash equivalents of $23.5 million, compared to $21.5 million at the end of the first quarter 2022 and $18.4 million at the end of the year-ago period. We have multiple sources of liquidity available to us, and now that we have closed the Redbox transaction, we have incremental liquidity available under a new revolving credit facility. Having said that, in the current environment, we have a focus on free cash flow and are scaling back on content spend and viewing our content assets as a savings bank that we can selectively cash in if we choose to. This approach maintains our solid liquidity position and gives us flexibility.\n\nLet me shift briefly to the Redbox acquisition and our financial reporting. The acquisition of Redbox closed today, August 11, as we've discussed and will be included in the Chicken Soup for the Soul Entertainment's financial results beginning with our Q3 report. We plan to report revenue for the combined company under a single revenue line as we do now, and we'll provide investors with color on revenue drivers across our service areas. In closing, we had an excellent quarter from a Chicken Soup for the Soul Entertainment stand-alone business perspective that sets the stage for the continued strong growth that we expect to amplify with our acquisition of Redbox.\n\nThe combined company going forward creates an entertainment company for value-conscious consumers that we believe will generate over $500 million in revenue and $100 million to $150 million in adjusted EBITDA on an annualized basis exiting this year. with multiple opportunities to accelerate our growth in 2023 and beyond. With that, we will now turn it over to the operator to begin the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Thomas Forte of D.A. Davidson. Your line is open.\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nSo, Chris, Galen, Jonathan, congratulations on amazing quarter and a great deal. So, Bill, hopefully, you are anticipating my first question. So, I have one question, one follow-up. Bill, can you give your updated thoughts on M&A now that you've completed Redbox?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nTom, I haven't even been to sleep. But look, this is still an environment where people who are thoughtful about the way they acquire things can make very good purchases that ultimately can drive tremendous shareholder value. That's what I believe happened today with the closing of the Redbox transaction. And there are a number of other opportunities out there that, I think, can really be useful for people in our position.\n\nSo, we have basically got the platform we need today though, Tom, between our AVOD networks, our TVOD, our PVOD, our customer loyalty program with 41 million customers in it. Our sales force, the keys to generate cash flow the media network that sits on top of the kiosks and then the service business. And by the way, everything inside of Redbox is growing with the exception of the kiosk business at this moment in time, and that's going to start growing pretty soon, too, as there are more theatrical releases coming. So, there is an opportunity to do more.\n\nI'm going to at least take one day off before we start looking at our next logical addition to our business. And we've got to get our act together and do the things we said we're going to do with the company. I think by the addition of this management team and the structure we've put in place, we have a real chance to continue to grow this business in a meaningful way into a real -- a serious media company. So, that's our goal.\n\nThat's what we're going to keep doing. AVOD is our North Star and the place we think we will grow from. And it just keeps going. And I don't think we're done yet, Tom.\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nOK. Excellent. All right. So, then for my follow-up question, I think Chris just talked about $100 million to $150 million of adjusted EBITDA a year.\n\nHow should we think about your priorities for investor spending given that free cash flow generation?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nWell, I think we'll take down our leverage a bit first before we do much of anything else. But of course, put an as risk on that because if I saw something amazing that would generate even more cash for us more quickly, we'd use it that way. But right now, I think our focus is on making sure we delever the business. We're in a pretty OK place.\n\nI mean, if you look at the total leverage that we'll have when things come back to where they should be, it won't be out of line. It will be fine. But I don't like having too much leverage. So, I'll focus first on spending some money on that.\n\non reducing some of our leverage. That would be the first place we'll go but keep the asterisk there.\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nAll right. Thank you, Bill. Thank you, everyone.\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nThanks, Tom.\n\nOperator\n\nThank you. Our next question comes from the line of Jason Kreyer of Craig Hallum. Your line is open.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nThank you. Again, my congrats, Bill, on both the acquisition and the quarter. Multipart question for you just on the kiosk business. So, curious, A, you know, what is your different strategy that's been employed previously to kind of reaccelerate growth there? B, what kind of opportunities you have to monetize Chicken Soup content in kiosks and then see how you're looking at just the trajectory of that business as we go forward with more new releases hitting the market?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nYeah. So, I think -- thanks, Jason. The first last thing first. The single clearest thing is that there will be far more theatrical releases at a much clearer -- a much more consistent pace beginning in the fourth quarter.\n\nI had the numbers a little while ago. I think there's something like 37 current theatrical releases that will hit our boxes in the fourth quarter. That's up from 13 in the third quarter and 18 in the second quarter. So, it's not a small number.\n\nIt's a big number. It's a big difference, and there is a consistent relationship between theatrical releases, hitting the kiosks, and rentals going up. Once that pattern is fully established and is baked in and is back to normal, we're going to see a very significant rise in the revenue there. We already see that each time -- this is stuff I couldn't talk about until we own the company today.\n\nAt each time there was a meaningful theatrical release back into the marketplace, there was a major uptick in rentals for that week and the week following. And that's going to continue as you just have a steady pace of them instead of getting one and then going three weeks without one. And so, that's why we're so optimistic about those numbers. This is not -- we're not dreaming this up.\n\nThis is the pattern that we see. It's in the numbers. So, all you numbers people out there, you should be happy because it's in the numbers. It's not in our mind or in our hope.\n\nIt's the fact of the matter. So, that's point one, Jason. And I think you asked whether we're going to do things differently with the kiosks. I would say the answer is probably not, but we may market them a little more aggressively -- we're certainly going to keep growing the service business is related to the kiosk business.\n\nThat is a gem, I called it a hidden gem, but if I keep talking about it, it won't be hidden very much longer. So, it's a gem. It's growing very quickly. It generates cash.\n\nIt's going to keep growing. Am I allowed to say that we've raised prices? I guess not. So, we will say that. But that's a business that there is some price opportunity, and I'll put it that way.\n\nAnd this is a good business. We have a very unique asset in that field sales force, which is a phenomenal group of people doing a great job. And run by a terrific guy named Mike Chamberlain. So, there's a real business there, and I forgot your second one.\n\nI did one in three, Jason. So, what was number two?\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nYour content hitting the kiosks.\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nYes, that's right. It's funny. That's happening, and it will happen -- it will continue to happen. And instead of Galen giving us some small amount of money as a guarantee -- and then pocketing the rest for themselves, we now get to keep the whole thing, which is a lot better for the position for us in terms of the way we look at this.\n\nIt is -- I mean, I'll give him credit. Now that I understand what he was making on what we were giving him. I'm really glad he saw my side. It's a big change.\n\nBut yes, that will be a consistent thing. But what's as important, Jason, is the fact that we will now be acquiring with that filter. So, as we're getting new content, one of the filters we will put it through is has it going to perform in our red box kiosks. That does a few things for us.\n\nOne, it reduces our risk as we acquire content because we have yet another source of revenue that we know we're going to get but it also will help generate more titles for the kiosks that attract consumers because we know as we acquire them, these are the types of titles that work. So, it's a very good combination of things, and it's already starting.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nSelfishly, just one follow-up on your ad sales. You seem to be performing pretty well in the face of this and pending recession. And we've seen plenty of others that are not performing as well. Can you just maybe talk about I don't know what I'll categorize as outperformance or why you're performing better?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nYou know, I threw in that aside during my main talk about not really seeing in the marketplace what we've been hearing in the media. I have a feeling that what's happening is certain areas of advertising are under attack and some of -- because there is a natural tendency if you're already -- if you're an advertiser, you're already going to leave broadcast, you're going to leave cable and go OTT. If you're going to cut back because you're a little worried about a possible recession, you're certainly going to cut back there first, right? You're not going to cut back in the pure OTT. But as you'll remember, I told you in the past and we've discussed this a number of times, most of our competitors also have broadcast networks and other networks, and they package their advertising.\n\nAnd then when they go to the marketplace to the investment marketplace, they allocate their revenues across those patterns in different ways. And you never get a pure play analysis from them. With us, there's only one thing, AVOD revenue, and we're not seeing any drop-off in it. Now, there is the issue of programmatic versus direct selling.\n\nMaybe the reason that we are having absolutely no problem and still seeing CPMs grow because that should be the next question somebody asked me is because we have a direct sales force, and we are not as subject to the market vagaries that come when you are in a computer-driven sales business. I have said repeatedly that the programmatic sales business is a race to zero unless you use it to service not to sell. There's no doubt that's true. And by the way, this is why we have 12 ad rep, 12 other AVODs who have come to us and asked us to sell their ads.\n\nThey didn't come to us to ask to sell programmatically. They came because they're attracted by our direct sales force, its capability of selling out inventory, and its capability of creating long-term relationships with advertisers. This is what's happening. So, a lot of what we see in the newspaper, is there a newspaper anymore or whatever that thing is in the news.\n\nWe're just not seeing it in the marketplace. On top of that, though, don't forget, we're in a moment in time where there's going to be a lot of political spending. We're certainly big enough now that we're getting a lot of that. And that's going to -- that's more than offsetting any softness we're seeing in the market.\n\nSo, I don't mean to say there isn't a sense on the part of advertisers that the world may be choppy. But where they're taking that sense is not to OTT. They're taking it to cable. They're taking it to broadcast.\n\nI don't know anything about the social media guys of what's going on there. So, do all kinds of dislocations there. But the actual AVOD business, there's tremendous demand. \n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nI always appreciate that incremental color. Thank you.\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line of Zervin Zain of Alliance Global. Zervin, your line is open.\n\nUnknown speaker\n\nHi there. I'm calling on behalf of Brian Kinstlinger on Alliance Global. You answered my first question brilliantly about CPMs and advertising. So, I'll just move on to the second one.\n\nYou talked about it a little bit, but in terms of upgrading the touch points to the new tech platform, have you seen a consistent improvement in viewership and return viewers with those upgrades? And if so, can you quantify that improvement?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nWell, first of all, welcome, Zervin. I know you just joined Brian, and congratulations. The touch point strategy is working. There's no question.\n\nIt's been the main driver of increased viewership. And as I said earlier in my talk, the tech is working, too. And we're seeing that people are staying longer, and the combination of the two are driving ad impressions to records for us. So, the answer is it does work, and it is happening, and we are doing it, and we're going to keep doing it.\n\nThe touchpoint strategy is not over, as you know, as you heard, we're really at more than 140 now with the addition of the Redbox touch points. and we have another 20 to go with them. But with the Red Box network being added and the Redbox Super App being added, we'll expand the number of places we're going to be found. I still am of the opinion that the marketplace for consumers is so difficult to navigate that you need to be wherever they may go.\n\nAnd therefore, you have to make it easy for them to find you by being on every being every place that people congregate. I will say that the creation of the super app where everything could be in one place for us, maybe the beginning of making it easier for people find our content on our apps. And we'll see. We'll see how that goes.\n\nThe exact increase from the touch points, it remains about the same as it's been. It's been around $450,000 per new touch point per month. monthly active viewers. And the length of time has been consistently better by no less than 20% every time we've added the tech in a new place.\n\nSo, it's going well. It's working.\n\nUnknown speaker\n\nGreat. Thank you so much. Appreciate it. That's all I have.\n\nOperator\n\nThank you. Our next question comes from the line of Laura Martin of Needham and Company. Laura Martin, your line is open.\n\nLaura Martin -- Needham and Company -- Analyst\n\nHey there. Bill, great numbers today. My question, Bill, is on this ad rep business. So, you're selling out your inventory, you're selling out their inventory.\n\nI actually just don't know how the ad rep business works. So, do you buy their inventory and keep the upside if you guys do better? Is it straight commission? How does the money work for your ad rep business?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nIt's a good question, Laura. And the answer is both. The one I like the best is where we get to buy it, and then we get to resell it and keep as much as possible. But most of these guys are too smart for that.\n\nSo, they make us take a fee. And the fee, the commission is interestingly high enough so that it's worth doing on a consistent basis. And there used to be -- there was a time where if you were somebody using an ad rep partner like us, your entire reason for doing it would be to buy time to replace us. But what started to happen is in the marketplace, as you know, advertisers are focusing on fewer and fewer places to buy -- and therefore, it's harder and harder to develop a sales force that actually has enough critical mass to get the advertisers attention.\n\nAnd so, we've had a number of our ad rep partners go off to try and start their own ad for us and then come back because it doesn't work. And what's happened is we've become sort of the centering device for what all the middle size votes to go to market, to go to advertisers. So, we make a healthy margin doing that, but we also get them money they couldn't have otherwise gotten. So, it becomes a win-win.\n\nBut I do like it better when they just sell us the inventory and we can resell it. we can make much more. But they don't always let us do that, Laura. So, it becomes strategic, too, but let me let you ask your next question.\n\nLaura Martin -- Needham and Company -- Analyst\n\nWell, no, no, no. Let's build on that because that's where I was sort of going next. Is -- it sounds like there are other strategic benefits you get when you sort of have a closer relationship with Visa. You talked about a couple.\n\nCan you build on that and how it's strategic, which sort of build longer-term value than the current P&L?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nYes. And that's really one of the things I like most about the way this is evolving. What we see happening is, increasingly, those partners also will lease content from us for use on their networks. And that helps us monetize our content either further makes us more connected I don't want to say dependent on each other, but more connected.\n\nAnd that connectivity, of course, is helpful. And then some of these partners are actually places where we put our apps, and now, they want us to sell their ads in addition to the ads that relate to our absent. So, they become distribution partners for us. And so, there's this web of connectivity between us and these ad rep companies.\n\nThat goes beyond just selling ads. There's another piece of this from my perspective. We get to understand better what people are doing. What things they're watching, what stuff they're actually interested in, which AVOD services are performing best.\n\nAnd while we can't share that information because it's private to other people. It is useful for us in understanding better how to build our business. And so, it helps by -- we make real money doing this now. And if you go back, Laura, you remember when we first blood crackle there was PS View, which was the Sony Network, and that was one of our big customers.\n\nAnd it was a very -- it was a critical part of our plan, and then they shut PSU down with one day's notice. So, that wasn't too good. But now we have a dozen partners who more than replace the PSV group. And that spreads risk.\n\nIt increases information. It's generating really solid revenue and profitability for us. and it's going to continue to grow. It's a pretty big factor as we move forward.\n\nAnd it's very exciting, actually.\n\nLaura Martin -- Needham and Company -- Analyst\n\nFabulous. That's super helpful. And then I'm interested in this political point you're making because we haven't heard from other people that they're getting political revenue yet. So, are you saying to us that a driver for Q3 and to or will be political revenue upside this year?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nI am. And I will say I'm already annoyed by some of the political ads that I have to watch on our network. They're already making me aggregated. I mean, I'm so mad at Bob Stefanowski, whoever the hell is.\n\nHe's running for governor in Connecticut. I see his ads all the time. It's driving me crazy. And he's loud, too.\n\nSo, I don't know. I like Lamont. He's a good guy. He's our governor.\n\nStefanowski is a crazy name in any event. There's so much of this now, so many ads coming in so fast. This is going to be a very interesting political season with these crazy people all spending same amounts of money. The only thing that was better than this was when Bloomberg was spending every time he had to try and become President, and he would pay any amount at any time for any ad.\n\nIt's not quite as good as that, but it's pretty good [audio gap] has an impact. At least it is for us. I don't believe these other guys aren't seeing it, too.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. And then I'll just build on that for my last question, and that is on frequency capping. Could you raise a great point, which is in the ad-driven streaming business, the biggest consumer complaint is ad frequency. So, can you talk about what you guys do on your services to frequency cap?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nLike everybody else, we struggle with it. And it's a challenge because when you have multiple sources of ads. And when advertisers go to multiple [audio gap]\n\nLaura Martin -- Needham and Company -- Analyst\n\nFrequency capping because you raise a great point, which is in the ad-driven streaming business, the biggest consumer complaint is ad frequency. So, can you talk about what you guys do on your services-to-frequency cap?\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nLike everybody else, we struggle with it. And it's a challenge because when you have multiple sources of ads -- and when advertisers go to multiple purveyors to place their ads. What comes in electronically looks like two different ads, but it's the same ad. And so, it's very tough to work your way through that.\n\nWe all worked on it. I mean, we're a lot better than we used to be. I remember there was a time when we first owned these networks where you might see five of the same ad in a row, and that was really any -- we don't have that anymore. But they're still -- it is still hard to completely screen ads that are an ad you saw in the last ad break and things like that.\n\nSo, we're working on it. We're getting better at it, but we're not anywhere near where we need to be on it.\n\nLaura Martin -- Needham and Company -- Analyst\n\nIt will get better. Thank you very much.\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nThanks, Laura. And I think unless I misunderstand it, we're at the end of the time for this call. So, I want to thank everybody for joining us today. We'll be around, and I hope to talk to you all soon.\n\nIt's been an exciting time for us, an exciting time for our company. I know it's an interesting time in our industry, and I look forward to speaking with you all about that as we go forward. Thanks for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTaylor Krafchik -- Investor Relations\n\nBill Rouhana -- Chairman and Chief Executive Officer\n\nChris Mitchell -- Chief Financial Officer\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nUnknown speaker\n\nLaura Martin -- Needham and Company -- Analyst\n\nMore CSSE analysis\n\nAll earnings call transcripts"
}