{
  "companyName": "Delta Air Lines",
  "companyTicker": "DAL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/13/delta-air-lines-dal-q3-2022-earnings-call-transcri/",
  "content": "Delta Air Lines (DAL 0.40%)\nQ3 2022 Earnings Call\nOct 13, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to the Delta Air Lines September quarter 2022 financial results conference call. My name is Cody, and I'll be your coordinator. [Operator instructions] As a reminder, today's call is being recorded. I would now like to turn the conference over to Julie Stewart, vice president of investor relations.\n\nPlease go ahead.\n\nJulie Stewart -- Vice President, Investor Relations\n\nThank you, Cody. Good morning, everyone, and thanks for joining us for our September quarter 2022 earnings call. Joining us from Atlanta today are CEO, Ed Bastian; our president, Glen Hauenstein; our CFO, Dan Janki. Ed will open the call with an overview of Delta's performance and strategy.\n\nGlen will provide an update on the revenue environment, and Dan will discuss costs in our balance sheet. [Operator instructions] Today's discussion contains forward-looking statements that represent our beliefs or expectations about future events. All forward-looking statements involve risks and uncertainties that could cause the actual results to differ materially from the forward-looking statements. Some of the factors that may cause such differences are described in Delta's SEC filings.\n\nWe'll also discuss non-GAAP financial measures, and all results exclude special items unless otherwise noted. You can find a reconciliation of our non-GAAP measures on the investor relations page at ir.delta.com. And with that, I'll turn the call over to Ed.\n\nEd Bastian -- Chief Executive Officer\n\nWell, thank you, Julie, and good morning, everyone. We appreciate you joining us today. Before we begin, I want to recognize all of those who have been impacted by Hurricanes Ian and Fiona, including Delta employees who live in the affected communities. We have contributed $600,000 to the Red Cross relief efforts and activated our Delta Care Fund to take care of our employees who have suffered loss.\n\nDelta will continue to support our people and our communities the recovery and rebuilding. The demand for air travel remains very strong, and that is reflected in today's results and outlook. We generated earnings of $1.51 per share in the September quarter. Our results mark clear financial progress as we report the highest quarterly revenue in Delta's history, 3% above the third quarter of 2019 and $1.5 billion of operating income, generating a 12% margin.\n\nThis was our second quarter -- consecutive quarter of double-digit operating margins. And importantly, we achieved these results despite record high fuel prices and on capacity only 83% restored relative to 2019. Our customer satisfaction scores are running meaningfully above 2019, and loyalty to Delta has never been stronger, with record SkyMiles acquisitions and American Express results ahead of our plan. I want to sincerely thank the Delta people for their great work in delivering these results and restoring our operational reliability through a very difficult summit.\n\nDelivering safe, reliable and on-time service for our customers remains our top priority, and no airline does this better than Delta. We saw strong consistent improvement in our operating metrics throughout the quarter. For example, excluding the impact of Hurricane Ian, we ran a 99.9% domestic completion factor in September and month-to-date in October with 90% arrivals on time. To put that in context, out of 120,000 mainline flights over the last 45 days, we had just 108 cancellations in total, performance that is even better than our prepandemic levels.\n\nAnd year-to-date, Delta remains in the No. 1 industry position among our peer set in completion factor and on-time arrivals. After two years of delaying travel, it is clear that consumers are getting out and traveling the world. Business travel continues to recover in line with our expectations as bookings have improved after Labor Day and companies reconnect with their teams and their customers.\n\nAnd while consumer spend on experiences is growing, the airline industry revenues are still $20 billion to $30 billion below the historical trend against GDP, highlighting the significant opportunity still ahead. We expect our December quarter revenues to maintain this momentum, and we will be 5% to 9% higher than 2019. With strong demand, we expect earnings per share of $1 to $1.25 and a 9% to 11% operating margin. While we face numerous challenges and headwinds this year, Delta has demonstrated its resilience.\n\nWe're ahead of our plan that we laid out for you last December on profitability and cash flow, and we expect to be free cash flow positive in 2022 this year. Our priority over the next six months is to prepare for full network restoration by next summer, consistent with our original plan, but always conditioned on a continuing demand strength. This will support another meaningful step-up in profitability and cash flow next year as we stay on our path to earn over $7 of EPS and $4 billion of free cash in 2024. We'll provide more details on our outlook for 2023 and progress toward our long-term targets at an investor meeting that we will host December 14 in New York.\n\nAs we think about our long-term plan, we had some really important achievements this quarter. Building on Delta's global network and partnerships, we strengthened our network with the recent DOT approval of our joint venture with LATAM. Together with LATAM, our JV will have the No. 1 market position in South America.\n\nTo support our best-in-class network, we continue to reshape our fleet and recently placed an order for 100 Boeing 737-10 aircraft. We're also expanding the power of our loyalty ecosystem with the recently announced Starbucks partnership, bringing two premier brands together. And this week, we announced a strategic partnership with an investment in Joby Aviation, aligning the industry's best airline with the innovation leader in developing eVTOL. Joby shares our vision of providing customers a premium experience.\n\nWe're excited to help support Joby's long-term vision of faster, more reliable and more sustainable transit to the airport. In closing, while we are mindful of macroeconomic headwinds, the travel industry is experiencing a countercyclical recovery. Global demand is continuing to ramp as consumers shift spend to experiences, businesses return to travel and international markets continue to reopen. Demand has not come close to being quenched by a hectic summer travel season.\n\nAt the same time, industry supply is constrained by aircraft availability, regional pilot shortages, and hiring and training needs. With record high fuel prices and increasing cost of capital, the hurdle rate is rising for incremental capacity across an industry that's still restoring its financial condition post pandemic. Against this backdrop and coupled with meaningfully improved asset utilization, at Delta, we are uniquely positioned to grow our earnings and cash flow in 2023. At the same time, we will remain nimble and have the tools to manage through any changes in the overall environment.\n\nOver the last decade, Delta has structurally improved in significant ways, creating a trusted consumer brand built on a foundation as the most reliable airline globally driven by the very best professionals in the industry. And I truly believe that we are positioned to come through this period as a stronger airline than ever before. With that, let me hand it over to Glen, who can provide more details on our commercial performance.\n\nGlen Hauenstein -- President\n\nThank you, Ed, and good morning, everyone. I want to first thank our employees for their hard work restoring our operations and delivering for our customers during a very busy summer travel season. Demand for travel on Delta remains strong. Investments in our products, airport service and the liability are reshaping customer perceptions and driving record satisfaction scores.\n\nBrand affinity supports our revenue premium to the industry, and we're making meaningful progress against our multiyear commercial strategy. September quarter results reflect momentum in premium products and loyalty, supporting continued diversification of our revenues. This quarter, a record 54% of our total revenue was generated by premium products and diverse revenue streams. We expect this to grow to 60% by 2024.\n\nSeptember quarter revenues of $12.8 billion is a new quarterly record and 3% higher than 2019 on 17% less capacity. Hurricane Ian impacted revenues by approximately $70 million, with the impact evenly split between the third and fourth quarters. Total unit revenues finished 23.4% higher versus 2019, improving three points sequentially as international demand accelerated. Demand was strong throughout the quarter, with premium revenue growth outpacing main cabin by 10 points.\n\nDelta Premium Select is performing well ahead of our expectations as we expand the offering to more of our international network every day. We see continued runway ahead with the return of business travel, complementing strength in premium leisure. Our growing loyalty base drives high-margin revenue and supports continued growth in our valuable co-brand relationship with American Express. SkyMiles acquisitions are running 40% above 2019 with over 60% of our passenger revenues now generated by SkyMiles members.\n\nIn the third quarter, record spend and strong acquisitions on our Amex co-brand cards resulted in $1.4 billion of Amex remuneration. This was 37% higher than 2019, and we now expect 2022 remuneration of $5.5 billion, further reinforcing our confidence in achieving our $7 billion target in 2024. Other revenue streams continue to perform well, with cargo revenue up 27% and MRO revenues up 4% versus '19. Business travel continues to improve.\n\nWe expect corporate sales recovery in the December quarter in the low to mid-80s at a system level. Importantly, less recovered sectors like banking, consulting and consumer services have all seen double-digit growth post Labor Day, helping bring New York largely in line with domestic system. We have growing confidence that while there will be changes, corporate travel will fully recover. And increased workplace flexibility is creating new travel patterns.\n\nOur recent corporate survey validates our perspective with nearly 90% of accounts expecting near travel to stay the same or increase as we move into the fourth quarter. That optimism is also reflected in GBTA's recent travel survey where 80% of respondents expect travel volumes to increase in 2023 compared to '22. On the consumer side, domestic revenue remains well ahead of 2019, with international consumer revenue now fully restored. International is being led by the transatlantic where revenue was 12% higher than 2019 on 89% capacity restoration.\n\nPacific was the most improved entity in the quarter and generated the highest unit revenue growth. We are encouraged by how the Pacific recovery is progressing, led by strong demand in our hub in Korea and to Australia. And we expect continued improvement as Japan reopens. Turning to the December quarter.\n\nBookings for travel and spending on our co-brand cards continue to show healthy trends. We expect our revenue compared to 2019 will continue to improve in fourth quarter, up 5% to 9% on 8% to 9% less capacity. Demand for transatlantic travel is extending well into the fall. Starting in October, we anticipate flying more transatlantic capacity than 2019, making it the first geography to exceed 2019 capacity levels.\n\nAnd while European currencies are down versus the dollar, foreign yields are more than offsetting the foreign exchange impact, and U.S. demand is driving higher U.S. point of sale than 2019. October and November revenue is trending well.\n\nThe December month will be impacted by an elongated period between the holidays and more return travel than usual pushed into January. Demand for the entire holiday period, however, is very robust. Fourth quarter unit revenues are expected to be up mid-teens versus 2019 as we continue to restore international capacity and increase domestic stage length. During the pandemic and through 2022, we set out a goal to improve our share in coastal gateways to become the leading global carrier in these important revenue centers, and I am proud of the team for successfully achieving this goal.\n\nLooking to 2023, we are shifting our focus to our core hubs, Atlanta, Minneapolis, Detroit and Salt Lake City, with approximately 75% of domestic seat growth dedicated to full restoration of our higher-margin core hubs. As our plan progresses, Delta will continue to prioritize our people and our customers, and extend our competitive advantages. In closing, we're coming into the final quarter of the year with a healthy demand backdrop, running the most reliable operation and exceeding our key commercial goals. And with that, I'd like to turn it over to Dan to talk about the financials.\n\nDan Janki -- Chief Financial Officer\n\nThank you, Glen, and good morning to everyone. The September quarter demonstrated progress on our financial priorities to drive margin improvement and reduce debt. We reported a $1.5 billion operating profit, and that's on a margin of 11.6%, our second consecutive quarter with a double-digit operating margin. That is on a network that's 17% smaller than 2019.\n\nOur non-unit fuel costs were 22.5% higher, in line with guidance, excluding the impact of the hurricane on capacity. The refinery generated profit of $192 million partially offsetting the impact of volatile crack spreads. Gross capex spend was $1.5 billion as we took delivery of 11 aircraft, including five A321neos, which are generating margins approximately 10 points higher than the aircraft they're replacing. CapEx was lower than our guidance, with fewer delivery -- with a few delivery delays, and we now expect capex spend of $5.7 billion for the full year.\n\nWe ended the quarter with $20.5 billion of adjusted net debt. We repaid $1.8 billion of debt during the quarter as we continue to manage down our maturities over the next several years. This brings our debt repayment to over $4 billion year-to-date, reducing our run rate interest expense and reflecting our continued focus on returning to investment-grade metrics by 2024. For the December quarter, we expect earnings to be between $1 and $1.25 per share and an operating margin of 9% to 11%.\n\nFuel prices remain volatile. With the most recent move up last week, we expect fourth quarter adjusted fuel price per gallon between $3.35 and $3.55. This includes $105 million contribution from the refinery equating to a $0.23 per gallon benefit. We expect the December quarter unit cost to be 12% to 13% higher than 2019.\n\nThis is a 10-point improvement sequentially and shows clear progress as capacity restoration increases from the low 80% to low 90%. It's taken significant resources to rebuild the airline with industry-leading reliability. We are nearing the final stages with the workforce now in line with 2019. From here, we expect further benefit from scale as we reach full network restoration and better utilization of our fleet, our hubs and our workforce.\n\nThe incremental cost to restore additional capacity is low as the resources are already in place, reducing unit costs. As Glen noted, much of our growth next year will be in our lowest cost core hubs through increased mainline aircraft utilization. Approximately 75% of our domestic seat growth in 2023 will be in our core hubs, including 45% from Atlanta alone. Further, between inefficiencies and rebuild expenses, we are carrying over $1 billion of excess costs in 2022.\n\nWith the teams in place and the operations running reliable, we are seeing early improvements in efficiency. October metrics are pacing ahead of September, and we expect to return to historic levels as elevated training and the network normalized next summer. Achieving scale while restoring efficiency are Delta's largest CASM levers. These are within our control based on the pace of restoration and running an operation in line with Delta's standard of excellence.\n\nWe know managing cost down is the best protection from economic uncertainty, and it is a companywide priority. We are making progress restoring our financial foundation with significant profitability and positive cash flow this year. As we fully restore our network and unit costs improve, we expect another step-up in earnings next year, resulting in meaningful cash flow to further reduce our debt on path to our long-term targets. We are confident in delivering a competitive cost structure and our 2024 mid-teen margin target.\n\nIn closing, I want to recognize the Delta entire global team for the operational improvements they delivered over the past few months. We are on track for meaningful and well-deserved employee profit-sharing payments, and I look forward to celebrating with our employees in February. Now with that, I'll turn it back to Julie for Q&A.\n\nJulie Stewart -- Vice President, Investor Relations\n\nCody, can you please remind the analysts how to queue up for questions?\n\nOperator\n\n[Operator instructions] We'll now take our first question from Conor Cunningham with Melius Research. Please go ahead.\n\nConor Cunningham -- Melius Research -- Analyst\n\nHey, everyone. Thank you. You touched on it a little bit in the prepared remarks, but the opportunity [Inaudible].\n\nJulie Stewart -- Vice President, Investor Relations\n\nConor, you're cutting out. Conor, you're cutting out. Can you please repeat your question?\n\nConor Cunningham -- Melius Research -- Analyst\n\nIs that better?\n\nJulie Stewart -- Vice President, Investor Relations\n\nTry again.\n\nConor Cunningham -- Melius Research -- Analyst\n\nIs that better?\n\nJulie Stewart -- Vice President, Investor Relations\n\nYes.\n\nConor Cunningham -- Melius Research -- Analyst\n\nOK. Cool. You touched about the opportunity in Atlanta and the other core markets in 2023, and I think that's a really powerful trend for you guys. And I was just wondering if you could unpack it a little bit more, just -- I think you're really [Inaudible] flow traffic.\n\nAnd you kind of -- your priority [Inaudible] market or other markets [Inaudible] recovery. So could you just talk about the margin profile of flow traffic in general and just how you expect that to trend into next year? Thank you.\n\nGlen Hauenstein -- President\n\nRight. Well, we set really two priorities during the pandemic that we wanted to come through that we thought would be important for the long-term strength of the franchise, and one was to improve our competitive positions in the coastal gateways. And we've certainly completed that as we exited the pandemic and get into a more normalized demand sets. So if you look at places like Los Angeles where we've now taken the No.\n\n1 position or Boston in terms of revenue, same in Boston, and we've strengthened our position in key markets like Seattle. So that was very important for us. The other thing to do was to not lose share in our core, and that was really the very tricky part. So we went in with a share in our core hubs of about 58% to 59% when you added them all up.\n\nAnd our goal is to exit at 60% or above, and we did that as well. So if you think about our core being approximately 20 points less restored than the coastal gateways, which are now fully restored or actually growing, maintain your core hub share or actually increase it, there was a lot of focus on that through the revenue management systems. So we choked off what I would say is more of our traditional flow in very key markets where Delta has historically been the leading carrier, particularly in the Southeast. And so, as we head into -- and these customers or our customers are in our loyalty program.\n\nBut in a lot of cases, they couldn't get fares that were competitive on Delta because we didn't have the seats to produce those. And really, as we head into 2023, our task that we've assigned our team is to get those historical high-yield flow customers back on Delta. And that's really our -- what our rebuild phase for 2023 is all about.\n\nOperator\n\nThank you. We'll take our next question from Savi Syth with Raymond James.\n\nSavi Syth -- Raymond James -- Analyst\n\nHey, good morning, everyone. I was [Inaudible] to achieve those kind of goals that you just talked about on the pilot side, could you detail a little bit more about what you're seeing in terms of training bottlenecks and pilot staffing on the mainline side, as well as maybe attrition and staffing levels on the regional side?\n\nEd Bastian -- Chief Executive Officer\n\nI could take it, Savi. We continue to make good progress in clearing those bottlenecks and getting our pilots into seats and categories every week. We're producing more and more pilots back to the operation. As we said in our remarks, our goal is to be in a position to have our network fully restored by the summer, and the pilots are obviously a big part of that.\n\nSavi Syth -- Raymond James -- Analyst\n\nBut can you provide a little bit more color on the regional side given that's a little more unique as to what's happening there and not just about training throughput? Is some of the kind of the changes that you're seeing in the industry in terms of pilot rates and things like that, is that having an impact? What's Delta doing to make sure you're rebuilding those -- that capacity?\n\nGlen Hauenstein -- President\n\nRight. Well, clearly, the labor rates at the regional carriers have moved during the pandemic, and they're at significantly higher rates than they were prepandemic. I think long-term conventional wisdom is that will mean that the regional fleet in the long run are smaller. In the short run, we're wanting to get to a stabilization of demand for pilots, and we think that will occur sometime in '23.\n\nThese new higher rates should keep more people in place. And so -- but we don't think it will be fully restored until probably '24, '25 at the earliest. And we're uniquely positioned there because we have the, of course, A220s, which we're delivering every month or so. And we've reactivated the 717s, which were actually not in our original plan for reactivation, but we've leaned on them pretty heavily to rebuild more quickly.\n\nAnd we think it's a better product. And now with the new labor rates, it's at lower unit cost, as well as, yes, much lower unit cost than prepandemic. So I think we're uniquely positioned there with really the only major carrier that has these plethora of 100-seat airplanes. And we'll see what happens with the regionals in '23, but we think we're near the bottom in terms of pilot availability there.\n\nEd Bastian -- Chief Executive Officer\n\nAnd one other thing I'd add is that we have the lowest regional jet footprint in the industry. We've been on a half, Savi, over the last decade to eliminate the 50-seat regional jet, and we're just about there. So we are out of that category. We do have 325 2-class regional jets, which we will continue to maintain going forward, but we are far less exposed than others to the -- some of this regional pilot shortage issue.\n\nSavi Syth -- Raymond James -- Analyst\n\nHelpful. Thank you.\n\nOperator\n\nThank you. We'll now move on to our next question from Brandon Oglenski with Barclays.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nHey, good morning and thanks for taking my question. Glen, I'm sure you've gotten this from a lot of investors. But obviously, folks are worried about a looming recession in the U.S. just driven by rates and inflation.\n\nAnd we're reminded of that again today. But obviously, your revenue guidance is pretty positive, but I do think it's a sequential decline in your yields. Can you talk to the components there? Because I know your long-haul flying is coming up as well. Just if you're seeing any weakness or softness across your geographies.\n\nGlen Hauenstein -- President\n\nYes. I think that's a great question, and I'm happy to explain it. Really, it's three main factors. One is international restoration continuing in 4Q as we -- as Pacific continues to open up, and we continue to increase our capacity in the Pacific that has downward pressure on RASM.\n\nDomestic stage is going up dramatically and at a different rate than some of our competitors and all of our competitors as we head into 4Q. That's really being driven by a lot of additional flying into Hawaii from the East Coast hubs that we didn't have prepandemic. And lastly, it's that period and the shift of the holiday return in December where December will be below trend, and January will be above trend. So those are the three main factors that are driving the sequential decline.\n\nAnd we're not seeing -- taking those out, we're not really seeing a decline at the market level. It's actually continuing to be quite strong, and we don't just see any impact yet. We're looking, of course, vigilant of looking for it, and we'll make adjustments as necessary if it does. But I think Ed was very clear earlier that we think that we have -- as an industry, very off trend in terms of our percent of GDP.\n\nAnd just getting back to that represents a huge upside to the industry.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nAnd I guess related to that, can you talk about business travel recovery in the quarter and what you're seeing right now in the fourth quarter?\n\nGlen Hauenstein -- President\n\nYes. I think we outlined earlier conferences that we've seen about a 10-point improvement between 3Q and 4Q, and we see that continuing through 4Q. So we're now in the low to mid-80s in terms of revenue, with traffic being about 10 points below that. And that's what we see as we head into the end of the year.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We'll now take our next question from Michael Linenberg with Deutsche Bank.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nHey, good morning, everyone. Ed, I want to go back to the comment that you made in your opening comments. You said something about $20 billion to $30 billion on the table relative to GDP. Can you shed some light on that? And are you assuming that we get back to that historical relationship? Or are you building in some cushion there? If you could elaborate.\n\nEd Bastian -- Chief Executive Officer\n\nSure, Mike. That's an industry number, as you can appreciate. And that gets you closer to the historical relationship. We've seen over many, many years, it's a very sticky relationship.\n\nWe saw it fall a bit after 9/11, and we saw it bounce back. We saw it fall during the recession. We've seen it bounce back. And we certainly saw it the biggest fall ever coming back from the pandemic.\n\nSo one of the things that we're seeing is such outsized demand for our product across the board. And when you couple that as well with the industry constraints that we also talked about, that is also keeping the pricing strong at the same time. So whether we get back to the full $20 billion or $30 billion, I don't know, but I think we're gaining on it as we go.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nOK. Great. And then, just a quick one, Glen, on the percentage of your total revenue that ties to a premium and diverse revenue streams. I think we're at 54% now, but the goal is to get to 60% by 2024.\n\nThat seems somewhat conservative, but maybe you're envisioning just a much bigger pie as other segments recover like Asia Pacific, and that's probably why it's taking that much longer. Am I thinking about that correctly? Or is there something else going into that?\n\nGlen Hauenstein -- President\n\nI think we're very, very confident in getting to 60% given that we've been less restored internationally, and internationally has actually a higher component of premium revenues and, as well as the new fleets coming in and the continuation of growth at American Express [Inaudible]. So I think the one that we're not confident with right now is cargo for 2024. We've seen some lowering yields, but that's being more than offset by the international restoration. So I don't see that continuing to grow at double digits as we head into '24.\n\nBut I think 60%, as you pointed out, was our aspirational target. As we get closer and closer to it, it looks like it's -- we may need to increase that as we get closer to '24.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nVery good. Thanks, everyone.\n\nOperator\n\nThank you. We'll now move on to our next question from David Vernon with Bernstein.\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nHey, good morning, guys. Thanks for taking the question. So Dan, you mentioned the cost of adding incremental capacity right now is very low as we get through to '23. '24.\n\nCan you talk about how low that is relative to the average? And then, maybe as a follow-on, Ed or Glen, can you talk to the topic of maintaining capacity discipline, right? Obviously, if there's a way to unlock cost, you want to unlock the cost, but you also don't necessarily want to flood the market. How could -- how would you suggest we kind of sue the investor concerns about that tension between adding capacity to lower cost versus potentially adding too much capacity and tipping over the fair cart?\n\nDan Janki -- Chief Financial Officer\n\nOK. First, on the cost opportunity and the incremental costs associated with it. When you think about where we are this year in '22, we're 18 points higher on a unit cost basis versus '19. And in there, there's over nine points related to scale and the ability to put scale in going from 85% restored to being fully restored.\n\nThat would go in at low incremental CASM in the $0.03 to $0.04 range. And then, there's another five points related to -- I talked about over $1 billion related to the rebuilt and inefficiencies. About half -- almost half of that is rebuilt. And when you think about that bucket, half of that is just the hiring and training intensity that we're under.\n\nAnd that will -- as Ed talked about, as we put people back in production, that will sunset. And then, the other piece is split between elevated over time as we've protected the operation and also the reactivation of the fleet from that product that isn't normal run rate maintenance. So that's really where you get the 14 points of opportunity of the 18, but the incremental piece is at nine points, which is very attractive incremental growth at low CASM.\n\nGlen Hauenstein -- President\n\nOn capacity, we are just going to continue to monitor it as we move forward. And each one -- each market is different. And when we look at it not at an aggregate level, but at a market level to ensure that our margins stay where we need them to be. And so, I think that's our -- has been our approach historically.\n\nIt's worked quite well. And our approach moving forward is that it's -- it's actually a very granular thing. And what we've seen is demand has come back very different in 2022 than it left in 2019. Although the aggregates are now above where we were in '19, where people are flying and why they're flying is very different.\n\nAnd so, that's where we're going to continue to focus on, seeing opportunities and capitalizing them in '23 as we move forward with our rebuilt.\n\nEd Bastian -- Chief Executive Officer\n\nAnd David, if I could add to Glen's comments, as you also appreciate, we've been, by far, the most cautious about building back our network given that we wanted to make certain we're doing it reliably, and we're doing it with our customers and our people in mind, first and foremost. And so, a good chunk of the restoration is solely that, just getting back up to our normalized industry share our full capacity and utilization of the airline. There are a lot more governors in this environment on the capacity than ever before, whether it's high-fuel prices, high-cost capital, difficulty getting pilot staffed, typically OEMs producing aircraft. So I think with respect to investor questions around overall capacity levels, I feel very comfortable with what we're doing here at Delta.\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nSo is it fair to say that profitability is more important than achieving some unit costs and market share goal?\n\nEd Bastian -- Chief Executive Officer\n\nOf course. It's always about profitability and margins. And that's why I said in my remarks, I think we are uniquely positioned to do both, to grow where we haven't had the opportunity to grow as quickly as others have grown with strong demand supporting that, coupled with a significant unit cost benefit as we move forward because we already own all the assets and we already have the full staffing numbers pretty much on property.\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nAll right. Thanks for the time, guys.\n\nOperator\n\nThank you. We'll take our next question from Sheila Kahyaoglu with Jefferies.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nGood morning, guys. Thank you for the time. Maybe I wanted to ask a big picture question, Ed. Industry unit revenues are up fairly substantially over the long-term trend due to a number of factors you guys have talked about.\n\nI know you don't want to comment on forward pricing trends for you, but broadly about the industry. Do you think that through the pandemic -- with the growth of expansion of premium, growth of loyalty products and other shifts, do you think that there's a structural shift in the way airlines think about pricing and the consumer takes that price?\n\nGlen Hauenstein -- President\n\nYes. I don't -- we don't ever comment on forward pricing. And I think what you've seen is that the industry has done a good job historically now in recovering the higher cost in both fuel and nonfuel. And I don't see anything that would indicate that that's not going to be the case moving forward.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nOK. Then maybe just a quick follow-up. Can you just talk about the strength of the dollar versus other currencies and then how that's potentially affecting international demand at all?\n\nGlen Hauenstein -- President\n\nAbsolutely. Great question. As we know, the dollar is at historic highs right now. And normally, we would see that impacting our offshore point of sale in terms of realized fares.\n\nBut given the demand and supply balance that's existing right now in all of the international marketplaces that we serve, we see that not materializing. The fare increases have more than offset the lower currency rates. And indeed, the onshore tracking as a percent of 2019 is roughly in sync with offshore revenue. So really good balance.\n\nAnd what we've also seen is given the strength of the dollar, that outbound travel has more than offset a bit of weakness in terms of the outbound travel from the foreign point of sale. So all in all, that's been a very positive mix for us. At a service level, you might look at it and say that could be trouble. But for us, it's not been trouble as Delta.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We'll now take our next question from Scott Group with Wolfe Research.\n\nScott Group -- Wolfe Research -- Analyst\n\nHey, thanks. Morning, guys. So on the Amex side, $5.5 billion, you're talking about going to $7.5 billion by $24 million. How do you think about '23? Is it linear? How does the downturn in consumer spending impact that trajectory?\n\nGlen Hauenstein -- President\n\nI'd say given where we sit right now, we are very confident in the $5.5 billion, and we have some rate adjustments that occur in '23 that give you a good way to the $7 billion, and then the continued acquisitions. I think we're -- we have some cushion in there right now. And it's not a stretch objective to get to $7 billion in '24 as we sit today. And so, there's a little cushion in there should we see revenues plateau.\n\nWell, having said that, we have not seen card spend plateau. And although we have a record number of accounts in force, we're also seeing record spend on individual cards right up until today. So, I mean, this is really current numbers that we're looking at. And so, while we're mindful that that may trend down a little bit, I think we've got some cushion in there given the strong acquisition and, if any, the brand.\n\nScott Group -- Wolfe Research -- Analyst\n\nOK. And then, with all the talk about the excess cost in the network right now and restoring the network, what's your degree of confidence that CASM could be down year over year, '23 versus '22, and you can maintain sort of double-digit margin even if pricing starts to moderate?\n\nDan Janki -- Chief Financial Officer\n\nYes. It goes back to a little bit what I talked about earlier. When you think about sequentially year over year, we're up 18 points. So our confidence is as high as it relates to the 14 points that I talked about in an opportunity for clear improvement because of the capacity going in, 15 points alone drives over nine points of that.\n\nThe other one I gave you a lot of color on it is regarding the rebuild cost, and those will certainly sunset and dissipate as we complete the rebuild. And then, I think the last one is the efficiency, which is the other half of that five-point, and we'll get that over time. That's about the proficient -- the workforce and our resources getting more effective. It certainly is helped by the operational reliability that is foundational to that as that happens.\n\nAnd we see that the workforce will get the hours more aligned to the operations. And the underlying processes and efficiencies will come through.\n\nEd Bastian -- Chief Executive Officer\n\nAnd Scott, if I could wrap that, is that when you think about next year, obviously, we're going to be bringing a fair bit of capacity into the domestic system. That's going to help with what Glen mentioned earlier, a lot of our customers are priced out of our products. And so, we're going to be bringing more affordability, opening us up to additional buckets of demand. Yet at the same time, the incremental marginal cost of delivering that supply is substantially lower than any modest price adjustments we would see.\n\nScott Group -- Wolfe Research -- Analyst\n\nThank you, guys.\n\nOperator\n\nThank you. We'll now move on to our next question from Andrew Didora with Bank of America.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning, everyone. Glen, when I look at kind of your domestic passenger revenues, 3Q, they were up two. And 2Q, they were up 30.\n\nWhat do you think it takes to get the domestic network growth accelerating? Is it just the capacity adds in your core hubs that you spoke of earlier on? Or should we just think about the opening up of international markets being the main driver of the revenue recovery over the next few quarters?\n\nGlen Hauenstein -- President\n\nI think it's both, right, is that -- and pretty evenly distributed. We have first time [Inaudible] we're actually now bigger in the transatlantic in the month of October than we were in October of '19 and with very successful unit revenues and improved profitability there. So I think as we head through the winter, it's international growth. We have LATAM now really starting to come online in earnest.\n\nAnd then, the Japan opening in -- right now is a very exciting thing for us being a historically very large carrier in Japan. So if the international marketplaces are open and open without restrictions, we see robust demand, and we see that continuing to be our backdrop. We see -- we have good visibility now to the winter in Europe because the APs are a little bit longer in Europe. And so, now we're thinking about the spring.\n\nAnd I can't imagine that as we get to spring and summer of next year that we don't see another robust demand because we did miss three years of demand for the leisure travel to Europe. So people run out of time, myself included. And I think, gosh, how many years do I have left to do that? And so, I think we have a really good backdrop there. And then domestically, these are customers that we know want to fly Delta.\n\nThese are in our core regional markets that we just weren't able to produce capacity at attractive inventory levels that they would want to purchase on Delta. And as we bring those down, as Ed mentioned earlier, as we bring those relative fair premiums down, as we open up the hubs, we think that's going to be some relatively easy lifting for us.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nGot it. That's helpful. And just wanted to follow up from an earlier question as regard to the improved training pipeline that Ed mentioned earlier. Look, you've been very consistent about carefully building back the network by next summer.\n\nBut if you wanted to, would you have enough pilot availability and enough labor to accelerate that network restoration? Not saying that you will, but I'm just trying to get a sense of where you stand just in terms of the pipeline -- the training backlog.\n\nEd Bastian -- Chief Executive Officer\n\nYou can expect our network rebuild to be disciplined. It's going to steadily grow. But we're not going to fall in the trap we were last spring where we pushed ourselves too hard. So we learned from that.\n\nWe're not going to accelerate it faster, and we're ready to deliver.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We'll now take our next question from Jamie Baker with J.P. Morgan.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nHey, good morning, everybody. Glen, you commented a couple of times on corporate recovering, but looking different. Hoping you can expand on that, but also include leisure. And just a couple of examples.\n\nLooking at J.P. Morgan employee patterns, Friday meetings are increasingly difficult to get. So most of our employees are coming back Thursday night instead. I'm seeing people leave earlier for Thanksgiving since they know they can work on the road.\n\nI'm just looking for more examples of these type of shifts and, more importantly, whether revenue management and scheduling have to evolve to take advantage of it.\n\nGlen Hauenstein -- President\n\nI think they already have. And I think, as I mentioned earlier, that the demand sets are very different than they were in 2019 in terms of places people are going, in terms of times that they're going. And we're making those adjustments. I think one of the more interesting things, as you mentioned, Monday -- Sunday night outbound, Monday morning outbound used to be the peak.\n\nThat's now bleeding into Tuesday, out Tuesday, back Thursday, so some shorter trips midweek. It's bleeding into people, taking -- mixing business and leisure. So I know myself, I went to Paris last week for meetings, and I spent the weekend for leisure and before I probably would have just come back. So I think we see that.\n\nWe see in the holidays with people not having to necessarily be in the office as regularly as they did before the pandemic, and we see people stretching out the holiday. So Sunday night, Monday morning -- Sunday night returns or the Sunday after Thanksgiving was historically the highest revenue day we had in our network. That's now a little bit lighter, and we see that travel moving into Monday and Tuesday returns. So yes -- and we've been making those adjustments along the way, and I think pretty successfully.\n\nAnd I think it's pretty exciting, right, that it's coming -- in aggregate, it's coming back differently, but it's coming back even stronger.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nOK. And quickly for Ed. So Mark and I have been doing quite a bit of work on LATAM. You referenced it before now that the JBA is in place.\n\nCan you update us on the partnership? I mean, how have your forecast changed because of their restructuring, as well as the industry dynamic in South America? How should we think about the contribution of Delta going forward? Just an update there would be appreciated.\n\nEd Bastian -- Chief Executive Officer\n\nSure. A couple of things that have changed. One, as you know, they've also worked through the very difficult restructuring. And they're still not out of the court process, though they expect to be out sometime next month.\n\nSo we're anxious to see them out, and that's going to provide them some additional opportunities to start to grow and really take advantage of the powerhouse they've become, as well as the substantial reduction in cost, as well as balance sheet -- reductions on debt that they've been able to achieve through the bankruptcy process. We just got the ATI from DOT, and we're excited about that. So we haven't really been able to talk in three years to them at a detailed level about the JV itself, though those meetings are beginning literally as we speak. And it's a little bit of a delayed response, but there's nothing in there that we laid out three years ago when we announced the investment in LATAM that I'm any less excited for.\n\nI think if anything, we're going to have an accelerated impact there. The competitive balance in South America is less intense as a lot of local airlines got hit by the pandemic pretty hard. And you look at them, you look at what we're doing with Aeromexico in the same time, we see a lot of growth potential for Delta, as well as the JV.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nOK. Thanks for the color. I appreciate it. Take care, everybody.\n\nOperator\n\nThank you. We'll then move on to our next question from Duane Pfennigwerth with Evercore ISI.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nHey, thank you. Most of my questions have been asked. But maybe one for Glen on seasonality and sort of getting back to normal seasonality, which some other carriers have referred to. Can you just talk about which regions, if any, are sort of back to normal and maybe contrast domestic with some of the international regions, which are probably outperforming sequentially?\n\nGlen Hauenstein -- President\n\nI'd say there's a new normal on all of this. And while we do start to see seasonality patterns reemerging that we're not as present in the early stages of the rebuild, they're not as acute maybe as they were prepandemic. So we had a fantastic September to Florida, absent of the hurricane, which you wouldn't have thought. If you look at September, which is historically one of the worst months for Florida, you couldn't buy a ticket to Disney.\n\nWe had some people who were on break here, and they said they wanted to go to Disney with their families, and they couldn't buy a ticket. It's closed out. And so, I think we've seen this shift. And as airfares have increased and as hotels have increased and the whole -- people are also moving to the shoulders a little bit more because they can take advantage of the fact that on the margin, it's a little bit less expensive, and they have more flexibility with their work that they don't necessarily need to be in the office on those days.\n\nSo I think yes, there are definitely things that are reappearing in terms of more traditional seasonality. But I think also, there are a lot of things that are offsetting that [Inaudible] it and making it a little bit less pronounced as it was prepandemic.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nThat's helpful. And then, maybe just one for Dan. Just given the move in rates, any high-level thoughts on pension gains versus interest expense? And any particular pieces of debt that you'll need to roll in 2023 and how we should be thinking about that?\n\nDan Janki -- Chief Financial Officer\n\nYes. Certainly. As it relates to the debt stack, 17% of our debt is variable, and the size of that relative to our cash position, our cash position to outsize. So as you have increasing rates, actually, interest income will outpace interest expense meaningful through that period of time.\n\nOn the pension, you have both the -- when you think about it, rates reduce your liability, change your interest expense. Those are fairly neutral as you're going forward, certainly change in your asset returns versus your expected performance. And given how debt and -- the debt markets and equity markets have moved, we've underperformed the expected target rate. So you smooth those into earnings over a 20-year period, and then you earn off a lower rate.\n\nSo that would create a headwind. As you think about going forward, we'll talk more about that in December. We had that stepping down somewhat, but not to the degree that it will. But interest expense is ahead.\n\nAs we've been ahead on, on managing down our debt levels and ahead on that, our interest expense is coming in better, and our interest income will be better, which will be a partial offset to that.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nAppreciate the thoughts.\n\nOperator\n\nThank you. We'll then move on to our next question from Ravi Shanker with Morgan Stanley.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nGreat morning, everyone. I just wanted to confirm something that I heard you say about the holiday season being extended and that kind of pushing some demand into January. Can you unpack that a little bit and kind of talk about how much that impacted your 4Q comps versus 2019? And also, did you see something similar over the summer into the fall where do you think that some people who may have been priced at of traveling over the summer are now traveling in the fall?\n\nGlen Hauenstein -- President\n\nNo. I think it's mostly the fact -- just a calendar shift of where the returns are. And so, I think that's -- and we think it's about two points of sequential decline from -- in our 23.5 to 17, about two points of that is a shift of some of the returns of the holiday into January.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nUnderstood. Thank you.\n\nJulie Stewart -- Vice President, Investor Relations\n\nWe'll now go to our final analyst question.\n\nOperator\n\nThank you. We'll take our final question from Helane Becker with Cowen.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThanks very much for squeezing me in here. I appreciate the time. So team, here's my question. As you think about the shift in mix that you've been talking about, not just this quarter, but most of the year, how should we think about the importance of loyalty? You've talked about the increase in SkyMile cards and the spend you're seeing.\n\nBut I have to think that loyalty is shifting kind of away from that business traveler to the leisure traveler. So how should we think about that going forward?\n\nGlen Hauenstein -- President\n\nWell, Helane, I think at a macro level is that whatever your purpose was, the redemptions that [Inaudible] at the end was always for the leisure travel. And so, as people continue to see our brand evolving and want to become involved with it, whether or not it's for business or for leisure, we've seen the opportunity to continue to grow the program itself at record pace, which is very exciting and, I think, a real testament to the brand strength and all the hard work that delta people put out every day. And now it's our job to take that brand strength and turn it into profitability. And of course, we do that through using those as prospects for our American Express card, but we're also increasingly making our ecosystem broader.\n\nAnd I think just yesterday, we had a very claiming announcement about partnering with Starbucks and linking our programs together. And I think creating an exciting dynamic ecosystem that is the cornerstone of our loyalty program, which is, of course, based on the fantastic airline that Delta runs every day, is really the base of it. But we are very excited about where we can take this over the next five years in terms of expanding that loyalty platform to be more than just Delta as an airline.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThank you that's very helpful.\n\nJulie Stewart -- Vice President, Investor Relations\n\nAll right. With that, we'll wrap up the analyst portion of the call. I'll now turn it over to Trebor Banstetter, our managing director of enterprise and leader communications, to start the media questions.\n\nTrebor Banstetter -- Managing Director, Enterprise and Leader Communications\n\nThank you, Julie. Cody, as we transition to the media Q&A, please remind all the reporters on the call the process for joining the queue. We're going to try to get to as many questions as we can in our remaining time.\n\nOperator\n\nAbsolutely. Thank you. [Operator instructions] We'll take our first question from Mary Schlangenstein with Bloomberg News. Please go ahead.\n\nMary Schlangenstein -- Airline Reporter\n\nHi. Thank you very much. I wanted to first get a quick clarification. When you were talking about the regional capacity being constrained -- continuing to be constrained, and thus, your capacity being constrained by the pilot shortage, I thought I understood you to say you don't expect the full restoration at the regional level until '24, '25 at the earliest.\n\nI wanted to make sure I was hearing that correctly and whether you're talking about just Delta or if you're talking about the industry there.\n\nGlen Hauenstein -- President\n\nWell, I can't speak to the industry. I can speak for Delta. And yes, you've got it right, '24 to '25 is when we think we'll have the utilization back to historic levels on all the equipment we have contracted.\n\nMary Schlangenstein -- Airline Reporter\n\nOK. And my second question was in terms of -- during the pandemic where you had a lot of leisure travelers who were flying, opting to buy up into premium seats because a lot of them were empty, are you still seeing that same thing? Are you seeing a lot of them buying up? Or do you -- have you seen that pull back now and not happening quite so much?\n\nGlen Hauenstein -- President\n\nIt's strengthening as we get -- come out of the pandemic. So we're very excited. And I think we highlighted in the call that our recovery is being led by premium products. And premium products are -- restoration is 10 points ahead, main cabin and basic economy.\n\nSo very excited about people getting used to this, people enjoying it. And intend to repurchase is over 70%. So you see the customers coming back for more of this as well.\n\nMary Schlangenstein -- Airline Reporter\n\nAnd have you dropped the number of basic economy fares that you offer per flight or even total?\n\nGlen Hauenstein -- President\n\nThat fluctuates every day based on demand and supply. So in general, it's been trending lower, but that could reverse itself today or tomorrow. So it's not something we actively manage. It's kind of a daily occurrence.\n\nMary Schlangenstein -- Airline Reporter\n\nOK. Thank you very much.\n\nOperator\n\nThank you. [Operator instructions] Thank you. We'll take our next question from David Slotnick with TPG.\n\nDavid Slotnick -- Senior Aviation Business Reporter\n\nHi. Good morning. Thanks for the question. I'm wondering just with the growth in co-brand spend and card acquisitions and everything, are you seeing more numbers just year over year and year over '19 meeting medallion status or meeting the higher levels of status?\n\nGlen Hauenstein -- President\n\nAbsolutely. And we want to continue to evolve our program today. It's premium for our most premium customers. And as you all know, we announced some changes for the '24 program earlier this month, which was really designed to ensure that we had the correct people.\n\nWe were the most generous, as you know, also during the pandemic in extending benefit. So we actually have seen an incredible increase in the number of our most premium customers. And -- but our intent is to make sure that everybody who is a premium customer has a really premium experience. So we've got to balance that off.\n\nDavid Slotnick -- Senior Aviation Business Reporter\n\nAnd then, just considering the capacity cuts this summer and then the capacity discipline that we've seen going forward, I'm wondering if you have any thoughts on just outlook for the holiday season, what we're going to see in terms of operational reliability?\n\nEd Bastian -- Chief Executive Officer\n\nWe will deliver the type of experience for our customers that they expect, which will be continuing to run just a very, very strong operation. One of the things that Glen talked about earlier is the shift of travel within the holiday period itself. And I think you're going to see a more normalized flow than you would typically do. Holidays tend to be very peaky on the highest days and lighter on some of the less -- lower travel days.\n\nAnd with travelers having a lot more flexibility and mobility relative to work, I think you're going to see a busy period for the Thanksgiving week throughout the week. And that's going to help us operationally a bit as well, managing flow. And I think you'll also see that over the Christmas, New Year break as well.\n\nDavid Slotnick -- Senior Aviation Business Reporter\n\nThank you very much.\n\nOperator\n\nThank you. We'll take your next question from Alison Sider with The Wall Street Journal.\n\nAlison Sider -- Air Travel Reporter\n\nHi. Thanks so much. I guess just kind of thinking about the economy broadly. Just curious, from your vantage point, where do we think the economy is? Like are we headed toward recession? But it -- maybe you want where travel is more resilient than it's been in the past? Are we not? I guess just -- you guys have a pretty -- big picture view from where you sit, so [Inaudible] your thoughts.\n\nEd Bastian -- Chief Executive Officer\n\nWe mentioned in our remarks that -- and I really do believe it. So the airline industry, not just Delta, is in a countercyclical recovery because we're still building back from where we were. And so, the amount of supply that's in the market probably has already taken into account somewhat of any recessionary risks. We're not operating at Delta anywhere close to what we used to operate in the past, and that's why the demand of our product and the pricing for the product has been so strong.\n\nOur crystal ball is good for 90 to 120 days. After that, it gets a little murky. Our advanced bookings don't go out too much further than that in large numbers. But from what we can see and what our big corporates are telling us is that the travel sector of the economy is going to be very strong through the quarter and into the new year.\n\nSo that's the best we can. I can't speak for the broader economy. I know there's some pretty significant macro shifts going on in spending out of goods and into services, which we are beneficiary of. Of course, we contributed the last two years to the other side of that, and we're glad to see people back on the road.\n\nAlison Sider -- Air Travel Reporter\n\nAnd then, if I could ask one more. Just curious how you're thinking about share repurchases. Like you can sort of see that becoming a political issue already. I'm just curious how much sort of -- the pushback we've already seen from certain lawmakers and labor groups, how much that factors into your thinking about that?\n\nEd Bastian -- Chief Executive Officer\n\nOur sole priority at Delta is to make sure that any excess cash that we're generating is used to pay down debt. And we acquired a meaningful amount of debt during the pandemic. And we want to get our investment-grade rating back, as we've talked. So over the next couple of years, that will be our -- and beyond, by the way, not just the next couple of years, that will still be the top priority for any excess cash.\n\nAnd of course, we'll also be using our cash to continue to invest in the business and invest in our people. So that's where the cash is going. I don't see any share repurchases happening here at Delta for the foreseeable future.\n\nAlison Sider -- Air Travel Reporter\n\nThanks.\n\nOperator\n\nThank you. We'll take our next question from Leslie Josephs of CNBC.\n\nLeslie Josephs -- Airline Reporter\n\nHi, good morning, everyone. Delta has been putting in a lot of effort to position itself for a premium airline, and there's a lot of buyout into the premium cabins. Longer term, do you see a need for basic economy anymore? And then, just second question, how much bigger would the airline be if it did have -- was it up-to-date in pilot training, hiring? And how many aircraft it had?\n\nGlen Hauenstein -- President\n\nBasic economy is not a hard cabin. It's an availability of a fare, and we want to keep that in place. It's a very effective tool. We haven't used it as much historically because we've been so full.\n\nBut as we get to a more normalized environment, there probably will be more basic economy in -- available in '23 than there were in '24. And we created that because the way that the ultra-low-cost carriers price their products where they don't show you all of the add-ons, they show you a very low intro fare and then add on everything from carry-ons to soda. And so, we wanted to have a relatively de-counted product, although it's still far superior to the product that you buy on the ULCCs. It doesn't have all the products and the upgradability that the higher fare structures do.\n\nAnd it's a very effective competitive tool. But as I mentioned earlier, it's -- the fare structures are there, and they're either available because there -- we're not selling out on airplanes or they're not. And so, that's the way we've created it, and it's not a cabinet in and of itself. Where the premium products are actually hard cabins.\n\nThey're Comfort+ or Delta Premium Select or Delta One, which actually have physical attributes, as well as the other components. So --\n\nEd Bastian -- Chief Executive Officer\n\nAnd Leslie, on your second question, this summer, we operated roughly 15% below where we were in the summer of '19. And we said our goal is for next summer to close that gap and have our network fully restored. So I think that's a ballpark number of 15%. That doesn't mean we're going to have 15% more people or 15% more planes.\n\nIt's really just utilizing the people we already have because we're already at pretty close to 2019 staffing levels. And the fleet we have has taken a pretty significant utilization hit as we've reduced supplying and bringing it back. So it's really using the assets and the people we already have more efficiently. That's going to generate a meaningful amount of that growth.\n\nLeslie Josephs -- Airline Reporter\n\nOK. And have the passengers used most of their vouchers and credit that they got during the pandemic? Or are they still sitting on a lot of those? If you have any detail on how much or how many -- what the value is.\n\nGlen Hauenstein -- President\n\nWe don't release any details, but there's still -- there's -- we have very long-dated expiration on that. So nothing is going to expire until the end of '24. And there's still a sizable number of credits out there.\n\nLeslie Josephs -- Airline Reporter\n\nThank you.\n\nOperator\n\nThank you. We'll take our next question from Edward Russell with Skift.\n\nEdward Russell -- Journalist\n\nHi. I want to ask what Delta's plan is if the Congress does not extend the waiver for the 737 MAX 10 cockpits that expires at the end of the year?\n\nEd Bastian -- Chief Executive Officer\n\nWe -- I was asked this question on CNBC this morning, and I said there is a plan B. And of course, when we made the decision to buy the 10, we had a lot of conversations with Boeing around that specific question because it's a big part of our capacity, and we want to make certain that we're not going to be left without an alternative. So we do have a plan B. We're not discussing what that plan B is, but there is a plan B with Boeing in the event it doesn't get certified.\n\nThat said, we remain optimistic it will be certified.\n\nEdward Russell -- Journalist\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. We'll now take our next question from Dawn Gilbertson with Wall Street Journal.\n\nDawn Gilbertson -- Air Travel Reporter\n\nHi. Good morning. Ed, I wanted to ask you about the DOT's latest proposal on fee transparency. You guys and other airlines blasted it in 2014.\n\nWhat is your take on this latest proposal? I know you haven't filed a formal comment yet. And secondly, what do you think the chances are of this going through? Thank you.\n\nPeter Carter -- Executive Vice President, Chief Legal Officer, and Corporate Secretary\n\nGood morning, Dawn. It's Peter Carter. What I would say in response to the proposal is we think that customers do have access to fee and pricing information. Today, on the Internet, we think our pricing is transparent.\n\nWe will be providing formal comment to the DOT because one of the challenges with the rule as proposed is the way they're viewing transparency, they're expecting a carrier to provide a moment of making the search every single potential fee or price without regard to who's actually searching. So it may be a fee that's not relevant to the consumer, which, of course, could create quite a bit of confusion for consumers. So we'll be providing that input to the DOT, and we hope that they obviously see that rule as something that's unnecessary to impose.\n\nDawn Gilbertson -- Air Travel Reporter\n\nThank you very much.\n\nEd Bastian -- Chief Executive Officer\n\nThank you, Dawn. And we have time for one final question.\n\nOperator\n\nThank you. We'll hear next from Kelly Yamanouchi with the Atlanta Journal Constitution. Kelly, your line is open. [Operator instructions] All right.\n\nHearing no response.\n\nEd Bastian -- Chief Executive Officer\n\nAll right, Cody, we'll follow up with Kelly later, but I think that is going to conclude our call. So thanks, everybody, for listening and participating.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJulie Stewart -- Vice President, Investor Relations\n\nEd Bastian -- Chief Executive Officer\n\nGlen Hauenstein -- President\n\nDan Janki -- Chief Financial Officer\n\nConor Cunningham -- Melius Research -- Analyst\n\nSavi Syth -- Raymond James -- Analyst\n\nBrandon Oglenski -- Barclays -- Analyst\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nScott Group -- Wolfe Research -- Analyst\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nHelane Becker -- Cowen and Company -- Analyst\n\nTrebor Banstetter -- Managing Director, Enterprise and Leader Communications\n\nMary Schlangenstein -- Airline Reporter\n\nDavid Slotnick -- Senior Aviation Business Reporter\n\nAlison Sider -- Air Travel Reporter\n\nLeslie Josephs -- Airline Reporter\n\nEdward Russell -- Journalist\n\nDawn Gilbertson -- Air Travel Reporter\n\nPeter Carter -- Executive Vice President, Chief Legal Officer, and Corporate Secretary\n\nMore DAL analysis\n\nAll earnings call transcripts"
}