{
  "companyName": "Warner Music Group Corp.",
  "companyTicker": "WMG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/warner-music-group-corp-wmg-q3-2022-earnings-call/",
  "content": "Warner Music Group Corp. (WMG -0.85%)\nQ3 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to the Warner Music Group quarterly earnings call for the period ended June 30, 2022. At the request of Warner Music Group, today's call is being recorded for replay purposes, and if you object, you may disconnect at any time. Now, I would like to turn today's call over to your host, Mr. Kareem Chin, head of investor relations.\n\nYou may begin.\n\nKareem Chin -- Head of Investor Relations\n\nGood morning, everyone. Welcome to Warner Music Group's fiscal third quarter earnings conference call. Please note that our earnings press release, earnings snapshot and the Form 10-Q we filed this morning will be available on our website. On today's call, we have our CEO, Steve Cooper, and our CFO, Eric Levin, who will take you through our results, and then we will answer your questions.\n\nBefore our prepared remarks, I'd like to refer you to the second slide of the earnings snapshot to remind you that this communication includes forward-looking statements that reflect the current views of Warner Music Group about future events and financial performance. We plan to present certain non-GAAP results during this conference call and in our earnings snapshot slides and have provided schedules reconciling these results to our GAAP results in our earnings press release. All of these materials are posted on our website. Also, please note that all revenue figures and comparisons discussed today will be presented in constant currency, unless otherwise noted.\n\nAll forward-looking statements are made as of today, and we disclaim any duty to update such statements. Our expectations, beliefs and projections are expressed in good faith, and we believe there is a reasonable basis for them. However, there can be no assurance that management's expectations, beliefs and projections will result or be achieved. Investors should not rely on forward-looking statements because they are subject to a variety of risks, uncertainties and other factors that can cause actual results to differ materially from our expectations.\n\nInformation concerning factors that could cause actual results to differ materially from those in the forward-looking statements is contained in our filings with the SEC. And with that, I'll turn it over to Steve.\n\nSteve Cooper -- Chief Executive Officer\n\nThanks, Kareem. Good morning, everyone, and thanks for joining us today. Given these turbulent times, I'd like to start by reaffirming why we're so positive about WMG's future. As the pandemic prude, music is an essential need for humanity.\n\nThis need has and will continue to make the music sector more resilient than many other industries. Streaming, our largest revenue source, has a long runway, and there's substantial headroom for both subscriber growth and subscription fee increases. We continue to see an explosion of new opportunities in sync, social media, gaming and NFTs, as well as the resurgence of vinyl sales and the bounce back in touring-related revenue. Over the long term, we're no longer reliant on any single format.\n\nToday, music propels and monetizes across every form of entertainment. In the digital age, artists have more ways than ever to engage and excite fans, which magnifies the importance and value of music companies such as ours. Against this backdrop, we're uniquely positioned for long-term success. We have the scale, skill set and agility to best capitalize on trends in artist development and drive the globalization and diversification of our business.\n\nIt's from this position of strength that we want to be clear about some challenges that we encountered in Q3. We've had to deal with very, very significant FX headwinds as we report in dollars, not euros or yen. The slippage of a number of key album releases into Q4, macro advertising trends resulting in a slowdown in ad-supported revenue and the ongoing suspension of our Russian operations. In addition, our reported results were impacted by several previously disclosed onetime items that affect year-over-year comparisons.\n\nThese include the deal renewal with one of our digital partners, which affects all four quarters of this fiscal year, but not beyond, and the benefit in the prior year quarter from a catch-up payment related to another of our digital partners. As always, our goal is to help you reconcile reported results to underlying performance. We're committed to making sure that these items are more clearly understood in the future. Eric will go into more detail about our normalized numbers shortly.\n\nSo on to our results. Total revenue in the quarter was over $1.4 billion. This represents year-over-year growth of approximately 7% and 12% on an as-reported and constant currency basis compared against an incredibly strong Q3 in 2021. Adjusted EBITDA declined 6.7% to $263 million with a margin of 18.4% compared to 21% in the prior year quarter.\n\nThe year-over-year adjusted EBITDA decline was driven primarily by FX headwinds. The margin decline was impacted by the strong resurgence of our lower-margin artist services offerings. In recorded music, our revenue was approximately $1.19 billion, an increase of 8.5% from the prior year quarter with streaming revenue up 2.7%. As I mentioned, factors such as ad-supported streaming weakness impacted these results.\n\nHowever, these percentage increases do not accurately reflect the true strength of our streaming business. Normalizing for the previously discussed onetime items, recorded music streaming revenue grew by 9.2%. Artist services continued to show impressive recovery with revenue growth of 55.7%, while licensing was up 8.7% and physical was up approximately 2%. Publishing had a very strong quarter with revenues of $245 million, approximately 35% more than the prior year quarter.\n\nI'd like to note, we expect an uplift in our Q4 recorded music streaming revenue driven by a very strong release slate, including new music from Cardi B, Lizzo, Panic at the Disco, Argentina's Paulo Londra, Nigeria's CKay, and South Korea's Aespa. In addition, we have recently signed new deals with Meta that will deliver additional revenue in Q4. Our new deals include an expanded revenue-sharing model that will open up additional opportunities for both frontline and catalog artists. With that in mind, I'd like to spend the rest of my remarks today picking up on the theme of why we're so confident about our future.\n\nMany of you have heard me talk before about the key pillars of our long-term strategy, music, globalization, innovation and people. I'd like to explain how we're distinguishing ourselves in each of these areas and talk a bit about our ambitions. As always, let's start with the music. We often get asked whether all the major music companies are just tracking the same data and chasing the same artists.\n\nIf you look at our biggest stars, you can see that that's not true for us. Long-term artist development has been a hallmark of WMG for decades with stars like Madonna, Joni Mitchell and Fleetwood Mac, among many others. Today, we remain absolutely committed to backing originality. Ed Sheeran, Cardi B, Anita, Dua Lipa, Bruno Mars and others are all extraordinary artists that were signed to our labels very early in their careers.\n\nIt should be noted that last month, Ed Sheeran became the first artist to hit 100 million followers on Spotify. Q3 saw the return of Lizzo, one of our most talented new superstars. Her monster hit, About Damn Time, achieved No. 1 status in the US while reaching the top three in Australia, Belgium, Canada, New Zealand and the UK Released last month, her claim new album, Special, hit the top 10 in key markets, including the US, UK, Canada and Australia.\n\nThe sophisticated multi-platform campaign Behind Lizzo's new release is a great example of what's possible when a true original is backed by our creative global team. By way of example, in April, Lizzo made her debut in the metaverse by performing its Song Breaker, the first music award show on Roblox. In July, she celebrated her album release with an exclusive light show experience in concert in New York sponsored by American Express and live streamed on Twitch. In the fall, a documentary about Lizzo's life is coming to HBO Max.\n\nThe film is coproduced by Warner Music Entertainment and Atlantic Films. Around the world, we've had a string of smashes from some of our most exciting international stars, including Nigeria's Burna Boy, Japan's Tatsuro Yamashita and the UK Zelus System. Back in the US, Jack Harlow celebrated his first solo single No. 1, while the Red Hot Chili Peppers 12th studio album debut at No.\n\n1 in the US the UK, Germany and 13 other markets around the world. We also helped propel the explosive success of Kate Bush's Running Up That Hill in the new season of Netflix Stranger Things. Originally released in 1985, the song returned to No. 1 on Billboards Global 200 and Spotify's daily global charts.\n\nThis is a great example of the evergreen power of unique songs and recordings, as well as further proof that there are no barriers in the modern music business. Irrespective of genre, geography or generation, a hit can emerge and reemerge from anywhere from anyone at any time. Meanwhile, our publishing on Warner/Chappell is really humming. Our songwriters scored 86 songs on the Billboard Hot 100 in Q3.\n\nOur Nashville team was named Billboard's Top Country Music Publisher for an unprecedented 21 consecutive quarters. Culture-shifting songwriters welcome to Warner/Chappell this quarter include Too Dope, who coproduced Drake's Way 2 Sexy, Puerto Rican rapper Villano Antillano, an influential figure in the queer Latin rap scene, and Tyson Yoshi, one of Hong Kong's top hip-hop singer songwriters and independent artists. We also signed a wide-ranging partnership with Hollywood star and popular comedian Kevin Hart and his media company, Heartbeat. We're administering all of Heartbeat songs, covering past and future works for film, TV, gaming and Web3.\n\nOur shift to becoming a truly global music enterprise continues to pay off. We've taken a two-pronged approach, growing our local expertise and talent, while making targeted investments in forging partnerships with local best-in-class operators. A case in point, back in 2014, we were first movers in China, taking two important steps that year. We acquired one of the largest independent catalogs, Gold Typhoon, and we were the first major music entertainment company to strike a wide-ranging partnership with Tencent.\n\nIn 2014, China was the 19th ranked music market in the world. Last year, it was in sixth position, and climbing. Deals made a number of years ago have been critical to us being in the pole position to capitalize on continued growth in China, where our revenue is seven times what it was in 2014. We continue to spot the markets that are going to ignite and deploy a bespoke strategy for each one.\n\nWe've spoken to you in the past about the launch of Warner Music in India, and our organic growth market share in Brazil. More recently, we've transacted with Kanawat and Rotana in the Middle East and Chocolate City and Africori in Nigeria and across Africa. This quarter, we launched Warner Music in Israel, which is a fast-growing market with real global potential. Our roster there already includes Superstars, Noah Curel and Nova Wav, and we have some exciting plans to further turbocharge our growth in this market.\n\nAs a company that thrives at the intersection of art and tech, our commitment to innovation is helping us create a bright future for our artists, our songwriters and ourselves. We're constantly experimenting with ways to improve, expand and diversify our revenue streams. Last month, we became the first major music entertainment company to adopt SoundCloud's fan-powered royalties model, which pays artists based on individual users streaming habits. This quarter, our in-house podcast network, Interval, presents added shows to our portfolio such as the acclaim series WrapRadar and the web-nominated Holding Court.\n\nAt the same time, we've established a reputation as the company to come to first if you want to do anything really groundbreaking in music. We continue to harness the tools, tech and protocols that collectively make up Web3. By constantly learning and evolving, we are simultaneously strengthening our role as the connective tissue between fans and artists by unlocking new opportunities in these rapidly changing environments. Here are just a few examples of our many recent initiatives.\n\nTwo of our artists, Jason Derulo, and 22Gz teamed up with TerraZero to recreate real-life landmarks on the virtual platform Decentraland. This partnership helped us expand our horizons across multiple metaverse worlds and tap into new promotional avenues. Warner Records UK, partnering with Bose to offer a first-of-its-kind NFT collection called Stick Men Toys. Using a custom-built algorithm, visual art was mapped to audio stems, creating a set of unique collectible characters.\n\nStick Men Toys has been extremely successful, peaking at No. 2 on OpenSea, the world's largest NFT marketplace. And finally, through our participation in a funding round for authentic artists, we're helping to redefine communal music experiences for the metaverse. Authentic artist is an industry-leading music platform powering virtual artists, digital collectibles and interactive music experiences using cutting-edge AI.\n\nBefore I move on, I'd like to mention that we were pleased by the July 1 Reman decision by the US Copyright Royalty Board, or CRB, in Phono Records 3, which covers streaming royalties for the 2018 to 2022 period. After a long drawn-out appeals process, streaming services are finally being required to pay songwriters and publishers the percentage of revenue rates that were set by the CRB in February 2019. These rates escalate annually from 11.4% in 2018 to 15.1% in 2022. This marks a hard one increase from the 10.5% rate previously set by the CRB for 2017 in Phono Records 2.\n\nSince many digital services were continuing to pay songwriters and publishers at that 10.5% rate during the appeals process. The Reman decision will require them to make significant retroactive payments. It's an important step in the fight for fair compensation for songwriters. Before I talk a bit about our people, I want to honor Mo Ostin, the legendary former Chairman and CEO of Warner Bros.\n\nrecords. On August 1, we announced that Mo had passed away peacefully at 95. There was an unbelievable outpouring of loving tributes from across the entire spectrum of artists and executives who have been part of our industry for decades. Mo was one of the greatest music executives ever.\n\nHe was a driving for in shaping the Warner Music Group as we know it today. He will be hugely missed, and our deepest condolences go out to his family. I'll now give a few brief updates about our commitment to diversity, equity and inclusion and the ways our people are impacting local communities. First, we're reinforcing our unique company culture through state-of-the-art headquarters in different territories.\n\nThe latest example is our music station in Madrid, a creative hub housed in a renovated train station originally built in 1861. This facility in courts recording studios, a content creation lab and a live music venue, providing round-the-clock access to spaces like this not only helps us attract and retain talented executives, artists and songwriters, but also fosters creativity and collaboration in a post-COVID world. Second, our Warner Music Group, Blavatnik Family Foundation Social Justice Fund, announced its fourth tranche of grantees this quarter and held its first grantee convening event. 56 leaders from 26 organizations came together to advance social reform across the arts, education and criminal justice.\n\nThird, 300 Entertainment and Atlantic Records are leading the fight to prohibit prosecutors in the US from using rap lyrics as concessional evidence in criminal trials. We're supporting the project Black initiative whose mission is to end these racially discriminatory attacks on creative expression. Finally, in the wake of the Supreme Court's decision to overturn Roe v. Wade, our priority is keeping our people safe.\n\nWe believe that everyone has the right to control their reproductive health. To that end, we've expanded our healthcare services, including financial and legal support, so our employees can exercise that right no matter where they live. In addition, we've matched employee donations supporting the important work of the center for reproductive rights. To wrap up, I know that in this current macroeconomic climate, everyone is being inundated with information about short-term trends.\n\nBut while we're very focused on consistently delivering quarterly results, that's not the primary lens through which we look at our business. Over the past five years, we've grown revenue by 63% on an as-reported basis and adjusted EBITDA by almost 100%, while generating about $2.5 billion of operating cash flow. In this industry, real success and real returns come from taking the long-term view. It's about setting the right trajectory that will take us to new heights.\n\nWe believe that the Warner Music Group is absolutely on the right path, and we look forward to keeping you updated as we continue to build tomorrow's story. With that, I'll turn it over to Eric.\n\nEric Levin -- Chief Financial Officer\n\nThank you, Steve, and good morning, everyone. Our Q3 results reflect the inherent resilience of our business that comes from our diverse portfolio of revenue streams. Even in a quarter where ad-supported streaming revenue came under pressure due to macro trends, we still grew most of our revenue lines and saw significant growth in operating and free cash flow. Total revenue increased by over 12% on a constant currency basis, reflecting growth in both recorded music and Music Publishing.\n\nTotal company streaming revenue increased 6.5%, driven by growth across both segments. Adjusted for the onetime items that I will describe in a moment, total revenue and streaming growth were 14.9% and 10.3%, respectively. Companywide streaming revenue from emerging platforms was sequentially flat at $345 million on an annualized basis. As Steve mentioned, this revenue will increase in Q4, driven by new deals with platforms, including our recently signed deals with Meta.\n\nAdjusted OIBDA declined 3% with margins of 17.8% compared to 19.6% in the prior year quarter. On a constant currency basis, adjusted OIBDA increased 2.4%. The decline in margin was primarily due to revenue mix driven by the growth in lower-margin artist services revenue and the impact of exchange rates. The impact to adjusted OIBDA growth and margins was magnified by the reduction in streaming revenue, which was primarily driven by onetime items.\n\nNormalizing for these items, consolidated adjusted OIBDA on a constant currency basis grew 13% and margins would have declined by only 40 basis points. Adjusted EBITDA decreased 6.7% with margins declining from 21% to 18.4% due to the same factors that impacted adjusted OIBDA. recorded music revenue grew 8.5%, driven by growth across all revenue lines. Streaming revenue increased by 3% compared to a very strong prior year quarter that saw impressive growth of 27%.\n\nOur prior year quarter performance was driven by outsized growth in ad-supported streaming revenue that was recovering from COVID, new deals with emerging streaming platforms and some especially successful releases. By comparison, our streaming growth in Q3 '22 was more muted due to deceleration in ad-supported streaming revenue, driven by the challenging macro environment and shifts in the timing of new releases. Normalized subscription streaming revenue grew in low double digits, in line with the market. However, ad-supported streaming growth, which has been trending in the high teens, fell into the low single digits in Q3.\n\nAdditionally, there were several previously disclosed items that impacted comparability for the quarter. A new deal with one of our digital partners, which commenced in Q1, created a $34 million Q3 headwind and an $11 million benefit in the prior year quarter due to a catch-up payment related to one of our digital partners. Adjusting for the impact of these onetime items, recorded music total revenue and streaming revenue grew 13.1% and 9.2%, respectively. While the macro challenges to ad-supported streaming revenue may persist for some time, we expect streaming growth to improve for us in Q4, bolstered by a robust release schedule, a less challenging prior year comparison and new deals with emerging streaming platforms.\n\nartist services and expanded rights revenue growth accelerated and increased by 56%, primarily reflecting a boost in concert promotion revenue as touring activity returned. Physical revenue grew by 2%, primarily driven by strong performance in Asia. Licensing revenue increased 9%, mainly due to higher synchronization revenue led by the US and UK Adjusted OIBDA decreased 9% on an as-reported basis and 4% on a constant currency basis. Adjusted OIBDA margin declined from 22% in the prior year quarter to 19.4%, primarily due to revenue mix.\n\nNormalizing for the onetime items described above, adjusted OIBDA grew 7% on a constant currency basis, and the year-over-year margin decline would have only been 100 basis points. Music Publishing continues to deliver impressive results, posting 35% year-over-year growth. Digital revenue grew 32%, reflecting continued momentum in streaming, which increased 35% and was driven by strength across traditional and emerging streaming platforms. Additionally, digital revenue growth reflected a $17 million benefit resulting from the July 1 decision by the US Copyright Royalty Board in Phono Record 3, which Steve mentioned earlier.\n\nAdjusted for the benefit from this decision, digital revenue increased 16.5% and streaming revenue increased by 18.3%. Performance revenue increased by 80% as bars, restaurants, concerts and live events continued to recover from COVID disruption. We saw a rebound in Germany, UK, France, and the US Sync revenue increased by over 20% due to higher television and commercial licensing activity, mechanical revenue declined slightly. Music Publishing adjusted OIBDA increased 30% to $57 million, while margin remained flat at 23%.\n\nOn a constant currency basis, adjusted OIBDA increased 33%. Normalizing for the impact of the CRB rate benefit, adjusted OIBDA would have increased 23% on a constant currency basis and margin would have been essentially flat. In line with our expectations, Q3 capex increased to $35 million as compared to $20 million in the prior year quarter, mainly due to IT -- investments in IT infrastructure and expansion of our E&P facilities. As a reminder, our financial transformation is expected to deliver annualized run rate savings of $35 million to $40 million, once fully implemented.\n\nOperating and free cash flow growth in Q3 were very strong. Operating cash flow increased 79% to $163 million from $91 million in the prior year quarter. The increase was largely driven by the timing of A&R investment. Free cash flow increased 80% to $128 million from $71 million in the prior year quarter.\n\nWe expect strong cash flow generation in Q4 as well, driven by the timing of deals that will be favorable to working capital. As of June 30, we had a cash balance of $345 million, total debt of $3.8 billion and net debt of $3.4 billion. Our weighted average cost of debt is 3.4% and our nearest maturity date is 2028. Before we conclude our call, I want to mention that we recently settled a number of copyright infringement cases that will impact our Q4 results.\n\nWe expect that the proceeds from these settlements, after netting litigation expenses and artists and songwriter royalties, will have an estimated favorable impact to consolidated OIBDA of at least $25 million. We are closely monitoring the rapidly changing macro environment and will adapt as we always have. We have full conviction in music's resilience and will aggressively pursue new opportunities for our artists and songwriters, even during market dislocations. The fourth quarter is off to a strong start with our new releases performing well, and new deals with emerging streaming platforms.\n\nWe are on an upward trajectory and are positioning ourselves to take advantage of the opportunities for growth that lie ahead. Thank you for joining our call today, and we will now open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Sebastiano Petti with J.P. Morgan. Your line is open.\n\nSebastiano Petti -- J.P. Morgan -- Analyst\n\nHi. Thanks for taking the question. It was good to hear the confidence in the underlying growth in the fiscal 4Q first on the Meta deal and other DSP deals and just the new release schedule. Could you perhaps update us on your outlook for or expectations for 2023, given concern about slowing growth industrywide, the ad-supported slowdown that you kind of called out in the macro? Perhaps, any onetime items that will affect comparability as we kind of go into next quarter and into 2023?\n\nEric Levin -- Chief Financial Officer\n\nYeah. Sebastiano, thank you so much. So we don't have -- we've disclosed the onetime items. We don't have anything next quarter that we are -- that we see that is meaningful that will affect the comparison.\n\nWe do look forward to 2023 when we will lap the anniversary of the DSP renewal that has been creating challenging comparisons for the four quarters of fiscal '22. But fundamentally, even though there's a challenging macro environment, we are very confident in the resilience of music and the effectiveness of Warner Music strategy. We have a strong release schedule for Q4 and are looking forward to further strong releases throughout fiscal '23. We see subscription streaming growth continuing to grow double digits, despite what's happening in the macro environment.\n\nSync continues to grow. Artist services and recorded music is now back to where it was pre-COVID, which obviously is low-margin revenue, but delivers revenue and OIBDA and provides value-added services for our artists that we always look forward to providing them as part of our relationship. Warner Chappell has been going full guns. Their growth every quarter this year has been 20%-plus.\n\nThe recovery of performance has allowed there stellar growth in areas like streaming and sync to shine through. So we feel really good about our underlying business model. We feel really good about the resilience of music and our positioning for continued growth. I don't want to short sell that it's a challenging environment.\n\nWe've seen this quarter the impact on ad supported. We continue to make sure we do everything we can to support each line of revenue growth, but FX and ad-supported revenue both had challenges this quarter, and we'll continue to manage them as best as we can. Fortunately, ad supported is a minority of our streaming revenue and therefore, is a contained portion of our revenue and the larger portion of our revenue is continuing in strong growth mode. So hopefully, that gives you a summary.\n\nAnd thank you for your questions, Sebastiano.\n\nSebastiano Petti -- J.P. Morgan -- Analyst\n\nAnd one quick follow-up there. Your Artist Service recovery, obviously, you've outlined low margin, but still contributes to the OIBDA growth. Any perhaps update on -- or how should we should be thinking about margins into fiscal 2023, particularly as maybe the financial transformation program kind of gets implemented?\n\nEric Levin -- Chief Financial Officer\n\nYeah. Total. Thank you for that. So one of the things we've been saying, quite frankly, for the past couple of years is when Artist Service recovered because it was so -- it was basically put on hiatus for the first two years of COVID.\n\nBut when it started to recover that it would have an effect on margins downward, but we didn't know exactly how much because we didn't know if artist services will recover over two years or recover fully in one year, artist services is now back to the revenue levels that it was pre-COVID. So it's really fully recovered in a very, very short period of time. What this does is put margin -- downward margin pressure in 2022, but will then create comparisons for 2023, where we've got artist services fully baked in '22 compared to '23. So we expect to get back on our margin growth trajectory as we have comparisons that are going to be more favorable with the fully recovered artist services in both the numerator and denominator.\n\nSo we feel very good about the fundamental margin growth program that we have in place, growing our high-margin digital revenue streams, managing costs, including our financial transformation and other technology initiatives that are in place to drive efficiency. So we feel very good about our margin growth trajectory. Our financial transformation program remains on track to launch in fiscal '23. We expect the benefits to start to roll in, in '23 and '24 until it's fully rolled out and complete.\n\nI will say that the rollout of the financial transformation is always tied to meeting very specific and detailed standards that allow us to complete our statutory management reporting essentially perfectly. We are very close to that point, but there is work to do until we cross every I and cross every T. And we're working diligently to get there, and we fully expect to launch the program in '23.\n\nSebastiano Petti -- J.P. Morgan -- Analyst\n\nThanks for taking the questions.\n\nOperator\n\nThank you. And next question from Benjamin Black with Deutsche Bank. Your line is open.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nHey, guys. Thanks for taking my question. I've got two follow-ups really. So after adjusting for the new deals and the catch-up payments, we've seen a few quarters of decelerating underlying recorded music streaming growth.\n\nSo the question here is really, how should we be thinking about a good underlying growth rate going forward? I mean are you seeing slowing subscriber growth? Or we're just simply lapping difficult comps? And on the advertising side and Spotify mentioned thing -- modest softening in the last two weeks and into the third quarter. Now, you're mentioning as well. Could you just sort of elaborate on the softness that you're seeing? Is it platform-specific? Is it region-specific, for example? And then -- and how are you thinking about sort of the tenure of advertising growth for the balance of the year in 2023?\n\nEric Levin -- Chief Financial Officer\n\nSure. Let me jump in on that. So thanks for the question. So first thing I'd say is that subscription streaming growth still remains quite strong, remains in the double digits.\n\nIn the short term, we see that as being a very strong sign despite a macro environment. Long term, we think subscription streaming growth has tremendous upside potential in front of it. Developed markets are roughly 30% penetrated in aggregate. We've seen both research studies, but also market forecasts that show that growing into the 50s or even 60s percent over time.\n\nEmerging markets are still penetrated in the mid-single digits and are starting to show real improved growth, and we see enormous opportunity for emerging markets coming online with subscription streaming. The price per subscriber is still very low. We see real ARPU opportunity, and Spotify and Amazon that have done forms of price increases, I think, have proven to the market that it doesn't have an impact on churn and that price increases are really available for distributors. We're very excited about subscriber growth opportunities.\n\nWe did see an ad-supported slowdown. You've seen that in some of the companies that are distributors that reported lower ad-supported growth. Clearly, it was a difficult comp versus a year ago. A year ago, we had 27% streaming growth, and ad-supported growth was even faster than our average total streaming growth because of the recovery from COVID.\n\nBut we do think the macro environment has had an impact on ad-supported businesses, and we'll continue to monitor to that. Again, ad-supported streaming is in the mid- to high teens in overall streaming. So it's contained a part of our business, and the much larger part of our business continues -- streaming business continues to grow double digits, but that is something that we'll continue to monitor. Again, we have great confidence in the long-term potential upstreaming.\n\nWe think it's just getting started. We think the emerging streaming side continues to increase in the number of licenses. We've just concluded our new Meta deal, the opportunities of Web3, NFTs, communities, we think is just at the very, very early experimentation phase and has significant potential that we're focused on developing the business models to be able to monetize. So we're excited as we look forward about the growth in streaming.\n\nIn the short term, we're navigating tough macros, but still think the resilience of music and streaming gives us real opportunities to continue the growth factors.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nThank you for the color.\n\nOperator\n\n[Operator instructions] Our next question comes from Matthew Thornton with Truist.Your line is open.\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nHey, good morning, Steve and Eric. Maybe one question and two housekeeping items, if I could. First, Eric, you talked a little bit about the margin progression as you see it over the next couple of years. How do you think about the conversion of adjusted OIBDA to free cash flow over the next couple of years? It was 50% in this quarter.\n\nIt has kind of bounced around a bit, but I guess, higher level, how do you think about that progressing over the next couple of years? And then just secondly, the housekeeping items, I think there was an adjustment to an earnout liability that benefited the recorded music margin in the quarter, if you can quantify that? And in the streaming portion, I think there was some language around timing of new deals. Again, anything worth quantifying there as well.\n\nEric Levin -- Chief Financial Officer\n\nYeah. Sorry, there's three questions. I'm burning notes really fast. OK, so three things.\n\nSo adjusted OIBDA free cash flow. So one thing I would encourage here, generally, our free cash flow through adjusted OIBDA conversion has been 50%, 60%. We think that's a reasonable range to operate in. Every quarter will be different.\n\nThe timing of spend on ANR is going to vary based on deal activity and really challenging to look at quarter-to-quarter. A larger period of time, year-to-year, for example, is a better period. The 50% to 60% has been a place we've been comfortable operating in. We think that's a fair place to look.\n\nI will make the comment, though, that we look at our waterfall of how to deploy excess cash, and the first stop at our waterfall is redeploying it into the business to drive future growth. We have grown our market share. If you look at over the past several years, call it a five-year period, and one of the ways we do that is by redeploying our operating cash flow back in the business with accretive deals to drive growth. But fundamentally, we are driving to drive our operating and free cash flow in line with OIBDA with, call it, 50% to 60% conversion rate, and -- but we then use our waterfall beyond that.\n\nSecond question. So we had made an investment in the business and had accrued about $10 million toward an earnout that was part of the acquisition, if certain metrics were achieved. Given the slowdown in the ad-supported market, we no longer forecast that earnout will be achieved and reverse the $10 million accrual. On the timing of deals, the one deal we called out here is the Meta deal, which we've closed in Q4, and that will be reflected in our Q4 results.\n\nWe do expect our emerging streaming revenue and our streaming revenue because of that -- because of the timing of new emerging streaming deals to have a positive bump in Q4 of -- we're still in the process of driving Q4, and we don't quantify individual deals. So I can't give you a number, but we do expect that to have a positive impact.\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Michael Morris with Guggenheim. Your line is open.\n\nMichael Morris -- Guggenheim Partners -- Analyst\n\nThank you, guys. Good morning. Maybe one for Eric. Just following up on digging in a bit to the recorded music streaming trend.\n\nYou talked a bit about the advertising portion and the size there, which was helpful. Can you talk a bit about the release schedule that album release slippage and the impact as we looked at kind of that slow growth rate going from 15% or mid-teens in the second quarter -- fiscal second quarter to the 9% sort of core rate in the third quarter. How much of that sequential sort of slowdown was driven by that release late timing? And how much of that kind of do you expect will come back in the fiscal fourth quarter? And then maybe a bigger-picture question for Steve. Just on the CEO transition, which was announced late in the quarter and a little bit long dated with respect to the timing.\n\nCan you just give us your thoughts on that transition? Why the timing? What you guys are looking for? Would appreciate the color there.\n\nEric Levin -- Chief Financial Officer\n\nSo I'll start. And thank you, Michael, for the questions. So there was a few substantive releases that have split from Q3 to Q4. I'll focus the answer a little bit on Q4.\n\nWe feel very good about Q4 overall for the reasons we talked about on the release schedule. Lizzo, who already has the #1 hit, the album coming out in -- or came out in Q4, Special, Cardi B, has an album coming out, Panic at the Disco, Paulo Londra and several other significant international artists, our Q4 release schedule, we think is really set up nicely. And certainly, we do see that as being an accelerator versus Q3. In addition to a strong release schedule, the close of several emerging streaming deals, including Meta, will be a positive.\n\nAnd we also mentioned that there were several legal settlements in Q4 that will bring approximately $25 million of OIBDA into Q4. So there's a series of positive news in Q4 that we have already delivered and that will be impacting the results throughout the remainder of the quarter. On ad-supported, part of the slowdown was the market. You could look at the results of some of our larger distributors and see the rate of which their slowdown that affects our business.\n\nBut again, our job is to maximize the performance of that area with great releases and great marketing campaigns. And we're thrilled that the largest part, the lion's share of our subscription revenue of our streaming revenue, which is subscriptions continues to grow solidly in the double digits.\n\nSteve Cooper -- Chief Executive Officer\n\nAnd then, Matthew, on the -- Michael, sorry. On the CEO transition, I mean it's really very straightforward. We decided to announce a change with a long lead time, which would allow us to have a very thorough, thoughtful, broad search in our diverse group of candidates. I'm actively in the loop on that process, and I think that -- I expect that there will be an overlap with respect to the transition.\n\nWe just want to make sure that it's well thought out that it's orderly and that we continue focusing on business without missing a beat.\n\nOperator\n\nThank you. Next question comes from Kutgun Maral with RBC. Your line is open.\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nCool. Good morning. First, given the divergent trends across subscription, ad-supported and emerging platforms, can you just update us on the mix of the three buckets across either recorded music or your overall digital revenue? Eric, I think you said earlier that advertising is about mid-to-high teens. But I wanted to confirm and maybe get a little bit more color on emerging platforms as well.\n\nAnd I apologize if I missed it, but how much was emerging platform revenue in the quarter? And just lastly, you were asked earlier about the timing of emerging platform renewals. Emerging platform revenue growth had decelerated over the last year because you were kind of in a lull of activity with the Meta deal. As we move forward into fiscal '23, are you entering a new cycle of renewals that could help accelerate the streaming revenue growth line?\n\nEric Levin -- Chief Financial Officer\n\nOK. Good. Thanks, Kutgun. So on streaming, rough ballpark, the mix of the components subscriber, ad support and emerging is roughly 70%, 20%, 10% -- 70 high teens 10.\n\nSo think of subscriber as the 70% ad supported is the high, very high teens and emerging being the rest, call it, roughly 10%. There are some cats and dogs in there like digital radio and things like that, but those are relatively small compared to the bigger pie. Your other question on emerging streaming and the growth components and the trending going forward. There's a few components to that.\n\nObviously, as you stated, Kutgun, the renewals are a meaningful part of that when you have a few deals that have become relatively scaled in there, it becomes meaningful when those are renewed. We don't talk specifically to the renewal timing of individual deals. Obviously, Meta is a meaningful one. We usually do 2- to 3-year deals.\n\nWe had a slew of renewals roughly a year ago that were actually reflected in our Q3 '21 results. So there will be some deals that come up in '23, and we will see that in next year's results. What I will also say is, it's not just about renewals, it's also about new vectors of growth. We look at areas like Web3 with NFTs and the ability to build interactive communities as having huge potential, but the platforms and products that develop sustainable business models that really excite fans and monetize and connect fans and artists in ways that are deep, rich and exciting dynamic communities is something that is being experimented with develop.\n\nWe're working very closely with a series of partners when we've talked about the different deals that we've done over the past year or so with best-in-class partners in NFTs and building out mods with Roblox and others that is all with an eye toward developing a model for music in this new world that can monetize. And we see that as an area of growth that will show up over the next several years. So I would stay tuned, and we look forward to having exciting news as our experiments get to the marketplace and yield results.\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nThat's great. Thanks, Eric.\n\nOperator\n\nNext question comes from Matthew Thornton with Truist. Your line is open.\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nHey, thanks. Must be a busy morning. Eric, the right way to think about streaming growth, just to put a fine point on this. You guys reported 9.2% constant currency ex the two DSP items.\n\nYou have some Russia headwind. You had some slate slippage that you talked about and then probably most pronounced, you have the ad-supported pressure. Is it those three items that kind of bridge you up into that healthy double-digit growth? I just want to make sure I'm understanding the bridge commentary correctly. And then, maybe one for Steve.\n\nSteve, in this tougher macro, higher interest rates, how do you think about deal activity, whether it's small.[Technical difficulty]\n\nSteve Cooper -- Chief Executive Officer\n\nSo again, with our discipline remaining as a focal point, I would expect our activity to continue to be quite active.\n\nOperator\n\nThank you. Our next question comes from Benjamin Swinburne with Morgan Stanley.\n\nBenjamin Swinburne -- Morgan Stanley -- Analyst\n\nThis is Ben. Can you hear me?\n\nEric Levin -- Chief Financial Officer\n\nWe can hear you, Ben.\n\nBenjamin Swinburne -- Morgan Stanley -- Analyst\n\nHey, guys. Yeah. I didn't hear the last like eight minutes. So this could be repetitive.\n\nI apologize if it was -- hearing nothing. But anyway, Eric, a couple of things. One, any way to help us think about currency in the fourth quarter as it relates to revenue, but also margin? I think there's a -- seems like a mismatch on opex and revenue on the currency front we should be thinking about. You mentioned 50% to 60% cash flow conversion.\n\nI don't think you're going to be there this year just based on the nine months. I know you said strong Q4, but do you think '23, you could be back in that zone? And then I know we talked about it a lot already on the emerging streaming, but I think part of the attraction to your business and your stock is the idea that over time, there's more consumption of music, which drives more revenue for your company. Is that -- do you have any -- what's your visibility in this emerging streaming bucket overall? I know it's a lot of different deals, but as you look out over the next year or two, does that start to play out more obviously to all of us that we're seeing consumption growth and then revenue growth? Or is it still too early to really make that call? Thank you.\n\nEric Levin -- Chief Financial Officer\n\nOK. Thanks, Ben. So on currency, a few things. So looking Q4, which I think is your question, I think nothing indicates that there's going to be much difference from Q4 and Q3.\n\nIt's still going to have a similar headwind in Q4 as we convert to a strengthening dollar. The margin impact continues to flow through pretty organically. A fair amount of our costs are in local dollars, but some of our repertoire -- international repertoire that's sent around the world. So there is an impact on margin as well.\n\nI will say that we do hedge against -- the US dollar against the nine most major currencies that we work against that doesn't necessarily flow through OIBDA. But when there is a negative currency impact -- affecting our business on a cash basis, we have hedged operating cash flows and do get a benefit there. So we'll continue to manage to hedge currency impact. And obviously, when there's a negative currency impact on our operations, we also have roughly $1 billion worth of euro notes that there's a favorable impact as that becomes less expensive.\n\nThat's one. Two is on the 50% to 60% conversion, the first half of '22, we spent a significant amount on A&R. We see the flow of the second half of the year being more moderate in investments and more favorable in working capital and a significant improvement in the second half of the year. We are now deep into evaluating fiscal '23, and we do evaluate and look at our cash generation and cash conversion as part of the modeling.\n\nAnd we look at how we can achieve our goals in there, but also look at the growth opportunities investments. So we're looking at that right now. In fiscal '22, when we talk about cash conversion, I would say that we do expect to hit the low end of the cash conversion range that we've discussed as we do have favorable working capital impacts coming up, not just in Q3, but also in Q4. On emerging streaming, it is clear that that is growing and growing in a variety of different ways.\n\nThe number of licenses, which is now measured in the hundreds, is growing on a fairly regular basis. We've already talked about the new meta deal and other deals that we're adding in Q4. There are new categories coming online. We've talked about Web3 and metaverses and those categories that really are at the very, very tip of developing product models and monetizing.\n\nWe see this as an area with which will have continued consumption growth as new digital products and platforms are evolving all the time, driving experimentation, consumer usage, consumption, the more integration of music and really what feels like a ubiquitous way with other forms of content in a blended way, all of which require music licenses. So we expect to continue to see consumption and revenue of emerging streaming growing. It won't necessarily be linear as we've said. It's both tied to the timing of renewals, development of new products and new product platforms, and we expect those to be building up over time.\n\nAnd we continue to be innovative, leaning in, be an early adopter, be an early partner with some of these companies, helping them develop their products that integrate music in thoughtful ways that can turn on hands. And so, we're really excited about the opportunities there, and we expect to see continued growth for years and years to come.\n\nBenjamin Swinburne -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nAnd I'm not showing any further questions at this time. I'd like to turn the call back to Steve Cooper for any closing remarks.\n\nSteve Cooper -- Chief Executive Officer\n\nAgain, thanks, everyone, for joining us. We appreciate your ongoing interest and support of Warner Music. I hope everybody has a wonderful wrap up to the summer and a very safe Labor Day. Stay well, everyone.\n\nWe'll talk to you soon. Bye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKareem Chin -- Head of Investor Relations\n\nSteve Cooper -- Chief Executive Officer\n\nEric Levin -- Chief Financial Officer\n\nSebastiano Petti -- J.P. Morgan -- Analyst\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nMichael Morris -- Guggenheim Partners -- Analyst\n\nKutgun Maral -- RBC Capital Markets -- Analyst\n\nBenjamin Swinburne -- Morgan Stanley -- Analyst\n\nMore WMG analysis\n\nAll earnings call transcripts"
}