{
  "companyName": "Polaris Industries",
  "companyTicker": "PII",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/polaris-industries-pii-q3-2022-earnings-call-trans/",
  "content": "Polaris Industries (PII)\nQ3 2022 Earnings Call\nOct 25, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the Polaris third quarter 2022 earnings call and webcast. [Operator instructions] Please note this event is recorded. I would now like to turn the conference over to Mr. J.C.\n\nWeigelt. Please go ahead, sir.\n\nJ.C. Weigelt -- Vice President, Investor Relations\n\nThank you, Chuck, and good morning or afternoon, everyone. I'm J.C. Weigelt, vice president of investor relations at Polaris. Thank you for joining us for our 2022 third quarter earnings call.\n\nWe will reference a slide presentation today, which is accessible on our website at ir.polaris.com. Joining me on the call today are Michael Speetzen, our chief executive officer; and Bob Mack, our chief financial officer. Both have prepared remarks summarizing the quarter and our expectations for 2022 as well as some early thoughts on 2023, then we'll take some questions. During the call, we will be discussing various topics, which should be considered forward-looking for the purpose of the Private Securities Litigation Reform Act of 1995.\n\nActual results could differ materially from those projections in the forward-looking statements. You can refer to our 2021 10-K for additional details regarding risks and uncertainties. All references to third quarter actual results and 2022 guidance are for our continuing operations and are reported on an adjusted non-GAAP basis unless otherwise noted. Please refer to our Reg G reconciliation schedules at the end of the presentation for the GAAP to non-GAAP adjustments.\n\nNow, I will turn the call over to Mike Speetzen. Go ahead, Mike.\n\nMike Speetzen -- Chief Executive Officer\n\nThanks, J.C. Good morning, everyone, and thank you for joining us today. I want to start off with our third quarter results, which reflect record quarterly revenue of $2.3 billion and while not a record adjusted EPS of $3.25, grew nicely at 64%. This is a testament of the hard work and dedication of our global teams from supply chain to sales, corporate functions and manufacturing.\n\nEveryone played a role in achieving these results. Margins improved during the quarter with positive contributions from price and volume, offsetting higher year-over-year costs. Both price and volume should continue to play a role in expanding margins as we exit the year. While the retail story is mixed for the quarter with retail sales down 8% year over year, our premium products across utility and recreation and off-road continues to see stable demand.\n\nIn addition, snowmobile demand has been strong as we enter the riding season. We did experience some softness in RZR and ATV with more pronounced softness in models that tend to be more price sensitive and/or more leisure-based. Pontoon retail declined low double digits due to continued supply chain constraints. Our 8% retail growth and on-road was driven by Indian motorcycles, and a high mix of rework to ship a significant number of bikes that have been waiting for specific parts.\n\nAs shared last quarter, striking the right balance of inventory at our dealers is a key focus for us. We are closely monitoring inventory levels to enable dealers to have an optimal level of support to support customer demand as the supply chain continues to improve. In fact, there are a handful of models where we believe we are close to optimal inventory levels already, such as ATVs and several off-road vehicles in our recreation category. All in, our strong third quarter results allow us to maintain our full year adjusted EPS guidance and move to the upper end of our sales guidance.\n\nAs we look at demand, the story has become more mixed. Polaris ORV retail was down sequentially by 4%. This was mainly driven by softness in the recreational space. Drilling down to more specific areas of softness, we are seeing some customers be more price sensitive on value models, which is consistent with last quarter.\n\nThis impacted some RZR and ATV sales. Across the industry, the utility segment continues to have stable demand indicators, while the recreational space seems to be slowing. Our premium models such as RZR Pro, Turbo R and RANGER NorthStar remain favorites with customers. We're also seeing customer appeal for vehicles with the latest RIDE COMMAND+ connected technology.\n\nAs this continues to be an area where we have out-innovated the competition. As anticipated, the backlog of pre-sold is declining as shipments improved, and that was certainly the case this quarter. Pre-sold as a percentage of retail hit their peak last year at 75% in the third quarter. And this year, during the third quarter, they are trending near 40% with the decline being driven by a mix of improved availability and softening demand.\n\nA few other points on demand include pre-sold order cancellation rates are staying low across our business. We continue to see a steady mix of customers new to Polaris, which is consistent with historical trends, while both short and long-term repurchase rates remain elevated or within the historic range. And PG&A attachment rates are at or near record levels, indicating that customers are looking to upgrade their vehicles with higher-margin accessories. Concurrently, parts and oil service kids had a record quarter, pointing to strong riding trends.\n\nAnother bright spot is the continued consumer interest in getting outside as evidenced by organic search for industry terms staying well ahead of 2019. This level of elevated organic search gives us confidence that this is the time to increase spend on demand creation. The top end of the customer funnel is healthy, and we believe that investing in demand creation can amplify organic interest and increase the number of leads at the bottom of the funnel. As this process can take time, we've made the decision to invest in growth and are increasing our spend on demand creation in the fourth quarter.\n\nBroadly speaking, we continue to track how the consumer is faring with pressure from rising interest rates, inflation and higher gas prices. While we've not drastic changes in consumer behavior due to these factors, we will continue to closely monitor consumer behavior and react accordingly. We also weigh these dynamics with the fact that our average consumer is affluent owning their own home and dual income households. Importantly, approximately 60% of our off-road business is in the utility space as well as the commercial and defense sectors, where the purchase is not characterized as leisure or discretionary.\n\nWe believe this part of the business is more insulated from external factors impacting consumer buying patterns. We'll continue to be vigilant in monitoring these metrics and will remain agile as we see shifts in consumer demand trends. So by segment, let me wrap up our thoughts on demand. In off-road, there is a clear delineation between utility and recreation.\n\nDemand indicators remain stable in utility, while recreation is softening with pronounced moderation in the value segment. In on-road, we had a very strong Q3, and we're able to ship a high percentage of rework bikes. Dealer inventory seems to be in a healthier spot and we believe we are closer to a normal operating environment. As we enter the traditionally slower winter season, we expect to see a seasonally driven softening in demand.\n\nFor marine, demand at the entry and premium levels continues to be healthy, while we are seeing demand slow in the middle of the lineup. Similar to motorcycles, we do see the industry is moving closer to a normal seasonal environment and with healthier dealer inventory levels, we expect seasonal weakness as we finish the year. As discussed last quarter, filling the channel remains one of the biggest opportunities for us in the near to medium term. We made progress in the third quarter given improvements in the supply chain and expect this to continue as we progress through the fourth quarter and into next year.\n\nWith the progress made this quarter, we see inventory down approximately 50% versus 2019. We believe an optimal level of inventory represents an approximate 1.5 times increase from current inventory levels, which we estimate could total almost $400 million to refill the channel to this new optimal level of inventory. We've seen recent evidence that where we can supply product, we can gain share. That was evident in India motorcycle and RZR during the third quarter and is playing out in October for ATVs as we had heavy ATV shipments in the last couple of weeks of the third quarter.\n\nGiven an improving supply chain and recent softness in retail, we expect this channel refill opportunity to last through the fourth quarter and into early next year, but the exact timing remains uncertain. The Utility segment remains our greatest near-term opportunity as the supply chain improves given lower dealer inventory levels, coupled with continued consumer demand. Moving to some of our newest rider-driven innovation announced recently for our 2023 model year lineups. We continue to push forward with industry-first technologies, next-level performance and features that deliver for our customers.\n\nFor RANGER, our NorthStar Trail Boss edition is packed with new upgrades, specifically designed to meet the demands of hard-working consumers. The Polaris RZR lineup introduced new color, audio, lighting and tire options to allow our customers to make their statement when riding their own industry-leading RZR. Lastly, on off-road, we announced that RIDE COMMAND+ will come standard in all 2023 RANGER XP 1000 NorthStar additions and is available as an add-on accessory in several 2023 RANGER, RZR and ATV models. A first in the industry, RIDE COMMAND+ uses connected vehicle technology to create a more seamless ownership and riding experience through features like vehicle health monitoring and remote location services.\n\nThe technology also allows us to provide users with over-the-air updates, meaning our team can roll out new benefits as soon as they're ready. We've already shared that location alerts, post ride report and group ride plus are new features that will make available on RIDE COMMAND+ later this year. This platform continues to elevate our position in connected vehicles to deliver the best customer experience. In marine, Godfrey Pontoons launched the Mighty G built from the ground up to optimize for electric propulsion, while also compatible with a more traditional gas-powered engine.\n\nThe Mighty G is the ultimate entry into Pontoon and boating, providing plenty of room for passengers while delivering a highly maneuverable and comfortable ride. Hurricane announced the new SunDeck 2600 offering it over 26 feet, which will be one of the largest deck boats in the Hurricane lineup. The versatility of this boat is unmatched, providing power and performance for an exhilarating time whether it be tow sports, fishing or leisurely cruise. As you can see, Polaris continues to lead the way by powering the passion and pioneering new possibilities for all those who play, work and think outside.\n\nI'll now turn it over to Bob who will summarize our third quarter performance as well as our expectations for the remainder of the year. Bob?\n\nBob Mack -- Chief Financial Officer\n\nThanks, Mike, and good morning or afternoon to everyone on the call today. Looking at the quarter, it was great to see record sales and near-record adjusted EPS in what continues to be a very dynamic market. Sales benefited from strong volume and price offsetting amplified FX headwinds. In spite of the dramatic foreign currency fluctuations, international sales were up 10%, driven by strength in EMEA and Latin America, while Asia Pacific saw modest declines.\n\nTotal PG&A revenue in the quarter was up 17% year over year, achieving a new quarterly record, driven by strong attachment rates and parts sales. Adjusted EBITDA margin was up 153 basis points to 13.7%, driven by strong pricing, higher shipment volume and cost containment. These positives more than offset higher warranty costs and higher-than-expected FX headwinds. Supply chain cost premiums decreased sequentially, but remained a cost headwind on a quarter-over-quarter basis.\n\nBelow operating profit, interest expense continued to tick up given higher rates and debt levels. We were opportunistic with share repurchases and bought 1.7 million shares in the quarter. We remain committed to executing the share buyback levels included within our guidance, subject to market and other conditions. Turning to our segments.\n\nLet's start with off-road. Sales of $1.7 billion were up 33% relative to last year. Wholegoods were up 38% and PG&A was up 18%, with the variance made up of wholegoods price. Adjusted gross margins were up 340 basis points.\n\nPricing and higher shipment volumes had a positive impact on sales and margin, offsetting increased supply chain cost premiums, warranty expense and FX headwinds. Looking at retail performance, we were down high single digits in North America with better performance in side-by-side versus ATVs. We believe the industry was up low single digits, thus pointing to share loss in the quarter. Breaking out the recreational ORV business, which includes RZR and Youth.\n\nWe believe we continue to hold share with strength in the wide open and crossover subsegments. In the Utility segment, which includes RANGER and ATV, we lost shares, shipments continued to be constrained by supply chain challenges. On a 12-month rolling average, we estimate ORV share was down approximately 3.5 points. We still believe share shifts in this environment are the result of component availability and decisions around product production priority such as prioritizing less contented value product versus complex premium product and not the result of the launch of new products by competitors.\n\nWhile demand trends are mixed, we do see an opportunity to gain share with increased shipment volumes. In particular, we continue to see strong demand and opportunities for share gains in our utility segment and commercial businesses, driven in large part by RANGER as the supply chain eases. For reference, over 60% of our sales mix in off-road is made up of our utility business plus commercial and government and defense. We think of each of these businesses as more resilient and less discretionary.\n\nOur ability to increase shipments and serve these customers should position us well as we move through Q4 and into 2023. Switching to on-road now. Sales of $334 million were up 30% versus last year with whole goods up 32% and PG&A up 17%. Again, the main variance between wholegoods and PG&A was price.\n\nRemember that our on-road segment includes exome and Goupil, thus, you see a strong mix of international revenue which saw meaningful pressure from FX. An improving supply chain helped increase shipments meaningfully on a sequential basis, leading to volume leverage and share gains for both Indian Motorcycles and Slingshot. Margin was up 293 basis points and could have been even higher than that, if not for a substantial FX headwind, which is expected to continue. Demand trends remain stable across a number of indicators.\n\nIndian motorcycle retail in the quarter was up high single digits in North America versus the industry down low single digits. Looking at share on a 12-month rolling basis, we believe share down 1% due to the strength we saw in the third quarter. The on-road team continues to execute at a high level, and it was great to see the margin improvement despite the FX headwinds. The combination of a strong product portfolio, strong execution sets the segment up for future success in share gains.\n\nMoving to our marine segment. Sales of $260 million were up 42%. Shipment volume was the largest driver, followed by price and mix. Similar to last quarter, marine grew shipment volumes by over 20% year over year.\n\nThe industry is beginning to return to a normal level of seasonality with demand slowing at this time of year. In addition, dealer inventory continues to rightsize, but remains 25% below 2019 levels. North American retail was down low double digits for Pontoons, and we believe the industry was up low double digits. We believe this share loss was largely attributable to supply chain challenges.\n\nOn a 12-month rolling average view, we believe our share was down approximately 4 points versus the industry. Margin was down 91 basis points, reflecting a difficult comp; however, strong pricing helped partially offset supply chain inefficiency costs. Summing up our third quarter performance by segment, easing supply chain challenges improved our ability to manufacture and ship product. We believe our teams are well positioned to finish the year strong, and we are investing in the future.\n\nAs Mike said, we are closely watching demand trends and have yet to see material shifts in consumer behavior, but are tracking softness in recreational off-road and possibly return to normal seasonality across the portfolio. on-road trends remain encouraging and align well with specific measures we took earlier in the year to improve component availability. We expect demand creation spend to increase during the fourth quarter as we work to stimulate the top end of our funnel, which will be more pronounced in our off-road segment. Pricing is expected to remain a positive contributor to margin in the near term as well as declining year-over-year commodity and logistics costs.\n\nMoving to our financial position, we continue to expect 2022 will be a strong cash generation year with both operating cash flow and free cash flow well above 2021 levels. In Q3, we generated $179 million in operating cash flow. Our capital deployment priorities have not changed. We continue to focus on high-return organic investments, dividends and opportunistic share repurchases.\n\nDuring the quarter, we bought back $206 million worth of Polaris stock, bringing our year-to-date repurchase amount to $379 million. We continue to view our stock as undervalued, subject to market and other conditions and view these price levels as an opportunistic entry point. Looking at cash, we believe there are a couple of main drivers to help improve our cash flow generation profile. The first is an improving supply chain that should allow us to ramp production to consume raw materials and complete and ship our rework inventory to dealers.\n\nWe started to see this phenomenon in the quarter, especially in on-road where they worked through a good portion of rework. Second, the pricing actions taken throughout 2022 have provided a cash lift. We view our balance sheet and financial position as a competitive strength as it allows us to invest in our business for the long term, while also providing the flexibility to deploy excess cash to generate strong returns for our shareholders. Turning to our updated full year guidance expectations.\n\nMost of the changes here are a function of narrowing our ranges due to the fact that we are nine months into the year. Sales guidance has been narrowed to the upper end of our original range and now stands at 15% to 16% growth. Within that, we did move off-road to the upper end of the range due to an improving supply chain, leading to increased shipments. We also anticipate strong snow shipments in Q4 as the season ramps.\n\nWe lowered our outlook for on-road due to increased FX headwinds. Note, this segment has the greatest percentage of business with international exposure. For marine, we raised our outlook due to their ability to increase shipments and strong price. Adjusted EPS from continuing operations is still expected to grow 11% to 14%.\n\nWhile we are more comfortable with the middle to upper end of the range, recent movements in FX have resulted in increased headwinds and further pressure could negatively impact our EPS assumptions. Modeling Q4, every penny change in the Canadian dollar has an impact of approximately $2 million and every penny change in the euro has a Q4 impact of approximately $0.5 million. If foreign exchange rates were to hold at current rates, there is an approximate $40 million full year headwind to operating profit compared to 2021. This is $10 million to $15 million greater than what we had assumed in July and has been accounted for in our guidance.\n\nA couple of items on margins. First, we narrowed our expected gross profit margins to a decline of 78 to 80 basis points at the high end of our prior range, driven by FX and increased warranty expense in the third quarter. We expect EBITDA margin to decline by approximately 30 basis points, which is narrowed to the high end of our prior guidance, driven by FX and higher demand creation spending in the fourth quarter. As we look at the fourth quarter compared to the prior-year quarter, we expect volume and price to remain positive contributors.\n\nOverall, it is encouraging to see improvements in the supply chain lead to increased shipping volume. The health of the global supply chain continues to have an impact on our performance, thus we remain focused on execution. Increasing shipping volume should not only help our top line but also benefit margin as we work through higher cost inventory. Polaris has a long track record of navigating challenging economic environments, and we do not expect this time to be any different.\n\nWith that, I will now turn it back over to Mike for some initial thoughts on 2023.\n\nMike Speetzen -- Chief Executive Officer\n\nThanks, Bob. We thought it would be helpful to give you some of our initial thoughts on 2023. So like many of you, we are closely watching a number of demand indicators while being agile with our manufacturing and shipment plans so that we can swiftly respond to positive or negative trends. We expect organic investments to continue as we look to drive future growth through market expansion and introducing new vehicles and innovation to our customers.\n\nWe expect dealer inventory to reset to new optimal levels as the supply chain continues to recover. Similar to the rest of the year, there remains a strong correlation between the health of the supply chain and shipments. On price, we expect to annualize our 2022 pricing actions. Given current trends we're seeing in the global economy, we expect foreign exchange and interest to continue to be a headwind into next year.\n\nAnd on cash, we expect working capital to decline and operating cash flow to improve, allowing us to continue to invest in our capital deployment priorities, which entail organic investments as well as buying back our own stock, which we believe is currently undervalued, subject to market and other conditions. Wrapping up, we're seeing mixed signals in demand with retail down year over year. Our plan is to take an agile approach in managing our portfolio of businesses and brands in the near term while keeping close to the data so that we can swiftly react Improvements in the supply chain are encouraging, but challenges remain. We continue to expect modest improvements as we progress through the remainder of the year, which is expected to have a positive impact on inventory levels.\n\nWhile it's nice to celebrate the revenue milestone and strong adjusted EPS growth this quarter, we realize there's more work to be done. Agility will be key as we navigate near-term headwinds, while at the same time, remaining aggressive in our desire to grow the business and expand the market. We know that winning in a competitive environment requires our entire organization to be focused on delivering innovation, the best customer experience and efficient operations. We remain committed to being the global leader in powersports, while delivering shareholder value.\n\nFinishing strong in 2022 is our next step in that journey. We believe the decisions and investments we're making today will not only set Polaris up to deliver the fourth quarter but also generate strong growth and returns over the long term. With that, I'll turn it over to Chuck to open the lineup for questions.\n\nOperator\n\nThank you. [Operator instructions] And the first question will come from Joe Altobello with Raymond James. Please go ahead.\n\nJoe Altobello -- Raymond James -- Analyst\n\nThanks. Hey, guys. Good morning. Thanks for taking my question here.\n\nNot surprisingly, I did want to dig a little deeper into the share loss in ORVs. You mentioned on the last call, you were seeing some momentum late in the quarter. And it looks like your inventory situation improved sequentially here in 3Q. So is the issue simply that competitors are seeing supply chains improving faster or is there something else going on?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, I'd say there's a couple of things at play. I mean, first and foremost, while the third quarter improved, I would tell you that we had a pretty substantial portion of our shipments go in September. And within September, over half shipped in the last couple of weeks. And so we ended up with a push up in dealer inventory, but I can tell you, we mentioned it in our prepared remarks, we've seen very high retail levels for ATV, where we saw a substantial number of those shipments into the channel.\n\nAnd so I suspect we're clearing out a lot of that inventory. From a share perspective, I talked about it being a mixed story. Where we had strong supply throughout the quarter, places like Indian, RZR, Godfrey, Hurricane and at the high end of our markets, we did really well. We struggled a bit with Bennington given the complexity of some of the products.\n\nWe feel like we're in a better spot now. And then RANGER specifically at the high end of the market where we have continued strong demand. We talked about the pre-sold situation. If you pulled our pre-solds apart, there is a very high percentage of those that are at that high-end RANGER market, the NorthStar specifically.\n\nSo we're working hard to get ourselves into a better position. We know that when we improve supply the share situation moves in the right direction for us. And I suspect the timing of the shipments through the third quarter had some impact on that. And so, as we look at October, retail performance is really good.\n\nWe've got good momentum sequentially up from where we were in September. And so at this point, we think we're in a good spot.\n\nJoe Altobello -- Raymond James -- Analyst\n\nGot it. Very helpful, Mike. Thank you. And I guess second question, you mentioned earlier that you expect modest margin improvement next year.\n\nMaybe help us think about the puts and takes. And I guess, in particular, what you're thinking about promotion activity next year?\n\nBob Mack -- Chief Financial Officer\n\nSure. I would say it's a couple of things. We expect to continue to see the cost environment moderate. Obviously, it's been moderating.\n\nIt was a headwind relative to Q3 last year just because there was so much cost growth in the early part of '22. But those commodity and trucking and other transport prices are starting to come down, our levels of rework are coming down. So we expect those to be a positive as we get into next year. We'll have full price realization in the first half of next year.\n\nOur price increases went in, in April. We didn't really see all the realization start coming through until really this quarter. So we'll see that carry over into next year on the positive side. Promo, our goal, we've said we're trying to keep dealer inventory at more modest levels to try to limit the level of promo.\n\nWe are going to spend on advertising, but promote to the extent that we -- promo comes back, it's going to be heavily targeted at either models that are slower moving or customers that are in the right point in the funnel that we think it will move them to a purchase decision. And then FX will also be a headwind. So I think that combination will allow us to continue to improve margins, along with the ongoing cost actions that we've talked about as we continue to focus on our platforming and modularization initiatives, particularly in ORV and then also our continued efforts with the supply chain. So I think there's puts and takes, but I feel pretty confident of our ability to drive some margin improvement next year.\n\nJoe Altobello -- Raymond James -- Analyst\n\nOK, great. Thank you, guys.\n\nMike Speetzen -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThe next question will come from Craig Kennison with Baird. Please go ahead.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nHey. Good morning. Thanks for taking my question. It's on repurchase rates.\n\nYou mentioned that repurchase rates were healthy. Wondered if you could just define what you mean by short-term and long-term repurchase rates? And then maybe comment on what you're seeing in terms of early trends from that pandemic buyer?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, so the distinction that we make, Craig, is you've got the short-term repurchase rates where we're tracking people who will buy a vehicle and come back in three, six months, a year. And those are actually at or above what we've seen historically. So it indicates that consumers who have come in more recently into the category still have a really strong propensity to spend. And then when we talk long term, it tends to be a three year, five year, 10 year, and that's important because that's measuring the health of the customers that were pre-pandemic.\n\nAnd that is trending pretty consistent with what we've seen historic. The other thing that we track, and I mentioned it briefly in my prepared remarks, we get a lot of visibility through RIDE COMMAND as well as through our PG&A business in terms of rider activity. And we talked about the fact that our oil kits and our parts had record performance, which is indicative of the fact that consumers are out riding and using the vehicle, which is an important fact because as you look forward, even in a softening market, consumers using their vehicles is still going to drive business into the PG&A business. So the consumers who bought primarily -- and if you think about it in 2020, when we saw the 57% increase in retail in the second quarter, those consumers are still heavily engaged, as you know, through your used side-by-side pricing reports.\n\nThe pricing has moderated a bit from where it was during the pandemic, but it's still well above historical levels, which means that the availability of used is low, which indicates people holding on to their vehicles.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nGot it. Hey, thank you.\n\nOperator\n\nThe next question will come from Robin Farley with UBS. Please go ahead.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thanks. I wanted to ask, as your availability improves with product, how you see mix impacting 2023? In other words, if you were sort of focusing on your parts availability on the highest end vehicles, will next year's mix maybe not be as far but just it seems like mix is a positive this year. And then I also wanted to clarify, with your on-road shipment guidance going lower.\n\nAnd I know you mentioned the impact of FX, are you also lowering because of units there, I'm just wondering if you're -- are you getting more cautious because of the recreational ORV patterns that you're seeing? Are you thinking about that impacting on-road or was it entirely FX? Thanks.\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, I'll start with that one. A big part of it was foreign exchange. I mean, obviously, we're tempering shipments a bit, but the largest driver would be around foreign exchange. As I think about availability into next year, key point that I want to reiterate that I had in my prepared remarks is, in our off-road vehicle business, over 60% is utility and utility really doesn't react to a lot of the same dynamics that you see with the leisure side of the business.\n\nWe're selling into the ag markets, which are pretty good. We're selling into the commercial space, government, defense. There's a lot of construction activity, not residential, more of the commercial, the infrastructure investments that are being made. We sell through rental companies.\n\nAll those indicators are very positive. And when you think about where we've struggled this year relative to getting enough product and it's improving sequentially from a supply chain standpoint, but it's really in our utility segment. It's in that RANGER business. I think if you were to talk to dealers, they would tell you that, that inventory level is still well below where they would like to see it.\n\nAnd so we think that presents a good opportunity for us. And as we move into '23. And as you know, we make pretty good margins in that part of the business.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thanks. And I don't know if you had a comment on the mix In 2023?\n\nMike Speetzen -- Chief Executive Officer\n\nWell, I mean I think that really plays into the mix. I mean I think you're seeing some softening at the lower end of the market in the recreation. The high end of the recreation, space is still holding up, and we make good margins there. But really, the play is on the utility side.\n\nSo it's tough to know we're going through the planning process with our teams right now, which you can imagine is a pretty complex process for us. So we'll have a lot more visibility into that in January.\n\nRobin Farley -- UBS -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nThe next question will come from Anna Glaessgen with Jefferies. Please go ahead.\n\nAnna Glaessgen -- Jefferies -- Analyst\n\nHey. Good morning. Thanks for taking my questions. I'm interested to dig into the demand creation spend.\n\nDo you feel you're missing eyeballs that competitors are getting looking to widen the funnel to people new to powersports reengage past customers? And is this expected to be concentrated to one segment in particular or across the business?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah. I would say that it's across the business, but obviously, will be targeted. When you think about the demand softness that we've talked about in the REC space, that will obviously be an area of priority for us. And what I would say is we've had so much demand.\n\nAnd I would say this isn't unique to Polaris. It's more across the industry. Over the past couple of years that we really didn't have to spend a lot of money because we were trying to -- all of us have been struggling to keep up with that demand level. And so a lot of this cultivation activity takes time, which is why we started spending in the third quarter.\n\nWe're ramping that spending in the fourth quarter. And it's really aimed at reengaging with past customers, it's talking about bringing in, obviously, the new customers to the segment, which we continue to do a good job of. And it's really just about, hey, if the environment is going to slow into '23, we want to make sure that we're taking those upper funnel consumers and bringing them down to viable leads for our dealers. And we think now is the right time to spend.\n\nAnna Glaessgen -- Jefferies -- Analyst\n\nGreat. And thinking a little bit more tactically on how you approach this. We know that customers have shifted, how they shop for off-road vehicles and other vehicles over COVID, more comfortable being online and social media has become more important. How are you thinking through the best way to reach these customers?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah. I mean, we've had a pretty concerted effort over the past several years to increase our proficiency from a web perspective. We've upgraded the configurators. We continue to make that a focus area.\n\nWe know consumers like to buy online. Our e-commerce business continues to grow. So making sure that we make that as easy for the customers as we can. We have further web enhancements that we'll be rolling out early in 2023 that will make it even easier for consumers to get on and understand what the right vehicle for them is.\n\nIf you think about the number of new customers we're bringing in, it's really important to start there and make that easy from a web experience standpoint. So we're spending the money to make sure that we've got that set up because we know that, that's important. We know statistically that consumers are on the website anywhere from five to seven times before they ever even enter a dealership. And so that's got to be a heavy focus for us.\n\nWe think we're in a good spot. We think we're in a really strong spot relative to competitors, but there's a lot more we can do, and we're investing in that as we head into '23.\n\nAnna Glaessgen -- Jefferies -- Analyst\n\nGreat. Thanks so much.\n\nMike Speetzen -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question will come from James Hardiman with Citi. Please go ahead.\n\nJames Hardiman -- Citi -- Analyst\n\nHey, good morning. Thanks for taking my call. So I wanted to spend a little bit of time on this inventory slide, I think it's Slide 5 in the deck. It seems like there's a lot of information being conveyed here, and I just wanted to parse through some of it.\n\nI mean, I guess one of the big questions, I think, is sort of where we're going to finish the year in terms of inventory and what replenishment opportunity that we use for next year? I guess maybe if we did look at that $400 million replenishment number, that was $750 million coming out of the second quarter, so $350 million drawdown. How do we think about where you think that going to finish the year given the fourth quarter is typically the replenishment quarter?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, it's a tough one to answer, James, and I'm not trying to be coy, but there's a lot of variables at play. What I'll tell you is as we thought through the guidance, we do believe that our fourth quarter retail will be positive. The year will be down, but we do think the fourth quarter will be positive. And I -- while I do think inventory will move up slightly, I think that replenishment opportunity continues as we get into 2023.\n\nNow a caveat that because obviously, we left our guidance range pretty wide, given we just have a quarter to go. And the reason we did that is because we're serious about our commitment to where dealer inventory needs to be. So if we see a further slowdown or a deepening or anything that would put us at a compromised position relative to dealer inventory, we're obviously going to modulate our shipments, which is why we left the guidance range like we did. So there's a lot of variables at play.\n\nBut if things hold up as we anticipate, we think that the dealer inventory replenishment opportunity will continue into 2023.\n\nJames Hardiman -- Citi -- Analyst\n\nOK, that is helpful. And then as I think about the market share conversation that we've had, it seems like you guys believe that it is more a product availability issue than it is a product issue per se, which in theory, would create a pretty big opportunity once you get back to sort of normalized stocking levels. Maybe walk us through that. I don't know if you have any market share numbers today versus pre-pandemic.\n\nIt seems like pretty big delta. But how you think about that opportunity as we get back to normal inventory levels, particularly given that it does seem that dealer floor space has shifted pretty meaningfully. And so that's maybe an incremental barrier to clawing back some of that market share.\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, I guess, I'd say a couple of things. We do know when we have availability, we do well. RZR has gained share now pretty consistently, pretty much across the board. And so we feel good about that.\n\nIndian, we struggled earlier in the year. We had some black part paint issues that was constraining our ability to ship. We've cleared through most of that in the third quarter and put us in a really strong share position. In our boat businesses in areas like Godfrey and Hurricane, we did really well.\n\nBennington obviously struggled more complex product. The ramp rate in the production levels has improved, and we've seen that making an impact. So yeah, supply does make a big difference. We don't like seeing the negative share performance.\n\nAs we look into 2023, given what we're seeing from a supply chain improvement perspective and the sequential movement, even though we're not back to optimal levels, we do see that as a share gain opportunity. Utility is our -- probably our No. 1 focus area because it's where we've probably struggled the most. We've done really well at the end of the market where you look at the crews and the NorthStar vehicles.\n\nIt tends to be in the lower end, smaller 3-seat vehicles where we have focused our production efforts around where our customers are asking for product, but that does create a bit of a void from a product availability standpoint. I think the floor space thing, I don't know if I would agree with the comment that that's shifted dramatically. As we've gone out to our dealers, you have to be careful and you have to ask what's sitting on the floor because they typically will have sold vehicles sitting there. They'll have used vehicles.\n\nThey are just trying to have as much as they can. And so I don't think that's reflective of where we'll be in the future. Steve Menneto and his team have done a really good job through our NorthStar program to incentivize the dealers to have the appropriate level of stocking based on those local market dynamics, which has a direct impact on their profitability. And we believe that as we get back to more optimized and normal inventory levels that we'll have the appropriate share of the dealership floor.\n\nJames Hardiman -- Citi -- Analyst\n\nThat's really helpful. Thanks, Mike.\n\nMike Speetzen -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question will come from Gerrick Johnson with BMO Capital Markets. Please go ahead.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nGreat. Thank you. Now that we're seeing some stabilization reps growth in gross margin, will you be eliminating some of the logistic surcharges at retail or scaling those back?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, we'll certainly evaluate that. That's why we put that surcharge on the way we did and not made a -- didn't make an MSRP adjustment. So the teams are actively working through that. We're probably going to be a little bit delayed in making a move just because we've been bitten by this before where we thought things were short term and didn't move quick enough and then things persisted, same thing on the back end.\n\nWe just want to make sure that the improvements are sustainable as we move into 2023 and the teams will take appropriate action.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK.\n\nBob Mack -- Chief Financial Officer\n\nYeah. The other thing to keep in mind, a lot of that is on trucking, while trucking availability is better and trucking cost has come down, diesel obviously continues to be a challenge. So that as a factor into the surcharges as well.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK, great. Thanks. And maybe a question on your new model rollout, the recent '23 rollout. In light of weakness at the low end, maybe go through the decision to discontinue the RZR 570 and RANGER 500.\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, I think the reality around those models is the success rate was relatively low. And so we felt that pivoting the business in a different direction was the right thing to do, both from a profitability standpoint as well as a share perspective.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK, great. Thank you.\n\nMike Speetzen -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question will come from David MacGregor with Longbow Research. Please go ahead.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nYes. Good morning, everyone. Mike, can you just talk about some of the levers that you could pull to flex the business model in 2023 in order to protect margins in that scenario where maybe unit volumes are down sharply?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah. Well, a couple of things. One, I would point to the fact that we've talked for years about our recession playbook. And you saw that take effect during the pandemic and the early days of the pandemic before we knew that things were going to go in a different direction.\n\nAnd so we've got that -- obviously, we've got a refresh look at it. The teams know exactly what the drill is and the priority is, obviously, we prioritize liquidity, much like we did during the pandemic, making sure that we've got the right cash position, we're managing the leverage, staying within our covenants. And then preserving our priority strategic investments and making sure that we can continue to further our growth agenda, but obviously do so in an appropriate way. As we look at the business, we know the soft spots that could happen, we think primarily around the recreational side.\n\nI would just remind you that over 60% of our offered vehicle business is utility and we see a lot more stability there more broadly in terms of where a potential recession could happen. And then I'd also point out, we have a $1.7 billion PG&A and aftermarket business. And it's not to say that, that wouldn't necessarily have a downward impact from a recessionary environment. But a lot of that business is service parts and accessories that people will tend to buy when they're extending the life of a vehicle, which is what we typically would see during a recession.\n\nAnd so we think that is going to give us an appropriate level of buffer in the business. We've seen that play out before. So we're committed to the dealer inventory levels. So obviously, we'll modulate shipments based on that.\n\nThe good thing is, is that dealer inventory still is incredibly below where it has been historically. And so the teams are modeling out what could happen if we saw volume declines, and we know exactly the cost pool that we would need to go after. Some of that is just simply deferring. Some of it would be reducing in a more severe case.\n\nAnd we know what those levers are. We don't see any of that at play right now. But obviously, Bob and his team continue to monitor it. And the team, as evidenced by what we did in first and second quarter of 2020, the team is ready to go and will react quickly.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nThanks for that. My second question, just with respect to gross margins. You're up 15 basis points on 32% revenue growth. There's a lot going on this quarter, I appreciate that.\n\nBut can you help us just understand some of the puts and takes there and why the lack of leverage and how we should be thinking about that going Q4 into early '23?\n\nBob Mack -- Chief Financial Officer\n\nYeah, I think a lot of what you're seeing is sort of the year-over-year comparison challenge. The costs in Q3 -- while supply chain is starting, the costs are starting to trend in a positive direction relative to Q3 '21, they're still elevated. So that's really the main driver in the limited leverage in the quarter. But as we continue to play through Q4 and then into next year, those supply chain costs, we expect to continue to come down.\n\nThat will roll through inventory and we'll start to see better leverage.\n\nDave MacGregor -- Longbow Research -- Analyst\n\nThanks very much.\n\nOperator\n\nThe next question will come from Fred Wightman with Wolfe Research. Please go ahead.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nHey, guys. Good morning. I just wanted to come back to the restocking opportunity and really just to see if that $350 million sequential decline was in line with sort of what you guys were expecting last quarter? And then just to sort of get a sense if that was a matter of fulfillment that actually drove that number to come down or if you're actually seeing some change to dealer orders or backlogs or cancellations or anything like that?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, I guess I'd characterize it as there was a sequential improvement in dealer or in shipment and supply chain. But as we pointed out, I mean, the issue is we shipped an awful lot in September as the supply chain improvements allowed us to get through the rework that we had in the business. And a lot of those shipments actually happened in the last couple of weeks of the quarter. And if you think about it, from the time they leave, we recognize revenue and they actually show up on a dealership lot, go through setup and are out the door, that's what's actually happening in October.\n\nAnd so while dealer inventory did improve sequentially, we know as we watch retail daily, that we've cleared through at least on the ATV and even on the side-by-side, side of the business, we've cleared through an awful lot of that inventory here in October. And so while the progress of $350 million in the quarter was there, some of that has been eaten away at with stronger retail in the month of October. So that said, we did see some slowing. Like we said, we've seen some slowing in the lower end of the recreational category.\n\nAnd we've got inventory that -- I wouldn't say it's at optimal levels, but it's getting close. And that certainly performed a little bit better than we were expecting.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nOK, great. And then, Bob, you made a comment that you guys were comfortable in sort of the middle to upper end of the EPS guidance range, but then there was also some discussion about FX headwinds. So was that comment sort of including or excluding FX? And maybe if you could just reiterate what you were trying to get across there.\n\nBob Mack -- Chief Financial Officer\n\nYeah, so in my prepared remarks, I mentioned that we were comfortable in the upper end, mid- to upper end subject to FX. And I think that's just a little bit of a caution on our part, given that we don't know what's going to happen with FX rates in the fourth quarter. I mean they moved pretty dramatically in Q3 more than we were expecting. They seem to have leveled off at the moment, but global governments and what they're going to do with interest rates are anybody's guess.\n\nSo we're just giving ourselves a little bit of room in case that goes a direction that we're not expecting. And then also, as Mike said, -- we also -- we are going to be vigilant about maintaining dealer inventories at the right levels. And if we feel like we need to throttle back on production and shipments, if we see things start to deteriorate further in the fourth quarter, we'll certainly do that. So that's why we gain ourselves that room on the bottom line.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question will come from Xian Siew with BNP Paribas. Please go ahead.\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nHi, guys. Thanks for taking our question. I wanted to follow up on gross margin, particularly off-road. You almost did 26% gross margin in 3Q.\n\nIs this kind of the right baseline going forward into 4Q and '23? Should we continue to expect to see sequential improvement from here or how are you thinking about it?\n\nBob Mack -- Chief Financial Officer\n\nYeah, I think you should -- we expect to see continued improvement going into 2023. Obviously, in any given quarter, you're going to have some mix dynamics. In Q3, Q4, you have a shipment of snow units. If we return to some normal seasonality, you'll have a little bit of impact from that.\n\nBut if you kind of look at it on a normal production basis, this is what we said we were going to try to do, get back to the levels we've been at previously as supply chain starts to normalize and continue to improve from there as we focus on modularity platforming and our supply base. So this is a level where we are, but we're going to continue to focus on making it better because we're not happy with the margins at the moment.\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nOK, got it. That's helpful. And then you mentioned price sensitivity on the value models. Maybe can you talk about what's happening in that scenario? So are consumers seeing the price and maybe thinking the products too expensive and walking away? Are you stepping up promotions to move the unit or would you like look to lower pricing on some of those value units? Maybe just some color on what exactly is happening in that scenario.\n\nBob Mack -- Chief Financial Officer\n\nSure. So if you think about the buyer in that end of the category, particularly on the REC side, they tend to be a buyer who's financing the unit. So obviously, the financing costs continue to come up as rates rise. Financing penetration actually has gone up as people finance more at the dealers.\n\nSo we've got a little bit of -- we've got promo out there on select value units to buy down some rates at 36 months to provide some movement there. And then a little bit of promo on some of the stuff that's slower moving. But that customer is just more price sensitive and they're both going to look across the offerings of all those competitors looking at the price and then they may also make a decision to buy or not buy. So if we continue to see that slow down, we'll do some things from an advertising and promo standpoint that we're within our purview to do, but that is probably the weakest part of the consumer market right now, and I think that's kind of playing out across auto and others.\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nOK. Got it. And I guess just maybe just the mix between the value versus premium. You mentioned utility versus REC.\n\nBut do you have any color on value versus premium guess?\n\nBob Mack -- Chief Financial Officer\n\nYeah, I mean we definitely overweight toward premium, not necessarily in units, but obviously in dollars. So if you think about two or three seats versus crew model, we overweight toward CREW and then premium things like high-end wide open RZR and NorthStars and CREW Rangers, we tend to overindex toward premium.\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nGot it. Thank you so much.\n\nBob Mack -- Chief Financial Officer\n\nSure.\n\nOperator\n\nOur next question will come from Brandon Rolle with D.A. Davidson. Please go ahead.\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nGood morning. Just a couple of quick questions on optimal inventory levels. One, compared to where you were pre-pandemic, how do your current plans for optimal inventory levels compared to maybe what you thought they should be pre-pandemic? And two, what type of market share levels are you baking in for that one and a half times current inventory levels for dealer replenishment and off-road vehicle? Thank you.\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, I think from an optimal inventory level perspective, the simple answer is below where we were in 2019. It depends on the segment of the business within each of the categories. What I would say more generically is as you get into lower price categories, dealers like to have more inventory on hand. Those consumers tend to shop based on price.\n\nThey're not looking at customizing the vehicle as much, and they're not necessarily willing to wait. So you might see inventory levels that may not be quite where '19 was, but they'll certainly be close to. And then as you get into some of the higher-end segments, dealers want constrained inventory because it helps from a profitability standpoint. Those customers also tend to want to customize the vehicle more.\n\nIf you think about somebody who's buying it NorthStar RANGER or a Pro R or Turbo R RZR. They tend to want to make those vehicles a little bit more unique and get them tailor made. And as long as we're able to quickly deliver those vehicles, you'll see lower than what we saw in 2019 inventory level. And we're still working through all that.\n\nObviously, the supply chain dynamics play into that as well because what we don't want to do is constrain dealer inventory and then have supply chain issues that hamper our ability to deliver. So it's going to be a bit of a journey as we calibrate what those inventory levels are. What I would tell you is we've got the team, keenly focused on gaining share as we move forward. I talked a lot about the fact that our inventory levels in our utility business are low below where we would like them to be.\n\nWe're delivering to what consumers are prebuying, but we're not able to get our inventory up above those levels, and that's going to be a big focus, which has us in a positive share position, not just in the fourth quarter, but as we get into 2023.\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nOK, great. And just one last follow-up. The Japanese competition has been largely absent this year, maybe planning to come back next year. How do you plan to compete against.\n\nIt seems like a couple of more players potentially having more inventory in the space in 2023?\n\nMike Speetzen -- Chief Executive Officer\n\nI think it's the same focus we've had. The availability is absolutely key. And on top of that, making sure that we've got the right innovation coming out. We've got an exciting year coming up from an innovation standpoint.\n\nAnd I think whether it's the Japanese or some of our other competitors, I think it's going to put us in a really strong position.\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nGreat. Thanks.\n\nMike Speetzen -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question will come from Jaime Katz with Morningstar. Please go ahead.\n\nJaime Katz -- Morningstar -- Analyst\n\nHi. Good morning. \n\nMike Speetzen -- Chief Executive Officer\n\nGood morning.\n\nJaime Katz -- Morningstar -- Analyst\n\nSo last quarter, I think you guys offered some really interesting information on suppliers with part shortages impacting both more than 100 and 1,000 units. I want to make sure that, that is still trending in the right direction. And if that has alleviated completely, does that mean that maybe some of the costs with expedited shipping that you were originally paying, has that sort of ameliorated?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah, there's a reason we didn't put a chart in there. It's just becoming less and less of a dialogue. So all those metrics have improved sequentially. They continue to improve in the fourth quarter in terms of what we've seen.\n\nThat said, I don't want to make it sound like the supply chain is back to an optimal level. There are pockets where things are back to where we wanted to see them, but there are some areas that we still see constrained supply. Semiconductor is a prime example, in a much better spot than it was trending in the right direction, but it's going to be a bit of a journey until we get back to the levels that would be able to meet all the demand that we have in front of us, if you think about the amount of tech that we now have on the vehicle. So it's just not as bigger part of the equation.\n\nI think it's shifted toward the macro and the demand environment. But we're obviously spending, obviously, a lot of time still managing the supplier situation internally. And it's not yet to a level that allows us to get everything out there. That's a big part of this market share discussion we've had, specifically around our utility business, but it is moving in the right direction, and we're going to continue to push and do everything we can to make sure those improvements, not only stick, but continue to move in the right direction.\n\nBob Mack -- Chief Financial Officer\n\nAnd on the cost side, I mean we've definitely seen things like the expedite costs start to come down as we have to sort of fly less inventory over the top of what's on the water. The port congestion has cleared up pretty dramatically here in the last 60 days or so. So those costs are starting to come down. But to Mike's point, there are still challenges with various suppliers.\n\nAnd so those costs don't fully correct, and we expect to see that continue to moderate as we go into 2024, absent any other changes to the economy.\n\nJaime Katz -- Morningstar -- Analyst\n\nOK. And then just quickly, I know this wasn't mentioned, but are you guys finding any opportunities without saying too much for -- maybe tuck-in acquisitions to improve the vertical capabilities of the business, the way the next time we go through one of these cycles, we may be a little better positioned?\n\nMike Speetzen -- Chief Executive Officer\n\nYeah. I mean, look, we're certainly doing some work to make sure that we're prepared. But I'll tell you given the macro backdrop as well as just where we're trading, it's hard for me to imagine a better investment than ourselves right now. But we are keeping an eye out there, and there are things that are of interest, but we've got our priority set right now.\n\nWe've got a lot to do on the execution side. We've got a lot of exciting innovation coming, and I want to make sure that we're successful as that comes out in 2023. And at the current valuation, we think that Polaris is a really attractive investment.\n\nBob Mack -- Chief Financial Officer\n\nI do think we talk a lot about investing in our business, and we've ramped up the level of capex in the investment the last couple of years, and a lot of that has been focused on, not really exciting projects, but just adding more back shop production capacity and capability around the world that our various factories to allow us to bring back in things that have been outsourced just due to volumes. So we are making investments. And then to your point, some of the things that we were challenged with, we're looking at investments internally to do some of that, but not necessarily from an M&A perspective, more from a more organic investment perspective.\n\nJaime Katz -- Morningstar -- Analyst\n\nExcellent. Thanks.\n\nMike Speetzen -- Chief Executive Officer\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJ.C. Weigelt -- Vice President, Investor Relations\n\nMike Speetzen -- Chief Executive Officer\n\nBob Mack -- Chief Financial Officer\n\nJoe Altobello -- Raymond James -- Analyst\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nAnna Glaessgen -- Jefferies -- Analyst\n\nJames Hardiman -- Citi -- Analyst\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nDave MacGregor -- Longbow Research -- Analyst\n\nFred Wightman -- Wolfe Research -- Analyst\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nJaime Katz -- Morningstar -- Analyst\n\nMore PII analysis\n\nAll earnings call transcripts"
}