{
  "companyName": "Wix.com",
  "companyTicker": "WIX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/wixcom-wix-q2-2022-earnings-call-transcript/",
  "content": "Wix.com (WIX 1.48%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Wix Q2 2022 earnings call. [Operator instructions] I would now like to turn the call over to your host, Emily Liu, investor relations analyst. You may begin.\n\nEmily Liu -- Investor Relations\n\nThanks, and good morning, everyone. Welcome to Wix's second quarter 2022 earnings call. Joining me today to discuss our results are Avishai Abrahami, cEO and co-founder; Nir Zohar, our president and COO; and Lior Shemesh, our CFO. During this call, we may make forward-looking statements, and these statements are based on current expectations and assumptions.\n\nPlease consider the risk factors included in our press release and most recent Form 20-F that could cause our actual results to differ materially from these forward-looking statements. We do not undertake any obligation to update these forward-looking statements. In addition, we will comment on non-GAAP financial results and key operating metrics. You can find all reconciliations between our GAAP and non-GAAP results in the earnings materials and in our interactive analyst center on the Investor Relations section of our website, investors.wix.com.\n\nWith that, I'll turn the call over to Avishai.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nThank you, Emily, and good morning, everyone. Thank you for joining us today. I want to start our call this morning with some comments about Q2 and the highlights of some of the key points from our analyst and investor day in May. Nir will walk you through a few operational updates on the business.\n\nAnd Lior will wrap it up with the financial highlights and an update on guidance. As you know, COVID obviously brought a massive surge of people and businesses to the Internet for operating a business beginning in early 2020. We were fast to respond to the need of our users, helping them generate income, while the off-line income was brought to a standstill. As part of our response to the high demand, we increased our hiring activity.\n\nNow that we are post-COVID, the addition of new users to the funnels and came back to similar rates to 2019 levels. And people are buying less on the Internet and buying less off-line. This result in many of our users selling less, which lower our GPV. This is not unique to us as many Internet companies feel it.\n\nSo as the market continued to be volatile, which we obviously cannot control or predict, we are increasing our focus on what we can control to achieve the profitability targets we shared in the three years plan we presented in May. We committed to this plan, and we are executing on it. And so as we announced today, $150 million cost-saving plan to allow us to meet our profitability targets and accelerate gross margins and operating margins in 2023 if -- even if market conditions remain unchanged. Nir and Lior will walk you through more of those details.\n\nNow let's talk about the quarter. We are satisfied with how the fundamentals of our business remained strong in Q2. Revenue grew more than $345 million or 9% year over year, about where we expected, and grew 11% year over year on a constant-currency basis. The fundamental measure of our business performance remained very strong.\n\nIn fact, our average revenue per subscription is now 32% higher as of this quarter compared to Q2 2019. This is very positive as conversion and retention remained the same over this period. This tells us that users are finding much more value in our platform. Our partners business also continued to perform well, growing revenues 31% year over year.\n\nThis is on top of an incredible 87% year-over-year growth that we saw in the same quarter last year. Transaction revenues grew 13% year over year. And we continue to see increased adoption of Wix Payments growing our take rate. Even with consumer spending slowing, our GPV continue to grow.\n\nEven more amazing is that since Q2 2019, our GPV has grown 360%, which is incredible. So even with the demand coming back to 2019 level, our key growth initiatives are producing strong results. Stepping back, I want to summarize some of what we shared at our analyst and investor day and expand more on our strategic strategy going forward. Since the IPO, we have scaled revenues from $80 million in 2013 nearly 17 times to $1.3 billion over the last year while serving hundreds of millions of users across the globe.\n\nOur focus on product innovation and development, as well as marketing, has been a key driver of this growth. The first stage of our growth was introducing an elegant and simple website builder that everyone -- anyone could use to create online. Many of our innovation -- drag and drop, mobile design and AI design -- are now widespread across our competitors. Last month, we introduced our new Wix Editor, which I'm very proud of and excited about.\n\nThe new Wix Editor combines the best of our Wix Editor and Wix ADI, and we will provide a user with an even better creation experience than before. In addition, it will bring efficiency and increased velocity to our product development. This is the most significant update to our Wix Editor in many years, and we believe it will contribute significantly to increase conversion and user success online. We have tens of millions of users, and it was clear they wanted more.\n\nSo we moved into a second stage, which was an increased focus on businesses. We invested in what our users are telling us they want to manage and grow their business online. Over the last several years, we introduced many vertical commerce application, communication and marketing tools for businesses and payment capabilities. Today, self-creators business generate over $1 billion in annualized revenue and is very profitable.\n\nAs we shared with you in May. In fact, our self-creator business alone generate more revenues and is more profitable than the largest of our competitors serving the same market. We have now expanded into a third stage, and that is addressing the online creation needs of partners, professional creators, agencies, and enterprises. Our expansion has been informed by what we hear from our users.\n\nWe now have industry-leading infrastructure that deliver performance among the fastest in the industry, robust security, and high availability. We are now praised by partners for our outstanding SEO capabilities. We have massively improved our commerce application to meet the needs of professional and agencies. And we have Velo for application development and Editor X with advanced design needs.\n\nAll of this development require us to invest a significant amount of resources into not only R&D but also on marketing to build and run for professionals. This expansion have grown a total addressable market significantly to eight times larger than it was in 2017 to over $200 billion today. We believe we will scale our partner business to become profitable. Our optimism is supported by a strong behavior in our partner's cohorts, which grow booking annually from three to four times this first year within the first three years.\n\nAnd the number of professional coming to Wix every day to continue grow. We shared our three years plan for achieving this scale and profitability, and we are committed to it. And despite the market volatility we are experiencing during this period, I'm more excited about Wix today than I've ever been. With that, I want to turn it now to Nir.\n\nNir Zohar -- President and Chief Operating Officer\n\nThank you, Avishai. I want to start with a quick update on our cohorts and then talk more about the cost-cutting measures we are taking. As Avishai mentioned, while we see demand at the top of the funnel returning to 2019 levels, our cohort fundamentals continue to improve. We continue to share with you the bookings of our Q1 user cohorts over the years, as you can see on Slide 12 of our earnings slide.\n\nOur Q1 '22 cohort through the second quarter illustrates this strong performance. This cohort has generated $40 million in bookings since it was created. This figure is nearly as high as the Q1 '20 cohort at $41 million, which benefited from an increased online activity at the beginning of COVID, and it's higher than the last pre-COVID Q1 cohort from Q1 '19, which generated just over $38 million in bookings. This growth is impressive for a couple of reasons.\n\nFirst, with 6.1 million users, the Q1 '22 cohort was slightly smaller in size than either the Q1 '19 or Q1 '20 cohorts. Second, the growth also demonstrates that conversion and retention are at the same high rates as before. And just as importantly, the average bookings per subscription is increasing. This means we are monetizing our cohorts better.\n\nUsers are selecting business packages much more, and more are adopting business solutions, products, and services. If you recall, at the analyst day, we showed you the cohorts segmented between self-creators and partners. This performance in the Q1 '22 cohort is a result of the strong growth and bookings retention we're seeing in both the self-creators and partners cohorts. It's also worth noting that we're in much less favorable FX environment today compared to 2019 because we report in U.S.\n\ndollars but collect cash in local currencies around the world, many of which are at or near historical lows against the U.S. dollars. Finally, I also want to point out that while our marketing spend for this Q1 '22 cohort was indeed higher than either Q1 '19 or Q1 '20, our returns are very much in line with our goals, as you can see on the TROI chart we shared on Slide 13 in our slide deck. I now want to shift gears and talk about the measures we are taking to continue working toward achieving the profitability targets we set forth at our analyst day in May.\n\nThe roots of this plan actually began in Q4 of last year as we were making plans for 2022. You recall, we saw a lot of volatility and uncertainty and chose not to provide guidance at that time for the year because of it. We began thinking more carefully about developing more operational efficiency. We reduced our hiring activity and took a closer look at what was working and what was not.\n\nAs an example, we decided then that we should discontinue marketing Wix Answers as an external product. Volatility continued throughout the year, with the war in Ukraine, with increasing energy prices, high inflation, and currency fluctuations. Moving through Q2, we did not see improvements to the environment and recognize we need to take the next step in our plan to help us achieve our profitability targets. We are now executing this next step of the plan and announcing a series of cost-reduction actions.\n\nThey include rightsizing our employee base, which unfortunately means asking some people to leave. We are also making significant reduction in hiring activities for the remainder of this year and next year. As a result, we expect to realize approximately $150 million of annualized savings across our cost of revenue expenses, operating expenses, and capex. These cost savings are not onetime in nature and will continue to benefit the company on an ongoing basis, with 20% of the annualized savings being realized already in 2022.\n\nAlso, we are not reducing any investments in user acquisition marketing that is adjusted by our TROI thresholds, which we have not changed. We expect that these cost savings will allow our free cash flow margin in 2023 to be consistent with the range provided in our three-year plan even if market conditions remain challenged. It will also accelerate gross margin and operating margin expansion next year faster than we had presented. We continue to work to identify additional areas of productivity improvements across our care, marketing, and R&D functions, as well as opportunities, to rationalize our real estate footprint.\n\nThese measures will allow us to increase our investments in our highest conviction growth opportunities. And we expect to see free cash flow margin expansion in 2023 and beyond. I want to also add that our leadership made some very difficult decisions during this process. We've always been laser-focused on growth at Wix, and this will not change.\n\nThese changes allow us to continue to grow with a greater emphasis on profitability that is needed. We believe that these changes will make us stronger and prepare us for an even better future once the market stabilizes. With that, I would like to hand it over to Lior.\n\nLior Shemesh -- Chief Financial Officer\n\nThanks, Nir. Before I discuss guidance for the rest of the year, I'd like to highlight some of our second quarter results. Even against the market dynamics Avishai I mentioned earlier, revenue in the second quarter grew to over $345 million, representing 9% year-over-year growth and toward the top end of our guidance range provided in May. Revenue growth was 11% year over year on a constant-currency basis.\n\nTotal bookings grew 3% year over year to nearly $355 million, which was 7% year over year on a constant-currency basis. This was in line with our expectations as the headwinds that impacted revenue, mostly unfavorable FX changes, as well as the resetting of demand for online services and e-commerce to pre-COVID levels, had an even larger impact on bookings. FX decreased booking by approximately $10 million compared to the year-ago period. Both revenue and bookings growth were driven by strong fundamentals and continued successful execution against our key growth initiatives.\n\nIn the second quarter, we saw conversion of new users to paid subscriptions continue at a stable rate, ARPS increase, and retention remains strong. Following the end of the quarter, we began to see early signs of improvement in top of the funnel trends and higher return on marketing dollars in July into August. Our efforts to grow the partner business continue as planned, with revenue increasing 31% year over year in the second quarter as the investments we made in recent years begin to pay dividends and are driving momentum across agencies, designers, and developers across the professional ecosystem. Transaction revenue also continued to grow despite e-commerce growth largely resetting to the pre-COVID trend line.\n\nIt was up 13% year over year, driven by better monetization of payments as adoption of Wix Payments increased, as well as GPV growth of 6% year over year to $2.6 billion as a result of our diverse e-commerce platform. On the expense front, this quarter, we focused on executing on the targets we shared in May during our analyst day and driving leverage from the investments made over the past two years as the business scales. Non-GAAP total gross margin was up sequentially to 62.5% as Business Solutions non-GAAP gross margin increased to 23.2%, driven by improved margin in our Payments business. We continue to slow hiring and adjusted down our direct marketing investments by nearly 40% on a year-over-year basis to align with what we are seeing at the top of the funnel in order to stay within our TROI goals.\n\nAs a result, non-GAAP operating margin improved compared to the prior-year period. Finally, free cash flow, excluding capex associated with our headquarter build-out, was negative $6 million in the second quarter. This was lower than what we anticipated due to -- primarily to the unfavorable FX changes, which decreased free cash flow by approximately $10 million on a year-over-year basis. Turning now to guidance for both Q3 and full year of 2022.\n\nWe expect third quarter revenue to be $341 million to $345 million or 7% to 8% year-over-year growth. We now expect full year revenue to grow between 8% and 10% year over year. These growth figures account for additional year over year FX headwinds we experienced throughout -- through July and the assumption that 2022 is a year of continued volatility as demand resets to pre-COVID levels. Free cash flow margin for the full year is now expected to be at 2% to 3% as FX headwinds have deepened since May but still remain within the target range we laid out during our analyst day.\n\nOn a year-over-year constant-currency basis, our free cash flow for the full year would have been 4% to 5% of revenue in 2022 as we discussed back in February. Regarding the cost-reduction plan that Nir spoke about, we still expect to achieve the 2022 and the 2023 free cash flow targets we shared in May despite timing of macroeconomic recovery. Of the $150 million of annualized saving, about 25% will come from cost of revenue, mainly our care organization, which will produce about 200 basis points of gross margin improvement in 2023 compared to our three-year plan. We also anticipate to see gross margin improve in 2022 as we start to recognize savings related to care.\n\nThe other 75% will come mostly from headcount-driven operating expenses. These do not include any plans to reduce our user acquisition marketing investments that we adjust to match our TROI threshold, which we have not changed. This margin improvement will primarily be seen in our partners business. In times like this, there are certain things we cannot control.\n\nSo we are focusing on what we can control by executing on our strategic priorities while sustainably improving our cost structure. The action we are taking and decisions we are making today will help us emerge as a stronger and more resilient company once we are on the other side of this uncertain macroeconomic times. With that, we are ready to take some questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Kenneth Wong with Oppenheimer. Your line is open.\n\nKenneth Wong -- Oppenheimer and Company -- Analyst\n\nGreat. Fantastic. Thanks for taking my question. Avishai, I guess I wanted to maybe dig in on the return to normalization.\n\nWhen you look at the different pockets of your business, where are you seeing the biggest impact here? Is it the self-creators, your commerce customers? Is it across B2B agencies? Any color there would be extremely helpful.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nOf course. So I think the first thing we're seeing is that the GPV as -- went down, right, in the last couple of months. I think this is something that every company has seen. We've seen Amazon experiencing similar stuff, Shopify.\n\nSo I think that was probably the bigger thing that we see now. In terms of self-creators, I think that the inflation actually influenced more the formation of new innovation and people investing in their business. I mean, that has created some effect. In fact, we're pretty much there in the self-creators, back to a similar state of 2019.\n\nSo the demand is similar to 2019. Of course, our ARPU is better. And of course, now we also have GPV as a source of income. When it comes to designers and agencies, we see less of an effect.\n\nI think that because a lot of them have the constant flow of customers. And so we see less there. And so I hope that this answer your question.\n\nKenneth Wong -- Oppenheimer and Company -- Analyst\n\nYeah. That's fantastic. And then maybe just quickly, Nir, as far as the GPV downtick, would you say that that is just because consumer spend has obviously eroded? Or is there any maybe longer-term impact from having that softer premium subscription funnel over the last three, four quarters? Any help in terms of what you're seeing as far as kind of when that might bounce back would be great.\n\nNir Zohar -- President and Chief Operating Officer\n\nWell, so it's -- yes, it is mainly assumed to less consumers spend more than anything else.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\n100% from less consumer spending. That's what we're seeing.\n\nKenneth Wong -- Oppenheimer and Company -- Analyst\n\nOK. Perfect. Thank you, guys.\n\nOperator\n\nOne moment for our next question. [Operator instructions] Our next question comes from Brent Thill with Jefferies. Your line is open.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks. When you think about the assumptions you're making in the back half and into '23, what are you making in terms of your assumption that -- for the overall economy? Are you saying things are going to be stable, deteriorating, improving? How would you characterize your guide? Obviously, with the cut in numbers, everyone was just trying to calibrate. Are you baking in more conservatism here? Or how are you thinking about the overall environment?\n\nLior Shemesh -- Chief Financial Officer\n\nSo basically, what we assume that the headwinds that we experienced so far simply will continue. We're also assuming that the FX impact will also continue throughout the year. And this is pretty much what we assumed. And obviously, we are also conservative because of that.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nWe prefer to be very conservative regarding next year so we can build our free cash flow in a smart way to achieve the goal that we set to ourselves. Of course, if things get a bit more positive, that would be great.\n\nLior Shemesh -- Chief Financial Officer\n\nAnd yes, and this is the main reason why we want to take control over the cost. And this is something that is really important to do right now.\n\nBrent Thill -- Jefferies -- Analyst\n\nNumbers have been coming down. So just I want to follow up. Are you assuming then a more conservative view than historically because the numbers have been coming down lower? I'm just -- everyone's just curious, are you baking in that extra layer of conservatism in that pipeline conversion?\n\nLior Shemesh -- Chief Financial Officer\n\nYes. I mean, yes. I mean, when we look at where we started at the beginning of the year and what's happened, so it just makes sense to be extra conservative on the assumption with regard to the second half of the year.\n\nBrent Thill -- Jefferies -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nOne moment for our next question. Our next question comes from Brad Erickson with RBC. Your line is open.\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nYeah. Thanks. Maybe just a follow-on there. What do you think is driving this improvement to the funnel trends? You mentioned a couple of times in the letter in, I guess, July and into August here.\n\nIs that maybe just a little touch of seasonality? Is there something maybe improving on the margin macro-wise? And then kind of the follow-on to Brent's question, maybe what's baked into your guidance here relative to these near-term trends you're calling out?\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nLet me try and take the first two parts. And then Lior will answer this in the later part. I think that -- well, when we look at it, we compare seasonality to seasonality, so it's not a seasonality thing. I think we did, of course, a lot of product improvement because we always do.\n\nSo somewhat can be contributed to that. The other thing is that it does look some recovery in the macro of our users. I want to emphasize that if you remember, last year, we were the first -- Wix was the first to actually notice the decline, right? And I think our customers are reacting faster than most to changes because they are small and very agile. And so maybe that's what we're seeing now.\n\nIt's very early to say. We'll keep you guys updated. But I think if I have to take a guess, I would say that our customers are starting to act differently, OK? Again, it's very early, and that's why we don't want to declare anything there and say anything big about it. But we are seeing some positive changes.\n\nLior Shemesh -- Chief Financial Officer\n\nWith regard to the guidance, as Avishai mentioned, it's still too early to call it a trend. Further, new subscriptions booking over the last quarter and the half of the year will have very little impact on revenue as we all understand because we recognize revenue over time. Also, I think that it's important to mention that we do not yet see an increase in commerce activity, which has a big impact on our revenue.\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nOne moment for our next question. Our next question comes from Ron Josey with Citi. Your line is open.\n\nRon Josey -- Citi -- Analyst\n\nGreat. Thanks for taking the question. Maybe I wanted to ask a little bit about the $150 million of savings. And specifically, maybe Lior, you can talk a little bit more where they're coming from.\n\nI think we heard call center, some capex. But I guess the focus here is, any impacts to product development overall? I think we talked at the analyst day just being in a good spot of cadence for new products. So any insights on how you feel about product development given the cuts here? And then the next question is just about the new Editor experience and then the New York City like development data that's happening in a few weeks. Just any insights on the rollout plans for the new Editor and what to expect for this developer conference.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nIn regard to your last question, which is actually a tool question, right? So It's about Editor 2. I think Editor 2 is, for me, a very exciting product. We took two things that were separate that we knew are working very well, the classic Editor and the ADI, and combining into one product. So this is actually making the -- it's a complete experience.\n\nYou can use the power of AI design within a regular -- the regular Wix classic Editor. We did some -- a lot of additional improvements that make the experience, I think, really smooth. So that is very exciting. It will be serving self-creators and will be serving agencies, of course.\n\nThe event that we have in New York is aimed for agencies, and not just agencies, the most professional agencies. They want to actually do custom development on top of Wix. And we are releasing a lot of new products there and talking a lot about new things. And that, we think, will allow us to extend that line of business tremendously in the future.\n\nSo it's going to be really interesting. You're more than welcome to come.\n\nRon Josey -- Citi -- Analyst\n\nThanks, guys. Appreciate it.\n\nOperator\n\nAnd one moment for our next question. Our next question comes from Deepak Mathivanan with Wolfe Research. Your line is open.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for taking my question. So Lior, can you unpack the second quarter bookings growth? Maybe just on the self-creator side between what you saw on the subscriber growth and pricing. I know you have pricing tweaks and uncertainties early in the year.\n\nCurious how much that's contributing to bookings right now.\n\nLior Shemesh -- Chief Financial Officer\n\nThe question was --\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nThe pricing tweaks and uncertainties early in the year. Curious how much that's contributing to bookings right now.\n\nLior Shemesh -- Chief Financial Officer\n\nThe question was about the price increase and how it affects bookings. That was the question?\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nYes, yes. Just curious on growth in subscribers right now.\n\nLior Shemesh -- Chief Financial Officer\n\nSo we -- first, I will start with the price increase in the contribution to booking. So we had a positive impact. This is why the -- that was the reason why we've made those changes in terms for the pricing. But it was not a significant one to booking, meaning it does have positive impact but it's not significant.With regard to the overall subscriptions, so it has a negative impact, although it is positive in terms of dollar value.\n\nSo it's important to mention that.\n\nOperator\n\nThank you. One moment for our next question. Our next comes from Elizabeth Porter with Morgan Stanley. Your line is open.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nHi. Thank you so much. So it was really encouraging to see the cost discipline helped offset those revenue headwinds and the reiteration of the free cash flow margin targets. And my question is around kind of the revenue that we should be looking toward to applying those free cash flow target -- the margin targets.\n\nAnd with bookings kind of growing 3% year over year and the revenue guidance implying Q4 revenue grows about high single digits year over year exiting the year and understanding macro was challenging, how has the outlook for fiscal '23 revenue growth of that 20-plus percent changed over the last three months? And kind of walk us through any of the puts and takes between B and B contribution and pricing versus maybe a more challenging macro?\n\nLior Shemesh -- Chief Financial Officer\n\nSo obviously, the macro has been more difficult and very hard to predict in term of the top line. But we are fully committed to the free cash flow target that we provided back in May during the analyst day. So I think that I'm happy to say that in any -- almost in any given scenario, it's hard to set any given scenario. But even if we are looking at the overall economic that continue -- or the macroeconomic continue into 2023 the same way as we've seen in 2022, we believe that we will be able to achieve the free cash flow targets that we had in our analyst day.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nI want to add something here. I think that this year, we've seen a massive effect from things like, of course, FX. We're seeing massive effect from Russia. We actually closed a lot of accounts.\n\nWe've seen the effect of the size, of course, which is, in a relative basis, tremendous from the COVID and this year. And I think that without -- if you neutralize all of those, we'll probably still would have achieved this year close to 20% growth. I think that the combination of all those factors together in one year had a massive effect on us. So next year, again, it depends, when we see FX or not, will we see some recovery or not.\n\nBut I think that the one thing we, as a company, can commit to is free cash flow and doing that by having discipline on how we spend our money.\n\nOperator\n\nSorry, I was muted this whole time. One moment for our question. Our last question comes from Mark Mahaney with Evercore ISI. Your line is open.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nGreat. Thanks. Two questions. Could you just again quantify the Ukraine-Russia impact to Wix's business, both on the incremental costs associated with that this year and then if there's the extent of the revenue impact? And then secondly, I know somebody already asked about this improvement in the top of the funnel activity you talked about in July and early August.\n\nWas that -- the new Wix Editor product, was that part of that? Or do you think that was completely separate? And getting back to -- what would have driven that improvement in the top of the funnel activity?\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nSo I think that if you look at the Russia-Ukrainian war, it has a lot of effect on us. And part of it is that we closed accounts in Russia, right? And then we've seen a much less growth from accounts in Ukraine, right? So this is the first part. I would assume that this is around $5 million. The additional thing was cost of helping our employees in Ukraine.\n\nWe had about -- we have about 1,000 people -- had about -- still have -- most of them are not in Ukraine anymore, but that used to be in the beginning of the war Ukraine. We had to relocate them. We have to support them. So this is a lot of influence.\n\nIt also have a lot of influence on product releases. I think, of course, obviously, when people are running from war, they don't do what they normally do, and that's working. And I think now most of it is in a place that we are in a controlled situation. We managed to take most of our employees to safe locations, and we're pretty much back to normal.\n\nBut the Ukraine and Russia war on us and the bigger effect, I think, on most of the companies is, of course, because we're in the sustainable business in Russia and growing and in Ukraine and because we have a lot of employees in Ukraine. As part of to -- your second question, which was -- if we understand why you think July and August improvement. So it's very hard for us to say, as I mentioned before. While we -- and I wouldn't call it a trend yet, right? It's very early.\n\nHowever, when we look at the numbers, we're saying that there are -- if we compare them to last year, we're actually seeing growth in some key areas. I believe that it might be a signal that the mood of our customers have changed. And that actually creates a place where they are starting to innovate, reinvest into their businesses, create new businesses, create new innovation. However, as I said, it is a very young trend.\n\nThe editor -- the new editor, Editor 2.0, was launched last week. So I don't think that that has contributed. In fact, a lot of those trend changes were happening before we released the new version.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thank you, Avishai.\n\nOperator\n\nAnd I would now like to turn the call back over to the company for closing remarks.\n\nEmily Liu -- Investor Relations\n\nGreat. Thanks, Mark, and everyone else for those questions. That's all the time we have for today. Thanks, everyone, on the call for joining us today.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEmily Liu -- Investor Relations\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nNir Zohar -- President and Chief Operating Officer\n\nLior Shemesh -- Chief Financial Officer\n\nKenneth Wong -- Oppenheimer and Company -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nRon Josey -- Citi -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nMore WIX analysis\n\nAll earnings call transcripts"
}