{
  "companyName": "The Lovesac Company",
  "companyTicker": "LOVE",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/the-lovesac-company-love-q2-2023-earnings-call-tra/",
  "content": "The Lovesac Company (LOVE 3.00%)\nQ2 2023 Earnings Call\nSep 08, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings and welcome to Lovesac's second quarter fiscal 2023 earnings call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nI would now like to turn the conference over to your host, Rachel Schacter with ICR. Thank you. You may begin.\n\nRachel Schacter -- Investor Relations\n\nThank you. Good morning, everyone. With me on the call is Shawn Nelson, chief executive officer; Mary Fox, president, and chief operating officer; and Donna Dellomo, chief financial officer. Before we get started, I would like to remind you that some of the information discussed will include forward-looking statements regarding future events and our future financial performance.\n\nThese include statements about our future expectations, financial projections, and our plans and prospects. Actual results may differ materially from those set forth in such statements. For a discussion of these risks and uncertainties, you should review the company's filings with the SEC, which includes today's press release. You should not rely on our forward-looking statements as predictions of future events.\n\nAll forward-looking statements that we make on this call are based on assumptions and beliefs as of today, and we undertake no obligation to update them except as required by applicable law. Our discussion today will include non-GAAP financial measures, including EBITDA and adjusted EBITDA. These non-GAAP measures should be considered in addition to and not as a substitute for, or in isolation from our GAAP results. A reconciliation of the most directly comparable GAAP financial measure to such non-GAAP financial measure has been provided as supplemental financial information in our press release.\n\nNow I'd like to turn the call over to Shawn Nelson, chief executive officer of the Lovesac company.\n\nShawn Nelson -- Chief Executive Officer\n\nThank you, Rachel. Good morning, everyone, and thank you for joining us today. Today, we will start by reviewing the highlights of our second quarter fiscal 2023 performance and then discuss Lovesac's strong positioning within the industry. Then Mary Fox, our president, and COO will update you on the progress we made against strategic initiatives this quarter.\n\nAnd finally, Donna Dellomo, our CFO, will review our financial results and a few other items related to our outlook in more detail. Jack Krause, chief strategy officer is also in the room to participate in the Q&A session. We are pleased with our second quarter results and with top and bottom line performance that exceeded expectations against a still dynamic macro backdrop. After recognizing some pullback in consumer spending at the outset of the quarter, as we said on our last call, the pursuant attenuation was less dramatic than anticipated.\n\nThis was up against last year's very strong Q2 when we achieved our highest quarterly growth rate ever as a public company. I'll also remind you that our results are perhaps the most recent and real-time results in the home category because we typically ship out and deliver goods just days after order and do not carry much of a backlog ever. Now let me review the highlights of our second quarter performance. Total sales were $148.5 million, up 45% versus the prior year period.\n\nWe delivered total comparable sales growth of 31% with broad-based strength from both new and existing customers. Adjusted EBITDA grew to $14.1 million from $12.4 million in the prior year period, despite expected supply chain-driven gross margin pressure as we've managed our expense structure with discipline. We continue to invest in high ROI marketing and advertising, which is a key contributor to the brand awareness gains and resulting sales success that we are seeing. Importantly, we deliver these results against an industry backdrop that proved challenging for many, illustrating our market share gains of a very small base in a large and fragmented total addressable couch + home audio market of $46.2 billion.\n\nThe home category is down year on year into the double digits. Our very high growth rate quarter after quarter and four and a half years now should speak for itself. This growth is fueled primarily by the compelling value proposition of our Designed for Life product platforms, which are reaching brand awareness and customer adoption rates that are currently at important inflection points, building strength on strength. So why has Lovesac proved to be so resilient throughout the past number of tumultuous years and even the most recent quarters? Sustainability, in-stock position, best-in-class showroom economics, rapid product adoption, and growth with profitability are all a direct result of our Designed for Life business model in action.\n\nWe believe this will continue to be made apparent as we continue to grow. We do not merchandise a broad assortment like most of our peers. We do not operate on seasonal cycles like most of our peers. We don't create all of the operational, executional inefficiencies that come along with that model for the business, or for the consumer.\n\nWe invent and patent new solutions in categories with big ticket items and high margins to be had. We will continue to expand on this. With superior products paired with depth marketing comes a superior market share, and we are well on our way to achieving that with a long way to grow still. We believe we can ultimately take an outsized portion of market share with superior solutions like these.\n\nSactionals, with their myriad advantages are currently the best example of the scale that is possible for a Designed for Life product. Having only achieved between 1% and 2% market share so far in a highly fragmented couch category, we believe we are finally through that early adopter phase and on to the early majority phase of that classic product adoption curve. For this reason, we believe the best is yet to come. Word-of-mouth is now driving nearly a third of Sactionals' purchases because of their unique and highly competitive qualities.\n\nThis bolsters our marketing ROIs ongoing versus other competitors who essentially sell well-designed but generic solutions. We have demonstrated, that the more we sell, the more we will sell. And with our customer satisfaction scores improving even as we scale due to our continued investments in process, systems, services, and infrastructure, we believe Lovesac is a brand that can continue to gain further strength in the mind of the consumer. This is in part why our growth has been so resilient.\n\nOur growth was very high before COVID, during COVID, after COVID, and now, even in this challenging macro environment continues to be extremely strong versus the broader home furnishings category, which is down overall this year, even as we are way up. Finally, we have built our brand with the right consumer in mind, the young parent want-it-all, we are targeting with our pricing, marketing, and advertising are resilient groups during times like these. These are high earners at the peak of their household establishment and furniture investment years, typically 35 to 45 years old. Our narrow focus on the couch as a subcategory of the broader furniture category is no accident.\n\nThere are many objects within the home that are truly discretionary spending. But as we know, through our considerable investments in research, one household needs to replace worn-out sofas, relocate, or remodel, and the couch is at the top of the list of furniture priorities. And our marketing is there to highlight the unique attributes of our platform and win their business. Our marketing spending in absolute dollars growing nearly as fast as our top line sales have.\n\nThis further strengthens our moat the bigger we get, our now 174 Lovesac touchpoints, 158 showrooms, 14 kiosks, and two mobile concierges Lovesac trucks, and seamless omnichannel execution drives conversion. Those three drivers replacement, relocation, and remodeling are the top three drivers of sales for Sactionals, and lastly, followed by new home purchases. That dynamic is unique to Lovesac versus the broader category, which is why even in times like these, we believe we can continue to thrive. Our growth strategies are designed to fortify our position and build on our market share gains, and I am proud of the progress we continue to make against each initiative.\n\nFrom the more recent strong reception of our key innovation, StealthTech to the effectiveness of our marketing and brand awareness investments, to the expanding productivity of our showrooms and healthy digital channel growth. We are thrilled to see the impact of the work we're doing across all these areas continue to drive our topline performance and fuel our market share gains. The runway we have with our growth initiative combined with our focus on disciplined execution gives me confidence in our ability to continue our share gains in any type of macro environment. Even as we navigate the supply chain challenges the industry is facing, our teams have demonstrated strong expense discipline and prioritized high ROI marketing spending, as well as investments in key systems, talent, and infrastructure in order to solidify our foundation to support the long runway of growth that lies ahead.\n\nIt is the supply chain and technology investments we have made and continue to make that have enabled our industry-leading in-stock positions and improved customer satisfaction scores. So in support of our actual and planned market share gains, we've made accelerating growth investments in these areas, as Mary and Donna will discuss momentarily, while we could easily deliver adjusted EBITDA margin expansion this year, redeploying approximately 100 basis points of EBITDA margin toward this important technology and supply chain areas is the right decision for the operational efficiency of our business and in turn, customer satisfaction, which will set us up to win ongoing. Finally, our commitment to sustainability is foundational to how we operate and continues to lead us to unique and competitive outcomes that resonate with consumers in these changing times. Sustainability at Lovesac means not only sustaining hyphen a ball products, things that actually sustain, but sustaining hyphen a ball business model that you are seeing the fruits of every time we report.\n\nWe will marry our long-term Designed for Life products with long-term focused services, programs, and policies according to our circle-to-consumer philosophy. Ultimately resulting in long-term relationships with customers who love our brand for myriad reasons. Even in high growth mode, we have always and will always operate this business with great discipline, managing our expenses and investments, and balancing our growth goals with a focus on profitability and returns. Our stated mission includes the mandate to build the world's most beloved home brand.\n\nWhile achieving targets of zero waste and zero emissions by 2040, we're rapidly on our way. Lastly, I want to thank the entire Lovesac team for their commitment and execution that have enabled our financial and operational performance, we call them the #LovesacFamily. We are able to deliver what we deliver because you do what you do. With that, I'll hand it over to Mary to cover our strategic priorities and progress.\n\nMary?\n\nMary Fox -- President and Chief Operating Officer\n\nThank you, Shawn. And good morning, everyone. Our quarter two results marked a record second quarter for our company. As Shawn said, it was an outstanding performance, and given these results, we have now achieved 17 consecutive quarters of greater than 25% growth.\n\nThis represents a CAGR of 45.4% in the past four years, demonstrating significant market share gains over the course of time. Do you think fiscal 2020 is our baseline? Our three-year comp growth stack is 215%, with a strong focus on profitability and an adjusted EBITDA margin dollar growth of over 500% in the same time period. We are also encouraged by the continued demand strength we are seeing this year, which is again in sharp contrast to what the category is experiencing, as Shawn said. In quarter two, our estimate shows that we continue to win with our customers gaining significant market share as the strongest performing competitive brand in the seating category.\n\nThe large and highly fragmented market in which we operate presents a significant share opportunity, even if macro conditions were to turn less favorable for our core demographic. This is due to the unique values that are built to last products offer the strong word-of-mouth and relevancy, and the disciplined execution of our key strategic priorities, which I will provide a few updates on now. Starting with one product innovation. We continue to be pleased with the progress of StealthTech, which was a game changer for us in the category from an innovation standpoint.\n\nHere are some key highlights, we saw attachment rates increase significantly versus quarter one fiscal '23, as adoption continues to grow on a sequential basis. This is meaningful as Sactionals that were sold with StealthTech had an AOV nearly three times that of those that did not. The initial success of the launch and the sequential progress we are seeing in what is a multiyear commitment provides this reassurance as the launch support and product continue to build relevance and appeal. Number two, efficient marketing and merchandising strategies.\n\nIn quarter 2, we continue to be pleased with our ability to maintain product margin in light of the inflationary environment. Additionally, based on KPIs we track, we continue to see a strengthening of our brand health metrics versus the category trends. This bodes well for our goals of driving a higher share of our category as we continue to expand awareness through our media mix, and relationships with Costco and Best Buy, and leverage our very strong word-of-mouth referrals from customers, which is again our number one driver of awareness customers who made it to the purchase phase. Further, the lower part of the purchase funnel is strengthening, driven by both brand health and a focus on consideration to conversion targeted media.\n\nWe continue to see our in-market media performance trending in line with projections, and our media costs as a whole have stabilized, which allows us to lean into testing, including new programs such as spending on TikTok, and additional local, and hyper-targeted media. Which brings me then to number three, omnichannel operations, including touchpoints, and e-commerce. We continue to see strong e-commerce sales versus last year are up 20.5%, which is also bucking the trend in the category. We attribute these results to the strength of our brands, adding new digital programs into our mix, as well as the expansion of full-funnel advertising throughout search and social media marketing.\n\nFor e-commerce optimization of the customer journey remains a main focal point for the balance of the year heading into the holiday season. For digital marketing in quarter two, we continue to expand and lean into advertising that drives shoppers to their closest touchpoints. We are expanding into new local-based programs like YouTube local and the amplification of geo-marketing in social media advertising. And in quarter three, we're launching Gladly, a new omnichannel customer service platform, allowing us to better service our customers across all of our customer journey touchpoints, and increasing customer satisfaction and loyalty.\n\nAs we look to our touchpoints, our showrooms continue to play a critical role in our omnichannel strategy driving these strong results delivered in quarter two. The strengthening of the lower portion of our purchase funnel is supported by the expansion of the number of highly productive touchpoints, and location-based digital marketing targeted at driving traffic into these locations. In quarter two, we opened 11 new showroom touchpoints and one kiosk. We continue to see strong performance in lifestyle and off-mall locations and plan to actively pursue those opportunities as part of our evolving real estate strategy.\n\nOf the 11 showrooms, opening quarter two, eight are off-mall, primarily made up of lifestyle center locations. We are very happy with the performance of these new touchpoints which are performing above expectations and delivering higher sales per square foot than our targeted performance. As we continue to focus on delivering a best-in-class omnichannel experience in quarter two, where accelerated our investments in a new omnichannel cloud-based POS platform, and launched a strategic relationship with PredictSpring. This POS vendor is a world-class global POS provider and aligns closely with our technology focus.\n\nThis investment lays the groundwork for 15 location pilots in quarter four, paving the way for the balance of the chain rollout in fiscal '24. This new POS aims to increase transaction efficiencies and set the showroom operating model up for greater productivity, especially through peak times. And then for making disciplined infrastructure investments, as you continue to see with growing our customer base, selling more, and we're doing it while creating happier customers. We continue to invest in our infrastructure and capabilities to drive and fuel our growth.\n\nBuilding a frictionless and inspiring customer experience from research to living with our products has been a priority for us for years, and we have seen our customer satisfaction scores significantly increase year over year. This performance has been led in particular by improvements in fulfillment and our digital experience, which has been a key focus for us this year. The fulfillment customer satisfaction increase in quarter two of over 500 basis points versus last year was achieved as our inventory levels returned to the weeks of stock that we have been targeting. We have been delivering orders to our customers better than ever, and as you are aware, our business model is advantaged versus our competitors with evergreen inventory and only 1% of our inventory that is aging, which is world-class.\n\nThe increase in customer satisfaction in fulfillment improvement was also driven by a commitment to making disciplined investments in infrastructure. Our investments in the supply chain around diversifying, and increasing redundancy have allowed us to remain in a strong yet appropriate inventory position. This sets us up well to deliver a very strong back half of the year while continuing to reduce the impact of tariffs on goods from China head on our business and maintaining a best-in-class delivery time. We're pleased to see a return to pre-pandemic lead times for manufacturing and ocean transportation, despite some US port delays and inbound trucking volatility.\n\nAs we all see container pricing is coming down from the historic levels, although not yet to the 2019 rate. And we will see the associated benefits in fiscal '24. As Shawn said, we achieve strong growth into and beyond fiscal '24. We are accelerating growth investments this year in three key areas.\n\nThe first is increasing our distribution capacity by adding one DC to our four DC networks to support our future growth. This facility is expected to be operational at the end of quarter four. And our team has already started to work on this and will begin to realize the associated expenses in quarter three. This DC will increase our distribution capacity by approximately 15% and enable us to improve lead times and customer satisfaction.\n\nThe second is accelerating supply chain technology investments, including a transportation management and order management system to ensure that we continue to drive customer satisfaction and manage the growing scale of our business. And thirdly, we will be investing in IT capabilities, including talent, external expertise, and technology, including the new POS system I mentioned earlier. These investments are critical for us to continue our overall growth trajectory with the operational efficiencies required to deliver this. So in summary, we're very pleased with our financial and operational performance during quarter two.\n\nWe will continue to invest in high ROI marketing and advertising, which has been a key contributor to our brand awareness, growth, and overall results. We will continue to build out operational capabilities to drive our future growth and ensure that we can continue to scale with excellence. We are proud of our results and the outperformance in the category, which is being driven by a compelling value proposition that our Designed for Life business model offers. As we look to the back half of the year, we will continue to drive the exceptional execution of the entire Lovesac team as we navigate the dynamic operating environment.\n\nAnd we remain committed to our growth initiatives, financial controls, and operational excellence to drive market share gains and strong financial returns. I will now pass the call over to Donna to review our quarter two results and a few details related to our fiscal '23 outlooks. Donna?\n\nDonna Dellomo -- Chief Financial Officer\n\nThank you, Mary. And good morning, everyone. I will begin my remarks with a review of our second quarter results, and then provide a framework for how we are approaching the remainder of fiscal 2023. Net sales increased by $46.1 million or 45% to $148.5 million in the second quarter of fiscal 2023.\n\nThe year-over-year net sales increase was driven by growth across all channels. Showroom net sales increased by $29.8 million or 47.7% to $92.4 million in the second quarter of fiscal 2023. This increase was due in large part to a comparable sales increase of $19.9 million, or 36.8% to $74 million in the second quarter of fiscal 2023, which is compared to $54.1 million in the prior year period. This increase is principally related to higher point-of-sales transactions and slightly higher promotional discounting, strong promotional campaigns, and the addition of 35 new showrooms, 14 kiosks, and two mobile concierges as compared to the prior year period.\n\nAs a reminder, point-of-sale transactions represent orders placed through our showrooms, which does not always reflect the point at which control is transferred to the customer and when net sales are recorded. Internet net sales, sales made directly to customers through our e-commerce channel increased by $6.1 million, or 20.5% to $35.5 million in the second quarter of fiscal 2023, as compared to $29.5 million in the prior year period, with the increase principally driven by the strong performance of our promotional campaigns. Other net sales, which principally include pop-up shop, shop-in-shop, and barter inventory transactions increased by $10.2 million or 98.3% to $20.6 million in the second quarter of fiscal 2023, as compared to $10.4 million in the prior year period. The increase was primarily driven by a pull-forward of planned Open Box returned inventory transactions with an Icon or inventory barter partner.\n\nAs a reminder, our inventory transactions with Icon are part of our CTC, DFL, and ESG initiatives where we repurpose returned Open Box inventory in exchange for media credits, which are being used to support our advertising initiatives to create brand awareness and drive net sales growth. Additionally, we expand our Best Buy shop-in-shops by 18 locations, bringing the total count to 22 locations. These increases were partially offset by a shift in programming coupled with lower productivity of our temporary online pop-up shops on costco.com compared to the prior year period. By product category, our Sactional net sales increased 53.1%.\n\nOur other categories net sales, which include decorative pillows, blankets, and other accessories increased 35.6% over the prior year period. Due to the shifts in our SAC promotional activity, SAC net sales decreased 15.4% in the second quarter but had increased 15.8% over the prior year's six-month period. We exceeded the second quarter net sales guidance we shared with you on our last call, primarily driven by the success of our Father's Day and July 4th promotional campaigns. In addition to increased warehouse throughput, even with increased demand.\n\nWe also accelerated the majority of our full year projected return box inventory transactions to provide us additional space for normal growth in inventory levels prior to the holiday season. The decrease in gross margin rate of 310 basis points over the prior year period was driven primarily by an increase of approximately 440 basis points in total freight costs, which includes inbound and outbound freight, tariff expenses, and warehousing costs. These costs were partially offset by an improvement of 130 basis points in product margin, principally driven by a one-time vendor rebate related to currency impacts, lower promotional discounting, and vendor negotiations to assist with the mitigation of tariffs. Our gross margin percent exceeded our guidance, driven primarily by lower inbound freight costs than we had projected as a result of less than projected volume of inbound containers received during the second quarter, which is shifting these costs to the third quarter and a slight benefit to the inbound freight rates we had projected.\n\nWe do anticipate freight rates to continue to decrease over the remainder of fiscal 2023, but because of the amount of inventory we maintain on hand to support customer satisfaction of the brand, we will not see the full benefit of the drop in these rates as compared to the prior year until the associated inventory is sold beginning late Q4 through the first half of fiscal 2024. The 38.1% year-over-year increase in SG&A was largely driven by an increase in employment costs due to new hires and variable compensation, overhead expenses, an increase in rent expense related to the addition of 51 touchpoints, and a higher percentage of rent related to the touchpoint net sales increase. Overhead expenses increased due to infrastructure investments and selling-related expenses, principally due to the credit card fees related to the net sales increase. SG&A expenses, the percent of net sales decreased by 160 basis points due to higher leverage within the rent, infrastructure investments, equity-based compensation, insurance, and selling-related expenses are partially offset by travel and employment costs.\n\nThe deleverage in certain expenses relates to the continuous investments we are making into the business to support ongoing growth. Advertising and marketing expenses increased by $6.1 million or 46.4% to $19.1 million in the second quarter of fiscal 2023. As compared to $13 million in the prior year period, as a result of continued investments in marketing spending, and awareness campaigns to support our sales growth. Advertising and marketing expenses were 12.9% of net sales in the second quarter of fiscal 2023, as compared to 12.7% of net sales in the prior year period.\n\nThe slight increase in basis points is due to an increase in media spending to support our net sales growth. Depreciation and amortization expenses increased by $1.5 million from the prior year period to $3.1 million, principally related to the current year's capital investments for new and remodeled showrooms. Operating income was $9.9 million compared to $9 million in the second quarter of last year, driven by the factors just discussed. Net interest income of $3,000 for the second quarter was above the prior year's second quarter expense of $46,000.\n\nBefore we turn our attention to net income, net income per diluted share, and adjusted EBITDA, please refer to the terminology and reconciliation between each of our adjusted metrics and their most directly comparable GAAP measurements in our earnings release issued early today. Net income was $7.1 million or $0.45 per diluted share in the second quarter of fiscal 2023, compared to net income of $8.4 million or $0.52 per diluted share in the prior year period. During the second quarter of fiscal 2023, the company recorded $2.8 million for a provision of income taxes as compared to $500,000 for the second quarter of fiscal 2022. The increase in income taxes is primarily driven by the increase in the effective tax rate to 28% in the second quarter of fiscal 2023, from 5.8% in the second quarter of fiscal 2022.\n\nThis is due to fiscal 2022 having the benefit of the release of the valuation allowances on the company's net deferred assets. The valuation allowance was fully released as of the end of the fiscal year 2022. We generated an adjusted EBITDA of $14.1 million in the second quarter of fiscal 2023 as compared to $12.4 million in the prior year period. Adjusted EBITDA rate exceeded expectations driven by the higher gross margin percent, partially offset by an increase in SG&A related to the increase in net sales, as well as a conscious decision to reprioritize spending from the second half of the fiscal year, such as advertising and marketing, and increase investment surrounding supply chain technology, including a new POS system and resources to support the continued growth of the business.\n\nTurning to our balance sheet. Inventory increased 95% year over year, and we feel very good about both the quality and the quantity of our inventory. Our evergreen in-stock inventory is a competitive advantage and is not comprised of seasonal merchandise. Therefore, we do not run the risk of being overstocked or having to be promotional to reduce inventory levels.\n\nOur inventory levels are in line with our annual projections and our goal to support our growth and maintain industry-leading in-stock positions, with nearly half of the increase in year-over-year ending balance sheet inventory costs related to increased freight. The increase in inbound freight costs reflects the impact of the continued global supply chain situation. We expect that the rate of the year-over-year increase in our total inventory balance will moderate by year-end. We ended the second quarter with $17.7 million of cash and cash equivalents and $36 million in availability on our revolving line of credit with no borrowings.\n\nPlease refer to our earnings press release for other details on our second quarter fiscal 2023 financial performance. Regarding our outlook. We continue to operate in a dynamic environment with a wider range of potential outcomes as it relates to fiscal '23. Given this, we are not providing formal guidance but will provide you with a framework for how we are approaching fiscal 2023.\n\nFor fiscal '23, we reiterate what we shared with you on our first quarter earnings call, which was more than 25 plans showroom openings and continued infrastructure investments to support the substantial multiyear growth opportunity that lies ahead. Even with all of the headwinds the furniture category is experiencing, our competitive product advantage and in-stock inventory position provide us the confidence to reiterate the net sales and gross margin framework for the year that we shared on our first quarter earnings call. In a scenario where net sales growth for the fiscal year is in the previously discussed low 30% range, third quarter and fourth quarter net sales growth would be approximately 15% and 23% respectively. The expected moderation in sales growth rate in Q3 from the levels we just reported is principally related to increased throughput and acceleration of returned Open Box inventory transactions in Q2, representing approximately $9.5 million in net sales as discussed earlier.\n\nWhile we continue to expect the gross margin rate to be approximately 300 basis points below fiscal 2022, the decline is expected to be approximately 574 basis points in Q3 and 40 basis points in Q4 over the prior-year quarter. In Q3, we are estimating an increase in total freight cost over the prior year of approximately 400 basis points, primarily related to higher outbound last mile fuel surcharges and higher inbound freight costs incurred in the first half of fiscal 2023 as compared to the prior year. As a reminder, inbound freight costs are capitalized in inventory and amortized to the P&L based on projected weeks of supply of inventory. This aligns the cost of the inbound freight to when the inventory is sold.\n\nProduct margin is also estimated to decline by approximately 174 basis points related to higher promotional discounts than the prior year period. As Shawn and Mary mentioned, we have reprioritized and accelerated certain infrastructure spending around the supply chain, technology, and resources to support our strategic growth roadmap. As a result of this reprioritization, while adjusted EBITDA for fiscal 2023, is projected to grow in dollars over the prior year. We expect the adjusted EBITDA margin rate to decrease slightly by approximately 100 basis points for fiscal 2023.\n\nQ3 is projected to decrease by approximately 1,210 basis points, and Q4 is projected to increase by approximately 735 basis points over the prior-year quarter. The Q3 decrease is related to the gross margin and incremental infrastructure investments discussed, which principally impact third quarter adjusted EBITDA margin rate. The increase in Q4 over the prior year is due to expected leverage operating expenses with the seasonally higher sales volumes and higher sales growth rate. So, in conclusion, we are pleased with our second quarter fiscal 2023 results that exceeded our expectations from a net sales and operating profit perspective.\n\nDespite the challenging macro environment, our team continued to execute against our growth strategies and operate the business with discipline. We are confident in our positioning for the second half of the year and we will continue to capitalize on the attractive opportunities we see for growth and market share gains. With that, we would now like to turn the call back to the operator who can open it up for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Thomas Forte with D.A. Davidson. Please proceed with your question.\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks. So one question, one follow-up, and I'll get back in the queue if time permitting. So first off Shawn, Mary, Donna, and Jack, congrats on an amazing quarter once again.\n\nAll right. So my first question is, you mentioned a few times in your prepared remarks, Shawn, what is Designed for Life mean to Lovesac? And why is it such a competitive differentiator?\n\nShawn Nelson -- Chief Executive Officer\n\nYeah. The Designed for Life is our design strategy. It's how we conceive of products and circle-to-consumers in a nutshell is how we conceive of services married to those products. And our focus is to develop long-term products, and long-term service program policies to develop long-term relationships with customers.\n\nSo it has become our entire business strategy. To put it bluntly and we see it as totally unique in the marketplace, because so much of consumerism in any category is driven by temporized products meant to disintegrate and compel us to buy new ones. And so, while we do believe we have some razor/razorblade aspects of this business that we're very excited to exploit the drives repeat business that drives loyalty. And you're seeing that unfold with Sactionals, Sactionals cover, Sactionals accessories, accouterments, etc., etc.\n\nWe will also utilize these philosophies to achieve the same kind of results in other adjacent categories throughout the home. We don't just throw ourselves into new categories rapidly because we try to do them and design them to this level, and that takes time. But the results are the kind of results that you've seen us now put up for years and years when you have dominant solutions. And so to us, it really is everything.\n\nAnd we're proud of the results and we're proud to represent that ethos, which, of course, the end -- the outcome as we see it is true sustainability.\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nAn excellent reason for my follow-up. Well, it seems hard to believe that you sell a product that's even better than your Sactionals, in my opinion, at least the StealthTech sound system, how much revenue could you generate from that product at maturity? And how does this gross margin compare against Sactionals and SACs?\n\nShawn Nelson -- Chief Executive Officer\n\nYeah. I think the easiest way to characterize that, because we have not broken outsells in StealthTech, as its own product line is to say broadly, look, in just the next few years, we will do hundreds of millions in sales in StealthTech, right? This is not just some little accessory, a little add-on to make Sactionals cute. StealthTech, from our point of view, is the best home theater system in the marketplace today, and I'm very proud of it. I live with it myself and I am blown away nightly by the experience I get to have on StealthTech embedded Sactionals, which, by the way, are my 15-year-old Sactionals pieces, but I've added StealthTech too, which is emblematic of our Designed for Life philosophy in action.\n\nAll right, we don't just make a new thing and then tell you, you should have waited and bought the newest thing, right? That is so unique in the way that we put things forward. And so StealthTech is our most recent invention, the most recent embodiment of a Designed for Life product. And it is so much fun if you haven't -- if you're following Lovesac and haven't experienced it. It's critical that you experience it because there and that's why we have showrooms, by the way.\n\nSo it really pays off our whole business model. This is a product that cannot be understood, certainly not on this call, certainly not even from the website on its face. You really have to experience it in person. So grateful to see it off and running.\n\nGrateful that we've had little to no warranty issues of anything, any meaningful kind. And it's we feel very proud of the launch and expect big things from it.\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nWonderful. I'll get back in the queue if time permitting for additional questions. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Brian Nagel with Oppenheimer & Company. Please proceed with your question.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi. Good morning. I too want to add my congrats for a nice quarter.\n\nShawn Nelson -- Chief Executive Officer\n\nGood morning. Thanks.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nSo, I've got a couple of questions and I apologize, I think they can both be a little shorter-term in nature. But first of all, Shawn, in your opening comments, you mentioned, I guess the commentary you made last quarter about maybe some softness at the low end and that that abating here a bit, so I was wondering if you can just add a little more color on there so we can understand better like that piece of your business, and the trajectory in the business? Then my second question, Donna, with regard to the frameworks you outlined for the balance of the year, especially with the Q3 piece, is what you -- the framework you outlined for Q3, is that consistent with what you're seeing now? There were, I guess it's almost halfway through the quarter. Thanks.\n\nShawn Nelson -- Chief Executive Officer\n\nYeah. Often a quarter will begin -- the timing of the quarter may begin with some kind of moment. Like for instance, in Q3 begins with Labor Day, and we get a quick read on Labor Day and that's all we have necessarily to shape the outlook for a quarter. Q2, similarly, in just from a few weeks, our read was soft, and we were transparent about that.\n\nAnd then as you can see from the results, it wasn't as soft as maybe we had feared it may become. So I don't -- I think, Mary, Mary, you may have, or Jack, you may have any other specific observations from the shape of the quarter, different promos within.\n\nMary Fox -- President and Chief Operating Officer\n\nYes.\n\nShawn Nelson -- Chief Executive Officer\n\nBut that's essentially what happened.\n\nMary Fox -- President and Chief Operating Officer\n\nYeah. Brian, just to add to Shawn's point, we had a really successful Father's Day through to July 4th. So that's obviously, what you see in the results, and obviously, gave us continued confidence in how much the brand is resonating and the success that we see going forward. So I think it's always the danger kind of giving too much detail within the next quarter, and week, and a month because there's just always so much that we're moving around, and programming, and being very agile.\n\nBut we were obviously very pleased with quarter two and feel very confident going into quarter three. Donna, can you share a bit about some of the shifts that actually came into quarter two, which means that even in quarter three, obviously, we've given you that framework? But we feel very good about the balance of the year and actually feel great strength, particularly around the StealthTech anniversary and all the excitement that Shawn talked about. Hopefully, it's the gift of the season and so forth. So we're in a great inventory position, a great position with the field, hiring, etc.\n\nWe are set to go and feel good for the rest of the year. Donna, I don't know if there's anything you want to add on quarter three to Brian.\n\nDonna Dellomo -- Chief Financial Officer\n\nYeah. So, I think, to what both Shawn and Mary had said, we have a very good line of sight, we believe, into how Q3 is going to shape up. And although it may look on the lower end at the guidance that I've provided for Q3 at a 15% rate, I think it's important to note Mary had just said too, we had a couple of things that we were able to pull forward, consciously pull forward into Q2. And if you take some of that into consideration, that $9.5 million between increased throughput and accelerating our Open Box transactions with Icon, you'd see that Q3 would be in line with what we're projecting for Q4, as well, closer to a 23% rate.\n\nBut as I -- we try to bake in as much conservatism on the other side as well because you just never know. But right now, we believe we have a pretty good line of sight into our Q3 performance.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nRight. I appreciate it. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Alex Fuhrman with Craig-Hallum Capital Group. Please proceed with your question.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nHey, guys. Thanks very much for taking my question and congratulations on another really strong quarter. I wanted to ask about the additional investments that you're making, and it sounds like that's the primary reason for the EBITDA margin outlook being a little bit lower for this year. Can you talk a little bit about how much these projects are going to cost and what the time frame is for them? I would imagine putting together a new distribution center is something that would likely go into next year, if not mostly next year.\n\nSo should we expect, and I know it's obviously -- you seem to be talking about numbers for next year,  but just in terms of the impact that these investments are going to have on next year, should we continue to expect, investment of some of your EBITDA margin in the first half of next year into these initiatives? And just wondering kind of what the timing of some of these investments will be.\n\nMary Fox -- President and Chief Operating Officer\n\nYeah. Great. Alex, thank you for the question. So, we're always focused obviously on to the horizon, the year, and then, kind of our forward view and our strategic plan.\n\nAnd during the summer, as we were reviewing with all of our leaders, it became very clear to us that based on our continued growth rates that we needed to accelerate the investments, obviously, that I had laid out. As you rightly said, for example, the additional DC, but also in terms of our talents and capabilities in critical infrastructure that really will help us to be able to drive the growth through FY '24 and beyond. So for us making bold moves that really believe sets us up for that continued growth is something that we all align upon. As you said, obviously, some of the costs really bear in this year when it's around the DC and frankly also the heavy lift as you work to build putting in systems in place, the processes that have to be done, there is more of a heavy lift there.\n\nAnd then, when we kind of come to think through on the FY '24 frameworks of a single factor that in. But for us, it is more of a heavier lift because of the investment this year, and in order for us to be set up. So we'll share more at the end of the year, but for us that we feel good based on taking that move now and the teams are excited because we really do need to give them that infrastructural support.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK, that's really helpful. Thank you. And then just a follow up on the new distribution center, obviously, you're taking your inventory up here and the business is growing very fast at the same time. Can you give us a sense of what you're your peak ability to handle inventory is now prior to this new distribution center? Is it something that you think you're going to be needing very quickly?\n\nMary Fox -- President and Chief Operating Officer\n\nYeah, I mean, we have the ability still to deliver [Inaudible] this year. Part of bringing in the new DC is actually to be able to serve customers in the South at a faster speed. And, as I shared with you before, we're so happy to see the fulfillment of customer satisfaction really jump up this year. So it's as much around geographic proximity to customers as well as the capacity that obviously I laid out before.\n\nSo we don't see any constraints for this year, but we certainly see that it's needed, as we go into next year, and now is the time for us to start to build in that capacity. And frankly, DC doesn't always come up so easily. So it was also important. It was perfect for us, great for the model.\n\nSo it was also about being able to lock that in. So a bit of both from that side, Alex.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nOK. That's really helpful. Thank you very much.\n\nMary Fox -- President and Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Matt Koranda with ROTH Capital. Please proceed with your question.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nHey, guys. Good morning. Just wanted to clarify that quarter-to-date trend that you guys had discussed earlier in the Q&A. I just want to put a finer point on it.\n\nAre we tracking quarter-to-date up 15% in line with the Q3 guidance? And just curious if you could maybe comment on how the consumer responded to the Labor Day sale and how you're factoring in the broader promotional environment in the industry into the Q3 and Q4 outlook.\n\nMary Fox -- President and Chief Operating Officer\n\nHey, Matt, thank you for the question. So, yeah, quarter-to-date including Labor Day, we feel really good about the framework Donna shared, and feel strong around our performance. We continue to grow and are well ahead of the category taking market share. So as we saw through quarter two, there are always ebbs and flows throughout, but we feel really good as to where we stand right now.\n\nAnd it's almost that, we always also manage our frameworks with conservatism baked in because -- while we're full throttle on driving growth, there are obviously the macro dynamics that we all read and see all the time. And while we continue to grow, we have the best performance in the category and actually, we're seeding a widening gap in our performance to the category that's just strengthening more and more. So we feel good. And even if you think of just quarter two, the three-year geometric stacked up 215% this just is continuing to build from that side.\n\nSo nothing other than confidence through quarter three and into quarter four and the rest of the year.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Great. And then just on StealthTech, I wanted to see if we could get a little bit more detail on product adoption there. Any quantifiable metrics you can share around attach rates to Sactionals? And I'm curious, maybe on Shawn's front, how is this helping with marketing efficiency? Because some of our checks seem to indicate word-of-mouth on Sactionals is a pretty big driver of store traffic, and just want to see how that threads into sort of the marketing efficiency that you're saying.\n\nShawn Nelson -- Chief Executive Officer\n\nYeah. We have not broken out StealthTech and talked about attachment rates. Well, broadly, I'll just say, that they're on target. They're moving according to plan, given that it's been in-market for less than a year and it's a huge leap from being seen, not anymore just in the beanbag company and not even as a couch company, but as a home electronics company, and home electronics brand with our brand on the side of these home electronics products, it's a huge brand leap for us.\n\nIt's going to take years to come to maturity. The good news is it's off and running and making it and making a meaningful impact on the performance of our marketing. I think the clearest example is any TV commercial, which is a massive portion of our advertising spend that shows StealthTech with Sactionals. So I think we've spent over 40 million already to date roughly on StealthTech-related commercials.\n\nI mean, this is something we are materially behind and thankfully, we're seeing material success with it. In terms of word-of-mouth, no doubt about it. I mean, this is a product that is quite remarkable, and I think that's probably the most misunderstood and mis -- underappreciated aspect of Lovesac. Why are we winning? Why is word-of-mouth so strong for us? Why are our marketing ROIs so high quarter after quarter for years now? Because the product is remarkable, in a landscape where most products, there are good brands out there, there are beautiful designs, but they're not remarkable.\n\nThey don't cause people to talk about it to remark. And that's what's beautiful about StealthTech. And so it absolutely is buoying up and improving our marketing ROIs, or word-of-mouth at a time when, of course, Sactionals were just coming into their own and finally becoming part of the mainstream, we hope, and being adopted at a broad rate. And so, yeah, StealthTech has a long, long runway to come to maturity.\n\nWe believe it is a big business mind for us. We think of home audio as a category we're competing in. This is, again, not just icing on the cake for Sactionals. And by the way, we'll leverage the StealthTech sub-brand in other categories as we eventually expand the brand that way.\n\nSo, sorry to not give more color, but given that it's a new category, and we step into the granularization of our public data very carefully and thoughtfully, that is our approach thus far. I don't know if Mary --\n\nJack Krause -- Chief Strategy Officer\n\nYeah. One thing to add to that, John, is I think with our work with -- it's amazing to get that kind of word-of-mouth. But if you think about the funnel, a lot of that drives the top of the funnel, and also makes the middle and bottom of the funnel easier to convert. And I think, as you see what Mary discussed in the marketing team is doing is a lot of hyperlocal targeting.\n\nThat's the power of word-of-mouth in our advertising, helping the top of the funnel, and enabling us to get really closer in and create higher conversion rates, which is what we're seeing. And we're super the thing we're also seeing is our own ability to drive our own traffic outside of what we would call these classic holidays. So we're seeing the signs, we're more of a word-of-mouth-driven destination brand. And we have a lot of control of our future and we feel great about it.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nExcellent, guys. I appreciate all the detail. I'll jump back in the queue.\n\nOperator\n\nThank you. Our next question comes from the line of Maria Ripps with Canaccord Genuity. Please proceed with your question.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGreat. Thanks so much for taking my questions. Just following up on the last question and sort of strong referrals driving incremental demand for you. Can you just maybe talk about how you're thinking about balancing that with marketing investments in the environment of broadly softening consumer demand, which is the backdrop of you gaining a share?\n\nMary Fox -- President and Chief Operating Officer\n\nYeah. Hey, Maria, it's Mary. Thank you. Yeah, I mean, obviously, our great success as you talk about with strong referrals, word-of-mouth, and so forth, is just back to what Shawn's been talking around, just people love our product.\n\nEveryone we talk about, it's not just that they like it. It's functional, they really love our product. So I think as we look at everything we're doing around marketing, whether it be investing in TV, or as Jack said, much more kind of local type of targeted programs. All of it is really just continuing to strengthen the funnel from the top to the bottom.\n\nAs we look at the latest brand health update, we're just seeing conversions higher than ever, especially from consideration through to purchase. And those are alliances stronger. And it's all just a key strength for us around the brand stickiness and that just more and more people know us and that we put a showroom in their local area as well, you get that kind of double down in terms of just people starting to talk about us, coming in and trying us. And frankly, StealthTech has created an amazing dynamic in the showrooms that really brings it beyond just thinking about coming in for furniture.\n\nIt creates whole family moments and a lot of excitement. So, we will continue to be very agile, and adjusting. I think, I talked a bit about testing and learning in marketing around social media and so forth. We'll just continue to do that, the team does a great job in that they're always adjusting real-time in terms of where they're seeing the ROIs.\n\nAnd, we have a very disciplined approach to every dollar we spend, and so more to continue to build on as that brand stickiness continues to increase.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGot it. Thanks, Mary. And then secondly, on StealthTech, can you maybe talk about if you've seen more traction and conversion with StealthTech in your Best Buy -- sorry shop-in-shop locations to other customer touchpoints?\n\nMary Fox -- President and Chief Operating Officer\n\nYeah, that's a great question. Thank you. Yes, I think part of obviously, our excitement for our Best Buy partnership is the strength of StealthTech. And we're seeing double the rate of attachment in Best Buy's shop-in-shops, and that continues to build and accelerate.\n\nSo for us, that's a lot of where consumers go to look for home audio. So we all they're front and center. And as I said to you in the last quarter, for next year and beyond, we will continue to expand our partnership with Best Buy and play a very strong role in the home audio market with what we see as the number one product for every family in America to be able to have access to.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGot it. That's very helpful. Thank you so much.\n\nMary Fox -- President and Chief Operating Officer\n\nThank you.\n\nOperator\n\nThank you. Ladies, and gentlemen, that concludes our time allowed for questions. I'll turn the floor back to Mr. Nelson for any final comments.\n\nShawn Nelson -- Chief Executive Officer\n\nYes, thank you to all of the Lovesac family and all of our associates, partners, and investors who continue to support the company, we appreciate it. Look forward to speaking with you next time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRachel Schacter -- Investor Relations\n\nShawn Nelson -- Chief Executive Officer\n\nMary Fox -- President and Chief Operating Officer\n\nDonna Dellomo -- Chief Financial Officer\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nJack Krause -- Chief Strategy Officer\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nMore LOVE analysis\n\nAll earnings call transcripts"
}