{
  "companyName": "ViaSat",
  "companyTicker": "VSAT",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/viasat-vsat-q1-2023-earnings-call-transcript/",
  "content": "ViaSat (VSAT -0.35%)\nQ1 2023 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to Viasat's fiscal year 2023 first quarter earnings conference call. Your host for today's call is Mark Dankberg, chairman and CEO. You may proceed, Mr. Dankberg.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nThanks for joining us today. We released our shareholder letter shortly after the market closed today, and it's available on our website. We'll be referring to it on the call. Joining me on the call today are Rick Baldridge, who's our vice chairman now; Kevin Harkenrider, our chief operating officer; Shawn Duffy, our chief financial officer; Robert Blair, our general counsel; Paul Froelich, corporate development; and Peter Lopez, investor relations.\n\nSo I'll let Robert provide our safe harbor first.\n\nRobert Blair -- General Counsel\n\nThanks, Mark. As you know, this discussion will contain forward-looking statements. This is a reminder that factors could cause actual results to differ materially. Additional information concerning these factors is contained in our SEC filings, including our most recent reports on Form 10-K and Form 10-Q.\n\nCopies are available from the SEC or from our website. Back to you, Mark.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nOK. Thanks. Our results for the first quarter were consistent with the outlook that we described in our fiscal year 2022 fourth quarter year-end call in May. Several factors, including seasonality delays and certifying some of the new informational security products and some transient supply chain issues affected our sequential top line.\n\nSo an improved revenue mix across our service networks and lower R&D spend in the quarter heavily offset below revenue, as well as our growing ViaSat-3 ground infrastructure. Operating expenses that are in preparation for this falls launch. So collectively resulting in only a slight sequential decline in adjusted EBITDA. It's worth noting that consolidated service revenue and Satellite Services segment revenue both achieve new records in the quarter, partially offset by the impact of product revenue from some of the factors I had just described.\n\nWe expect our first quarter EBITDA to be the low point of the fiscal year with good sequential growth from here throughout fiscal year 2023, driven largely by scheduled in-flight connectivity installations into activations, significant government backlog and strong government systems orders in the first quarter and also so far in the second quarter. We are expecting that will grow our fleet of active in-flight aircraft by about 500 over the remainder of this fiscal year on both new and retrofit aircraft for both new and existing customers. ViaSat-3 programs making good progress as the first satellite enters final assembly and mechanical environmental testing, and the second payload is now Boeing for spacecraft integration. Launch an in-service scheduled targets for the first flight have been holding from last quarter.\n\nWe also wanted to add a little color on the point in the letter regarding the $62 million payment we collected just after the close of the first quarter from Acacia Communications. The payment is for Acacia's use of our intellectual property. That includes contractual and statutory interest. We had previously won a jury verdict, ordering Acacia to pay for its use of our technology, and had subsequently obtained verdict insurance at an economical premium so that we could be certain to other payments.\n\nAnd that was prior to ultimately also winning a public court decision that upheld that verdict. While we didn't expect to receive the payment quite as soon, it was factored into our outlook for the year. In addition, the funds will help offset the pre-launch year-over-year ground infrastructure expenses that leads up to the ViaSat-3 launch and support additional discretionary investments in the significant growth opportunities we are targeting in both the fixed and mobile business areas. So with that as a little bit of background, we'll open it up for questions.\n\nOperator\n\n[Operator instructions] We will now take the first question from the line of Landon Park with Morgan Stanley.\n\nLandon Park -- Morgan Stanley -- Analyst\n\nGreat. Thanks very much for taking the questions. Good afternoon, everyone.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nHi, Landon.\n\nLandon Park -- Morgan Stanley -- Analyst\n\nThanks. I'm wondering if we can start on the government side of the business. There's obviously been some press releases about our -- sorry, not press releases, news reports about potential strategic drop-ins for part of that business. I'm just wondering if you can update us on your views there in terms of willingness to part with portions of that business, and maybe also just provide some disclosure around what is the right way to think about the size of the major pieces of that business, and if there's any margin differentials within the different parts of that business? So I'll start with that and then I just have one follow-up.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nOK. So first to start with, we don't comment on speculation or rumors about what we may or may not do around the business. I can give you the answers to the other parts of your question that are around what the make up of the business is and the relative size. So there's roughly kind of three main compounds to it.\n\nOne is, Tactical Data Links, and that's primarily business around what's called Link-16. So that's been a long time and steadily growing part of the business. Think of it in the range of maybe a third of that business of the total government business. There's another piece which is information security based and cybersecurity based.\n\nThat's a little less than a third of the business. And then there's one more piece which is satellite oriented. And that includes both technology products that we sell and satellite services. The kind of the fastest growing part of the business has been satellite services business that has the most synergy with the rest of our satellite services business.\n\nThat kind of describes the [Inaudible].\n\nLandon Park -- Morgan Stanley -- Analyst\n\nAre there any margin differentials between the different portions of the business that you would highlight?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nNo. In general, the services businesses tend to have the highest margins, but the businesses as a whole, it's not enormously disparate in terms of the margin characteristics of those businesses.\n\nLandon Park -- Morgan Stanley -- Analyst\n\nOK. And I understand that you don't want to comment on press reports, but maybe can you just refresh us on your strategic view in terms of how you think about potential optionality for that business and your willingness to surface value, if you don't feel like -- I don't know if you think you're getting full credit for the value of that business today, but how are you thinking about that?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nWell, the main way we tend to think about all of our businesses is, is really in the way that they provide synergy with each other. We don't really like having just a collection of disparate businesses. And so far, that's paid off level for us. Clearly, of the defense business is the one that's probably got the greatest amount of synergy with the overall direction of the company.\n\nIt is the satellite part and the satellite services part. But the main thing in the -- I think that we've done well in order to grow, instead of as we have over a long period of time, is we've been pretty good at being able to determine the relative growth opportunities of our different areas. And then put the most emphasis on those with the greatest amount of growth. And that's -- I think if you want to think about how we think strategically and how that drives the tactics, that's probably the underlying -- the most fundamental underlying factor in the way we deal with our businesses.\n\nLandon Park -- Morgan Stanley -- Analyst\n\nAnd how would you say that the encryption portion of the business figures into the long-term strategic view that you have for the company as a whole?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nWell, just on the encryption part, what we've tended to think about is encryption as a overall component of cybersecurity. And there's a lot evolving in the cybersecurity space, in the cybersecurity segment. And what we believe is there's going to be more and more spillover on the cybersecurity side into commercial markets. And so that's an example of one of the areas where we're looking at synergies.\n\nI guess the way I put it is we wouldn't have the collection of businesses that we do if we didn't see synergy opportunities across them. The only thing I would say is that the degree of significance may vary over time and with circumstances, I think it will tend to respond to that and sometimes it's not so much that there's less opportunity in a given area sometimes there's just way more opportunity in other areas. I think those are the things that we've done a good job of managing and that's what we're constantly trying to assess, I would say.\n\nLandon Park -- Morgan Stanley -- Analyst\n\nOK. That's all very helpful, Mark. And just one last one for me, just switching gears to Inmarsat. I might have missed in the release, but can you give us your latest timeline in terms of closing expectations and just maybe how you're thinking about the EU review that was recently announced along with the other CMA and DOJ reviews that are ongoing?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nWell, so I think we've made pretty steady progress in a few of the milestones that we had before us based on the actions and activities that we need to do. We're entering into a period where now we need some responses from the government that they need to draw some conclusions or inferences from that. We have a little bit less control over that, but overall our target is still -- we haven't learned anything that would say that we should deviate from the target that we had. Basically, we still have to wait to, we will get more information over the next few months and so we're going to have to factor that in, but right now, we're still aiming kind of where we were probably.\n\nI think we're closing in on nine months. So it's probably going to be more biased toward the back end of that and it would be toward the front end.\n\nLandon Park -- Morgan Stanley -- Analyst\n\nDoes the prior, I guess, idea was to close by the end of the calendar, or is that still within the realm of possibilities?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nThat's a way to put it. It's within the realm. Yes, it's within the realm of possibility. Now it's hard for us to anticipate especially on the regulatory side how the responses will come back from the agencies given the information that we provided.\n\nSo we will get a lot more information over the next two or three months, and it's possible that we can still close by the end of the year. It's possible that'll extend out to the 18 months or it's conceivable to go beyond. We will learn a lot more over the next few weeks to a month or two.\n\nLandon Park -- Morgan Stanley -- Analyst\n\nAnd the EU review was that expected and anticipated or was there any surprise in that?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nYeah. It was expected because most of the activity that we have in the sectors, it covers both the EU and the UK, so that's not surprising.\n\nLandon Park -- Morgan Stanley -- Analyst\n\nGreat. Well, thanks very much for taking the questions.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nThank you, Landon.\n\nOperator\n\nYour next question comes from the line of Philip Cusick with J.P. Morgan Chase.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nPhil, you're on mute, if you were trying to talk. Maybe we should take a question from somebody else and come back to Phil.\n\nOperator\n\nThe next question comes from Chris Quilty with Quilty Analytics.\n\nChris Quilty -- Quilty Analytics -- Analyst\n\nThanks, Mark. I wanted to follow-up on the -- I think you said you expect to add about 500 aircraft into the -- your 500 incremental orders going into the year. How much visibility do you have into that number and does that include Southwest --\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nYeah. The 500 includes -- as I mentioned, it includes both new planes and retrofit for both new and existing customers. And that would include new [Inaudible] with Southwest in particular, we have new aircraft that will deliver equipment to every lines. So they'll take them as new.\n\nAnd we have -- I think that's a pretty reasonable target. There are factors that could drive it up or down from there. So that's kind of a pretty reasonable estimate.\n\nChris Quilty -- Quilty Analytics -- Analyst\n\nGot it. And given there's capacity shortages internationally and here in the U.S., it's a pretty saturated market in terms of airlines that have already picked solutions, though we're seeing some switching. When can you reasonably start to target more international airlines given the timing of your second satellite coming online?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nOK. So first of all, roughly ballpark, it's probably 30,000-ish aircraft, that's kind of a rough estimate of aircraft. So probably all in, we're in the 15% to 20% penetration of existing aircraft and that people think that's going to 40,000-ish aircraft kind of by the mid-to-late 30s. So we think there's still a lot of growth in the market as a whole.\n\nWe've been mostly -- most successful in the U.S. market and in some international traffic to and from the U.S. And that's where most of the installs are coming in this current fiscal year. We've done well on international in the places where we have coverage.\n\nAnd that's really been the main -- kind of the main factor in determining our success. And so recently we've announced more transatlantic international. So I think that airlines are looking at the deployment on ViaSat-3. They see the progress that they are making.\n\nAnd I think that's really kind of -- I think those kind of two factors. Factor one is, is getting the coverage on the international basis and the places where we've had international coverage, we've done well. The other one is that airlines tend to see good inside connectivity as a competitive -- it's a competitive differentiator. And so in the U.S., it's most prevalent that -- it's really been a bigger kind of factor.\n\nAnd I think that's kind of been a factor on the major long haul international airlines, intercontinental flights. I think there's still a lot of opportunity among more regional airlines and that'll become more and more factor as you see the penetration grow. I think those are the things that we've got our eye on as the overall penetration in the commercial impact market expands.\n\nChris Quilty -- Quilty Analytics -- Analyst\n\nAnd do you have, or will you have an antenna product for those regional aircraft?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nYeah. Short answer is yes. OK. I think that the airlines views of what the purpose is for outfitting regional aircraft is evolving.\n\nAs I see, having inside connectivity is sort of an integral product to their entire fleet and all their services, including on connecting flights and on these shorter flights. So I think that their view of what's needed is evolving and I think will be well equipped to deal with that. And there are -- I'd say we are seeing more interest in outfitting regional jets with and more expansive view of what that means too as well, like a view cutting off the regional jets kind of going forward is probably different to the way you might have looked at it two or three or four years ago.\n\nChris Quilty -- Quilty Analytics -- Analyst\n\nGreat. And if I can -- one final question. Last week, EchoStar talked about losing stubs directly to Starlink in part because of latency and they're introducing a hybrid cellular satellite solution to try to address that. And of course, we also had the acquisition announcement with Eutelsat and OneWeb, and again, in part of Eutelsat trying to get a latency solution, do you still feel that a GEO-only solution for consumer or IFC market is sufficient? Or are you seeing an increasing need to do something with --\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nSo I think our view hasn't really changed that much. And just to say that, I would say it's one of the unique things about satellite is we do think that there's a little bit of a trade off between bandwidth and speed on the one hand and latency on the other that we think that we can manufacture bandwidth really efficiently from GEO and aim it into places where there's demand and have the flexibility to move it around with that demand, especially mobility, but the farther out you go from the earth along with latency. And so there's this trade off where you just have to hit the right mix for each particular vertical market segment. And one of the things we've said is we think that hybrid solutions are a good way to deal with that trailer.\n\nAnd we can mix in lower latency options, whether those be satellite or terrestrial options, wired or wireless for terrestrial options to try to hit the sweet spot of each of those vertical markets in the geographic areas that we're trying to serve. So we've done work on that. Right now, we think is, especially with just the booming growth in streaming and a more and more video entertainment hours switching from broadcast to streaming. I think that's a lot of what we see is going on and satellite industry is kind of a big pivot to being able to support data.\n\nAnd some of that's going to be through high throughput -- or high capacity or high throughput. GEO satellite, there might be -- from the latency perspective on MEO or LEO. So what we've been really focused on is that bandwidth component. We think that streaming is really driving substantial growth and demand.\n\nThat's kind of 30%-ish year over year on a first subscriber basis. So we're really focused on being able to address that. We think that we'd like to be able to address low latency as kind of the next thing -- next most important thing behind that. Well, the other thing that we've been really interested in is hybrid solutions, including multi-orbit.\n\nWe've been working with several non- geosynchronous operators or prospective operators in order to be able to do that. We don't think that we necessarily need to own a non geosynchronous constellation in order to be able to do hybrid solutions -- hybrid multi-orbit solutions. I do think that just to elaborate a little bit more, there's some sense that well, only the geosynchronous operators are saying that multi-orbit makes sense, but the non-geosynchronous operators don't think that there's a need for GEO and all that that non-geosynchronous is just going to obsolete geosynchronous. And one of the things that's interesting about the OneWeb and Eutelsat deal is that you've got a non-geosynchronous operator saying multi-orbit is the right answer.\n\nAnd that's kind of not -- I mean, this might be the first, most explicit case of that, but you've also got SES that's investing in both NEO and GEO satellites. You've got Eutelsat that's a significant GEO operator, that's also doing both the orbit. So what we think is that it just as indicative that multi-orbit makes sense from either direction. And that's kind of how we see it as well.\n\nBut I think that the other point just that the OneWeb and Eutelsat sort of highlights is one of the things that we've been looking at when we try to do this is to get as much commonality in the network infrastructure as we can. And so for instance, in choosing to acquire Inmarsat, one of the good things is their broadband network is Ka-band, just like ours is. And especially in the mobility space where you've already got a need for tracking antennas, you can use phased array antennas as one of the things that we've been working on demonstrated there as well. It's a lot simpler to do them in the same operating bands, as opposed to doing it in two different bands.\n\nAnd so that's an example of one of the things that we're looking to do when we do hybrids between GEO and non-GEO is try to get some of those same cost efficiencies and the ability to work with the infrastructure from both sides in a simpler more unified way. Those are kind of the main things that we've been thinking. Things are still evolving in the space, but we still are interested in multi-orbit to the -- and again, I want to emphasize this to the extent that our customers are, and that delivers more value to them and to their users.\n\nChris Quilty -- Quilty Analytics -- Analyst\n\nGreat. Thanks for the detailed answer.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nWelcome.\n\nOperator\n\nYour next question comes from the line of Ric Prentiss with Raymond James.\n\nRic Prentiss -- Raymond James -- Analyst\n\nThanks. Good afternoon, everyone.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nHi, Ric.\n\nRic Prentiss -- Raymond James -- Analyst\n\nA couple questions. One, housekeeping one on the legal settlement. The $62 million, I assume that was a revenue. It sounded like you might have done some kind of payment to lock it in.\n\nWhat should we think the EBITDA effect of that legal settlement was?\n\nShawn Duffy -- Chief Financial Officer\n\nHey, Ric. This is Shawn. So yeah, you're right. A good amount of it is going to come in the revenue line, but we do have some costs that are going to offset that, some of the insurance costs and some legal costs.\n\nSo I would think of it as probably net around 50-ish, that should be EBITDA contributing.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nIn the second quarter.\n\nShawn Duffy -- Chief Financial Officer\n\nIn the second quarter. Yeah, second quarter.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nYeah.\n\nShawn Duffy -- Chief Financial Officer\n\nAnd a little bit would go into interest income as well.\n\nRic Prentiss -- Raymond James -- Analyst\n\nSure. OK. And then Mark, kind of strategic thinking. We saw that the FCC voted four-zero recently to have an effort on reviewing the Space Race.\n\nWhat do you think the FCCs looking to do and what would you like to see the outcome of that be? And then I have one final follow-up.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nI think that -- on the one hand, I think that the FCC is anticipating that -- the options of doing things in space are increasing. And I think that what they've said, and what would make sense is to try to get ahead of that, to try to think about what regulations that they may have that could turn out to inhibit that, or be bottleneck and then try to address those in the context of preserving access to space. And that's a good thing. I think that's wise.\n\nAnd what we're interested in some -- there's some elements of structures and space that are really interesting for the kinds of things that we do. So we think it's good to be considering that. I think that -- when you ask the -- what I would like to see, I think that a lot of the risk in space comes from very large numbers of relatively large spacecraft that represent a lot of math, a lot of cross sectional area. And that is really being dominated by these large mega constellations that are really communication oriented.\n\nAnd it's very difficult to see that you think about this notion that academics other researchers and quite a few organizations are, are orienting around, which is the notion of carrying capacity, which is how much stuff in space is sustainable, how much is too much, how do you measure that, but that's really likely to be driven by these mega constellations. And so what we'd like to see is that they don't look past the issue with the mega constellations to focus on something that's probably not likely to represent as much of a risk to congestion in the space environment as some of the issues that we're already dealing with.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. And one more follow-up on the government side. Help us understand on the Tactical Link 16 side. What kind of synergies are you looking at there? What kind of opportunities between your different business segments do the Tactical Link 16 kind of offer?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nSo one of the -- couple things that are going on that are -- one of the biggest sort of long-term themes in defense, communications and actually in sort of overall intelligence and battle management is different names for it. But one of the main names is, what we call, JADC2 or Joint All-Domain Command & Control, or communications. And what that is intended to do is to synthesize a number of disparate communications links and intelligence sources into a one sort of seamless comprehensible whole. And so when you think about that, there are definitely things that you can do with terrestrial networks, Link-16 being an important one for that in the way you combine that with space.\n\nSo that's one of the avenues that we've been looking at because we're familiar with the space and the terrestrial parts of that. I think we have quite a bit to contribute to that, and we've been pretty successful in participating in it. One of the other areas that got significant synergy opportunities is the notion of Link-16 from space. And we've been -- that's one of the areas that we've been pretty successful as well.\n\nAnd as well the notion we think of spaces of relay there's other applications for space relay that we've been successful with as well. So there's definitely synergy opportunities there. I think just to go back to what I said before in response to Landon's question, really the issue for us is just trying to assess all those different synergy opportunities, which ones have the greatest growth opportunities, where can we play, where can we be the most successful, and just make sure that we're focused on that, but there's definitely that's -- those are the two main threads, when it comes to the Tactical Data Links and kind of the satellite services, space services, mobility businesses that we're growing.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. And final one for me, and then sure, Phil wants to get back in. The space industry has been trying for a long time to consolidate. All of a sudden, we're seeing a bunch of ones proposed ViaSat, Inmarsat, Eutelsat, OneWeb, rumors of SES and Intelsat.\n\nWhat do you think the industry is looking at now that they're trying to solve for? And how do those differing potential permutations affect how you view your opportunity?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nOK. First, it's a good pictured question. The one thing that I want to point out when people talk about consolidation, a lot of times what they kind of mean is the growth is slowing and we want to take advantages of cost synergies. And what we see is -- think of it as like the age of satellite as a broadcast mechanism is sort of winding down.\n\nBut the age of satellite as a data transmission medium is really just getting started. That's kind of how we look at it. And so from our perspective, what we did is we took two companies, us and Inmarsat that were never really in broadcast business. We're really focused on data and we're trying to combine them in a way that creates more opportunities for growth.\n\nThat was really the thesis for what we're trying to do. I think that there's another theme, which is more among the large legacy operators, which is how did they move pivot from broadcast to data. And so a lot of the other combinations that are being -- that are either happening or being speculated on are really kind of around executing that, using maybe the broadcast business to charge up the data business. What we think is that the data business is so different from the broadcast business in almost every way.\n\nThe analogy that we always use is if you look at companies that were preeminent in using terrestrial broadcast frequencies, those companies are the ones that really been effective in the terrestrial data business, which is primarily the global cellular business. So we just think they're really, really different that we've got really good skills than that, we've got good growth. We think Inmarsat has a great customer base, good assets that we can leverage. That's kind of our thoughts on it.\n\nI think there's -- the theories behind some of the other combinations are a little bit different than that.\n\nRic Prentiss -- Raymond James -- Analyst\n\nThat really helps. Thanks, Mark.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nThanks, Ric.\n\nOperator\n\nYour next question comes from the line of Ryan Koontz with Needham & Company.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nThanks for the question. I wanted to ask your updated view of how we should think about the ViaSat-3 kind of revenue ramp here of next year. How long until you can fully monetize that capacity? What percentage is kind of spoken for today with your current business plans? And secondly, is there going to be any cannibalistic effect on your current business from a lower price, lower cost per bit platform? Thank you.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nOK. Yeah. So just to review kind of what we've done with both ViaSat-1 and ViaSat-2, and we think things will play out fairly similarly on ViaSat-3. It was one and two, we really grew predominantly at the beginning on the residential base because that was the one that we could address the fastest.\n\nAnd a lot of times what you've seen is if new operators trying to get into the data space, it also tried to scale around the residential space. Then what we did with one and two is we really started growing the mobility business around that and some of the government business. So now coming to ViaSat-3, the mobility businesses for us have more scale than they did when we did one and two. So we can scale those by expanding them a little bit by using our existing business as a platform for that, by providing more services to some of our existing customers, by making some of the services that we'll do for existing customers as we talked about before, when it comes to competitive differentiation in areas being able to do streaming videos is a really attractive feature for invite communications.\n\nSo that I think we will get more contribution early on from the mobility businesses with ViaSat-3 than we did with one or two. But we also see big opportunities in the fixed and residential business as well. And just going to the point that you talk about sort of like deterioration kind of the way -- the way we framed this, we didn't put it in this current letter, but do better in past shareholder presentations. Kind of our main focus has been the productivity of bandwidth.\n\nSo if we can get a lot more bandwidth for the same amount of capital investment, what our strategy has been to share that with our customers. So what we can do is we can give existing customers more bandwidth for roughly the same amount of money, or we may come up with different price tiers, but the theme will be more bandwidth value per dollar. But as long as our productivity improvements are greater than what we shared with our customers, then it's like, we both pass it from that. So that's the theme and it's that increased bandwidth value that's what's enabled us to grow our customer base each time we launch a new satellite with better economics.\n\nAnd so we see the same things here. The other thing that we've been able to do pretty consistently, and we see that happening here as well is kind of aim to have the satellite, so you can say it's full, that we've sold all the bandwidth within like two to three years. But then what we tend to do is we follow-up by constantly evolving that user base toward more and more economically valuable applications, right, which helps to drive our margins and our revenue. And that's what we've done each time.\n\nSo rather than -- one thing you can imagine as well, if I just sold a whole bunch of it for the life of the satellite at the beginning, maybe I'd be getting rid of risk, but on the other hand, my opportunity to sort of groom that base and identify the applications and the customers that placed the most value on it, or to use it in new markets where we can apply additional products and services to increase the value, that's what's really enabled us to grow the revenue and the margins on the existing satellites for the last 10 or 11 years that we've been doing this. And we see the same things happening this time.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nThat's helpful. That makes a lot of sense. And it sounds like a lot of the terminals you've shipped at least for some of the recent past is upgradeable to support ViaSat-3.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nYeah. Given that we've known what the architecture is, that's what we've been aiming to do. There are -- but basically each time what we've been able to do is we've been able to make the existing -- the existing terminal set can be used on the new satellites, but the new terminal sets have additional features or capabilities that make them more useful or economical. And a lot of that comes -- one of the things I think is a little bit underappreciated in this is, is what we're doing is we're mixing many different types of service level agreements and value propositions on the satellite.\n\nAnd in order to do that efficiently, you need to be able to, we call, schedule it, like, how do I fit together all these disparate types of services on an -- on these satellites, so that we get very, very high efficiency of use. One great example would be if you're in the airline mobility space and you have a hub airport with connecting flight from one airline or a bunch of different airlines, several times a day, you have enormous demand at that airport for maybe an hour or so. And then in between that, the demand is very, very lower. So what you really want to do is you don't want to take all that other band without a service just because you're waiting for that next wave of use.\n\nSo the idea there is how do you schedule your bandwidth resources to get high efficiency? And those peak to average demands, especially in the mobility space can be a factor of 10 easily between high peak areas and low peak areas. So what we tend to do is we build into the network and the latest generation of terminals, more and more capabilities of that schedule really, really efficient. And those are some of the things that drive our ability to increase margins and revenues even after we've filled up the satellite.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nThat's really helpful, Mark. Thank you, Mark.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nThanks, Ryan.\n\nOperator\n\nYour next question comes from the line of Mike Crawford from B. Riley.\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nThank you. Just to go back to the Acacia. Does that mean that Cisco -- now Acacia has a downstream license or do their customers like momentum that use their DSP -- did you hear the first part of my question?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nI think so.\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nSo Acacia has downstream customers like momentum that uses DSP. Do they need a license or is that incorporated in this agreement?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nSo just to be clear, Mike, there's no agreement. This was the result of a verdict, so they paid a judgment. And so those damages are for their use of our technology under an agreement that they did not pay us under. So they were ordered to pay us for the use of the technology through 2018.\n\nThat's what that verdict is related to. So a license would've been provided under that agreement. Had they paid? They didn't. They were ordered to pay.\n\nSo that's what the verdict covers. Does that answer your question?\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nWell, partially. So that's what I was getting at. So now you're paid up to 2018, but there's another four years under past the bridge plus others using that DSP. So is there an expectation you might be able to get some more out of this or is this issue settled in your opinion?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nYeah. So we have two pending lawsuits against Acacia. They were stayed pending the outcome of the appeal. They are still staying and will be probably restarted in the next month or so.\n\nOne of them relates to the same technology that was issued -- that was at issue in the first case from the period after the end of 2018 to the present and the other one relates to additional technology. So those cases are still pending and I'm not going to speculate on or comment on pending litigation and what might happen with those. But those things will be restarted here probably within -- certainly in this current quarter, hopefully within the next month or so.\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nExcellent. Great. That's kind of what I thought. And then just switching gears, with the Cluster failure on this Anik F2 satellite that powers some of your Northwest U.S.\n\nresidential subscribers. I understand that satellite is going to move to an inclined orbit and rather end sooner than expected end of life. So what's the risk to your U.S. subscribers on that satellite, there's going to be avoidance service, particularly since we don't appear to have an official launch date or window for ViaSat-3.\n\nAlthough, you do say that you hope to have that launched by the end of December.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nYeah. I mean, Anik F2 has been a good satellite for us for longer than it's expected life. But just to put things in perspective, it's well under 1% of our satellite capacity so that we've been able to constantly make improvements. We've been -- we constantly make improvements on the existing satellites that sort of make up for the variance in bandwidth, but in the cases of individual customers who have terminals that aimed in that satellite, what we'll do is.\n\nWe'll provide an upgrade path for those customers if we need to move them to a different satellite.\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nOK. Was my understanding, like, say my father in Picabo, Idaho, that was the only satellite that he could hit from Viasat.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nNo, no, that's not. No, WildBlue as an example. WildBlue overlaps Anik F2 and we may have other resources as well too that Viasat-2 provide. Yes, the whole coverage too.\n\nThanks.\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nOK. And then final question is you talked about these robust tactical data link orders in this quarter. Does that include Charles Wave waveforms?\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nNo. So Charles Wave it's a different waveform than Link 16 is, and it's got a different application, different use. It's more for personal communications than machine-to-machine. There are some machine-to-machine parts of it, but it's a different application.\n\nIt didn't lump it in with the Link 16.\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nRight. And given that that's super high margin revenue, I think mostly royalty revenue for you -- you need to characterize what's going on with Charles Wave right now.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nOK. Yeah. So Charles Wave just to recap, it's a subsidiary, we own a little more than half that subsidiary. One of their biggest businesses is they developed a waveform under -- the government wanted a library -- a license waveform and their waveform was one of the most popular in that library.\n\nSo a fair amount of their revenue is licensed revenue for either modules or products that use that waveform. And that revenue stream would continue on for quite a few years. I think we're relatively early in the process of deploying the radios that use that waveform. And there are multiple companies building radio products that use the Charles Wave waveform.\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nOK. Thank you, Mark.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nThanks, Mike.\n\nRick Baldridge -- Vice Chairman -- Analyst\n\nMike, I just wanted to clarify real quick. I think I might have misspoke on when I mentioned the Acacia case. I said different technology. I think it's the same technology, different Acacia products that are issued.\n\nSo I just wanted to clarify that.\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nOK. Thanks, Robert. I think that's all the questions that we have for today. So just to summarize, we believe this is the low point in terms of quarterly financial performance and we expect solid sequential organic growth throughout the rest of the year.\n\nWe've got good revenue, visibility and high communications. Really good government system toward and we expect that those transient bottlenecks that really were more of a factor in the fourth quarter and the first quarter will be resolved and overall support our year over year and longer term guidance. We're expecting the ViaSat-3 Americas launch should be coming up very shortly after our next earnings call, and we're making good progress on the Inmarsat integration. We think those are both really great catalyst for continued strong growth.\n\nSo for all the rest of our team, thanks for joining us this afternoon. And please don't hesitate to contact Peter Lopez or anybody in our team, if you've got other questions on our results or other topics that we discussed today. So with that, I will hand it back to the operator.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Dankberg -- Chairman and Chief Executive Officer\n\nRobert Blair -- General Counsel\n\nLandon Park -- Morgan Stanley -- Analyst\n\nChris Quilty -- Quilty Analytics -- Analyst\n\nRic Prentiss -- Raymond James -- Analyst\n\nShawn Duffy -- Chief Financial Officer\n\nRyan Koontz -- Needham and Company -- Analyst\n\nMike Crawford -- B. Riley Securities -- Analyst\n\nRick Baldridge -- Vice Chairman -- Analyst\n\nMore VSAT analysis\n\nAll earnings call transcripts"
}