{
  "companyName": "Keysight Technologies",
  "companyTicker": "KEYS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/keysight-technologies-keys-q3-2022-earnings-call-t/",
  "content": "Keysight Technologies (KEYS -0.66%)\nQ3 2022 Earnings Call\nAug 17, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Keysight's Technologies fiscal third quarter 2022 earnings conference call. My name is Amber, and I will be your lead operator today. [Operator instructions] Please note that this call is being recorded today, Wednesday, August 17, 2022 at 1:30 p.m. Pacific Time.\n\nI would now like to hand the conference over to Mr. Jason Kary, vice president, treasurer and investor relations. Please go ahead, Mr. Kary.\n\nJason Kary -- Vice President, Treasurer, and Investor Relations\n\nThank you, and welcome, everyone, to Keysight's third quarter earnings conference call for fiscal year 2022. Joining me are Keysight's president and CEO, Satish Dhanasekaran; and our CFO, Neil Dougherty. In the Q&A session, we will be joined by senior vice president of global sales, Mark Wallace. You can find the press release and information to supplement today's discussion on our website at investor.keysight.com under the Financial Information tab and quarterly reports.\n\nToday's comments by Satish and Neil will refer to non-GAAP financial measures. We will also make reference to core growth which excludes the impact of currency movements and acquisitions or divestitures completed within the last 12 months. The most directly comparable GAAP financial metrics and reconciliations are on our website, and all comparisons are on a year-over-year basis, unless otherwise noted. We will make forward-looking statements about the financial performance of the company on today's call.\n\nThese statements are subject to risks and uncertainties and are only valid as of today. We assume no obligation to update them. Please review our recent SEC filings for a more complete picture of our risks and other factors. Lastly, management is scheduled to participate in upcoming investor conferences hosted by Jefferies, Deutsche Bank, Citi and Goldman Sachs.\n\nWe hope to see many of you there. And now I will turn the call over to Satish.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nThank you, Jason. Good afternoon, everyone. Thank you for joining us today. Keysight Technologies delivered another exceptional quarter with both revenue and EPS, our earnings per share exceeding the high end of our guidance.\n\nOur outperformance reflects the effectiveness of our strategy, outstanding execution by our teams around the world, and the strength of our operating model. Keysight's deep customer engagements with industry leaders and high-value differentiated solutions continue to drive broad-based demand across key technology megatrends. I will focus my comments today on three key headlines. First, outstanding execution by the Keysight teams around the world, resulted in an all-time record revenue and earnings per share as we saw some supply constraints ease as the quarter progressed.\n\nSecond, we saw strong order growth and sustained demand across all end markets and regions. Third, we're once again raising our full year outlook. We now expect to achieve revenue growth approaching 9% and earnings-per-share growth of approximately 20% for the full fiscal year. Let's now take a deeper look at our results for the quarter.\n\nThird quarter orders grew 12% to $1.46 billion and outpaced record revenue, which grew 10% to $1.38 billion. Record EPS of $2.01, grew 31%. Orders and revenue growth in both business segments and across all regions is evidence of our ability to deliver value for customers as we manage macro and supply dynamics. Software revenue achieved an all-time high, outpacing total Keysight revenue growth, expanding our recurring revenue profile to further strengthen the durability of our business.\n\nOur software-centric solution strategy is a key differentiator in rapidly evolving design, systems emulation and modeling environments. We recently introduced PathWave Advanced Design System 2023 to address growing complexity in ultra-high frequency designs. We also announced that Keysight's Open RAN solutions are moving to cloud-based deployment to support our customers' needs as networks evolve to more software-enabled virtualized architectures. Turning to our business segments.\n\nThe Communications Solutions Group delivered all-time record revenue and record third quarter orders. Commercial Communications achieved record revenue with growth across all industry segments and regions. Innovation dynamics across the Communications ecosystem remains strong, driving demand Keysight's comprehensive end-to-end portfolio for both the wireless and wireline ecosystems. In wireless, 5G continues to represent an innovation-rich environment for the industry.\n\nOur differentiated software-centric solutions enable customers to address the growing complexity of use cases, frequency band combinations, real-world connectivity and mobility challenges. We continue to evolve our 5G platform to meet the requirements of emerging applications and newer versions of the standards. In collaboration with, Intel, Radisys, Vodafone and Wind River, we recently showcased an industry-first demonstration, deploying Keysight's O-RAN and solutions to help reduce power consumption in a multi-vendor Open RAN network. AI-LINK, a provider of industrial IoT offerings, used Keysight solutions for end-to-end performance validation of cloud-native radio access network infrastructure.\n\nIn wireline, we continue to see strong demand for 400 gig, 800 gig and photonics applications. We recently collaborated with Nokia to demonstrate the first public 800-gig interoperability test, validating the robustness of ultra-high data rates in telco networks and data center environments for the expected increase in AI, ML network workloads. Record Q3 orders in aerospace, defense and government outpaced revenue, which grew 1% on a core basis versus a strong growth quarter last year. Budget appropriations began to flow as reflected in prime contractor spending in the U.S., while 5G investments continued to grow to address new use cases such as RADAR and 5G coexistence.\n\nWe also saw strong strength in satellite and space, including new applications for nonterrestrial networks. Over the next several years, we expect this market will benefit from elevated investments in technology modernization. The Electronic Industrial Solutions Group delivered double-digit order and revenue growth for the eighth consecutive quarter, with momentum from continued investments in next-generation technologies across automotive, industrial IoT and semiconductor end markets. In automotive, we are pleased with the continued broad adoption of our solutions portfolio, with the business nearly doubling over the past two years.\n\nOrders grew strong double digits for the sixth consecutive quarter, and we delivered all-time record revenue. Keysight's contributions to the advancement of EV and AV technologies, which include vehicle intelligence, connectivity, power and security are fueling momentum with leading car manufacturers, and helped us secure wins with giga factories around the world. Keysight's award-winning Radar Scene Emulator is the only solution on the market to imitate realistic roadway scenarios in a lab environment, and was chosen by a leading U.S. auto manufacturer for testing and validation of autonomous drive systems.\n\nThis quarter, we completed another tuck-in acquisition in the automotive space, further adding to our software technology and technical staff focused on vehicle-to-everything communications. We continue to invest as we target evolving opportunities in the future of transportation. In general electronics, we achieved double-digit order growth and all-time record revenue as investments continued in digital health, IoT and advanced research. In educational research, Keysight is partnering with global leaders such as Nanyang Technological University in Singapore to advance 6G technology.\n\nTogether with Sauce Labs, our Eggplant business delivered artificial intelligence-driven testing of enterprise applications. The acceleration in our general electronics business reflects the broad scope of our portfolio of leading technology solutions. Record orders for our semiconductor solutions resulted in ninth consecutive quarter of double-digit order growth driven by capacity expansion of mature foundries to address pent-up demand in the market and investments in advanced processes. Keysight's PathWave design solutions expands our collaboration with major foundries beyond parametric wafer test into emerging applications like silicon photonics and next-generation design and simulation applications.\n\nWhile we continue to successfully execute our strategy, we recognize the near-term macroeconomic uncertainties. Keysight's sustained performance over time is evidence of the resilience and durability of our business. Our resilience is an outcome of enduring partnerships with market-leading customers with early engagement to develop software-centric solutions that enable them to solve their most critical development challenges and achieve their first-to-market goals. Durability is a product of our flexible operating model designed to quickly respond to variations in demand while investing in critical long-term priorities.\n\nThese strengths give us confidence that we can navigate uncertainties, and continue to deliver superior results going forward. Of course, all of this is made possible by our talented people. steadfast execution by our teams, especially in a challenging environment is proof that our Keysight leadership model delivers results, empowering our inclusive and diverse culture which fosters collaboration, high performance and innovation. We recently released our first diversity, equity and inclusion report as we renewed and strengthened Keysight's long-standing commitment to DE&I and to being a great place to work for our global workforce of more than 14,000.\n\nWith that, I'll turn the call over to Neil to discuss our financial performance and outlook.\n\nNeil Dougherty -- Chief Financial Officer\n\nThank you, Satish, and hello, everyone. We delivered strong third quarter results, successfully navigating ongoing supply chain and other headwinds. Third quarter 2022 revenue of $1.376 billion was $26 million above the high end of our guidance range, and grew 10% or 13% on a core basis. We generated $1.461 billion in orders, up 12% or 14% on a core basis, and we ended the quarter with $2.5 billion in backlog.\n\nTurning to our operational results for Q3, we reported gross margin of 65%, holding steady in the face of significant inflation and currency headwinds. Operating expenses were $480 million, resulting in an operating margin of 30%. We used a number of strategies to effectively navigate supply chain challenges, including product redesign, alternate sourcing and increased supplier and customer engagement. We achieved net income of $363 million and delivered $2.01 in earnings per share, which was $0.21 above the high end of our guidance.\n\nOur weighted average share count for the quarter was 181 million shares. Despite significant currency headwinds on the top line, we saw negligible FX impact to earnings due to the meaningful natural hedge provided by our global footprint that has been supplemented by our financial hedging program. Moving to the performance of our segments. Our Communications Solutions Group generated record revenue of $970 million, up 11% or 13% on a core basis.\n\nCSG delivered gross margin of 67% and record operating margin of 30%. Within CSG, commercial communications generated record revenue of $694 million, up 17% or 19% on a core basis, driven by 5G, O-RAN, 400 gigabit, 800 gigabit and high-speed digital applications. Aerospace and defense and government revenue of $276 million was down 2% and up 1% on a core basis. Our backlog for this end market remains strong, and we continue to expect increasing defense budgets in the U.S., Europe and Japan to provide support for higher spending going forward.\n\nThe Electronic Industrial Solutions Group generated third quarter revenue of $406 million, up 10% or 13% on a core basis, driven by strong revenue growth across all end markets and regions. EISG reported gross margin of 61% and operating margin of 31%. Moving to the balance sheet and cash flow. We ended the third quarter with $1.8 billion in cash and cash equivalents, generated cash flow from operations of $224 million and free cash flow of $192 million or 14% of revenue.\n\nShare repurchases this quarter totaled 1.6 million shares at an average price per share of $139.46 for a total consideration of $228 million. Year to date, we have repurchased approximately 4.6 million shares for a total consideration of $723 million. Now turning to our outlook and guidance. Demand remains strong for Keysight solutions.\n\nOur funnel is near historic high levels, and we exit the quarter with a record backlog. We now expect full year revenue growth to approach 9% or 11% on a core basis with EPS in the range of $7.43 and to $7.49, representing growth of 20% at the midpoint. Fourth quarter 2022 revenue is expected to be in the range of $1.38 billion to $1.4 billion, with earnings per share in the range of $1.94 to $2, based on a weighted diluted share count of approximately 180 million shares. In closing, Keysight's resilient business, consistent execution and flexible cost structure give us confidence in our ability to capitalize on the long-term secular growth trends and deliver above-market profitable growth in 2023 and beyond.\n\nWith that, I will now turn it back to Jason for the Q&A.\n\nJason Kary -- Vice President, Treasurer, and Investor Relations\n\nThanks, Satish and Neil, for your comments. Amber, would you please give the instructions for the Q&A?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Jim Suva with Citi. Jim, your line is now open.\n\nJim Suva -- Citi -- Analyst\n\nThank you, and congratulations to you and your entire team and company. Automotive traditionally hasn't been a big focus area for Keysight. You provided a little bit of commentary on it, but it appears that the car of the future and all the cars that are rolling out have a much bigger need for -- whether it be EV, battery calibration, sensors positioning. How much is automotive for you? What has kind of been growing? And importantly, is there like long-term visibility? Are you in that -- in the production side of things also, or just only in the R&D traditionally, I think about you more as R&D, but it seems like you're kind of a little bit more into production or long life on automotive? But if you could pontificate on automotive sector, a little bit, that would be great.\n\nThank you.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nYeah, sure, Jim. As you noted, this is one of the new expansion opportunities that we're incredibly excited about, and we're continuing to build momentum. And as you saw emerging from the pandemic, this big acceleration into EV and AV has just gotten started. And from a manufacturing perspective, yes, we have some exposure to it, but it is this proliferation of electronics content that's causing automakers to ramp up production as supply becomes lesser and lesser of an issue over time.\n\nSo it's all about testing their EV capabilities in the manufacturing environment. So we have some exposure to that. We're very excited by this big trend we see that's going to play out over the next 10 years where auto makers are going to increasingly invest in organic R&D capabilities needed to differentiate their platform over others. And that involves software and hardware, and it's a great fit for the broad array of tools that we offer to every electrical engineer in the planet that we're now selling into the automakers.\n\nBut equally, the growing emphasis we have put on -- growing our footprint in EV. As an example, this quarter, we had some design wins with some giga factories that are coming up just getting started in the Radar Scene Emulator solution, which really allows you to take a car, turn on all the sensors and really see how we behave in the real world, very unique solution offering. And we had a design win with a major North American car manufacturer. So just getting started, very excited about the opportunity and strong double-digit growth in orders this quarter.\n\nJim Suva -- Citi -- Analyst\n\nThank you so much for the details and clarifications, and congratulations.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nThank you, Jim.\n\nOperator\n\nThank you. Our next question comes from Matthew Niknam with Deutsche Bank. Matthew, your line is now open.\n\nNick Heisler -- Deutsche Bank -- Analyst\n\nHey, guys. This is Nick on for Matt. Congrats on the quarter. Just a quick question and a follow-up.\n\nFirst, on supply chain. I'm just curious if you could give us an update in terms of what you're seeing on the ground right now and maybe how that compares to like a quarter ago or a year ago? And then just as a follow-up, how are you thinking about your long-term targets at this point? I mean looking at order growth and revenue growth, you're clearly surpassing that. So maybe like when we could expect updates on those.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nMaybe I'll get started, Neil might want to add some comments here. I'll say on the supply chain front, I did reference that we're very pleased with the execution. It's been now three or four quarters since we put the program in place to build out our capabilities to second source, extend our partnerships with suppliers more tighter and ongoingly engaged with our customers on lead time reduction activities. So those have progressed very nicely.\n\nAnd as the quarter progressed, we saw some of the constraints get better as the quarter progressed, which resulted in the upside that we were able to generate in revenue, and delivered a very strong record revenue this quarter. I would say, on the macro supply situation, it still remains challenging. It is a tale of two worlds. On one hand, you have improved visibility and improved supply for general-purpose electronics parts, but high-precision electronics, analog components still appear to have constraints associated with them.\n\nBut nevertheless, we are very pleased with our execution, and we're also confident about our guide, which is why we have actually taken up the guide for Q4, and also for the full year to be now 9%. So that's with regard to the supply situation. With regard to your second question on the long-term guide on targets. Yes, I mean, we're also very pleased with the progression -- ongoing progression that we see quarter after quarter toward those long-term targets we set, both for growth and profitability.\n\nAnd that was goals that we set for 2023. We're obviously executing very well toward those. And as we go into the fall, we'll be having our three-year strategic plan, and we look forward to updating you on any revised targets right after.\n\nNick Heisler -- Deutsche Bank -- Analyst\n\nPerfect. Thank you and congrats again.\n\nOperator\n\nThank you. Our next question comes from Meta Marshall with Morgan Stanley. Meta, your line is now open.\n\nUnknown speaker\n\nHi, team. This is Dave on for Meta. Congrats on the quarter. You mentioned strength within the commercial communications group.\n\nAnd I was just wondering if there are certain categories within that group that are driving the growth. With some of the delays the ecosystem is seeing on O-RAN, are there areas where customers are asking you to be of greater assistance?\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nYeah. I think our commercial communications portfolio is a diversified one that services both the wireless and wireline ecosystems, saw broad strength across both this quarter -- and again, continued strength for the last few years driven by 5G on the wireless side and a number of technology evolutions like 400 gig, 800 gig on the wireline side. I'll just hand it off to Mark to make some comments on the details for this particular quarter.\n\nMark Wallace -- Senior Vice President, Global Sales\n\nSure. Thanks, Satish. As Satish said, Dave, the 5G rollout and demand continues to be very strong. And our bias toward R&D solutions is an area of [inaudible] investment for all of our customers.\n\nWe saw double-digit demand and order growth across all regions. One of the drivers is the adoption and upgrades around Release 16. We're seeing that across the board. We're seeing adoption now with some of the certification business in the test labs.\n\nWe added more than 90 new 5G customers again during Q3. We're seeing continued growth of O-RAN where we've been expanding our opportunities from device manufacturers to operators to test labs and etc. So wireless side, the demand remains strong and broad. And as Satish said, on the wireline side and the data center side, we continue to see strong investments in the quarter for 400G manufacturing plus continued even ramping investments around 800 gig R&D and -- on both the physical layer and the protocol space.\n\nSo robust demand. Our differentiation for many, many years, continues to expand our ability to contribute to these customers around the world.\n\nUnknown speaker\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from Chris Snyder with UBS. Chris, your line is now open.\n\nChris Snyder -- UBS -- Analyst\n\nThank you. I have a question on the backlog, which is obviously running well above historical or even normalized levels. Is it fair to assume that pricing in the backlog is above the pricing that has been realized in revenues over the last couple of quarters? And what does that mean for forward price cost?\n\nNeil Dougherty -- Chief Financial Officer\n\nYeah. It is -- I mean it is true that we have been undergoing a series of price increases as we attempt to kind of keep place with the inflation that we're seeing on the cost side of the equation. And it is also true, as we've talked about in the past that it can take time for those price increases to actually be realized within revenue given the backlog, given the funnel, given the outstanding quotes that exist within the marketplace. And so it is certainly true that we have price increases that are built into our backlog.\n\nI think the second, beg your question is a little bit harder to answer because we don't know exactly what is forthcoming on the inflation side, right? Whether that continues, whether it starts to wane, but we do expect to start to realize additional benefits from price increases that have already been enacted.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nAnd we're very pleased with the 65% gross margin performance of the business in the backdrop of inflationary environment that Neil referenced.\n\nChris Snyder -- UBS -- Analyst\n\nThank you for that. I think on the last earnings call, you guys said that the guidance assumed further backlog build in 2H. Obviously, we got a little bit more backlog built here in the fiscal third quarter. I guess, is the assumption that we'll be further backlog build in Q4? I'm just asking because it sounds like from the prepared remarks that some of the supply constraints have been easing.\n\nNeil Dougherty -- Chief Financial Officer\n\nYeah. Yes, that is fair to say. I mean if you look at the look at the order number that we put up last year, $14.91 in Q4 of last year, we are expecting orders to continue to grow. We have a strong funnel here entering the quarter.\n\nAnd so by definition, that implies additional backlog build in the quarter.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nAnd the demand environment continues to remain strong, and across our end markets and across all regions. So we continue to build a backlog, but it's a high-quality backlog where we have touch points with customers and -- who have real needs. And so we'll be working really hard to get that converted to revenue as we look into the next six months.\n\nChris Snyder -- UBS -- Analyst\n\nIf I could just squeeze -- just a follow-up with that, Satish, very quickly. Is there anything specific that is just driving the outsized strength in the demand backdrop? I'm just asking what should we be looking for or waiting for to kind of try to determine when demand is going to normalize back to the mid-single digit or even kind of high single-digit growth level?\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nYeah. We're quite pleased with the portfolio, the differentiation, the focus on the R&D customer. The areas that we're investing to build solutions for, continue to remain a high priority for our customers. But we're also cognizant of the macro environment and the evolving macro, and watching for it.\n\nAs an example, one of the areas we look for is in our industrial business, which is linked to PMI. But that business had a very strong quarter yet again. But Mark may be able to make some forward-looking comments on the funnel.\n\nMark Wallace -- Senior Vice President, Global Sales\n\nYeah. Well, Chris, we've said that it's been broad-based, and it certainly has -- you saw the growth come across all the end markets across all the regions. Our top customers, top 20 were up double-digit. We added more than 400 new customers in total during the quarter.\n\nOur indirect business and the channel was strong. So that shows the reach that we're getting into new customers. And as Neil mentioned, our six-month funnel is at or near an all-time high. We're watching it very carefully.\n\nSome customers are being a bit more cautious in their spend, but it's not reflected in our numbers, and it's not reflected in what we're seeing is overall demand going forward.\n\nChris Snyder -- UBS -- Analyst\n\nThank you, guys. Congrats on another great quarter.\n\nOperator\n\nThank you. Our next question comes from Mehdi Hosseini with SFG. Mehdi, your line is now open.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nYes. Thanks for taking my question. This is for the entire team. Keysight has been known for having exposure to both R&D budgets, as well as commercial deployment.\n\nWould it make sense to change that thought process, and actually qualitatively or quantitatively talk about secular demand drivers like satellite communication, millimeter wave, infrastructure investment, electric vehicle and so forth? So this way, we could better understand the underlying demand drivers. Any thoughts would be appreciated. And I have a follow-up.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nYeah. Thank you, Mehdi. I think the way we think about our business is we look at the new emerging technologies where customers are looking to innovate, and not just for a year or two, but they're looking at a multiyear road map. That's our focus, solving their more complex challenges, such as the ones you described in space and satellite, in commercial communications with both on the wireless and wireline side with evolving needs for capacity, which drives millimeter wave consumption, EV and AV, all of these are innovation-rich areas.\n\nWe're making a unique contribution to enable our customers' time to market. That's the focus for us, and we'll look to provide more insight as we move forward on these areas. Thanks for the input.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nYeah. I think we all understand how Keysight is differentiated and how well you have executed, especially with all the supply chain disruption over the past two years. And as much as Neil has been talking about the normalization of a backlog, it continues to grow, which reflects your core strength. I guess we're all trying to figure out what's the company's earning power and sustainability of that earning, $8 going to $10 and then to $12.\n\nI think the thought process of the past that 5G would pick is off the table. And I guess I'm trying to find a better way to highlight the opportunities, as well as quantifying the earning power.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nYeah. No, I think you're spot on, right? You look at the backlog build, $2.5 billion roughly as we exit this quarter and then we have a whole quarter in front of us to exit the fiscal year. So we fully expect that the backlog will continue to grow, which gives us increased stability. And as the supply situation improves, that just converts into earnings power for the company.\n\nThe other area that I'm very pleased with is the gross margin performance of the business in the backdrop of these inflationary pressures we're seeing, which, over time, as we have thought about the value we bring and continue to innovate with software and services we have more upside to continue to grow that margin profile over time. And so we're not done at 65%, which should give us further room for growth. And then when we look at the next-generation innovation drivers that we're engaged with our customers right now, we feel pretty confident about extending that runway of growth as well.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nGot it. Thank you and congrats.\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nThank you, Mehdi.\n\nOperator\n\nThank you. Our next question comes from Mark Delaney with Goldman Sachs. Mark, your line is now open.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nYes. Good afternoon, and thanks very much for taking the question. I was hoping to better understand what you're seeing from customers in the semiconductor end markets in the near term. I think some semiconductor companies have been seeing some cyclical weakness and perhaps cutting back on capex plans.\n\nAre you seeing anything related to that in your business? And to put that over the intermediate to longer term, you've had the CHIPS Act signed. And I'm curious, are you seeing any improved long-term outlook for your business going into the semiconductor end market that you would attribute to the CHIPS Act.\n\nMark Wallace -- Senior Vice President, Global Sales\n\nSure. Mark, this is Mark. I'll answer that. So our business in semi remains very strong, robust demand, record orders in [inaudible].\n\nAnd what we're seeing -- and we've said this before is we're seeing continued investments in two areas, right? One is in the advanced processes and the other is in the mature technologies, and both remained strong during the quarter. The other exciting part is we're starting to see the investments in the United States in new fabs. We started to -- we captured the first initial spend. You saw earlier this month, or maybe this last week, the U.S.\n\nCongress just passed the CHIPS package that's all in front of us. That expansion is going to help additional business, fuel additional growth, to boost manufacturing in the U.S. And our R&D investments, it's not just capacity expansion. We are also participating in parametric test, as well as R&D test in these advanced processes from EUV to five-nanometer, three-nanometer.\n\nSo while some end market demand has slowed, there is still supply chain constraints in the semiconductor market. And the longer-term secular growth drivers are still strong driven by end markets like high-performance computing, automotive, we talked about and new mobility and silicon photonics where we have a leadership position feeding into high-speed data centers and so forth is an area we're very excited about as well.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Adam Thalhimer with Thompson Davis. Adam, your line is now open.\n\nAdam Thalhimer -- Thompson Davis and Company -- Analyst\n\nHey, good afternoon, guys. Congrats on your first $2-plus EPS quarter. Just one on satellite and space. On satellite and space, how does that opportunity compare to some of the larger revenue buckets today, such as 5G and auto?\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nYeah. I think it's an area where historically, we were in the component test of the satellite ecosystem. That has been an area of strength for us. and where we are highly differentiated and some of the unique metrology components do get into for -- to calibrate some of the more complex measurements in that space.\n\nWhat we're seeing now as we look forward is new applications like non-terrestrial networks with the advent of 5G, and this proliferation of different satellite form factors and communication with ground stations, right? So we're getting into emulating the whole environment so that we're designing better for the crowded satellite and space environment that's ensuing. But we're very pleased with the uptick we're seeing in the business for the entire portfolio because the number of customers that are in this industry also is expanding beyond the few big ones we used to have in the past. So pleased with the growth in the business. It will continue to be a driver for our aerospace and defense business moving forward.\n\nAdam Thalhimer -- Thompson Davis and Company -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Our next question comes from Rob Mason with Baird. Rob, your line is now open.\n\nRob Mason -- Robert W. Baird and Company -- Analyst\n\nYes, good evening. Thanks for taking the question. I wanted to see if you could give us an update around your PathWave rollout and just where you think you are in that process? When you introduced PathWave, it was going to be a multiyear effort to roll in your legacy applications, you're introducing new applications under the PathWave umbrella as well. How should we think about where you are at least on the legacy side in terms of converting those over? You talked about software outgrowing the overall company average as well.\n\nAnd just how to PathWave play into that?\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nYeah. I think if you look at the PathWave effort that we've put in place for a few years now, it's really focused around building the organizational capabilities needed because the future of our industry is going to be software-centric. And so we've built capabilities, such as cloud that has enabled us to launch the O-RAN solution where we're now able to test virtualized network infrastructure. And the only way you do it is you have to have your assets on the cloud, and that's a critical component of how we deliver value through PathWave.\n\nThe PathWave design franchise that we've had continues to grow. We've been able to convert majority of the customer base into recurring subscription-based contracts, and we're moving that franchise from just being able to simulate circuits to simulate circuits in complex environments. And that's a new area of emphasis that will continue to grow. And on our base instruments, it still remains a focus for us to add more capabilities, connect them to the cloud so that we make our customers more productive in their labs, and that's the focus for us moving forward.\n\nBottom line is we are at 20% of our mix, roughly software. And the focus for us is to continue to grow that, and we'll continue to invest in more software capabilities to do it. Mark, I don't know if you had any other -- thank you.\n\nRob Mason -- Robert W. Baird and Company -- Analyst\n\nIf I could ask one follow-up, just unrelated around the aerospace and defense government business, the orders continue to be pretty strong there. But how do you see the ability to get, I guess, convert more of those orders to revenue here over the next quarter or two? Or is it still more of a supply chain issue now that the budgets are -- flowing budget showing up in orders? Or are you getting the ability to ship?\n\nNeil Dougherty -- Chief Financial Officer\n\nYeah. I mean it's -- the conversion of orders to revenue is definitely a supply chain issue. I mean, as we indicated in our prepared remarks, we are starting to see the flow-through of the budget was appropriated in late spring. And so we're optimistic as we look forward into Q4, and even into Q1 that that's going to continue to drive growth.\n\nWe're also seeing increased defense budgets in Europe and Japan, which is also additive. But as you start to think about converting that over, we are still very much supply constrained across the portfolio. And while we've seen some improvement in certain aspects of the supply chain within the quarter, we're still in that constrained environment. So yeah.\n\nMark Wallace -- Senior Vice President, Global Sales\n\nAnd Rob, this is Mark. I'll just add that the previous [inaudible] in is another driver of growth, which is the intersection of many different segments or technology. We're talking about nonterrestrial network. We're talking about 5G deployment within aerospace defense.\n\nAnd then on top of that, you have the continuing long-term investment in defense modernization with funding beginning to flow from the U.S. government Department of Defense, and then Western Europe coming on very strong. So there's a number of growth drivers on the front end, and that will continue for us moving forward.\n\nRob Mason -- Robert W. Baird and Company -- Analyst\n\nUnderstand. Thank you.\n\nOperator\n\nThank you. Our next question comes from David Ridley-Lane with Bank of America. David, your line is now open.\n\nDavid Ridley-Lane -- Bank of America Merrill Lynch -- Analyst\n\nThank you for taking my question. The U.S. CHIPS Act also included about $1.5 billion dedicated to O-RAN, and there was sort of similar funding in the U.K. government as well.\n\nSo I just wanted to check in, any indication sort of the level of orders to date for Keysight in the O-RAN space? How meaningful is that? And what do you think the impact of this kind of public funding that's going to start flowing there will be?\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nYeah. I think in the broader context, you look at the -- what's really changed significantly since the beginning of the year is the geopolitical environment, and it is going to drive more up in government investments for organic research across the globe. And for us, when we talked about drivers for the 5G business, we said near term, it's about the deployments. Medium term, it's about the millimeter wave and higher speed capabilities.\n\nAnd longer term, it is about these new applications that are going to come online. And I think O-RAN has been one of those. We started to invest in that early. We're engaged in the O-RAN ecosystem.\n\nIn fact, we had the -- we hosted the O-RAN consortium in our facility in Santa Rosa in this quarter to continue to drive the standardization around this nascent ecosystem. So it's an emerging opportunity, very exciting. Again, the -- some of the strengths of the company with software continue to play into it. Now with regard to immediate impact of public funding, your direct question, it's really hard for us to assess that but it's definitely favorable as we think about where we invest and how we monetize.\n\nDavid Ridley-Lane -- Bank of America Merrill Lynch -- Analyst\n\nThank you. And then a quick follow-up here. You cited gross margin performance a couple of times. Just to help us think about pricing.\n\nShould we think about historical Keysight pricing kind of in a low single-digit range, and that you've moved up into a mid-single-digit range. Is that kind of the order of magnitude around pricing? Thank you.\n\nNeil Dougherty -- Chief Financial Officer\n\nYeah. I mean I think when we think about pricing in the -- let's start over the longer term kind of outside of this recent inflationary environment, our goal is always to capture the value that we're bringing into the marketplace. So we have -- and regularly assess our prices relative to the competition and the value that we're bringing into the marketplace and adjust them accordingly. I think in this inflationary environment, there has become a little bit of a cost element as -- not just our suppliers but our competitors and people across the broad ecosystem have been increasing prices in response to that inflation environment.\n\nSo I think you are correct in assuming that our pricing increases have moved northward over the course of, say, the last 12 to 18 months in response to that inflationary environment.\n\nDavid Ridley-Lane -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. There are currently no further questions in queue. [Operator instructions] There are no further questions in queue, so that concludes our question-and-answer session for today. I would like to turn the conference back over to Jason Kary for any closing comments.\n\nJason Kary -- Vice President, Treasurer, and Investor Relations\n\nThank you, Amber, and thank you, everyone, for joining us today. We appreciate the opportunity to provide you with an update and look forward to speaking with many of you later this quarter. So thank you, and that's all for today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJason Kary -- Vice President, Treasurer, and Investor Relations\n\nSatish Dhanasekaran -- President and Chief Executive Officer\n\nNeil Dougherty -- Chief Financial Officer\n\nJim Suva -- Citi -- Analyst\n\nNick Heisler -- Deutsche Bank -- Analyst\n\nUnknown speaker\n\nMark Wallace -- Senior Vice President, Global Sales\n\nChris Snyder -- UBS -- Analyst\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nAdam Thalhimer -- Thompson Davis and Company -- Analyst\n\nRob Mason -- Robert W. Baird and Company -- Analyst\n\nDavid Ridley-Lane -- Bank of America Merrill Lynch -- Analyst\n\nMore KEYS analysis\n\nAll earnings call transcripts"
}