{
  "companyName": "GoodRx Holdings, Inc.",
  "companyTicker": "GDRX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/goodrx-holdings-inc-gdrx-q2-2022-earnings-call-tra/",
  "content": "GoodRx Holdings, Inc. (GDRX -1.48%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the GoodRx second quarter 2022 earnings call. As a reminder, today's conference call is being recorded. I would now like to introduce your host for today's call, Whitney Notaro, vice president of investor relations. Ms.\n\nNotaro, you may begin.\n\nWhitney Notaro -- Vice President, Investor Relations\n\nThank you, operator. Good afternoon, everyone, and welcome to GoodRx's earnings conference call for the second quarter of 2022. Joining me today are Doug Hirsch and Trevor Bezdek, our co-founders and co-chief executive officer; and Karsten Voermann, our chief financial officer. Before we begin, I'd like to remind everyone that this call will contain forward-looking statements.\n\nAll statements made on this call that do not relate to matters of historical fact should be considered forward-looking statements, including statements regarding management's plans, strategies, goals and objectives, our market opportunity, our anticipated financial performance, the impact of the grocer issue on our business and the expected impact of COVID-19 on our business. These statements are neither promises nor guarantees, but involve known and unknown risks, uncertainties and other important factors. These factors may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Factors discussed in the risk factors section of our annual report on Form 10-K for the year ended December 31, 2021, as updated by our quarterly report on Form 10-Q for the quarter ended June 30, 2022, and our other filings with the Securities and Exchange Commission could cause actual results to differ materially from those indicated by the forward-looking statements made on this call.\n\nAny such forward-looking statements represent management's estimates as of the date of this call, and we disclaim any obligation to update these statements, even if subsequent events cause our views to change. In addition, we may also reference certain non-GAAP metrics, which are reconciled to the nearest GAAP metric in the company's shareholder letter, which can be found on the overview page of our investor relations website at investors.goodrx.com. I'd also like to remind everyone that a replay of this call will become available there shortly as well. With that, I'll turn it over to Doug.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nGood afternoon and thank you for joining us. Today, we would like to share our perspective on our recent performance and actions we're taking to strengthen the business as we navigate the headwinds we're facing. We are disappointed with our performance this year, and I suspect you feel the same way. We anticipated both higher growth and stronger margins and that we would be helping more Americans get the healthcare they need at a price they can afford.\n\nOn our fourth quarter earnings call, we reset expectations because our historical cohorts from the COVID period contributed less than we expected, then our prescription transactions offering was impacted by the grocer issue we discussed on our first quarter earnings call. We did not expect to be in this position. I can say that Trevor and I, as both founders and significant GoodRx shareholders, have no higher priority than getting GoodRx back on track. Over the past several months, we have significantly strengthened our leadership team and embarked on a top to bottom review of our business, our products and our relationships with key partners to ensure that we are prepared for the future.\n\nWe will also be doubling down in our engagement efforts with consumers, medical professionals and other constituents that make up our business. We have amazingly devoted users and close relationships with America's healthcare professionals. As we previously shared, our NPS with both consumers and providers is a remarkable 90. We are the best-known brand in our space with significant scale.\n\nWe consistently have great cash conversion and high cash flow from operations. And we've proven our team's ability to enter adjacent markets, as exemplified by the trajectory of our Pharma Manufacturer Solutions offering. We want you to know that we, as an executive team, are fully focused on returning to the level of performance you've seen from us in the past. Finally, I want to highlight that grocery issue we discussed on our first quarter earnings call was very recently addressed.\n\nAs communication is rolled out to the grocery chains pharmacists, we expect GoodRx discounts to be consistently welcomed at the point of sale. While we recognize that our year-to-date performance has been below expectations, we're aggressively working to reverse that reality and evaluating every aspect of our business. We're taking actions to better prioritize spending and investments with a focus on enhancing both growth and margin, and we're confident in our ability to execute. I'll now turn the call over to Trevor to speak about our results and plans in more detail.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you, Doug. As Doug said, we're disappointed by our year-to-date performance, and we're committed to driving toward higher growth and margin in the future. The second quarter was particularly disappointing due to the impact of the grocery issue we discussed, which was in line with the expected $30 million revenue hit we estimated on our first quarter earnings call. Despite that headwind, our revenue and to a greater extent, our adjusted EBITDA, came in ahead of our expectations for the quarter, as prescription transactions revenue, subscriptions revenue and Pharma Manufacturer Solutions revenue each performed slightly better than we anticipated.\n\nPrescription transaction revenue decreased 7% year over year due to the grocery issue. We exited the second quarter seeing approximately 20% of the weekly volume we processed through this grocer before the issue beginning of March and has seen subsequent continued declines post quarter end. We were effective at redirecting new users during effective period of the retailers. New user numbers in the second quarter were close to prior period levels.\n\nAs Doug mentioned, the grocer issue has been addressed. We have worked collaboratively with the grocer over the last few months to address the situation in a way that allows GoodRx and the grocer to jointly serve consumers in a way that helps consumers and also satisfy the grocer's needs. We are pleased that our consumers can once again enjoy the prescription access and affordability benefits of GoodRx at the grocer who we value as a partner. Karsten will provide more detail on the second quarter revenue impact and the expected third quarter revenue impact shortly.\n\nDuring the second quarter, we also took actions to strengthen our prescription transactions offering and minimize the potential for disruptions going forward. In addition to ongoing conversations with PBMs we work with as well as the grocer discussed, we also proactively engaged with many retail pharmacies to ensure broader marketplace stability. We've been meeting with the pharmacies that represent the vast majority of our volume. Each pharmacy has unique challenges in the current macro environment, and we are working proactively to collaborate on solutions to drive our mutual success and profitability.\n\nWe strongly believe that our pharmacy network remains stable. And during the period, the grocer issue ratio occurred volume and other retailers grew substantially. In fact, with the exception of this particular grocer, volume across other pharmacies increased more than 3% quarter over quarter. As mentioned, our new user counts in the second quarter, driven by strong user growth in many of the grocers competitors as consumers chose to fill out other pharmacies with attractive GoodRx prices, largely offset the needs or decreased the grocer.\n\nWhile we were able to effectively move new users, returning users were down significantly due to the grocer issue and drove the decrease in prescription transaction revenue. As mentioned on our last earnings call, returning users often go directly to the grocer without checking prices on GoodRx given how reliable our savings have historically been. This behavior resulted in a decrease in overall volume of transactions from returning users and, of course, returning user counts. In addition to the actions we've taken to ensure marketplace network stability, we are also prioritizing new product enhancements.\n\nWhen we founded GoodRx, we recognized that building trust with consumers was key. So we created a user experience that was as frictionless and simple to use as possible. Consumers could access the GoodRx platform and find significant savings without creating account. Today, we are focused on developing new services and incentives for users to register with GoodRx, so that we can increase our touch points and play a more active role in all aspects of their care.\n\nThis will add friction to the acquisition and price search funnel and will most likely negatively impact conversion macro to revenue, which Karsten will speak to in guidance. However, we believe the benefits of deeper relationships with our consumers will allow us to help them better navigate their healthcare journey with even more compelling GoodRx value proposition and user experience. We also believe that allowing users to provide us more information will increase the LTV of each user in prescription transactions and other areas of the business over time as we leverage it to create new tools and products for our users in quarters and years to come. The diversification of our revenue continued in the second quarter with our other offerings now making up 30% of revenue compared to approximately 5% just three years ago, primarily driven by their rapid growth.\n\nSubscription revenue grew 82% year over year as the response from our Gold subscriber base to the increase in monthly subscription fees was largely in line with our expectations. The momentum in our pharma manufacturer solutions offering continued during the quarter with revenue more than doubling year over year as we continued to increase penetration and deliver high ROIs to the manufacturers and brands we work with. Our distinct ability to reach both consumers and providers continues to be recognized by manufacturers as evidenced by the strong growth. We expect continued year-over-year growth as more pharma ad spend shift to digital and pharma manufacturers continue to recognize attractive returns on their marketing spend as they leverage our broad provider and consumer audiences.\n\nOur second quarter acquisition of vitaCare, a pharmacy services platform that gives us valuable capabilities to facilitate the brand location prescription process from start to finish, adds yet another innovative product and enhances our pharma focus capabilities. We believe vitaCare increases our strength and differentiation, particularly as it relates to the access element of the medication awareness, access and adherence spectrum, which is a key focus for manufacturers to drive medication volume and revenue. We recently announced a strategic initiative with Mayne Pharma to deliver an enhanced direct-to-consumer campaign to build awareness of NEXTSTELLIS, their novel contraceptive and expand access to birth control. By combining our extensive reach across consumers and healthcare providers with Mayne Pharma's novel contraceptive, this campaign aims to bring broader awareness and access to this branded contraceptive and other available birth control options.\n\nWe'll also build awareness among healthcare providers. This exciting relationship with Mayne Pharma demonstrates the tremendous value we can deliver as a scaled platform where both patients and HCPs engage with us at the same stage of the patient's healthcare journey. Even with the rapid growth of our pharma manufacturer solutions offering, our revenue has penetrated less than 1% of the $30 billion pharma manufacturer solutions TAM. We expect growth to be driven by more relationships with more pharma manufacturers, more penetration of their brands and increasing the number of solutions each brand deploys us.\n\nWe are also adding more solutions to our consumer and provider offering and continuing to sell into the HCP opportunity with GoodRx providers. GoodRx providers create a more customized experience and equips providers with the tools they need to support their patients throughout their healthcare journey. With over 825,000 prescribers using GoodRx since June of 2021 and more than 300,000 HCPs, who have opted into the GoodRx provider mode so far, we believe there is an enormous opportunity for us to meet providers' unique needs with innovative solutions while helping them achieve better patient outcomes. With our incredible offering rate to our GoodRx providers' platform, we believe we are in the path to becoming one of the largest provider platforms in the US.\n\nWith the combination of GoodRx providers and our consumer offerings, we have the opportunity to deliver a truly unparalleled digital healthcare platform that enables us, our partners, physicians and manufacturers to educate and serve providers and patients in a coordinated fashion. Before I close, I'd also like to talk about margins and cost structure. We've historically combined high growth and high profitability at GoodRx. We are committed to increasing both growth rate and margins from today's levels.\n\nWe're taking a hard look at all of our costs and expenses and reprioritizing where and how much we spend across the business and all of our offerings. This is one of the principal focuses of Raj Beri, our recently hired COO, and we have begun to take actions to improve our cost structure and will continue to do so into the fourth quarter. Despite the grocer issue, we delivered revenue growth, margins and strong operating cash flow in the second quarter. This was fueled by the continued commitment of our team and a collective dedication to our mission.\n\nWith the current macroeconomic environment and the pressure it's putting on consumers to make deliberate choices by how to prioritize their spending, we recognize that helping Americans get the healthcare they need at a price they can afford has never been more relevant. The opportunity for GoodRx clear and we intend to capture it. With that, I'll turn it over to Karsten, to discuss our financial results and guidance.\n\nKarsten Voermann -- Chief Financial Officer\n\nThank you, Trevor. Revenue for the quarter grew 9% year over year to $191.8 million, exceeding the guidance we provided in May. Prescription transactions revenue decreased 7% year over year to $134.4 million due to the grocer issue we disclosed in the prior quarter and which Trevor discussed earlier. The estimated impact of the issue on our prescription transactions revenue in the second quarter was largely in line with the $30 million we estimated on our last earnings call and drove a decrease in both MACs, which decreased 3% year over year to $5.8 million and PTR per MAC, which decreased 4% as consumers at the grocer have historically had more transactions per month with a slightly higher fee per transaction.\n\nI'll discuss the expected future impact of the grocer issue in more detail in the guidance section, but in the meantime, I want to point out that we estimate the issue had a mid-teens percentage impact on our revenue growth. Market-wise, when you look at trends in prescriptions in the U.S., the second quarter is back to pre-COVID levels on most prescription metrics like total generic volume, new prescriptions and new therapy starts, which is a positive development we anticipated and baked into our guidance. Turning to subscriptions, subscriptions revenue continued to grow rapidly, up 82% year over year to $26 million. We ended the quarter with over 1.1 million subscription planned and 1.6 million members benefiting from our subscription offerings since our family subscriptions generally serve multiple consumers.\n\nThe increase in subscription revenue was driven primarily by the one-time increase in monthly subscription fees we charge for GoodRx Gold program and also an 8% year-over-year increase in subscription planned. As a reminder, in the first quarter of 2022, we increased fees for new Gold subscribers for the first time in our history from $5.99 and $9.99 per individual and family to $9.99 and $19.99, respectively. And in the second quarter, we increased fees to our existing Gold subscriber base as well, which catalyzed the largely price-driven revenue increase. Subscription plans were down modestly quarter-over-quarter as expected and as we discussed during our fourth quarter earnings call, when we set expectations for a one-time higher-than-usual churn level in the second quarter due to the onetime increase in monthly fees.\n\nOverall, we are pleased with the response of our subscriber base to the increase in Gold subscription fees, which was in line with our expectations. Pharma Manufacturer Solutions revenue grew 102% year over year to $26.6 million as we continue to work with more pharma manufacturers and offer more solutions and deliver superior ROI to those with which we work. This is the first quarter that includes revenue related to vitaCare, which contributed approximately $1 million. Other revenue grew 13% year over year to $4.9 million, driven by the growth in GoodRx Care.\n\nMoving down the P&L. Cost of revenue was $18 million or 9.4% of revenue compared to $11.1 million and 6.3% of revenue in 2Q 2021. The increase in cost of revenue as a percentage of revenue was driven by the grocer issue described earlier, which materially impacted our prescription transactions revenue as well as the acquisition of vitaCare, which has a higher cost of revenue due to the operational nature of its business. Product development and technology expenses were $35.4 million compared to $29.6 million in the comparable period last year.\n\nThis increase was primarily due to continued investments in the team and product. Excluding stock-based compensation expense and other items, adjusted product development technology expense was 13% of revenue compared to 11.3% of revenue in 2Q 2021. The grocer issue described earlier contributed to the increase in adjusted product development and technology expense as a percentage of revenue. Adjusted product development and technology expenses were modestly lower quarter over quarter, due primarily to a higher capitalization rate of certain qualified costs related to the development of internal use software.\n\nSales and marketing expenses were $94.3 million compared to $88.4 million in 2Q 2021 as we continue to invest and our incredible team with the goal of increasing our consumer and pharma manufacturer base and building the GoodRx brand. This was partially offset by lower advertising and promotional spend, which decreased $4.8 million year over year. Excluding stock-based compensation expense and other items, adjusted sales and marketing expense was largely flat quarter over quarter in absolute dollars and decreased year over year as a percentage of revenue making up 45.3% of our revenue in 2Q 2022, compared to 46.7% last year. General and administrative expenses were $34.7 million compared to $39.6 million in 2Q 2021.\n\nThe decrease was due primarily to stock-based compensation expense relating to the non-recurring co-CEO award made in connection with our IPO, which was approximately $12.1 million higher in the comparable period last year. Excluding these and other adjustments, adjusted G&A as a percentage of revenue was 7.7% compared to 5% in 2Q 2021. The grocer issue described earlier contributed the increase in adjusted general and administrative expense as a percentage of revenue. Net loss was $1.4 million compared to net income of $31.1 million in the second quarter of last year.\n\nNet loss was impacted by stock-based compensation expense of $31.6 million, $11.9 million of which related to the nonrecurring co-CEO awards made at the time of the IPO. The year-over-year decrease was primarily due to the grocer issue we discussed as well as a decrease in our tax benefit, which was $37.3 million last year compared to only $8.7 million this year. This was partially offset by a decrease in stock-based compensation expense. In addition to these drivers, the acquisition of vitaCare also had a negative impact on our second quarter 2022 net loss, but to a lesser extent.\n\nMoving on. Adjusted net income decreased 22% year over year to $27.2 million. Adjusted EBITDA decreased 13% year over year to $47.2 million. Adjusted EBITDA margin decreased year over year, but continued to be a strong 24.6%.\n\nThe decrease in adjusted net income, adjusted EBITDA and adjusted EBITDA margin are all driven primarily by the grocer issue. While we're able to keep adjusted sales and marketing largely flat quarter-over-quarter in absolute dollars and decrease the proportionate made of revenue on a year-over-year basis, it still forms a larger percent of revenue compared to the first quarter of this year and some other more fixed cost and expenses from the larger percentage of revenue as well due to the decrease in prescription transactions revenue. Even with the grocer's impact on our business, we are still able to generate an adjusted EBITDA margin of almost 25% and continue to generate strong cash flow with net cash from operating activities of $51 million for the quarter. Moving on to guidance.\n\nWe will not be providing full year expectations at this time as the full year impact of the grocer issue continues to be difficult to estimate because there are several variables, including, among others, consumer response to pricing and returning user levels that have to be determined. Given we only have less than a week of empirical data on utilization and a more normalized state with the grocer, we do not yet have enough data to reliably estimate the impact. For the third quarter, we expect total revenue of approximately $185 million. This assumes the loss in prescription transaction revenue related to the issue expands to approximately $35 million to $40 million.\n\nThe impact is expected to be greater compared to the $30 million impact in 2Q 2022 as the impact was gradual as the quarter developed and was not as severe in April as it was in June and as our plan for the year assumes sequential growth at this grocer. As Trevor mentioned, we exited the second quarter at 20% of weekly volumes at the grocer in July, that number is already lower in the mid-teens. We believe the benefit to third quarter revenue from the grocer issue being addressed will be immaterial. In other words, we do not expect a meaningful volume lift relative to where we exited the second quarter for a few reasons.\n\nFirst, the issue is addressed less than a week ago, and it takes time for changes in communication to reach the pharmacy and store level. Second, it is unclear how many GoodRx consumers that switched to their insurance or another form of savings at the grocer during the second quarter will return to using GoodRx. And if they do return, how quickly that will happen. Finally, pricing has changed and will be higher in many cases.\n\nFor all these reasons, we believe that the impact or benefit on Q3 and Q4 revenue and possibly for a period of time after that will be minimal. In addition to the impact of the grocer issue, we expect the consumer engagement efforts Trevor discussed earlier to further impact prescription transactions revenue by approximately $5 million in the third quarter and approximately twice that in the fourth quarter due to higher friction in the funnel. As Trevor said, we believe that these efforts will allow us to create tighter relationships with our consumers and deliver more value to them in the future. We also believe it will allow us to generate higher LTV from our users across not only in prescription transactions but also our other existing offerings as well as services and products that we will build or buy in the future.\n\nThe impact expands from the third to fourth quarter since we began this effort in the middle of the third quarter. For these reasons as well as the modest decrease in PTR per MAC, we're anticipating due to continued volume mix shift, we expect the quarter-over-quarter prescription transactions revenue decrease of approximately $10 million in the third quarter. We expect subscription revenue will be moderately lower by $1 million to $2 million in the third quarter compared to the second quarter due to the late second quarter churn from our existing user base as we rolled out fee increases to the entire subscriber base. This is in line with our expectations from earlier in the year.\n\nOn the quarter earnings call, we discussed our strategic repositioning of Gold, our subscription program, and the fact that we're planning to focus on a more specific audience that we believe finds more value from Gold members of chronic conditions, multiple recurring prescriptions and other long-term needs. As part of this repositioning, we undertook a one-time price increase for new Gold subscribers in January to reflect all of the value we've added to program in 2021 and create a clear differentiation between our offerings. In the second quarter, we rolled out increased prices to our existing subscriber base. When we announced the Gold price increase on our Q4 earnings call, we shared that we expected a one-time churn impact when we raised prices to our existing subscriber base in the second quarter.\n\nAs we anticipated, we're entering the third quarter with a slightly smaller Gold subscriber base due to churn. As a reminder, the strategic repositioning of this offering focuses on a narrow audience, which may affect future growth rates. We will continue to work hard to ensure that GoodRx consumers find the offering that makes the most sense for them and best suits their needs. We expect pharma manufacturer solutions to grow approximately 60% to 90% year over year.\n\nWe're providing a fairly wide range, both because individual deals can be quite large and delivering on the pre or post-quarter end can swing revenue materially. We've also begun to take advantage of opportunities to earn revenue based on our performance and the timing when we drive consumer or HCP actions can also create some fluctuation. Finally, we expect other revenue to be largely flat year over year. We realize that our total revenue guidance for the third quarter reflects a year-over-year decline in revenue.\n\nThe primary reason for that is the loss of the majority of revenue from the grocer, which made up almost a quarter of our prescription transactions revenue in the comparable period last year. We currently anticipate the grocer issue and our registration efforts will negatively impact our year-on-year growth rates by more than 20% in the third quarter. Turning to adjusted EBITDA. We expect the third quarter adjusted EBITDA margin of approximately 20%.\n\nAs mentioned, in the second quarter, we able to keep adjusted sales and marketing largely flat in absolute dollars quarter over quarter and decrease the proportion it made of revenue on a year-over-year basis, but it still formed a larger percentage of revenue compared to the first quarter of this year and some of our other more fixed costs and expenses from the larger percentage of revenue due to a decrease in prescription transaction revenue because of the grocer issue. Even with this issue, we are still able to generate an adjusted EBITDA margin of almost 25%. Our 20% adjusted EBITDA margin guidance is lower than our historical margin profile and lower than our second quarter results, primarily driven by the revenue compression due to the grocer issue. An additional factor is vitaCare, which we indicated at the time of acquisition, would have a low single-digit drag on adjusted EBITDA.\n\nVitaCare has historically been in a negative adjusted EBITDA position, which we expect to be the case for a few more quarters. We are committed to ensuring our adjusted EBITDA in future quarters increases relative to this quarter. I also want to reemphasize our commitment, to increasing growth rates and improving margins. All of us on the leadership team are focused on these goals.\n\nAnd we're reevaluating spending to prioritize growing adjusted EBITDA as a percentage of revenue. That entails scrutinizing all of our costs and expenses with the objective of greater efficiency today and greater adjusted EBITDA flow-through as we grow. We've historically been able to deliver a strong combination of growth and margin, and we want to make sure that continues to be the case in the future. We're confident in our ability to continue to drive our mission to help Americans get the healthcare they need at a price they can afford.\n\nAnd we believe the current macroeconomic environment that increases many people's need to trade off expenses as inflation rises, makes everything we do more and more relevant for all Americans. With that, I'll now turn it over to the operator for Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Glen Santangelo from Jefferies.\n\nGlen Santangelo -- Jefferies -- Analyst\n\nI'll ask two quick ones. I know we're supposed to ask one. So I'll be quick. With respect to revenue growth and the outlook for that, do you expect to be at some normalized rate in the fourth quarter so that when you exit Q4, we'll return back to that sort of mid-20% sort of growth target that you had as you enter 2023? And then secondly, on the margin side, margins have come down substantially year after year here.\n\nAnd Trevor, to your comments, you say you're focused on it, but I understand the grocer issue is a big part of it, but now it sounds like you're doubling down on consumer engagement. You're talking about a modest decrease in PTR per MAC. You highlighted product development, tech expenses in the press release. Is this the trough in the margin here in the second half of 2022? And how should we think about, the outlook for margins as we also move into 2023?\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you very much for the question. I'm going to have Karsten speak to this.\n\nKarsten Voermann -- Chief Financial Officer\n\nHi Glen, it's Karsten here. Glen, I think the two questions related to 4Q and to margins generally overtime. I think, first of all, with respect to revenue, 2Q into 3Q into 4Q, we didn't guide 4Q yet, again, as we said in our prepared remarks, mostly because the impact of this issue remains somewhat challenging to predict is probably the best way of putting it, especially since addressing the issue with a particular grocer only happened quite recently. So for that reason, we're not actually guiding 4Q today.\n\nHowever, I think we have indicated that, from the 2Q levels of impact, which are around $30 million represented about a 70% to 75% drop relative to expected revenue of the grocer into 3Q that expanded somewhat because the effects have been there for the entirety of the quarter. So we expect a larger impact. We talked about $35 million to $40 million. And we expect that -- that impact will extend not only in the third quarter, but potentially into the fourth quarter and beyond as well.\n\nThe reason for that specifically to the fact that, number one, again, resolution was just achieved. So we don't have that much empirical data on the future-looking impact of addressing the issue. Second, it's unclear how many GoodRx users that switch to another form of payment, perhaps using their insurance in lieu of GoodRx given about 75% of our users have insurance coverage will return and how quickly the return to use GoodRx. Thirdly, we expect our pricing will flex to some degree and in many cases, be higher at the grocer question as well.\n\nSo I think our view is that we expect the impact to continue beyond just the third quarter. With respect to the second question you had on margins, we're taking an extremely hard look at our cost structure right now. So from that perspective, we continue to believe that especially in the longer term, our expectations around margin haven't changed. We've talked about the fact that we aspire to and believe we can return to becoming a Rule of 40 company.\n\nI think what's changed is that with this onetime step down in revenue that we've experienced hasn't necessarily impacted growth trajectory at all, but it impacts the step down right now with the grocer that may extend the period a little bit, it takes for us to get to those higher combined growth plus margin level. Sorry for the long answer, but I wanted to make sure I hit both.\n\nGlen Santangelo -- Jefferies -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Sandy Draper from Guggenheim Partners.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nThanks so much. I may just try to follow up on that line of questioning in a slightly different angle. Totally appreciate those -- the follow-up response to Glen's question. That was very helpful.\n\nMaybe asked another way, what could happen that would make the impact the $30 million to $40 million you're expecting in the third quarter? Is there anything that could happen that can make it bigger? I get now why the $30 million in the second quarter is stepping down to $35 million to $40 million. But I'm trying to see -- I don't -- we don't know clearly when it's getting better, and I can appreciate that. I'm just trying to understand, would there be anything that would cause it to decline further? Because it just doesn't seem like at this point for further step down, it seems like the uncertainty is just when and if it starts coming back? Thanks.\n\nKarsten Voermann -- Chief Financial Officer\n\nSure. I can take if that's the case, Sandy. It's Karsten speaking here. [Inaudible] I to see nothing could happen that could cause a drop to be bigger.\n\nBut I think at the same time with respect to the issue and question speaking more narrowly about that, we are extrapolating from the levels of usage that we see today, hence the increase from 2Q to 3Q. We talked a little bit about on the scripted remarks -- talk a little bit about the fact that we've seen further exacerbation of the issue from 2Q to 3Q. And given that reality and extrapolating from levels that we're seeing now, I don't think we're in a place where we anticipate the impact would be larger than we had talked about. That said, at the same time, the counterbalancing issue is that we do have limited empirical data right now.\n\nAnd that's because associated with the addressing of the situation, we will likely see some changes to consumer pricing, and we'll likely also see that impacting potentially which particular pharmacies consumers utilize. We've done a nice job of being able to shift demand and consumers have gone to wherever the prices are best. So that's why, as Trevor articulated in the scripted remarks, we've seen, on average, about a 3% growth of volume in other places. So I'm not sure that would be totally deleterious if prices increase a little more or a little less than expected.\n\nSo I think to answer your question we think we've taken a realistic view of it. And I think the only other issue outside the grocer one that we talked about a little bit on the call was that we're also focusing quite aggressively on increased engagement with consumers, and that may have some funnel impact. And we talked about on the call about looking like it could be about $5 million of impact in 3Q and about double that in 4Q. So those two elements together are the ones that we realistically see potentially impacting us.\n\nI hope that's useful, Sandy. And sorry for the long response.\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nYes. That's great. Thanks. I'll keep the long question and jump back in the queue.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Stephanie Davis from SVB Securities.\n\nStephanie Davis -- SVB Securities -- Analyst\n\nKarsten and congrats on the resolution. I was wondering if you could talk to us about the renegotiated prices for the grocer and how that compares to their historical levels as well as your broader pricing base? So will the pricing reset in the way where Krogers will go back to being the majority of volumes if everything shakes out before, or are we going to see more ratable distribution of volumes post resolution because their pricing is more in line with a broader base?\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you very much for the question. We are happy that the grocer's been addressed, and we're really pleased to have this more strategically aligned relationship with the grocer who we value as a partner. The -- in regards to pricing specifically that you asked about, some GoodRx prices at the grocery will now be higher for consumers they were previously. But the prices are discounted relative to what users might otherwise pay, and we believe they are sustainable for all parties, the consumer, the grocer and GoodRx.\n\nPharmacies have to manage the price volume trade-off sustainably. And there is -- these are highly dynamic. We know that consumers are extremely price sensitive, but they also value having the choice of pharmacy. So we're really pleased that they will have that access.\n\nKarsten Voermann -- Chief Financial Officer\n\nAnd Stephanie, this is Karsten again. I'm going to jump in just for a sec as well. I think one more point on pricing is that the grocer prices for most medications will now we expect likely to end up being more similar in lines of prices we show at other retailers. So based on what we saw in the second quarter, when generally seeing pricing at other retailers, new users just shifted there the marketplaces work and went to their next lowest price.\n\nSo they found those prices continuing to be quite attractive. But to your point, that did mean that we saw a volume shift pretty much on average, all the other pharmacies and retailers picked up volume during this period that just to last.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Cherny from BofA.\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nThank you for taking the question. And maybe along those same lines of thoughts, as we think about your placement competitive environment, I appreciate the commentary you had about being able to shift volumes to other pharmacies. And at the same time, that dynamic that you mentioned at the beginning about with the impact of grocer and how traditional customers just got used to still going in there only to find out that they weren't participating in the network. And so, how does that play off in terms of the dynamic for the individuals that went to these new grocers? Is it just that they changed the method? And how does that factor in, in terms of where you see that rebalancing, rebasing of growth going forward across your various different grocery and other pharmacy channel partners?\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you for that question. Yes. As we talked about four new users, the new users largely moved to other retailers. When we saw the new user volumes were -- are quite similar to they were prior to this issue.\n\nHowever, existing users often are -- have -- go directly to a retailer without always checking GoodRx first because, historically, while prices of drugs do move up and down, there's some relative stability there. So, that's one of the reasons we've been very focused on engagement and on driving it and spoke about that in the prepared remarks, because we want to make sure we can move existing customers just make them learn about information about a change in price or something else and learn about that quicker so we can get quicker action on that existing user side into the future.\n\nKarsten Voermann -- Chief Financial Officer\n\nYes. I think adding to Trevor's point, I think the reality is that as we continue to move forward through this process, we're going to continue to see the benefit of the now address situation. And with that, we're going to see that we're going to be able to work with each of the individual pharmacies to continue to meet their specific needs in a manner that's going to create a more sustainable environment in the long run.\n\nOperator\n\nThank you. Our next question comes from the line of Craig Hettenbach from Morgan Stanley.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nA lot of the focus is on the grocer, but you did comment that more broadly, the difficulty for a number of pharmacies. And so, just wanted to see how you're thinking about that in terms of what that means for the economics of the business and pricing on a more broader basis?\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nYes. I appreciate the question. We have been really proactively engaging with pharmacies that represent the vast majority of the volume. And we strongly believe the pharmacy network is very stable.\n\nWhat we've seen and to your question, is that each pharmacy is facing unique challenges. And in particular, relative to these current macro environment changes, that has a different impact and different opportunities for each pharmacy. So we've been working proactively to collaborate on solutions to drive mutual success and profitability and sustainable economics for all the parties in our ecosystem. As an example, many of the pharmacies in our network benefited from increased volume during this period, the grocer issue occurred, and they're working closely with us on additional tactics to grow volumes in the future.\n\nBut each pharmacy has different needs, and we're trying to make sure we're really effective in addressing that. And we've just recognize the importance of working creatively to help pharmacies, address unique challenges and supporting strategic priorities and believe, we are doing a much better job in trying to be expeditious on that.\n\nKarsten Voermann -- Chief Financial Officer\n\nYeah. Just jumping in on that, this is Karsten again. Looking ahead, I think what we do see the grocer issue having caused a one-time step down in terms of revenues. We also don't believe that, it's going to impact our growth rate in future years or it doesn't impact the future market size or opportunity.\n\nAnd that's in part because our value proposition with pharmacy is very strong. We drive foot traffic and help consumers have a positive experience at the pharmacy counter. And our data shows that GoodRx uses by incremental items, more than 75% of the time, which is, of course, very attractive. And on top of that, you've seen us do a lot of work with individual pharmacy banners as well, like ads that we've shot together at Walgreens, Rite Aid have enjoyed our Gold program, deep integrations on the tech side, things like the ability to book CVS MinuteClinic appointment through GoodRx app, etc.\n\nSo I think, again, given the volume growth we've seen, outside the particular grocer in question, I think we're feeling like the other retailers and pharmacies have a highly symbiotic relationship with us.\n\nOperator\n\nThank you. Our next question comes from the line of Mark Mahaney from Evercore ISI.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThanks. I wanted to ask if you had any commentary on some of Amazon's recent moves and maybe the acquisition pending acquisition of One Medical. And whether that may actually create opportunities for you, partnership or distribution opportunities for you? Thank you very much.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you for the question. Amazon has been pursuing the health business for years. We have not seen a material impact on our business. We believe the recent acquisition of One Medical signals an intention to move further into the employer services space and their efforts with Amazon Care.\n\nAnd we don't expect this to have any impact on our business.\n\nOperator\n\nThank you. Our next question comes from the line of Eric Sheridan from Goldman Sachs.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nHi team. The first, just a clarifying question, the new agreement with the grocer partner, does that have duration that new agreement that we can better understand? So somewhere down the road, if it has to get renegotiated or be renewed that we're aware of some of the timing dynamics around the agreement. That would be number one. And number two, moving away from the grocer, you talked a lot over the last couple of earnings calls about a return to normal in terms of doctor visits and prescriptions.\n\nWhere are we in general in terms of the overall backlog of doctor visits and expected prescriptions? And how do you think about either leaning in, if you're seeing that improve or elements of broader customer growth you think that could drive in the platform as we move further away from the pandemic? Thank you.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you for the question. I'll have Karsten speak to these.\n\nKarsten Voermann -- Chief Financial Officer\n\nHi Eric, with respect to the terms of the agreement, the terms of the agreement are confidential, so I can't really go there on this call. But we're feeling very good about the fact that the situation is addressed, not just for today, but for the future as well. With respect to sort of therapy starts and the like, we're for the first time seeing now, for the first time in certainly a couple of years seeing now that new therapy starts are approaching levels that they are at for almost all therapies categories that they're at pre-COVID. So when I look back at the data, I'm generally seeing that the data is now converging back to sort of the 100 index of where it was previously to the COVID period.\n\nSo from that perspective, we view that as generally positive. I think what's hard for us though is that when we look at our own data, the grocer issue did create some noise. So that makes it a little tougher for us to see if that's fully manifested in our case, the higher rate of healthcare utilization. We do anticipate that it could continue to turn into a tailwind as trends normalize further.\n\nOperator\n\nThank you. Our next question comes from the line of Doug Anmuth from JPMorgan.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThanks. Just back to the grocer issue. I know you talked about pricing for prescriptions going up for consumers there. But just was hoping you could talk a little bit more about what it means for GoodRx take rates with that pharmacy? And then also on an overall basis, I think you mentioned a modest decrease in PTR per MACs going forward? Thanks.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nKarsten?\n\nKarsten Voermann -- Chief Financial Officer\n\nSure. Doug, it's Karsten here. Yes, I think we expect that pricing for most medications at the grocer will now be more similar to those in other retailers. And that has a few implications.\n\nI think one is from a concentration perspective, we don't believe the grocer reach levels they're historically. With respect to our revenue economics, historically, this grocer had higher PTR per MAC, mainly because the pricing was good, and MAC filled more scripts than they did at other retailers. The other expect is that take rate will likely go down formulaically simply because as prices go up, all else held constant, that larger denominator means that the take rate as a functional will fall. So I think we will see those impacts to some degree.\n\nI think the other thing that we see potentially happening is that as mix shift continues to evolve going forward, we also have the potential that we'll continue to see going into the third quarter and beyond some flux in PTR per Mac. We could see another low single-digit percentage sort of smaller sequential drop in the third quarter with that evolving mix shift as well.\n\nOperator\n\nThank you. Our next question comes from the line of Charles Rhyee from Cowen.\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nThanks for taking the question. Just wanted to get a little bit more -- just to clarify a little bit more on the grocer issue. If I recall, the issue was the grocer was having a dispute with a number of all its PBMs in regards to reimbursement for their discount card programs. In your role in all this is your algorithms facilitate showing best price to members at the point of them looking for a cheaper option.\n\nWhat I'm trying to get a better understanding is here is that the resolution here, you seem to be talking a bit about an agreement you've come to with the grocer. But isn't the issue more about them having resolved with all their PBMs, or I mean, is that what we're really talking about here? Just trying to understand your role in terms of facilitating or negotiating on behalf of the grocer. Can you explain sort of what -- my understanding your role was a little bit more separate from all this and that the impact that we were seeing last quarter and obviously into this quarter was sort of a byproduct of sort of contractual dispute between the grocer and its PBMs? Thanks.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you for the question. We're very happy. We spoke about the GoodRx been addressed, and it's been addressed very recently. Over the next few days, communications around GoodRx acceptance, we provided the pharmacist, discounted pricing will be up on a platform and most importantly, GoodRx discounts will be consistently accepted at the point of sale.\n\nThere are many parties involved here, so I'm not going to speak to sort of specifically the agreements between different parties. But we're pleased that consumers will be able to enjoy the prescription access and affordability benefits of GoodRx at this grocer who we value as a partner. We are, though, really disappointed that this disruption occurred. And we are being extremely proactive, as I spoke to a bit before, just to ensure that all needs are being met by all of the marketplace participants that all players of sustainable economics and make sure that the affordable prices that we help make accessible are available as broadly as possible.\n\nAnd so we do want to play that role of trying to be helpful where we can in making a functioning marketplace. GoodRx is the best known brand in our space. We have a large devoted consumer base. We have a large HCP base.\n\nWe have millions of visitors on our platform monthly. And all of that gives us the opportunity to grow and scale the business. So we're happy to be able to do that collaboratively and proactively with all of the different marketplace participants.\n\nOperator\n\nThank you. Our next question comes from the line of John Ransom from Raymond James.\n\nJohn Ransom -- Raymond James -- Analyst\n\nHi. Good afternoon. So just to be clear, the grocer, let's say you got all of those customers back. I know that's not going to happen, but theoretical exercise, you get all those customers back in the fourth quarter.\n\nWhat I'm inferring the -- with that particular grocer has gone down in this renegotiation. But I don't think you specifically said that. But if everything reset back to normal, you get all those customers back, what would be your pro forma take rate gross margin versus where it was, say, before all the seven?\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nI'll let Karsten speak to this.\n\nKarsten Voermann -- Chief Financial Officer\n\nHi, John, it's Karsten here. I think the question relates to, hey, what's -- what would be the sort of gross margin impact of the combination of mix shift, given that this grocer is now not over-indexed anymore in our ecosystem and in association with the addressing of the situation. Just to make sure I got it right. Does that -- did I echo back the question you're asking, maybe said a little differently? I assume, yes, because you may not be able to speak right now.\n\nSo if I didn't get that right, I think the impact of both the mix shift and the change in pricing is what we talked about a little bit to an earlier question around PCR per MAC and the impact that this had on it. So it's slightly diminished PTR per MAC again because the volumes of this grocer were higher in terms of transactions per MAC and because of the take rate impact of price going up, potentially pushing down take rate. So I think on a net basis, all those factors would impact gross margin to some degree. So again, the differences in PTR per MAC, the question versus other ones, like we said in the prepared remarks is not that significant.\n\nSo the impact on gross margins would also not be that significant.\n\nOperator\n\nThank you. Our next question comes from the line of George Hill from Deutsche Bank.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nThanks for taking the question. I wanted to kind of delve into the EBITDA guidance and by relation grocer a little bit more. Should we think of the change in the margin profile that you guys are guiding to in Q3, beside from the very small vitaCare drag is largely like if the change in volume at the change in margin? So basically, the gross margin of the business or the EBITDA margin of the business is meaningfully lower ex kind of the grocer under the old terms. And is there a reason to expect that it would improve to historical terms to historical -- the historical ranges at the new terms with the grocers, or is that just not -- is that an amount of margin profile that's attainable under the new agreement?\n\nKarsten Voermann -- Chief Financial Officer\n\nHey, George, Karsten here again. So, if I'm understanding the question right, it's sort of like what drives the change. And the change in margin for both 2Q and ultimately for 3Q is effectively driven by the fact that PTR, prescription transactions revenue is just lower. And that drop in PTR associated with the grocer issue in combination with the cost structure that we are focused on now ameliorating, but that we've kept relatively constant until now impacts the margins.\n\nSo if you were to add back potentially the kind of revenue that the grocer had historically done, you would find that the margins would be relatively consistent, a lot more consistent with what they have been historically. So, I think this issue is solely one of sort of revenue whole associated with the grocer and not more complicated than that from, at least the lens that we're looking at it through. And as we look forward, again, I think the pricing at the grocer in question is not really that material. And the reason I say that is that for a period of time, over the last several months, when we weren't promoting discounts at the grocer in question, our new user volume just sort of seamlessly flow to other retailers, pharmacies, groceries, et cetera.\n\nAnd as it sort of flowed to these other places, we actually saw volumes grow in those locations. And so I think our view is that as long as the volume comes through, we're sort of near agnostic, and this goes to John Ransom's question, too, as to which particular retailer comes through. On the margin, yes, the users who frequented the grocer in question did do more transactions on a monthly basis and the take rates we achieved were a little higher, but that was again at the margin. It wasn't sort of a dramatic thing.\n\nAnd the big thing was that the grocer had a significant amount of volume with us historically, and that volume is now diminished. And going forward, we're not sure to what degree it's going to come back and at what rate is going to come back. Hopefully, that makes sense.\n\nOperator\n\nThank you. Our next question comes from the line of Stan Berenshteyn from Wells Fargo. Your line is now open.\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nMy question is maybe just to go back to, I believe a comment that Trevor in the prepared remarks. I think you said that something along the lines of having incentives for users to register with GoodRx. And that may lead to friction or acquisition or conversion of new users? I'm just trying to understand the source of the friction. Is it that, if they don't register, they won't get as people a discount of those who aren't registered? I'm just trying to understand what's going on there.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you for the question. Yeah, we're trying to give the opportunity for consumers to provide us more account-related information in a variety of places in their user journey. And they'll be doing that for the reason -- for a reason like you just mentioned, such as a deeper discount or just for additional product features and more capabilities. And so that just may impact our conversion funnel and the number of users in the short-term.\n\nBut we believe this is the right choice because overtime, with a more robust user experience. And it gives us just more opportunities to assist users in their healthcare journey. And so by personalizing that experience more. We let them navigate healthcare journey better.\n\nWe potentially and hopefully increase the LTV of each user in our prescription transactions offering. And it just helps us enable other areas of our business to let users those and then hopefully monetize those also.\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nYeah. One great example of that, I just want to throw out there. We've recently launched last week a feature called, My Medicine Cabinet. And if you have the GoodRx, I encourage you to try it out.\n\nAnd this is where we're actually allowing a consumer to track their entire -- every medication that they take. And it's about not just cost it's also about information, potentially side effects, the name of the doctor, their refill history, the pharmacy they fill at. It's a really robust offering for consumers that go outside of pricing, outside of the pharmacy counter. And so just a little bit of information from the consumer, we can actually provide a whole slew of services that can help them provide a whole slew of services that can care management and ultimately, keep consumers healthier and keep them on medication.\n\nSo this is just the tip of the iceberg in terms of what we're doing on engagement. And we're really, really excited about the things that we can do here. So thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Steven Valiquette from Barclays. Your line is now open.\n\nSteve Valiquette -- Barclays -- Analyst\n\nGreat. Thanks for taking my question. So this was touched on a little bit, but maybe just hit it again. Just on unpack the reported 2Q results a little bit more.\n\nTotal company revenue of $191 million to $192 million was essentially in line with the $190 million guidance, with EBITDA $47 million came in about $12 million, $13 million higher than the Street view of $34 million to $35 million, which I feel like that's indirectly where the company sort of guided everyone toward for the quarter when talking about operations last quarter. I guess the questions are at the end of the day, did the full $30 million revenue impact from the grocer in 2Q ultimately fall right to the bottom line from your perspective in terms of $30 million impact on EBITDA as well or where there are some other mitigating factors? And then I guess, secondarily, one could argue the EBITDA upside in the quarter was just driven primarily by just the slightly better underlying prescription transaction revenue and also better subscription revenue. So I guess more --\n\nKarsten Voermann -- Chief Financial Officer\n\nWell, I think we lost the tail end of your question, Steve, but I think we got -- I think we heard most of it. Hopefully, you can hear me OK. I think, first of all, yeah, the -- I think our $192 million in revenue, yes, that revenue did, among other things, did benefit from potentially some incremental volume coming through in the market generally, utilization volume, which is great. But I think the more important factors are things like that we -- during the quarter, were able to take some actions that potentially allowed us to optimize around opex, too.\n\nSo the impact was more muted between top-line and bottom-line. So some of the things that we talked about in relation to that are that the capitalization rate given how we have changed the deployment of our technology, our product development and engineering staff has increased, which led to less of product and tech expense hitting the bottom-line and some of it being now applies to balance sheet. I think the other thing we talked about a little bit is that from an advertising perspective. In particular, we found some sales and marketing efficiency, which we'll anticipate getting more in the quarters to come as well, hopefully, as we talked about, focusing on our cost structure further.\n\nSo from an EBITDA perspective, we were able to harvest some benefits through the quarter that we didn't necessarily expect in advance of the quarter.\n\nOperator\n\nThank you. Our next question comes from the line of Jonathan Yong from Credit Suisse.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\n--taking my question. I guess going back to the grocer, kind of, putting it all together, you're talking about a bit of a mix shift away from the grocer toward the other pharmacies, the pricing at the grocer won't be as attractive. I guess does this kind of change the growth algorithm kind of moving forward, kind of given that. You did have an outsized growth component related to that grocer? And then does that $30 million to $40 million, it almost sounds like it won't necessarily all come back.\n\nI guess kind of what's your view on those items?\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nThank you. Yes, we don't believe this changes the growth outlook. We, most importantly, are very happy just for just customers that customers get the affordability benefits of GoodRx and they get them broadly. We want the people to have the broadest at as we can.\n\nWe've seen no decrease in demand. We have -- and I think even with this current environment, this current potentially recessionary environment and such that we see that Americans have even greater needs for getting affordable healthcare than they ever have in the past. So we see the growth dynamics remaining the same, and we are pleased that we have reached that this has been addressed. But most of all, we are being very proactive.\n\nWe are working with-- all the partners in our marketplace and trying to make sure and delivering on providing a sustainable marketplace for everyone, delivering on our mission for consumers and providing a strong, robust future growth story. And I'll let Karsten add.\n\nKarsten Voermann -- Chief Financial Officer\n\nYes. No, I think we see sort of a onetime step down associated with the grocer. Obviously, you saw that in 2Q, and you see us describing the impact in 3Q and beyond as well. But the reality is we don't see this as shifting our trajectory, meaning our growth rate.\n\nThe TAM continues to be huge. As Trevor said, demand is high. We've seen shifts in volume even during the 2Q period where we're seeing growth at all the other retailers on average. So from that perspective, I think we remain highly confident that the market that we're serving and the consumers that we're helping as well as their healthcare providers are going to continue to use GoodRx in huge numbers going into the future as well.\n\nOperator\n\nThank you. At this time, I'm showing no further questions. I would like to turn the call back over to Trevor Bezdek for closing remarks.\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nWhile our year-to-date performance is not what we expected at the start of 2022, we're aggressively working to change that. We've historically been able to deliver a strong combination of growth and margin, and we want to make sure that continues to be the case in the future. In addition to evaluating our business and reprioritizing spend where necessary, we will continue to pursue innovative opportunities that both deliver on our mission and unlock growth and are working collaboratively with stakeholders across the ecosystem to drive mutual success. I look forward to updating you on our progress in the quarters ahead, and thank you for joining us today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWhitney Notaro -- Vice President, Investor Relations\n\nDoug Hirsch -- Co-Founder and Co-Chief Executive Officer\n\nTrevor Bezdek -- Co-Founder and Co-Chief Executive Officer\n\nKarsten Voermann -- Chief Financial Officer\n\nGlen Santangelo -- Jefferies -- Analyst\n\nSandy Draper -- Guggenheim Partners -- Analyst\n\nStephanie Davis -- SVB Securities -- Analyst\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nJohn Ransom -- Raymond James -- Analyst\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nStan Berenshteyn -- Wells Fargo Securities -- Analyst\n\nSteve Valiquette -- Barclays -- Analyst\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nMore GDRX analysis\n\nAll earnings call transcripts"
}