{
  "companyName": "CS Disco, Inc.",
  "companyTicker": "LAW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/11/cs-disco-inc-law-q3-2022-earnings-call-transcript/",
  "content": "CS Disco, Inc. (LAW 0.16%)\nQ3 2022 Earnings Call\nNov 10, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the CS Disco's third quarter of fiscal year 2022 conference call. At this time, all participants are in a listen-only mode. All lines have been placed on mute to prevent any background noise. After the speakers' remarks, there will be a question-and-answer session.\n\n[Operator instructions] I would now like to hand the conference over to your first speaker today, Lee Robinson, CS Disco investor relations. Please go ahead.\n\nLee Robinson -- Investor Relations\n\nGood afternoon, and thank you for joining us on today's conference call to discuss the financial results for Disco's third quarter 2022. With me on today's call are Kiwi Camara, Disco's founder and chief executive officer; and Michael Lafair, Disco's chief financial officer. During today's call, we will review our financial results for the third quarter of fiscal year 2022 and discuss an update on full fiscal year 2022. Today's call will include forward-looking statements within the meaning of the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995, including, but not limited to statements regarding our financial outlook, including our guidance for the fiscal year 2022, our market opportunity, market position, product strategy, and growth opportunities.\n\nIn addition to our prepared remarks, our earnings press release, SEC filings, and a replay of today's call can be found on our Investor Relations website irs.cscisco.com. Forward-looking statements involve known and unknown risks and uncertainties that may cause our actual results, performance, or achievements to be materially different from those expressed or implied by the forward-looking statements. Forward-looking statements represent our management's beliefs and assumptions only as of the date made. Information on factors that could affect the company's financial results is included in its filings with the SEC from time to time, including the section titled Risk Factors in the company's quarterly report on Form 10-Q for the quarter ended June 30, 2022, filed with the SEC on August 12th, 2022, and the company's upcoming Form 10-Q for the quarter ended September 30th, 2022.\n\nIn addition, during today's call, we will discuss non-GAAP financial measures. These non-GAAP financial measures are in addition to and not a substitute for or superior to measures of financial performance prepared in accordance with GAAP. A reconciliation between GAAP and non-GAAP financial measures and a discussion of the limitations of using non-GAAP measures versus their closest GAAP equivalents is available in our earnings release. And with that, I'd like to turn the call over to Kiwi.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nWelcome, and thank you for joining our Q3 2022 earnings call. Revenue for Q3 was $34.5 million, above our guidance range. In Q3, adjusted EBITDA was negative $13.1 million, a substantial beat of our guidance. As we continue to invest in our business, we are finding ways to operate more efficiently.\n\nIn 2022, we made many key investments across our company, including a large scale out of our go-to-market team. We believe that these investments enable us to remain focused on accelerating revenue growth, leverage our cost structure to drive increased operating discipline across the company, and improve EBITDA margin going forward. As a result, we expect EBITDA margins to improve in 2023, and we believe we are well-positioned in our march toward profitability. We continue to add customers, growing customer count to 1,318 as of September 30, 2022.\n\nWe continue to see improving productivity on our sales development representative and the customer success teams as measured by leads and opportunities they identify. We were thrilled to introduce new customers through every single Disco product this quarter. Recall that new customers are just one part of our growth strategy, increasing multiproduct usage, the number of matters with each customer, and the volume of data on the platform are other key factors that impact our growth. In Q3, Case Builder had the greatest quarter-to-quarter sequential increase in customers since its launch.\n\nWe continue to be excited about Case Builder adoption. When customers use both Ediscovery and case builder, the Disco platform becomes a common repository for all types of evidence, including both documents and testament. Disco Hold, which allows companies to efficiently implement, track and manage legal homes, as well as retain and preserve enterprise data in the cloud, on long-term renewal contracts with three major technology companies and signed on new enterprise-scale customers in both the technology and health spaces. Our usage-based business model means that revenue in any given period is impacted by the volume and nature of customers' usage of each of our products.\n\nLast quarter, we explained the revenue was impacted by a shortfall of usage of our review product on large matters compared to high activity in the prior year, specifically on matters billing more than $1 million in review in the quarter. This shortfall continued in Q3. While this volatility in the timing and prevalence of large matters impact usage and given our usage-based business model revenue in any particular period, we are heartened by our continued ability to retain and add new customers to our platform. We continue to believe that long-term drivers like the increase in the volume and variety of enterprise data and the velocity with which it is created, as well as company's growing exposure to legal risks and legal disputes, is likely to result in increased usage of our platform by new and existing customers over the long-term across the full range of case sizes.\n\nWe remain excited about the opportunity in front of us and our ability to delight customers with the Disco product experience, new features, and exceptional service. As we do in each earnings call, I'd like to highlight a few customer success stories from the quarter and then share some future rollouts we are excited about. We were delighted to have a long-standing Disco Ediscovery client, one of the largest law firms in the world use Disco Review on five matters since discussions began in July about expanding their Disco products use beyond the Ediscovery. Their feedback so far has been very positive, driving multiproduct adoption across both new customers and our existing customer base is a core part of our long-term growth strategy.\n\nInternationally, we began to work with a new customer in the medical services industry. It was an inbound to Disco after the company's leadership had heard of Disco through their outside counsel, demonstrating the importance of good relationships with the layers of law firms who can introduce us to their clients. This customer had a large litigation matter and chose Disco for Collection, Ediscovery, and Review. Disco AI significantly reduced the number of documents they needed to review to prepare for their trial that is set to begin next year.\n\nNot only is our customer happy, but their outside counsel have also expressed high customer satisfaction as they have been supported night and day by our EMEA team under tight deadlines. Another client of Disco's since 2019 with multiple matters of the Disco platform, wanted to expand their usage of Disco. They have historically used both Ediscovery and Review, so we worked with to package a three-year comprehensive multiproduct bundle to best address their needs. This new package has a built-in commitment with room for growth and the addition of more products.\n\nLonger-term enterprise deals like this can increase our revenue visibility over time. We also had a civic Client Summit with one of our largest corporate clients and their outside counsel teams focused on maximizing the value of AI in their Disco experience, diving more deeply into the Disco products, and planning how Disco can best serve their needs. Our client and their outside counsel got to meet the broader Disco team who act as champions for them every day to provide optimal outcomes in our key partners in their use of Disco. These summits and quarterly business reviews are a great way for us to educate a customer on the latest features and best practices, as well as hear client feedback on what we can build to best serve client needs.\n\nThis is all part of our comprehensive customer relationship and assurance strategy to uphold the customer satisfaction and longevity over time. I would like to touch on new product releases during the quarter. We rolled out initial phases of our organization metrics feature set, which provides managers up-to-date metrics of their usage and data volumes on Disco and allow self-service reporting for customers. This is particularly attractive to our corporate customers and general counsels who want to see how many gigabytes of data are uploaded for particular matters if a database is active and who has access to the database.\n\nOrganization metrics includes visibility into overall data usage across all matters and Review databases and insight into activities impacting billable data usage. We are also excited to have recently announced Collect for Slack within our Hold product. With the continued rise of enterprise messaging and collaboration applications, Cat data like Slack can be difficult, expensive, and risky for organizations to preserve, collect and review for compliance investigations or litigation. That's why we've built Collect for Slack to enable legal teams to seamlessly reserve in place, collect and promote Slack legal hold data for Review all in the same interface.\n\nCollect the Slack's integration with the Slack discovery API enables collection of only the data needed for a legal matter and collection of that data only when it is actually needed, minimizing storage costs and security risks related to having company data live on in third-party applications. More broadly, Disco Hold centralizes the Hold, Collect, Review workflow in a single interface, making custodian notifications and tracking in place preservation, and now collection faster for legal and IT teams. With the release of Collect for Slack, we are delighted to grant legal teams additional visibility into and control of their legal hold and Ediscovery collections processes to get the evidence more efficiently. Building on these critical capabilities, we plan to expand our Hold connectors to additional enterprise collaboration solutions that legal and enterprise professionals rely on in their day-to-day work.\n\nWithin our go-to-market organization, we previously announced the transition of Andrew Shimek, our former chief revenue officer. Andrew has been with Disco for nearly five years. He helped us scale our go-to-market organization, grow from a start-up company to a public company, and cross the $100 million revenue milestone. We appreciate Andrew's commitment to Disco and wish him well on his next career at Beaver.\n\nThe team leaders for sales, marketing, and services who had reported to Andrew will now report directly to me, which is the original organizational structure at Disco. The current leaders of these teams came to Disco with incredible experience. Disco's senior vice president of global sales, Luke McNeal, joined us in 2021 with impressive enterprise software sales leadership experience. Prior to Disco, Luke helped scale the enterprise businesses at Amazon Web Services and Facebook.\n\nMelanie Antoon, senior vice president of professional services, started with Disco in 2019 and helped launch our Review and Services offerings. Melanie has deep legal domain and process implementation expertise, having led teams at Inventus, Huron Consulting, and Catalyst. Tom Furr, our senior vice president and chief marketing officer, has extensive B2B enterprise marketing experience and expertise in building enterprise brands, having previously led marketing teams at MongoDB and Vonage. Additionally, we recently promoted one of our own, Lauren Caruso, to be vice president of field sales in North America given her tremendous success as a regional sales leader and before that as a first-line sales manager at Disco.\n\nOur immediate focus areas as a go-to-market leadership team include deal-level coaching and pipeline rigor, ensuring we cross-sell in every deal and a focus on customer success in growing accounts to multiproduct full enterprise adoption. In 2022, we invested heavily to scale out every part of our business, especially our go-to-market organization that is focused on driving continued revenue growth. Now that we have made those investments, our focus in 2023 and beyond will be on driving organizational effectiveness and efficiency. I look forward to working with the rest of the management team to leverage what we have built to both accelerate revenue growth and make steady progress toward profitability in the coming years.\n\nI'll now turn it over to Michael to discuss our financial results and guidance.\n\nMichael Lafair -- Chief Financial Officer\n\nThank you, Kiwi. I will now discuss the details of our recent quarter results and an update on our outlook for fiscal year 2022. As a reminder, and for those who may be new to the Disco story, our business is primarily a usage-based model that is driven by the number of matters, nature of usage on the platform, volume of data, length of time on the platform and other factors that may impact revenue in any given quarter. As Kiwi mentioned, Q3 revenue was $34.5 million, up 15% year over year and above our guidance range.\n\nIn discussing the remainder of the income statement, please note that unless otherwise specified, all references to our expenses, operating results, and share count are on a non-GAAP basis. Our gross margin in Q3 was 76%, up from 74% in Q3 of the prior year. As a reminder, our gross margins fluctuate from period to period based on, for example, the amount and types of data ingested and managed on our platform. We expect gross margin to continue to be within the bands we've historically seen.\n\nSales and marketing expense in Q3 was $18.6 million or 54% of revenue, compared to 43% of revenue in Q3 of the prior year. This represents an increase of over $5.6 million in the quarter year on year. As we have mentioned over the last few quarters, we've been focused on investing and scaling our go-to-market organization. At this point, we believe that our sales and marketing teams are reaching the point of scale appropriate for near-term objectives.\n\nResearch and development expense in Q3 was $13.8 million or 40% of revenue, compared to 31% of revenue in Q3 of the prior year. This represents an increase of over $4.4 million in the quarter year on year as we continue to invest in teams to support product and future development. General and administrative expense in Q3 was $7.9 million or 23% of revenue, compared to 26% of revenue in Q3 of the prior year. This represents an increase of approximately $0.1 million in the quarter year on year.\n\nOperating loss in Q3 was $14.1 million, representing a margin of negative 41%, compared to negative 27% in Q3 of the prior year. Adjusted EBITDA was negative $13.1 million in Q3, a margin of negative 38%, compared to a margin of negative 25% in Q3 of the prior year. Overall, our EBITDA was better than guidance due to strong gross margins and tighter opex spend in the quarter. Net loss in Q3 was $14.1 million or negative 41% of revenue, compared to a net loss of $8.2 million or negative 27% of revenue in Q3 of the prior year.\n\nNet loss per share in Q3 was $0.24, compared to a net loss per share of $0.17 in Q3 of the prior year. Turning to the balance sheet and cash flow statement. We ended Q3 with $213.1 million in cash and cash equivalents. Year to date, operating cash flow in Q3 was negative $36.7 million, compared to negative $18.8 million in Q3 of the prior year.\n\nNow, turning to the outlook. For fiscal year 2022, we are reiterating our revenue guidance in the range of $132 million to $136 million, representing 17% year-over-year growth at the midpoint. We continue to anticipate that our original product, Ediscovery will be over $100 million in revenue in 2022 with an annual growth rate of more than 30%. For fiscal year 2022, we are updating our adjusted EBITDA guidance in the range of negative $54 million to negative $50 million, representing adjusted EBITDA margin of negative 39% at the midpoint.\n\nAs Kiwi mentioned, since our IPO, we have significantly invested in the business across every major function to attain the scale we believe is needed to drive our increasing penetration of the market. Going forward, we believe these investments give us the resources we need to achieve our growth goals. As part of our march toward profitability, we are planning for EBITDA margin improvements in 2023 and beyond. We will provide more details on this and our outlook for 2023 on our Q4 earnings call next year.\n\nI'd like to now turn the call over to the operator to open up the line for Q&A. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Jackson Ader with MoffettNathanson. Your line is open.\n\nJackson Ader -- MoffettNathanson -- Analyst\n\nGreat. Thanks for taking our questions. The first one is on the sales organization and the change with chief revenue officer departure there late in the quarter. So, just curious, what are some of the changes that you think are to come? What needs to happen in terms of either hiring plans, ramp plans, productivity? Any detail you can provide would be great.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSure. The basic message is steady at the tiller. We think that Andrew did a wonderful job over the last almost five years, taking us from, frankly, an early stage start-up to a public company, growing revenue more than 10x, and taking us over the $100 million revenue milestone. The folks who reported to Andrew, our heads of sales, marketing, and services, who we talked a bit about in our prepared remarks, are continuing on and will report directly to me.\n\nAnd that's the original organization structure at Disco. It means that I'll get more involved in go-to-market, but it does not represent any fundamental change in our go-to-market strategy. I've long been a believer that in scaling out a go-to-market organization, there were no silver bullets and results depend much more on day-to-day execution, focusing on every stage of the funnel, ensuring that we are treating every opportunity is sacred, winning as many opportunities as we can, ensuring that we're cross-selling into those deals, and focusing through our customer success team on ensuring customers have a great experience during initial adoption and as they ramp their spend with the eventual goal a full enterprise adoption. One of the things we're very focused on that I highlighted in my prepared remarks is the multiproduct strategy that I talked about at our annual earnings call.\n\nLast quarter, we saw some great data points across all of our products with an increase quarter over quarter in the number of matters active in Review, some great Hold renewals, as well as new Hold sales to enterprises in the tech and healthcare spaces and the largest sequential quarter-over-quarter increase in Case Builder adoption.\n\nJackson Ader -- MoffettNathanson -- Analyst\n\nThanks for that, Kiwi. Just a follow-up on the product kind of the mix here. If we're still looking for the flagship Ediscovery products that continue to outgrow the rest of the portfolio. What exactly -- is it sales? Is it brand new sales that maybe aren't bundling all of the packages together? Is it cross-sales of current Ediscovery customers that maybe aren't picking up Case Builder review as quickly as you thought is causing them to under-grow the Ediscovery product SKU?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nThe principal issue is what we highlighted on the last earnings call and what's continued on this earnings call in last quarter, which is a shortfall in the number of very large Review users. So, that's Review usage that builds more than $1 million in a particular quarter. Last year and extending into Q1, we saw elevated usage of Review on very large matters like those. That fell away in Q2, and that shortfall has continued in Q3, resulting in challenging growth numbers for our Review business.\n\nAcross the rest of the product line, as I highlighted in my earlier answer and in our prepared remarks, we're pleased that the growing adoption of those products, although, of course, they remain relatively small in scale as compared to our original Ediscovery product.\n\nJackson Ader -- MoffettNathanson -- Analyst\n\nUnderstood. OK. Thank you.\n\nOperator\n\nThe next question is from Tyler Radke with Citi. Your line is open.\n\nTyler Radke -- Citi -- Analyst\n\nYeah. Thanks for taking the question. So, last quarter, you talked about kind of derisking the guidance and from some of these larger XL deals that you had on the Review business. I assume that none of those really came through here with guidance -- sorry, with the results kind of in -- toward the high end of your guidance here.\n\nHow are you thinking about the Review business heading into Q4? Has there been any change in the pipeline? And maybe help us understand if you're not expecting any of these larger deals in Q4, why is that? And when would you expect them to return? Is it a function of the macro? Or is there -- just help us understand this is something that you're seeing in the industry more broadly versus just the nature of your pipeline? Thank you.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nWe delivered a beat in the last quarter on revenue relative to the guidance that we provided and have reiterated revenue guidance for the full year. In terms of Review, as we've talked about with respect to all of our business, our usage-based business model means that revenue in any particular period may be impacted by the nature and volume of usage on our platform. And customers may not know exactly how big their matters are until well after they sign a contract or start the matter with Disco. The size of the matter and the timing of activity on that matter in our platform depend on the nature of the case and the timing or nature of rulings from courts or regulators.\n\nFor example, a customer may have a new patent infringement lawsuit, and that lawsuit might start out as relatively small in data because it involves, say, just one product or just a small part of the business. But as the case proceeds, that data might blow up because it turns out that some parts that are part of the allegedly infringing product are also allegedly infringing and third parties are brought in and the data blows up. The opposite thing can happen, too, an investigation from a regulator can start out being extremely widespread, Think of the Ford Prep Practices Act investigation. And then early on, it may be possible for lawyers to limit down the size of that investigation to a particular country or a particular business unit.\n\nAgain, these are things that happen in the middle of a particular legal matter. And so, they are unknown and largely exogenous from the point of view of both our sales team and the customer. And that's why we've reiterated that revenue can fluctuate from period to period, again, just depending on the kind of nature of the matters on our platform and the timing of use and so different aspects of our platform on those matters.\n\nTyler Radke -- Citi -- Analyst\n\nYeah. And then, sorry, I didn't mean to shortchange you, and so you didn't beat the guidance. You came in $500,000 above the high end. I just wanted to clarify, there was no -- none of those large deals happened in the quarter.\n\nIn other words, the beat that we saw was more from the Ediscovery side.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nThat's correct. So, the shortfall in large reviews, meaning reviews that bill more than $1 million in a particular quarter that started in Q2 and has continued in Q3.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. And just on the go-to-market side, Kiwi, now that the sales team is kind of rolling up to you directly, how are you just thinking about the incentive structure next year now that you have invested a lot, you have hopefully a lot more ramp sales capacity. Is it is going to be much more of a focus on expansion ARR? Or are you continuing to incentivize new logos? Just help us understand how you're thinking about that as you go through the planning process. Thanks.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSure. Yeah. If you think about the big drivers of our growth, right, it's adding new customers, expanding existing customers, and driving multiproduct adoption. So, we're right in the middle now of incentive plan designed for the coming year.\n\nAnd those are the things that are top of mind for us as we think about how to structure the plans. Now, the basic structure of the plan hasn't changed, which is that they incentivize revenue and because almost all of our customer base is usage-based, they incentivize driving usage. So, a salesperson is as incentivized to go take an existing customer and expand our relationship with them, for example, adding more layers to the platform or more areas of law or more product lines or whatever -- however, the customer is structured, as well as incentivizing salespeople to go drive multiproduct adoption in those customers. One area where we are paying a little bit more attention in our incentive plan design is actually how we incentivize our customer success professionals.\n\nHistorically, we thought of a variety of different things that they do and link their plans to sort of aggregate results. But going forward, we are going to be linking incentive comp for customer success much more directly to growth. Now, if you look at our customer base and think about sort of the stages of the customer success process, there's a new customer or even a new group within a customer and getting them from zero to one. We think of that as onboarding.\n\nAnd then there's a long phase. And again, in our business, this can be three to five years. It can be faster for people on their second journey, but we call it growth. It's getting the customer first from their first matter to six matters and then from six matters to sort of full enterprise multiproduct adoption.\n\nAnd then at the far end of that journey, there's customers who are at enterprise adoption and our engagement with them is much more about maintaining the relationship. It looks a lot more like renewals in a subscription business. And then, of course, introducing new products to those customers like Hold and Request as we continue to grow. So, I think with sales, the basic message on incentive comp is it's pretty similar with some changes around the edges.\n\nIn customer success, we are really heavily aligning that group toward growth, representing the importance of existing account expansion and also the multiproduct strategy to our future growth plans.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Koji Ikeda with Bank of America Securities. Your line is open.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking the questions. Apologies, I'm jumping around from a couple of calls here. So, if you did mention this in the prepared remarks, apologies on my behalf, but I just wanted to ask you how to think about balancing growth and profits in this type of environment.\n\nIf growth looks like it's going to be, call it, maybe a durable 20% growth versus previously thought much higher trajectory. How do you think about balancing growth versus profits right now?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSo, as we tried to emphasize in our prepared remarks, we have changed our philosophy on operating margins a little bit in light of both recent growth results and the macro environment. So, what we've said is that we are very much focused now on getting leverage on the investments we made across our business over the past six quarters, and we believe we're in a position to make steady progress on our march toward profitability and our long-term operating model in 2023 and beyond. Now, that does not mean that we've given up on growth. I don't think I or Michael would be here if we did not believe there was a tremendous opportunity to continue adding new customers, as we've demonstrated we can do even in the challenging macro environment, we increased customer count to 1,319 and also a tremendous opportunity to expand our relationships with those customers, including by driving multiproduct adoption of newer products like Review, Case Builder, Request, and Hold.\n\nBut it does mean that in this quarter and going into the new year, we are taking a sharp look at every part of our operating expenses, staff and nonstaff. We're also investing and really accelerating an ongoing investment in globalization, giving us access to lower-cost talent in other parts of the world. And in general, we think we are going to strike a more balanced note between revenue growth and operating margins going forward.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, Kiwi. And then just one follow-up, if I might, here for Michael. Net revenue retention, again, apologies if you guys talked about this already.\n\nBut just directionally, how to think about net revenue retention, was it maybe up down, or flat in Q3 versus last quarter or the first half of this year? Thanks, guys.\n\nMichael Lafair -- Chief Financial Officer\n\nKoji, thanks for the question. Good question. So, we've reported on dollar-based retention when we went public, I believe it was the Q1 number. And then again, when we filed the K, we -- I expect that we'll also release that number again when we file the K in likely February of next year.\n\nThat number is obviously based on revenue, and it's variable based on usage. So, it moves around a lot, and it has moved around in the past as we've reported publicly. So, you could expect to see that that is going to be variable and it's going to -- we expect it will continue to move around.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, guys. Thanks for taking the questions.\n\nOperator\n\nThe next question is from Derrick Wood with Cowen. Your line is open.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nHey, guys. Thanks for taking the questions. Kiwi, we hear a lot of companies talking about seeing optimization of the usage of their public clouds on kind of core enterprise applications. What kind of behavior are you seeing out there when it comes to your workloads, your customers that may be focused more on cost containment? Is that a trend that's happening and looking at how to better use your cloud and optimize consumption?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nI think it's no secret that heads of finance at every company are doing what Michael is doing at Disco and seeking to reduce spend across every part of the business. Legal is no exception. And so, we have had customers come to us and ask us how we can help them achieve their spend reduction goals. I'd point to a few things.\n\nOver the past year or two, roughly, we've shipped a variety of features in the product that help people optimize their data footprint. So, I think just over a year ago, we shipped Disco ECA, which is a lower-cost environment where people can stage large collections of data can use AI and other tools to identify what actually needs to go into active review at a higher price point. and then can seamlessly promote that data into active review. Shortly after that, a few quarters after that, we announced the addition of the Hold product and one of the great selling points of the Hold product is that it allows preservation in place.\n\nSo, historically, in order to preserve data for legal matters, you add to collect it, make a copy of it and store it in a platform like Disco Ediscovery or Disco ECA, with Hold in place, you don't have to do that. And so, you aren't paying double, right, once for the data in, say, a Slack or Microsoft or Google and one for the data in any discovery platform. That's one way in which our products can help our customers optimize usage. I think the final point that we made is when customers come to us and talk about reducing their legal budgets and making them more predictable, we like to lead in and emphasize that adopting Disco as a legal platform can do exactly that.\n\nIt's not that the customer should reduce their spend with us, it's that they should adopt Disco in order to reduce and to make more predictable the total project cost of legal matters, often by reducing legal lawyer billable hours on those matters materially through the use of automation and artificial intelligence to deliver high-quality legal work product more efficiently.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nYeah, that makes a lot of sense. And my second question is on the sales capacity side, I mean, clearly, a big build-out year for you. Just -- did you dial back the kind of level of sales heads versus your original targets just given the macro and that the revenue outlook? And how are you feeling about ramp to productivity? And maybe do you have a sense as to what percentage of reps will be considered productive as you exit this year?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSo, we did tap on the brakes a little bit, and we actually talked about that on last quarter's earnings call. We had observed on last quarter's earnings call that some of our newer reps had a higher appetite for lead generation than some of our more established reps who benefit from the sort of Disco referral cycle, right, for existing customers, refer new customers, and supply a material part of their sort of lead supply. So, we did that last quarter. On a relative basis, we reduced our investment in quota-carrying sales capacity and increased our investment in SDR, CSMs, and marketing lead-generation programs.\n\nI think it's also fair to say that in the aggregate, we have reduced across the board and the level of our investment in go-to-market relative to the ambitious plans that we announced at the time of the IPO. But what we've done and what we'll exit the year with still represents a super large step function increase in our go-to-market capacity both in terms of quota-carrying heads and in terms of lead gen and all the other functions that go into making those quota-carrying heads effective. In terms of ramp, we still have a lot of sellers who are very early in their ramp with Disco that's hired this year and even in the past couple of quarters. But one piece of data that we're pretty pleased with is if we look at the performance of those reps who are in their first 12 months of tenure and compare them to the performance of reps of similar tenure earlier in Disco's history, we're actually seeing the new class of reps outperform those historical class of reps who we know developed into successful sellers at Disco.\n\nOne of our big focuses in the New Year is really doing our best to treat every opportunity is sacred. And what I mean by that is involving senior people at Disco, proven others, subject matter experts on a deal-by-deal level, especially with our newer sellers to ensure that we're putting our best foot forward in terms of presenting the customers the value that Disco provides. And I think that will help us close more deals. That will help us close bigger deals that will ensure we're doing cross-sell and upsell correctly.\n\nBut perhaps most importantly, I really think that's the best way to train and ramp new reps, I've seen senior people do it, being on a sales call with me or with Luke or with other senior leaders at Disco, that's historically how we've trained the best reps at Disco and we're continuing to make that investment for the newer sellers as well.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThe next question is from Arvind Ramnani with Piper Sandler. Your line is open.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nYeah. Thanks for taking my question. Yes. I just want to go back on the kind of the topic of margins.\n\nCertainly, alluded to basically providing an update on the February earnings call as to sort of the kind of recasting of margins. While I'm not looking for any kind of specifics, directionally, is this going to be a hard shift toward prioritizing margins? And then the follow-up to that is, would there be any sort of compromise or kind of streamlining of R&D type of expenses? Or would it come more in the form of like sales and marketing type of efficiencies, where are you looking to kind of drive increased profitability?\n\nMichael Lafair -- Chief Financial Officer\n\nHey, Arvind, really good question. So, what we said in the prepared remarks and what we're also planning for next year is we're kind of in the middle of the budget process is really driving toward marching toward the path to profitability. And what does that mean? If you look at the investments we've made over the last six quarters since the IPO, we've significantly beefed up the go-to-market team, and we've also significantly made a large number of investments in the product team. As we move into 2023 and we look toward the path to profitability and improved adjusted EBITDA margins in 2023 and beyond, the goal really is to just optimize and leverage what we've already invested in.\n\nbetter and in light of the macro environment, just more attention. And I'm not saying we haven't had attention in the past operating discipline. And Kiwi mentioned this earlier, really looking closely at all nonstaff and also staff costs and also globalization. We are looking at globalization, we already have heads in a variety of countries throughout the world, and we're really looking at leveraging globalization to attract and retain the best and the top talent.\n\nAnd so, we believe that we can balance both the growth that we expect, as well as the longer-term goal, which is a path to profitability.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nTerrific. Thank you very much.\n\nOperator\n\nThe next question is from Brent Thill with Jefferies. Your line is open.\n\nBrent Thill -- Jefferies -- Analyst\n\nKiwi, one of the questions we get is legal volume should be more resilient than the tougher macro. So, many continue to ask, you've had a pretty material de-selling growth. Is this just lower volumes? Is this execution? How do you frame this up and your visibility now going into the front part of next year? Can you just describe what you're seeing from your overall pipeline as we head into the New Year?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nLook, I think there are some challenging headwinds in our business, the principal one being the shortfall in large review matters that began in Q2 and continued in Q3, and it's especially challenging from a comp point of view, given that we have such elevated usage in the form of those large review matters for about a year going into Q1 of this year. That's kind of the principal thing that we're seeing that we did not expect. I think also, we are being somewhat judicious in our outlook because of the macro environment and our uncertainty about what will come to pass. I think you have puts and takes there, right? So, on the one hand, you have the historical behavior of legal, which is that in the down part of economic cycles, disputes go up, right, litigators become busier.\n\nThat's certainly what happened after 2008. On the take side that you have to go to someone else's earlier question, the fact that Michael's equivalent at every business is going around department by department and asking people to limit usage and constrain costs, and discover is not immune from that kind of conversation, although as I said in answer to that earlier question, I think we have some compelling reasons by increasing Disco usage actually is the path to controlling legal costs more generally. So, I think that uncertainty is also causing us to moderate our outlook. Now that said, there are a ton of things that we think are super promising about the business and what we're seeing.\n\nAnd maybe the most prominent of those is that we've continued to steadily grow customer count now to 1,318 despite this challenging macro environment. So, I talked to a lot of my peers at other software companies. And I think a lot of categories of software sales were really challenged in Q3 where people were just putting off purchases and not switching, and we haven't seen that happen in our business. There's continued interest in making the jump from services-based solutions to software-based solutions and legal.\n\nAnd I think the value proposition that we're delivering to our customers of reducing legal spend in the aggregate, making it more predictable and perhaps more importantly, giving them a solution that actually can scale so that their legal budgets don't continue to blow up, not just in the current climate, but next year and the year after that, I think that continues to resonate in the market, as demonstrated by growth in customer count. I think the performance of our lead gen and expansion organizations continues to be a positive point about the business and the fact that those teams continue just have records on unit and aggregate productivity means that when we call customers, they're receptive to our call, right? That's sort of exactly what that means, right? Those are fees willing to take meetings with us about the benefit that the legal tech solution can have to their business. And then the final positive point, I think, is really multiproduct adoption, which never mind 2023, I think if we think about the long-term growth strategy of our business, that multiproduct strategy underpins a lot of it. And across all of the newer products, we have good things to say that we included in our prepared remarks, a continued increase in the number of review matters quarter over quarter.\n\nThe largest sequential increase in case builder adoption quarter over quarter and some great enterprise hold deals, right, where we're getting into companies, some of these that aren't using this discovery yet and getting in at the front end of the process where they're preserving data for use in downstream litigation. So, I would say we've been chased a bit by the results and by the macro environment. But I think there are puts and takes, and there are many good facts about what we're seeing in the business as well.\n\nBrent Thill -- Jefferies -- Analyst\n\nMichael, can I just ask a quick one on pathway to profitability and the other steps other than just air-braking go-to-market and sales reps? What else are you putting in to ensure that you get to that point?\n\nMichael Lafair -- Chief Financial Officer\n\nWell, I mean, what we've said a little bit in the prepared remarks and what I believe I answered in my earlier question, we've invested a significant amount since the IPO, and we feel that we've reached the scale necessary across most of our functions that's going to support where we go next year. And also, in addition to that, globalization and in addition to that, really a very close look at continuing operating leverage, operating discipline, and it's clearly a much different macro environment. And I think we have the kind of focus that all my CFO peers have in terms of really looking at every cost and making sure that we manage efficiently, we still want to invest in growth, but we feel like we've made a significant number of investments over the last six quarters that will support us as we continue to grow the business.\n\nBrent Thill -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Scott Berg with Needham and Co. Your line is open.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, Kiwi and Michael. Thanks for taking my questions. I guess I have two. The first one is a question I've had from several investors over the last quarter that I don't have a great answer for, but I was hoping you all could clarify in that some color too, is on the large view cases that it seemed like you were expecting at least in Q2 that moved out of the quarter given the results here in Q3, likely obviously did not occur given your commentary.\n\nWhat would cause those large reviews to move, not necessarily one quarter because that could be a couple of weeks or a month or maybe a couple of months, but six months, multiple quarters. Help us understand the environment, I guess, with your customers that could move the usage to that type of extreme.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nWell, I don't think that what we're talking about is customer has a large matter. That matter has a large review. They're intending to use Disco Review, but something has gone wrong with the timing, like there's a stay or that's not what we're talking about. I think what we're talking about is just customers not having those large reviews on our platform.\n\nSo, it's not a question of timing, but maybe a question of occurrence. And what can drive that, some of it is -- just does the customer happen to be sued or investigated in a manner that involves a large amount of data. One that we've talked about publicly is the opioid litigation, right, which was all over the news last year and which generated quite a bit of usage for us. But many of the cases, I don't think many ones are being filed.\n\nAnd I think a variety of them have been or are being resolved. That's one example, right? I think more generally, until the review business gets to larger scale, it's going to be possible for these large review kind of use cases to impact revenue in any particular quarter. And last year, we saw that happen to the good, right? Q2 of last year was the title wave of goodness. And this year, we're seeing what happens when that title wave goes out.\n\nBut we're not seeing any fundamental shift in how many large matters there are in the world or sort of anything like that. And so, our hope would be that as we get review usage to larger and larger scale, eventually, we get into such a scale that the impact of any particular large matter on revenue from the review product is small relative to the aggregate revenue from Review. And that, of course, is what we've seen in Ediscovery, as Ediscovery has gotten to greater and greater scale. There are still large Ediscovery matters, and they can come and go, and their timing is exogenous, and sometimes it's hard to predict.\n\nBut even very large Ediscovery matters as a percentage of overall revenue from Ediscovery usage are now relatively small, and that's just not true yet of our Review product.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Helpful. And then a follow-up for me from an answer you gave earlier around sales investments, Kiwi. You changed the composition, sounds like, from direct AEs or field reps to SDRs here over the last maybe quarter or two kind of change what that composition looks like.\n\nWhat does that tell us in the Disco model around, what your go-to-market activities are going to look like over the next three to maybe 12 months or so? Is this really more about trying to fill more at the top of the funnel and the SDR would often work with and maybe there's not enough opportunities later in the funnel? Or is it maybe a change in terms of the size of the customers that you're starting to look like -- look at today and have an opportunity to sign? Any color around what that change means for you would be helpful.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSure. First of all, to give you context, I'm talking about a relatively small change on the margin and not some kind of fundamental shift. I mean, I think on the order of like low double-digit number of people switching from one to the other. So, this is not a huge change.\n\nBut what we observed, and I talked about this a bit on last quarter's earnings call was that because so many of our quota-carrying sellers are new, so with Disco less than a year, they don't have the benefit of a big existing customer base that they sold into. And the benefit of that base is that it tends to generate referrals. So, we've -- the core of our model here is that we're really good at building these product experiences that lawyers love and when layers love using the Disco platform, they introduce our sellers to their friends and colleagues, both within the same organization and at other organizations and that sort of leveraging of customer satisfaction, coupled with the usage-based business model to power growth. That's been a key part of our historical success.\n\nSo, for newer reps, that's a lot harder, right, because they have to get the flywheel going by signing up their first sets of customers who then generate referrals to more customers and so on. And so, what we were finding is that some of those newer sellers had the excess sales capacity or another way of saying that is not enough opportunities. And the way we address that was increasing, relatively speaking, our investment in lead generation in the form of SDRs, customer success, and marketing programs in order to get more leads and opportunities to those sellers early in their ramp.\n\nScott Berg -- Needham and Company -- Analyst\n\nGot it. Very helpful. Thanks for taking my questions.\n\nOperator\n\n[Operator instructions] The next question is from Parker Lane with Stifel. Your line is open.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nYeah. Hi. Thanks for taking the question. Kiwi, curious if there's any change in the number of customers that are looking to lock in subscriptions in the face of a more uncertain macro.\n\nI think you've referenced one during the prepared remarks. Is that something that you'd expect here over the next 12 months? Or is that sort of a one-off situation?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nI don't want to overstate it. So, there are some customers who have come to us with exactly the motive that you described, right, the desire to increase the predictability of their spend and also to reduce their spend, if at all possible. And so, there's some of that going on. But as a percentage of our overall business, as a percentage of the deals that we're closing, those kinds of subscriptions, I mean, this is disclosed in our numbers, they still represent a much smaller part of our business than our traditional usage-based offering.\n\nI actually think this cuts both ways. Some of our newer products like Hold lend themselves to this kind of multi-year subscription kind of relationship with customers. And again, in the spirit of being somewhat uncertain about the macro environment and chastened by recent growth results. Perhaps it's good for us to sign a few more of those long-term subscriptions and bundle some other products in with them.\n\nSo, there's no fundamental shift in what we're seeing or what we're doing. But when customers do want to engage with us on a subscription basis, we're certainly open to having that conversation. And I think on the margin, some of our newer products actually lend themselves to that kind of deal structure more.\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nGot it. I appreciate it. I'll leave it at one in the interest of time. Thank you.\n\nOperator\n\nThere are no further questions at this time. I'll turn it over to Kiwi Camara, co-founder and chief executive officer, for any closing remarks.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nThank you for joining us today. I want to reiterate our strong belief in the opportunity ahead of us in the products we have built that are transforming the legal industry and in our ability to execute on that opportunity. We appreciate your interest in Disco and for joining our Q3 2022 earnings call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLee Robinson -- Investor Relations\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nMichael Lafair -- Chief Financial Officer\n\nJackson Ader -- MoffettNathanson -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nParker Lane -- Stifel Financial Corp. -- Analyst\n\nMore LAW analysis\n\nAll earnings call transcripts"
}