{
  "companyName": "Nautilus",
  "companyTicker": "NLS",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/nautilus-nls-q1-2023-earnings-call-transcript/",
  "content": "Nautilus (NLS -1.29%)\nQ1 2023 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Nautilus Inc. first quarter 2023 earnings results conference call. [Operator instructions] Please note that this event is being recorded. I would now like to turn the conference over to John Mills, ICR.\n\nPlease go ahead.\n\nJohn Mills -- Investor Relations\n\nGreat. Thank you. Good afternoon, everyone. Welcome to Nautilus' fiscal 2023 first quarter ended June 30th conference call.\n\nParticipants on the call today from Nautilus are Jim Barr, chief executive officer, and Aina Konold, chief financial officer. Please note, this call is being webcast and will be available for replay for the next 14 days. We will be happy to take your questions at the conclusion of the prepared remarks. Our earnings press release was issued today at 1:05 p.m.\n\nPacific Time and may be downloaded from our website at nautilusinc.com on the investors page. The earnings release includes a reconciliation of the non-GAAP financial measures mentioned in today's call to the most directly comparable GAAP measures. Please note, we will be comparing results versus last year fiscal 2022 and also versus fiscal 2020 as we believe comparing to the last pre-pandemic period is helpful in demonstrating our growth and progress. For today's call, we have a presentation that management will refer to during their prepared remarks.\n\nOn slide two is our full safe harbor statement, which we will ask everyone to read if you can access the presentation now by going to the investors page on our website and clicking on the events and webcast. I'd like to remind everyone that during this conference call, Nautilus management will make certain forward-looking statements. These forward-looking statements are based on the beliefs of management and information currently available to us as of today. Such forward-looking statements are not guarantees of future performance, and therefore, one should not place undue reliance on them.\n\nOur actual results will be affected by known and unknown risks, trends, uncertainties, and factors that are beyond our control and ability to predict. For additional information concerning these factors, please refer to the safe harbor statement and to our SEC filings, which can be found in the investor relations section on our website. And with that, it is my pleasure to turn the call over to Nautilus' CEO, Mr. Jim Barr.\n\nJim Barr -- Chief Executive Officer\n\nThank you, John, and thank you all for joining us. I am proud of our team's perseverance and grit in the face of challenging macroeconomic conditions, and I'm pleased with our results for the first quarter and our progress on our long-term transformative strategy. Starting with the financial results, we achieved the high end of our revenue guidance and EBITDA was better than expected even during our seasonally soft fiscal first quarter. Given the strength of our operating capabilities, our increasing understanding of consumer post-pandemic demand and our balance sheet, we continue to expect positive adjusted EBITDA in the back half of fiscal 2023 and are reiterating our full year revenue, EBITDA, and JRNY member growth guidance.\n\nAina will provide additional color on our financial results and guidance shortly. Our well-known brands, omnichannel go-to-market model, wide choice of price points in both strength and cardio offerings, and tight cost control were important drivers of our first quarter results. Our direct segment was up 27% compared to the same pre-pandemic period in fiscal 2020. Despite consumer macro wariness and even in the sector's low season, we were encouraged that the consumer responded well to our holiday offers for Mother's Day, Memorial Day, and Father's Day.\n\nAs expected, retail segment growth, excluding Octane was slightly down compared to the same prepandemic quarter in fiscal 2020. This decline was driven by retailers higher inventory positions after their heavy ordering last year. We closely partnered with retailers and supported promotional actions to work down inventory levels in Q1, generating some early reorders beginning to build some backlog, all with the goal of generating more reorders as we enter fitness season. While delivering expected Q1 results, we also advanced our long-term strategy.\n\nTwo strong examples I'll cover on this call are advancements in JRNY and optimizing supply chain. JRNY membership growth was a bright spot during the first quarter. Total members were 360,000 at 6/30, 133% higher than the same period last year. We have worked hard to design our business for long-term growth, but maintain a culture of agility and a cost structure that permits us to adjust to and navigate through short-term challenges.\n\nAs such, we believe we are relatively well positioned in the current macro conditions. Our first quarter results show that consumers will buy fitness equipment even in off-peak times of the year if they believe they are getting a good value. Having a diversified product portfolio versus having only one or two modalities is an advantage in this current environment. Our wide range of modalities and price points will give our consumers more affordable choices this fitness season.\n\nSimilarly, unlike some competitors who charge $500 per year or more, we feature an attractively priced digital platform at $149 per year. Together, our equipment and digital platform deliver an outstanding comparative total cost of ownership. We highlight this value proposition both in advertising and on our website. Additionally, as we've mentioned on prior earnings calls, we have an asset-light operating model.\n\nWe work with contract suppliers in Asia and partner with contractors for elements of our talent needs. Our strong focus on cost control and our decision to invest in supply chain capability give us more flexibility to navigate the current economic situation. Pillar four of our North Star is about optimizing supply chain for competitive advantage. Our investments in supply chain are beginning to pay off, and we believe it will become even more evident later in the year.\n\nWe've made several moves to give us line of sight to improve gross margins in the second half of fiscal '23. We negotiated lower inbound freight costs, which while still higher than calendar 2019, are much lower than peak market rates last year. We actively managed our inventory down and won't be incurring the detention and demurrage fees that hit us last year. We also won't be renewing leases for storage locations that we took on to house elevated levels of inventory last year.\n\nAs part of our supply chain planning, we are exiting the Portland, DC in late fall, and we renegotiated the cost for our top SKUs, which will positively benefit the P&L once we sell through the inventory already on hand. Finally, we have instituted tight cost control, including for now causing incremental brand marketing. As much as possible, we will remain vigilant in continuing to match variable SG&A costs of sales. For these reasons, we believe we are better positioned than some key competitors to weather short-term challenges.\n\nAs a leader in home fitness, we are buoyed by the strong long-term market opportunity. Through our first quarter, we continue to see evidence that post-pandemic exercise habits favoring home fitness are here to stay. Pre-pandemic about 40% of people for whom fitness is important worked out at home. Even as more people headed back to the gym, that number is close to 70%, and it has now held steady for over 15 months.\n\nConsumers have adopted a hybrid model for fitness, similar to what they've done for work locations. In our new target consumer segment, which we call enthusiastic cross-trainers, the importance of home workout is even more pronounced with nearly 90% of them working out at home. They are building home gyms with multiple modalities and are becoming more brand loyal. Despite some possible pull-forward sales over the last two years, we believe the 27% growth in our direct channel compared to pre-pandemic levels further supports this data.\n\nLet me now give you some more color on JRNY. A core tenet of our transformation is being consumer-led, listening to what fitness consumers are asking for and providing them with leading cardio and strength equipment, combined with digital connectivity to help them achieve their goals. JRNY, our digital membership platform, is being fueled by our successful equipment business, which bears much of the cost of customer acquisitions and provide the funds to improve and scale JRNY, which we believe will elevate the long-term operating margins of the company. While we just completed year one of our transformation, and though we are still learning and have work to do, I am pleased with our progress and believe we are well positioned to continue our growth.\n\nI would like to highlight a few of our key JRNY accomplishments. We've completed the launch of a full line of embedded screen cardio machines, treads, bikes and max trainers, all running our differentiated digital platform, JRNY. JRNY must be connected to and be optimized for each modality, and in cardio, this work is behind us. Last year, we launched the SelectTech JRNY experience, making it available to millions who own these wildly popular products.\n\nAs a result, we've increased our installed base from only one JRNY-enabled product a little over two years ago to over 80% of our total units in fiscal 2023. We also offer JRNY BYOD, bring your own device, an attractive option for those who want to spend a little less on their equipment or want to use JRNY without any equipment at all, such as body weight workouts. We continue to advance the rich and differentiated feature set of JRNY. We offer a variety of different ways to work out so the consumers' fitness routine does not become boring and they stay out longer, including personalized connected fitness that suggests workouts just for you, a content library that continues to grow, the ability to stream your favorite entertainment services while being coached at the same time, and much, much more.\n\nWe have also made important improvements with the recent over-air updates to JRNY to enhance quality for better instrumentation, playback capabilities and UX improvements. Finally, we are in the process of adding automatic rep counting and form coaching to the JRNY SelectTech offering, which will incorporate the vision and motion technologies from way. We are in alpha testing now and expect to get this enhanced and highly differentiated experience more broadly to consumers in the third quarter. We continue to grow our JRNY user base with marketing and promotion.\n\nWe now include JRNY in most Bowflex advertising under the tag line Bowflex with JRNY. Bowflex brings users to JRNY and JRNY helps to modernize the Bowflex brand. We began offering 12-month trials in late September last year to scale up our member count and get feedback from a larger number of users. As those 12-month trials begin converting to pay, we will be able to share more meaningful information about churn.\n\nFor now, churn will be a factor embedded in the subscriber numbers. The advancements of JRNY are paying off, enabling us to grow JRNY members to over 360,000 as of 6/30/22. This represents 133% growth versus the same period last year. About 35%, or 127,000 of our current members are subscribers, which represents 290% growth year over year.\n\nWe are proud of our first quarter results in the face of a challenging environment and moving forward on key aspects of North Star as we continue transforming Nautilus. We believe we have also taken responsible actions as good operators that position us well to achieve our full year guidance. This approach will move our long-term strategy forward while also keeping us on path to deliver positive adjusted EBITDA in the back half of fiscal 2023. I'll now turn it over to Aina, who will give us more detail on our first quarter results and guidance for the year.\n\nAina?\n\nAina Konold -- Chief Financial Officer\n\nThank you, Jim, and good afternoon, everyone. Today, I'll be speaking to total company results for Q1, and we'll reiterate guidance for the full year. Please go to our website to view our press release and the slides accompanying this call for more information. Let me start with slide eight of the presentation, P&L results for Q1 '23.\n\nGiven the unique nature of last year's results, we will be comparing this year's results versus last year fiscal year '22 and also versus fiscal year 2020 to gauge our sales growth and overall company improvements when compared to more normalized pre-pandemic results. Net sales for the first quarter were $55 million, down 70% versus last year and up 11% versus the same quarter in '20, excluding Optane. Importantly, our direct segment grew 27% versus the same quarter in fiscal year '20. Gross profit was $7 million and gross margins were 13%, down 17 points from last year.\n\nEight points of the decline was related to increased discounting. We strategically use discounts during key holidays to drive incremental business to direct and to assist our retail partners in selling through their inventory. The level of year-over-year decline is partially driven by tough compares as Q1 last year was still supported by pandemic-driven demand. But the level of discounting has moderated when compared to last year's fitness season, Q3 and Q4 fiscal year '22.\n\nAnother eight points of the decline were related to deleveraging of logistics fixed costs, four points of the decline were related to JRNY investments, and these were partially offset by three points of improvements in other costs. Turning to operating expenses. The next few lines of the P&L have been adjusted to remove the impact of the noncash impairment we booked this quarter. Please see our press release for a reconciliation to GAAP.\n\nAdjusted operating expenses were $31 million or 57% of sales versus last year's $38 million or 20% of sales. Given the large decline in revenue, although total operating expenses were lower versus last year, they deleverage as a rate of sales. Selling and marketing expenses were down $8 million, driven by lower advertising. In Q1 '23, advertising was $5 million versus $11 million last year.\n\nVersus last year, G&A expenses were up $1 million and R&D was up $1 million, with increases in both areas driven by JRNY investments. Total JRNY opex was $7 million versus $4 million last year. Adjusted operating loss was $24 million, adjusted EBITDA loss from continuing ops was $20 million, better than our guidance of a loss of minus $22 million to minus $27 million. Turning now to liquidity and the balance sheet as of June 30.\n\nIn line with our expectations, we ended the quarter with about $44 million of liquidity, reflecting the impact of a seasonally lower revenue quarter. Cash was $9 million, debt was $37 million, and we have $35 million available for borrowing. We remain comfortable about our liquidity and our confidence stems from our decision to implement a cost structure that is more semi variable versus fixed. This structure allowed us to ramp up quickly during the height of the pandemic and now gives us the flexibility to adjust as needed.\n\nInventory was $104 million, down versus $111 million at $331 million. About 8% of our inventory was in transit and consistent with our inventory management strategy is concentrated in our best-selling SKUs. Nearly 30% of our inventory cost is in SelectTech weight, which include high NPS products like our 552 dumbells. AAR was $27 million and payables were $27 million.\n\nTurning now to fiscal '23 guidance on slide 11. We are reiterating the guidance we provided last quarter. We expect full year revenue of between $380 million and $460 million, and expect the second half to represent between 65% and 70% of full year sales. We are expecting the start of gross margin recovery in the second half and expect gross margins to be in the range of 27% to 30%, driven by key actions we've already taken to lower cost in logistics, which include lower inbound freight as we've negotiated new rates that are much lower than the swap market rates last year, lower detention and demurrage fees, lower rental costs as we plan to post one of our DCs at lease expiration this fall, and we won't be renewing leases for some of the store locations we obtained last year.\n\nAdditionally, we've negotiated lower costs for top SKUs, so new incoming inventory will have a lower cost base. And lastly, while our guidance includes room for discounts to be competitive during the upcoming fitness season, our better inventory position reduces some of the pressure relative to last year. Given higher sales in the second half, improved gross margins and our continued cost discipline to align variable costs in line with sales, we continue to expect positive adjusted EBITDA for the second half of fiscal '23 and we expect full year adjusted EBITDA loss of between negative $25 million and negative $35 million. Lastly, we expect JRNY members to cross the half-billion mark at year-end '23.\n\nLet me now turn it over to Jim for final comments.\n\nJim Barr -- Chief Executive Officer\n\nThank you, Lina. All things considered, I am pleased with our start to fiscal 2023. We will continue to monitor and react with agility to any changes in the consumer mindset and retail inventory levels as we navigate through the year. I am very proud of our people for all we have achieved, and believe we are very well positioned to continue to leverage all the investments and strength of our platform with higher margins and improving cash flow beginning in the second quarter.\n\nSo let me end by thanking all of our employees and our partners for their tireless dedication in support of our mission. I'd now like to open it up for questions. Operator?\n\nOperator\n\n[Operator instructions] The first question comes from Steve Dyer of Craig-Hallum. Please go ahead.\n\nSteve Dyer -- Craig-Hallum Capital Group -- Analyst\n\nThanks. Good afternoon, Jim And Aina.\n\nJim Barr -- Chief Executive Officer\n\nHi, Steve.\n\nSteve Dyer -- Craig-Hallum Capital Group -- Analyst\n\nA couple of questions as it relates to the retail channel. Wondering if the number of doors that you're in is trending in one direction or another. Obviously, everybody and their brother wanted to sell the equipment during COVID. But wondering if you're seeing that remain pretty steady here.\n\nAre you seeing some retailers may be exiting the category or the product? And then, I guess, secondly, what is your sense of inventory at the retail channel?\n\nJim Barr -- Chief Executive Officer\n\nSure. Great question, Steve. We have not seen any change, and it's been very steady in the number of doors. It's really just the inventory levels that we're dealing with.\n\nAnd then we have really even better ways to monitor not only sell-through, but also inventory levels by SKU, by retailer and we manage that very closely. We actively manage it with them, right? It's not like we just leave them alone. Their problem is our problem. And until we move through that.\n\nThey're not going to be reordering as they normally do. So we help them with promotional consideration. That comes across in some of our margins that you saw here. But we continue to move through that.\n\nAnd even, as I said, we're starting to see a bit of -- we saw a slight increase in retail backlog. So you've seen some orders, and it looks -- it continues to trend positively. That said, it really just matters how quickly these folks can really move through the inventory. Obviously, it's seasonal.\n\nSo we expect this momentum to increase as we get closer to fitness season.\n\nSteve Dyer -- Craig-Hallum Capital Group -- Analyst\n\nGot it. That's very helpful. And then as it relates to JRNY, I was going to ask about additional metrics, but I missed what you had said about churn and how you're going to communicate that.\n\nJim Barr -- Chief Executive Officer\n\nYes. As you know, this has been kind of a journey for us, pun intended, where we have been giving more and more guidance and metrics as we go along. So we started last quarter with some more of those. We're just holding to that set of metrics.\n\nThe churn one, in particular, will be more meaningful once we start turning those 12-month trials that we began in late September last year into paid. So then you'll really see churn be a meaningful number. Right now, it's not meaningful, so we're not providing it for competitive reasons. But we'll continue to expand the set of metrics that we provide so that investors have a good transparency into how that business is doing.\n\nSteve Dyer -- Craig-Hallum Capital Group -- Analyst\n\nGot it. And I just want to make sure I'm hearing the verbiage right. As it relates to EBITDA positive in the second half, are you intending to say at some point in the second half, so at least one quarter, are you saying for the totality of the second half of the year, you will be EBITDA positive?\n\nAina Konold -- Chief Financial Officer\n\nHi, Steve. It's Aina. For the totality of the second half, so the second half period, two quarters together, adjusted EBITDA positive.\n\nSteve Dyer -- Craig-Hallum Capital Group -- Analyst\n\nGot it. That's what I thought. OK. I'll turn it over.\n\nThank you.\n\nJim Barr -- Chief Executive Officer\n\nThanks, Steve.\n\nOperator\n\nThe next question comes from Mark Smith of Lake Street. Please go ahead.\n\nMark Smith -- Lake Street Capital Markets -- Analyst\n\nHey, guys. Just wonder if you can dig a little deeper into kind of the promotional environment and sales during the quarter. And just do you feel like at retail that you worked through kind of aged inventory, and kind of your comfort level with the retail inventory.\n\nJim Barr -- Chief Executive Officer\n\nYes. Our inventory overall, like I said, they still have elevated levels of inventory, but we have been working through them, and we have been actively managing it with them so that we provide promotional dollars to move that through. We still believe that there is a permanent shift in fitness habits that help us. We continue to see demand.\n\nWhen they ran promotions, they sold through equipment. Same thing with us. And honestly, in this environment, that's not a given, right? Seeing that when you give a good deal, people are still buying even in the very, very low season where they can't really even use it yet, right? They would be buying it for the indoor season for the most part. So that's actually been quite good.\n\nWe have really close relationships with retailers. As I said previously, the number of doors we're selling through are all very strong, not retreating in any way. And we just continue to monitor that. And I'll also say it's also very helpful to be an omnichannel company, right? So when retail channel is a bit tough, we can go with the rat and you see the growth we got in direct.\n\nAnd we did it in a very coordinated way. It's not like we ran a sale to undercut them because that really would not be a good result. We coordinate very well with them. Jay McGregor runs both direct and retail now, and he coordinates those things extremely well.\n\nAnd I don't know if you have any follow-up questions on that, but that's -- hopefully, I answered your question.\n\nMark Smith -- Lake Street Capital Markets -- Analyst\n\nNo, that's helpful. And as we look at product mix, can you talk about at all -- and I know it might be tough competitively, but the mix of the products that are maybe new in the last 18, 24 months. And then as we kind of look forward, how do you see your R&D and development cycle on new products, maybe new product launches over the next few quarters?\n\nJim Barr -- Chief Executive Officer\n\nI'll take the -- why don't you start?\n\nAina Konold -- Chief Financial Officer\n\nSo I'll start with -- we talked about the installed base for JRNY has gotten bigger. So that's showing you that people are attracted to the newer products that we've launched, starting with the new embedded screens. They like the products are connectable to JRNY. So more of our units sold are shifting to that.\n\nSo that's the newer product. And then I'll give it back to Jim to talk about future products.\n\nJim Barr -- Chief Executive Officer\n\nSure. We are not announcing any product rollouts just yet for competitive reasons. We do expect to have some in the back half on the cardio side. We're also shifting our focus to strength as well.\n\nFor sure, you'll see the BYOD strength offering I mentioned with way that will be out, and that will be a really cool differentiated experience using our dumbbells. You could use someone else's dumbbells as well. But I think that's going to be a really good one with rep counting and form coaching. I think that's going to be a big driver for us this year.\n\nAnd other than that, we're going to save our announcements for a later date.\n\nMark Smith -- Lake Street Capital Markets -- Analyst\n\nOK. The last question for me is just kind of modeling question. As we look at selling and marketing expense, obviously, advertising down during the quarter, what's kind of your outlook there, especially as we enter kind of the key selling season?\n\nAina Konold -- Chief Financial Officer\n\nWhat we want to do is concentrate our spend with the best ROI. So in Q1, we showed that selling and marketing expenses went down because we knew it was going to be a seasonally low quarter. Most of our expectation for revenues in the back half, 65% to 70%, so we want to support that with advertising.\n\nMark Smith -- Lake Street Capital Markets -- Analyst\n\nOK. Thank you.\n\nJim Barr -- Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] The next question comes from Michael Swartz of Truist. Please go ahead.\n\nMichael Swartz -- Truist Securities -- Analyst\n\nHey, guys. Good afternoon. Maybe first question for Aina. Just you know that freight input costs have been a big drag for the past 12 months or so, and then, obviously, in the freight side, paying spot rates was a pretty significant headwind.\n\nI think you said in your prepared remarks, you expect that to improve year over year, but not quite be back to what you were paying in 2019. I guess, first, did I hear that right? And then, two, is there any way to think about maybe the magnitude of that improvement on a year-over-year basis embedded in the guidance?\n\nAina Konold -- Chief Financial Officer\n\nOK. So yes, it's not going to go back to 2019 levels. I think that's not what our negotiated rates are, but our supply chain team, if there's an opportunity to further drive it down, they'll go after it. On a year-over-year basis, a lot of what's driving that gross margin rate improvement from where we are now to 27% to 30% in the back half is driven by reduction in some of these input costs.\n\nMichael Swartz -- Truist Securities -- Analyst\n\nOK. Got you. And then just maybe talking about the -- touching on the retail environment, and I think, Jim, you said you're kind of positive view of consumers reacting to promotion. But does that leave you to believe that you will need to promote at a higher level to get that consumer response? I know it's a very small quarter for sales and fitness equipment.\n\nBut, I guess, that train your thinking around consumer demand near term.\n\nJim Barr -- Chief Executive Officer\n\nYes. As you said, it's early and it's kind of tough to call that. I mean if you listen to other retail -- if you listen to retailers' calls, they're all saying promotions will start earlier. You hear Black Friday starting in early October, for example.\n\nThat's the earliest any of us remember. So it's tough to tell. When you have a driven macro here, that is quite possible that it will take some promotion. And we have some promotion built into our numbers and our guidance.\n\nAgain, that's built in there. And then the comment that are some positive things that we have relative to supply chain. And we have really strong line of sight. These are things we actively manage to get those margins back closer in line to where we want them to be.\n\nAnd so you have a little -- we probably have a little bit of tension there. But we have promotion built into our back half assumptions.\n\nMichael Swartz -- Truist Securities -- Analyst\n\nOK. That's helpful. And then just a final question, if I may. Just with your third-party credit partners, can you provide any maybe insight into the health of the consumer or any trends you're seeing on the -- maybe the lending or the credit side right now?\n\nAina Konold -- Chief Financial Officer\n\nSo our third-party partner is Synchrony. And what's been happening in the last several quarters is a lot of consumers have been paying with their own credit cards, so not really taking as much advantage of the financing options that we've given them. That said, we haven't seen anything in the quarter that just ended that was different than what we saw in the previous several quarters.\n\nMichael Swartz -- Truist Securities -- Analyst\n\nOK. OK. Great. Thank you.\n\nOperator\n\nThe next question comes from JP Wollam of ROTH Capital Partners. Please go ahead.\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nHi, guys. Thanks for taking my question. If we can maybe one quarter -- another quarter in, in reiterated revenue guidance, if you could maybe just talk to, given the higher split in the back half of the year this year, kind of what's giving you the confidence still as another quarter and that we can kind of meet those numbers? Is it conversations with retailers? Is it what you're seeing from consumers on the direct channel? What kind of steps are the team taking? Could you just talk to that, please?\n\nJim Barr -- Chief Executive Officer\n\nThat's a fantastic question. Maybe I'll start with the top line, and I'll ask Aina to talk about our cost and margins and SG&A. So first, we still see this kind of long-term opportunity that's elevated in connected fitness and fitness in general, home fitness relative to pre-pandemic. So that is a good long-term trend and we hope to see parts of that in the back half as we hit fitness season.\n\nBut really more than that, we did find out that when we do have a good deal and a promotion on what we're selling, that we were able to move product. And that, again, is even off season, so you would expect that unless something radically changes that you've continued to see the normal seasonality going into the fitness season. We did see a bit of retail increased backlog. So that means we're getting some orders already, which is a good sign, a good positive sign.\n\nIt's encouraging. And then we just kind of look at, are we -- relative to competition, how are we set up -- and relative to sell a durable good in a value-driven economy, how are we set up? And first, we start with our well-known brands. We're known for value. That's what we get a lot of credit for.\n\nAnd then we have a wide range of cardio and strength products at various price points. And then finally, we've got that total cost of ownership advantage when you assume -- when you look at the digital experience and the physical experience together. So consumers do look at that, and so those are encouraging things. I did mention a little bit in the retail segment, we began to move some of that inventory, and we're helping them to move that inventory.\n\nAnd it'll -- we'll be able to read a little bit -- well, considerably better as we -- next time we're talking. But so far, what we've seen is encouraging, and the things that I mentioned kind of lead us to believe that this is still going to be a really a decent second half. So Aina, maybe you can hit the cost.\n\nAina Konold -- Chief Financial Officer\n\nSo Jim talked about the top line guidance. And then when it comes to the bottom line guidance, we feel confident in the reiteration of our guidance because of three things. Like we've removed cost from the system versus last year. So specific costs, we called them out in the prepared remarks.\n\nThose dollars are not repeating as cost. Then product cost, the actual cost of the high-performing fees that we're bringing in, we've negotiated lower costs, and commodity and FX prices are moving our way versus last year. And then we're going to continue exhibiting the tight financial cost control that we showed in Q1. We're going to make sure -- even though the top line revenue guidance is pretty wide, we will make sure that we keep costs in line with top line, and we feel confident we can deliver the bottom line.\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nGreat. Thank you. And then just my kind of piggyback on the last question about the discounting. But has -- the  nature of discounting in the quarter in really helping drive sales, does it have you thinking at all differently about kind of baseline prices for some of your offerings? I know you touched on kind of how much promotional activity there will be going forward.\n\nBut anything just on pricing in general?\n\nJim Barr -- Chief Executive Officer\n\nSure. I'll just remind everyone that we did take some price increases on key items fairly recently. And so we did try to build in kind of the impacts of inflation on input costs there. So we did raise those.\n\nIn terms of promotions, I think the environment is -- it changed a bit. Like when you saw the fourth quarter, it was -- we had to discount for a whole lot of the fourth quarter last year. When we hit this first quarter, it was really episodic, where we go back and forth between regular price, same thing with the retailers between regular price and the discount, but all around holidays. And those holidays seem to matter.\n\nSo we sort of -- we learned about that as well. Aina, anything you would add?\n\nAina Konold -- Chief Financial Officer\n\nNo, I just want to reiterate that in Q1, the level of discounting sequentially versus Q4 and Q3 is better. So it's just -- you can see them in the numbers that Jim is talking about.\n\nJim Barr -- Chief Executive Officer\n\nAnd we'll continue to see where the macro environment is and where that point is and where our competitors are. We do have flexibility to promote in our guidance, and we'll use that if we need to. We also have -- while we have line of sight of many of the cost components and supply chain, we also probably have some hope on commodity prices. So far, steel prices are going our way, FX is going our way.\n\nMost of our strategy isn't hope, but there are some hope elements on top of the very decisive actions we've taken in the supply chain.\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nGreat. Thank you. And then one quick last one, and you may not want to touch on it yet as it pertains to JRNY. But just kind of relative to your expectations on the paying subscriber side, positive, negative.\n\nI know we are rolling still off some of the 12-month trials, but anything you want to touch on there.\n\nJim Barr -- Chief Executive Officer\n\nNo, it's on pace, and really, most of the work is ahead of us, right, because we started those 12-month trials late September. So you'll see the first of it there, and we have a plan to go after those people and turn them in to pay subscribers. You'll start to kind of see this over the next couple of quarters. I think we'll be able to see a lot more of it, but pretty much exactly how we would have thought about it and planned.\n\nWe continue to really at top of the funnel, be very -- I mean, even at a low seasonal quarter, added quite a few members. So that's on track. And then further down the funnel, we'll start to see a bit more in the next couple of quarters.\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nPerfect. Really appreciate it.\n\nJim Barr -- Chief Executive Officer\n\nSure. Good questions.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Jim Barr for closing remarks.\n\nJim Barr -- Chief Executive Officer\n\nThank you to everyone on the call today for your continued support of Nautilus. We look forward to talking with you again on our second quarter fiscal year 2023 earnings call in November. Have a great rest of your day. Onwards and upwards.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Mills -- Investor Relations\n\nJim Barr -- Chief Executive Officer\n\nAina Konold -- Chief Financial Officer\n\nSteve Dyer -- Craig-Hallum Capital Group -- Analyst\n\nMark Smith -- Lake Street Capital Markets -- Analyst\n\nMichael Swartz -- Truist Securities -- Analyst\n\nJP Wollam -- ROTH Capital Partners -- Analyst\n\nMore NLS analysis\n\nAll earnings call transcripts"
}