{
  "companyName": "Bioventus Inc.",
  "companyTicker": "BVS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/bioventus-inc-bvs-q2-2022-earnings-call-transcript/",
  "content": "Bioventus Inc. (BVS)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning and welcome to the Bioventus Incorporated second quarter 2022 earnings conference call. [Operator instructions]. After today's presentation, there will be an opportunity to ask questions. [Operator instructions].\n\nPlease note this event is being recorded. I would now like to turn the conference over to Dave Crawford, vice president of investor relations. Please go ahead.\n\nDave Crawford -- Vice President, Investor Relations\n\nGood morning, everyone. And thanks for joining us. It's my pleasure to welcome you to the Bioventus 2022 second quarter earnings conference call. With me this morning is Ken Reali, CEO; and Mark Singleton, senior vice president and CFO.\n\nKen will begin his remarks with a review of the second quarter highlights and his thoughts on the current market environment. He will conclude his remarks with an update on the progress on our 2022 priorities. Mark will then provide further detail on our second quarter results and recent financing for our CartiHeal acquisition before concluding with an update on our full year financial guidance. We will finish the call with Q&A.\n\nA presentation for today's call is available on the Investors section of our website, bioventus.com. Before we begin, I would like to remind everyone that our remarks today may contain forward-looking statements that are based on the current expectations of management and involve inherent risks and uncertainties that could cause actual results to differ materially from those indicated, including the risks and uncertainties described in the company's filings with the SEC, including Item 1A risk factors of the company's Form 10-K for the year ended December 31, 2021, as well as our most recent 10-Q filed with the SEC. You are cautioned not to place undue reliance upon any forward-looking statements, which speak only as of the date made. Although it may voluntarily do so from time to time, the company undertakes no commitment to update and revise the forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable securities laws.\n\nThis call will also include references to certain financial measures that are not calculated in accordance with generally accepted accounting principles or GAAP. We generally refer to these as non-GAAP financial measures. Important disclosures about and definitions and reconciliations of those non-GAAP financial measures to the most comparable measures calculated and presented in accordance with GAAP are available in the earnings press release on the investor relations portion of our website at bioventus.com. Now I'll turn the call over to Ken.\n\nKen Reali -- Chief Executive Officer\n\nThanks, Dave. Good morning, everyone. And thank you for your interest in Bioventus. As we move into the second half of the year, we look to build on a meaningful progress the Bioventus team has made toward accomplishing the goals we laid out in January.\n\nA few of our successes to date include closing the financing and acquisition of CartiHeal, completing the integration of Bioness and materially progressing on the integration of Misonix and positioning ourselves to achieve double-digit organic growth for the year by leveraging our technology-leading medical devices, our significant commercial organization and improving market access with expanded reimbursement and preferred coverage agreements across our verticals. We are extremely proud of the way that our entire organization continues to drive toward achieving our goals and strengthening our long-term outlook. And we are looking forward to continuing to build on our momentum in the second half of the year. We are pleased to report that throughout the second quarter, we saw a steady recovery across our surgical solutions vertical, which was impacted by the more acute hospital staffing shortages and omicron-related challenges we faced in the prior quarter.\n\nMark will discuss our guidance shortly, but we believe hospital volumes will continue to trend toward a normal environment in the second half of the year.  We believe the foundation and diversification of our business and end markets will remain strong despite the increased potential for economic challenges in the coming months. Over half of our product portfolio is sourced to enable fixed gross margins allowing us to have a strong and consistent gross margin despite the inflationary headwinds impacting the global economy. In addition, in past recessionary environments, we have not experienced significant business interruptions. Still, we are prepared to take the necessary actions to control costs in order to ensure we deliver on our EBITDA and earnings commitments while continuing to support the long-term needs of our business.\n\nMoving to our results, revenue increased 28% during the second quarter to $140 million including organic growth of 8% which positions us well to achieve double-digit growth for the year. Constant currency growth was 9%, a good performance compared to a solid comp versus 2021. Additionally, we generated strong sequential revenue and adjusted EBITDA growth. While growth was robust across our portfolio, supply chain and regulatory disruptions in our advanced rehabilitation portfolio limited our second quarter growth.\n\nGoing forward, we expect this revenue to be recognized in the second half, and thus do not expect this shift in timing to have an impact on our full year results. Across pain treatments, we saw double-digit revenue growth driven by continued market share gains by our single injection Durolane HA therapy and our three injection Gelsyn HA therapy.  As we highlighted on previous earnings calls, reimbursement for HA shifted from wholesale acquisition cost to average selling price at the end of June. Given the sales mix of our HA portfolio, this new pricing dynamic has not fundamentally impacted our overall growth opportunity. As expected, we have been able to lower our reimbursement rebate rates on all of our preferred contracts with private payers, which has offset lower pricing for other areas of our HA business.\n\nThe modifications to these agreements are consistent with our modeling exercises done over the past several months as we prepared for this new environment. Additionally, we are seeing some potential opportunities to increase our market share where a few competitors are no longer able to utilize pricing as an incentive for physicians to receive a higher reimbursement. As the only company with a portfolio of HA products across single three and five injection therapies, we have held the No. 2 share position in the HA market and continue driving toward becoming the market leader over the coming years.\n\nTurning to surgical solutions, as I mentioned our business rebounded from last quarter's macro headwinds with organic growth returning to double digits. We are encouraged by the sequential improvement that we generated throughout the quarter and continue to experience strong momentum thus far in the third quarter. We also saw a similar recovery in our Misonix bone scalpel during the quarter. Restorative therapy revenue generated double digit growth bolstered by the inclusion of our Misonix wound business.\n\nAs I mentioned earlier, growth was limited in our advanced rehabilitation business due to supply chain issues impacting our domestic business as well as backorders for international customers as we await regulatory certifications related to the new European medical device regulation or MDR process. The domestic supply chain issues have been resolved early in the third quarter, and we are back to fulfilling orders and eliminating our backorders. We expect to receive MDR certification in the third quarter so that international revenue will be back online in the fourth quarter. Finally, our international segment grew 26% on a reported basis driven by our Misonix's acquisition and constant currency growth was 1% primarily driven by continued strength in Durolane.\n\nThe regulatory challenges related to our advanced rehabilitation portfolio are expected to continue into the third quarter, but we anticipate recapturing most of this revenue in the fourth quarter.  As a result, we expect to see organic growth trend below normal in the third quarter, but then trend above normal in the fourth quarter for our international business. Finally, given the current geographic mix of our business, we do not anticipate the recent movement in foreign exchange rates to have a material impact on our revenue. Our international business continues to be a low double-digit percentage of our total revenue. Now I'd like to update you on our 2022 priorities.\n\nAs highlighted earlier, we are off to a great start to the year and remain focused on our execution across our key priorities for 2022. Our first priority is to achieve double-digit organic growth for the year through our technology-leading medical devices and the continued strong execution of our commercial organization. While we fell just short of that for the quarter, we made significant progress across some of our key growth areas. In pain treatments, we solidified market access for our HA business by reaching a three-year extension on our UnitedHealth contract where Durolane remains the exclusive single injection product and Gelsyn continues to be one  of two products for three injection therapy.\n\nIn addition, our two-year contract with Cigna, which we announced in May for Durolane and Gelsyn also became effective at the start of the third quarter. Within surgical solutions, OSTEOAMP flowable, our injectable L graft bone grafts substitute solution continues growing rapidly since its introduction last year. As a great example of the innovation being infused into our portfolio, over the past three years we have launched several new products, including OSTEOAMP flowable, which now represents close to 60% of our bone graft substitutes revenue enabling us to grow our market share. Also in surgical solutions, we received 510k clearance for SonaStar Elite in late July.\n\nSonaStar Elite represents the newest handpiece for our Nexus ultrasonic surgical systems platform, and it will deliver best-in-class and significantly more power, versatility and control and the removal of hard and soft tissue in multiple surgical specialties, including specifically neurosurgery. This creates a large market expansion opportunity for Bioventus. We plan to commence a limited market release in the fourth quarter. Our second priority is to complete the integrations of our recent acquisitions while delivering on our cost synergy commitments and leveraging our enhanced scale to accelerate revenue growth.\n\nWe continue to drive progress on that front, and we remain on track for the integration of Misonix to be completed next year and to deliver at least $20 million in cost synergies by the end of 2023. Besides the realization of cost synergies, our combined commercial teams continue to leverage our enhanced scale and customer relationships to accelerate sales growth and cross-selling opportunities. Additionally, last week, we gathered all our U.S. direct sales representatives, over 500 reps in total together for the first time since the acquisitions of Bioness and Misonix for a summer sales conference.\n\nThe conference enabled us to further cross-train our sales representatives on the new products in their verticals and hear firsthand from their colleagues on effective sales techniques. We expect this meeting to be a significant springboard to further increase momentum in the second half of the year as we unleash broader cross-selling efforts within our entire sales force after piloting multiple initiatives earlier this year.  Our third and final priority for the year was recently completed with the closing of the acquisition of CartiHeal, which we believe is a revolutionary and game-changing device for multitudes of patients suffering from knee osteoarthritis and osteochondral defects. As a reminder, it received FDA breakthrough device designation in December of 2020 and FDA PMA approval in late March of this year. CartiHeal has significant potential with a $1.3 billion total addressable market.\n\nIt is also supported by significant clinical data used for PMA approval as evidenced by the robust data generated from its pivotal clinical trial demonstrating superiority to microfracture and debridement procedures. The completed clinical trial is the largest cartilage repair trial undertaken to date and we expect that we published in a peer-reviewed medical journal by next year. The addition of CartiHeal complements our joint preservation technologies and specifically our HA business and customer base, further supporting our growth drivers and helping us deliver on our goal of sustained double-digit revenue growth. Our restructured agreement not only enabled us to finance the acquisition, but also aligns future milestone payments with value creation that unlocks the full potential of CartiHeal.\n\nWe will continue to compile clinical evidence and expect multiple articles to be submitted for publication in medical journals over the next few years to support reimbursement coverage and coding. In the coming months, as we launch CartiHeal, we will work with our surgeon customers to ensure that each case is preauthorized to build its reimbursement profile. As we progress on the market development plan, we will update you as we achieve the key value-driving milestones for CartiHeal. Lastly, given the increase in debt to finance the CartiHeal transaction, including future milestone payments, we intend to pause on future M&A activity until we return to our targeted range of net debt-to-adjusted EBITDA of three to four times.\n\nWe expect to achieve this goal by the end of 2023, primarily through EBITDA growth, driven by double-digit revenue growth and margin expansion as well as free cash flow generation.  In conclusion, we continue to build momentum as we execute on our growth strategy and we have further bolstered our growth potential with the acquisition of CartiHeal. With the acquisition behind us, our second half focus will be on achieving our other priorities and financial commitments for the year. I remain confident we will deliver on cost synergies from our acquisitions and enhance our growth profile by leveraging our technology-leading medical devices, scale and commercial infrastructure to deliver consistent double-digit growth. Now I'll turn the call over to Mark.\n\nMark Singleton -- Senior Vice President and Chief Executive Officer\n\nThanks Ken, and good morning, everyone. Let me begin with a review of our second quarter results. Revenue of $140 million increased 28% compared to the prior year. We saw an 8 percentage point increase from organic revenue along with a 20 percentage point increase related to our acquisition of Misonix.\n\nWe were able to deliver revenue and within our plan via multiple growth drivers despite the supply chain and regulatory challenges in our advanced rehabilitation portfolio that Ken highlighted earlier. Our sales performance drove adjusted EBITDA of $23 million. As expected, we saw a strong sequential momentum for both revenue and adjusted EBITDA. Across pain treatments, we grew organically 13% driven primarily by Durolane and Gelsyn as they continue to capture market share across the single and three injection therapy markets respectively.\n\nIn surgical solutions, we grew 77%. We saw 17 percentage points of organic growth across our bone graft substitutes, which rebounded from the prior quarter's impact from delays in elective procedures due to omicron and hospital staffing. The second quarter included a 60 percentage point contribution from Misonix's surgical portfolio, which also showed a strong sequential acceleration. As Ken mentioned, we believe hospital volumes will continue to trend toward a normal environment in the second half of the year.\n\nFinally, across restorative therapies, we delivered 23% growth. Revenue of Misonix's wound products contributed 28 percentage points. Organic growth was impacted by a few million dollars related to disruptions in our advanced rehabilitation portfolio. These issues are expected to be resolved in the second half of the year, which should contribute additional growth.\n\nMoving down the income statement adjusted gross margin of 77% was up 30 basis points compared to the prior year. Overall, adjusted operating expenses increased $19 million, driven primarily by costs related to Misonix when compared to the prior year. Now turning to our bottom line financial metrics. Adjusted EBITDA totaled $23 million compared to $20 million in the prior year.\n\nIncreased revenue was offset by higher operating costs related to the acquisition of Misonix. Adjusted operating income increased to $18 million from $14 million in the prior year. Adjusted net income totaled $8 million, compared to $5 million a year ago, and we earned $0.10 of adjusted diluted earnings per share. Now turning to the balance sheet and cash flow statement, We ended the quarter with $41 million of cash on hand and $374 million of debt outstanding, which included a $25 million draw on our revolving credit facility at the end of the second quarter.\n\nOperating cash flow represented an inflow of $3 million for the quarter. As we projected on our last earnings call, we saw a sequential improvement in cash flow and continue to expect operating cash flow to accelerate in the second half of the year as EBITDA increases and we see improvement in working capital. Before moving to updated guidance, let me discuss the financing to facilitate the closing of our CartiHeal acquisition. As Ken highlighted, we recently completed the financing, and we took into consideration several factors in implementing our new capital structure.\n\nFirst, it was important that we maintain the ability to pay down a portion of our debt without breakage costs in order to delever. Second, we sought to manage interest rate exposure and volatility by increasing the percentage of fixed rate debt. Third, given that CartiHeal is a midterm growth driver, we sought to minimize the need to refinance our capital structure in the near term. As Ken highlighted, we modified our purchase agreement and established five milestone payments totaling $215 million over the next several years tied to key deliverables that will unlock the full market potential of CartiHeal.\n\nThe first two milestones, each of which are $50 million will be paid no later than the end of the third quarter next year. The next two milestones, each of which are $25 million will be paid by the end of 2024 and 2025, respectively. With the final milestone of $65 million to be paid by the end of 2026. These payments will accrue interest at 8% until payment of each milestone occurs.\n\nInterest on the balance of milestone payments will be paid annually on the anniversary of the acquisition closing with any additional accrued interest to be paid at the time of the milestone payments. We have also increased our existing Term A bank loan by $80 million to raise the necessary funds at close and repay the draw on our revolver, providing liquidity for next year's milestone payments. The amended Term A loan has a balance of approximately $430 million, composed of the lowest cost of debt available while providing us the ability to prepay without penalty. In addition, we retained a $50 million revolving credit facility, which is now undrawn after the closing of the amended term loan.\n\nFollowing the completion of our financing for the CartiHeal acquisition, our secured net leverage ratio has peaked at just above four times. Over the coming quarters, we expect our leverage to gradually decline, though we anticipate reaching a similar leverage ratio following the payment of the second milestone. From that point, we expect our leverage to decline considerably given our expectation for EBITDA and cash flow growth. And by the end of 2023, we anticipate that our secured net debt-to-EBITDA ratio will be below 3.5 times.\n\nFinally, let me provide an update to our 2022 guidance. With six months completed and based on our current trends in our business, we are narrowing the range of our net sales guidance. We now expect revenue to be in the range of $547.5 million to $562.5 million compared to our previously issued guidance range of $545 million to $565 million. The guidance includes both Bioness and Misonix and the midpoint is unchanged, reflecting double-digit organic growth for the year.\n\nWith the closing of the CartiHeal and the inclusion of spending related to its launch and ongoing clinical study, we are slightly lowering the high end of our adjusted EBITDA guidance. Adjusted EBITDA is now expected to be in the range of $94 million to $104 million, compared to our previously issued guidance of a range of $94 million to $107 million. In addition, with the completed financing for CartiHeal in place, we are now providing full year 2022 adjusted diluted earnings per share guidance of a range of $0.47 to $0.57. This guidance incorporates interest expense accruing at 8% on the $215 million deferred purchase price beginning at the closing of the acquisition as well as the interest on the company's approximately $430 million in term loans that will accrue at SOFR plus 325 basis points.\n\nThis guidance also contemplates a full year 2022 adjusted effective tax rate in the range of 24% to 26%. In closing, we continue to execute on our growth initiatives and maintain our top line momentum as we anticipate continued increase in cash flow and EBITDA as we delever our balance sheet and prepare for future milestone payments related to CartiHeal. Operator, please open the line for questions.\n\nOperator\n\n[Operator instructions]. And our first question comes from Alex Nowak of Craig-Hallum Capital Group. Please go ahead.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nGood morning, everyone. I was hoping we could start with the organic growth guidance for the year. I think the plan is to hit double-digit organic growth. Maybe speak to the bridge to get to that range from the 8% growth today.\n\nYou mentioned the improvement of the restorative therapy supply chain, and then some of the acquisitions are in to kick in. So maybe just speak to the guide there.\n\nKen Reali -- Chief Executive Officer\n\nAlex, thanks for that question. Yes. Just as a note, we tightened the guidance, but the midpoint once again is in the double-digit range, and that's what we expect for the year. As we look at our portfolio, we had certainly headwinds in our advanced rehabilitation product area as we talked about, both supply chain domestically, which has now been cleared up, and we've started to ship on those POs here in the third quarter.\n\nAnd then with the MDR certification process in Europe, which we expect to get cleared up in the late third quarter and begin shipping those units in the fourth quarter. When we add that into the mix with our continued growth across our business, pain treatments and surgical solutions as well, the double-digit growth there. We expect to achieve double-digit growth for the year. So that bridge is pretty well defined at this point, Alex.\n\nMark Singleton -- Senior Vice President and Chief Executive Officer\n\nAnd, Alex, this is Mark, I'll just comment also that we would have been at that double-digit growth in 2Q if we didn't have the challenges on the rehabilitation side that we talked about.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nAnd then maybe speak to the rep tone and the feedback after the summer conference. Obviously, this is the first time they've all gotten together after the acquisitions, but I'd probably say even after the pandemic here. So maybe speak to what product set or acquisitions do they seem to be most synergistic to their own business? And how do they ultimately see the hospital and the physician office environment changing in the second half?\n\nKen Reali -- Chief Executive Officer\n\nYes, it was a great meeting, Alex, last week and it was the first time Bioventus has had an in-person sales meeting in two and a half years. And obviously, with the acquisitions of Bioness and Misonix and now CartiHeal, it was a very exciting meeting. It allowed us to network our sales reps across the geographies. A lot of the sales reps from, say, Misonix, surgical and Misonix wound as well as the Bioness rehab sales force have not met their counterparts across the Bioventus core business at all.\n\nSo it allowed us to network those, but more importantly, drive cross-training across our product areas. As we've talked about before, we're bringing our bone graft substitutes and our bone scalpel business together in one combined sales force. Of course, we've done training already, but we haven't been able to dive into as much in-person training and networking as we did last week. And then there are some other areas in our wound business that we're bringing into the office space that we've talked about and allowed us to really complete the training there.\n\nAnd we think, as I've mentioned, this will be a big springboard to further momentum. We saw great sequential growth here in the first quarter of the second quarter. We think a meeting like this and the synergies and opportunities and our combined sales force will enhance our growth going forward.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nAnd then just one more, if I could, just on the HA pricing. What have you seen in July and August here with the changes around CMS? Are you seeing HA volumes and the price that you could charge the docks relatively consistent with the first half?\n\nKen Reali -- Chief Executive Officer\n\nWell, we did see, based on ASP reporting a dip in our pricing for Durolane and Gelsyn, in particular, subparts was already ASP reported. But as we've talked about that has been countered by our rebate adjustments that per our planning, and we're very pleased with the results of this and it's a credit to our market access team. We've been able to adjust all of our rebates on our contracted business, which is a significant portion to a lower amount that net effect, Alex, negates any impact on the ASPs because we're paying less rebates on our contracted business. So as we've modeled that over the past several months that turned out exactly the way we thought it would.\n\nSo the first phase of this has gone well. I would say there could continue to be some volatility in the coming quarters as we continue to adjust to the ASP environment. But we're very pleased with what we're seeing and in fact, gaining some key competitive accounts as the playing field has been leveled. Once again, we feel very confident in our ability to continue to grab market share in the HA area.\n\nWe have the largest sales force, we have the largest portfolio of products, and we think we have the market-leading product in Durolane, our single-injection product with the highest molecular weight. So from our perspective, Alex, first phase went really well and we're optimistic as this continues to unfold.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nExcellent. Appreciate the update.\n\nOperator\n\nOur next question comes from Robbie Marcus of J.P. Morgan. Please go ahead.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nYes. Thanks for the questions. Maybe to start on first-time EPS guidance for the year. It came in a good bit below where we and the street had been forecasting, even after adjusting for the recent financing.\n\nSo maybe speak to your views on how you're considering EPS growth going forward relative to your views on growing sales and adjusted EBITDA. And part two, you talked about improving cash flow in the back part of the year. What do you think a good free cash flow conversion rate for this year and next year might be?\n\nMark Singleton -- Senior Vice President and Chief Executive Officer\n\nYes. Thanks, Robbie. This is Mark. I would say, overall, that when we think about the EPS guidance that we took on $215 million of debt that we have the interest.\n\nSo you think about the increased level of debt is going to be part of the EPS number that we're guiding to. And then also the interest rate that we have that we didn't have before. But I would just reiterate that the interest rate that we have is really good as far as what's in the market today. So we feel good about that.  And then when you look at the rest of the year, as far as EPS goes, we're going to see an increase in revenue in 3Q from 2Q, we'll see an increase in revenue in 4Q to 3Q.\n\nAnd so we're going to see the revenue drive that margins are going to come down a little bit. And then when we look at our SG&A, we have some actions in place there to lower that as we go through the year. EPS will see kind of flat from 2Q to 3Q, just as we take on the additional debt and the interest rate that we talked about. And then we would see that increase in 4Q as EBITDA increases from the step-up in revenue in 4Q.\n\nAnd I would just say -- add to the color Mark provided Robbie, philosophically our goal at Bioventus, driven by our double-digit growth in our growth in EBITDA, it's consistent growth in EPS as well as operating margin improvement. These are fundamentals of our goals and strategy at Bioventus and what the company is foundationally built on.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nGot it. Maybe I'll use my follow-up on that. Just maybe to put a finer point on it, you're growing sales and adjusted EBITDA pretty meaningfully this year, but adjusted EPS is down roughly 50% year-over-year. So I guess if the question is philosophically, how do you think about when you're doing future M&A, maybe starting up in '24 again, growing earnings relative to just the top line.\n\nThanks a lot, guys.\n\nKen Reali -- Chief Executive Officer\n\nYes, I think when we -- by the time we get to '24, we'll be in the three to three and a half times levered until we will have gotten rid of a lot of the interest expense at that point in time, the double-digit commitment that we've made. And then it's about -- as that double-digit growth, it's really about scaling the opex and the infrastructure that we have and driving that increase in operating margin over time. So it's responsible management of our expense and delivering on the growth that we've talked about.  So when we talk about M&A, we're definitely not planning to do any of that until looking at the end of 2023 at the earliest and then reevaluate our situation as we go into '24 and start to look at that again. But we feel good about our plan to get to that point in time from where we are today.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nThanks a lot.\n\nOperator\n\nOur next question comes from Drew Ranieri of Morgan Stanley. Please go ahead.\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nHi, Mark and Ken. Thanks for taking the questions. Ken, maybe just to go back to the HA component for a moment. I know we've kind of talked about this before.\n\nBut I was hoping we could maybe get a better sense of what's embedded in guidance from a volume perspective. And if you are -- I think you mentioned maybe some volatility, but are you seeing any initial signs of like surgeon preference changes or anything within the portfolio or within the HA market?\n\nKen Reali -- Chief Executive Officer\n\nYes. Drew, thanks for that question. And overall, we are very pleased with our ability to retain nearly all of our accounts in HA as we've shifted to ASP reporting. Certainly, our contracted business with United and Cigna and some of the smaller payers has helped us retained that business.\n\nWe also think that we'll continue to drive higher volume. And obviously, in this environment, the volume growth is just as important, and it's something that we watch very carefully. Certainly, there's always pockets of volatility, and we've seen that across certain geographies in the United States. But those have been negated largely by our ability to pick up competitive business.\n\nSo going forward in the second half of the year, we do see continued volume growth. This is a very healthy environment, one where more and more patients enter the funnel of osteoarthritis treatment every day, every month, and that certainly helps our business and our strong market penetration can take advantage of that. So what's built into our forecast going forward is continued volume growth in our HA business as we've seen before because we've seen no indication of impact on the volume and that's certainly something we'll take advantage of. And as I talked about in the prior question on HA, a lot of our ASP impact, all of our ASP impact has been negated by our ability to renegotiate our rebates on a contracted business, which is a significant portion and that has been true to our model and it's something that we're excited about.\n\nAt the same time, I would just caution that because this is a change and the first phase of this has gone well. We expect some volatility in the coming couple of quarters as we move forward.\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nGot it. Maybe just on MOTYS on the release that you kind of reviewed the trial and decided to step away from that. But maybe can you talk about how the strategic rationale now for making that decision? Are there other things in your portfolio that you're more excited about? I imagine CartiHeal is one of those but maybe just update us on kind of the rest of the pipeline portfolio as well like PROcuff.\n\nKen Reali -- Chief Executive Officer\n\nYes. Thanks for that question, Drew. First, let me be really clear on MOTYS. We do not know the results of the phase 2 trial that enrollment is complete but we do not know and those patients are being followed.\n\nWe won't know the results of the phase 2 trial until next year. So this decision was one that was more priority and financially driven and strategy-driven versus anything else. And as I mentioned in our press release, we'll evaluate strategic options for MOTYS once we know the results of the trial. But as we look at our portfolio and we constantly evaluate our R&D and product development portfolio, a key part of our growth strategy.\n\nWe've added a lot of things to it with the acquisitions of Bioness and Misonix and to your point, now CartiHeal, and as we look at MOTYS, the risk profile, the fact that it's not medical device development, but a biologic almost pharmaceutical life developments and the cost involved with that and going to the comment earlier on EPS growth. We decided at this point, it was best to curtail future development costs on MOTYS. But that was not an indictment on MOTYS and I want to be clear on that. We do not know the results yet of the phase 2 trial.\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nAnd just last for me on CartiHeal. As you're kind of looking at 2022, maybe what investments are you making this year on the commercial side? I mean that we've talked before about you being potentially able to leverage the existing sales force infrastructure. But anything more on your go-to-market that you can provide in 2022? Thank you for taking the questions.\n\nKen Reali -- Chief Executive Officer\n\nYes, sure, Drew. Next steps are a limited market release in the fourth quarter where we'll start doing cases in the United States. And those cases, we're going to watch carefully for two things: a, making sure we're getting very strong clinical results. So the products being used correctly; b, and making sure we're developing the preauthorization and insurance pathway.\n\nSo those are key two critical commercial activities that will be ongoing as we enter the first -- the fourth quarter and into early next year. As we look at those metrics and dial those in, we'll certainly continue to accelerate CartiHeal as it's warranted and as we see the coverage and insurance dynamics play out. The other aspect that we'll be working on is getting clinical publications. Of course, the IDE study, we expect to get published by next year.\n\nWe'll also be working on a couple of additional clinical trials.  Now these won't be randomized controlled trials, but there will be clinical trials to support reimbursement. And we're also looking at international launch of CartiHeal, particularly in Europe, where again there's a lot of interest in this technology across the board and across the world and even by a lot of patients that suffer from osteoarthritis and have an osteochondral defect. But we'll be watching this carefully and updating on our progress. We feel very good about the restructured deal as it really is staged to unlock the full market potential of CartiHeal as we move forward.\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nThanks, Ken.\n\nOperator\n\n[Operator instructions]. Our next question comes from Amit Hazan of Goldman Sachs. Please go ahead.\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nGuys, this is so long for me. Thanks for taking the questions. Following on the MOTYS point that we just left. I think I want to understand kind of the decision tree from here.\n\nSo it sounds like versus what we had thought previously, the next step would have been moving on to the phase 3 trial. So it sounds like that is being paused or deferred. Is there kind of a pathway forward here where you get positive Phase II data next year and you reconsider and decide to kind of reinstate that program? Or is the decision basically that MOTYS will not be progressing as an asset and tighter portfolio.\n\nKen Reali -- Chief Executive Officer\n\nYes. At this point, we have to follow the phase 2 results. And based on the strength of the phase 2 results, we'll evaluate our strategic options. But Bioventus will not be incurring the cost of a future phase 3 trial.\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nAnd then in your opening remarks, Ken, you talked about an expectation for market improvement to continue in the second half of the year. I imagine that, that was largely focused on the surgical solutions side of the business and the bone graft substitute end market. Can you talk about what you saw improved during 2Q and what you expect to continue to get better in the second half of the year from that standpoint?\n\nKen Reali -- Chief Executive Officer\n\nYes, good question on that. And I would say we saw improvement in the volume of cases done per surgeon and through the second quarter. And that is really hospital staffing-related. A lot of surgeons have seen on their surgery day their cases curtail from maybe where they're used to doing six or seven cases in a day down to three to four.\n\nAnd a lot of that is hospital staffing where they don't have the staff, the ancillary staff to turn the room quickly. We saw that improve through the quarter and continued in the third quarter, as mentioned on the call. So we expect that to continue. The type of surgeries that we do with both our bone graft substitutes as well as our bone scalpel are highly profitable, spinal fusions and decompressions.\n\nAnd this is something that is a priority for hospitals to get those procedures done and get as much of their volume back as possible. So there's an incentive there that I think is driving hospitals to get the staffing back in place to do as many of these cases as possible. So we do see this accelerating as we go through the third and fourth quarter in this particular area that we live in. And again, this is 25% of our revenue, very specific to spinal fusion and decompression, which is where the bone scalpel as well as our bone graft substitutes are utilized.\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nIf I could sneak just one more in. Previously talked about indication expansion on the Exogen side through the bone study. I was wondering if you could give an update on where the metatarsal indication. And then I think you were working on another indication as well, I think, on the scalpel side.\n\nSo if you could just give us an update there, that would be very helpful. Thanks.\n\nKen Reali -- Chief Executive Officer\n\nYes. That is continuing. And you're right, both metatarsal scaphoid as well as tibia are studies that are underway and ongoing with Exogen. We don't have an update at this time, but we should have an update as we progress here in the next quarter or two.\n\nOperator\n\nThis concludes our question-and-answer session. I would now like to turn the conference back over to Mr. Ken Reali, CEO, for any closing remarks.\n\nKen Reali -- Chief Executive Officer\n\nWell, thanks, everyone, for your continued interest in Bioventus. We are off to a strong start in the first half of the year, and we are well-positioned to deliver on our 2022 priorities in the second half. We are excited to add CartiHeal to our portfolio and will provide updates as key milestones are achieved. We look forward to further accelerating our momentum across our short- and midterm growth drivers to sustain double-digit organic growth, expand margins and create stakeholder value through our enhanced portfolio and synergies from our recent acquisitions.\n\nThank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDave Crawford -- Vice President, Investor Relations\n\nKen Reali -- Chief Executive Officer\n\nMark Singleton -- Senior Vice President and Chief Executive Officer\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nDrew Ranieri -- Morgan Stanley -- Analyst\n\nAmit Hazan -- Goldman Sachs -- Analyst\n\nMore BVS analysis\n\nAll earnings call transcripts"
}