{
  "companyName": "Vertex Pharmaceuticals",
  "companyTicker": "VRTX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/vertex-pharmaceuticals-vrtx-q3-2022-earnings-call/",
  "content": "Vertex Pharmaceuticals (VRTX -0.10%)\nQ3 2022 Earnings Call\nOct 27, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Vertex Pharmaceuticals third quarter 2022 earnings call. All participants will be in a listen-only mode. [Operator instructions] After today's presentation, there will be an opportunity to ask questions. [Operator instructions] Please note this event is being recorded.\n\nI would now like to turn the conference over to Ms. Susie Lisa. Please go ahead, ma'am.\n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nGood evening, all. My name is Susie Lisa, and I'm thrilled to have joined Vertex as the new senior vice president of investor relations. Welcome to our third quarter 2022 financial results conference call. On tonight's call, making prepared remarks, we have Dr.\n\nReshma Kewalramani, Vertex's CEO and president; Stuart Arbuckle, chief operating officer; and Charlie Wagner, chief financial officer. We recommend that you access the webcast slides as you listen to this call. The call is being recorded, and a replay will be available on our website. We will make forward-looking statements on this call that are subject to the risks and uncertainties discussed in detail in today's press release and in our filings with the Securities and Exchange Commission.\n\nThese statements, including, without limitation, those regarding Vertex's marketed cystic fibrosis medicines, our pipeline, and Vertex's future financial performance are based on management's current assumptions. Actual outcomes and events could differ materially. I would also note that select financial results and guidance that we will review on the call this evening are presented on a non-GAAP basis. I will now turn the call over to Reshma. \n\nReshma Kewalramani -- Chief Executive Officer and President\n\nThanks, Susie. We're delighted to have you on board. Good evening, all, and thank you for joining us on the call today. Vertex continues to execute exceptionally well and make significant progress toward our goals of: one, reaching all patients with cystic fibrosis resulting in strong sustainable growth; two, advancing our diverse mid- and late-stage clinical pipeline to develop transformative medicines in multiple disease areas; three, preparing for our next commercial launches; and four, progressing the next wave of innovation toward the clinic.\n\nIn the third quarter, global CF product revenues increased 18% year on year to $2.3 billion as more patients initiated treatment with our CFTR modulators. Based on the strong performance, we are raising full year 2022 product revenue guidance from $8.6 billion to $8.8 billion to $8.8 billion to $8.9 billion. Despite the growing numbers of CF patients on CFTR modulators, we still have many more patients to reach. And as you will hear from Stuart, we are working with focus and urgency to reach all patients around the globe who may benefit from our therapies.\n\nAs previously discussed, we are at an important inflection point for the company. Each of our clinical stage programs, sickle cell disease and beta-thalassemia, acute pain, AMKD, type 1 diabetes and AATD is a first-in-class or best-in-class approach that holds the promise to transform the disease, and each represents a multibillion-dollar opportunity. With a uniquely strong and durable CF franchise, a broad and deep R&D pipeline with multiple potentially near-term commercial opportunities, a strong balance sheet, and the capacity to invest in both internal and external innovation and deeply talented people, Vertex is well-positioned to deliver for patients and shareholders for years to come. With that overview, I'll turn to the details of recent R&D progress, starting with CF.\n\nTRIKAFTA sets a very high bar in terms of safety and efficacy in the registrational trials, as well as in real world and long-term studies. That said, if it is possible to develop even more effective medicines for CF patients, we are determined to be the company that does so. Our next-in-class triple combination, VX-121/tezacaftor/VX-561, holds that potential. The triple now referred to as vanzacaftor, tezacaftor, deutivacaftor or the vanzacaftor triple is progressing rapidly through phase 3 development with our studies in patients ages 12 and older, now projected to complete enrollment this year.\n\nAs a reminder, this combination demonstrated greater activity in our human bronchial epithelial assay versus TRIKAFTA and greater clinical benefit in phase 2 than we have seen with any of our prior medicines. Additionally, it offers the convenience of once-daily dosing and royalties in the low single digits versus low double digits for TRIKAFTA. For the 5,000 patients who do not make any CFTR protein, we're working on an mRNA therapy with our partners at Moderna. We have completed IND-enabling studies, and we remain on track to submit an IND for this program this quarter with clinical trials starting thereafter, and we're not done.\n\nOur work continues to identify even better potential therapies that could bring more patients with CF to carrier levels of sweat chloride. Turning to exa-cel, previously known as CTX001, our gene editing program for severe sickle cell disease and transfusion-dependent beta-thalassemia, or TDT. This is our most advanced program outside CF, and we expect exa-cel to be our next commercial launch. In June, we presented data from 75 patients with up to 37 months of follow-up from our pivotal trials of exa-cel.\n\nThe data demonstrated exa-cel's potential to provide a one-time functional cure for these patients. Last month, we announced that in addition to having granted virtually all available U.S. regulatory designations, the FDA has now also granted exa-cel a rolling review. We plan to begin our BLA submissions for both sickle cell disease and beta-thalassemia in the U.S.\n\nnext month and complete the submissions by the end of the first quarter of 2023. In Europe, we previously shared that we reached an agreement on the filing package with the EMEA and MHRA in the EU and U.K., respectively. We remain on track to submit these MAAs by the end of this year. Our teams are intensely focused on preparing these multiple complex submissions with three separate regulatory agencies in order to bring exa-cel to patients as quickly as possible.\n\nGiven that priority, we will not be sharing new clinical data at ASH, but instead, look forward to sharing updated clinical data in the first half of 2023. Exa-cel holds the promise for a one-time curative therapy for thousands of patients with severe sickle cell disease and transfusion-dependent beta-thalassemia. This therapy, potentially the first CRISPR-based gene editing treatment to be commercialized for patients with a genetic disease also represents a near-term and significant market opportunity. Turning to VX-548 and our pain program.\n\nVX-548 is a novel selective NaV1.8 inhibitor that offers the potential of highly effective pain relief without the side effects or addictive potential of opioids. NaV1.8 is both a genetically and pharmacologically validated target. Recall that VX-150, an earlier-generation NaV1.8 inhibitor, demonstrated positive proof of concept in acute, neuropathic and musculoskeletal pain. VX-548 has been studied in two phase 2 placebo-controlled acute pain studies and showed statistically significant and clinically meaningful pain relief compared to placebo and was generally well tolerated.\n\nThe study also included an opioid reference arm to support the evaluation of VX-548. With regard to the regulatory status, VX-548 has been granted fast track and breakthrough therapy designation in the U.S. We reached agreement with the FDA on the design of the phase 3 program in support of a broad label in moderate to severe acute pain and recently initiated the pivotal studies. The phase 3 development plan for VX-548 in acute pain consists of two randomized controlled trials.\n\nThe design of the RCTs in the pivotal program is very similar to our phase 2 completed studies, same pain states, post bunionectomy and post abdominoplasty. Same treatment duration, 48 hours, and the same primary endpoint, the sum of pain intensity difference, or SPID, over 48 hours of VX-548 compared to placebo. A third single-arm study rounds out the phase 3 program. This study will enroll patients with multiple other types of moderate to severe acute pain with a treatment period of up to 14 days.\n\nGiven our experience in executing these types of trials efficiently, the short treatment duration, and the high unmet need for effective pain relief without the significant side effects or addictive potential of opioids, we view VX-548 as a near-term and significant market opportunity. We also plan to study VX-548 in neuropathic pain and remain on track to initiate a phase 2 dose-ranging proof-of-concept study in patients with painful diabetic neuropathy toward the end of this year. Moving to inaxaplin or VX-147, the first potential medicine to treat the underlying cause of APOL1-mediated kidney disease, or AMKD. Inaxiplin has breakthrough therapy designation in the U.S.\n\nand both prime and orphan drug designation in Europe. Inaxaplin is being studied in a single adaptive, randomized, double-blind, placebo-controlled, phase 2/3 pivotal trial and the primary endpoint is a reduction in the rate of decline of kidney function in patients treated with inaxaplin on top of standard of care compared to standard of care for approximately two years. Importantly, the trial is a preplanned interim analysis at 48 weeks of treatment, which if positive, could serve as the basis for accelerated approval in the U.S. This study is underway in enrolling patients.\n\nWe now have more than 50 sites open for enrollment in the U.S. and internationally with a goal to open more than 150 sites in total. We look forward to updating you on the enrollment and study progress as the trial advances. Next, moving on to type 1 diabetes.\n\nWe have been advancing three programs in our portfolio. First, VX-880, our stem cell-derived, fully differentiated insulin-producing islet cell replacement therapy, which is a mid-stage clinical development. In this program, we use standard immunosuppressive therapy to protect the cells from the immune system. These same cells are the foundation for our other two programs in type 1 diabetes.\n\nNext, the cells plus device program, which encapsulates these fully differentiated islet cells in a proprietary device that shields the cells from the body's immune system and does not require immunosuppressants. We remain on track to file the IND for this program by the end of this year. Lastly, in our hypoimmune cells program, which is in preclinical development, we are editing the same fully differentiated insulin-producing islet cells to cloak them from the immune system, obviating the need for immunosuppressants. Earlier this year, we achieved proof of concept for VX-880 in type 1 diabetes with the first two patients dosed at half dose in Part A of the study.\n\nPart B of the study, which uses the full target dose is underway and enrolling patients. The type 1 diabetes program holds enormous potential. There are more than 2.5 million patients in the U.S. and EU alone with type 1 diabetes who may benefit from a treatment with the potential to provide glucose control without the fear of hypoglycemia or the need for insulin.\n\nWe look forward to sharing additional data from more patients and longer duration of follow-up at the appropriate time. A last word on our type 1 diabetes program. Having recently closed the acquisition of Viacyte, I want to extend a warm welcome to our Viacyte colleagues. Let me close with our Alpha-1 antitrypsin deficiency, or AATD program.\n\nEarlier this month, we announced that the IND for VX-634, the first in a series of next wave AAT correctors has cleared, and VX-634 has entered first-in-human clinical trials. We also announced that a 48-week phase 2 study of VX-864, our first-generation AAT corrector will soon initiate. This study will assess the impact of longer-term treatment on polymer clearance from the liver, as well as on serum levels of functional AAT. With those R&D highlights, I'll hand it over to Stuart for a review of our commercial progress.\n\nStuart Arbuckle -- Chief Operating Officer\n\nThanks, Reshma. I am pleased to review tonight our continued strong performance in CF, as well as the multiple near-term commercial opportunities we see across our business, including the strong outlook in CF, significant progress made to prepare for the commercial launch of exa-cel and our view of the promising role of VX-548 in helping treat pain. Starting with CF. In the U.S., our focus is to maintain the very high persistence and compliance we have seen with our therapies and to extend the benefits of therapy to younger age groups.\n\nOutside the U.S., we have seen rapid growth driven by the uptake of KAFTRIO/TRIKAFTA in countries with recent reimbursement agreements. We've also seen strong uptake of KAFTRIO in children ages six to 11 in countries where this indication has reimbursed access. Today, our medicines are approved and reimbursed in more than 30 countries, benefiting tens of thousands of cystic fibrosis patients on five continents. However, there are still thousands of CF patients who are not yet on treatment.\n\nThese patients fall primarily into the following categories: one, patients in countries where we are early on the launch curve, such as those with recently achieved reimbursement agreements or label extensions for younger patients; two, patients in younger age groups for whom we continue to pursue label and reimbursement extensions; and three, to a lesser extent, patients awaiting reimbursement for our medicines in a small number of countries. We are confident that we will reach the vast majority of these patients over time, which will drive continued revenue growth in the near and long term. We continue to make excellent progress in expanding the label for our CFTR modulators to younger age groups. In September, ORKAMBI was approved for children ages 12 months to less than 24 months in the U.S.\n\nWe expect to file for U.S. FDA approval of KALYDECO in children ages one month to less than four months before the end of 2022. Similarly, we will submit to the U.S. and other global regulatory authorities for approval of TRIKAFTA in children two to five years old by the end of the year.\n\nFinally, in CF, as Reshma mentioned, our CFTR mRNA program is progressing toward an IND submission this year. This program targets the underlying cause of disease in approximately 5,000 CF patients worldwide. Beyond CF, we have a broad, diverse and advanced R&D pipeline. I will focus my comments on our commercial readiness efforts and the market opportunity for our potential next product launches, exa-cel and VX-548.\n\nExa-cel holds curative potential for patients with sickle cell disease and transfusion-dependent beta-thalassemia, and we are making significant progress with launch preparation activities. Treatment with exa-cel is a process that takes months from start to finish, and we fully recognize both the significant opportunities and challenges in offering such a novel, potentially curative therapy for patients. We are creating the infrastructure and support required for physicians and patients that we believe will lead to commercial success upon potential regulatory approvals. Our commercial and medical science liaison field teams are hired and trained in the U.S.\n\nThese teams have been actively engaging with key treatment centers, policymakers, and payers and similar efforts are ongoing in Europe. Our initial launch of exa-cel will focus on the estimated 32,000 patients in the U.S. and Europe with severe forms of sickle cell disease and beta-thalassemia. Roughly 25,000 of these 32,000 patients are severe sickle cell disease patients, the vast majority of whom reside in the U.S.\n\nThese patients are highly concentrated in certain geographies. And thus, we believe they can be served effectively with a network of approximately 50 qualified authorized treatment centers in the U.S. and approximately 25 in Europe. By way of context, we reached the vast majority of CF patients in the U.S.\n\nby calling on approximately 250 CF treatment centers. These centers have the medical and technical expertise to support the potential future use of exa-cel. Our field teams are already engaging with these centers on the needed administrative and logistical capabilities, as well as the treatment capacity to support the launch. We've been encouraged by the early interest and engagement from the centers and their staff.\n\nIn parallel to engaging with these treatment centers, we have been working closely with policymakers and with payers to ensure that these stakeholders understand the significant burden of these diseases. Payment models are an important consideration, given the value that a one-time potentially curative therapy like exa-cel can bring to patients and the healthcare system. We are continuing to work with various stakeholders to ensure patients who may be eligible for exa-cel have access to this potentially curative therapy. Turning to pain.\n\nWe believe that VX-548 has the potential to play an important role across the pain spectrum, including an acute, neuropathic, and musculoskeletal pain. With the recent initiation of the VX-548 phase 3 program and the short treatment period in these trials, acute pain is now an exciting potential near-term commercial opportunity. I'll focus my remarks around three key aspects, critical to framing the acute pain market for Vertex. One, the opportunity is significant, given the market today for acute pain in the U.S.\n\nis $4 billion, even though 90% of prescriptions are generic; two, prescribing is concentrated in the hospital setting and thus addressable with a specialty commercial infrastructure that fits the Vertex model; and three, there is a significant gap in the market for safe and effective treatment options for physicians and patients. Firstly, despite 90% generic penetration, the U.S. market is approximately $4 billion and patients received some 1.5 billion treatment days annually for the oral treatment of acute pain, a highly effective and well-tolerated new class of medicine, therefore, has multibillion-dollar potential. Secondly, roughly two-thirds or $1 billion of these treatment days are driven by hospital prescribing following inpatient or outpatient procedures such as surgeries or emergency room visits.\n\nThis includes the prescriptions written and filled in hospital during the patient's stay and those written at discharge to provide the patient with a multi-day course of medicine for ongoing pain management. Given the concentration of pain treatment that is driven by hospital prescribing, we believe we can reach a large proportion of this market with a specialty sales and marketing infrastructure. And a third key consideration of this marketplace is the significant side effects of opioid therapy. Overdose deaths from opioids have continued to rise in the U.S.\n\nand opioid prescribing for the treatment of acute pain has been a clear contributing factor to the opioid epidemic. In response, hospitals, physicians, and state agencies throughout the U.S. have limited or attempted to reduce the use of opioids for the treatment of acute pain. Many states, as well as large hospital systems, such as Kaiser Permanente and John Hopkins Medicine, have enacted strict measures to reduce opioid prescribing.\n\nIn addition, beyond the addictive potential, opioids have other negative side effects, including nausea, somnolence, constipation and can result in increased length of hospital stay until these problems resolve. These concerns and limitations with opioids create a significant gap in the market for the treatment of acute pain because of the lack of safe and effective treatment options for doctors and patients. Therefore, availability of a therapy like VX-548, a novel, highly effective, non-opioid treatment that does not have the addictive potential of opioids nor the significant side effect profile would be an extremely valuable new treatment option and could be used as the next step in a treatment strategy after prescription NSAIDs, relegating opioids to being used only as a last resort. I look forward to updating you further on our commercialization plans in pain, including our view of the opportunity in neuropathic pain over the coming months.\n\nIn closing, I'm excited about the opportunity to extend the benefits of our CF medicines to more and more patients around the globe and with the near-term potential to commercialize multiple transformative treatments for patients with serious diseases outside of CF. I will now turn the call over to Charlie to review the financials.\n\nCharlie Wagner -- Chief Financial Officer\n\nThanks, Stuart. Vertex's third quarter and year-to-date 2022 results set us on pace for another year of exceptional financial performance and strong execution. Third quarter 2022 revenue increased 18% year over year to $2.3 billion, led by 46% growth outside the U.S. on continued strong uptake of TRIKAFTA/KAFTRIO in markets with recently achieved reimbursement, as well as label extensions into younger age groups.\n\nU.S. CF revenue was up 5% with ongoing consistent performance aided by penetration into younger age groups. During the third quarter, CF revenue growth also benefited from an approximately $75 million increase in channel inventory in certain markets. We do not expect these purchases to recur in the fourth quarter, and this quarterly phasing is reflected in our updated full year guidance.\n\nThird quarter 2022 combined non-GAAP R&D, acquired IP R&D and SG&A expenses were $758 million, an increase of 29% compared to the third quarter of 2021. Throughout 2022, we have continued to invest in our R&D pipeline, which now includes seven programs, five of which are in pivotal development. The year-over-year increase in Q3 reflects stepped-up investments in these programs, notably pain, the new vanzacaftor triple in mRNA and CF and type 1 diabetes, as well as the continued pre-commercial build-out activities for exa-cel. Looking forward, we expect to continue to invest in research and our clinical stage pipeline, as well as in commercial readiness activities for programs with near-term significant commercial potential, including exa-cel and VX-548 for pain.\n\nWe also remain committed to augmenting our internal research efforts with external innovation aligned with our R&D strategy. Third quarter 2022 non-GAAP operating margin was 55%. We generated non-GAAP operating income of $1.3 billion in the quarter, an increase of 11% versus the prior-year period. Our non-GAAP effective tax rate in the third quarter of 2022 was 21%.\n\nWe ended the quarter with $9.8 billion in cash and investments as our cash flow generation and balance sheet remain very strong. On the business development front, we closed the previously announced acquisition of ViaCyte for $320 million in cash, and integration activities are underway. Now switching to guidance. We are increasing our 2022 CF product revenue guidance by $150 million at the midpoint to a new range of $8.8 billion to $8.9 billion.\n\nThe increase reflects the strong uptake of TRIKAFTA/KAFTRIO in markets with recent reimbursement agreements and continued performance in the U.S. At the midpoint, the increased guidance represents full year 2022 revenue growth of approximately 17% versus 2021 and will mark Vertex's 8th consecutive year of double-digit revenue growth. There is no change to our projected 2022 combined non-GAAP R&D, acquired IP R&D, and SG&A expense range of $3 billion to $3.1 billion. There is also no change to our full year non-GAAP effective tax rate guidance range of 21% to 22%.\n\nFinally, a comment on movements in foreign exchange. The impact of the significant strengthening of the U.S. dollar versus the euro and other currencies since the start of the year is partially mitigated by our foreign exchange risk management program. For the full year 2022, at current rates, we estimate that changes in foreign exchange, net of program effects will have a negative impact of approximately 1% on our revenue growth, and this is reflected in our updated revenue guidance range for the year.\n\nIn closing, Vertex is performing exceptionally well despite the challenging macroeconomic climate. For the remainder of 2022 and into 2023, we look forward to further important milestones to mark our continued progress as highlighted on this slide. As Reshma noted, over the past year, Vertex has seen a significant acceleration in our R&D pipeline, and we are well on our way to diversifying the company and adding to our long-term growth profile. As always, we look forward to updating you on our progress on future calls.\n\nLet me turn the call back to Susie to begin the question-and-answer period. \n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nThanks, Charlie. Chuck, will you begin the queue, please?\n\nOperator\n\nYes, ma'am. We will now begin the question-and-answer session. [Operator instructions] And at this time, we'll pause momentarily to assemble our roster. And the first question will come from Michael Yee with Jefferies.\n\nPlease go ahead.\n\nUnknown speaker\n\nHi, this is Dennis on for Mike. Congrats on the progress in the quarter. Can you just please remind us the status of the ongoing diabetes phase 1, VX-880. And if we will get updated data this year? And if you can comment on where that will be great.\n\nAnd regarding the device program, is that something that we can see initial data in 2023? And like how should we think about the level of data disclosure for that program, given you only disclosed a single patient's worth of beta for VX-880? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nHey, thanks very much for that. Your question is about our type 1 diabetes program. And just to ground everyone, there are actually three programs within our type 1 diabetes portfolio. The first is VX-880, and that one is actually in phase 1/2.\n\nSo, it's a program that's already in patients. That's the program in which we've already achieved proof of concept based on the first two patients treated, importantly with half the targeted dose. That program is now continuing. We are enrolling and dosing patients at the full targeted dose and we do expect to share data next year at the appropriate conference or venue.\n\nThe second program in that portfolio is the cells plus device program. That program has its IND on track for later this year. With regard to what you should expect from that in terms of data disclosures and when we might be able to see data, I would think about the type 1 diabetes programs, whether it's cells alone or cells plus device closer to CTX001 and less similar to our small molecule programs. And what I mean by that is we go right into patients and with a reasonably small number of patients because you're right into patients with this potentially one-time curative therapy, we can tell a lot about the treatment effect and the emerging profile.\n\nSo it's a little bit too early to comment on exactly when we'll see data, but I would think about the program closer to CTX than to small molecules. And then lastly, just to round up the type 1 diabetes program, the third vertical or the third pillar in that program is the same exa-cel, these VX-880 cells that have already demonstrated benefit in the clinic, we are editing those cells in order to cloak them from the immune system, and that would allow us to not have to use immunosuppressants.\n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nNext question, please, Chuck.\n\nOperator\n\nThe next question will come from Mohit Bansal with Wells Fargo. Please go ahead.\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks for taking my question and congrats and welcome to Susie Lisa from my side as well. So maybe one question on the FEV benefit with these potentiators and correctors that you can extract the maximum benefit. And there was one expert who mentioned that probably at 14 percentage point improvement in TRIKAFTA, we are getting to the higher end there and maybe at 3, 4 percentage points more, you could be getting to a plateau of what is the maximum you can achieve with this kind of therapies.\n\nSo, assuming that next-generation combo does get there, do you think -- do you agree with that statement that this is probably the maximum you can get to with these kinds of therapies? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nYeah. Hey, Mohit, thanks for the kind words. Your question is about CFTR modulators in general? And what can we expect in terms of benefit? Let me just blow out that question a little bit more and broaden it. When you think about the benefit of CFTR modulators, it's important to realize that CF, as a disease, is a systemic disease.\n\nSo, the only manifestation is not the lung. It is a very prominent manifestation, but it's not the only manifestation. So, what do I mean by that? CF patients also have difficulty with liver disease. They also have difficulty with endocrine and exocrine pancreatic disease, and you know about the difficulty in gaining weight, gaining height and living a high-quality life in the absence of CFTR modulators.\n\nSo, the real benefit of CFTR modulators, and we've seen this with KALYDECO to start with all the way up to TRIKAFTA, is certainly an improvement in lung function. And the way we measure that acutely is indeed ppFEV1. Now your specific question is, is 14%, which is what TRIKAFTA achieved, is that the max? And I think the jury is still out on what the maximum ppFEV1 benefit could be. But I will tell you that the next in-class combination, that's the VX-121, tezacaftor, 561 combination.\n\nIn the phase 2 study, it had search in populations get up to 20% in benefits. So, I think the jury is still out, and we have the next wave of molecules to look forward to. And just to close out the benefits, there are some abstracts coming out at NACFC that include data from TRIKAFTA and some of our other CFTR modulators. And it's really encouraging to see that this benefit on ppFEV1 also translates to benefit in terms of mortality, lung transplantation, hospitalizations, and pulmonary exacerbations.\n\nThank you.\n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nNext question, please, Chuck.\n\nOperator\n\nThe next question will come from Salveen Richter with Goldman Sachs. Please go ahead.\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nGood afternoon. Thanks for taking my questions. Just two for me here. One on the type 1 diabetes program.\n\nCan you help us understand how that fully protects the cells from the immune system, but simultaneously maintains the integrity of the cells while in the device? And then secondly, you have about $10 billion in cash here. And so, if you aren't -- and I guess your thoughts here, but if you aren't going to do value-creating business development, should we expect you to start to return that via stock buybacks or look to issue a dividend? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nHey, thanks, Salveen. Let me start with the type 1 diabetes question, and I'll just frame the capital allocation question, and I'll ask Charlie to give you more details. On the type 1 diabetes program and the cells plus device combination, we have worked long and hard and all credit to the Semma team that worked on this even prior to the acquisition. There has been a long history of trying to use devices in this context and the traditional trouble that people have won into are the following: one, sufficient oxygenation and nutrients for the cells; two, prevent a foreign body reaction; and three, to have the cells protected where the nutrients and oxygen can get in, but not the immune cells and also to ensure that the sensing of glucose and the release of insulin can occur.\n\nThe proprietary device that we have that it will be used with the VX-880 cell has the features to account for and address those issues, namely protect the cells, but allow the flow of nutrients and oxygen. Two, in all of our preclinical studies, including in large animal studies, we see no foreign body reaction. And three, to have the ability to sense glucose and release insulin. I will say, Salveen, the most challenging part of the type 1 diabetes program is actually having cells that are fully differentiated, insulin-producing.\n\nAnd that part of this, we know we have gone past because of the proof-of-concept achievement in those first two patients treated at half dose. On the capital allocation question, our strategy on capital has not changed. The focus is on innovation, both internal and external. Charlie, anything you wanted to add to that?\n\nCharlie Wagner -- Chief Financial Officer\n\nNo. You said it very well. The priority continues to be an investment in innovation. I think we've been very active over the last few years and it shows.\n\nIf you look at our pipeline now, 40% of the programs in the pipeline have benefited from BD that we've done in recent years. And so, we continue to maintain an active function, looking at external innovation to support our internal efforts that will continue to be the priority. We have also maintained a share buyback program in recent years just to offset dilution, but the focus and the primary purpose is an investment in innovation.\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nThank you.\n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nThanks, Salveen. Next question, please, Chuck.\n\nOperator\n\nThe next question will come from Phil Nadeau with Cowen and Company. Please go ahead.\n\nPhil Nadeau -- Cowen and Company -- Analyst\n\nGood afternoon. Thanks for taking our questions. I wanted to ask about the inaxaplin phase 2/3 trial and specifically on the phase 2 portion of the phase 2/3. What is Vertex's most recent thinking on whether data from that phase 2 portion will be disclosed? And then maybe more generally, can you remind us what criteria by which you choose the dose that's advanced into phase 3? What measures will you be looking at to make that determination?\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nSure. Phil, the inaxaplin trial, that's the VX-147 trial in AMKD or APOL1-mediated kidney disease is the program that's the adaptive phase 2/3 study. And the criteria for dose selection, Phil, really centers around measures of efficacy seen at 12 weeks. And what that really means is proteinuria.\n\nRemember, proteinuria, we can see, change within that 12-week period. That is not possible for the change in GFR. Now the -- there is a committee that can look at the data to make that decision, that is done in the appropriate way, given the need to maintain trial integrity. But I would assume that we would share the fact that we've gotten past that important phase 2 milestone and that a dose has been selected.\n\nBut we are going to have to be careful about maintaining steady integrity, given that there are patients that are in the trial and will be continuing to the phase 3 portion.\n\nPhil Nadeau -- Cowen and Company -- Analyst\n\nThat's helpful. Thank you.\n\nOperator\n\nThe next question will come from Evan Seigerman with BMO. Please go ahead.\n\nEvan Seigerman -- BMO Capital Markets -- Analyst\n\nHey, guys. Thank you so much for taking my question and really congrats on the strong quarter. I'd love for you to provide me some more color as to what you saw with 864 to reinitiate a clinical trial with this asset. Can you also highlight why 634 might be more successful than its predecessors? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nYeah. Hey, Evan. Good afternoon. So the question is on our alpha-1 antitrypsin deficiency or AATD program.\n\nAnd let me take one-half step back and remind everyone why we are so interested in this disease. So AATD fits the VERTEX strategy, our R&D strategy like a glove. It is a disease where we understand the causal human biology. We have a validated target, and we also have a biomarker that translates from bench to bedside.\n\nThere are about 100,000 people in Europe and the U.S. who have this disease. And by the way, it happens to be a pulmonary disease that is a disease of protein misfolding, something we know a little bit about given our work in cystic fibrosis. So that's why this disease just fits us perfectly.\n\nWhat we saw with the VX-864 phase 2 trial, now 864 is the first-generation corrector for AAT is, for the first time, a small molecule was able to raise functional AAT levels. That has never been demonstrated before. And in the exploratory analysis, we were also able to see more than 90% reduction in serum polymer levels. When we put that all together, here's where we are.\n\nOne approach that we're taking and we're taking both these approaches in parallel is to bring forward more potent medicines than 864. That is the VX-634. It's multifold, more potent. It has better drug-like properties, and it has initiated its phase 1 study.\n\nAnd in parallel, we're also advancing VX-864 because we have chronic tox coverage to study this molecule in a longer-term study. And in a longer-term study, we can assess liver clearance of polymer. This goes back to the serum polymer clearance that we saw. So we're looking for liver polymer clearance and the long-term impact on functional AAT.\n\nWe're driving both of these programs forward in parallel. And I don't know, maybe around this time next year, we'll have the data that we need to assess which molecule or molecules should advance further. So that's really where we are with the AATD program.\n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nNext, please.\n\nOperator\n\nThe next question will come from David Risinger with SVB Securities. Please go ahead.\n\nDavid Risinger -- SVB Securities LLC -- Analyst\n\nThanks very much. And let me add my congrats on the results as well, particularly given the speculation today in the markets. So my question is regarding VX-548 and my take is that the product's opportunity in chronic pain is clearly tremendous since patients cannot be administered opioids long term, but could you help us understand your review of the acute market opportunity in the context of DRG codes and hospital system sensitivity? Basically, the question is, will hospitals replace inexpensive generic drugs in patients who are not likely to be at risk of opioid addiction if they're prescribed opioids for less than a week unless, of course, they have a preexisting addiction issue? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nDavid, I'm going to ask Stuart to tackle the question on acute pain, and I'll come back and just say a word on chronic pain. Stuart?\n\nStuart Arbuckle -- Chief Operating Officer\n\nYes. So, thanks for the question, David. Yes. So, in terms of the market for acute pain, as I said in my prepared remarks, we do see this as a very significant opportunity for a number of reasons: one, the treatment of acute pain today is a very sizable market.\n\nI referenced the fact that there's 1.5 billion treatment days a year, and much of that is concentrated in the hospital environment despite the fact that the market is over 90% generic, as you referenced, is a $4 billion market today. So, the real question is, what is the unmet need here? And the unmet need is actually very, very significant. In contrast to your comments, actually, the acute use of opioids is a very prominent and well-recognized contributor to the opioid epidemic. And as a result of that, there have been significant constraints put in place on the use of opioids in many states and in many hospital systems.\n\nAnd that has substantially reduced the use of opioids. However, what hasn't gone away is moderate to severe acute pain for those patients. And so, there is a significant gap left in the marketplace for something that provides effective pain relief, but without the addictive potential and other side effects of opioids. So, in the hospital setting, both in terms of the inpatient stay, which is probably on average two, three, four days, something like that, we think there's a substantial unmet medical need.\n\nAnd then obviously, those patients are discharged with a multi-day prescription for ongoing pain management, which they then fill in the retail setting. So overall, we're very, very excited both about the profile of the VX-548, but also the opportunity to make a real difference in the treatment of acute pain. And then Reshma, back to you on chronic.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nYeah. David, I agree with you on the opportunity in chronic pain in addition to a very substantial opportunity in acute pain. And the reason for the opportunity in chronic pain is twofold. One is what you indicated around not wanting to use opioids over a chronic period, frankly, not wanting to use opioids even over an acute period.\n\nBut second, opioids are actually not very good at all in terms of efficacy in the chronic setting and sort of -- for example, in neuropathic pain. And I just wanted to close by letting you know that the phase 2 dose-ranging study of VX-548 in diabetic neuropathic pain, we'll also initiate this quarter. And we have high confidence for this one, not only because of the genetic validation of the target but because of the pharmacological validation on neuropathic pain with the predecessor molecule, VX-150.\n\nDavid Risinger -- SVB Securities LLC -- Analyst\n\nThank you.\n\nOperator\n\nThe next question will come from Robyn Karnauskas with Truist Securities. Please go ahead.\n\nKripa Devarakonda -- Truist Securities -- Analyst\n\nHey, guys. Thank you for taking our question. This is Kripa on for Robyn. I just had one question on the AAT program.\n\nWhen do you think you can move from the phase 1 into phase 2 trial? How long do you think it will take to do the healthy volunteer study? And you previously talked about how you can maybe do really short trials to see activity. Given what you're doing with VX-864, has that thinking changed in any way? And another question on the mRNA program in CF. You said that IND will go in later this year. What's the earliest you see going into the clinic? Is there -- given that this is a new modality, is there any reason to anticipate delays for the IND acceptance? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nSure. So, two separate questions in there. One about the mRNA program in cystic fibrosis and then about AAT. So let me tackle mRNA in cystic fibrosis first.\n\nSo the approach here is to use an mRNA inhaled therapy for those 5,000 or so patients who don't make any CFTR protein and therefore, cannot benefit from CFTR modulators. The IND-enabling studies are complete. The IND will go in this year. And you're right, it is a more complex product than a small molecule.\n\nAnd in the grand scheme of things, we've only been working on nucleic acid therapies and cell therapies for the last, let's say, five to eight years, whereas we've been working on small molecules for many decades. That all being said, CF is a very serious life-shortening disease. And I do think that all parties invested are motivated to make sure that medicines that could bring benefit to patients rapidly. Of course, we'll be able to update you on the progress in future calls.\n\nBut I'm very pleased with the progress, and I'm pleased to see that we're on track with the IND to go in this year. On the AAT program, we are doing two things in parallel: one is advancing VX-634 into the first-in-human study; and two, studying VX-864 for a longer duration of time. And we're doing this in parallel because we can, that is to say, we have sufficient toxicology coverage to study VX-864 over an extended period. And I do think you need that extended period to evaluate liver clearance for this mechanism.\n\nBut in terms of the first -- in humans, you've seen our track record, we tend to move at a good clip, I would say, let's say, around this time next year or so, we'll have the data from our first-in-human studies with 634, we'll have our data from the phase 2 longer-term study. And I fully expect more molecules behind 634 to enter the clinic. So, I feel really good about where we are, and we're executing on the strategy of serial innovation and having a portfolio approach exactly as I would like in all of our programs, but particularly in AAT.\n\nKripa Devarakonda -- Truist Securities -- Analyst\n\nThank you so much.\n\nOperator\n\nThe next question will come from Jessica Fye with J.P. Morgan. Please go ahead.\n\nJessica Fye -- J.P. Morgan -- Analyst\n\nHey there. Thanks for taking my question. Nice results tonight. Following up on an earlier question.\n\nJust to make sure I understand, are you generating this longer-term data with 864 to evaluate liver polymer clearance just to sort of further derisk 634, which has better drug-like properties? And then second, with the trials in patients age 12 and up for new triple complete enrollment by year-end, can you set expectations for when we should expect top-line data factoring in any analysis time that might be required? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nYeah. Jessica, on the new triple combination, the vanzacaftor triple combination, that's 121-561 tezacaftor, we do project enrollment in that program, both studies in 12 plus will complete before the end of this year. As a reminder, these studies are one year in duration. So, we will have all of the dosing complete at some point next year.\n\nAnd it does take a little bit of time, but we're pretty quick with closing out the study and having results thereafter. But the important point to know is that's a one-year treatment duration. With regard to the 864 program and AATD, what are we really trying to accomplish there? Here's the important thing to keep in mind. With 864, what we saw for the first time ever with a small molecule corrector is increases in functional AAT level.\n\nThe magnitude of the treatment effect was insufficient for us to move that to phase 3, but that gave us proof of biological activity. The reason we want to study 864 for polymer clearance in the liver is because that post hoc analysis of phase 2 showed us a 90% decrease in serum polymer levels, leading us to believe that longer-term treatment would indeed lead to clearance of the liver. That's the hypothesis we're testing there. And we're also going to evaluate where the longer-term treatment leads to elevations in functional AAT.\n\nIf you're asking, is it possible that 864 is a molecule that moves forward into later stages of development based on this longer-term treatment? Yes, that's possible. Is it possible that VX-634 is the molecule we select because it's more potent and has better drug-like properties? Yes, that's possible. And that's why we're running both these programs in parallel. Ultimately, maybe the most important thing to take away is that the small molecule approach to this disease AATD is the only approach that holds the potential to treat both the liver and lung manifestations of this disease.\n\nAnd this pathway that we've drawn out allows us to assess both of those in parallel.\n\nJessica Fye -- J.P. Morgan -- Analyst\n\nThanks.\n\nOperator\n\nYour next question will come from Geoff Meacham with Bank of America. Please go ahead.\n\nUnknown speaker\n\nThis is Joe on for Geoff. I had a question on exa-cel. Can you walk us through how we should be thinking about the eventual commercial rollout? And after filing in the EU and the U.S., what is the rough timeline for first revenue? Should we be thinking late 2023? Or is that more early 2024? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nSure. Let me start with where we are today and the immediate next milestones that we're working toward. And then I'm going to ask Stuart to comment on the prelaunch activities. So, we are intensely focused on getting our filings in for the EU, the U.K., and the U.S.\n\nWe are on track to start the rolling submission in the U.S. next month in November, and we're on track for our EU and U.K. submissions to complete by the end of this year. Stuart, do you want to talk a little bit about our prelaunch activities from there?\n\nStuart Arbuckle -- Chief Operating Officer\n\nYeah, John, so much of our prelaunch activities is focused in two areas: one is with policymakers and payers, and the other one is with the authorized treatment centers who would be the ones who would be actually administering exa-cel with payers and policymakers. As you can imagine, a lot of this is about making sure that the right conditions are in place so that patients can get as early as possible access to exa-cel pending, obviously, regulatory approval. This is a disease of significant unmet need that's well recognized by the payer and policymaker community. And so, the discussions we've been having with them have been really very productive and fruitful.\n\nOn the authorized treatment center side, it really is identifying authorized treatment centers, which are close to where patients are concentrated. And patients are concentrated in relatively discrete geographies in about 25 states here in the U.S. where about 90% of the patients are located. In the EU, about 75% of patients are in four countries, the U.K., France, Italy, and Germany.\n\nAnd so, we're looking at the potential to establish treatment centers, about 50 or so here in the U.S., about 25 or so in those four countries in Europe, which we think could serve the vast majority of patients, as I say, pending regulatory approval. Again, our engagement with the centers has been very positive. They're clearly very excited about the prospect of something like exa-cel, which has the potential to provide a one-time functional cure to their patients.\n\nUnknown speaker\n\nGreat. Thanks a lot.\n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nI think we have time for one more, please.\n\nOperator\n\nThe next question will come from Colin Bristow with UBS. Please go ahead.\n\nUnknown speaker\n\nHi, this is [Inaudible] on for Colin. Thanks for taking our question and congrats on the strong quarter and pipeline progress. So, we have two questions. The first one is on your CF-based business.\n\nSo how do you believe the competitive threat from AbbVie's latest triple with tezacaftor just appeared on the clinicaltrials.gov? And the second question is on the CRISPR-based DMD therapy. So, you have already noted the IND filing will be next year. So, when do you think we could see the first clinical data for the program? Would you consider, for example, like release in the single patient data as you have already done with the VX-880 program for diabetes? Thank you.\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nThere are two questions in there. One on CF and one on DMD. Let me take the DMD question first. So, to give everyone a little bit of a quick backgrounder.\n\nRecall that our approach to DMD is different than most of the approaches out there, which focus on microdystrophin. Our approach is an in vivo gene editing approach that is centered on exon skipping and producing full length, if not near full-length dystrophin. And the reason we believe in this approach is because of the human genetics that we see. So, for example, Becker's muscular dystrophy where patients have near full-length dystrophin, that disease is a much, much milder form of DMD.\n\nThe microdystrophin approach simply doesn't have that kind of human genetics behind it. I'm really pleased with the progress of the program. We are in our IND-enabling studies now. We expect to finish those up and file our IND next year.\n\nThere was a question in there about when you could expect data really a little bit too early to call, but I would think about this program in that cell and gene space, so with a reasonably small number of patients over a reasonable amount of time, very similar to CTX001, very similar to the type 1 diabetes program, we're going to know where we are. On the CF business, we've talked about this many times in the past, TRIKAFTA has set an enormously high bar. It can treat up to 90% of patients with this disease. We have already advanced the next program.\n\nThis is the vanzacaftor program. It's going to complete phase 3 enrollment this year. If it is possible -- and it is a tall order, but if it is possible to be better than TRIKAFTA, the vanzacaftor triple program holds that potential. It has better chloride transport than TRIKAFTA in our human bronchial epithelial assays and in phase 2 studies.\n\nWe have to do some cross-study comparisons. But in phase 2 studies, it looks like it is potentially even better than TRIKAFTA. And we are now on the brink of bringing the mRNA therapy for the first time having a therapy for the last 5,000 patients with CF. We've never had more patients benefit from our CFTR modulators and we've never been in this position of being right on the cup of having something for all patients.\n\nI like our hand, and I'm looking forward to sharing more data.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Ms. Susie Lisa for any closing remarks. Please go ahead.\n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nThank you, Chuck, and thanks very much, everyone, for their questions. We look forward to taking your follow-up and meeting with you soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSusie Lisa -- Senior Vice President of Investor Relations\n\nReshma Kewalramani -- Chief Executive Officer and President\n\nStuart Arbuckle -- Chief Operating Officer\n\nCharlie Wagner -- Chief Financial Officer\n\nUnknown speaker\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nPhil Nadeau -- Cowen and Company -- Analyst\n\nEvan Seigerman -- BMO Capital Markets -- Analyst\n\nDavid Risinger -- SVB Securities LLC -- Analyst\n\nKripa Devarakonda -- Truist Securities -- Analyst\n\nJessica Fye -- J.P. Morgan -- Analyst\n\nMore VRTX analysis\n\nAll earnings call transcripts"
}