{
  "companyName": "Visa",
  "companyTicker": "V",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/visa-v-q4-2022-earnings-call-transcript/",
  "content": "Visa (V -0.14%)\nQ4 2022 Earnings Call\nOct 25, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to Visa's fiscal fourth quarter and full year 2022 earnings conference call. All participants are in a listen-only mode until the question-and-answer session. Today's conference is being recorded. If you have any objections, you may disconnect at this time.\n\nI would now like to turn the call over to your host, Ms. Jennifer Como, senior vice president and global head of investor relations. Ms. Como, you may begin.\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nThanks, Holly. Good afternoon, everyone, and welcome to Visa's fiscal fourth quarter and full year 2022 earnings call. Joining us today are Al Kelly, Visa's chairman and chief executive officer; and Vasant Prabhu, Visa's vice chair and chief financial officer. This call is being webcast on the investor relations section of our website at www.investor.visa.com.\n\nA replay will be archived on our site for 30 days. A slide deck containing financial and statistical highlights has been posted on our IR website. Let me also remind you that this presentation includes forward-looking statements. These statements are not guarantees of future performance, and our actual results could differ materially as the result of many factors.\n\nAdditional information concerning those factors is available in our most recent reports on Forms 10-K and 10-Q, which you can find on the SEC's website and the investor relations section of our website. For non-GAAP financial information disclosed in this call, the related GAAP measures and reconciliation are available in today's earnings release. And with that, let me turn the call over to Al.\n\nAl Kelly -- Chairman and Chief Executive Officer\n\nJennifer, thank you, and good afternoon, everybody, and thank you for joining us. Visa's performance in 2022 was very strong even with the uncertainty created by inflation, the war in Ukraine, COVID, the timing of cross-border travel recovery, and a potential recession. On a full year basis, credentials increased 9% year over year and are up 13%, excluding Russia. We crossed 4.8 billion tokens surpassing the number of card credentials and almost doubling from last year.\n\nMerchant locations, including locations from payment facilitators, grew 11%. Global tap to pay penetration grew 10% -- 10 points to 54% of face-to-face transactions, excluding Russia, and this was helped by 20 additional countries crossing over the 50% penetration mark. Excluding the U.S. and Russia, global tap to pay penetration was 71%.\n\nVisa's network processed 70% more tap to ride transactions on global transit systems in FY '22, surpassing 1 billion transactions for the first time ever. In FY '22, we signed over 400 commercial partnerships with fintechs globally from early stage companies to growing and mature players. Visa Direct had 5.9 billion transactions, excluding Russia, across 60-plus use cases and over 2,000 programs helped by more than 500 enablers. Over half of our clients utilized five or more value-added services in 2022, and a third used 10 or more.\n\nAll of this helped to drive fiscal full year net revenues up 22% year over year and non-GAAP EPS of $7.50, up 27%. Now, let me transition to our fourth quarter performance and key highlights and then make a few comments about 2023. Fourth quarter net revenues grew 19% year over year, and non-GAAP EPS was $1.93, up 19%. Total Q4 payments volume was up 10% year over year, or 135%, versus three years ago, down 1 point from Q3.\n\nExcluding Russia and China, payments volume was up 16%, or 145% of 2019. U.S. Q4 payments volume was up 12% year over year or 145% of 2019, down 1 point. International volume was up 9% year over year, or 126% of 2019, down 1 point versus Q3.\n\nExcluding Russia and China, international volume was up 20%, or 146% of 2019, flat to Q3. Q4 cross-border volumes, excluding intra-Europe, were up 49% year over year and 130% versus three years ago, up 7 points from Q3. Excluding Russia, cross-border year-over-year growth was higher by about 5 points. Travel-related cross-border volumes rose 12 points from 104% of 2019 in Q3 to 116% in Q4 as travel continued to recover.\n\nProcessed transactions were up 12% year over year or 140% versus 2019, and we processed 553 million transactions a day during the quarter. Now, I'll provide an update on the drivers that propel this growth in consumer payments, new flows, and value-added services. Our consumer payment strategy has three components to it: growing credentials, increasing acceptance, and deepening engagement. Total consumer payments revenue for the fourth quarter and the year were both up more than 20% in constant dollars.\n\nOn the credential side, we signed several significant deals with financial institution clients, co-brands, and fintechs in the fourth quarter. Starting with financial institution clients in our Asia Pacific region. We signed with China Construction Bank, Bank of Communications, and Shanghai Pudong Development Bank, leading banks in China. Throughout fiscal year 2022, we have renewed with eight of our top China issuers.\n\nIn our CEMEA region, we signed with National Bank of Kuwait, the largest bank in Kuwait; and ADIB, the largest Islamic issuer in the UAE. In Latin America, we renewed and expanded our partnership relationship with the second largest bank in Colombia, Banco Davivienda, including credit, debit, commercial, and Visa Direct. Another key renewal in Latin America this quarter was with Dock, one of the reasons a few full stack enablers providing BIN sponsorship, issuer processing, acquiring as a service, and program management via a single connection, already servicing more than 100 fintechs in Brazil, Dock will expand across new markets, including Mexico, Colombia, Peru, Argentina, the Dominican Republic, and Ecuador. In Europe, we renewed and expanded our relationship with UBS, the largest issuer in Switzerland.\n\nWe've made excellent progress in Germany with our share growing significantly since 2018, adding more than 12 million debit credentials in the market. Visa Debit is now offered by three of the most significant banks in the market, ING, DKB, and Comdirect. And we're also pleased to announce that Santander Germany will begin issuance in 2023, making Visa the single scheme of choice for Santander in that country across debit and credit. Altogether, across the European continent, our quarterly active credentials were up 18% year over year.\n\nIn the co-brand space, we continue to expand our position in several countries with two recent wins and an extension: first, in India with the Samsung co-brand card targeting existing and prospective Samsung users; second, in the U.S., Visa and Kohl's, with Capital One as the issuer, recently entered into an agreement to launch at Kohl's co-branded Visa credit card. And also in the U.S., we're excited to share that Visa signed a multiyear co-brand agreement extension with Disney for cards issued by JPMorgan Chase. Now moving to fintech and wallet clients. In Egypt, mobile network operated Etisalat Egypt with more than 28 million customers has signed a deal for virtual and physical card issuance.\n\nThe first digital bank in Iraq, Visa Iraq Islamic Bank, seeking to digitize payments and drive a cashless society through Visa credit, debit, and prepaid card issuance across their 400,000 customers. And large cryptocurrency exchange, FTX, with over 5 million registered users has signed on to expand issuance of Visa credentials beyond the U.S. to over 40 countries, bringing our total number of issuing partnerships with crypto platforms to more than 70. Finally, GoHenry Group is the U.S., U.K., and Europe-based fintech that provides prepaid cards and financial education app for children age six to 18 to over 2 million members.\n\nThey will be expanding their U.K. Visa issuance to Continental Europe and the U.S. On the acceptance front, we signed an agreement with Flywire, a global payments enabler and software company that supports the higher education industry to grow card acceptance in Mainland China, Hong Kong, and Korea. In Mexico, we renewed our relationship with Clip, an important payment facilitator, which will aid in the expansion of acceptance to micro, small, and medium merchants.\n\nIn Mexico, we have more than doubled acceptance since 2019 to nearly 3 million merchant locations. Our efforts across Latin America to grow acceptance and win processing share has paid off. Outside of Brazil, we have expanded our processing penetration by more than 20 points since 2019 with the migrations of domestic transactions in Argentina, Chile, Ecuador, Colombia, and, most recently, Uruguay. Customer engagement is very important and tap to pay is one of the best ways to pay in the face-to-face environment.\n\nIn Q4, the U.S. reached 28% penetration and saw more than 1 billion tap monthly transactions for the first time ever in July, surpassing the U.K. as the largest country for tap to pay transactions. And this is nearly double the number of transactions from last year and more than five times the number of transactions from two years ago.\n\nNow moving on to new flows, which grew fourth quarter and full year revenue over 20% in constant dollars. Our B2B business had nearly $1.5 trillion in payments volume for the full year, growing 30% in constant dollars. In the fourth quarter, B2B payments volume was almost $400 billion, growing 21% year over year in constant dollars. Within B2B, our strategy is focused on card-based payments, cross-border payments, and accounts receivable and accounts payable payments.\n\nAnd we've made progress across all three this quarter. Visa has signed a long-term agreement with European payments as a service provider, Modulr, to issue Visa virtual cards to support B2B travel clients issuing out of Europe. Also in Europe, Visa won the credit card portfolio, Credit du Nord, encompassing Societe Generale in addition to renewing consumer credit and debit portfolios in both industries. We also recently reached a new fleet products partnership agreement with Edenred, I'm sorry, which is making their Edenred essentials product available to commercial and public sector organizations with vehicles in the United States.\n\nIn cross-border flows, we signed an agreement with Visa B2B Connect with TD Bank, our first bank in Canada. We also signed banks for the first time in Switzerland and Korea. And recently, our CEMEA region signed five banks across Kazakhstan, Qatar, and Azerbaijan. In the accounts receivable and payable space, MineralTree, a U.S.\n\nautomated invoice-to-payment solution provider for the middle market and enterprise businesses, recently enhanced their relationship with Visa to support cards for their payables customers. For other new flows, Visa Direct grew transactions 36% this year, excluding Russia, reaching 5.9 billion transactions. In the fourth quarter, Visa Direct had 1.7 billion transactions and grew 42%, up 7 points from Q3. In addition to growing the existing Visa Direct business, our strategy for growth includes, one, scaling new use cases with a particular focus on cross-border; two, expanding existing use cases to new geographies; and three, accelerating through enablers.\n\nIn terms of scaling new use cases, I'm pleased that eBay, one of the largest third-party marketplaces in the world, has enabled faster payouts for its sellers via Visa Direct in the U.S. We recently signed a deal in the U.S. with Gopuff, a consumer goods and food delivery service with millions of customers across hundreds of U.S. cities, to provide their delivery partners the ability to cash out their earnings balance in real time.\n\nIn terms of bringing existing use cases to new geographies, in addition to some of the issuing deals I mentioned earlier, we have also signed Visa Direct deals with China Construction Bank and Etisalat Egypt. Other new geographies also include Norway. Norwegian mobile payment application, Vipps, will offer users access to Visa Direct for all domestic payments. This will improve the card-based experience for Vipps, roughly 4.3 million users covering over 80% of Norway's population.\n\nOn the enabler strategy, Square has expanded their instant transfers to Canada, offering their business as a way to have faster merchant settlement opportunities. U.S. money movement automation platform, Astra, is using Visa Direct to let developers add real-time transfer functionality to their application. So, millions of its end users can fund cards, wallets, and demand deposit accounts with their eligible debit cards.\n\nVisa Direct has extensive reach, including more than 3 billion cards and over 2 billion accounts. Recently, Visa Direct has signed with Singapore-based payments infrastructure platform, Thunes, with a network of mobile wallets across 44 countries and territories. Our partnership will add a send-to-wallet capability with either direct through Thunes' B2B payment platform and provide access to 78 already integrated digital wallet providers, representing over 1.5 billion digital wallets globally. So, with this partnership, we'll expand our total reach to nearly 7 billion endpoints covering cards, accounts, and wallets.\n\nAs part of new flows, aligned with our global network of network strategy, we're focused on building the infrastructure that enables our clients to deliver cross-border products and services for their customers. One of our newest capabilities in this space, Currencycloud, signed 35 new partnerships this quarter, including Paysend, a global end-to-end payment platform with over 7 million customers and 17,000 SMEs. Paysend intends to expand capabilities of its Paysend business platform for clients to collect and hold up to 34 currencies and seamlessly convert funds back to the required currency at competitive FX rates. Now moving to value-added services, which had $6 billion in revenue for 2022, up 20% in constant dollars.\n\nFor the fourth quarter, revenues were up $1.7 billion and grew 20% in constant dollars as well. Our strategy here is also threefold: one, to deepen client penetration of existing products; two, to build new products and launch new solutions; and three, to extend geographically. On the first, deepen client penetration of existing products, let's explore two of our largest value-added services businesses, DPS, debit processing services, and Cybersource. DPS, our issuer processing business, hit a major milestone, exceeding $2 trillion in annual authorization volume in FY '22.\n\nDPS has also renewed with nearly 30 clients, representing over $600 billion in annual DPS processed authorization volume. Cybersource remains a compelling gateway solution for merchants and most recently signed McDonald's, Little Caesars, and JetBlue. We also continue to expand Cybersource relationships with acquirers, first with the Bank of New Zealand, New Zealand's largest acquirer. Together with Japanese-acquired SMCC, Cybersource continues to provide payment processing solutions for more than 100,000 terminals in both card-present and card-not-present environment.\n\nSMCC is also leveraging Cybersource's capabilities for value-added services such as fraud management. Most recently, Cybersource is powering SMCC's expansion of the EMV transit acceptance and supporting commercial and pilot launches with 24 different transit operators across Japan. Deutsche Bank will offer Cybersource's Decision Manager to its merchants so that they can receive a risk value for each e-commerce transaction using rules and AI to help prevent online retail fraud. On the second strategy, build new products and launch great new solutions, our recently acquired capability, Tink, is a real example.\n\nTink recently signed Adyen to offer a white-label pay-by-bank open banking solution on its single platform. Adyen will utilize Tink's payment initiation technology, so businesses can enable account-to-account payments. Adyen's open banking integration will launch first in the U.K. with plan to expand to multiple markets during 2023.\n\nLast quarter, I mentioned our newly developed risk-as-a-service capabilities powered by our network-level data, AI capabilities, and our risk experts. Recently, Navy Federal in the U.S. and several banks in CEMEA signed engagements for the service, which aims to deliver enhanced fraud prevention and management. On our third strategy is to extend geographically, in many cases, through tailored solutions.\n\nSince our acquisition of Visa Europe, we have made significant effort to bring value-added services to our clients. Across Europe, clients enrolling onto Visa advance through authentication and Visa risk management products tripled between October 2019 and September 2022. And these clients span across 14 different European countries. In CEMEA, Visa Risk Manager launched a network-agnostic pilot with Emirates NBD, a leading issuer in the UAE.\n\nAs part of Visa's network of network strategy, network agnostic VRM will allow clients to manage card payment risk across their entire portfolio. We recently brought our buy now, pay later solution to Canada and have continued to make progress, adding some of Canada's largest merchants, including Simons and Canada Computers. And RBC and Visa have entered into an agreement to launch the Visa installment solution on eligible RBC consumer credit cards. In conclusion, our 2022 performance was very strong and demonstrated that our strategy for each of our growth levers are delivering.\n\nWe see new flows as a way to drive additional volumes and transactions and value-added services as a way to drive additional yield on existing volumes and transactions. Vasant is going to go into a lot more detail but let me make four points about 2023. One, in the year ahead, I see significant opportunity for the business across all three of our growth areas, consumer payments, new flows, and value-added services. Two, we faced some headwinds, in particular, lapping Visa and a challenging FX environment.\n\nThree, we did not factor a steep economic downturn or a recession into our numbers. To the one -- to the extent one occurs, it will have some impact. Four, we will continue to manage our business for the medium and long term, and we'll invest in initiatives that are compelling and will provide future growth. That said, we recognize that some economies around the world could face increased pressure.\n\nSo, we will be monitoring things very closely. We will, as we have in past periods, be flexible and prudent in the management of our expenses. As a leadership team, we've demonstrated Visa's ability to manage through many different environments, and I remain confident that our strategy will continue to position Visa at the center of money movement for years to come. With that, over to Vasant.\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nThank you, Al. Good afternoon, everyone. Our fiscal fourth quarter results reflect sustained strength in domestic spending and continued recovery in cross-border travel. Net revenues were up 19%, and GAAP EPS was up 13%.\n\nNon-GAAP EPS was up 19%. The strong dollar was a stiff headwind, dragging down reported net revenue growth by 4 points and non-GAAP EPS growth also by 4 points. Discontinuation of operations in Russia reduced net revenue growth by about 5 points. A few key highlights.\n\nIn constant dollars, global payments volume was up 10% year over year and 35% above 2019. Excluding China and adjusted for Russia, global payments volume was up 16% year over year and 45% higher than 2019. U.S. payments volume was up 12% year over year and 45% above 2019.\n\nIn constant dollars, international payments volume, excluding China and Russia, was up 20% year over year and 46% above 2019. The cross-border travel recovery continues. However, the pace of recovery has moderated as most borders are now open, except China. Index to 2019, cross-border travel volume, excluding transactions within Europe, rose 12 points in the fourth quarter versus a 22-point gain in the third quarter.\n\nOur three growth engines, consumer payments, new flows, and value-added services, all grew revenues in excess of 20% in constant dollars. In fiscal year '22, we bought back $11.6 billion of stock at an average price of $205.97. Contributions to the litigation escrow account, which have the same effect as a stock buyback, added another $850 million. We also paid out $3.2 billion in dividends.\n\nAt the end of September, we had $5.1 billion remaining in our buyback authorization. In October, our board authorized a new $12 billion stock buyback program and increased our dividend by 20%. Now on to the details. In the U.S., credit grew 17% year over year to 36% over 2019, helped by travel and entertainment spending.\n\nU.S. debit grew 7%. Relative to 2019, debit was up 54%, sustaining significantly above the pre-COVID trend line even as credit has recovered. U.S.\n\ncard present spend grew 11% year over year and was 27% above 2019. Card-not-present volume, excluding travel, grew 10% year over year and was 68% higher than 2019. E-commerce spending remained well above the pre-COVID trend line even as card present spend continue to recover. On the international front, Latin America was up 33% year over year and 109% higher than 2019.\n\nOur CEMEA region, excluding Russia, grew 32% year over year and was 105% higher than 2019. Growth in both regions was fueled by client wins, cash digitization, and acceptance expansion. Europe was up 12% year over year and 34% higher than 2019 impacted by a portfolio conversion underway in the U.K. Ex U.K., Europe volumes grew 30% year over year and was 67% above 2019, reflecting share gains in multiple markets.\n\nAsia Pacific, excluding China, continues to recover, up 26% year over year and 32% above 2019. Global process transactions were up 12% year over year and 40% over 2019 levels. Constant dollar cross-border volume, excluding transactions within Europe, but including Russia in prior periods, were up 49% year over year and 30% over 2019. Excluding Russia, year-over-year growth was higher by approximately 5 points.\n\nCross-border card-not-present volume growth, excluding travel and excluding intra-Europe, grew 12% year over year and was 60% above 2019. Cross-border travel-related spend, excluding intra-Europe, grew 101% year over year and is now 16% above 2019. The cross-border travel index to 2019 went from 112 in June, 115 in July to 118 in September. While the recovery continues, the rate of improvement from month to month has slowed as borders, ex China, are now open.\n\nTravel in and out of Asia recovered sharply in the quarter, up 16 points from the high 15 to the mid-70s index to 2019. There is more recovery to come in Asia, especially when China starts to lift restrictions. Summer travel in and out of Europe was also very strong, with a travel index to 2019 in the 130s, up 13 points from the third quarter. European travel appears to have benefited most from the strong dollar.\n\nTravel outbound from the U.S. to all geographies continues to pick up steam, rising to the mid-130s index to 2019, up 10 points from the third quarter. However, the inbound travel recovery was sluggish, still indexing in the low 90s and up only 4 points. The strong dollar and delays in Visa issuance from some countries appear to be impacting travel into the U.S.\n\nTravel into Latin America and the Caribbean remained very strong and stable, indexing around 150 to 2019 levels. Finally, travel in and out of CEMEA indexed in the mid-120s relative to 2019, up 10 points in the quarter. Moving now to a quick review of fourth quarter financial results. Service revenues grew 11% versus the 12% growth in Q3 constant dollar payments volume.\n\nExchange rate drag more than offset growth from utilization of card benefits. Data processing revenues grew 10% versus the 12% processed transaction growth. The primary reason is that our data processing revenues are impacted by Russia. However, our transactions growth is not.\n\nAdjusted for Russia, data processing revenues were up 15%. International transaction revenues were up 52% versus the 49% increase in constant dollar cross-border volumes, excluding intra-Europe. Revenue growth was helped by high currency volatility and pricing actions more than offsetting the impact of the strong dollar. Other revenues grew 13% led by travel-related programs and pricing actions.\n\nClient incentives were 26.9% of gross revenues, in line with expectations. Revenue growth was robust across our three growth engines, each growing more than 20% on a constant dollar basis. Consumer payments growth was led by the recovery in cross-border volumes, high currency volatility, and continued strong domestic volumes and transactions. New flows growth was driven by carded B2B recovery.\n\nCommercial card volumes grew 21% year over year and are up 43% versus 2019. And excluding Russia, Visa Direct transactions grew 42%. Value-added services growth was driven by higher volume, increased client penetration, and select pricing actions. Currencycloud and Tink added about 0.5 point to revenue growth.\n\nGAAP operating expenses grew 20%. Non-GAAP operating expenses grew 18%. The inclusion of Currencycloud and Tink added about 3 points. Exchange rates were about a 4.5-point benefit.\n\nWe stepped up investment in our business in the second half of the year as the recovery trajectory accelerated. Personnel costs were also higher due to annual salary increases granted a quarter earlier than our normal cycle and higher incentive compensation accruals. We recorded losses from our equity investments of $122 million. Excluding investment losses, non-GAAP nonoperating expense was $99 million, benefiting from higher interest income due to rising rates.\n\nGAAP EPS was $1.86. Non-GAAP EPS was $1.93, up 19% over last year, inclusive of a 4-point drag from the strong dollar. For the full year, net revenues increased 22%, and non-GAAP EPS of $7.50 was up 27%, with exchange rates reducing reported revenue and non-GAAP EPS growth by over 2 points each. We are now in fiscal year 2023, and through the first three weeks of October, business trends have remained strong and stable.\n\nOn a year-over-year basis, U.S. payments volume was up 11%, with debit up 9% and credit up 14%. U.S. spend growth versus 2019 was up 47%, with debit up 57% and credit up 39%.\n\nThese trends are consistent with the fourth quarter and with performance in major markets around the world. Processed transactions grew 12% year over year, up 40% versus 2019. Constant dollar cross-border volume, excluding transactions within Europe, grew 42% year over year and was 33% over 2019. Card-not-present nontravel growth were 61% above 2019.\n\nTravel-related cross-border volumes were 18% above 2019. Moving now to our perspectives for the coming year. Forecasting four quarters ahead has been difficult through the COVID years. While COVID impact is now largely behind us, as you all know, we are in a very uncertain macroeconomic and geopolitical environment.\n\nAs we've said before, we are not economic forecasters. Clearly, there's a high risk of a global recession, but we do not have a specific point of view on if, when, or the kind of recession we might have. For internal planning purposes, we are assuming no recession. Of course, we will stay very vigilant, closely monitoring our trends day by day.\n\nWe will stay very flexible. We will have contingency plans in place should we have an economic or geopolitical shock that impacts our business. And we will be prepared to act fast should we need to. So that is the context for our planning assumptions, which I will walk through now.\n\nStarting with revenue drivers. Payments volumes and processed transaction indexed to 2019 have been very stable in the U.S. and globally for the past three quarters. In other words, we believe the recovery from COVID is behind us when it comes to domestic spending.\n\nWe're assuming this stability sustains through fiscal year '23 with normal year-over-year growth rates in the low double digits for both business drivers. On payments volumes, Russia will impact growth rates in the first half. Russia will not impact reported processed transactions growth. Cross-border e-commerce trends have also been stable, especially when you adjust for Russia and crypto-related volatility.\n\nWe're assuming cross-border e-commerce growth rate sustain in the mid-teens, excluding Russia and crypto, and in the low double digits with Russia and crypto impact included. Cross-border travel, excluding intra-Europe, has continued to recover but at a slower pace, up 6 points from 112 to 118 index to 2019 between June and September. For planning purposes, we are assuming that this recent month-to-month pace of recovery sustains through fiscal year 2023. As was the case last year, there will be periods of deceleration and acceleration.\n\nHopefully, China starts easing restrictions as we enter calendar year 2023. Two variables will have a significant impact on our reported revenue growth in fiscal year '23, Russia and the dollar, which has strengthened to extraordinary levels through fiscal year '22. Since we discontinued operations in late March, Russia will reduce first half fiscal year '23 revenue growth by over 4 points, with 4 points in the first quarter and as much as 5 points in the second quarter. But as you might recall, we recorded two quarters worth of service fees in fiscal year '22.\n\nRussia will obviously have no impact in the second half. Russia will reduce full year net revenue growth by 5 points. We faced very stiff exchange rate headwinds as we enter fiscal year '23. Based on where the dollar is today and the forward curve, exchange rates will reduce reported net revenue growth in fiscal year '23 by around 4 points.\n\nSince the dollar strengthened through fiscal year '22, the impact is greater in the first quarter at around 5 points, around 4.5 points in the second quarter and moderate through the year. When you pull all this together, our planning assumptions get us to mid-teens constant dollar net revenue growth on a run rate basis, i.e., adjusted for Russia. With a 2-point Russia impact and a 4-point exchange rate headwind, reported nominal dollar fiscal year 2023 net revenue growth would be in the high single digits. Client incentives are expected to be in the 26.5% to 27.5% range as a percent of gross revenues.\n\nWith a 4-point Russia drag and a stiffer exchange rate headwind, first half reported nominal dollar net revenue growth is expected to be lower than the second half. Lowest growth in the second quarter, which has the largest Russia impact and stepping up in the third and fourth quarters with no Russia drag and hopefully a moderating exchange rate headwind. Moving on to operating expenses. We are managing expense growth in line with our revenue growth expectations, rigorously prioritizing investment plans.\n\nAs you know, this is a long-cycle business. Investments we make today will have revenue growth two to three years out. It is important for us to continue to fund key growth initiatives across consumer payments, new flows, and value-added services. As Al said, we have extraordinary growth opportunities and need to ensure we are investing to realize their potential.\n\nOur current plans are for low double-digit non-GAAP operating expense growth in constant dollars, high single digits in nominal dollars, Tink and Currencycloud, which closed during fiscal year '22 at about 1 point to expense growth, offset by the discontinuation of Russia operations and exchange rate changes, which are expected to be about a 1.5-point benefit each. Non-GAAP operating expense growth will be higher in the first half for two reasons. First, Tink and Currencycloud add 2 points to expense growth in the first half. Also in the first half, we lapped a lower expense base last year since we stepped up investment spending through the year as the cross-border recovery accelerated.\n\nAs such, non-GAAP expense growth in nominal dollars is expected to be in the low double digits in the first half and at the high end of mid-single digits in the second half, highest in the first quarter, which is also impacted by the FIFA World Cup and moderating through the year. Should there be a recession or a geopolitical shock that impacts our business, slowing revenue growth below our planning assumptions, we will, of course, adjust our spending plans by reprioritizing investments, scaling back or delaying programs, and pulling back as appropriate in personnel expenses, marketing spend, travel and other controllable categories. In a business like ours, this always requires a careful balance between short- and long-term considerations. As interest rates have risen, nonoperating expense will benefit from higher interest income from our cash balances.\n\nWe currently expect nonoperating expense to be in the $200 million, $250 million range for fiscal year '23. We will provide quarterly updates through the year. Our tax rate is expected to remain in the 19% to 19.5% range in FY '23. Honing in on the first quarter, based on everything I just walked through, we expect reported nominal dollar net revenue growth in the high single-digit range, with client incentives on par with the fourth quarter of fiscal year '22.\n\nNominal dollar non-GAAP operating expense growth is expected to be in the low teens. The tax rate could be lower than the 19% to 19.5% range in the first quarter, depending on the resolution of some items. Second quarter net revenue growth is expected to be lower than the first quarter because of the Russia impact, which is higher. Second quarter operating expense growth is also expected to moderate to the low end of double digits.\n\nIn summary, we assume stable conditions through fiscal year '23 but are prepared to act fast should circumstances change. Regardless of near-term uncertainties, we remain as certain as we've ever been about our extraordinary long-term growth opportunity. There is still plenty of cash to digitize in core consumer payments. We are accelerating volume growth by vastly expanding the use cases we can serve through our new flows business while enhancing the yield on transactions in our network by layering on value-added services.\n\nWith that, I'll turn this back to Jennifer. \n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nThanks, Vasant. And with that, we're ready to take questions, Holly.\n\nOperator\n\nThank you. [Operator instructions] To ensure all questioners are heard, we ask you, please limit yourself to one question. [Operator instructions] Our first question comes from Lisa Ellis with MoffettNathanson. You may go ahead.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nThank you. Thanks for taking my question. Hey, Al, I wanted to follow up on your comment in the prepared remarks about Visa now having 4.3 billion tokens, up doubling more than 2x year on year. Can you elaborate a bit on a couple of aspects of tokenization? First, have you made any progress or what level of progress have you made on selling your tokenization services as a value-added service into other networks -- alternative networks? And then also on some of -- given that you don't monetize tokens directly, what -- how should we think about the indirect benefits of tokenization to Visa now that the number of tokens, you know, exceeds card credentials out there? Thank you.\n\nAl Kelly -- Chairman and Chief Executive Officer\n\nYeah. So, it's -- I think you said 4.3 billion, Lisa. It's 4.8 billion. We have had some but not a tremendous amount of success yet in terms of selling tokens into other networks.\n\nWe view it as a -- we play a critical role in the ecosystem, and we view tokenization as critical to the security of the ecosystem and then, ultimately, the trust of the ecosystem as it relates to card transactions that convert their – their pads converted to token. So over time, we expect this to have very positive impacts on our issuers and merchants in terms of fraud. There are a few cases, the clearinghouse being one, global payments being another where I know that we are getting revenue today from the tokenization capability that we are building for them.\n\nOperator\n\nOur next question is from David Togut with Evercore ISI. You may go ahead.\n\nDavid Togut -- Evercore ISI -- Analyst\n\nThank you very much. Could you gauge the impact on processed transaction growth for FY '23 from U.S. Federal Reserve's enforcement of two unaffiliated networks to process every online U.S. debit transaction beginning July 1, 2023? And related to that, do you have any mitigation strategies to offset the impact, for example, potentially adjusting prices?\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nYeah. I'll answer the first part of the question. I'm sure Al will have more to add on the second part. Obviously, we have to wait and see the pace at which the second network is enabled on cards on e-commerce transactions.\n\nOur current expectation, given that our fiscal year, as you know, goes through September is that the effect in 2023 will be minimal, if any. But we'll keep you posted. More broadly, just in terms of our views about the impact longer term, people come to us because of the value we create, and that value comes in the form of having a dual message network and everything that goes with it, the security and the reliability we offer that is unmatched, as well as the dispute resolution and other sets of services, tokenization, all our risk management services that we layer on. We've competed for business in the past, and merchants have chosen us based on the value we provide.\n\nAnd I'm sure, Al, you have more to add on this front.\n\nAl Kelly -- Chairman and Chief Executive Officer\n\nYeah. I think that our capabilities are just terrific. And in an e-commerce world, David, the liability for fraud sits with the merchant. So, they're going to be very, very careful about who they do business with.\n\nAnd they've done business with us for years and know that we have very, very strong risk capabilities, very, very strong fraud prevention capabilities. And those are the types of things that in our experience since Durbin in 2010 that have a good amount of merchants who solely stick with us, they never route to the unaffiliated network because of those security and fraud capabilities we have, plus as Vasant alluded to the fact that we have the ability to be dual message, which makes a big difference in car rental, hotel. And in the online world, we'll make a big difference when people order multiple items from a merchant. It will allow the merchant to ship in different shipments as opposed to waiting until all the products are gathered and they can ship it, and they're forced to ship at one time if you're using a single messaging capability.\n\nSo, I think we have a lot of history and a lot of important capability differences. And a lot of our merchants in the United States are very familiar with the strengths that they get from doing business with us.\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nNext question.\n\nOperator\n\nAnd the next question is from Darrin Peller with Wolfe Research. You may go ahead.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, guys. Thanks. Your outlook and your budget you gave us was obviously helpful, and I clearly underscores the resilient of the consumer so far. But just to touch on the water for a minute.\n\nAnd I think you have about a third of your revenues now coming from new flows, services, many of which had are early stages of growth. So, putting that together with higher inflation, Al, would you expect any type of difference and set of outcomes on the top line if we were to see a notable downturn? And then, Vasant, just maybe you could touch on the flexibility you think you have on the expense side to help manage through any type of change.\n\nAl Kelly -- Chairman and Chief Executive Officer\n\nSo, Darrin, just to be clear, your one-third is about right for VAS plus new flows, not just new flows. As you alluded to, I mean, right now, we are seeing nothing but stability. And it's been true over the last numbers of quarters. And our business is very different than it was the last time there was a downturn.\n\nWe're much more into everyday spend categories. E-commerce has evolved tremendously. There's been a lot more cash digitization. We have a very heavy debit portfolio, which tends to perform better during these downturns.\n\nAnd frankly, I don't think any of us know what the impact is going to be coming off of the pandemic where there still seems to be a lot of pent-up demand for travel, for example, which is a highly discretionary purchase. And we're in an unusual time where employment has really held up. So, we'll certainly watch if payment volumes are impacted in any kind of significant way. Back to the core of your question, obviously, we will have some hit on our revenue line, but we'll continue to manage on the expense side, and I'll let Vasant take that half of the question.\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nYeah. I mean, and continuing on revenue for a minute, I mean, clearly, we now have new flows and value-added services, which are businesses, which are in new use cases that are very different than we've had in past times when we had recessions. So -- and they're also ramping in many cases. And value-added services clearly is a whole range of new services that are not necessarily all tied to economic ups and downs.\n\nSo clearly, there's a lot of differences from the past. But as Al said, recessions can come in all forms and shapes and sizes. And they could be global or regional. They could be deep or shallow.\n\nThey could be recessions that have lesser impact on consumer spending and so on. As it relates to expenses, as I said in my comments on planning assumptions, I'd say three things. One, we're moderating expense growth as we go into the year. So, expense growth is clearly coming down from the levels you've seen.\n\nFor the year, our going-in planning assumption is nominal growth of about 9%. But I would just note that in the second half of the year -- the fiscal year, the growth is actually at the high end of mid-single digits. So, it is moderating through the year, and we don't know when there'll be a recession or if there will be a recession. But if you look at what all the various prognosticators are saying, it appears that most people think if there's going to be a recession, it's sometime next year, probably six months from now.\n\nNow that would put us in the second half of our fiscal year. So, we already have expense growth moderating to the sort of the high end of mid-single digits. Clearly, we will look to reprioritize, scale back, postpone, etc. And depending on the nature of the recession and the impact it's having on our revenue, we would seek to manage our expenses to be even better than what our planning assumptions might be and bring the rate -- growth rate down.\n\nSo, we will calibrate as we go along.\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nNext question.\n\nOperator\n\nOur next question is from Bob Napoli with William Blair. You may go ahead.\n\nBob Napoli -- William Blair -- Analyst\n\nThank you. Appreciate it. Al, I was wondering maybe just if you could give some thoughts on what are you most excited about as we head into '23 and '24 and what has surprised you and -- if anything. And Vasant, can you give us a little bit of color on goods versus services? Have you seen the -- what the trend on growth rates have you seen on those two items?\n\nAl Kelly -- Chairman and Chief Executive Officer\n\nSo, in terms of what we're excited about, look, I think in all three businesses, we're seeing some really terrific green shoots. And in the consumer payments, certainly excited about the realities of cash digitization getting more and more pronounced around the world. We're certainly excited about the continued progress we're seeing in tap to pay. The fact that our business in e-commerce has grown so much.\n\nReally like what we're seeing in the continent in Europe in terms of the growth that we're seeing there, which is really strong. If we look at India, Brazil, Germany, Canada, Japan, all are growing at very, very good levels. There's very different dynamics in each of those markets, but they're all growing very well. I just recently took a trip to Nigeria and the Democratic Republic of the Congo.\n\nAfrica is a place that's not going to help us in '23 or '24 necessarily, Bob. But the last -- we now have offices, I think, in 13 countries there in the last five or six offices we've opened there, opened around the world -- or in Africa. In new flows, as we've organized that business as a single business, Oliver Jenkyn's bringing a great focus to it and making sure that we are driving new use cases around the globe, getting more and more enablers who help us drive those use cases. And we're putting a particular focus there on cross-border where previously, a lot of the early use cases in new flows have been in the area of things like domestic like P2P and B2B.\n\nAnd then in VAS, certainly, we're excited about the two recent acquisitions we made of Tink and Currencycloud. I think they're both going to bring some very interesting and good capabilities to us. And we're -- in both cases, we've spent a lot of time and planning sessions between the folks who are running those businesses and our folks, and I think there's a great opportunity ahead. Vasant, do you want to tackle the goods versus services question?\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nYeah. A few things on goods versus services. As you know, we tend to look at how various segments are performing versus the pre-pandemic level in 2019. It's a clean way to look at things.\n\nAnd while there's been a lot of talk about how goods are underperforming, most of the goods categories indexed to 2019 actually have done quite well, and they're holding quite stable. What it means is that they grew a lot faster in the early parts of the recovery and then haven't grown as fast as people shifted from goods to services. But overall, if you compare to 2019, the goods business has done very well, indexing very well to where it was and very much either on or above the pre-COVID trend line. More recently, even as services and restaurants, travel, entertainment, have continued to grow, we're starting to see goods do better.\n\nSo, they went through a period where they had very high growth, especially through the stimulus period and so on, recovered much faster than services, then services to come back. We're starting to see some recovery on the goods side, too, now. But overall, goods is doing quite well on a three-year index, too.\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nNext question. \n\nOperator\n\nOur next question is from Harshita Rawat. You may go ahead.\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nThank you for taking my question. Vasant, can you talk about and zoom in on cross-border revenues in 2023? I know there's still recovery to be had if you just look at, like, trend line on travel versus 2019 and also if you look at, like, metrics beyond spend, which is inflation in that. But on the flip side, this has very high beta to macro. U.S.\n\ndollar has strengthened a lot, which can impact cross-border inflows into the U.S. And FX volatility was a big benefit in revenue this year, but you're kind of against kind of tough comps next year. So, lots of moving pieces. Can you -- how are you thinking about it? Thank you.\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nYes. Clearly, lots of moving pieces, as you pointed out. So, I'll just go through them one by one. Yes, we did benefit from very high currency volatility in the second half of this year.\n\nAnd that does help us, as you know. It's in our international fees line, international revenue line. And what volatility is going to be is anybody's guess. For planning purposes, we assume that it starts to moderate through the year.\n\nIt's still high, and we're assuming that it'll be maybe higher than normal in the first quarter and then moderates as we go through the year to what we've seen in the past to levels that are normal over a long period of time. So that's the impact of volatility. As it relates to the dollar and its impact on cross-border travel, we've told you that we've seen about a 2-point monthly improvement in that index in the last few months. And again, I mean, it's very hard to predict these things.\n\nYou know we got it wrong last year. The recovery was a hell of a lot faster than we expected. We'll probably get it wrong again, but we've been very clear about our assumption, which is that the recovery we've seen for the past several months, we think, is probably the new rate of recovery. There'll be accelerations and decelerations.\n\nAnd maybe if China opens up and lift restrictions, there could be some acceleration. So, that's sort of what we're assuming for travel. What impact of recession might have on it remains to be seen. As Al say, there's pent-up demand.\n\nAnd how much will that offset it, we'll wait and see. The main message is there's still recovery in cross-border happening, but we're also lapping much stronger cross-border levels from last year. As you know, cross-border travel really started to recover last September. And so, we are now beginning to lap some really stronger periods last quarter.\n\nSo, the rate of growth inevitably has slowed, and it will continue to slow through the year, but it's still above the long-term trend line because we still are in recovery mode. So hopefully, that helps a bit.\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nNext question. \n\nOperator\n\nOur next question is from Ashwin Shirvaikar with Citi. You may go ahead.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you. From a headline perspective, I guess if you're seeing nothing but stability that has been the situation for a few months, as you mentioned, are there things to highlight on a more granular basis if there are particular areas of strength or weakness? So that's part one. But then it also seems that you're implying that the business as a whole is more resilient because you have new flows and value-added services in addition to consumer pay and kind of agree with that. But could you maybe, you know, talk about the new flows and value-added, what you might see in a downturn?\n\nAl Kelly -- Chairman and Chief Executive Officer\n\nFirst of all, Ashwin, we -- I'd say we've seen stable for more than a few months, but probably pretty close to the last 12 months, certainly in the last nine months. Look, there's -- as I said, while there's stability, the reality is we do know that there's some changes in consumer behavior going on, but they're still spending the same amount of money, and they're still paying in the same way, which are critical to us. So, we know there's some substitution going on where people are buying generics versus buying brands. We know that people are spending a certain amount on -- an increased amount on food and drug products, and that's causing them to have less money available for discretionary spending.\n\nBut -- and we're still seeing -- as I highlighted, I think, last quarter, the affluent customer is still jumping back in the market, and that's a very, very good thing because of the amount of spend they do. And we're still seeing employment levels at a very healthy level. So, we know this stuff that is going on, but the reality is that while consumers might be altering a bit what they buy in different categories, the realities are that -- as I said, they're still spending the same amount of money and using the same ways to pay as they did before. In terms of value-added services and new flows, obviously, value-added services is somewhat dependent on transactions.\n\nSo, we provide additional value on transactions. If those were transactions were to go down, that obviously impacts the value-added services business. The net flows business really took a bit of a hit because of the amount of business that we had in Russia. But as I reported it, you know, it was up 42% in the fourth quarter, excluding Russia, which was up 7 points in the third quarter.\n\nSo, the momentum is very, very good there. And I think that that has a lot to do with the fact that over the last 15 months, we've done a really good job of further diversifying that business in terms of use cases, enablers, and geographies, and all of that's helped us a lot.\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nNext question. \n\nOperator\n\nOur next question is Timothy Chiodo with Credit Suisse. You may go ahead.\n\nTim Chiodo -- Credit Suisse -- Analyst\n\nGreat. Thanks a lot for taking the question. I want to talk about the Visa Direct decision. So, by businesses, platforms, governments that are deciding to use Visa Direct relative to other alternatives like RTP systems around the world.\n\nAnd I fully appreciate that Visa Direct leverages, many of these RTP and other ACH systems around the world. But what is it that is causing them to choose Visa Direct? And as a follow-up, you've often talked about the pricing for Visa Direct. It's very use case-based. Maybe you could just give directional examples of what a higher-priced use case might be and what a lower-price use case might be.\n\nAl Kelly -- Chairman and Chief Executive Officer\n\nOn the -- let me first tackle the -- why Visa Direct. First of all, Visa Direct biggest advantage is that it uses the VisaNet platform, and therefore, comes along with all the capabilities of the VisaNet platform. Second, we have incredible reach with Visa Direct, as I talked about, almost 7 billion endpoints, including accounts cards and wallets. And as you alluded to, we have become a bit agnostic of exactly how that flow happens.\n\nIf the first or last mile is on an RTP network or an ACH network or a payment gateway, that's fine by us. And we're continuing to invest in capabilities as it relates to Visa Direct, and then you get a lot of the protections that you get zero liability, charge-backs, dispute -- good solid dispute management, the fact that you get the security and the monies that we spend on protecting consumer data, as well as battling cyber security. And all of those capabilities offer, you know, an awful lot of peace of mind to a consumer versus a transaction where the money is immediately moved from your bank account across an RTP network to pay somebody. And all of a sudden, if there's an issue, there's nobody to turn to.\n\nThere's no rules governing what happens. There's nobody to help mediate what's happening. All those things are things that our network does that makes Visa Direct a really, really strong alternative to an RTP network.\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nAnd at your second question, you know, maybe we'll give you two examples. At one end is a high-value use case, and that will be cross-border remittances. The use of Visa Direct gives you extraordinary flexibility. You can do it account to account, account to account, card to card, sitting at home, you don't have to go to someone to give them cash.\n\nIt's also tremendous flexibility at the other end in terms of how someone receives the money. It's real time. It has all the other benefits Al mentioned. As you know, cross-border remittances have a very high cost right now.\n\nWe can do all that for a lot less and still have a yield that is quite attractive relative to our, you know, traditional yield. At the other end of the spectrum, P2P, very much a preferred way to do it is to have your debit credentials in there because it makes it a lot more secure and has all the value we can add. It's a high-volume but lower-yielding use case. And very often, it's the way we get going in most markets.\n\nSo those are two examples. And in between, you have insurance disbursements, earn wage access, marketplace payouts, and so on, all of which are different.\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nLast question, please, Holly.\n\nOperator\n\nOur last question comes from Tien-Tsin Huang. You may go ahead. With J.P. Morgan.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nThank you. Thank you so much. I know you've gone beyond the hour, so thanks for the time. Just two quick ones, if you don't mind.\n\nJust on the other revenue line. I know services, you had mentioned there is some transactional element to it, but you did 20% growth at scale in fiscal '22. So, any thoughts on how '23 might come together, assuming relative stability? And then just wanted to clarify the base case on operating leverage. It looks like on a nominal basis, we should assume minimal operating leverage.\n\nI just want to make sure we're hearing that correctly and how that might flex if things change. Thank you.\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nYeah. On operating leverage, as we said, you know, we are trying to balance the short term and the long term. As you've heard, we think there are extraordinary opportunities in new flows and value-added services, these are long-cycle businesses. You have to invest now for the future.\n\nSo, yes, we are choosing to invest in the business, and that reflects, you know, the expenses that we plan -- our expense growth plan relative to the revenue growth. And the other part of the question was other revenues, right?\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nOther revenues.\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nOn other revenues, yeah, there are some things there that will also have some sequential slowdown because there are things like car-related benefits and so on in the other revenue line that are linked to travel. And as you lap a stronger recovery of travel from last year, there'll be some sequential slowdown. There are also a few other value-added services there. So, you know, just like the overall business where there is a sequential slowdown because of the lapping effects and some currency impacts in Russia and so on, you'll see that in the other revenue line, too.\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nGreat. And with that, we'd like to thank you for joining us today. If you have additional questions, please feel free to call or email our investor relations team. Thanks again, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJennifer Como -- Senior Vice President and Global Head of Investor Relations\n\nAl Kelly -- Chairman and Chief Executive Officer\n\nVasant Prabhu -- Vice Chairman and Chief Financial Officer\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nDavid Togut -- Evercore ISI -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nBob Napoli -- William Blair -- Analyst\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nTim Chiodo -- Credit Suisse -- Analyst\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nMore V analysis\n\nAll earnings call transcripts"
}