{
  "companyName": "Best Buy",
  "companyTicker": "BBY",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/best-buy-bby-q2-2023-earnings-call-transcript/",
  "content": "Best Buy (BBY -1.27%)\nQ2 2023 Earnings Call\nAug 30, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to the Best Buy second fiscal quarter 2023 earnings conference call. [Operator instructions] I will now turn the conference call over to Mollie O'Brien, vice president of investor relations.\n\nMollie O'Brien -- Vice President, Investor Relations\n\nThank you, and good morning, everyone. Joining me on the call today are Corie Barry, our CEO; and Matt Bilunas, our CFO. During the call today, we will be discussing both GAAP and non-GAAP financial measures. A reconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures and an explanation of why these non-GAAP financial measures are useful can be found in this morning's earnings release, which is available on our website, investors.bestbuy.com.\n\nSome of the statements we will make today are considered forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. These statements may address the financial condition, business initiatives, growth plans, investments, and expected performance of the company, and are subject to risks and uncertainties that could cause actual results to differ materially from such forward-looking statements. Please refer to the company's current earnings release and our most recent 10-K and subsequent 10-Qs for more information on these risks and uncertainties. The company undertakes no obligation to update or revise any forward-looking statements to reflect events or circumstances that may arise after the date of this call.\n\nI will now turn the call over to Corie.\n\nCorie Barry -- Chief Executive Officer\n\nGood morning, everyone, and thank you for joining us. I am incredibly proud of our teams as they continue to rise to the challenges of the past few years. With so much going on that is beyond their control, I remain impressed with their ability to manage the rapidly shifting business environment and priorities. As we said in March, we expected our financial results would be softer this year as we lapped record sales volumes.\n\nHowever, the macro environment has been more challenged and uneven than expected due to several factors. And that has put more pressure on our industry, changing the trajectory of our business versus our original plan. We are focused on balancing our near-term response to difficult conditions and managing well what is in our control while also delivering on our strategic initiatives and what will be important for our long-term growth. Our strategy and our confidence in it remains unchanged.\n\nWe have exciting opportunities ahead of us in a world that is more reliant on technology than ever. We are a financially strong company with a resilient world-class team that will successfully navigate the current environment. Now, on to the second quarter results we reported this morning. Our comparable sales were down 12.1% as we lapped strong Q2 comparable sales last year of almost 20%.\n\nThis represents 8.3% sales growth over the second quarter of pre-pandemic fiscal '20. Our non-GAAP operating income rate declined compared to last year on the SG&A deleverage from the lower revenue, the investments in our growth initiatives, and the increased promotional environment for consumer electronics. Our non-GAAP earnings per share was up 43% versus pre-pandemic fiscal '20. We are clearly operating in a volatile consumer electronics industry.\n\nWe assumed the CE industry would be lower following two years of elevated growth, driven by unusually strong demand for technology, products, and services; and fueled partly by stimulus dollars. In addition, we expected to see some impact to our business as customers broadly shifted their wallet spend back into experience areas, such as travel and entertainment. We did not expect and compounding these impacts is a changing macro environment where consumers are dealing with sustained and record-high levels of inflation in some of the most fundamental parts of their daily lives, like food. While these factors have led to an uneven sales environment, they have not deterred us from continuing to make progress on our initiatives.\n\nDuring the quarter, we drove broad customer NPS improvements, even compared to pre-pandemic levels, particularly in installation and repair. We signed up new Best Buy Totaltech members and increased our delivery speed, delivering almost 1/3 of customer online orders in one day. We also completed store remodels, opened new outlet stores, and began implementing newly signed deals with healthcare companies. From a top-line perspective, we saw year-over-year sales declines across most product categories with the largest impacts to comparable sales coming from computing and home theater.\n\nAlthough down from last year's strong sales compared to Q2 of fiscal '20, our computing revenue has grown more than 20%. Our domestic appliance business comparable sales declined slightly as it lapped more than 30% growth in the second quarter of last year. And revenue is up more than 45% compared to fiscal '20. Our data would tell us that customers are making some decisions to trade down, particularly those in lower-income households.\n\nThis is not across all categories, but, for example, in the television category, customers are moving more into our lower price point exclusive brands products. We're also seeing more interest in sales events, such as prime day, tax-free events, and other events geared at exceptional value. I applaud our team's proactive management of our inventory during the quarter, as we saw the sales trajectory changing. Our inventory at the end of Q2 was down 6% from the second quarter of last year and up approximately 16% from pre-pandemic fiscal '20.\n\nOverall, our inventory is healthy and reflects an evolving mix of product in our network, including more high ASP appliances and larger screen televisions, which also have longer lead times and a slower inventory turn. While we took more inventory markdowns than last year, the level reflected a normalization to pre-pandemic activity. Within our inventory numbers, there are categories where we have ample inventory supply and still pockets where we are constrained. In our industry, it's not as simple as we have inventory or we don't.\n\nIt can be incredibly variable by product and even brands within a particular product. For example, we are also still experiencing inventory constraints in key models and brands across computing and gaming. As we move into the back half of the year, we are planning inventory thoughtfully, yet investing strategically for holiday. While it is important to manage inventory against current demand, we also want to ensure we are well-positioned to react to the ever-changing consumer needs.\n\nThe promotional environment was more intense than last year and even more than we expected entering the quarter, as sales demand softened. Some areas were quite aggressive from a promotional standpoint, especially where inventory was ample or in excess. Overall, we feel the level of proportionality has returned to pre-pandemic levels. Over the past few years, we have seen gross profit pressure from higher supply chain costs, which, of course, includes increased parcel cost from our higher mix of online sales.\n\nIn addition, we estimate that roughly half of the increased supply chain costs this quarter versus the comparable period in fiscal '20 is being driven by cost increases or inflationary pressures. Conditions across the global supply chain continue to evolve on a year-over-year basis, we saw higher costs in Q2 and expect that to continue through the remainder of the year. However, we are starting to see some signs that the market is stabilizing and moderating. During the pandemic, the capacity and rate pressures started in international and worked their way to domestic logistics.\n\nNow, we are experiencing some relief in international first and early signs of loosening markets domestically. For example, in ocean logistics, we are taking advantage of some great opportunities, but continue to be mindful of ILWU labor discussions and overall U.S. port congestion, as we move into the peak shipping season. As it relates to inbound domestic transportation, while we are starting to see a more balanced capacity market, we continue to see inflationary pressures from higher fuel and labor costs, and rail yard and general supply chain network congestion.\n\nI would like to provide an update on Totaltech, our unique membership program designed to provide customers with complete confidence in their technology, with benefits that include member pricing discounts, product protection, free delivery and standard installation, and 24/7 tech support. Considering the macro environment and decline in our product sales, we are encouraged with the pace at which we are acquiring new members. In Q2, nearly half of the new members joining the program were either new or lapsed customers, reinforcing how the value of this program resonates beyond our existing loyal customers. Our associates continue to embrace the program as the fulsome nature of the offering not only simplifies the sales interaction, it also is a program our team members can confidently stand behind as they believe in the value it provides to every single customer.\n\nIn July, we enhanced our in-store point-of-sale tools to better assist our team in showcasing the value of Totaltech to potential new members, and their early results have been positive. At this point in the national launch, we continue to be encouraged by the higher engagement, customer satisfaction, and increased revenue we're seeing from customers who have signed up to become members. As we have previously shared, from a financial perspective, Totaltech is a near-term investment to drive longer-term benefits. Over time, we expect the incremental spend we garner from members will lead to higher operating income dollars.\n\nAs I've just covered, there are several things we are seeing with the program that give us confidence that customers value the membership and that our thesis in general is playing out. At the same time, consumer electronics is a low frequency category. And we are in a unique macro environment, meaning it will take time for us to truly assess the performance. As you would expect, we will continue to monitor the program and iterate on the offering as we learn more.\n\nIn addition to Totaltech, our Best Buy branded credit card continues to drive a valuable and sticky relationship with our customers. We continue to see growth in cardholders, more than 25% of our revenue is transacted on our Best Buy branded card, and cardholders have been increasing the use of their card outside Best Buy stores as well. These customers tend to be more engaged with Best Buy over time with higher frequency and spend than noncardholders. Combined with our partners largest lease-to-own portfolio and our buy-now-pay-later test, this means we can offer our customers a variety of ways they can shop confidently with us.\n\nAnd we can leverage those relationships into our future. As we emerge from the pandemic, it is clear that our customer shopping behavior has changed. Our online sales as a percentage of domestic revenue in Q2 was 31%, nearly twice as high as pre-pandemic. Virtual revenue via video, phone, and chat is growing rapidly as well, as sales for the first six months of the year are already almost equal to the virtual revenue we generated for all of last year.\n\nWhile still small, overall sales in our virtual store are ramping quickly, and we recently expanded categories to include appliances and home theater. In addition, our high NPS in-home interactions continue to increase rapidly. In fact, in-home installations have seen double-digit growth versus the prior year in five of the last six quarters. And year-to-date in-home sales consultations are up more than 30% over last year and pre-pandemic.\n\nOf course, our stores remain incredibly important for customers to see and touch products and get advice. In addition, they're crucial to our fulfillment strategy. In the second quarter, customers representing 42% of our online sales chose to pick up their products at our stores, and an additional 18% of online sales were shipped out of our store to customer homes. These in-store pickup and ship from store numbers have remained incredibly consistent for the last several years, even as shipping speed and options have dramatically increased.\n\nIt is imperative that we evaluate how we operate in service of these evolving customer needs and make the necessary adjustments to ensure we come out of this not just a vital company but a vibrant one. We tested new field operating models in four markets over the past year to help us better understand how to deploy leadership resources in a more digital world. As a result of these tests, earlier this month, we made structural changes to our operating model that resulted in some store rolls being eliminated. We hope to retain as many of these talented associates as possible.\n\nThis is one component of our enterprisewide restructuring initiative that commenced this quarter. With these changes, we are able to reinvest back into front-line customer-facing sales associates. We are continuing to reimagine our physical presence in ways that cater to our customers changing shopping patterns as well. As part of our Charlotte holistic market approach pilot, we are testing a new 5,000-square-foot store with a unique digital-first approach.\n\nJust opened last month, the store includes a 7-foot-tall digital display that customers will see as they enter the store that explains what's new and how customers can shop. The store includes curated assortments across our product categories, except for major appliances and other large products. The majority of products will primarily be on display to touch and try. To purchase, customers can scan the QR code on any product price tag using their phone.\n\nThis immediately sends a notification to a Best Buy employee to pick up the product from the store's back room and bring it to the register for checkout. Of course, customers who want to will be able to consult with sales associates, in-home consultants, and geek squad agents, who always have access to our complete assortment online using our increasingly rapid shipping. From an online sales fulfillment perspective, the store offers both in-store pickup and convenient lockers. The Charlotte market pilot also includes a traditional core store that we converted to an outlet store.\n\nThe outlet has an expanded assortment of product categories, a dedicated team of employees and agents that rapidly quality check and repair all product for resale, a new services repair hub-and-spoke model, and an auto tech mega hub for car tech installation. This outlet is performing extremely well and is frankly on track to deliver revenue on par to the pre-converted conventional store, with a considerably lower operating cost and greater productivity. Those results give us confidence in our outlet strategy. During the quarter, we opened two new outlet stores in Virginia and Phoenix, and just opened a location in Chicago earlier this month, bringing us to 19 locations.\n\nWe see twice the recovery rates of our costs when we sell open-box, clearance, and end-of-life inventory at our outlets versus alternative channels. With assortment expanded to include major appliances, large TVs, computing, gaming, and mobile phones, we believe now is an opportune time to appeal to our existing Best Buy customers, as well as an increasingly deal-seeking consumer overall. Our outlet store assortment is also available for purchase online, with many products eligible for national shift to home fulfillment, as well as local store pickup. This capability unlocks a very productive way to refurbish inventory, giving it a new life while also serving a deal-seeking customer.\n\nWe still plan to double the number of outlets to approximately 30, although some may not open until fiscal '24. So far this year, we have invested in and completed seven experienced store concept remodels. The results we are seeing in the existing two pilot remodels, including higher NPS and higher customer spend, continue to make us confident and excited about this part of our strategy. We expect to complete a total of approximately 40 experienced store remodels this year.\n\nI am very proud of how much work the team has done to test and iterate multiple store and operating model concepts over the past few years. In response to the dramatic pivot in customer behavior, we introduced a great deal of change into the field. Not all went perfectly, and we have learned and accelerated some initiatives while stopping others. On top of that, of course, the macro backdrop has shifted, and the trajectory of the business has changed significantly in an incredibly short time.\n\nWe continue to invest in our people and our stores with an eye toward the best possible customer experience, leveraging our unique differentiators through all the changes. Overarching store NPS is substantially higher than pre-pandemic, including more stores than we have ever seen at what we consider to be best-in-class levels. This is entirely due to our amazing store associates' hard work and dedication to always being there for our customers. We have consistently invested in our employees over the past three years, including raising hourly wages more than 20% versus pre-pandemic and adding additional benefits, such as paid caregiver leave, financial hardship assistance, and paid time off for part-time employees.\n\nNow, I would like to touch on Best Buy Health. Our consumer health business, where we curate health and wellness products online and in our stores, is largely experiencing similar revenue trends as our core category. We're excited about the new FDA ruling that allows the sale of over-the-counter hearing aids. We just announced an expanded collection of hearing devices and in-store experience in more than 300 stores and a new online hearing assessment tool, making it more convenient than ever for the millions of Americans with mild to moderate hearing loss to get the products and support they need.\n\nDuring the second quarter, we continued to see strong growth in new signups for our active aging business that offers health and safety solutions to enable adults to live and thrive at home. Revenue for this business was slightly up in the quarter compared to last year. We are encouraged by the momentum we have built in the virtual care business in the first half of the year. We are very focused on successfully implementing the large U.S.\n\nhealth system accounts that have been won recently, including NYU Langone Health for hospital-at-home and Mount Sinai Health Systems for chronic disease management. And we are also making progress leveraging our Best Buy capabilities in this space. Our geek quad team successfully completed additional health training in Q2 and launched a new geek squad pilot service with Geisinger Health. As a reminder, the revenue contribution from virtual care is currently very small and will take time to ramp as health industry has a longer return on investment.\n\nWe just published our 17th annual ESG report, which outlines how we are working across the company to make a positive impact on our planet employees, customers, and communities. We continue to focus on ESG initiatives that drive sustainable long-term value creation. Last year, we made significant progress toward our goals to reduce our carbon footprint, attain our 2025 hiring commitments, and expand our Best Buy Teen Tech Center program. We recently hit a milestone with the Best Buy Foundation Teen Tech Centers, when we opened one earlier this month in Gary, Indiana, marking our 50th Teen Tech Center.\n\nThese centers provide teens from disinvested communities with guidance, training, and tech access to help successfully prepare them for the future. In terms of the environment, we continue to drive forward the circular economy, a system in which nothing is wasted. Since 2009, we have reduced our carbon emissions 62% through investments in renewable energy and operational improvement. We are on track to reduce our carbon emissions 75% by 2030.\n\nAnd last year, we became a founding member of the Breakthrough 2030 Retail Campaign, which aims to accelerate climate action within our industry. We continue to operate the most comprehensive consumer electronics and appliances take-back program in the U.S., collecting more than £2.5 billion since 2009. We also made significant progress toward our fiscal '25 hiring commitments to help ensure we build an inclusive, diverse, and thriving workforce. In fiscal '22, we filled 37% of new salaried corporate positions with Black, Indigenous, and people of color employees, ahead of our goal to fill 1 in 3 positions.\n\nAnd we filled 26% of new salaried field positions with women employees, marking progress on our goal to fill 1 of 3 positions. We're proud that 60% of our most senior leaders, including our board of directors and executive team, is made up of women and people of color. We encourage you to review our full ESG report available on our corporate website. In summary, the first half of the year has been difficult from a sales perspective, and our employees have executed well in the evolving environment, in many cases making hard decisions to run the business effectively and prioritize our customers.\n\nI just want to take a moment to address the fiscal '25 financial goals we introduced in March. We remain confident in the strategic premise covered in March. However, the current macro backdrop has changed in ways that we and many others were not expecting. As such, we are removing these targets, and we'll share more context on our midterm financial expectations once we begin to experience a more stable operating environment.\n\nAs I said at the beginning of my remarks, we are managing thoughtfully and carefully while still investing in our future. This includes actively assessing further actions to evolve our operating model, manage profitability, and iterate on our growth initiative. We fundamentally believe that technology is more important than ever in our everyday lives. And as a result of the past few years, consumers have even more technology devices in their homes that will need to be updated, upgraded, and supported over time.\n\nAs our vendor partners continue to innovate and the world becomes increasingly more digital in all aspects, we will be there to uniquely help customers in our stores online, virtually, and directly in their homes. This company has navigated monumental change, riding incredible highs and managing difficult lows since our founding 56 years ago. As we have done throughout our history, we will use this moment to lead and double down on our purpose, making it clear that we continue to uniquely support customers in ways literally no one else can. Now, I would like to turn the call over to Matt for additional details on our second quarter results and outlook for the remainder of the year.\n\nMatt Bilunas -- Chief Financial Officer\n\nGood morning, everyone. Hopefully, you were able to view our press release this morning with our detailed financial results. I will walk through details on our Q2 results before providing insight into how we are thinking about the back half of the year. Enterprise revenue of $10.3 billion declined 12% on a comparable basis as we lapped very strong 20% comparable sales growth last year.\n\nOur non-GAAP operating income rate of 4.1% compared to 6.9% last year. As expected and similar to last quarter, our investment in Totaltech membership added approximately 100 basis points of operating income rate pressure this quarter compared to last year. Our non-GAAP SG&A expenses were $129 million lower than last year, but were 120 basis points unfavorable as a percentage of revenue. Compared to last year, our non-GAAP diluted earnings per share of $1.54 decreased $1.44 or 48%.\n\nA lower share count resulted in a $0.16 per share benefit on a year-over-year basis. However, it was offset by a higher non-GAAP tax rate. In our domestic segment, revenue decreased 13.1% to $9.6 billion, driven by a comparable sales decline of 12.7%. From a monthly phasing standpoint, fiscal June's comparable sales decline of 16% was the largest decline, whereas fiscal July was our best performing month during the quarter compared to both last year and to the pre-pandemic fiscal '20 comparable period.\n\nAs Corie noted, from a category standpoint, the largest contributors to the comparable sales decline in the quarter were computing and home theater. In our international segment, revenue decreased 9.3% to $760 million. This decrease was driven by a comparable sales decline of 4.2% in Canada and the negative impact of 420 basis points from unfavorable foreign currency exchange rates. This marks the first quarter where Mexico was fully removed from the prior year comparison.\n\nTurning now to gross profit. Our enterprise rate declined 160 basis points to 22.1%. The domestic gross profit rate declined 170 basis points, which was primarily driven by the lower services margin rates, including pressure from Totaltech. In addition, lower product margin rates and the impact of higher supply chain costs also negatively impacted our rate during the quarter.\n\nThese items were partially offset by higher profit-sharing revenue from the company's credit card arrangement. As a reminder, the approximately 100 basis points of gross profit rate pressure from Totaltech primarily relates to the incremental customer benefits and the associated costs compared to our previous Totaltech support offer. Our product margin rates were lower than our expectations in Q2, driven by higher levels of promotionality. Generally, lower consumer demand has combined with the higher levels of inventory across the CE industry, which has resulted in more discounting across most of our categories.\n\nAs Corie mentioned, overall, the level of promotionality has returned to pre-pandemic levels, which is slightly ahead of our expectations earlier in the year. Moving next to SG&A. As I mentioned earlier, our enterprise non-GAAP SG&A decreased $129 million, while increasing 120 basis points as a percentage of sales. Within the domestic segment, the primary driver of the reduced SG&A was lower incentive compensation of approximately $135 million.\n\nLet me add some additional details on the incentive compensation expense, which, year to date, is approximately $265 million lower than last year through the second quarter. Based on our current outlook for this year, we are expecting to be below the required financial thresholds for short-term incentive performance metrics. This compares to last year when payouts were near the maximum levels. As a result, we anticipate additional incentive compensation favorability in the second half of the year.\n\nOn a non-GAAP basis, our effective tax rate was 16.7% versus 8.4% last year. For the full year, we now expect our non-GAAP effective tax rate to be approximately 23% versus our previous guidance of approximately 24%. Moving to the balance sheet. We ended the quarter with $840 million in cash.\n\nAs Corie mentioned, at the end of Q2, our inventory balance was approximately 6% lower than last year's comparable period. And we continue to feel good about our overall inventory position as well as the health of our inventory. Year to date, we have returned a total of $862 million to shareholders through share repurchases of $465 million and dividends of $397 million. We paused share repurchases during the second quarter, spending only $10 million.\n\nLooking forward, we will continue to assess the appropriate timing for resuming share repurchases. We are committed to being a premium dividend payer. Based on our current planning assumptions for fiscal '23, our quarterly dividend of $0.88 per share will fall outside of our stated payout ratio target of 35% to 45% of our non-GAAP net income. We viewed this target as a long term in nature and do not plan to reduce the dividend should it fall outside of the range in any one year.\n\nFrom a capital expenditure standpoint, we now expect to spend approximately $1 billion during the year. This is slightly lower than our previous outlook of approximately $1.1 billion. However, it exceeds the level of investment we have been making over the past few years. The largest driver of the increased spend this year compared to prior trends is store-related investments.\n\nThis includes both our 40 experiential store remodels, as Corie mentioned, as well as general improvements in a number of our other locations after delaying the work the past couple of years during the pandemic. Let me next share more color on our guidance for the full year, starting with our revenue assumptions. As I mentioned at the start of my comments, we are assuming comparable sales for the year to decline in the range of around 11%, which represents a comparable sales decline for the remainder of the year and is similar to what we just reported for Q2. In addition, this reflects an assumption that our revenue growth versus fiscal '20 will continue to slow and that revenue in the second half of the year will be very similar to comparable pre-pandemic fiscal '20 time period.\n\nThis is due to a belief that the current macro environment trends could be even more challenging and have a larger impact for the remainder of the year. This aligns with the trends we are seeing so far this quarter as August revenue declined approximately 10% versus last year. When comparing to fiscal '20, August revenue increased in the low single-digit range, which is a sequential decline from the second quarter trends. Our outlook for a non-GAAP operating income rate of approximately 4% for the year is anchored to our negative 11% comparable sales assumption.\n\nThis represents a decrease of 200 basis points to last year, with roughly half of the decline from lower gross profit rate and half from higher SG&A rate. As you may recall, our original guidance entering the year included a non-GAAP operating income rate decline of approximately 60 basis points, which was expected to come almost entirely from the gross profit rate, with Totaltech being the primary driver. The pressure we are expecting from Totaltech continues to align with our original expectations, while the additional gross profit rate pressure in our revised outlook is largely due to higher promotional activity in the consumer electronics industry. From an SG&A standpoint, we have continued to lower our forecasted SG&A spend as the year has progressed, but not at the same pace as our lowered sales expectations.\n\nAs I shared earlier, our outlook for the year assumes incentive compensation to be significantly below prior-year levels. Compared to last year in our original outlook, we are planning for lower store payroll expenses and other variable expenses. We've also reduced spend in discretionary areas by increasing the rigor around backfilling corporate roles, capital expenditures, and travel. Partially offsetting these items are increased investments compared to last year in Best Buy Health, technology, and our store remodel work.\n\nNext, let me spend a few moments on restructuring. In light of the ongoing changes in business trends, during Q2, we commenced an enterprisewide restructuring initiative to better align our spending to critical strategies and operations, as well as to optimize our cost structure. We incurred $34 million of such restructuring costs in the second quarter, primarily related to termination benefits. We currently expect to incur additional charges to the remainder of fiscal 2023 for this initiative.\n\nConsistent with prior practice, restructuring costs are excluded from our non-GAAP results. Lastly, let me share a couple of comments specific to the third quarter. We anticipate that our third quarter comparable sales declined slightly more than the negative 12% we reported for the second quarter. We anticipate the year-over-year decline in our non-GAAP operating income rate will be similar to or slightly higher than our second quarter results.\n\nThis includes a little less gross profit rate pressure as we lap the last year's national rollout of Totaltech during the quarter. However, we expect a little more SG&A rate deleverage in Q3 from the larger sales decline. I will now turn the call over to the operators for questions.\n\nOperator\n\n[Operator instructions] The first question comes from the line of Greg Melich from Evercore ISI. Please go ahead.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nHi. Thanks. I'd love to finish where you -- or start where you finished, which was the third quarter guidance on margin decline and what it implies for the fourth quarter. I want to make sure that, that OI decline that would be in basis points versus the second quarter down to 60.\n\nAnd does that imply that in the fourth quarter, EBIT margin should only be down maybe 50 bps and would be well above 4% in the fourth quarter? And then I have a follow-up.\n\nMatt Bilunas -- Chief Financial Officer\n\nYes. I think based on the implied comments for Q3, what we said is a similar OI rate decline as Q2, if not slightly higher, which is about 280 basis points on the math. It would imply that Q4 does improve from an EBIT rate perspective, the gross margin rate pressure in Q4 will abate a bit compared to the previous quarters as we've lapped the Totaltech. And we're beginning to lap some of the product margin rate pressures we experienced last year as promotionality started to return.\n\nBut you're starting to see more SG&A to leverage in Q4 considering where sales are trending in comparison to the prior quarters.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nGot it. And my follow-up was more on the top line on the consumer. I think, Corie, you mentioned seeing some trade down in some categories. Could you talk about which categories you're not seeing it in and where there seems to be a good sell-through and whatever you can get?\n\nCorie Barry -- Chief Executive Officer\n\nYes. I mean there's -- there are categories where the price points and decisions around the type of product matter. Large TVs is the example we use. There are other categories like let's take mobile phones where it's not as much a decision between trading up or trading down.\n\nYou want a certain brand. You want a certain type of phone. And so -- or even some of what we're seeing in gaming, where as much of the kind of gaming hardware as we can get our hands on, the consumer is looking to purchase. So, that's why it isn't perfectly even throughout the categories in our business, in particular, because sometimes, you're very brand-specific.\n\nAnd then sometimes, you're more brand-agnostic and you're just looking for the right experience.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nGot it. That's great, and good luck.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nMatt Bilunas -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. We'll now take our next question from Simeon Gutman from Morgan Stanley.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood morning, everyone. I wanted to ask about just the high-level backdrop. Realized, you know, a year ago, things felt different in terms of sales and promotions. I wanted to ask you, Corie, is it getting easier to predict the business, is the visibility getting better? Meaning, are we bottoming in certain categories, you know, in terms of units? And then as you look around the corner to whether it's -- you know, I don't know if it's promotions creating the deflation or it's consumers trading down.\n\nBut do you see a flattening that the current, you know, environment we're in is starting to stabilize?\n\nCorie Barry -- Chief Executive Officer\n\nI wouldn't say it's become phenomenally easier to exactly see around the corner. Simeon, I give our teams a great deal of credit for working hard to catch trends quickly. I think what makes the current environment the most volatile that I've seen is the quantity of inventory at other retailers and the promotional activity correspondingly the markdowns with some of those heavier inventory levels. I think that's the part that right now makes the business a little more volatile.\n\nI think as some of those inventory levels normalize a little bit more, then I do think you're perhaps in a more normalized environment. And Matt even hit on it when he was talking about the Q4 EBIT rate. You start to lap some of those promos that we actually started to see in consumer electronics a more promotional environment in Q4 of last year. So, I think as you work through the back half of this year, Simeon, my point of view is it starts to stabilize a little bit.\n\nBut I hedge that just because there's so much inventory that's in the marketplace right now, A. And B, it is still a really volatile macro environment. And I think you've got a very uneven consumer who is making corresponding choices depending on how long inflation lasts, and like I said in my prepared remarks, especially in those core categories like food, rent, housing. So, you know, I'd love to say it's perfectly stabilizing, and we can predict it, but I still think you have a lot of factors at play that are influencing consumer behavior.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnd maybe the follow-up is the promotions creating year-over-year price deflation in the categories, or is it the lack of innovation where you're already starting at \"year-over-year\" deflationary price point and then promotions are compounding that? And I guess the promotionality is the piece that resolves it or is there innovation around the corner where you -- where the industry moves back to, you know, some type of inflation?\n\nCorie Barry -- Chief Executive Officer\n\nSo, two pieces. One, right now, I believe the impact is mainly promotionality, because you've had really a sustained period here of a couple of years where it was disproportionately low promotionality because there was such high demand and such low inventory levels. And so right now, it really is a function of those promotions coming back.To your second point, this is a really important part of the thesis and what I think is important about Best Buy. Our vendors who are sure are going to continue to innovate, looking for that kind of next cool product, that will continue to drive demand.\n\nAnd so I think my hypothesis is, it's been a little harder to have all your innovation engines flexing here in the last two years when you're trying so hard to produce at the levels that we've needed. So, every ounce of energy has kind of been focused on production. And I think that in the future here, as especially these inventory levels normalize, I think you've got a number of vendors who are really interested in. Now that you have this much larger installed base of connected devices in people's homes, they're also going to be very interested in how do you upgrade those devices, how do you connect those devices, how do you help a customer live in their homes, which still increasingly people are spending more time in.\n\nSo, I think that's the next phase, Simeon, that I believe we'll see from here, which is more of that innovation engine. And it's always been true in CE. And the hardest part is I cannot always tell you exactly what the next innovation is going to be. But we definitely know that behind the scenes, you continue to see innovations in spaces like what you just talked about hearing, in spaces like computing, with hybrid work models clearly becoming the future and some of the replacement cycles there even speeding up a bit.\n\nSo, I think that will be the next level. But for right now, you're really just kind of course correcting for two years that were very, very low in terms of promotionality.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGreat. Thanks, Corie. Good luck.\n\nCorie Barry -- Chief Executive Officer\n\nYou bet. Thank you.\n\nOperator\n\nThe next question comes from Anthony Chukumba from Loop Capital Markets. Please go ahead.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGood morning. Thanks so much for taking my questions. I guess my question was on the back-to-school selling season. Now you talked about the fact that August was down -- August comps were down about 10%.\n\nAnd I guess, you know, what does that say about how back-to-school performed? And is there any read through for back-to-school for holiday? I know they're different. But I don't know if that gives you any indication or any thoughts about the upcoming holiday selling season. Thank you.\n\nCorie Barry -- Chief Executive Officer\n\nYes. Thanks, Anthony. For us, the back-to-school sales are actually slightly ahead of our, what I'll call, kind of tempered expectations. And it's following a trend that was really more pertinent prior to the pandemic, which is people were shopping later and later.\n\nAnd not super surprising given that this is a very different school year than we've seen for the past two years. And you probably got parents and kids who are just kind of really trying to figure out, how do I gear up for a year that at least is starting out much more in person and especially at the collegiate level much more on-campus. So, if anything, it's been a little bit better than we had thought and it's following that same trajectory. In terms of implications for the holiday, I think it's less about what does back-to-school portend.\n\nI think it's more about kind of broadly what we're seeing. So, we mentioned we're seeing a customer who's more value-oriented, who is definitely moving more toward some of those sale events. And so I think our hypothesis is you're going to see a holiday that starts to look a little bit more like what we saw pre-pandemic. Maybe comes a little bit later, it's probably promotional in our space.\n\nThat's part of what is embedded in the guide that Matt talked about. And I think it's going to be, my personal point of view, a little harder to pull those sales into October when there's not -- remember, for two years, in October, we were yelling at the consumer, make sure that you get your inventory because there isn't enough. Obviously, the backdrop looks a little different there. And so, I think you might have a consumer who's willing to wait, look for the deals and really look for those great values.\n\nAnd again, like I said, I'm not sure back-to-school is the indicator of that. I think that's just more broadly what we're seeing in the macro and in the consumer.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nVery helpful. Good luck with the remainder of the year. Thank you.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nChris Horvers from J.P. Morgan, please go ahead.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks. Good morning. So, I'll follow up on the prior question initially. So, as you think about the minus 10% sales in August to date and a later, you know, arriving back to school, that would suggest you still have a few weeks ahead of you.\n\nBut then the October's compare much harder. So, are you basically taking the three-year comp trend and degrading it into the rest of the quarter?\n\nMatt Bilunas -- Chief Financial Officer\n\nYes. That's what the -- Chris, that's what the numbers would imply. I think 10% in August, if you think about the sequential stack of Q3 on a three-year basis, with a comp that's slightly below a 12% that we saw in Q2, would imply that it's in the low single-digit area of comp performance for the entirety of the quarter. So, yes, that's what assumes a sequential declining as the year progresses, and especially into Q3 and Q4.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then, you know, have you -- I'm curious what -- how you're thinking about sort of unit pull forward versus, you know, dollar volume? Because obviously, to your point, Corie, dollar volumes are being exaggerated right now because of the level of inventory in the market. So, how are you thinking about like the, you know, everlasting question of pull forward around the pandemic and share of wallet on the unit side within the computing and TV category?\n\nCorie Barry -- Chief Executive Officer\n\nMaybe I'll start and then Matt can add on. I think we are watching both sides of the equation carefully, both the kind of ASP side of things and also the unit side of things. Broadly, on the whole, we're seeing a stabilization of ASPs year over year. And so you can imply in that, obviously, you're seeing a bit of unit decline.\n\nAnd I think what's interesting right now is you've still got a consumer who is spending on the whole quite a bit. I think they're being choosier, and it's uneven as to where they're spending. And so, I think it makes it a little hard to answer the question exactly how much is pulled forward because you're against a very different backdrop than you were even six months ago. I think what is -- again, and I'll go back to it, what for us is most compelling is that no matter what, you have a massively higher installed base that is in people's homes and people are spending more time in their homes than ever.\n\nAnd in a category like computing, we can already see that some of those upgrade cycles are happening a little bit faster than they were before. So, that would imply, more than anything, it was more incremental purchases, and then you'll see that upgrade over time. And again, I mean, now it's been 2.5 years since some of the original computing devices were purchased at the very beginning of the pandemic. So, you're going to have some compelling use case changes here over the next year or two.\n\nSo, it's a long way of saying, I think it's difficult against the current macro backdrop to make a precise indication of how many units were pulled forward and how much was incremental. I think instead, we remain focused on making sure we have the right inventory there for our customers and being ready as they're more ready to upgrade their devices.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nThank you. The next question comes from Liz Suzuki from Bank of America.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. So, regarding the pulling of the fiscal '25 targets that were originally communicated in March, what do you think is the biggest change that's occurred in the last five to six months? And is it more of the top line growth expectations that have become less attainable or the longer-term margin target?\n\nMatt Bilunas -- Chief Financial Officer\n\nYeah, I'll start and Corie can jump in. Yeah, I think if you look at where we planned the year to be, at the beginning of the year, we planned comps in the minus 1% to minus 4% range. And now what we're seeing is it's around a minus 11% comp for the year. It's a pretty significant sales decline, again, more around the macro environment worsening.\n\nWe expected the year to come down from an industry perspective as we cycle some of the very large growth over the last couple of years. So, that change of the macro and the consumer has really caused the sales to be much lower this year. So, I would say that's probably the biggest impact as you think about our FY '25 targets going forward because some of the targets that also need scale to drive some of the benefits of the bottom line as well. So, that's what we need time to assess.\n\nCorie Barry -- Chief Executive Officer\n\nThe only thing I would add is that, and I said in the prepared remarks, but it bears repeating, strategically, what we laid out, we still have incredible confidence in. And that's why we want to make sure we're getting updates on some of those strategic investments that we're making. I think the baseline of where we're starting from, to Matt's point, is quite different than what we originally assumed.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nGot it. OK. So, I mean, in theory, we could think about some of those targets as just being, you know, still achievable, but a little further down the line than what you originally thought given where the year is going to shake out.\n\nMatt Bilunas -- Chief Financial Officer\n\nI think the premise of us continue to grow our business and drive more efficiency and profitability in the business over time is absolutely what we intend to do as we think about once the business stabilizes and operationally, the strategies are all very sound. And we're very pleased with how they're progressing. It's just that the backdrop as much than it was.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you.\n\nOperator\n\nMichael Lasser, UBS, please go ahead. Your line is open.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. Putting aside the next quarter or two, as you look toward next year, given some of the changes that you've made, like the restructuring, the rollout of the outlet locations and other streamlining, could your operating margin be flat to up on a flat to down sales number?\n\nMatt Bilunas -- Chief Financial Officer\n\nYeah, maybe. I mean I think what we're trying to do is assess what this year looks like. We're trying to, as you can imagine, fortify our business a bit and understand how do we point resources and work toward the strategically relevant important things as we -- as well as the operations. And I think what we're trying to do is continue to assess the top-line environment, the macro environment to understand where sales will go next year, all the while knowing that the sales growth, the CAGR leading up to the pandemic through FY '20, the last three years, was over 3%.\n\nSo, we believe the industry, we believe Best Buy will return to growth at some point as we navigate some of these choppier waters. At the same time, we're taking the right steps forward to optimize our business and set ourselves up structurally as we look forward into next year and the years after that and drive our strategy at the same time.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you. My follow-up question is on Totaltech support. You now will be lapping the full rollout this quarter. Given some of the longer tenure of the original members, are you seeing the sales lift from those folks that would justify the return on investment? And would you expect that the behavior of those newer members will be different? And if not or if it is, would you think about potentially rolling back Totaltech support if it wasn't meeting your return hurdles?\n\nCorie Barry -- Chief Executive Officer\n\nSo, we chatted a bit in the prepared remarks and said we still like what we were seeing in terms of -- for right now, and again, we haven't even lapped a year, in terms of the engagement and the spend of the existing cohort of Totaltech support members. We also said, just like you would with any membership program, we are going to keep looking at the benefits that are included, what customers value, what keeps customers sticky to Best Buy, and we will continue to iterate on the offer. So, I don't think it's as simple as a light switch, like is it on or is it off? I think there's a lot about the offer and behaviors that we're seeing that is really compelling. And at the same time, we want to make sure that the offer is used and is engaging for customers and is over time keeping them sticky to the brand.\n\nAnd we said it in the remarks, it is difficult because frequency is lower in our category, so it takes us more time, especially against the macro backdrop that has changed as dramatically as this one has. It's going to take us more time to assess. Over the long term, is this doing what we want it to do? And so, for right now, we like what we're seeing in the cohort of customers. It's still early.\n\nIt's against an uneven backdrop. And we're going to continue to iterate on the offer to make sure, at the end of the day, what's most important is that it keeps customers engaged with the brand.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much, and good luck.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nBrian Nagel, Oppenheimer, please go ahead.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi. Good morning. Thank you for taking my questions.\n\nCorie Barry -- Chief Executive Officer\n\nGreat.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nSo, I have two questions. Maybe I'll just merge them together. I mean, first off, with regard to sales, are you seeing any increased variability across, you know, geographically or otherwise that would maybe tie this more together with either inflationary pressures or some of the lasting effects of the pandemic? And then my second question, I guess just stepping back, thinking about the different drivers of sales. From a manufacturing standpoint, your manufacturing partners, has there been a pullback on -- you know, through the pandemic, through the supply chain constraint, it's pull back on sort of say, driving innovation that may be changing now as some of these constraint keys that could ultimately become a better sales driver?\n\nMatt Bilunas -- Chief Financial Officer\n\nYeah, sure. I'll start and then Corie can add on, Brian. I think from a sales perspective, from a geography base, I think nothing we would necessarily call out. I would say though that in some of our test markets, we are seeing good results in terms of how we're looking at our store portfolio.\n\nAnd in fact so, we are seeing a bit of improvement on some of our experiential stores that we've rolled out. And we've rolled out two, we're rolling out more, and we've seen a good lift in some of those locations. And so, some of the tests are yielding some positive results from a store portfolio. But that wouldn't necessarily mean it's due to inflation being different across the country.\n\nCorie Barry -- Chief Executive Officer\n\nYeah. We hit on this a little bit earlier, Brian. But I do think our manufacturing partners have been doing everything they can to produce as much product as possible over the last two years. So, kind of writ large, if you think about the industry broadly.\n\nAnd a hypothesis would be that does make it a little bit more difficult to innovate at the pace that you would like because you're just working so hard to produce what you need to for the demand that's in front of you. And so, I think as hopefully, you start to see a more -- a little bit more normalized demand environment, that absolutely -- I can't imagine a world where the manufacturers that we work with aren't working morning, noon, and night to try to think through how to innovate on the products that we have today to drive more of that replacement, more of that consumption going forward. And so, you know, I don't have an exact measurement to tell you how much are they innovating last year versus next year. But I absolutely fundamentally believe, you've got a manufacturer set that is looking to capitalize on an increasingly digital consumer who is more and more willing to use these products in their home.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nGot it. I appreciate it. Thank you very much.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nKate McShane from Goldman Sachs, please go ahead.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking our questions. I just wondered if you could help us think through the Totaltech support, not to beat a dead horse with regards to Totaltech support.\n\nBut just with regards to its impact to gross margins. I know you're lapping the launch. But is it a bigger headwind sequentially? Just thinking through that maybe more people are going to come through the store for back-to-school and holiday versus maybe the first half.\n\nMatt Bilunas -- Chief Financial Officer\n\nNo. I'll start, and Corie can add if she like. Kate, it's not a -- it doesn't -- the pressure does not increase as we get into the back half of the year. In fact, it abates a bit as you get into Q3 as we lap the launch.\n\nAnd so, even with the higher volumes expected coming through in Q3 or Q4 from a holiday perspective doesn't necessarily create more pressure effectively on a year-over-year basis. It mitigates as the quarters progress. At the beginning of the year, we talked about how the pressure this year was, you know, between 60 and 80 basis points, and that's about what we are seeing right now for the year. On a pre-pandemic basis, you know, it would represent about 100 basis points of pressure from where we were before.\n\nBut again, as we -- as we scale that offer and we sign up more people, the pressure subsides as you scale on those sales over time when you drive more incremental product sales.\n\nCorie Barry -- Chief Executive Officer\n\nAnd I think the key here is that the goal of the program is ultimately to create an offer that has further reach and has a broad appeal, and that, over time, we drive frequency and greater share of wallet with our customers. Obviously, that's going to take time. And to Matt's point, it's not that it's any more impactful. Actually, as we start to get scale, it is helpful on the Total business because you are, in theory, growing that frequency and growing that share of wallet.\n\nIt just takes us time to get there.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nOK. Thank you. And my follow-up question is, aside from some of the labor adjustment that you made, just where you're focused on reducing costs and better -- to better align costs with demand?\n\nMatt Bilunas -- Chief Financial Officer\n\nSure. I think we have probably a whole lot more to say. As you can imagine, we're still working through those plans, and we would want to share internally as well before. I think the $34 million termination is basically termination benefits that we took in Q2.\n\nThe two aspects of that are the voluntary early retirements and then the workforce optimization. Those are what we've done so far. We'll continue to evaluate other actions. But broadly speaking, we're looking to understand how our business has changed over the last number of years with a digital business that's now double what it used to be in a very different looking consumer to understand where do we need to point our resources and efforts strategically and operationally to make sure we're prepared for how our customers want to shop and providing the best experience for them.\n\nAnd so, that will ultimately provide some -- also some efficiency opportunities as we look forward, but also just strategically position us better as we navigate through some of the difficult macro environments that we're seeing right now.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We'll now take our -- we have time for one last question today from Mike Baker from D.A. Davidson. Please go ahead.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nOK. Hi. Thanks, guys. I wanted to ask about the promotions and inventories a little bit, just to follow up on that.\n\nWhat areas are you more or less promotional in? And it sounds like the issue to me -- it sounds like -- it looks like your inventory is pretty clean. It's down 6%, but competitors are still heavy. Do you expect that to be a situation to be rectified by the holidays? And then one last question, if I could squeeze it in. Any comments particularly on what you're seeing in terms of gaming trends within the entertainment category, which was down about 9%, a little bit better than the Total? How did gaming perform within that? Thanks.\n\nMatt Bilunas -- Chief Financial Officer\n\nSure. Overall, as we said, promotionality is a bit higher than in Q2 than we expected, and we built those expectations into the remaining part of the year. What we're seeing is generally  more -- most of our categories are returning to pre-pandemic levels. So, there really isn't -- there's always a few areas that may not be quite back there yet.\n\nBut generally, we're back to where our levels of promotionality were before the pandemic started. And that has more to do with the general amount of inventory in the channel right now that, as the consumer demand wanes and inventory increases, there's just generally the dynamic of having more promotionality. It's less around needing to mark down our inventory more because it's not in a healthy position. It is a very healthy position.\n\nIt's simply just normalizing to where we were pre-pandemic. And so that marketplace competitive dynamic is what's driving a little bit of that promotionality. Again, maybe not as much as others because we started the year expecting promotionality return to pre-pandemic at some point. It's just happening a little bit faster.\n\nIn terms of gaming, you know, it still continues to be an area where if we had more inventory, we would be able to sell it. The demand outpaces the supply as well. I think, you know, we're seeing actually some -- the gaming console side of the business is relatively flat to last year. We're seeing a little bit more pressure year over year from a software perspective and a peripheral perspective.\n\nBut if you think about where gaming, if you took all of gaming, not just the console cycles, you took in PC gaming and you brought in VR and all the things related to a gaming area, it's actually up over 50% in Q2 versus the pre-pandemic level. So, it's seeing a lot of growth over the last couple of years, although, like most categories, Total is coming down a little bit on a year-over-year basis.\n\nCorie Barry -- Chief Executive Officer\n\nMike, the last thing that I would add on the inventory question is it is a -- I'm very proud of the work that the teams have done. I'm proud to head into holiday in a good healthy inventory position. And we said it in the prepared remarks, that allows us a little bit more demand. So, I think it is a really good situation to be in.\n\nAnd with that, I think yours was the last question. Thank you, all, so much for joining us today. And we look forward to updating you on our results and our progress during our next call in November.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMollie O'Brien -- Vice President, Investor Relations\n\nCorie Barry -- Chief Executive Officer\n\nMatt Bilunas -- Chief Financial Officer\n\nGreg Melich -- Evercore ISI -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nKate McShane -- Goldman Sachs -- Analyst\n\nMike Baker -- D.A. Davidson -- Analyst\n\nMore BBY analysis\n\nAll earnings call transcripts"
}