{
  "companyName": "Beyond Meat, Inc.",
  "companyTicker": "BYND",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/beyond-meat-inc-bynd-q3-2022-earnings-call-transcr/",
  "content": "Beyond Meat, Inc. (BYND -0.73%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Beyond Meat, Inc. 2022 third quarter conference call. [Operator instructions] Please note, this event is being recorded. At this time, I'd like to turn the conference over to Teri Witteman, chief legal officer and secretary.\n\nPlease go ahead.\n\nTeri Witteman -- Chief Legal Officer and Corporate Secretary\n\nThank you. Good afternoon, and welcome. Joining me on today's call are Ethan Brown, founder, president and chief executive officer; and Lubi Kutua, chief financial officer and treasurer. By now, everyone should have access to the company's third quarter earnings press release filed today after the market closed.\n\nThis document is available in the Investor Relations section of Beyond Meat's website at www.beyondmeat.com. Before we begin, please note that all the information presented on today's call is unaudited. And during the course of this call, management may make forward-looking statements within the meaning of the federal securities laws. These statements are based on management's current expectations and beliefs and involve risks and uncertainties that cause actual results to differ materially from those described in these forward-looking statements.\n\nForward-looking statements in the earnings release that we issued today, along with the comments on this call, are made only as of today and will not be updated as actual events unfold. We refer you to today's press release the company's annual report on Form 10-K for the fiscal year ended December 31, 2021, the company's quarterly report on Form 10-Q for the quarter ended October 1, 2022, to be filed with the SEC and other filings with the SEC for a detailed discussion of the risks that could cause actual results to differ materially from those expressed or implied in any forward-looking statements made today. Please note that on today's call, management may make reference to adjusted EBITDA, which is a non-GAAP financial measure. While we believe this non-GAAP financial measure provides useful information for investors, any reference to this information is not intended to be considered in isolation or as a substitute for the financial information presented in accordance with GAAP.\n\nPlease refer to today's press release for a reconciliation of adjusted EBITDA to its most comparable GAAP measures. And with that, I would now like to turn the call over to Ethan Brown.\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nThank you, Teri, and good afternoon, everyone. Last month, we signaled that the business continues to navigate a challenging period where broader economic conditions, particularly inflation, category-specific headwinds and increased competition have, over the past 12 months, combined to disrupt what has been over a decade of growth. This disruption has been in contrast to the year we had planned, where we expected a resumption of our strong growth trajectory as the pandemic receded in the majority of our markets. In my remarks today, I will briefly unpack what we believe are the key drivers of this disruption in our growth, the elements that we believe are transitory and those that may be more persistent.\n\nI will then walk through the full force transition underway toward accelerated cash flow positive operations in route to a sustainable growth model. Before doing so, I would like to take a moment to offer a broader perspective. As is the case with many emerging industries that challenge the status quo, the path to mainstream adoption is rarely straight and smooth. Turbulence along the way generally does not signal a diminished long-term total addressable market, or TAM.\n\nThe history of innovation is replete with examples of this phenomenon, captured across a host of disruptive technologies. We are in one such moment as a brand category and are operating with urgency and decisive action to navigate it. We do so with an unwavering focus on our $1.4 trillion TAM, the global meat market and continued execution of our long-held goal of achieving taste and price parity with animal protein. As we seek to pivot the business to cash flow positive operations and quicken our path to profitability, we are committed to transparency and accountability.\n\nTo this end, in my remarks, I will center on a clear and highly focused set of actions that we are taking, which are intended to fortify the foundation of our business and drive long-term value for shareholders. For the next several quarters, I will return to these actions to track progress. And as we advance, provide a more fulsome look at the underlying financial metrics we are using beyond free cash flow to form the backbone of a durable financial algorithm and total shareholder return equation. With that, I will now turn to a brief overview of current market dynamics.\n\nCurrent economic climate has not been timed to plant-based meat. The most quantifiable trend, which we believe is transitory, is a well-established history of consumers trading down among proteins during difficult economic times. This appears to be in full swing today. With persistent and 40-year record inflation in grocery stores, shoppers are seeking to dial out inflation by, among other measures, switching out higher cost proteins for lower-cost proteins, with that decline, SPAM rises and so on.\n\nAnd while these items are on either end of the continuum, consumers are trading down throughout, generally from higher cost beef and pork items to lower-cost chicken. In this environment, the category in Beyond Meat should be expected to see declines as consumers flock to cheaper proteins. Correspondingly, the household penetration for the plant-based meat category according to numerator data, slipped for a second consecutive quarter falling roughly 20 basis points versus second quarter of 2022. Recall that Q2 saw the first sequential decline in household penetration for the category since at least Q1 of 2018 and which is as far back as the data set goes.\n\nFinding trend in household penetration holds true for us and most of our peers as well, and we have seen some brands significantly retrench or exit the category altogether in the U.S. Despite the category slowdown, there has been a tremendous increase in the number of competitive entrants and activities. As we have maintained, we believe that healthy competition within plant-based meat is a good thing as it brings investment in marketing to the category. However, in the current environment, we are not seeing this benefit of competition, instead more companies are pursuing the same or fewer consumers.\n\nThough we remain the category leader in refrigerated plant-based meat the volume of competition has eroded some of our share. As noted a moment ago, a shakeout does appear to be underway, and we expect more brands to either retreat or consolidate a less cluttered playing field to emerge in the midterm. A less tangible, though important dynamic is also present within the category today. As consumers intensify focus on making ends meet, health and environmental considerations take a back seat.\n\nThis phenomenon makes it more difficult to broadly convey our core value proposition to the consumer, a topic I will return to later. To summarize the current situation, we face an economy where blistering inflation pressure is shifting consumer behavior in the grocery store, category where competition has dramatically increased despite a broad and precipitous category slowdown and a consumer base whose focus understandably turned to fulfilling immediate basic needs of pursuing the broader benefits that represent our core value proposition. These trends have precipitated a substantial drop in revenues for our business, the impact of which is a series of knock-on effects across our income statement. They include a sizable reversal and expected improvements in gross margin as we contend with lower overhead absorption, greater variability of our inventory reserves and excess capacity and related underutilization and termination fees within our co-manufacturing network.\n\nPath forward in this environment is clear and it at its foundation as a pivot from the growth above all operating model that has characterized our business to date to one that prioritizes positive cash flow and sustainable growth. This strategic shift is designed to stabilize the business, nurture our most important growth paths and position us to drive and capitalize on renewed category growth as the economy emerges from its current state. We will use the following three tenets to underpin our path to cash flow positive operations and sustainable growth, and I will return to these in subsequent quarters to track progress. One, we are significantly reducing operating expenses while focusing on a more narrow set of strategic partner, retail and foodservice opportunities and utilizing lean value streams across our beef, pork and poultry platforms.\n\nTwo, for the time being, we will be emphasizing cash flow-accretive management of our inventory with a focus on profit dollars versus maximizing percent margin. Currently, we are further rationalizing our production network in the context of more moderate volume assumptions to improve overhead absorption, address underutilization fees and support margin improvement. Three, we are applying a laser focus to our sales and marketing activities, emphasizing those opportunities that we believe strike the right balance between restoring near-term growth and nurturing our most valuable long-term opportunities. Though my comments today tend to focus on our U.S.\n\nbusiness and global partnership activities, we are applying similar measures across our EU and China operations. I will now address each of the three pillars of our go-forward strategy in greater detail. One, operating expenses. We continue to bring our total operating expenses down and expect to drive further progress.\n\nCompared to Q1 of this year, we have reduced total operating expenses by 23% from $97.8 million to $74.9 million in Q3, and we expect opex to fall even further in Q4 and thereafter. To date, we have instituted two separate reduction-in-force actions, one in August and one in October, totaling approximately 240 positions. Together, these actions represent more than 20% of our global workforce. With our most recent reduction-in-force, we are expecting operating expense savings of approximately $39 million over the next 12 months, excluding one-time separation costs of approximately $4 million.\n\nAlthough letting go of these dedicated, passionate and talented team members was painful, these actions were necessary to rightsize our organization so that we are aligned with current business conditions. Moving forward, support the execution of a more narrow set of key priorities while delivering further opex reductions. We are implementing lean value streams across the organization around our three product platforms of beef, poultry and pork. I have, along with the team, strong enthusiasm around this implementation as lean value stream management comports well with and extends throughout the organization, several of the principles of our Beyond Meat's rapid and relentless innovation program.\n\nTwo, aggressively managing down inventory and rationalizing our production network. We are focused on maximizing cash flow generation and profit dollars when it comes to inventory management over percent margin. Specifically, in the context of a more limited number of segments, we are testing a pricing reduction that more quickly collapses the pricing delta between one of our core products and its animal protein equivalent. We are implementing these programs in a highly targeted manner where we believe doing so will welcome new points of distribution and new consumers to our brand while increasing volumes throughout our facilities and network.\n\nWe expect these activities to accelerate our drawdown of inventory, which we already reduced by nearly $37 million since the end of Q1 and free up cash. In addition, we are taking immediate steps to rationalize our production network to address what we expect may be continued lower than previously planned growth. These activities include the further consolidation of production activities within our co-packing network, the full utilization of our own facilities by bringing in certain outsourced activities and in certain instances, redistributing production across our network to address volume commitments. These measures are critical to improving overhead absorption and minimizing unproductive idle fees.\n\nThree, restoring growth in retail and foodservice through a series of targeted innovation, sales and marketing execution. In the midst of all the noise in the broader economy and the specific challenges facing our segment and brand, it's important not to forget something. We remain an innovation engine working on one of the most powerful solutions, some of the most serious challenges facing our country and the world. As you will recall, this year, we were recognized by American consumers as the most innovative company in food as they in the same survey recognized Apple, Tesla and Amazon as the world's most innovative companies across technology, transportation and consumer goods.\n\nAs such, even as we continue to reduce our operating expenses and implement lean value streams, prioritize cash flow from inventory and rightsize our production network, we will do what we do best, innovate as we challenge and push our way into our long-term $1.4 trillion TAM. Specifically, in retail, we plan to restore growth to our core product offerings, burgers, beef and dinner sausage in the refrigerated set through exciting product renovation, and to leverage and support these renovations by pursuing distribution expansion, certain aforementioned strategic pricing activities and targeted marketing. These products which generally carry the highest margins across our product portfolio account for roughly three-quarters of our total gross revenues and the majority of our retail gross revenues. Previously teased our fourth iteration of our Beyond Burger, so I'll speak more openly about that particular item now.\n\nThough we will not give a release date for our retail channel. I will say that I'm thrilled with the improvements the team has made on the broader Beyond Burger platform. Throughout its development, I've watched key customers and stakeholders come through innovation center, try a version of this fourth generation product and quickly share my belief that is a meaningful advance toward our North Star of being indistinguishable from its animal protein equivalent. Though we have long emphasized the refrigerated meat taste next to animal meats as one of the long-term engines of significant growth, we do not discount the importance of the frozen aisle in grocery.\n\nAs such, we are bringing an increased amount of innovation to the frozen category. We are continuing to prioritize expanding distribution for our chicken tenders, which as you may recall, on the 2022 People Magazine Food Award, while adding a host of new easy-to-use, delicious offerings for busy families and consumers. These include the recently announced Beyond Steak, which truly delivers the juicy tender and delicious bite of seared steak tips with the added nutritional and environmental benefits of plant-based meat. This brand-new product, which like our chicken, was also the recipient of a well-recognized award, which will be announced soon, is now available at more than 5,000 Kroger and Walmart stores nationwide, as well as select Albertsons and Ahold divisions, with further distribution gains expected in the near future.\n\nReinforcing our health value proposition. Beyond Steak is low in saturated fat with zero milligrams of cholesterol and has no antibiotics or hormones. And as just announced, we followed up on the introduction of Beyond Steak with the launches of Beyond Chicken nuggets and Beyond Popcorn Chicken, which are rolling out at over 5,000 stores at national retailers like Walmart and Kroger, as well as select regional retailers like Ahold and Albertsons and is expected to expand into more outlets in the near future. As with tenders, these chicken products deliver tangible health benefits to the consumer including having 50% less saturated fat than the leading brand of traditional breaded chicken nuggets, zero milligrams of cholesterol and no antibiotics or hormones.\n\nFrozen plant-based chicken is the largest single subcategory in all of plant-based meats and continues to grow at a double-digit pace, so we are pleased to be expanding our presence of additional chicken items. Turning now to Foodservice. In the last year alone, Beyond Meat has executed an impressive number of launches and tests across the globe with our strategic partners. Specifically, in the last 12 months, we have had 25 trials for permanent menu launches with nine distinct products across our beef, pork and poultry platforms in 18 countries.\n\nThough these activities do not result in immediate sustained revenues, they represent very important seeds that we are planting for future growth. For example, across the McDonald's network, we have been busy launching the McPlant in Australia, the U.S., U.K., Ireland, Germany, Portugal, Taiwan, Austria and the Netherlands. And as of today, we are pleased to share that McPlant has already become a permanent menu item in the U.K. Ireland, Austria and the Netherlands.\n\nMoving on to Yum!. As you know, we tested Beyond Kentucky Fried Chicken here in the U.S. early this year, and we've launched Beyond Meat toppings with Pizza Hut locations across Singapore, Germany, Kuwait and the UAE, Canada, Guatemala and El Salvador. With Canada, Guatemala, El Salvador and Singapore already converting to permanent Beyond Meat menu items.\n\nMost recently, regarding Yum!, we are excited to be testing Beyond Carne Asada at Taco Bell occasions in and around Dayton, Ohio. The Carne Asada product represents the toil and ingenuity of many special and talented people across the Yum! and Beyond Meat partnership. It was not easy to bring to life and getting it right as it walks through the halls of real innovation, ideation, research, development, failure, iteration, breakthrough and back again, countless times, and then resounding success. It is something new to the world, delivering the taste, mouthfeel and satiate experience of its animal protein equivalent.\n\nAnd importantly, it is being offered at the same price as its animal protein equivalent. If you are in or near Dayton, it is well worth the trip to Taco Bell to taste the future. As I round out some of the latest strategic launches, I'd like to turn to Panda Express. In early September, Panda Express brought back Beyond The Original Orange Chicken to over 2,300 U.S.\n\nlocations for a limited time offering, following successful regional launch last year. As with McPlant to McDonald's, and Beyond Carne Asada at Taco Bell, I encourage you to stop by Panda Express and enjoy the absolutely delicious Beyond The Original Orange Chicken, tasting is believing. The final piece in this third pillar of our strategy is a more aggressive and more narrowly tailored application of our taste, health and planet message, focusing on those consumers who are most able to hear us during these difficult economic times. When I think about the first order of business and our long-term vision, building meat from plants that is indistinguishable from its animal protein equivalent, I am confident that we are advancing here by year.\n\nAnd when I think about the next critical step in our long-term strategy, driving down the cost of goods of our products so that we sell at or below price parity with animal protein in at least one category. I'm equally confident we are advancing the goal that I set three and a half years ago. where we need to do better and we'll do better is in connecting with the right consumer at the right time around the very real broader benefits of going beyond so that we can make the leap from early adopters to the early majority. I believe this to be the case with both our health and planet messaging as a brand and as a sector.\n\nWith health, we have allowed special interest groups to have a field day seating doubt by the health profile of what they call fake meet. I'd like to spend a moment on this point. We care about our ingredients and are proud of our process because we care about health at the very foundation of our brand. I returned to, for example, recent research conducted at the Stanford School of Medicine as part of our five-year plant-based diet initiative with the University.\n\nIn the first clinical trial published in the American Journal of Clinical Nutrition in August 2020, researchers reported declines in LDL or bad cholesterol and TMAO when participants switched from animal protein to plant-based Beyond Meat over successive eight-week periods. TMAO is a compound that forms in the gut and has been correlated with heart disease and certain cancers. As we move forward, we will be announcing a major partnership with a national health organization and taking other steps to highlight to consumers the tangible health benefits of Beyond Meat. Two, we need to do a better job helping the consumer better understand the connection between our products and climate.\n\nAgain, focusing on the right consumer at the right time when we have the greatest chance of being heard. The climate impact of our food production system exceeds that of our transportation system globally. Correspondingly, plant-based meat is one of the most immediate and powerful tools available to the public for addressing climate change. Here again, I return to research, which I shared earlier, conducted at the University of Michigan, in 2018, where the team performed a life cycle analysis of the original Beyond Burger versus a quarter-pound U.S.\n\nbeef burger and found that producing a Beyond Burger not only generated 90% fewer greenhouse gas emissions, but also used 99% less water, while requiring 93% less land. As I have long maintained, marketing is a lot easier when it's true, and in our case, as these and other data points suggest, we have a very real and compelling story to tell consumers on health and planet. What you'd expect from us going forward is more pronounced, narrowly targeted messaging around taste, health and planet directed toward those consumer segments most likely to listen to our voice. In closing, last month, as on this call, I signaled change in our growth strategy, namely after a long period of investment, I've set a clear target for our company to achieve cash flow positive operations within the second half of 2023.\n\nMy decision to accelerate positive cash flow operations and ultimately profitability is simultaneously a recognition of today's challenging economy and tomorrow's opportunity. We are and will be here for the long game. To reiterate, the three main pillars we are using to advance positive cash flow and implement a sustainable growth model are: one, continued reduction in opex and a narrowing of focus on key strategic partner, foodservice and retail opportunities while making further efficiency gains through lean value streams across our beef, pork and poultry platforms; two, emphasizing cash flow accretive management of our inventory with a focus on margin dollars versus maximizing margin percent and concurrently rationalizing our production network in the context of more moderate volume assumptions; three, narrowing our sales and marketing focus to a core set of activities that we believe strike the right balance between restoring near-term growth and nurturing our most valuable long-term opportunities. I look forward to returning to our call in the new year to update you on our progress across this critically important pivot and plan.\n\nWith that, I will turn it over to Lubi, our new Chief Financial Officer and Treasurer, to walk us through our third quarter financial results in greater detail and reiterate our outlook.\n\nLubi Kutua -- Vice President, Investor Relations and Financial Planning and Analysis\n\nThanks, Ethan. We recorded net revenues of $82.5 million in the third quarter of 2022, in line with the updated guidance we shared on October 14 and representing a 23% decrease compared to the third quarter of 2021. This result fell short of the expectations that informed our outlook on our Q2 earnings call, primarily as a result of weaker-than-expected demand in the category and especially within our core subcategory of refrigerated. In addition to overall category softness and as we shared in our October 14 press release, net revenues during the third quarter were also negatively impacted by increased competition, certain customer decisions such as reductions in targeted inventory levels and postponed and/or canceled promotions, as well as delayed and/or canceled product promotions and introductions relative to our prior plans.\n\nIn aggregate, total volumes sold during the third quarter of 2022 declined 12.8% compared to the year ago period, primarily as a result of the factors I just described, while net revenue per pound decreased approximately 11%. The decrease in net revenue per pound was primarily attributable to strategic but limited price reductions in the U.S. and broader list price reduction in the EU, increased trade discounts, unfavorable changes in foreign exchange rates and to a lesser extent, changes in sales mix. Turning to gross profit.\n\nGross profit in the third quarter of 2022 was minus $14.8 million or minus 18% of net revenues, as compared to $23 million or positive 21.6% of net revenues in Q3 of 2021. Gross profit in the third quarter of this year was negatively impacted by approximately $7.2 million or minus 8.8 percentage points of gross margin of underutilization fees and one-time termination costs associated with certain co-manufacturer agreements, of which approximately $5.9 million was related to Beyond Meat Jerky, including such underutilization and one-time termination costs in total, Beyond Meat Jerky contributed a gross profit loss of $5.8 million or minus 7 percentage points of gross margin during the period. As Ethan alluded to, the decline in overall gross profitability is largely emblematic of the swift and meaningful deceleration in demand, which has necessitated a significant curtailment of our production volumes in short order. Generally speaking, it is the combined pace and magnitude of this volatility that presents the greatest challenge from an operating perspective as it is difficult to adjust and/or rightsize the production network at a commensurate pace.\n\nOverall, cost of goods sold per pound was $5.60 in Q3 2022, compared to $4.19 in Q3 2021 or an increase of $1.41 year over year. We estimate Beyond Meat Jerky expounded for approximately $0.47 of the increase with the remainder being driven by increased manufacturing costs, including depreciation and increased material costs and, to a lesser extent, higher transportation and warehousing costs. The increase in manufacturing costs, including depreciation, is primarily reflective of the volume deleveraging impact I described a moment ago. As an example, although COGS depreciation expense in Q3 increased by approximately 13% sequentially on a per pound basis, depreciation nearly doubled versus Q2.\n\nWhile this is a single example of just one component of our COGS, the theme is generally true across our other COGS buckets and is informative of the potential impact our efforts to stabilize growth and rightsize the network could have. Moving down the P&L to opex. Operating expenses for the third quarter of 2022 were $74.9 million, down 2.7% year over year and down 10.3% quarter over quarter. The year-over-year decrease was primarily driven by lower selling expenses, which include our cost of outbound freight and nonpeople general and administrative expenses, partially offset by higher marketing expense and restructuring costs which consists mainly of legal fees.\n\nThe sequential decrease in operating expenses was driven by reduced people expenses, including stock-based compensation, lower general and administrative expenses and lower selling expenses, partially offset by higher marketing expense and restructuring costs. As announced in our October 14 press release, we made the difficult but necessary decision to implement a secondary reduction in force, which impacted approximately 19% of our global workforce. Through this action, we expect to generate approximately $39 million in operating expense savings over the next 12 months, excluding one-time separation costs, which will largely be incurred in Q4 2022. As a result, we expect total operating expenses to be in the mid-$60 million range in Q4 of this year, subsequently falling to the low $60 million range per quarter thereafter.\n\nMoving further down the P&L, loss from unconsolidated joint venture increased to $8.7 million, compared to $0.6 million in the year ago period and $1.4 million in Q2 2022. This line item relates to our joint venture with PepsiCo, the Planet Partnership LLC, or TPP, and in the latest quarter reflects an increase in inventory reserves at TPP, as well as planned increase in marketing. All in, net loss in the third quarter of 2022 was $101.7 million or a net loss of $1.60 per common share, compared to net loss of $54.8 million in the year ago period or a net loss per common share of $0.87. Now turning to our balance sheet and cash flow highlights.\n\nOur cash and cash equivalents balance was $390.2 million and total debt outstanding was approximately $1.1 billion as of October 1, 2022. In Q3 2022, inventory decreased to $247 million, as compared to $254.7 million at the end of Q2 2022, and decreased from $283.8 million at the end of Q1 2022. The inventory decline was driven by continued progress in reducing our finished goods and work in process balances partially offset by an increase in raw materials and packaging. In terms of cash flow for the three months ended October 1, 2022, net cash used in operating activities was $34.7 million a $35.9 million decrease compared to the year-ago period and a $35.8 million decrease compared to Q2 2022.\n\nAs we have communicated, cash consumption continues to be a key focus area for us. And although we expect to drive further improvement over the next several quarters, we expect cash used in operating activities to increase sequentially in Q4 2022 as the benefit from collection of receivables in Q3 is expected to meaningfully moderate. Within cash flows from investing activities, capital expenditures totaled $18 million in Q3 2022, compared to $52.9 million in the year ago period, and we invested $10 million in our joint venture pursuant to the second tranche of our predetermined capital contribution schedule. We expect to invest a further $6.5 million in the JV split equally across the fourth quarter of 2022 and the first quarter of 2023.\n\nLet me now provide some commentary about our 2022 outlook, as well as some high-level comments about 2023. We will provide further details regarding our 2023 outlook on our fourth quarter earnings call. As previously communicated in our October 14 press release, for the full year 2022, we expect net revenues to be in the range of $400 million to $425 million representing a decrease of approximately 14% to 9% compared to the full year 2021. Given the implied level of sales for the fourth quarter of 2022, combined with the gross margin pressure that I described earlier, we expect gross margin in the fourth quarter to be negative, albeit sequentially higher than Q3 as we do not expect to incur a similar co-manufacturer termination fees.\n\nFor fiscal year 2023, as we shared in our October 14 press release, we are targeting cash flow positive operations within the second half of 2023. To be clear, this target implies the achievement of a full quarter of positive free cash flow, defined as cash flow from operations less capital expenditures during the second half of 2023. We intend to discuss the building blocks of this objective in greater detail following our Q4 2022 earnings call next year, but for now, I will share some high-level qualitative information. Given our near-term pivot to an approach that prioritizes cash flow and profitable growth above immediate market share capture, we expect 2023 growth to exhibit ongoing pressures as we transition the business model.\n\nTo drive our cash flow positive objective, therefore, there are four key levers. First, as Ethan described, we are focused on stabilizing and subsequently restoring growth within our core portfolio of refrigerated SKUs, which in turn is expected to contribute to meaningful gross margin improvement back into positive territory. To reiterate, restoring growth in our core entails closing existing distribution gaps, launching renovated and improved versions of our core SKUs, deploying strategic promotional programs aimed at drawing in new consumers and securing new doors and focusing our marketing efforts on consumers whose receptivity to our value proposition is believed to be high. Second, we will manage our operating expenses within a tight range by adopting a lean business practices and driving greater accountability among individual budget owners across the organization; Third, we will maintain a strong focus on drawing down inventory levels to free up cash from our balance sheet; and finally, fourth, we will tightly manage our capex budget to a level substantially below 2022 in either of the previous two years.\n\nTaken in combination, we believe these measures will serve as key enablers of our cash flow positive objective in the latter half of 2023. With that, I'll conclude my remarks and turn the call back over to the operator to open it up for your questions. Thank you.\n\nOperator\n\nThank you. [Operator instructions] First question today will come from Alexia Howard of Bernstein. Please go ahead.\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nGood evening, everyone. First of all, thank you very much for really focusing on how do you get back to cash flow positive. You've obviously given us a quantification of the savings from the two reduction in forces or the most recent reduction in force that you've just put in place. But the level of cash burn is still quite high.\n\nLubi, thank you for going through the components, and I recognize you're going to give us more details on the fourth quarter. Is there anything else you can tell us about how much you could reduce the input cost or the COGS ingredient packaging side of things? How much the plant cost could come down by reducing the use of unnecessary co-manufacturers? Is there anything else that you can give us that will give us an idea of how much those all of that cash burn can come down by so that we can get some visibility into what the drivers are? Thank you, and I'll pass it on.\n\nLubi Kutua -- Vice President, Investor Relations and Financial Planning and Analysis\n\nI apologize. We were muted. Alexia, thanks for the question. Although, I can't provide the exact level of specificity that you're asking for.\n\nLet me try to give some qualitative information here that hopefully will help you in your modeling. So we put out a target to be cash flow positive within the second half of 2023. Clearly, there isn't a path to getting there if we don't restore our gross margins back to positive territory. Now we're not prepared just yet to give you sort of an exact target for gross margins for 2023.\n\nAs I said in my prepared remarks, we'll be providing more detail at our fourth quarter earnings call. But clearly, restoring the gross margin back into sort of solidly positive territory is high on our priority list. And it entails a couple of different things, including stabilization of the core, rightsizing the network, those two initiatives are going to be very important levers to driving initiatives are going to be very important levers to driving continued improvement in the gross margin profile of the business. And then obviously, we've taken recently the difficult, but necessary decision to really reduce our operating expenses, and we'll continue to benefit from that, as well as we move into next year.\n\nAnd so those -- from a margin perspective, those are going to be the two big drivers. And then obviously, there is the -- as I said in my prepared remarks, there's the inventory reduction and capex objectives as well that will help us get to that cash flow positive.\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nThat's great, Lubi. And -- I can just give some additional color. We're obviously going to continue to bring cash consumption down. I think the biggest, broadest explanation that I think is important to drive home, when you have this drop in volume and associated deleveraging, things are going to start showing up in gross margin and elsewhere that are unfavorable.\n\nAnd you can either wait for growth to return or you can rightsize your production system and your organization. And I want you guys to hear directly from me, we are rightsizing the organization, the operational footprint to be able to drive the cash flow positive within the second half of next year independent of any aggressive growth assumptions. And I think that is something that is new to our business, given the 12-plus years of pretty aggressive growth that we had enjoyed. I think we will enjoy again in the future.\n\nBut for now, it's really about stabilizing the business based on a more reasonable revenue growth trajectory. And it's exactly as Lubi said in terms of making sure that we'll see some growth in the core lines of beef burger and dinner, but again nothing extraordinary. Continuing to reduce the size of the network and eliminate idle fees, moving certain parts of production back in-house, so that we can improve overhead absorption really aggressively managing inventory. We always think about inventory as kind of sleeping money, and we need to start accessing much more of that.\n\nAnd there's two benefits to that, right? One is, obviously, you reduce inventory levels and free up the cash; but two, is you can use some of that inventory to welcome new consumers into the brand at a time when they're economically stressed. And so we're going to -- some of that targeted pricing, which we can explain more later on the call. We're going to go ahead and implement. And then we have a whole cost-down program, which actually is going quite well, and it's one that we've been driving.\n\nThe challenge is you're not going to see those results until we move through some of the inventory that we have now and start to get to the conversion of raw material into products within the new production system and where those cost down programs have been successful. So a lot of things are in play to be able to drive us from the model that we had, which was one of heavy cash consumption to one that will be cash flow accretive.\n\nOperator\n\nOur next question will come from Adam Samuelson of Goldman Sachs. Please go ahead.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nYeah, thank you. Good evening, everyone. Maybe, Ethan, you kind of alluded at the end of the last answer, but some of those strategic targeted pricing actions and the ability to -- or the target to free up inventory, can you provide a little bit more context and scope around what that entails, what you think the incremental distribution could be? And where you think the inventory balance will end up either at the end of the fourth quarter, or at the end of the first quarter to help you access the cash that's on the balance sheet?\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nSure. Thank you, Adam. I'm going to give you an answer that probably is one degree of specificity away from where I think you'd like it just because of competitive reasons and things of that nature.So part of the push toward cash flow positive and a sustainable growth model is to dramatically narrow our focus within foodservice and retail. And the unifying theme in terms of what we're targeting are those opportunities that give us the highest probability of restoring growth also nurturing the most valuable long-term pathways that we have.\n\nAnd so examples of that, we have a number of QSR partners. We're narrowing our focus somewhat to a handful that we're having great success with and want to nurture those. I think there's a lot of focus on our U.S. business and our U.S.\n\nretail appropriate to sell. But if you look at what's going on in Europe, for example, and just focus for a moment on the launches and the tests that I mentioned, and then as well as the permanent menu placements, not only Europe or Latin America and in parts of Asia, we are planting seeds that we expect to be pretty significant volume drivers for us in the future. So we'll narrow our focus there. And then when you get into the retail space, again, and narrowing the focus toward what can we do to restore growth in the fresh meat case, where we really believe transformation can occur.\n\nAnd an enormous amount of energy time and focus has gone into the third iteration of our Sausage platform, for the fresh case and the fourth iteration of our burger platform and beef platform. We expect to have those out. I can't give a specific deadline for that. But in a way, it will be helpful to restoring growth.\n\nNow within that, there are select pricing programs to answer your question that we're putting in place to target specific consumers. And it really gets back to – again, it's a very – it's a time of distraction for the consumer. Our story right now is, I think, several layers away from where the consumers focus in terms of just basic needs. And so we're tailoring our messaging to sub-segments that are probably more receptive rather to hear and when it comes to health, that's generally 40 and older.\n\nWhen it comes to our planetary message around climate, water use, etc., that's the much younger generation. And so coming out with these innovations and then targeting specific sub-segments of the population, with that messaging and offering some introductory pricing that gets people involved is how we're going about restoring that fresh case. And then when you look at frozen. We've had good success with the tenders that we launched.\n\nI think we're up about 24% or so in frozen last 12 weeks year over year. And then, of course, we've launched the new stakes product, that chicken tender product that I mentioned one the, I think, People Magazine award of the year or something of that nature and the state product that we just launched, I think, is probably will be viewed by many as one of our best products is also up for an award that we'll announce shortly. That's going into the frozen section, as well as poppers and tenders. On the Foodservice side, I mentioned the QSRs, but they're also sub-segments of the Foodservice industry that are going to resonate, our messaging is going to resonate more than in other sub-segments.\n\nAnd so we're tailoring our messaging and our focus in terms of our sales to those sub-segments and they have to do with younger consumers, they have to do with consumers who maybe in the healthcare system, things of that nature. And I don't want to get too much into it, but offering pricing in those segments that will attract the largest number of consumers to our brand at a time when pricing really matters is how we're going to deploy this pricing program. We have a lot of inventory. We want to work through it, and we want to welcome people into the brand.\n\nSo I can't give you specific numbers on exactly how much in mid-core are going to draw down, but you can expect us to be aggressive in a way that maximizes profit dollars versus margin percent at the moment.\n\nOperator\n\nOur next question today will come from Robert Moskow of Credit Suisse. Please go ahead.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHi, Ethan.\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nHi, there.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nThe script today and the task at hand, it's a very different task than what your vision of the company was originally. And I also think the culture of the company that you've built. And I'm just wondering, do you have the right people in place to execute this new kind of approach? And are people ready to make this kind of pivot? Do you need to bring in different people to do it?\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nYeah. But that's a great question. Thanks, Rob, for asking that. It is a pivot for sure.\n\nAnd I want to be very clear that it's coming from me. I feel very passionate about this change that we're making. I have no doubt about the long-term opportunity facing our company and our ability to go get it. We continue to produce the very best products, all these other things, right? What we have to do is change our mindset from one where it was growth above everything else to now pushing very quickly the business into a cash flow positive and a profitable position.\n\nAnd that's not because I feel that I need to produce better numbers for people right now or things of that nature. It's because it's what's going to allow us to endure this current economic situation and reach that longer-term goal. And so in terms of the people that I have around me, I do think that we have a lot of the right pieces in place and a lot of the language that I was using, you could obviously resonate with people who are aware of the lean literature and things of that nature. We have folks that have come out of that school of lean principles.\n\nAnd it's not a manufacturing mindset. It's a organizationwide mindset, right? And so we are pushing that out throughout the organization, but it is the number one goal. The hallmark of the way I manage our business is we have a high-level set of goals for a three-year period. We have a three-year plan.\n\nWe've got a one-year annual operating plan. But those boils down into a set of discrete projects. The number one project for this company is to push this into a cash flow-positive position by the second half of next year in order to accelerate profitability. Anyone who's not willing to sign up for that is not going to be very comfortable here.\n\nSo it is -- it's coming from the top. I'm very passionate about it. We have the energy here to get it done. And just all the intensity and focus you saw on us signing up the very best partners in the world, putting the best products out and growing the movement.\n\nWe are now shifting to achieving this goal, again so that we can realize that long-term vision we have for the company. I had no intention of shifting gears in terms of what our long-term goal is. We will be very large protein player globally. And this is a difficult period economically across the country and across the world.\n\nSo we are going to rightsize the organization to get through, and it's coming from me, and we'll get it done.\n\nOperator\n\nOur next question today will come from Cody Ross of UBS. Please go ahead.\n\nCody Ross -- UBS -- Analyst\n\nHi. Good evening. Thank you for taking our questions. I just want to touch a little bit, Lubi.\n\nYou talked about a good part of your goal to become cash flow positive is to turn gross margin positive. Can you just remind us or give us any color on what percentage of your COGS are fixed versus variable?\n\nLubi Kutua -- Vice President, Investor Relations and Financial Planning and Analysis\n\nI'm not sure that we've quantified that specifically, but the vast majority of our COGS basket is variable of our – our COGS cost is variable. And that's a function of the sort of the co-manufacturer sort of model that we have today. And obviously, a fair amount of our finished goods production is still done with our co-manufacturing partners. And therefore, the only fixed costs that we have embedded are associated with our own facilities where we do extrusion.\n\nOperator\n\nOur next question today will come from Peter Saleh of BTIG. Please go ahead.\n\nPeter Saleh -- BTIG -- Analyst\n\nGreat. Thanks for the question. Ethan, I just wanted to come back to a comment you made. You said you guys are going to focus on gross profit dollars and not necessarily gross margin percent.\n\nSo maybe just if you can provide a little bit more detail on that? What will you be focusing on in terms of products that drive gross profit dollars? And are there any products or channels that you'll be cutting that maybe were higher gross percent, but lower on the dollar side? Just trying to kind of understand that comment in the context of what you guys gave us today? Thanks.\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nSure. So it has to do with the pricing program, we're putting in place on one of our items that is kind of in our core. And again, it's not going to be a blanket pricing for all segments, but we think it will be meaningful for this that we apply it to. And I wanted the team to understand that the goal there is to drive conversion of inventory, bring new people into the category.\n\nWe're obviously not going to do anything that would be on a per unit basis negative. But it has to do with that program. I also think the days and again, gets to the change in mindset, we launched the jerky product, great partnership with Pepsi. I had a -- I think it's a $30 million contribution this year to revenue.\n\nI think we grew the category 4x or something of that nature. And we finally crossed over into a breakeven situation on the margin on that. It's being obscured by these termination fees and idle fees and things of that nature. But those days are over, like we're not going to be launching any products that aren't cash flow positive and margin -- profit dollar contributors at the onset.\n\nAnd so it's really about flexing where we have room in margin to flex to drive more volume, and that gets down to our core lines. And again, I don't want to specify which one or which segment we're going after, but that's the reason that I'm asking the team to focus on profit dollar right now versus that margin.\n\nLubi Kutua -- Vice President, Investor Relations and Financial Planning and Analysis\n\nYeah, I would just add on top of that that we're being very targeted with these programs. And we're looking at, number one, as Ethan alluded to, we're looking at some of our core SKUs where we continue to have strong margins on those already. And so these won't be negative margin from a unit perspective. But we're also looking at our core products where there are existing distribution gaps and where we have an opportunity to maybe secure new points of distribution by doing some kind of a special program, bring in new consumers who maybe haven't tried these types of products or our brand before.\n\nSo it's a targeted type of program. And it -- as Ethan said, it is -- these are cash flow accretive, assuming we get the lift, right? These still cash flow accretive activity because we'll be covering our variable costs.\n\nOperator\n\nOur next question today will come from Michael Lavery of Piper Sandler. Please go ahead.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nThank you. Good evening. I just wanted to come back to fixed costs. I know we've touched on this a little bit, but for some of these underutilization penalties or for the new headquarters, which I think the rent starts at around $15 million a year and then builds.\n\nSo there's -- it's a meaningful outlay in terms of your spend. How much flexibility do you have on terminating or changing any of these contracts, or do you -- are you committed to the headquarters building? Is there a better way to think about how to run -- set that up? What's some of the flexibility you might have?\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nYeah. So it's a great question. So we have kind of four buckets that we're looking at of kind of agreements and things we entered into several years ago that -- comporting more with the kind of growth curve that we're seeing then that we're just going to have the tough discussions with those partners about how to address it, and we're doing that now. On the headquarter question itself, we're just consolidating a bunch of leases.\n\nSo we're pushing forward in that direction, getting out of them, things of that nature. And so I don't think we'll change course on the headquarters, but we will consolidate into them. And that's, I think, an important step. I mean people -- I think many people have commented on the disruptive aspect of the pandemic and distributed workforce in our kind of work we're push in and turning out best products in the world and doing it under tight time lines, we need everyone together.\n\nAnd so I'm very much committed to making sure that happens. But the kind of idle fee things and things of that nature, we're doing a few things there. One would be trying to consolidate some of our production in areas where we do have idle fees to make sure that we're not spending anything that's unnecessary for production. And then having those conversations, right? I mean I think that the world has changed and everyone needs to play a part as our partner.\n\nSo it's a big focus for me.\n\nOperator\n\nOur next question today will come from Rupesh Parikh of Oppenheimer. Please go ahead.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood evening, and thanks for taking my question. So just on international markets. I was curious if you guys have reviewed the business. Any thought of actually exiting any international markets to more quickly rationalize the business?\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nYeah. That's a good question. I think in Europe, you'll start to see as some of the inventory eroded. I can't predict the future there, obviously, but we see some trends that we like.\n\nThere's an overhang of inventory. In China, it's so early to tell what's going on there because they're just coming out of all these lockdowns. And they come out and they go back in and things of that nature. What we are doing, though, is reducing expense throughout our global operation and relying more heavily on partners.\n\nWe have a terrific partner in Europe, an Zandbergen, and working very closely with them. to continue to serve and grow the longer term opportunity for Beyond in Europe, but do in a way that's maybe a little bit more asset-light. And then in China, without getting into too much. We're looking at some similar opportunities there.\n\nOperator\n\nThe next question today will come from Peter Galbo of Bank of America. Please go ahead.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Good afternoon. Thanks for taking the question. Lubi, just a really quick one.\n\nI appreciate that you've given kind of a qualitative look at 2023 revenues, but maybe just so that we're all on the same page. Can we kind of just outline some of the puts and takes that get's you to a still kind of compressed revenue next year? I think, I heard from you obviously, rationalizing some of the footprint across QSRs and some retail partners, focusing more on the core. I think you'll be lapping the jerky kind of load in from the first half of this year going into next year. But then I would think on the positive side of the ledger, you'll have some load-in on stake in Popcorn Chicken.\n\nSo just wanted to understand all of the puts and takes as we start to think about, again, from a high level, where revenues could shake out for 2023? Thanks.\n\nLubi Kutua -- Vice President, Investor Relations and Financial Planning and Analysis\n\nSure. I think you actually answered your own question, but there is – certainly, if you look at where the trends have been in the business recently, and we've started to see some increased pressure in our international markets as well. That stuff is not going to turn on a dime, right? And so I think in the near term, there's going to continue to be some, some pressure, particularly you look in the first half of next year. But then as we've been discussing, right, we have a number of these initiatives that are really focused on stabilizing and eventually restoring growth within our core.\n\nThis includes things like launching, the new iterations of some of our key core SKUs. And so when you look at those activities as well as, to your point, start to layer on a bigger contribution from things like stake and popcorn chicken and potential other new launches. We do expect that the -- some of the pressure that we expect to feel in the first half of the year should abate as we get to the second half. So I know that's not overly specific, but hopefully, that gives you some sort of idea about how we're thinking about it.\n\nOperator\n\nOur next question today will come from John Baumgartner of Mizuho. Please go ahead.\n\nJohn Baumgartner -- Mizuho Securities -- Analyst\n\nGood afternoon. Thanks for the question. Ethan, I want to dig into innovation because it's hard to think that there isn't cannibalization whether it's meat balls versus ground beef, ground beef versus patties. And you're renovating products, but you're also launching the fourth iteration of ground beef.\n\nAnd the competition has moved on to frozen meals, protein bowls. They're hitting new meet states going from commodity to value add. Why isn't Beyond also moving away from commodity products? Why wouldn't that benefit you more than trying to migrate consumers from like a beef 3.0 to 4.0? I'm just trying to think bigger picture about what you can do need state wise to get revenue growth back into the model?\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nYeah, a very good question. So I think the move you've seen from us on frozen is in part response to that, and you'll see more of that from us in the frozen space in term the convenience and things like that without dealing too much. I don't think that that part of your question is, in any way, not consistent with where we're headed. But on the question about the core, we really do believe – and we've seen this that – our products continue to get closer to animal protein, right, in terms of the taste and texture and sensory experience.\n\nAs we drive down the cost -- BCP did a nice study on this. The consumers want to do this. They just don't want to pay more for it, right? And so we have to continue to drive toward taste parity, which we're getting closer on and then realize this cost goal that we've had, which I think we're still going to hit within the time frame that I specified in at least one product in one category. And then Taco Bell Corniche has a good example, at that time the menu is the same price of stake.\n\nAnd so I'm not going to walk away from that massive global opportunity around beef, pork and poultry with just the core cuts of that, the grounds, things of that nature. Because I'm certain that as we hit price parity with that, as the products become indistinguishable as the climate situation worsens as people get a clear sense of what the real health benefits are. And I want to actually just -- use this as a moment to talk about that real health benefits are of our products. This conversion will happen.\n\nAnd so I got to make sure, and I'm very committed to making sure that Beyond is the absolute best in that category. There's huge volume and value creation opportunity if we can do that. So in the near term, I've seen competitors go and launch value-added meals and things of that nature, and that's fine. And I'm not saying we're not going to do that.\n\nAnd I'm not saying we're not going to invest in frozen, we certainly are. But the transformative growth is in the refrigerated meat case, and it's in these QSR relationships, those are the ones that are going to drive home this transition. And I acknowledge that probably swung too hard at that at the beginning of the company's entry into those markets. I didn't expect the pandemic or this high inflation.\n\nBut it doesn't mean that over the long run, those things aren't going to come to fruition. And again, I would point everybody to -- I think we've done, what I mentioned on the call, 25 distinct launches in the last 12 months, nine different products in 18 countries, and that listed the different permanent menu placements we're getting. That's where the $30 billion to $40 billion revenue company is going to come from. I don't think it's going to come from the next, getting a meatball frozen ball.\n\nNot to say we're not going to do it. But I think this core focus is the right one.\n\nOperator\n\nOur next question today will come from Ben Theurer of Barclays. Please, go ahead.\n\nBen Theurer -- Barclays -- Analyst\n\nThank you very much and good evening, everyone. I wanted to follow up on your comments you just made around pricing and getting to price parity. And it really feels like if you just look and dig into the sales versus volume that you shared in the press release that there's been already a lot of investments, particularly on the international side. And it's tough to follow data points.\n\nSo maybe you can help us understand where you stand right now in terms of the price premium versus your, call it, commodity appeals, particularly on the international side?\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nYeah. So a couple of things. One of the things that is requiring patients is, we've been able to affect -- sorry, we've been able to realize pathways to significant savings in our production that are just congested right now, because we have inventory that we have to draw down in order for the new production, new sourcing, all that stuff to come to fruition, right? And so there's just a backlog in terms of to be able to show the cost down measures that we've taken. In -- internationally, not -- just to be very honest, we're just too expensive right now, right? Part of the pricing actually look in Europe is because of that.\n\nBut I was just getting -- I got a text earlier this morning from a friend -- from a colleague, head of sales, at one of our divisions here, who was in Israel. And he was saying just how incredibly expensive our products are there, and I heard the same thing about Singapore recently. And so we have to drive better coordination across our distribution network, across our retailers about not driving the price up. Even in the U.S., I think a lot of the contraction you've seen is not all, but a lot of the contraction you've seen if you go into the store, on average, $3 more than a pound of beef.\n\nThe consumer is clearly signaling as they go to a dollar store and everywhere else. So that's just not what they're going to do today. So again, I get back to the BCG study, back to the vision I've had to the company since I started, we've got to get this to be at price parity. And I think it's interesting, there's so much -- and I understand it's human nature, desire to call this in one way or the other.\n\nThey say, well, publishing or not. Yet the dynamics are not yet in place to answer that question. Let the economy settle, let us get our price point at parity. Then let's see what happens.\n\nAnd so if the launch doesn't go well with the QSR, the sky is falling. Well, how about it, maybe it was priced too high? Maybe it wasn't the right build? Things of that nature. So it's not binary, and we just have to keep chopping away at this thing. And we'll get to the point where you'll see that accelerated growth again.\n\nBut we've got a lot to navigate right now, and I want to make sure we stabilize the company and be able to do that, and that's what I'm focused on.\n\nOperator\n\nOur next question will come from Rebecca Scheuneman of Morningstar. Please go ahead.\n\nRebecca Scheuneman -- Morningstar -- Analyst\n\nGreat. Thank you for squeezing me in. So my question really stems from the -- on the $7.2 million fees that was in the gross margin. So I'm trying to get a sense for how much of that will be continuing into other quarters, or how much was truly one-time? It seems like if it's a termination fee that that would be one-time, but maybe some of these underutilization would be ongoing.\n\nSo I would just like some clarity on how much of this we can expect to continue forward as long as we're in this softer environment? Thank you.\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nThat's a good question. So I mean, you're right, the majority was the termination, but doesn't -- but there are these continuing capacity fees, and we're reorienting the network to be able to absorb some of those, so they're not just going to nonproductive use. And then we're also just in negotiation. But if you look at what's happened in the industry, I mean, I found this interesting just from a disruption perspective and how categories expand and then contract and expand again.\n\nYou saw JBS closed entirely their Plantera effort here, like 125 people, whole facility in Denver. I don't know who listened to it. My friend, Michael commentary yesterday at Maple Leaf, I think it took $190 million goodwill charge on their plant protein business and impairment rather. And also, I think, 22.5% negative margin.\n\nSo there's just -- there's so much volatility right now in this category given the broader economic issues and things of that nature. And so you're going to run it. If you design a business for a year to say you're going to get -- I'll make up the number, $150 million in revenue or something for a quarter, and it drops dramatically, you're going to have idle fees, you're going to have excess capacity. You're going to have lower absorption of overhead, all these knock-on effects.\n\nAnd we're feeling those. And instead of just saying, I'm going to cross my fingers and hope for growth to return in that process of negotiation, in that process of reducing the operations footprint temporarily to be able to produce better margin without any significant resumption of growth.\n\nOperator\n\nOur next question will come from Ken Zaslow of Bank of Montreal. Please go ahead.\n\nKenneth Zaslow -- BMO Capital Markets -- Analyst\n\nYeah, real quick question. Of your program, which -- of the four steps that you have do you think is most at risk or out of your control? And which ones do you think you have the most control over?\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nSo I think Lubi was referring specifically to four of the kind of financial levers on the program that we have is three steps, obviously, to drive home the reduction in opex. And that one, I think we feel comfortable with. I think the -- getting to cash flow positive really depends on not only discipline there, but also working through our inventory, which is a second step. And then third, which is probably the one that we have the least control over is the result of the execution of our focused growth strategy.\n\nWe're narrowing down our focus to some key retail activities and some key food service activities and some key QSR partners. It's a much narrower scope than we've had in the past. But we think those are the kind of 80/20 rule. Those are the ones that are going to drive growth.\n\nIf the economy continues to worsen, if we don't connect with the consumer in the right way, that could be something where there's risk. But again, we're not structuring the business for that that has to happen at some sort of dramatic level. We're going to structure the business differently, right? Where -- if there's -- even if there's some moderate growth, I mean, very moderate, we'll be able to achieve the goals that we're talking about -- what I like about that is that as these things that would have been percolating and that we've been planting the seeds quarter after quarter, the 25 distinct launches, the nonexisting products, countries, the Taco Bell stuff here in the U.S., the Panda Express here in the U.S., the McDonald's in Europe, the Pizza Hut in Latin America, as those things start to move from kind of the test phase into much broader utilization, those has gone upside for a business that has been rightsized. And I think that's where the value creation in this environment will occur.\n\nOperator\n\nAnd ladies and gentlemen, at this time, we will conclude our question-and-answer session. I would like to turn the conference back over to Ethan Brown for any closing remarks.\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nI think I've said it all, what I wanted to convey. It is a pivot in our business model. It's a pivot from kind of growth above all to cash flow positive and sustainable growth. I'm very excited about it.\n\nIt's something I think is going to produce the long-term results that we've been after and do so in a way that's more efficient. And I look forward to building it together. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTeri Witteman -- Chief Legal Officer and Corporate Secretary\n\nEthan Brown -- Founder, President, and Chief Executive Officer\n\nLubi Kutua -- Vice President, Investor Relations and Financial Planning and Analysis\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nCody Ross -- UBS -- Analyst\n\nPeter Saleh -- BTIG -- Analyst\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nJohn Baumgartner -- Mizuho Securities -- Analyst\n\nBen Theurer -- Barclays -- Analyst\n\nRebecca Scheuneman -- Morningstar -- Analyst\n\nKenneth Zaslow -- BMO Capital Markets -- Analyst\n\nMore BYND analysis\n\nAll earnings call transcripts"
}