{
  "companyName": "First Solar",
  "companyTicker": "FSLR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/first-solar-fslr-q3-2022-earnings-call-transcript/",
  "content": "First Solar (FSLR 0.68%)\nQ3 2022 Earnings Call\nOct 27, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, everyone, and welcome to First Solar's third quarter 2022 earnings call. This call is being webcast live on the investors section of First Solar's website at investor.firstsolar.com. [Operator instructions] As a reminder, today's call is being recorded. I would now like to turn the call over to Richard Romero from First Solar investor relations.\n\nRichard, you may begin.\n\nRichard Romero -- Investor Relations\n\nGood afternoon, and thank you for joining us. Today, the company issued a press release announcing its third quarter 2022 financial results. A copy of the press release and associated presentation are available on First Solar's website at investor.firstsolar.com. With me today are Mark Widmar, chief executive officer; and Alex Bradley, chief financial officer.\n\nMark will provide a business and policy update. Alex will discuss our financial results for the quarter and provide updated guidance. Following their remarks, we will open the call for questions. Please note, this call will include forward-looking statements that involve risks and uncertainties and that could cause actual results to differ materially from management's current expectations.\n\nWe encourage you to review the safe harbor statements contained in today's press release and presentation for a more complete description. It is now my pleasure to introduce Mark Widmar, chief executive officer. Mark?\n\nMark Widmar -- Chief Executive Officer\n\nThank you, Richard. Good afternoon, and thank you for joining us today. Earlier this afternoon, we announced net sales of $629 million and a net loss per diluted share of $0.46 for the third quarter of 2022. As noted in our original guidance for the year, 2022 was projected to be challenging from an earnings standpoint, but we continue to maintain an unwavering focus on the future, setting the stage for long-term growth and profitability.\n\nBeginning on Slide 3. Our strong bookings momentum has continued into the second half of the year, with 16.6 gigawatts of new bookings since our last earnings call, which have a base ASP of $0.316 per watt before the application of potential adjusters and total year-to-date bookings of 43.7 gigawatts. Our total backlog of future deliveries now stands at a record 58.1 gigawatts and includes orders for delivery as far into the future as 2027. The continued long-term demand for our products and the fact that our technology is expected to serve as the backbone for many of our customers' long-term growth plans is a testament to First Solar's strong fundamentals, grounding our commitment to the principles of responsible solar, our differentiated technology platform, our balanced approach to growth, liquidity and profitability, and our ability to provide a U.S.\n\ntechnology and manufactured product. In the third quarter, our manufacturing facilities produced 2.4 gigawatts of modules, and we shipped 2.8 gigawatts. Although showing signs of the recent easing, the overall shipping and logistics environment remains challenging. Alex will later discuss the impact of this on our Q3 results and full year guidance.\n\nManufacturing performance metrics remain consistent across our existing fleet, and construction of our third manufacturing facility in Ohio and our first manufacturing facility in India remains on schedule. During the quarter, we announced 4.4 gigawatts of additional U.S. manufacturing capacity. And today, we announced an additional investment into a dedicated R&D research facility to be located here in the U.S., near our existing manufacturing facility in Perrysburg, Ohio.\n\nFinally, as it relates to our legacy systems business, we have completed the previously disclosed sale of our operations and maintenance platform in Australia and Japan. And this week, we signed a sale and purchase agreement for our Luz del Norte project in Chile. Turning to Slide 4. With regards to our manufacturing capacity and as announced in August, we are investing approximately $1.2 billion in scaling our U.S.\n\nmanufacturing footprint. Driven by robust demand for our module technology as well as U.S. manufactured product, we expect this will expand our domestic nameplate capacity to approximately 10.7 gigawatts in 2026, up to approximately $200 million will be spent to upgrade and expand our Ohio manufacturing footprint at both our current operating facilities as well as our third factory, which is currently under construction and scheduled to come online in the first half of 2023. As a result of this expansion, we believe our Ohio nameplate capacity will increase by almost 1 gigawatt to just over 7 gigawatts by 2025.\n\nApproximately $1 billion will be invested to build a new factory, our fourth in the United States, representing an additional 3.5 gigawatts of Series 7 nameplate capacity. This facility is expected to commence operation in 2025. We continue to evaluate several possible sites across the Southeast and expect to announce the location in the coming weeks. Beyond this, we continue to evaluate the opportunity for further investments in incremental manufacturing capacity, including throughput optimization of our current planned capacity.\n\nIn addition, we are evaluating capital investments to support the advancement of our R&D initiatives. In the United States, the enhancement -- the enactment of the Inflation Reduction Act with both supply side manufacturing and production tax incentives as well as demand drivers, including the expansion of investment and production tax credits for solar and clean hydrogen provides a long-term clarity necessary to support investments in manufacturing. In India, we continue to see a supportive policy environment given the decisive decisions by the government to diversify and grow domestic capabilities to avoid deeper dependencies on an unreliable, volatile and high-risk supply chain. In Europe, we continue to work with stakeholders to advocate for long-term manufacturing and supply chain strategies that would enable us to support the energy needs of Americas allies with local manufacturing, responsibly produced solar technology.\n\nWe recently joined other leaders in the European Union to provide high -- to highlight the PV supply chain, the need for decisive actions from the EU if it wishes to deliver on its goal to scale manufacturing across the block by 2025. while our immediate focus on scaling our announced factories in the U.S. and India, we remain committed to exploring the long-term potential for further geographical diversification, contingent upon a supportive local policy and demand environment. With regard to research and development, today's announcement of an approximately $270 million investment will support a 1.3 million square foot dedicated R&D innovation center in Perrysburg, Ohio, which pending final approval of various state, regional and local incentives is expected to be completed in 2024.\n\nCurrently, our R&D programs require transferring potential product advancements developed on specialized product development lines located in our California and Perrysburg laboratories to high-volume manufacturing conditions by running engineering test authorizations or ETAs, on our existing commercial production lines in Ohio. Using these production lines increases operational complexity as well as, limit cycles of learning in addition, the combination of a larger form factor module, increased module throughput and a recently enhanced production-based policy incentives has significantly increased the opportunity cost of the downtime required to run ETAs on existing high-volume manufacturing lines. This new facility will feature a pilot manufacturing line allowing for the production of full-size prototypes of both thin film and tandem PV modules. Creating a sandbox separate from commercial manufacturing operations is expected to reduce operational complexity, reduce costs allow us to accelerate our rate of learnings, solidify our leadership in current and next-generation technologies.\n\nTurning to Slide 5. As previously mentioned, we booked 16.6 gigawatts since the July earnings call, bringing our year-to-date bookings to 43.7 gigawatts. With respect to future shipments, after accounting for shipments in the quarter of 2.8 gigawatts, which was in line with our expectations, our total contracted year-to-date backlog is 58.1 gigawatts. Note, while we have contracted volume for India, we have not recognized this volume in our backlog.\n\nExcluding our new India manufacturing facility, we are sold out for 2024 as of the July earnings call. As of now, we are sold out for 2025 and close to selling out for 2026. Note, we anticipate having '26 sold out by the end of the year as we have a number of contracts in late-stage negotiations. As we transact further into the future, we are pleased with the pricing trajectory of our technology.\n\nThe 16.6 gigawatts of bookings since our prior earnings call in July have a base ASP, excluding adjusters where applicable of $0.316. Note, approximately 40% of this volume is reflected in the Q3 backlog number in the 10-Q. During the third quarter, certain amendments to existing contracts associated with commitments to provide U.S. manufacturing products, as well as commitments to supply Series 7 versus Series 6 modules increased our contracted revenue backlog by $52 million across 1.4 gigawatts or approximately $0.037 per watt.\n\nAs of Q3, the average portfolio based ASP reflected in the revenue from contracted footnote in the 10-Q increased approximately $0.012 versus the second quarter end. As we previously addressed, a substantial portion of the overall backlog includes the opportunity to increase the base ASP through applications of adjusters if we're able to achieve certain achievements within our technology road map. As of the end of the third quarter, we have approximately 31.4 gigawatts of contracted volume with these adjusters, which, if realized, could result in additional revenue of up to approximately $0.7 billion or approximately $0.02 per watt, the majority of which will be recognized between 2024 and 2026. As previously discussed, this amount does not include potential adjustments for the ultimate module being delivered to the customer, which may adjust the ASP under the sales contract upwards or downwards.\n\nIn addition, this amount does not include potential adjustment for increases in sales rate or applicable aluminum or steel commodity price changes. Finally, this does not include potential price adjustments associated with the ITC domestic content provision under the recently enacted Inflation Reduction Act. As a reminder, not every contract includes every adjuster described here. To the extent that such adjusters are not included in a contract, we believe the baseline ASP reflects an appropriate risk/reward profile.\n\nAnd while there can be no assurances that we will realize adjusters in those contracts where they are present, to the extent we are successful in doing so, we would expect a meaningful benefit to our current contracted backlog ASP. Our recent bookings, which include large headline numbers ranging from 0.7 to 2 gigawatts, including a number of significant transactions with existing customers, such as AREVA, Silicon Ranch and Swift Current Energy in the United States. The same is true where Azure Power, who has worked with First Solar for over a decade signed an agreement for 600 megawatts as the first customer to contract for offtake from our new facility in Chennai. Note, as mentioned during our prior earnings call in July, signed contracts in India will not be recognized as bookings until we have received full security against the offtake.\n\nAs such, deals signed but not fully secured, included in this agreement with Azure Power will be reflected within the confirmed but not book portion of our pipeline graph in the earnings presentation. As reflected on Slide 6, our pipeline of potential bookings remain robust. Even at year-to-date bookings of 43.7 gigawatts, we retain total booking opportunities of 114 gigawatts. Our 71 gigawatts of mid- to late-stage opportunities include 62.5 gigawatts in North America, 4 gigawatts in India and 3.3 gigawatts in the EU.\n\nEven with our 16.6 gigawatts of bookings since our prior earnings call, our pipeline of mid- to late-stage opportunities has expanded by 52.8 gigawatts since the prior quarter. In addition to previously noted demand drivers, including customers' need for certainty around technology, supplier integrity and our ability to stay behind our contracts and deliver on our commitments, demand has been further catalyzed by the enactment of the Inflation Reduction Act. For many customers, this legislation has provided visibility into supportive long-term policy environment to the extension of the solar investment tax credit, the introduction of the production tax credit for solar and similar incentives with respect to green hydrogen. As a consequence, we are seeing increased demand from both existing and potential new customers and included in our pipeline are several opportunities with multiyear, multi-gigawatt volumes.\n\nTurning to technology. We continue to make steady progress with our current road map as we worked on the operational and market readiness of our next-generation Series 7 modules. Our new Ohio facility, which will be the first in our fleet to produce this product, is on track to commission in the first half of 2023. Early test runs of the semiconductor deposition equipment performed as anticipated with full-size Series 7 samples delivering efficiency equivalent to the current [inaudible] modules.\n\nThe Series 7 module has been developed in close collaboration with EPCs, structure and component providers, and the product has benefited from working over the past year with our partners, including Array Technologies and NEXTracker to develop mounting solutions. Their work, along with the support of our customers' EPC partners, is expected to help ensure the product ecosystem is ready and optimized for install costs once Series 7 enters the market. Additionally, we have continued to make progress advancing our CadTel bifacial modules based on our Series 6 platform and expect to launch a pilot production scale run before the end of this year and a small-scale infill deployment with a strategic customer as early as the first quarter of next year. I'll now turn the call over to Alex, who will discuss our Q3 2022 results.\n\nAlex Bradley -- Chief Financial Officer\n\nThanks, Mark. Starting on Slide 7, I'll cover the income statement highlights for the third quarter. Net sales in Q3 were $629 million, an increase of $8 million compared to the prior quarter. On a segment basis, our module segment net sales in Q3 was $620 million compared to $607 million in the prior quarter.\n\nThe increase in net sales was primarily driven by higher module volumes sold from our plants in Malaysia and Vietnam. Gross margin was 3% in Q3 compared to negative 4% in the prior quarter, primarily driven by the impairment of the Luz del Norte project in the prior quarter. Our Q3 module segment gross margin of 4% down from 5% in Q2 2022 was negatively impacted by two key [inaudible] logistics items, partially offset by lower module costs and reductions to our warranty and module collection recycling liabilities. Firstly, with respect to sales rate, while spot rates have begun to ease significantly in recent weeks, higher sales rate charges under shipping contracts entered into at the beginning of the year continued to put pressure on our costs to deliver products during the quarter.\n\nSecondly, with respect to logistics, we experienced an unforeseen demurrage charge of approximately $30 million but what about this charge? Which is a discrete variable cost outside of the freight rate paid for transoceanic shipping. Demurrage charge are excess storage fees charged as a result of containers and modules remaining in port beyond a contractually agreed period. Whilst the shipping environment over the past two years has largely been characterized by container shortages and transit times well above prepandemic norms, the recent significant reversal in vessel waiting times and container turnaround times, though welcomed on a long-term basis if sustained has created near-term logistical challenges. In particular, during the third quarter, dramatically improved transoceanic transit times resulted in product delivered to port significantly ahead of both our expectations and contracted customer delivery dates, which drove a significant increase in demurrage charges as we waited for the customer site delivery window to open.\n\nLong term, we believe our strategy of increasing manufacturing capacity approximate to demand reduces the need for and risks associated with transoceanic shipping. In total, total sales rates and unforeseen logistical costs included in our cost of sales, reduced our module segment gross margin by 23 percentage points in Q3 compared to 16 percentage points in the prior quarter. SG&A and R&D expenses totaled $76 million in the third quarter, an increase of approximately $12 million compared to the prior quarter, primarily driven by higher share-based and incentive compensation and higher legal expenses. Production start-up, which is included in operating expenses totaled $20 million in the third quarter, an increase of $7 million compared to the prior quarter, driven by increased start-up costs associated with our third Ohio factory.\n\nQ3 operating loss was $68 million, which included depreciation and amortization of $67 million, production start-up expense totaling $20 million and share-based compensation of GBP 12 million, partially offset by a $6 million gain on the sale of our Australia and Japan operations and maintenance platforms. We recorded a tax benefit of $13 million in the third quarter compared to tax expense of $84 million in the prior quarter. Decrease in tax expense was primarily attributable to the decrease in our pre-tax income, certain losses in Chile in Q2 for which no tax benefit can be recorded. And in Q2, discrete expense related to the reevaluation of Vietnam-deferred tax assets due to receipt for high-tech incentive certificate.\n\nCombination of aforementioned factors led to a Q3 loss per share of $0.46 compared to a Q2 earnings per share of $0.52 on a diluted basis. Next turn to Slide 8 to discuss select balance sheet items and summary cash flow information. Cash flows generated from operations were $129 million and capital expenditures were $223 million in the third quarter. Our cash, cash equivalents, marketable securities and restricted cash balance ended the quarter flat at $1.9 billion.\n\nModule segment operating cash flows and draws under our credit facility with the U.S. International Development Finance Corporation for our India manufacturing plant were offset by other operating expenses and capital expenditures associated with our new Ohio and India factories. Total debt at the end of the third quarter was $260 million, an increase of $85 million from the end of Q2 due to the first disbursement of the credit facility for our India manufacturing plant. $175 million of our outstanding debt is nonrecourse project debt and will come off the balance sheet upon the closing of the Luz del Norte project sale.\n\nOur net cash position, which includes cash, cash equivalents, restricted cash and marketable securities less debt, also ended the quarter flat at $1.7 billion. Turning on to Slide 9, I'll provide updated guidance. With regards to our legacy systems business and impacting our other business segment. In Q3, we completed the divestiture of our Japan business as the conditions precedent were met to close the sale of the O&M platform following on from the closing of the [inaudible] platform in Q2.\n\nAdditionally, this week, we signed a sale and purchase agreement for the sale of our Luz del Norte project in Chile, the closing of which we expect in Q4 of this year, subject to customary closing conditions. Full year financial impact of this sale are expected to be within the previously forecasted guidance ranges provided on the Q2 call in July. As it relates to our module segment, forecasted net sales is now $2.4 billion to $2.5 billion, down $50 million at the midpoint of the range due to project timing shifts, which results in a full year average ASP slightly lower than previously forecast. In addition, approximately 200 megawatts of volume previously expected to be sold in the year is now expected to be recognized as revenue in 2023.\n\nCombined with our other segment revenue, consolidated full year net sales is forecast to be $2.6 billion to $2.7 billion compared to $2.55 billion to $2.8 billion previously. Q2 module segment gross margin guidance of $175 million to $215 million is updated to $125 million to $155 million, driven by three key items. Firstly, the impact of reduced revenue, driven by the aforementioned lower full year average ASP and volume sold. Secondly, the aforementioned unforeseen logistics costs estimated at $35 million, $30 million of which was reflected in Q3 results.\n\nAnd thirdly, our previously forecasted cost per watt produced reduction from year-end 2021 to year-end 2022 of 4.46% is updated to 3% to 5% largely as a function of unfavorable mix shift in production of high load versus stand-alone modules. Our cost per watt sold forecast previously seemed to be unchanged year over year is now forecast to increase approximately 2% from Q4 2021 to Q4 2022 as a function of this unfavorable mix shift in high versus stand-alone modules, as well as an increase in the percentages of Q4 volumes sold coming from our higher cost Perrysburg facility relative to our previous forecast. These are partially offset by warranty and module collection recycling benefit of $18 million recognized in the third quarter. Combined with the other segment impact to gross margin forecast to be between negative $45 million and $50 million, compared to negative $50 million to $60 million previously and which includes the impact from the Q2 impairment of the Luz del Norte project, total gross profit is forecast to be between $75 million and $110 million, compared to between $115 million and $165 million previously.\n\nWithin gross profit, the underutilization loss assumption of $10 million to $15 million remains unchanged. With the increase in demurrage charges, total sales rate and unforeseen logistics costs are now expected to impact gross margin by 19 to 21 percentage points compared to 18 to 20 points previously. Our forecast SG&A and R&D expenses of $270 million to $280 million remains unchanged. Forecast start-up expenses reduced from $85 million to $90 million to $80 million to $85 million.\n\nTherefore, our total operating expenses forecast is reduced from $350 million to $365 million to $345 million to $360 million. Operating income is estimated to be between negative $30 million and positive $20 million, down from previous guidance of positive $5 million to $70 million as a function of the above impact to net sales and gross margins. Other income and expense guidance of $25 million remains unchanged. Full year tax expense forecast increased from $55 million to $70 million to $65 million to $80 million due to a shift in jurisdictional mix of income partially offset by an increase in forecasted R&D credits.\n\nThis results in full year 2022 earnings per diluted share guidance range of negative $0.65 to negative $0.35, compared to previous guidance of negative $0.25 to positive $0.25. Capital expenditures guidance is revised from $850 million to $1.1 billion to $800 million to $1 billion due to expected timing of purchase orders through the end of the year. Our year-end 2022 net cash balance is anticipated to be between $1.6 billion and $2 billion, an increase to the midpoint of $400 million primarily driven by increased module booking deposits and lower capital expenditures. And finally, shipment guidance of 8.9 to 9.4 gigawatts is updated to 9.1 to 9.4 gigawatts.\n\nWith that, I'll turn the call back over to Mark to provide an update on policy.\n\nMark Widmar -- Chief Executive Officer\n\nAll right. Thank you, Alex. I would like to discuss the U.S. policy environment, which has evolved significantly over the past quarter.\n\nAs you may recall, the joint announcement from Senators Manchin and Schumer regarding the Inflation Reduction Act preceded in our last earnings call by just one day. Since then, we have seen the Act signed into law and First Solar had the privilege to be part of the White House event in September, celebrating the groundbreaking piece of legislation. In our view, by passing and enacting the Inflation Reduction Act of 2022, Congress and the Biden-Harris administration has entrusted our industry with responsibility of enabling and securing America's clean energy future, and we recognize the need to meet the moment in a manner that is both timely and sustainable. Thanks to our strong foundation, including a repeatable, vertically integrated manufacturing template, proven technology platform and solid balance sheet, we were able to respond rapidly to enact -- to act by accelerating the decision to expand our U.S.\n\nmanufacturing base. Our confidence in committing to a 1.5 billion expansion in American manufacturing and R&D was backed by a healthy order book, a robust pipeline of opportunities and approximately two decades of experience in scaling U.S. solar capacity. However, we still have a substantial journey ahead as the relevant U.S.\n\ngovernment agencies work to implement the Act, providing interpretive guidance and alignment on process and administration. Specifically, we wait Department of Treasury guidance that will apply to what we believe is a legislation's intent to incentivize vertically integrated U.S. manufacturing under the Section 45X provision, allowing our thin film manufacturing process to access the entire integrated tax credit. Similarly, we also anticipate guidance on the domestic content bonus that project owners may seek under the new production tax credit and the extended investment tax credit for solar.\n\nGiven our unique manufacturing process, which transforms raw materials into a finished module under one roof, we expect that our product will qualify as U.S. domestic content and help enable the bonus incentive. As a crucial first step toward delivering clarity the IRS has solicited comments from interested stakeholders that will then shape the guidance provided around aspects such as the administration and value of tax credits under the 45X provision. Moreover, while we understand the urgent need for clarity, we encourage a healthy degree of patience as the details are normalized.\n\nThe effectiveness of this landmark climate legislation hinges on the thoroughness of this administrative process and resulting guidance. We strongly support the thorough, thoughtful approach being pursued by the Department of Treasury and IRS. As America's largest solar manufacturer, we remain actively engaged with the U.S. government and intend to respond to the public request for comment and provide input as an interested stakeholder to aid the guidance process.\n\nInternationally, we observed a strong growing focus from governments and democratic nations toward addressing the use of forced labor in the supply chain. In addition to the President said in U.S. we enforce Labor Protection Act, Australia, Canada and the United Kingdom have introduced measures to tackle the issue of businesses profiting from human rights abuses, particularly in China's Xingqiang region. More recently, the European Union released a draft law that could come into effect by 2025, which would ban the import of products linked to the use of forced labor regardless of where they are made.\n\nThese actions point to the growing compliance risks of continuing to rely on Chinese crystalline silicon and the increasing urgency with which solar industries and democratic nations need to find sustainable solutions in response to the significant threat. Meanwhile, our responsible solar standard has not simply emerged as a key competitive differentiator has also been driving factors behind our industry-leading ESG ratings. We are proud that earlier this week, First Solar made its debut in Investor's Business Daily 100 Best ESG companies of 2022, ranking six across all included corporations and first among energy companies. Being the only solar manufacturer included in this list of leading companies that makes profitability with ethical and social responsibility is a testament to our commitment to responsible solar and attribute to the sense of purpose with which thousands of our employees around the world make the most of each day.\n\nWith that, I conclude our summary on policy deployment. Alex will now summarize the key messages from today's call.\n\nAlex Bradley -- Chief Financial Officer\n\nTurning to Slide 10. We had a Q3 loss of share of $0.46 and updated our earnings guidance, including for the impact of unforeseen logistics costs. We raised our year-end net cash forecast midpoint by $400 million to reflect higher module bookings prepayments as well as lower forecast capex. Operationally, we produced 2.4 gigawatts and shipped 2.8 gigawatts of modules.\n\nIn addition to our recently announced 3.5 gigawatt U.S. greenfield plant, we today announced a $270 million investment in a new dedicated R&D line to be located at our Perrysburg, Ohio campus. Finally, Series 6 demand remains robust with 43.7 gigawatts of year-to-date net bookings, leading to a record contracted backlog of 58.1 gigawatts. The 16.6 gigawatts of new bookings since our prior earnings call in July have a base ASP, excluding adjusters, of $0.316.\n\nAnd with that, we conclude our prepared remarks and open the call for questions. Operator?\n\nOperator\n\n[Operator instructions] We'll take our first question from Kashy Harrison at Piper Sandler.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nAll right. Good afternoon everyone. Thanks for taking the question. So just going to -- I'm just going to combine a bunch in here.\n\nSo you indicated that some of the contracts that you signed recently have adders associated with the higher ITC. I was wondering if you could help us quantify how much revenue upside you may expect entering calendar '23 and '24 as we think about those years? And then maybe just some color on how you're thinking about financing all these investments, the $1.5 billion that you've talked about. And then finally, maybe just some color on how you expect to recognize these credits within your financial statements in the coming years. Thank you.\n\nMark Widmar -- Chief Executive Officer\n\nAll right. I'll take the first one, and then I'll let Alex do the finance and then how we expect to recognize the credits in the P&L. So our contracts have and we've been doing this for an extended period of time now in corporate provisions that relate to domestic content to the extent there was any legislation that would be passed that would differentiate domestic content value for incremental ITC or even out with the PTC. So we've incorporated those matters.\n\nWhat I'll say from my prepared remarks is one of the things that we highlighted is that, we recognized as part of our backlog that has already been contracted as of the end of last quarter for about 1.4 gigawatts, we have modified those contracts, which would include value now for domestic manufacturing and it was $52 million against that 1.4. And in my prepared remarks, I indicated it was about $0.037. So there's a significant uplift what's been contracted so far is we'd be recognizing across '23 and '24, but we have a lot more volume that we have to go out and contract. But I think it's an encouraging first step to have 1.4 now contracted at a pretty nice increase to our baseline ASP.\n\nAlex Bradley -- Chief Financial Officer\n\nYes. Kashy, on the -- I'll do the credit first as a quicker answer. We would expect it to be in the statement of a reduction to cost of sales. So you'll see it hit gross margin and then flow through the P&L from there.\n\nFrom a financing liquidity perspective, you start with where we are today, we're forecasting ending in the year at about $1.8 billion of net cash. That's the midpoint of the guide. At that point, we'll have about $200 million of debt associated with our India plant, the assumption being that Luz del Norte project and the debt associated with that is sold by the end of the year. So that's about $2 billion gross cash, $1.8 billion net at the midpoint.\n\nIf you think about use of that capital, by the end of the year, we'll have spent substantially all of the capex associated with our third Perrysburg factory, which is nearing the end of construction. We'll have double-digit millions remaining there, but the majority of that capex will be spent. As it relates to the India capex, we'll have 2% to 3%, maybe slightly higher, 400 remaining by the end of the year. The majority of what's left there will be covered by debt draws against the facility.\n\nSo the limited impact to net cash there. So you can think about between those what will be effectively through that capex spend or have debt associated with that capex spend by the end of the year. We've recently committed to about $1.5 billion of spend. So that's $200 million to expand Ohio, about $1 billion for our fourth plant in the U.S.\n\nand just under $300 million for an R&D line. That $1.5 billion will get spent over 2023 and 2024, potentially a small amount into 2025. If you think about sources for that, we've recently been getting significant prepayments to module sales. So we've been working with customers who are helping to provide capital to finance the expansions that we're undergoing.\n\nIf you look at that, we had about $150 million of module prepayments come in Q3. And if you look at the balance sheet as of the end of Q3, we've got just a little under $600 million of module prepayments on balance sheet at that point. The high point of the guidance assumes another 400 or so coming through by year-end. We have signed bookings, as you can see on -- in the bookings table in the presentation of about just under 10 gigawatts from the end of the quarter, so that deposits associated with those are not reflected in the queue.\n\nWe also have significant additional contracts that we're in late-stage discussions on, which would add more down payments. So I think there's opportunity to increase the down payment number as well. Beyond that, if you think about other sources of cash, we've got non-booking deposit module business, operating cash flow over the next couple of years, which we haven't guided to, but which will be significant. And that's all before you look at any of the proceeds coming from the Section 45X impact under the IRA.\n\nSo if you think about it today, we can finance the currently announced growth through a combination of cash on hand and operating cash flow. However, if you look beyond that, I do think we are continuing to evaluate opportunities to deploy more capital accretively, be that through the potential for additional manufacturing facilities, expanding at our existing facilities, putting more money into R&D potentially helping develop suppliers along the supply chain, and then there will also be some maintenance capex and other upgrades. So as I said today, we can finance the current growth with the combination of cash on hand and operating cash flow. If we do look at spending additional capital, we may get to a point where we either need or would like to go out and raise money.\n\nWe'll give a view around that when we give guidance for next year in February. At that point, we'll look at more of a comprehensive view of capital and funding needs and services need to raise capital. If we do, I suspect today would be viewed more as bridge capital given that we expect to see a significant inflow of cash from the Section 45X. And therefore, what we need most likely as a bridge to those proceeds.\n\nBut I wouldn't rule out anything at this stage, including the potential for equity or equity-linked capital as well.\n\nOperator\n\nWe'll move next to Philip Shen at ROTH Capital Partners.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nHey guys. Thanks for taking my questions. First one is on bookings. You've had a really nice bookings run for the past couple of quarters.\n\nIt looks like Q4 should be strong. I was wondering if you might be able to quantify what that might be? And then also for Q1 and 2, would you expect things to slow down then? Or do you think the bookings could continue? And it's ultimately the goal to potentially even book at through the end of the decade, perhaps, even over the next year. As it relates to the module cost structure, if solar, given this new FEMA building requirements that is up for a vote, if solar is required to build at risk category 4 versus now, which is risk category 1. And I know [inaudible] fighting for risk Category 2, how much more cost would that bring to your cost structure if we need to go to Category 4.\n\nMy understanding is to hit Category 2, there's no increase in your cost structure, but to get the category 4, is it $0.01 or $0.02 or potentially more? And then finally, from a housekeeping standpoint for Q3, can you share how many gigawatts were shipped that were recognized in revenue? Thanks, guys.\n\nMark Widmar -- Chief Executive Officer\n\nAll right, Phil, I'll take the first two and I'll let Alex take the last one. First off, Phil, as you can see what we announced in our presentation deck that if you look at our total pipeline of opportunities and then you look at our mid to late-stage opportunities, as I said in my prepared remarks, the 114 gigawatts of total opportunities and mid- to late stage is around 70 gigawatts, which both of those are record highs for us and meaningful opportunities for us to continue to see strong bookings momentum. I think this is the fourth quarter in a row that I think we've had double-digit bookings. So if you go back and if you look, starting with end of last year, Q4 of last year, we've had four quarters now with double-digit bookings.\n\nAnd this quarter here, at 16.6 is now an all-time record. When I look at near term, and I indicated, we'll sell through 2026 by the end of the year. And when -- and I also indicated we have a number of multi-gigawatt multiyear opportunities that are still in our pipeline. And we are seeing customers that are wanting to commit through the end of this decade.\n\nAnd we indicated in the prepared remarks, most of the bookings that we've seen right now are through 2027. And so now we're seeing longer-dated opportunities and again, multi gigawatts, which would be a historic record high individual bookings transactions that for us as a company. And I think where we sat before, our highest bookings we did before, I think it was somewhere in the range of about 5.4, 5.5, something like that with an individual counterparty. We've got multiple opportunities that would be significantly higher than that if we were able to close on those.\n\nAnd so I don't see the momentum changing at this point in time. And we will continue to book as long as we see strong ASPs, as we indicated in this last quarter, the bookings were $0.316 before adders. And if we can continue to see very strong ASPs going further out into the future, they have a very balanced risk/reward profile then we'll continue to do that. It also will continue to inform as we see that activity, and we'll continue to inform our views around additional factory expansions.\n\nWe indicated our most recent expansion, which would come online in 2025. And there's still a window to impact the second half of this decade with more factories here in the U.S. And so as we see stronger demand, that will inform our views around incremental capacity expansions. Phil, your next question -- as it relates to the FEMA requirement and the Category 4, we're very well of what's going on there.\n\nWhat I would say is that if there is a Category 4 requirement for the power plant, it is not uniquely defined at an individual component level. Our products with our contracts are to deliver against a specification and the specification is defined in those agreements. To the extent that there is a decision made that ultimately individual components would need to be modified to enable a power plant to meet a certain criteria, a different category than what exists today then that would be a modification to the contract because the specification requirements for the product would change. So that is something that could evolve and we'll address that to the extent that it does.\n\nThe other thing that I would say, I don't believe that the changes in order to hit the requirement of a Category 4 would necessarily be achieved by modifying or changing the module. I think more of it will come from the structure than it will come from the module. And there are certain things potentially you could do with the module as it relates to changing the frame or potentially the acryls or modify the thickness of the glass. All that is going to do is add weight to the product, which also creates challenges around install.\n\nThese modules with the labor two-men or three-men lift, there are some limitations around weight. So I don't know if your optimal solution will be modifying the module, I think it could be more or less a modification to the structure that could handle the incremental requirements in our Category 4.\n\nAlex Bradley -- Chief Financial Officer\n\nAnd Phil, just to your last question. So we produced 2.4. We shipped 2.8 gigawatts on a sole basis, it's about 2.25. So 2.25.\n\nIf you look at that against 620 revenue, it implies about a $0.275 ASP recognized.\n\nOperator\n\nWe'll take our next question from Colin Rusch at Oppenheimer & Company.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThank you so much, guys. Could you talk a little bit about the maturity of your process around the heterojunction process and products that you guys are looking at coming to market with -- and then as well with the price increases that you've been able to push through, is any of that price increase related to the manufacturing tax credit at all?\n\nMark Widmar -- Chief Executive Officer\n\nYes. So Colin, I think you're talking about our multi-junction product that we've announced our development around, which we also referred to as Tandem. Look, as it relates to the technology, we've made significant advancements in that regard in terms of the capabilities and improving and delivering high-efficiency products along the lines of the road map that we've envisioned so far. And ultimately, we'd love to get to a point where we're sitting at 24%, 25% type of efficiency at the module level.\n\nThe biggest issue that we still have around -- I think we made good progress in the lab. The real question is ultimately, how do we commercialize and when do we come to market. And one of the challenges that we've had in that regard is finding the right silicon supply chain, one that meets the criteria that are aligned with our approach around responsible solar. So I think the technology is evolving quickly.\n\nThe real question is, how quickly can we bring it to market? And how quickly can we get confidence in that supply chain that we would have to be dependent upon for the bottom sell, which at least the current vision is top cell thin-film CadTel, bottom cell crystalline silicon. Over time, we could look to evolve that to a thin-fin film construct, but that would be further out into the horizon. As it relates to pricing, again, what we said in the prepared remarks was that we are just in the process of realizing domestic content value that has been embedded in our base contracts. So we've contracted 1.4 gigawatts.\n\nIf you look at '23, '24 and '25, we have just on a capacity -- nameplate capacity perspective, we've got north of 20 gigawatts of volume that will be available on a nameplate capacity will be slightly lower than that when you think about actually realization of capacity given the overall ramp of the new factories. But there's a lot of volume still to go through. We're happy to see the uplift, which is right now a little bit -- it's about $0.37 or so of value. So we did 1.4 gigawatts and $52 million of ASP value creation.\n\nSo a lot of opportunities still go after the balance of that. We're just still in the early innings, and we'll continue to provide updates as we progress.\n\nOperator\n\nWe'll go to our next question from Julien Dumoulin-Smith at Bank of America.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nHey congratulations to you again. Well done, I got to say. I just wanted to follow up on a couple of pieces. You talked about capital allocation on brief.\n\nCan you talk about just expansion, right? You alluded to Europe as being an opportunity. Clearly, they have their own mandates or preliminary mandates in '25. Can you talk about that? Also, I'll note that the European bookings opportunity is a little bit modest.\n\nMark Widmar -- Chief Executive Officer\n\nJulien, we lost you. All right. Look, I think the question was around further expansion. And we are continuing to evaluate expansion, whether in the U.S.\n\nor outside of the U.S. We think we're very well positioned in both the U.S. and India. We're happy with the progress we're making with our new factory in India.\n\nWe're happy with the interest in our technology and the building up of our pipeline and very happy with the fact that we are now starting to contract for that volume off of that factory. And we're looking at multiyear agreements in India as well. U.S., the momentum is strong, the pipeline is very robust. And it's a matter of continuing to see that fill up.\n\nAnd then as we do, we'll inform our views on incremental capacity. EU for right now, we still would like to see better clarity around policy. And as I indicated, we, among others, that are involved in the EU from a manufacturing standpoint or supporting the market have written a letter or signed a letter that would hopefully encourage you to provide clarity around long-term stability of policy that would ensure -- enable an environment that is constructive to investments that we would need to make in the EU to support their long-term PV goals and climate change goals. So a lot going on, a lot of opportunity.\n\nIt's just a matter of prioritization, and we're happy to see -- we're happy that we have options that we can consider.\n\nOperator\n\nWe'll go next to Brian Lee at Goldman Sachs.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nHey guys. Good afternoon. Thanks for taking the questions. Apologies in advance, I'm going to ask about pricing again.\n\nI know there's been a lot on the call about that. But a couple of quarters in a row now where base ASPs for out-year bookings are increasing. I mean, it sounds like based on your commentary, Mark, you still have upside levers, not talking about the adders just on the base ASPs across portfolio bookings going forward. So just curious if that's the right read across here.\n\nAnd then how we should be thinking just in general around trends you're seeing for I would assume U.S. capacity versus Malaysia and Vietnam capacity or getting priced differently going forward? And then my follow-up would be just with all the capacity you're building and some of the commentary coming from some of your peers, clearly encouraging that we're seeing some onshoring of the supply chain here. But how are you thinking kind of longer term, back half of this decade, you guys have always been a bit more prudent about adding capacity when others are maybe a bit more irrational or have been. Like what do you think about the landscape of new players coming in into the U.S.? And then what the implications for your kind of longer, longer-term field strategy? And then maybe ASPs would be if you think about kind of beyond the next three-plus years? Thanks, guys.\n\nMark Widmar -- Chief Executive Officer\n\nYes. So in terms of base ASPs and opportunities, yes, we clearly are seeing an opportunity there as it relates to what was already contracted as of our last quarterly filing and as of the end of June. As indicated, we have provisions in our contracts. And in some cases, even if provisions are not in our contract, customers are reaching out to us and asking for an opportunity to get U.S.\n\nsupply, which will enable their value creation on domestic content. And then we have a discussion with them. And appropriately adjust -- amend the contracts or the incremental ASP value, we think, is appropriate for dedicating that that allocation to a particular customer. So that's momentum, and we'll continue to see how it progresses.\n\nLike I said, we're in very early innings, but we've got a lot of opportunity to continue to pursue. As it relates to U.S. capacity versus Malaysia, Vietnam, as of now, as we see the horizon sold through 2026 by the end of this year, I see all that volume in Malaysia, India -- excuse me, Malaysia, Vietnam has been committed and sold as part of that overall volume. And we are distinguishing ASPs in a meaningful way for that volume and nowhere near -- it will be substantiated by the difference in the relative cost structure between Malaysia and the U.S.\n\non a landed cost basis. So we are seeing some of that, but it's not -- so far it has not been material. And we'll continue to evaluate it as we move forward to ensure that we can sell through that capacity. And if we find that it's difficult to sell it into the U.S., we'll look to sell and support other markets internationally, such as EU from our Malaysia, Vietnam facilities over time.\n\nLook, we know that new capacity is going to come into the market. We believe we're an advantaged established player. We've got a unique initiated technology. We're the partner of choice with a number of key customers here in the U.S.\n\nWe also firmly believe that capex is going to be higher to bring production into the U.S. and the cost is going to be higher to manufacture here in the U.S. Our Series 7 product is a low-cost product relative to Series 6 relative to Series 6 in Ohio, but also relative and competitive with our international factories for Series 6. So we believe we've got a differentiated technology, a low-cost technology.\n\nAnd we also believe that competition to put manufacturing here in the U.S., whether it's at the module level, the cell level or down to the water level, that will be a higher cost of product that we still believe we can differentiate ourselves and maintain attractive ASPs even if that were to happen.\n\nOperator\n\nWe'll take our next question from Maheep Mandloi at Credit Suisse.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nHey, thanks for taking the question. Maybe just one question on the contracted backlog. Can you talk about how many of contracts at manufacturing PTC or the domestic content ITC pass-through build-in? And so trying to think how much of that 0.18 per watt flows through the bottom line? And how much could we expect to be shared with the end customers? And separately, I just wanted to understand more on the R&D line investment. What could we expect over there? It seems like it's like a one-gigawatt-spare capacity, but I just want to understand what new upgrades or changes and mix like that.\n\nAlex Bradley -- Chief Financial Officer\n\nYes, Maheep. On the backlog, we do not have any contracts where we are passing through or sharing the Section 45 production manufacturing tax credit. So let's be clear, that's all staying with us as we continue to build manufacturing and develop, we're going to use the proceeds on that credit to continue to expand both manufacturing and development and R&D here, but we're not sharing that credit with our customers under these contracts.\n\nMark Widmar -- Chief Executive Officer\n\nAs it relates to the R&D line, look, as I indicated, it's a 1.3 million square foot facility. We envision that, that line will probably start as it relates to ETAs. We may not run it 24/7. We may run it five days a week kind of thing, may not run again 24 hours.\n\nWe're probably going to be doing something in the range of 1,000, maybe 1,200 plates a day for engineering tests. So it has capacity. Obviously, you can do much more than that but it's more or less as needed given the development requirements that we have for various programs, both on our thin film as well as our multi-junction tandem and we'll utilize it as well over time to even think about next-generation technology, whether it's perovskites or some other thin films that could evolve over time. So we're excited about having the R&D line.\n\nIt decouples us from being constrained by our manufacturing capacity. It's going to improve our cycles of learning, and we really believe it will accelerate our technology road map and time to market.\n\nOperator\n\nWe'll go next to Keith Stanley at Wolfe Research.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nHi. Thank you. Just one clarifying question on Slide 4. The year-end nameplate capacity it looks higher for the new Series 7 plants than the slide you showed earlier in the year for Ohio and India.\n\nWhat's driving that? Are they a little ahead of schedule or anything else going on?\n\nMark Widmar -- Chief Executive Officer\n\nIt relates to -- when we announced the $1.2 billion investment in about 4.4 gigawatts of capacity, we did that I believe it was August, we indicated we were driving incremental throughput through our existing footprint. So we -- the factory was initially backed in to do about 16,000 to about 16,500 models a day. Now we've taken it up to 17,000 modules a day. So by that incremental throughput, we're getting more capacity out of the new factories.\n\nPlus, we've also optimized across the existing footprint of Perrysburg I and Perrysburg II, which will drive more throughput. So a combination of those two gives you almost a full gigawatt of incremental capacity. But it's for the new factories, and we are evaluating doing that for India as well. So we may pull another couple of hundred megawatts out of India based on the throughput improvements and capital that we would deploy there.\n\nSo it's really driven by that, just incremental throughput through the factories with a little bit of capital to make sure that it happens.\n\nOperator\n\nAnd we'll take our final question today from Joseph Osha at Guggenheim Partners.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nHey, I made it. Thank you. Three quick questions for you. First, I'm wondering -- I know it's hard to comment.\n\nDo you know much about what the cash timing of 45X benefits might be versus when you book them? I'm curious about that. I'll just do all three. The second question is looking at your tandem cell technology. I'm curious, is that more aimed at some of what you're looking at doing at rooftop or might we see that deploy in utility scale.\n\nAnd then third and finally, could we see you, given the magnitude of this U.S. footprint expansion, maybe think about starting to export some of that product? That's -- those are my questions.\n\nAlex Bradley -- Chief Financial Officer\n\nYes. So on the cash timing, it's something that's going to come, I think, with more clarity when we get IRS treasury guidance. Typically, at the end of the year, we would file a tax return, six to nine months after the year-end, and then there will be some time after that for us to receive cash. We're still -- it's still not clear exactly what process that will go through.\n\nSo we're awaiting guidance to understand that more.\n\nMark Widmar -- Chief Executive Officer\n\nYes. And then as it relates to our tandem product, the initial targeted market is going to be rooftop residential, largely through -- we've talked before about a partnership with SunPower. So that's largely the channel market and initially a rooftop. But the expectation will be over time as we continue to drive cost out of the product, optimize it more to a utility scale application versus a rooftop application that we'll be able to make that transition from our target -- initial target market of rooftop into utility scale.\n\nAnd then as it relates to exports, there's clearly an opportunity to export even if there's a point -- I know there's a question I think Bryan may have asked earlier about the excess capacity in the U.S. market. we have the capability at the right time if need be to export into international markets [inaudible] ourselves to the full benefit and the full integrated benefit under the manufacturing tax credit. So it's something to be evaluated.\n\nBut what I would say is near term, look, when you look at our pipeline, gross pipeline of 115 gigawatts, 114 gigawatts, excuse me, there's more than ample opportunity here in the U.S., as you can see by that pipeline that the vast majority of that sits in the U.S. And so that's our primary market that we'll be focused on for the near term.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRichard Romero -- Investor Relations\n\nMark Widmar -- Chief Executive Officer\n\nAlex Bradley -- Chief Financial Officer\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nMore FSLR analysis\n\nAll earnings call transcripts"
}