{
  "companyName": "Telefonaktiebolaget LM Ericsson",
  "companyTicker": "ERIC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/telefonaktiebolaget-lm-ericsson-eric-q3-2022-earni/",
  "content": "Telefonaktiebolaget LM Ericsson (ERIC -1.35%)\nQ3 2022 Earnings Call\nOct 20, 2022, 3:00 a.m. ET\n\nPeter Nyquist\n\nGood morning everyone and welcome to today's presentation covering the third quarter in 2022. With me here today I have Ericsson's CEO, Borje Ekholm and our CFO, Carl Mellander. [Operator instructions] Detail can be found in today's press release as well as on the website, ericsson.com/investors. Please also be advised that today's conference is being recorded.\n\nBut before handing over to Borje Ekholm, I would like to say the following. During today's presentation, we will be making forward-looking statements. These statements are based on our current expectation and certain planning assumptions which are subject to risks and uncertainties. The actual results may differ materially due to factors mentioned in today's press release and discussed in this conference call.\n\nWe encourage you to read about these risks and uncertainties in our earnings release this morning as well as in our annual report. With that said, I would like to hand over the word to Borje. Please, Borje?\n\nBorje Ekholm -- Chief Executive Officer\n\nThank you, Peter. Good morning, everyone and thank you all for joining us. I'm pleased to present another quarter with solid underlying performance, and we continue to see robust performance in our business as well as market momentum. Since 2017, we've been able to increase our RAN market share from about to 33%, up to 39% if we exclude Mainland China.\n\nWe've taken market share from all competitors, including our European, and we have continued to add to our global footprint during the past quarter. So we're really talking about here of some massive gains in overall footprint for Ericsson. These achievements are really based on our focus on technology leadership, and I would say technology leadership allows us to offer our customers leading technologies and highly competitive solutions. Equally important is that it allows us to do product substitutions to manage our margins.\n\nIn the quarter we also took a key step in our enterprise ambition by closing the acquisition of Vonage. It's really an exciting step for Ericsson, as Vonage will be a critical building block in our enterprise strategy, and it will underpin a full range of cloud communication solutions. We aim to transform the way advanced 5G capabilities such as speed, latency, and network slicing are exposed, consumed, and paid for, and we believe this will ultimately help our customers to monetize their network. We expect the Vonage acquisition to be highly accretive, and it compliments our enterprise wireless solution offerings with Cradlepoint and dedicated networks.\n\nOverall, we expect our enterprise offering to have a growth potential north of 20% per year. So let me go through some of the key takeaways from this quarter. In the quarter we saw organic growth of 3% with EBITA of SEK 7.7 billion and margin of 11.3%. We saw gross income increase by SEK 3.4 billion and reached SEK 28.1 billion.\n\nThis increase comes despite lower IPR revenues and was driven of course by the consolidation of Vonage, but also a strong performance in our network segment. Let me comment a bit on IPR. We believe we are in a very strong patent position with more than 60,000 patents, and when we sign license agreements, there will be a retroactive compensation paid for the unlicensed period, and thus it's not really lost sales, but it has a delay. And here we will continue to seek to optimize the value of our portfolio.\n\nSo it can always lead to some delays in revenue recognition. Networks saw organic growth of 7% if we exclude IPR and this was primary driven by North America where operators continue to be at the forefront of 5G development. Gross income increased by SEK 2 billion and reached SEK 21.4 billion. This result really shows the attractiveness of our leading portfolio built on technology leadership.\n\nAnd this is something we will continue to invest in to strengthen our position and competitive advantage. As I already referenced, we took an important step in the quarter by closing the acquisition of Vonage, and Vonage is really a key cornerstone in our expansion into enterprise. We expect the acquisition to help our customers accelerate their digital transformation, while also shaping how 5G networks will be exposed, consumed, and paid for. In the 4G world, operators could largely only monetize the network through a subscription model.\n\n5G features such as speed latency, but also network slicing offer new and important revenue opportunities, but we don't see that they can be monetized through subscriptions. They have to be paid for as they're consumed. We believe that these new features will be paid for separately for that reason, and the ability to do that will be through what we call network APIs. And with Vonage we have the ability to drive and develop this market.\n\nWe're really creating a new market for us and for our customers. And here it's interesting to see that we're already working very intensively with front-runner customers, basically to develop the APIs, but also to bring them to the market and our customers recognize that this will be a very important monetization engine for them going forward, so they can start to monetize the network investments that they're making. And creating those new revenue sources for our operator customers actually is of course critical because if they can't monetize their investments in their network, they will ultimately not invest in the network. So for us, we believe this will also increase the demand in our business for mobile infrastructure.\n\nSo we're excited about welcoming Vonage to the Ericsson family, and we look forward to working together now with them to generate value for both Ericsson, but also for our customers of course. Following the reorganization earlier this year, we today present the first quarter for cloud software and services. And as you know, this is a core part of the business, but we also see it's very attractive, but we have not yet realized the full potential in this business. We have a very strong starting position, and by combining the two market areas that we, or business areas that we've done when we form cloud software and services, we believe we can create a stronger unit with clear synergies.\n\nAnd the new management team is further accelerating the transition to profitability and that includes, of course, a strong focus on driving costs down, but also to leverage and solidify our technology-leading position as well as market leadership position. We expect this business to have gradual improvements, and we look forward to discussing more of the strategy and more of the plan to reach profitability at our upcoming Capital Markets Day. We continue to engage with the DOJ and the SEC in relation to the 2019 investigation report and the breach notices, and we're fully committed to cooperating with the government authorities. We're also continuing to work to strengthen our culture as well as ethics and compliance program.\n\nThis work remains one of our key strategic priorities and an area where we will continue to invest in to make sure that we are also a leader in that area. With that, let me give the word over to Carl Mellander, our CFO.\n\nCarl Mellander -- Chief Financial Officer\n\nThank you, Borje. Thank you and good morning to everyone. So yes, this is the first quarter then that we report in the new structure with the four segments, networks, cloud, software and services, enterprise, and others and also the first quarter where we consolidate in Vonage. The acquisition closed on the 21st of July.\n\nSo we basically have two months and 10 days or so in our numbers this quarter. But before I start to dive into the numbers, I wanted just to say that I will refer to some gross numbers here, and they will all be adjusted for currency and comparable units. I call that organic for short. And when I talk about profitability numbers, those will be excluding restructuring.\n\nI just say it now so I don't have to repeat that 16 times through the speech here. But let's start then with the numbers. Net sales came out to SEK 68 billion. Organic growth in three out of five of the market areas and the organic growth then was 3% for the growth -- for the group and that's despite and SEK 1.1 billion less IPR licensing revenues compared to Q3 last year.\n\nBut reported sales then grew 21%, of course helped by large currency tailwind, and also the fact that we added Vonage which contributed now with SEK 2.9 billion in sales this quarter. So IPR came out at SEK 1.6 billion. This is in line with the guidance that we had provided in the Q2 report where we said between one and 1.5, and we do provide the same guidance for IPR now for the fourth quarter as well, between SEK 1 billion and SEK 1.5 billion. Gross income grew by some SEK 3.4 billion in spite of the lower IPR revenues that I mentioned and growth of gross income really comes from sales increase in networks, given footprint wins we have and Vonage contributed SEK 1.2 billion to the gross income number.\n\nGross margin 41.4% down from 44%. Key reasons there for that decline being then first of all, again, for the third time, the lower IPR revenues, it's about one percentage point on gross margin, but we also see supply chain cost in Networks, as we have talked about before. And furthermore, large share of services business, again, coming from the footprint gains that we have secured over time and that come out in the P&L now in the Networks segment, especially. Looking at R&D, the engine for value creation in our company, we grew that by a SEK 1.7 billion in Q3.\n\nFX stands for about a third of that increase. But what we actually invest in here is the -- in the network side is the Ericsson Silicon or the next generation ASICs which enables industry leading radio performance, of course, but also things like energy savings compared to previous generations. But we also invest in the Cloud RAN portfolio which gives our customers more flexible options for deployment in Networks. And thirdly, we also focus R&D money on the, what we call enterprise wireless solutions.\n\nIt's, it's really Cradlepoint and dedicated networks to further extend or enhance the portfolio there in the offering. SG&A increased by SEK 3.2 billion. Again, big FX impact about SEK 0.7 billion in this case. And the increase here is mainly related to adding Vonage, consolidating Vonage into our numbers because Vonage impacted SG&A by SEK 1.8 billion, and that in itself includes intangible amortizations, which are then, of course not included in our EBITA metric, we will come to that, but also one-offs.\n\nAnd the combination of those intangible amortizations and one-offs is around SEK 0.6 billion of that SEK 1.8 I mentioned. So coming to EBITA then SEK 7.7 billion decline of 1.6 year over year, and this is an 11.3% EBITA margin. And again, I want to point out, we did have some one-off costs here including the M&A transaction costs that we talk about for the Vonage transaction. So in essence, the, the increase we saw in gross income which is the fruit of winning market share footprint, increasing sales, was more than offset by the increase in opex, which I just described, and mainly for technology investments, adding Vonage into our Ericsson family and currency.\n\nSo that leaves us with a net income of SEK 5.4 billion. And here I can say this is supported by a lower income tax also. So the tax rate now for Q3 was at 25%, compared with 30% a year ago. Finally here, the free cash flow came out at SEK 2.5 billion, and we continue to build buffers in inventory in order to meet deadlines of customer deliveries, and I'll come back to that a little bit more when we talk working capital and cash flow.\n\nSo on a rolling four-quarter basis, our EBITA margin was 12.8%, and that we can compare with our long-term target of 15% to 18% EBITA margin. So from that, we can move to the next slide and drilling a little bit more into the segment numbers. So starting with the mobile infrastructure piece, which consists of Networks and Cloud Software and Services. Networks, then, Borje already mentioned its organic growth of 4%, but excluding IPR, which is a special case, as we all know, given renewal negotiations, the growth was actually 7%.\n\nGross income, SEK 2 billion added year over year following the added sales that we talk about. And gross margin, 44.4%, that's impacted, again, by the lower IPR revenues, of course of which Networks record 82% as you know, but also some increased cost of components and supply chain investments there. In Cloud Software and Services we decreased the sales organically by 5% primarily, again, due to the lower IPR contribution. And here we have 18% of IPR recorded in this segment.\n\nBut we also saw some descoping of some of the many services business we have, some of those contracts decreased, and that's what we see in the minus 5%. Gross income in this segment, stable with a margin of 32.1% and EBITA negative SEK 0.7 billion in the quarter. Finally, then on the Enterprise side, now the share of total sales in enterprise has grown out to 8% in the quarter. The Enterprise sales has a total of Ericsson sales.\n\nAnd we did see very strong growth here with 21% organic by successes in Cradlepoint. The reported sales, of course, up SEK 3.6 billion or so and that has to do with adding Vonage of course contributing with SEK 2.9 billion as I mentioned. So EBITA here in Enterprise, I want to comment also was minus SEK 1.2 billion, compared to minus SEK 0.5 billion previous year. And the decline here is mainly due to one-off acquisition costs and some of this accounting for the acquisition accounting that we talk about with sales step down, etc.\n\nBut excluding these items, I want to say also that Vonage was EBITA positive in the quarter. Next slide. Looking at the market areas a bit more, we do see strong traction as mentioned for the solutions, and that is resulting in increased footprint. And we saw strong organic growth here in North America with 9%, but also Southeast Asia, Oceania, and India, which is one of the five market areas as well, with 13% up.\n\nIn Northeast Asia, we saw a decline of 6% and in Middle East and Africa sales grew by 3% organically. And finally then Europe and Latin America sales were flat year over year. And finally on this slide, I just wanted to highlight that when we talk about the market areas, this is about our mobile network infrastructure business of course, but in addition, we have the Enterprise piece, which we now book in market area other, just to make that clear. OK.\n\nIf we go to the next one and talk a little bit more about the cash flow side then, a key metric for us, of course is free cash flow before M&A and a SEK 2.5 billion impacted by the inventory buildup that we talked about component inventory. In comparison, Q3 2021 had higher than normal cash collection from customers, including rather large amount of prepayments, but also lower than usual payments to suppliers. But this quarter we instead saw, yes, good collection but also impacted then by inventory, which is back to the proactive decision to safeguard delivery times to customers. Based on what we see now, current visibility, we expect this component inventory to come down toward the end of the year and into next year.\n\nAt the same time, I want to mention, in terms of being forward looking here, that given market share gains or footprint gains that we have, we believe that working capital will remain on a rather high level as we roll out large volumes globally. So gross cash position after this quarter now is SEK 45.8 billion and net cash is SEK 13.4 billion. And I would say we have a well-balanced maturity profile here for resilience with maturity profile of 4.1 years, which is a slight increase from a year ago. Maybe just final comment on this slide when we look at, again, the rolling four quarter perspective we have generated SEK 18.8 billion of free cash flow before M&A and that's 7.3% of net sales.\n\nAnd you can compare that again to the long-term target of 9% to 12% of sales. Next slide is, I wanted to spend a few minutes on the Vonage acquisition and how the purchase price actually translated into our accounts here. Basically starting with the US$6.3 billion that we announced when we closed the acquisition and I would like to guide you from that to the numbers that you can see then in our cash flow statement. So first of all, we have a net debt, SEK 7.1 billion deducted.\n\nThen there are some deferred considerations here SEK 2 billion that's mainly related to employee benefits and stock-based compensation. And finally, we had a benefit here from hedging SEK 3.7 billion, well done by the treasury team in terms of setting this hedge up for this particular acquisition. And that all results in the SEK 51.3 billion paid as you can see here in the bottom of the table and in the report. I can also mention that during the quarter, during Q3, we repaid SEK 5.9 billion of Vonage's existing debt and both the debt side and these shares were paid by cash on hand.\n\nBefore leaving this, I wanted to mention one item here and I refer you to the other information in the report, because there we talk about discussion between Vonage and the Federal Trade Commission, FTC in the U.S. around historic consumer practices. And there is an estimated here already provided for in Vonage's book of $100 million. And depending on timing of this resolution, etc., and the specifics we might see the cash outflow from that happening in the fourth quarter.\n\nYes, you also see we stated the goodwill and intangible asset numbers here. It's in line with what we have said before. So goodwill, according to the preliminary PPA SEK 43.7 billion and intangible assets 21.9, and therefore we expect amortization to be about SEK 2 billion per year. Move to my last slide for today.\n\nThis is about outlook for Q4 and also for next year to some extent. And this is repeating on what we are saying in terms of providing information forward. Starting with some specifics for the fourth quarter, then IPR again, we estimate that to be between SEK 1 billion and SEK 1.5 billion IPR revenues in Q4. Opex has seasonality.\n\nIt typically increases with some SEK 3.1 billion between Q3 and Q4 and for Q4, I think this could be a pretty good indication where we're heading, but of course a bit of caution there can always be some large variations between quarters. Then regarding Networks, after this record capex that we've seen and are seeing in North America in 2022 where we expect the RAN market to grow by 12%, we see that the investments are expected to hold up well during 2023, albeit at a slightly lower level or lower level than 2022. And we expect that initial adjustment of capex levels to materialize is somewhat already in the fourth quarter. At the same time, and this is important, we see revenues from footprint wins in other geographies accelerating during the fourth quarter, and we are, we expect that this will compensate for potentially lower sales in North America in the fourth quarter.\n\nAnd as mentioned and some of these footprint gains as we have stated before also. In early stage and large scale projects, we might have a dilutive impact on the gross margin. But of course, as Borje mentioned earlier in his introductory remarks, we focus a lot on increasing the absolute SEK amount here in gross income. So and looking at 2023 then the global footprint gains lead to an expectation.\n\nWe have that 2023 will imply additional growth. So one more thing on Networks then. We state in the report that we now expect Networks to exceed for 2022. The financial target range that we had provided for Networks, which was 16% to 18%, we expect them to exceed that somewhat.\n\nAnd in Cloud Software and Services, we are now saying in the report that we expect full year 2022 result to equal 2021 full year results. Finally, just a couple of words before I hand back over to Borje, a couple of words on the inflationary environment that the world is experiencing now and of course, we are taking action to respond to that situation. Basically three fronts. First of all, we are making pricing adjustments with customers, but we also leverage product substitution as a very important mean to rebase our pricing.\n\nAnd here of course, technology leadership is key again, through our R&D investments with the idea to bring new value-adding products to the market. We are also as Borje mentioned, but I'll repeat simplifying operations in our company and reviewing our options to reduce cost. And we talk in the report about redundancy or a structuring cost rather, which we have since earlier a guidance of 1% of net sales. And we will, of course, come back to that.\n\nAnd all of these actions are of course to ensure that we secure our ability to deliver on the long-term financial targets for the Group, which is, as you know, 15% to 18% EBITA excluding restructuring. So with that, I hand back to our CEO, Mr. Borje Ekholm.\n\nBorje Ekholm -- Chief Executive Officer\n\nThank you, Carl. So to sum up, we've delivered another solid quarter with good business momentum. As you know, our strategy is based on leadership in mobile infrastructure and the focused expansion into Enterprise. Mobile infrastructure clearly remains our core and we're fully dedicated to continue to invest in technology leadership to further strengthen our position.\n\nIn line with our strategy, we're adding to our footprint, which strengthens our scale and competitiveness. The second leg of our strategy is a focused expansion into Enterprise. Here we added a significant building block by closing the acquisition of Vonage, and we're now starting to have a meaningful presence also in the Enterprise space. In Enterprise Wireless Solutions, we almost doubled our sales compared to last year.\n\nI would say our strategy puts Ericsson in a position to continue to lead the industry as 5G is rolled out and transform every sector of our society. As you know, network development in North America has been very strong, and after expected record capex in 2022, operators are guiding for lower capex in 2023. We expect levels to hold up well in 2023, but they will be at a lower level than in 2022. Globally we continue to further strength on our position by increasing our footprint and we expect to see lower sales in North America for Q4 to be compensated by growth in other regions.\n\nHowever, these contract wins will ramp up to full volume in 2023. We expect our added footprint to give full effect next year, and we expect to see overall growth in networks globally in 2023. To add footprint that's been a critical part of our strategy since 2017 and it will continue to be a priority. We know from experience that early stage large-scale rollout projects tend to be dilutive to gross margins.\n\nHowever, the increased volume will increase total gross income and thereby allowing us to continue to invest in technology leadership, which has been the core of our success over the last few years. And if you look at the global 5G market, it's important to, to remember here that the 5G cycle is really just started. The fact is that less than a quarter of global LTE nodes have been upgraded to 5G mid-band so far. And as you all know, mid-band frequencies are critical to fully realize the potential or the performance of a true 5G network.\n\nSo I would say this shows that there is still a lot of growth potential in the market. I'll just pick one example, India, where we will see a rapid build-out of mid-band Massive MIMO. India will likely have the strongest digital infrastructure outside of China, which will drive digitalization of India. Combined this with the new use cases for 5G, both for enterprises, but also for consumers and that includes, for example, fixed wireless access, we see that the demand for network performance and network infrastructure will continue to be at a high level.\n\nSo we see the 5G cycle both to be longer and higher than previous cycles and previous mobile generations. I'm convinced that with 5G, everything that can go wireless will go wireless. So as we continue to navigate a very complex macro environment and that includes, as Carl mentioned, clear inflationary pressures, but also geopolitical uncertainty. We remain very excited about our future and we're dedicated to the execution of our strategy based on technology leadership.\n\nRegarding inflationary pressures, we are already taking actions, and this of course includes a focus on cost and really making sure that our cost efficiency is the key way to allow us to continue to invest in R&D, because again, technology leadership is really what makes the difference and will allow Ericsson to continue to grow. So we are convinced that that also is the right focus to remain successful in this competitive market. And we are super excited about our position in this exciting market. One more thing and that is we are very committed to continue to strengthen our culture, and that of course includes the ethics and compliance program.\n\nThis is one of our key strategic pillars and an area we will continue to invest in. Based on our strong position, we remain committed to reaching our long-term target of an EBITA margin of 15% to 18% no later than 2024. And, in December, we'll host our first Capital Market Day since the pandemic and we really look forward to welcoming you all in New York. And then we can discuss more in detail our strategy, market developments and our plans to build the competitiveness and future value creation in many years to come.\n\nFinally, I would like to say big thank you to Team Erickson. It's a lot of hard work and dedication that's going to make our current position really and the strength of our current position. So I'm proud to be part of this team and thanks everyone for that. With that, over to you Peter for questions.\n\nPeter Nyquist\n\nThank you, Borje. [Operator instructions] And I see here that we have our first question from Aleksander Peterc at Societe Generale. Hello, Aleksander.\n\nAleksander Peterc -- Societe Generale -- Analyst\n\nYes. Good morning. And I hope you can hear me well.\n\nPeter Nyquist\n\nPerfect.\n\nAleksander Peterc -- Societe Generale -- Analyst\n\nSo yes, thank you for the question. So the first question I would have really is on the development in Networks margin. So we see that the footprint acquisition costs are back, so this may be good for your longer-term growth, but near-term that some pressure. So could you just give us an idea of the growth margin decline in Networks sequentially in the third quarter? Is that more down to this footprint acquisition push or is it still higher inflationary cost pressures than those that you saw in your previous quarter? And then obviously in Q4, you have the usual down seasonality in your gross margins in Networks, but from what I understand, this should be now compounded a little bit by these two effects.\n\nCould you a little bit develop on that? And then just secondly, very briefly, if you could give us an idea of where the restructuring costs will be directly is at COGS, R&D, or SG&A, I mean which division? Thanks.\n\nBorje Ekholm -- Chief Executive Officer\n\nCarl, do you want to start?\n\nCarl Mellander -- Chief Financial Officer\n\nOK. So thanks Aleksander. Regarding the networks gross margin then and you ask as specifically about sequentially. I understand that, but I just wanted to repeat here.\n\nThe year-over-year comparison is then impacted by the IPR difference. So quite a large amount on total group is SEK 1.1 billion and 82% of that is in Networks. But otherwise, I would say there are a couple of factors impacting networks here. One is the, what we have talked about around the component and supply chain cost where we are investing, but it's also a higher cost, which we absorb in there.\n\nAnd the other part actually comes from something very positive and that's the growth that we see and early stage large scale contracts that we're executing on where the services share is higher and that has an impact on gross margin. And we have seen before that we might have that initially impact, but then of course we recover over time as we roll out. So I would say those are the key impacts there on Networks.\n\nBorje Ekholm -- Chief Executive Officer\n\nI would only add that, for the, you already saw these effects in the third quarter.\n\nCarl Mellander -- Chief Financial Officer\n\nYes. We should say.\n\nBorje Ekholm -- Chief Executive Officer\n\nThe increased service share is visible in the result.\n\nAleksander Peterc -- Societe Generale -- Analyst\n\nYes.\n\nBorje Ekholm -- Chief Executive Officer\n\nThen you asked about the restructuring and I like to think that what we are going to do is to digitalize and actually simplify Ericsson that's really our focus. So it's more of a gradual improvement and we're going to work on taking costs out. I would say it touches both COGS, but also of course the G&A structure in the company and exactly how the split is. Let's discuss that at the Capital Markets Day.\n\nBut we are going to tackle both of these sides because I think ultimately a leaner company will be a more agile company and will be better at responding. So I would also say, we kind of recognized this earlier and that's why we launched the group function global operations, and you know that from the spring this year. And that the ambition with that function was actually to drive a, call it a better customer experience by simplifying our processes and digitalizing them. And that's something that we will now more or less accelerate in light of the macro uncertainties.\n\nCarl Mellander -- Chief Financial Officer\n\nMaybe -- I can add on the cost side as well, if I can add one more thing. It's not only a defensive move because of inflation, it's also about competitiveness, of course. And we constantly work on improving our structural cost base to be really competitive, not only on technology, but also on the cost side, of course in the market.\n\nPeter Nyquist\n\nThank you, Aleksander for those two questions. So thank you. And now we are ready to move to the next question from the audience. And that one will come from Andreas Joelsson at Danske Bank.\n\nGood morning, Andreas.\n\nAndreas Joelsson -- Danske Bank -- Analyst\n\nGood morning, Peter, and good morning, everyone else. I know that you will come back to this at the CMD, but I need to still ask about Cloud Software and Services. We have seen these deployment costs for a while now, and can you just explain a little bit why there is a delay in the positive impact that we should expect? Has anything changed structurally in this that you see, and also if we now have a weaker macro situation and the pickup of 5G is further delayed, how will that impact the unit going forward? And if I may also on IPR it's SEK 1.1 billion lower is that, there is FX in that of course, but it's the majority of that related to Apple and the litigation process that you're into right now? Thanks.\n\nBorje Ekholm -- Chief Executive Officer\n\nShould I take the first part, the IPR part?\n\nCarl Mellander -- Chief Financial Officer\n\nYep.\n\nBorje Ekholm -- Chief Executive Officer\n\nYeah. The reality is we have higher cost for new product introductions. So it has a bigger service content short-term, and that's what you see impacting, call it the margins in Cloud Software and Services. So and we knew that from before, and you've seen that before, that continues to be at a high level.\n\nWe are still only seeing the early stages of deployment of the 5G Core. So revenue wise, they lag these costs, so they are impacting that's no doubt about that. I think it's also fair to say that we don't really yet see a slowdown in the rollout of 5G, and I really don't expect to see that either, for the simple reason that traffic at the end consumer continues to grow at a healthy rate, so there will be a need to migrate customers over to 5G. So we will see 5G networks increasingly carry traffic in the future.\n\nThat's at least what we see as of now. Then I would say in order to restore profitability or reach profitability, which is really the, that's the first step, I think we have a much higher potential in this business than that where we can capitalize on our leading position in a good way. But in order to reach that, the first phase here, we need a tighter control on costs. And that's why we put together two earlier business areas into one.\n\nSo we get a stronger focus on having cost control, but also gets in, this on product development because we had overlapping product portfolios between the two. As you can recognize, this takes some time to take out, but that is what the team is working on to really call it become much leaner and much better cost structure in the combined entity, leveraging the synergies across the different offerings. So that's where we are working. That will of course, take some time to get the full benefit, but we should start to see that coming into next year and be in a much better position.\n\nSo then we'll get helped by the ramp-up of 5G, but also that we're addressing our own call it cost position.\n\nCarl Mellander -- Chief Financial Officer\n\nGood. And the last question was around IPR and the delta there. And yes, I can say it's, the biggest thing here is of course, contracts under renewal negotiations. So and as you know, just as a reminder, when such contracts are entered into, we also have the retroactive effect of that in our P&L from the date of expiry.\n\nJust so you know that.\n\nAndreas Joelsson -- Danske Bank -- Analyst\n\nThanks.\n\nPeter Nyquist\n\nThank you, Andreas, for those two questions. So we are now ready to move into the next question from the audience today, and we have the next question from Francois-Xavier Bouvignies from UBS. Good morning, Francois.\n\nFrancois Bouvignies -- UBS -- Analyst\n\nGood morning everyone. Can you hear me OK?\n\nPeter Nyquist\n\nPerfect.\n\nFrancois Bouvignies -- UBS -- Analyst\n\nGreat. Thank you. My two questions were first on the Vonage acquisition. Can you give us a bit some light on the underlying performance of Vonage because you just acquired, so just wanted to reconcile the numbers in the early days of the integration, and how should we think about the enterprise profitability trend going forward after a number of one of maybe this quarter, just trying to understand the profitability trend, that we should take into account in the next few quarters? And my second question is, Borje, you talk about 5G use cases being a driver of the growth and adoption specifically in India for example, for next year you already see some contracts.\n\nAnd we asked you many times, I guess in the past the use cases for 5G that you see that could be a game changer for the adoption. Can you list maybe, some use cases that you see particularly interesting, and how is it evolving there? Because when we talk to two operators, it doesn't seem that obvious, or in terms of use cases, especially like for example, in China when they struggle to see much application or use cases just to have something, to have your perspective here and how is it evolving? Thank you very much.\n\nBorje Ekholm -- Chief Executive Officer\n\nYep. Why don't you start with the other, I can go first with the 5G use cases and you take the other two.\n\nCarl Mellander -- Chief Financial Officer\n\nSure. Yep.\n\nBorje Ekholm -- Chief Executive Officer\n\nYeah. This is an interesting question. The reality is when 4G was introduced, everybody would say, if you ask operators that you don't really need 4G because you had 3G. That proved to be incorrect.\n\nAnd the reality is with 5G, we're starting to see a number of emerging use cases. Maybe the first one is that's actually already today commercial is fixed wireless access. And we see that gaining traction quite fast, for example in North America. But we also see what other operators around the world are doing, like in India.\n\nSo we see that as a completely untapped revenue pool today will be captured by building out, of course, the 5G network, both in mid-band, but also in millimeter wave in order to capture that. We think that has a massive potential. So that's one thing. But then I think the other, where we're starting to see emerging use cases, for example is the connectivity, simple connectivity to an enterprise where in the 4G world, it was typically fixed access.\n\nToday, we are starting to see some SMEs, the fact they are using wireless as the primary connectivity. And that's what we're seeing is benefiting the growth in Cradlepoint for example. And just to give you another case is of course within factories so private networks or dedicated networks, there we see a rather large amount of use cases. For example for self-driving vehicles, self-guided vehicles, factory automation, etc., used in mines, enterprises and you're already starting to see that market shaping up quite substantially.\n\nPart of that market will be captured directly from the enterprises of course, and that's why we're building up an enterprise presence. Part of that will be captured by the operators. And I would say we don't know how that market is going to shape up, but it will happen. And the last element I think is equally important is we're starting to see, and here we have worked together with a number of application developers on how they need to use speed, latency to drive new applications.\n\nAnd those are clearly, where we believe our Vonage acquisition will fit perfectly in order to have a platform to present those. And here, what are we talking about? We're talking about collaboration software, we're talking about XR, VR applications that will start to come and we will very soon start to see devices that will need the speed latency, ability for mobile edge compute, etc. And those will actually spur demands for completely new use cases. So I think we need, when we talk about this, everyone looks for the silver bullet, the magic killer application, so to say.\n\nI think we will start to see those emerge in one, two, three years as networks really get fully developed, that's when you start to see the benefit of 5G in society. So what we see is still a very strong development and a very exciting development. If you only offer mobile broadband, I think then it's going to be a different market, then it's only a, call it capacity add onto 4G, then it's very different. But we see those new use cases starting to develop now.\n\nCarl Mellander -- Chief Financial Officer\n\nI think Borje you basically addressed the other question very well as well on the enterprise side, but maybe a few more words there on enterprise. Of course, for Vonage it is early days. Honestly, we have two months and 10 days. And as we said, and I think this is quite important during this period, Vonage underlying, if we include, exclude some of this acquisition accounting and one-offs and so on, they are EBITA positive and also cash flow positive in the quarter.\n\nSo that's a very good sign. I think very important and Borje described this is about growth here in the Enterprise side. We see great growth in Cradlepoint, and we expect that in Vonage as well. And on Vonage of course, that we're looking at this through three horizons or three lenses, right? The existing Vonage business to boost that and continue growing that; and secondly the synergies from Vonage offerings into Ericsson's global footprint of customers; and then thirdly, of course, what Borje really talked about the network API side of the business where we can create an entirely new market.\n\nAnd of course, all together we see this as very value accretive for the group. At the CMD, I think we will come back for sure to the Enterprise side and describe layout a bit more the strategy and the expectations there.\n\nPeter Nyquist\n\nThanks, Francois.\n\nFrancois Bouvignies -- UBS -- Analyst\n\nThank you, gentlemen.\n\nPeter Nyquist\n\nThank you, Francois. Hope you're happy with those answers. So we'll move to the next question for today, and we will have that one coming up from I see up here, Pierre Ferragu at New Street. Good morning, Pierre.\n\nCan you hear us?\n\nBen Harwood -- New Street Research -- Analyst\n\nGood morning. This is Ben Harwood standing in for Pierre. He is in a new environment and can't speak.\n\nPeter Nyquist\n\nThat's OK as well.\n\nBen Harwood -- New Street Research -- Analyst\n\nWe just had a couple of questions on your Enterprise business. So we just want to know how you view the competitive landscape in the wireless enterprise networks, and then what are your competitive advantages and how do you see yourself competing with companies that are partnering with either hyperscalers or enterprise companies that already have a fairly broad sales reach? Thank you.\n\nPeter Nyquist\n\nBorje?\n\nBorje Ekholm -- Chief Executive Officer\n\nThat's a great question. I think this is something that we'll spend a lot more time on in the Capital Markets Day. But to give you a quick couple of comments, yes you're absolutely right. This is a competitive space.\n\nWe feel though that we're the market leader in the wireless Vonage today through Cradlepoint, so that we're well-positioned here already. And we have a very strong and growing presence in dedicated networks built upon some clear product advantages. So we believe, we are going to continue to develop this strongly. Of course, this space is going to be having a lot of competition coming in also from hyperscalers.\n\nAnd we see that our solutions will be really run on hyperscalers as well. So I think why should not only think of them as competitors, they're going to be partners for us as well in order to reach the market.\n\nPeter Nyquist\n\nThanks, Borje.\n\nBen Harwood -- New Street Research -- Analyst\n\nThat's great. Thank you, Borje.\n\nPeter Nyquist\n\nThank you for that question. So we have still 10 minutes to go, so I'll move to the next question in the call. And that one is from Janardan Menon at Jefferies. Good morning, Janardan.\n\nJanardan Menon -- Jefferies -- Analyst\n\nHi. Good morning, Peter. Thanks for taking the question. Just wanted to go a little bit more into the outlook for gross margin into 2023 and into Q4 arising from the sort of shifting landscape of regions for the Networks division.\n\nSo you are saying that U.S. or North America will be down next year. Can you give us an idea of how much it will be down? At this point I know that visibility for the full year may be low, but what is your initial feel since you've already said that it will be down? And just from a product mix point of view, I mean, sort of regional mix point of view, what can we assume is a sort of impact on gross margin and is it something that will be sort of a bigger hit in Q4 and maybe first one or two quarters of next year, and then as you go through the initial phase of deployment in places like India the margin will rise into the second half of next year? So what I'm saying is, should the gross margin profile be one of a steady increase from a lower point say in the early part of next year all the way into Q4? Is that how we should look at it? And then I have a brief follow-up if I may thanks.\n\nCarl Mellander -- Chief Financial Officer\n\nOK. Yes, exactly. So what we talk about in the report is that U.S. will hold up with things so North America that is but with on a lower level, exactly how, what the amounts we we're not providing data alone.\n\nBut we think it's very key to realize that we also win business in other parts of the globe, across the globe, and that that will compensate how the gross margin will develop. We comment that by talking about some of these footprint wins where it tends to have a dilutive impact in the beginning, but that over time, then that comes back. So of course, it on your question, how it would develop during next year is a function of when these projects are ramping up and volumes in big roll-up projects and so on and come in. But again, we focus a lot on this of course, and even more so on the gross margin or the gross income sorry, delivery here, because in absolute money, that is what drives our ability to invest in technology.\n\nSo I think that's what we can say now.\n\nBorje Ekholm -- Chief Executive Officer\n\nYes and remember the, you're asking a question on a quarterly basis. Our contracts are rather long and it has a long rollout cycle. So how it exactly hits each quarter will always be a bit subject to kind of what happens. So we are trying more to give the overall sense where these type of developments will be next year.\n\nSo I would encourage you more to think about what is it we're trying to do. Yes, it's actually to strengthen our market position and based on that we will manage gross margins following a bit this guidance that Carl went through. But it's all way, and I understand your desire to have this on a quarterly basis, but it's a bit in these large contracts. That's why they are a bit swings between quarters are not inconsequential, let's call it that.\n\nCarl Mellander -- Chief Financial Officer\n\nIt's very true. And I think on the big picture also, I think it's good to remember the 15% to 20% EBITA that captures all of this actually and as you know, we said in fourth quarter 2021 that we will reach that point, that range within two to three years. Now we specify that we're talking 2024, that's our ambition. That's what we're going for as a company.\n\nAnd of course we will manage quarterly swings and so on to get to that longer-term position.\n\nPeter Nyquist\n\nThank you, Carl.\n\nJanardan Menon -- Jefferies -- Analyst\n\nUnderstood.\n\nPeter Nyquist\n\nYou had to just follow up as well, Janardan?\n\nJanardan Menon -- Jefferies -- Analyst\n\nYes. Just very quickly. So on that 2024 target, so what would be the key factor in that jump? I mean, can we have, is there an increasing amount of confidence that the previous sort of Digital Services business so the current Cloud and Software business will reach that critical mass and be a bigger jump into 2024, or is it more coming from the Enterprise business where those profit margins including on Cradlepoint and Vonage will become bigger? I agree that you'll probably give us more color on that at your Capital Markets Day, but just as an initial view what would be the moving parts on that would be very useful?\n\nBorje Ekholm -- Chief Executive Officer\n\nClearly, we think we sit with a very good business in Cloud Software and Services, and that clearly will be a big part of the contribution to reaching these long-term targets, that's for sure and especially swinging from a loss into profitability. So that's one part, but of course, the rest is what we see is really on the Enterprise side where we're going to continue to grow and strengthen our position. So it's all about the mix of those two contributing, but we'll go into this in greater detail when we meet in December.\n\nJanardan Menon -- Jefferies -- Analyst\n\nUnderstood. Thank you very much.\n\nPeter Nyquist\n\nThanks, Janardan. We will now actually move into the last question for today's session. And we will have the last question coming up from Sandeep Deshpande at J.P. Morgan.\n\nGood morning, Sandeep.\n\nSandeep Deshpande -- JPMorgan Chase and Company -- Analyst\n\nYes. Hi. Good morning. Sorry, I might have missed a question.\n\nSo if this was asked Pete excuse me. My question is on the Cloud Software and Services. I mean, this business in its previous incarnations always was underperforming as well. As part of this restructuring what will be done in this business to make it better performing? And what has changed in the business this year that the guidance is now given to be flat with last year in EBIT something has deteriorated here.\n\nSo we'd like to understand that. Thank you.\n\nCarl Mellander -- Chief Financial Officer\n\nYou know Sandeep, if we start with the business promise or if we look at it from a, you're absolutely right. We have underperformed in this area for a long time, but we have also seen a relatively strong improvement compared to 2017 when losses were running much bigger than today. So it's always a journey. So of course, we go to this level and we're not happy at this level.\n\nWe need to fix this. It should be a profitable business. With our market position and the technology we offer, this has all the potential to be profitable. So if you look at improvements over the past couple of years, a lot of it comes from basically turning around parts of the business, like our BSS offering, for example.\n\nBut where we now have or have challenges I would say is of course on our 5G Core, and that has taken a bit longer to get to market than we expected a year ago. And it has carried a lot more system integration costs and early, call it service costs than we anticipated a year ago. But we have also a lot of geopolitical developments that you are well familiar with and that also impacts the business volume in Cloud Software and Services, very detrimentally so and that has also hurt the business this year. So it's a multitude of factors.\n\nSo what we said here is that given that backdrop, that's why we also felt we need to get more synergies out in the investments we make for the future. And that's why we combined Managed Services and Digital Services, so we can start to create those type of offerings that leverages the synergies between the two. Of course, there is a G&A synergy by removing one business area, but there are other synergies on the R&D side as we invest in AI and machine learning and actually the distribution of those software to our customers, that's where we get the big benefit. That will take some time to get out, but that's where the team is really focused on getting the benefits out.\n\nPeter Nyquist\n\nThanks, Sandeep. And thanks, Borje, and thanks, Carl for good answers in this session. But before concluding, I just want to repeat what Borje said, that we will have the Capital Market Day in New York, December 15 and there will be possibilities to register upcoming week here for all of you that want to participate. So by that, thank you all for participating in today's call.\n\nBorje Ekholm -- Chief Executive Officer\n\nThank you.\n\nCarl Mellander -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nPeter Nyquist\n\nBorje Ekholm -- Chief Executive Officer\n\nCarl Mellander -- Chief Financial Officer\n\nAleksander Peterc -- Societe Generale -- Analyst\n\nAndreas Joelsson -- Danske Bank -- Analyst\n\nFrancois Bouvignies -- UBS -- Analyst\n\nBen Harwood -- New Street Research -- Analyst\n\nJanardan Menon -- Jefferies -- Analyst\n\nSandeep Deshpande -- JPMorgan Chase and Company -- Analyst\n\nMore ERIC analysis\n\nAll earnings call transcripts"
}