{
  "companyName": "SNDL Inc.",
  "companyTicker": "SNDL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/14/sndl-inc-sndl-q3-2022-earnings-call-transcript/",
  "content": "SNDL Inc. (SNDL 1.95%)\nQ3 2022 Earnings Call\nNov 14, 2022, 10:30 a.m. ET\n\nOperator\n\nGood morning and welcome to SNDL's third quarter 2022 financial results conference call. SNDL issued a press release this morning announcing their financial results for the third quarter ended on September 30th, 2022. This press release is available on the company's website at sndl.com and filed on EDGAR and SEDAR as well. The webcast replay of the conference call will also be available later today on the sndl.com website.\n\nSNDL has also posted a supplemental investor presentation found on the sndl.com website. Presenting on this morning's call, we have Zach George, chief executive officer; Jim Keough, chief financial officer; Tank Vander, president of liquor retail; and Andrew Stordeur, president and chief operating officer. Before we start, I would like to remind investors that certain matters discussed in today's conference call or answers that may be given to questions could constitute forward-looking statements. Actual results could differ materially from those anticipated.\n\nRisk factors that could affect results are detailed in the company's financial reports and other public filings that are made available on SEDAR and EDGAR. Additionally, all financial figures mentioned are in Canadian dollars unless otherwise indicated. We will now make prepared remarks, and then we'll move to analyst questions. I would now like to turn the call over to Zach George.\n\nZach George -- Chief Executive Officer\n\nGood morning, everyone, and welcome to SNDL's third quarter 2022 conference call. Q3 proved to be another encouraging quarter for our company. Our focus on operational execution and sustainable profitability has enabled us to deliver record revenue and operating cash flow this past quarter. I've spent almost three years openly discussing the challenges facing our company and the cannabis industry.\n\nAnd for the first time, I see contrary indicators suggesting that the Canadian industry is nearing a trough, warranting a more bullish stance. Despite the imperfect rollout of the Canadian legal cannabis market, a massive oversupply of licenses and products, and continued pricing erosion, there are reasons for optimism at SNDL. In a sense, things in the Canadian cannabis industry are so bad that they're good. We are seeing an unrelenting oversupply of flower inventories and an acceleration of bankruptcy filings among peers.\n\nOur team continues to work hard every day to turn industry headwinds into tailwinds for our consumers and investors as we drive toward improved results. Our liquor retail business continues to reach a normalized run rate following the return of on-premise consumption post-COVID, and we expect seasonally strong results in Q4. This segment has provided operating cash flow that has had a stabilizing effect on our consolidated results, and we are pursuing new initiatives that we believe will drive further accretion. Notably, we are in the early stages of developing across segment loyalty program and intend to offer point-of-sale analytics as a service in both cannabis and liquor in 2023.\n\nOur strong business technology team is a differentiating factor for SNDL, and we are excited to unlock the team's capabilities. Scale is mission-critical to our success. The baseline costs of running a CPG-oriented company with a Nasdaq listing, high director and officer insurance rates, internal and external SOX compliance costs, and the commercial costs of best practices in CPG put many of our peers in a position where they're incapable of delivering sustainable profits above the costs associated with managing this infrastructure. This dynamic will drive further industry consolidation, and we believe our vertically integrated cannabis business gives us the advantages required to be a strong member of a future oligopoly in Canada.\n\nIt is worth contextualizing the growth that the SNDL team has built this past year. We have grown our revenue at a staggering rate of more than 1,500% on a year-over-year basis. We now manage more than 350 liquor and cannabis stores, making us the largest private market liquor and cannabis distributor in Canada. SNDL's retail strategy is predicated on its quality store locations, wide range of products, and differentiated retail experiences.\n\nWe also own and operate Canada's largest indoor purpose-built cannabis cultivation and processing facility, with a diverse brand portfolio ranging from value to premium. Our cannabis retail and cannabis operations are key enablers in SNDL's vertical integration strategy. With the scale of data and insights generated through our retail network, we are able to continuously tailor our innovation strategy to play in high-velocity product segments, as well as white spaces in the industry, in order to delight consumers. Our integration work and cost-control initiatives will continue into 2023 as we remain focused on opportunities related to Alcanna and the recently acquired assets of Zenabis and expect to close the proposed acquisition of Valens in January of 2023.\n\nWith Valens, SNDL aims to be a leading Canadian manufacturer, with broad cannabis product capabilities, strong optionality related to low-cost procurement, and best-in-class innovation potential. The acquisition enhances our positioning by combining a diverse brand portfolio and extensive retail footprint, low-cost biomass sourcing, premium indoor cultivation, and manufacturing facilities. As one of the largest purchasers of biomass in the country, we expect the pro forma company to take advantage of the current market oversupply, which will enhance margins and provide desperately needed working capital to certain industry participants. SNDL is well on its way to becoming one of Canada's largest adult-use cannabis manufacturers and retailers.\n\nAnd with our retail insights and financial strength, SNDL should be able to adapt quickly to emerging and evolving consumer trends. At the company's inception, prior leadership prudently focused on inhalable formats that have made up more than 80% of sales in the industry. That said, market dynamics change quickly in cannabis, and Valens provides increased capabilities with a full suite of cannabis products, including ingestibles and beverages. SNDL will also have the highest pro forma of Canadian cannabis revenue on a last fiscal quarter annualized basis once we complete this acquisition.\n\nWe do not intend to participate in the knife fight that is ongoing between Canadian cannabis companies. We seek to be a partner to the industry, promoting best practices, responsible consumption, and sustainability. In terms of our investment segment, to the third quarter of 2022, SNDL had deployed capital to several cannabis-related investments with an IFRS fair market value of approximately 678 million, including 527 million to the SunStream Bancorp joint venture. This JV has credit exposure to a handful of operators, including Jushi, SKYMINT, Ascend, Parallel, Columbia Care, and AFC Gamma.\n\nIn the next few weeks, we expect to provide investors and stakeholders with more clarity about our SunStream portfolio activities. While our goal is to generate attractive returns as a strategic capital partner for these borrowers, in certain cases, we may see defaults or other restructurings create an opportunity for SNDL to gain a meaningful operating footprint in a single or multistate format. Our transformation is far from complete, but with an improving portfolio, cost discipline, and continued organic and acquisitive growth, we are well-positioned to reach our objectives, including the generation of sustainable free cash flow and long-term shareholder value. I am privileged to serve passionate professionals, including more than 2,500 employees, who continuously work to transform our business and delight consumers daily.\n\nOur vertically integrated model, dedicated team, best-in-class balance sheet, and scale are competitive advantages we've built for the express purpose of giving ourselves the flexibility to succeed under multiple economic and regulatory scenarios. And these are the advantages that will lead us in our next leg of growth. Thank you, and I'll pass the call to Jim for comments on our financial results.\n\nJim Keough -- Chief Financial Officer\n\nThank you, Zach, and good morning, everyone. I'd like to remind you that all amounts discussed today are denominated in Canadian dollars unless otherwise stated, all comparative results for the third quarter of 2021 exclude the subsequent acquisition of Alcanna Inc., which closed on March 31st, 2022. Certain amounts that I will refer to on this call are non-IFRS GAAP measures. Please refer to SNDL's management's discussion and analysis for the definitions of these measures.\n\nBefore I go into greater detail of SNDL's financial results under each of our four operating segments being liquor retail, cannabis retail, cannabis operations, and investments, I will begin with our consolidated financial highlights. It's a pleasure to announce that SNDL achieved record net revenue for the third quarter of 2022 of $230 million, compared to $223 million in the second quarter of 2022 and $14 million in the third quarter of 2021. This represents a 3% increase sequentially and an increase of over 1,500% year over year. SNDL also achieved an adjusted EBITDA of 18 million for Q3 2022, up 169% from Q2 2022 and up 74% from Q3 2021.\n\nOur cash flow provided by operating activities was 8.6 million in the third quarter of 2022, compared to cash used in operating activities of 17.9 million in the second quarter of 2022 and cash used in operating activities of 56 million in the third quarter of 2021. Our gross margin grew to 50 million in Q3 2022, a record since SNDL's inception, up 17% from Q2 2022 and an increase of over 2,700% from Q3 2021. General and administrative expenses for the three months ended September 30th, 2022 were $45 million, compared to 9 million for the three months ended September 30th, 2021. The increase of 35 million was primarily because of increases in salaries and wages, as well as office and general expenses from the Alcanna and Inner Spirit acquisitions, with SNDL now employing more than 2,500 personnel across all segments.\n\nNet loss for the three months ended September 30th, 2022 was 98.8 million, compared to net income of 16.7 million for the three months ended September 30th, 2021. This increase in net loss of 115 million was largely due to higher G&A expenses, about 35 million; depreciation and amortization, 7 million; asset impairment of intangibles and goodwill from the Inner Spirit acquisition, 86 million; finance costs of 8.3 million; and change in fair value of derivative warrants of 32 million, all partially offset by an increase in gross margin of 48 million, lower investment losses of 12.5 million, and transaction costs of 4.9 million. As of September 30th, 2022, SNDL has $988 million of cash, marketable securities, and long-term investments, and no outstanding debt. I'll now review the results for our liquor retail segment.\n\nSNDL currently operates 169 locations, predominantly in Alberta, under its three retail banners: Wine and Beyond, Liquor Depot, and Ace Liquor. Gross revenue for liquor retail sales for the three banners combined was 152 million for the third quarter of 2022, an increase of 4% compared to the third quarter of 2021, despite Alberta's off-premise liquor retail volumes sales being down this past quarter compared to the same period last year. Gross margin was $35 million, or 23% of sales in Q3 2022, compared to 33 million in Q3 2021. We continue to maintain the margin year over year through a pricing and product mix strategy in Q3 2022.\n\nLet's take a closer look at our cannabis retail results next. We currently own and/or operate 183 locations under two retail banners: Spiritleaf and Value Buds. Gross revenue for the two banners combined in the third quarter of 2022 was $66 million, compared to 6.1 million in the third quarter of 2021, a 985% increase. Value Buds' sales were the material driver of the increase with 58 million of revenue during Q3 2022.\n\nOur gross margin for Q3 2022 was 14.5 million, or 22% of sales, compared to 3.7 million in Q3 of 2021. And this is primarily due to Value Buds' new locations and aggressive pricing strategy. I'll now turn to SNDL's cannabis operations results. Gross revenue from the cannabis operations segment for the third quarter of 2022 was 16.5 million, compared to 15.4 million, a 7% increase over the second quarter of 2022; and compared to 11 million in the third quarter of 2021, a 49% year-over-year increase.\n\nWe're pleased to announce that we achieved a record gross margin in the third quarter of 2022 of 0.2 million compared to negative 1.9 million for the three months ended September 30, 2021, and negative 4.3 million for the prior quarter. The significant improvement was mainly a result of a 2.3 million reversal of inventory impairment in Q3 2022, which demonstrates SNDL's progress in implementing supply chain excellence. Next, I'll review our investment operations. As of the end of Q3 2022, SNDL's cannabis-related investments had a carrying value of 677 million, including 526 million in the SunStream Bancorp Inc.\n\njoint venture. For Q3 2022, the investment portfolio generated interest and fee revenue of 4.3 million, compared to 3.3 million in Q3 2021. Our share of profit of equity accounted investees generated from investments by SunStream was 9.2 million, compared to 9.9 million in Q3 2021; and investment loss of 5.5 million, as compared to a loss of 18 million in Q3 2021 on marketable securities, which includes unrealized losses on publicly disclosed strategic investments in Village Farms International, Inc. and the Valens Company Inc.\n\nFinally, let's discuss activities that affected SNDL shares. Effective July 25th, 2022, SNDL's common shares were consolidated on a one-share-for-each-10-shares outstanding basis. As of September 30th, 2022 and November 11, 2022, SNDL had an unrestricted cash balance of 291 million and 361 million, respectively, and a total of 236 million post-consolidation shares outstanding as of November 11th, 2022. For the nine months ended September 30th, 2022, SNDL purchased and counseled 1.7 million common shares at a weighted average price of $3.61 Canadian or $2.75 U.S.\n\nper common share for a total cost of $6.1 million. The share repurchase program was scheduled to expire on November 19th, 2022. On November 11th, 2022, the SNDL board approved extension of this program by an additional year. I would now like to invite Tank Vander, president of liquor retail, to provide further remarks on our liquor retail segment.\n\nTank Vander -- President, Liquor Retail\n\nThank you, Jim, and good morning, everyone. I would like to start by saying I'm proud of the liquor retail team's continued focus on operational performance and dedication to delivering an exceptional retail experience for our customers. The liquor segment strengthens SNDL's ability to own the customer relationship and shape the retail experience, and our positive results illustrate that capability. Our third quarter results feature sales of 152.5 million, a 4.5% increase from the third quarter of 2021 and a 5% increase from the second quarter of 2022.\n\nThis result was achieved despite the decrease in off-premise sales across the industry this past quarter due to customers returning to a normal routine after the COVID-19 restrictions were lifted. The adjusted EBITDA for the liquor retail segment increased by 198% in the third quarter of 2022 compared to the previous year, from $4.6 million to $13.7 million. Gross margin in the liquor retail segment was 35.6 million, or 23% of sales in the third quarter of 2022, compared to 33.6 million in the third quarter of 2021, an increase of 5.7%. While the yearly gross margin growth is positive and we have maintained it sequentially, central procurement teams carefully planned buying on limited-time offers to increase margin.\n\nWe continued to stay competitive with pricing, especially with our discount banners such as Ace Liquor, and capture further market share with a great variety of value products for our customers. SNDL is leveraging the scale, store footprint, and warehousing infrastructure to enable strategic buying decisions that drive margin and competitive pricing. One of our liquid retail strategies to gain current gross margin results remains with our preferred label sales. Preferred label sales were 10.7 million in the third quarter of 2022, an increase of approximately 1 million compared to the third quarter of 2021.\n\nOur liquor retail segment model was built on the premise of operational efficiencies to provide as much value to our customers while ensuring sustainable profitability. Despite wage increases, we are able to reduce our payroll costs by 3% compared to the previous quarter. We also reduced our operating expenses for the liquor business by approximately 6% in the third quarter of 2022 compared to the previous quarter, from $6 million to $5.7 million. Our diligent focus on cost efficiencies allows us to offer competitive pricing to our community, leading to stable revenue growth.\n\nOur customer count for all our banners is up by 1% year over year, and the average basket value is up 3% despite inflation pressures. We see larger basket sizes at our Wine and Beyond locations, where consumers come for the extensive offerings and experiential approach to liquor retail. We currently have 11 Wine and Beyond locations in Alberta and one location in Kelowna, British Columbia. In Alberta, Wine and Beyond stores account for approximately 3% of the market share in the province compared in line with the previous quarter, proving the success of the destination shopping concept.\n\nOur third quarter sales results for Wine and Beyond were $33.8 million, a 43% increase from the third quarter of 2021. The increase was mainly due to our four additional stores open this past year. We are very proud to announce that Wine and Beyond celebrated its 10th-year anniversary this past September. We commemorated this milestone with our community by running a 10-week-long celebration that included local beer partnerships, exclusive single-barrel releases, exciting tasting events, and various in-store promotions.\n\nSDL operates 169 liquor stores in Alberta. Our liquor banners' market share in Alberta, where we predominantly operate, was approximately the same as previous quarters, with 17.6% in the third quarter of 2022. Market share data is based on management's estimates using available industry data. Moving forward, we will continue to optimize profitability and cash flow for the liquor retail segment by focusing on cost discipline, margin-accretive products, and differentiated preferred label offerings.\n\nWe will leverage SNDL's extensive inventory and retail footprint to enable leading e-commerce experiences and touchpoints. Looking to 2023 and future expansion, our approach will be calculated and focused on current market conditions. Thank you again for your time this morning, and I'll pass it on to Andrew for SNDL's cannabis operations update.\n\nAndrew Stordeur -- President and Chief Operating Officer\n\nThank you, Tank, and thank you all for joining today. This is another encouraging quarter for our cannabis operations, building off our positive momentum in 2022. We are beginning to see the scale of our vertical integration strategy deliver our intended results and maturity of our operations solidify our path to long-term profitability. Coupled with our focus on cost optimization and enhanced product strategy, we are successfully executing our 2022 plan.\n\nOur focus on cultivation excellence continues to show positive returns as gross revenue from the cannabis operation segment for the third quarter of 2022 was 16.5 million, compared to 15.4 million, a 7% increase in the second quarter of 2022; and compared to 11 million, a 49% year-over-year increase. SNDL achieved a record gross margin before fair value adjustments for the three months ended September 30th, 2022 of 3.6 million, or 31%, compared to negative 4.9 million for Q3 2021, an increase of 8.6 million or 176%. These substantial improvements demonstrate SNDL's progress in delivering sustainable top-line growth through managing our product mix, pricing, and volume initiatives. I'm also pleased with our continued focus on implementing supply chain excellence to drive discipline around cost optimization despite intense price compression, higher power costs, and overall cost inflation.\n\nTo further expand on our product mix strategy, we have increased our inhalable offerings nationally from vape, large-format flower, and both infused and traditional pre-roll formats to meet growing consumer demand and drive market share in these keystone segments. We continue to make progress in our cultivation strategy, reflecting industry dynamics. Our access to increased data and analytics through our vertical integration at retail enables us to target white spaces and enhance our portfolio offering. We are excited to announce the launch of the Value Buds' private label in partnership with Nova Cannabis, which arrived in Alberta in early November and will launch in Ontario early in the first quarter of 2023.\n\nThe Value Buds' offering focuses specifically on large-format flower and is uniquely curated for the Value Buds consumer. The initial launch includes four SKUs in both 14-gram and 28-gram pack sizes with fully compostable packaging. We recognize our role in reducing cannabis packaging waste. We're also looking at opportunities for significant cost savings.\n\nI'm excited to report on this with more detail in the fourth quarter, but the early sentiment from consumers has been very positive. To further build on our large-format offerings, under the Palmetto brand, we launched several flower SKUs in the third quarter to fill growing industry demand, including 14-gram formats of both our Romulan and OG Kush dried flower. Moving to pre-rolls, this category, inclusive of infused offerings, continues to accelerate, representing seven out of 10 of the fastest-growing segments in our own retail locations. Pre-roll share revenue and own retail has increased by almost 10% since January 2022.\n\nAs such, we have expanded our Top Leaf's Caviar Cone offerings with two new flavor blends launched in the third quarter. We're also excited to launch our Caviar Cones reserve pack in Q4 as part of our holiday campaign. The Palmetto brand will launch a newly infused pre-roll in Q4. This enables us to compete in various price points and pack sizes within one of the fastest-growing inhalable segments in Canada.\n\nFinally, to build on our vertical integration and export strategies, SNDL completed our first international shipment to Israel in the third quarter of 2022, and through our acquisition of the Zenabis business, we are looking to accelerate further international opportunities. While our primary focus remains on the Canadian market, international export will prove to be a beneficial expansion for our cultivation and processing operations. The additional monetizable inventory procured from Zenabis and increased production capabilities further enable our supply chain to expand our large-format flower offerings to our leading retail footprint nationally. In closing, we remain on track with our plan, and I'm proud of how our team continues to execute during a very challenging time within the industry.\n\nWe're optimistic about the momentum built in 2022 and closing the year strong. Thank you, and I'll pass it back to Zach for closing remarks.\n\nZach George -- Chief Executive Officer\n\nThank you. Overall, I am encouraged by the progress we are making across all aspects of our business. I'm proud of the way our team is executing with purpose, confidence, and resilience. Our work is far from complete, but SNDL has a tremendous opportunity to continue forging the path forward for regulated products both in Canada and internationally.\n\nThe team is committed to building a world-class business, and we are excited about the possibilities ahead. Thanks to all, and we look forward to updating you on our progress into the end of 2022.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Our first question comes from Shaan Mir of Canaccord Genuity. Please go ahead.\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nGood morning and congrats on the quarter. My first question is on the cannabis operation. So, just based on some of the third-party tracking data we subscribed to, we saw that September adult-use sales had come down slightly for your brand specifically toward the end of the quarter, and that kind of sustained into October. So, I was wondering if you could provide any -- some color on the dynamics there.\n\nAnd more specifically, what indications do you have or that you've started to capture a majority of the revenue synergies expected from that Alcanna transaction? Or do you see other ways to leverage that platforms toward expanding your branded sales from here?\n\nAndrew Stordeur -- President and Chief Operating Officer\n\nYeah, hey, Shaan. It's Andrew. Thanks for the question. Look, I think first thing I'd say is we're on our plan for our own retail in our vertical integration strategy.\n\nSo, I think that's tracking as we expect it to track. And I would also say, too, like we're -- you know, as we've stated before, you know, our focus isn't, you know, driving for short-term market share. As you can look at our earnings results here, we've been really focused on the margin profile through mix and volume and pricing. And you can see that start to pay dividends for us as we build out more sustainably.\n\nObviously, market share is important for us. And a couple of things maybe I'll mention on that point. I think -- as I stated, we're on our track for our own retail. We're looking at some of the data that we're getting through our own retail, and that's obviously vast.\n\nAnd some of the areas that we're focused on, you know, particularly as I mentioned in my comments, is around the pre-roll offerings. And, you know, I think that's a big opportunity. We see that segment continuing to grow both from traditional pre-rolls, as well as infused. So, you know, we're focused on [Technical difficulty] you know, we've got a fairly large offering moving into some of the large-format flower.\n\nThat has not been something that we've had in our portfolio throughout the last couple of years. So, we'll start to see some of that play out in Q4. And, you know, Shaan, as you know, that's where primarily the majority of that volume is shifting. It's certainly moving away from that 3.5-gram moving into large-format flowers.\n\nSo, I think that's also some good tailwinds for us as we think about kind of the year and then getting into 2023. I don't think that's going to stop, particularly given the oversupply in the market. And I think, look, I think there's the last component I'd say is as we think about, you know, our recent acquisition of Zenabis and the flexibility and optionality that provides us on low-cost flower and continuing to play in that segments as the industry kind of figures itself out with pricing, I think that's a positive. And then, you know, as Zach mentioned in his comments, you know, we're excited about the pending close, the balance and through that, you know, that midstream manufacturing side, you know, that's going to further accelerate our ability to play in these white spaces that our current portfolio doesn't necessarily offer.\n\nSo, I think those are some areas there are market share that I think are really important to understand the context.\n\nZach George -- Chief Executive Officer\n\nSo, to add to that -- just to add, like it's important to keep this in context, right? So, we closed the Alcanna transaction at the end of March. So, when you think about share of shelf inside the Nova network, it started at zero. OK? So, this is not a light switch. We are going to -- we've moved very, very carefully on a sustainable basis and focused on, you know, where economic margin is.\n\nBut also, we're trying to drive the right assortment. We're also trying to optimize the performance of the retail network itself. And so, you should expect this to be a two-year process as we transition and manage the assortment and mix going forward. \n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nThank you. My next question is just on your views toward the U.S. operation. So, obviously, your balance sheet is a position of strength here.\n\nAnd with Canopy making that announcement for the kind of USA structure, it seems like there may be a door that might open up a bit for you to leverage that balance sheet in the U.S. So, just wanted to get a sense, is this something that Sundial has given any thought to, particularly using a similar structure to make opportunistic plays in the U.S., or is the focus still here to remain on building that credit book there?\n\nZach George -- Chief Executive Officer\n\nYeah, thanks for the question, Shaan. So, as you know, our pace of deployment has slowed. So, we have seen the cycle really start to creep in maturing markets in the U.S. And so, you've seen pressure on flower prices.\n\nI would say that we think that the cycle in Canada is as much as several years ahead of what we're seeing in the U.S. So, we expect more competition and pressure in the U.S. as those markets mature. We feel quite good about our position with a half-billion-dollar credit portfolio through our SunStream venture.\n\nAnd as I mentioned, I think that's going to be a pretty dynamic book. In some cases, we will very much be passive strategic suppliers of capital. Or in other cases, you know, there's still a need for additional working capital and, in some cases, recapitalizations of businesses. And we're, you know, well-suited to provide leadership and help drive those processes.\n\nSo, we think 2023 is going to be quite an interesting year in terms of our existing capital footprint in the U.S.\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nOK. Thank you for the answer there. And once again, congrats on the quarter, and I'll pass it along.\n\nOperator\n\n[Operator instructions] Our next question comes from Frederico Gomes of ATB Capital Markets. Please go ahead.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nHi, good morning. Congrats on the quarter. Thanks for taking my questions. My first question is on the cannabis retail segment.\n\nI saw that the number of Spiritleaf's stores declined this quarter, and apparently, that's coming from your franchise network. So, could you comment on what's driving those store closures? Now, given the current environment in retail, how are the economics looking like to Spiritleaf franchisees and what are you doing to maybe improve that? Thank you.\n\nZach George -- Chief Executive Officer\n\nIt's a great question. Very cool. Appreciate it. So, we've seen quite a bit of activity and change in the retail portfolio.\n\nSo, we've been actively opening doors. In certain cases, closing doors. You'll recall that, you know, a lot of the site work or franchise partner selection was done by prior leadership. And so, still working to optimize that network.\n\nAnd I would expect sort of every iteration of what you would expect to happen, you know, going forward, including organic openings, closings, and growth by acquisition. So, this is really a natural process where the, you know, the portfolio needs to be pruned in a hyper-competitive environment. But overall, the network is functioning, as you would expect, given the dynamics and the difference in the pricing structure that's in the market today.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nOK. Thank you. And then in terms of your first international shipment this quarter to Israel and now with Zenabis, you know, how should we look at the potential increase in international sales there? And are you looking at other potential markets such as Germany, for example?\n\nAndrew Stordeur -- President and Chief Operating Officer\n\nYeah, thanks, Frederico. It's Andrew here. Appreciate the question. Yeah, absolutely.\n\nI think our first transaction is -- particularly with export is always the most challenging dealer-wise. So, really pleased with our team's ability to execute that on the SNDL side in Q3. We just obviously closed on the Zenabis acquisition on November 1st. So, it's, you know, last two weeks here, we've been kind of moving forward there, understanding further opportunities.\n\nWe look at export, as I mentioned in my commentary, as great optionality for our operations businesses. As Canada kind of figures itself out, we obviously are maintaining our focus on the domestic market. We have lots of interest in our flower, both from a legacy Zenabis standpoint and some existing contracts, but also moving forward as other markets and regulatory frameworks figured themselves out. In regards to what the future holds on that front and other markets, we're looking at all of them.\n\nYou know, we're going to be pretty focused on the current agreements that we have in place, fulfilling those, but we're setting up our operations to have the optionality required as more regulatory, you know, figures itself out depending on which country, and we're starting from continue to look at that. But, you know, that's still some ways away, particularly in markets like Germany as we figure that out.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nOK. Thanks for that. I'll hop back to queue.\n\nOperator\n\nThis concludes the question-and-answer session. I would like to turn the conference back over to Zach George for any closing remarks.\n\nZach George -- Chief Executive Officer\n\nThank you, operator. And thanks, everyone, for joining us today. We look forward to updating you on our progress in the near future. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nZach George -- Chief Executive Officer\n\nJim Keough -- Chief Financial Officer\n\nTank Vander -- President, Liquor Retail\n\nAndrew Stordeur -- President and Chief Operating Officer\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nMore SNDL analysis\n\nAll earnings call transcripts"
}