{
  "companyName": "Ambarella",
  "companyTicker": "AMBA",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/02/ambarella-amba-q3-2023-earnings-call-transcript/",
  "content": "Ambarella (AMBA 1.51%)\nQ3 2023 Earnings Call\nDec 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Ambarella's third quarter fiscal year earnings conference call. [Operator instructions] After the speakers' presentation, there will be a question-and-answer session. [Operator instructions] Please be advised that today's conference is being recorded.\n\nI would like to turn the conference over to your speaker, Louis Gerhardy. Please go ahead, sir.\n\nLouis Gerhardy -- Corporate Development and Investor Relations\n\nThank you, Lisa. Good afternoon and thank you for joining our third quarter fiscal year 2023 financial results conference call. On the call with me today is Dr. Fermi Wang, president and CEO; and Brian White, CFO.\n\nThe primary purpose of today's call is to provide you with information regarding the results for our third quarter of fiscal year 2023. The discussion today and the responses to your questions will contain forward-looking statements regarding our projected financial results, financial prospects, market growth, and demand for our solutions, among other things. These statements are subject to risks, uncertainties, and assumptions. Should any of these risks or uncertainties materialize or should our assumptions prove to be incorrect, our actual results could differ materially from these forward-looking statements.\n\nWe're under no obligation to update these statements. These risks, uncertainties, and assumptions, as well as other information on potential risk factors that could affect our financial results, are more fully described in the documents we filed with the SEC, including the annual report on Form 10-K that we filed on April 1st, 2022 for fiscal year 2022 and in January 31st, 2022, and the Form 10-Q filed on September 8th, 2022 for the second quarter of our fiscal year 2023. Access to our third quarter fiscal 2023 results press release, transcripts, historical results, SEC filings, and a replay of today's call can be found on the investor relations page of our website. Fermi will now provide a business update for the quarter, and Brian will review the financial results and outlook, and then we'll be available for your questions.\n\nFermi.\n\nFermi Wang -- President and Chief Executive Officer\n\nThank you, Louis, and good afternoon and thank you for joining our call today. Q3 was mostly as expected. While there are material headwinds from an industrywide semiconductor cyclical downturn, there is no change in our very favorable secular growth outlook for the opportunity enabled by our edge AI endpoint investments. During Q3, in four key ways, we demonstrated significant progress to develop these opportunities.\n\nFirst of all, our positive market development momentum continues, highlighted by the November 18th announcement from Continental AG that after a multiyear evaluation, they became the first to integrate our CV3 SoCs into their ADAS product lineup. Second, our six-year automotive revenue is $2.3 billion, an increased of about 28% from the $1.8 billion announced a year ago, with approximately $800 million one business. This funnel is predominantly driven by our computer vision and the domain controller SoCs, and it is important to note, our automotive SAM over the same period is still 10 times the size of this new automotive funnel, so there's plenty of headroom for share gains. Third, our content in our customers' products continues to rise as we leverage our historical success with optimized processing for high bandwidth sensing.\n\nThis is demonstrated by a total blended SoC ASP we estimate will increase about 20% this year. Furthermore, we expect our new SoCs like CV5 and the CV3 to command significantly higher ASPs. Fourth, we are on track to reach our goal of -- for CV to be 45% of total revenue this year. And with a strong Q4 CV run rate, CV revenue is expected to post strong growth in fiscal 2024 and become a larger portion of our mix.\n\nNow, I will provide some examples of our market development activity. On November 18th, German automotive Tier 1 Continental announced that it will offer advanced driver assistance systems based on our CV3 AI domain controller SoC family. Our high-performance, power efficient, and scalable SoC portfolio built for ADAS and autonomous applications complements Continental's solutions for assisted driving and further advances vehicle automation. The joint solution, with its centralized single-chip architecture, enables the next generation of vehicles to more quickly perceive environmental conditions by processing multiple sensor inputs simultaneously.\n\nSupported sensing modalities include high-resolution cameras, radars, and lidars, as well as ultrasonic sensors. Our integrated SoC enables the early fusion of raw sensor inputs, wherein the data from different sensors is combined for advanced vehicle automation. The high scalability of our CV3 SoC family allows vehicle manufacturers to choose the optimal performance level for their system requirements while using the same vehicle architecture. Additionally, this joint solution's low power consumption reduces cooling requirements, making sustainable energy saving possible while also reduce -- reducing system costs.\n\nContinental's ADAS solution with integrated Ambarella SoCs will be showcased for the first time at the CES 2023 in Las Vegas. Also, during the quarter, we announced another win in Japan with Toyota, who began shipping its Yaris and Yaris Cross models, featuring a Gentex auto-dimming mirror with integrated digital video recorder. Based on Ambarella's A12 automotive SoC, the dual-channel video recorder features both front- and rear-facing cameras, as well as an app that allows customers to pull recorded video directly to their phones. Mercedes-Benz begins shipment of vehicles in China and Korea with a car recorder from Korean Tier 1 supplier Mobile Appliance.\n\nBased on Ambarella's H22, the car recorder includes both an ultra HD front camera and a QHD rear camera. In November, we announced that China-based INVO Tech is in mass production with a driver and an occupant monitoring system that is being delivered to GAC for inclusion in its Emkoo SUVs. This system uses a single CV25AQ AI SoC and integrates one two-megapixel driver monitoring camera and three two-megapixel occupancy monitoring cameras. I'm also pleased to announce that our CV25 automotive AI SoC has been chosen for driver monitoring application at a major Korean automotive OEM, with production expected to begin in 2023.\n\nThe CV25 was chosen for its highly efficient neural network processing combined with very low power consumption. I will now talk about some of our customer developments in the IoT space, starting with the enterprise security camera market. During the quarter, Verkada announced its first multisensor camera, the CH52-E, which uses four Ambarella CV25S AI vision SoCs. The camera includes four independent five-megapixel sensors to offer customers the wide coverage benefits of a fisheye camera, along with the high-resolution, high image clarity of a dome camera.\n\nMotorola Solutions have made a number of acquisitions of video security companies over the last two years, with many using Ambarella SoCs. At the GSX security show in September, Motorola announced its new AVA Flex camera based on Ambarella's CVflow AI SoCs. The AVA Flex includes Wi-Fi connectivity and cloud-based video management for ease of deployment while supporting AI features such as occupant -- occupancy accounting and anomaly detection. Also at the GSX show, Korean security leader Hanwha Techwin introduced multiple cameras based on Ambarella's CV2 AI vision SoCs, including new P series dome cameras with dual six-megapixel imagers and AI features, and the new tier -- and the new T series camera, including vandal proof and the bispectrum AI thermal models.\n\nOther Korean -- Korea-based customers introduced new models during the quarter included IDIS introduced a new camera for license plate recognition based on our CV28 entry-level AI SoC and the Digital Watchdog introducing five-megapixel and 4K dome models based on our CV22 AI SoCs. And in September, Xiaomi introduced -- launched its latest battery-powered smart door lock, featuring 3D structured-light facial recognition. The smart lock unlocks using 3D biometric facial recognition in less than a second with Ambarella's CV28M AI processor performing both the face recognition and the 3D structured-light processing. The facial smart lock is also BCTC certified, which meets all of the security requirements for financial transactions in China.\n\nIn the consumer camera category, Insta360 introduced its X3 360-degree camera based on Ambarella's H22 SoC. The camera includes 5.7K active HDR video, 72-megapixel photos, and AI-based editing. We are also seeing opportunities in next-generation AI-featured videoconferencing applications, both for home and commercial use. In China, H3C introduced its Magic Hub conferencing system that features an 8K camera and 8K larger screen display.\n\nThe camera is based on our CV52 AI SoC and supports ultrawide angle video capture and advanced AI features. In the streaming camera market, Elgato, a unit of Corsair, introduced its Facecam Pro based on our H2 video processor. The Facecam Pro features 4Kp60 video and advanced features such as pan tilt zoom, making it ideal for gaming applications, as well as solo and group videoconferencing. Ambarella is also in the process of strengthening its ecosystem of design and development partners to address new markets and expand our customer base.\n\nIn November, we announced a comprehensive relationship with eInfochips, an Arrow Electronics company, to expand design and development services for the next generation of CVflow-based AI cameras. This leverages eInfochips' extensive engineering expertise and resources to support the rapid growth of AI IoT applications, including those in robotics, access control, videoconferencing, and healthcare market. These representative engagements, a majority of which are based on our higher-value CV SoCs, provide insight into the early and continued success of our strategy. In Q4 alone, we expect to ship close to 2 million units of CV2 family SoCs, and the outlook for the CV2 family remains very positive.\n\nNow, with CV3 and CV5, we are establishing new CV product cycles building upon our proven CV2 family and further extending the functionality and the value, or ASP, we can earn. Continental was early and the first to validate this new CV trend from Ambarella. And in the next several quarters, we anticipate sharing more about our customer progress. CV3 in a single SoC synergistically ties all the functionality Ambarella has established over the years: cameras and radar perception, deep learning AI, and software stack IP.\n\nIt began 18 years ago when we established our camera perception processing reputation, and we are now addressing higher-value edge AI opportunities, serving megatrends such as security, safety, and automation. These machine-sensing opportunities are incremental and much larger than the human-viewing market. So, we see a very favorable secular opportunity in place. We have the right strategy to address it, and we are continuing to demonstrate early signs of success.\n\nWe intend to continue to invest the majority of our R&D to fully realize these market opportunities, leveraging our leadership position in the AI endpoint market. With that, Brian will now provide our prepared financial comments.\n\nBrian White -- Chief Financial Officer\n\nThanks, Fermi. I'll review the financial highlights for our fiscal third quarter and provide a financial outlook for our fourth quarter ending on January 31st, 2023. I'll be discussing non-GAAP results and ask that you refer to today's press release for a detailed reconciliation of GAAP to non-GAAP results. For non-GAAP reporting, we have eliminated stock-based compensation expense and acquisition-related costs adjusted for the impact of taxes.\n\nRevenue for fiscal Q3 was 83.1 million, in line with the midpoint of our prior guidance range, up 3% from the prior quarter and down 10% year over year. Both IoT and auto product revenue increased sequentially. Kitting issue constraints improved. However, customer inventory reduction actions resulted in sub-seasonal revenue results, as we had expected.\n\nNon-GAAP gross margin for fiscal Q3 was 63.5%, in line with our prior guidance range of 63% to 64%. Non-GAAP operating expense for the third quarter was 43.5 million, a decrease of 1% from the prior quarter and below our prior guidance range of 44 million to 46 million. The lower-than-forecasted opex was aided by favorable FX impacts on our foreign spending. Q3 net interest and other income was 1.4 million, comprised of approximately 800,000 of interest income plus 600,000 of other income.\n\nOur non-GAAP tax provision was 1.2 million or 11.4% of pre-tax income. This was higher than our original forecast and typical range, primarily due to taxable FX gains in foreign jurisdictions. We reported non-GAAP net income of 9.5 million or $0.24 per diluted share. Now, I'll turn to our balance sheet and cash flow.\n\nFiscal Q3 cash and marketable securities increased 1 million to 199 million. DSO increased from 43 days to 54 days, driven by the timing of revenue shipments, and days of inventory decreased from 125 days to 124 days. Cash from operations was 6 million and capital expenditures for tangible and intangible assets were 5 million. Free cash flow, defined as cash from operations less capex, was 1 million; and free cash flow on a trailing four-quarter basis was 12.5%.\n\nWe had two logistics and ODM companies represent 10% or more of our revenue in Q3. WT Microelectronics, a fulfillment partner in Taiwan that ships to multiple customers in Asia, came in at 62% of revenue. Chicony, an ODM who manufactures for multiple IoT customers, was 11% of revenue. I'll now discuss the outlook for the fourth quarter of fiscal year 2023.\n\nQ4 is typically seasonally slow, down to a high single digit sequentially. But this year, the alleviation of some supply constraints is releasing pent-up demand, which we expect to enable our revenue to remain approximately flat sequentially in the range of 81 million to 85 million. Looking into next fiscal year, industrywide component availability is anticipated to improve further, and as our lead times to customers continue to contract toward normal levels, we expect customers to continue reducing the amount of inventory they're willing to carry. Macroeconomic concerns are also rising at our customers.\n\nConsidering the cyclical and macro inputs, we anticipate our fiscal 2024 Q1 revenue to be down more than our normal seasonality would suggest. Back to our fiscal Q4 outlook, we expect non-GAAP gross margin to be between 63% and 64%, flat to the prior quarter. We expect non-GAAP opex in the fourth quarter to be in the range of 46 million to 49 million, with the increase compared to Q3, driven by the continued build-out of new advanced CV3 SoCs and CES marketing activities. We estimate net interest and other income to be approximately 700,000.\n\nOur non-GAAP tax rate to be in the range of 5% to 10% and our diluted share count to be approximately 39.5 million shares. Ambarella will be participating in Arete's Future Series Technology Conference on December 5th, Nasdaq's London Investor Conference on December 6th, Imperial Capital's Security Investor Conference on December 15th, and Needham's Growth Conference on January 10th. Sell-side analysts are also offering small group tours of our CES demos between January 4th and January 7th in Las Vegas. Please contact us for more details.\n\nThank you for joining our call today. And with that, I'll turn the call over to the operator for Q&A.\n\nOperator\n\nThank you. [Operator instructions] The first question that we have today is from Matt Ramsay of Cowen. Please go ahead. Your line is open.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nYes, good afternoon. Thank you guys very much for taking my questions. First of all, Fermi, so yourself and the whole team, congratulations on the Continental deal. I wanted to ask a few details about how that came together.\n\nIt seems like even in your pre-silicon simulation results and all of those things that they had been evaluating the CV3 platform for a while, and no doubt that they were one of the early sampled customers of CV3. So, just maybe you can walk us through how you went from simulated performance and power and capability metrics for CV3 onto sampled product onto the press release that they had and sort of the scope of the wins that you might have with Continental. And then I guess on the detail side, you updated your automotive funnel up 28%, then from 600 million to 800 million on one business. Is the -- how is the Continental deal and potential customer wins from that relationship contemplated in the changes to your automotive funnel? Thanks.\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. Well, first of all, thank you. I think that's definitely helpful. I think the Conti -- we have been working with Conti for a long time, even before when we have tapeout and also produce our first generation CV2 resulting to Conti.\n\nAs you can see, this is a long process because, really, our claim of the -- our CV2 performance and the power efficiency, it's hard to digest if you don't see a real silicon. And with CV2, we proved to them the efficiency of architecture, and we can deliver what we promised. And -- but, as you know, CV2 is good for ADAS for the Level 2 car. But for the Level 2-plus and Level 3, obviously, they need a more powerful chip like CV3.\n\nAnd we start talking to them about CV3. I would say, two years ago, we start with a PowerPoint and our simulation. And of course, because with CV2 silicon, we can really justify the -- how we achieve the performance and power efficiency with our CV3 so they can enterprise our simulation. But the deal is really closed when we sampled our CV3 chip and the development platform to them and they verified our claims on the performance and power efficiency.\n\nAnd I think that's the time that we really have a major breakthrough with Conti, and they're totally convinced of our claim, and they decided to move forward with this relationship. And I think that's one reason. The other reason is that I think we are -- well, very few companies showing off from the -- we have a solution from the very low end like, you know, the driver monitoring assistant to the e-mirrors to a Level 2 front cameras to Level 2-plus and Level 3. We have a silicon road map to cover the whole space that our customer wants with a single software base.\n\nI think that's another reason that, really, I think our customer like come to appreciate and that helped us to secure this deal. And also like we said, you know, we are expecting to continue to do more of this development and we hope we can continue to give you updates in the next quarter in terms of our CV3 business development. In terms of potential design win, I think -- you know, because the Conti press release being talked about, I will leave it to them to answer this question, but I have to believe that with -- because Conti is such a reputable and large customer and they have credibility from the OEM customer, that will definitely -- between Conti and us, we should be able to get design win from OEMs and will gradually show up in our sales funnel in near future.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nAnd thank you for all the detail, Fermi. I really appreciate it. Just, I guess, a final clarification on my first question and sort of a follow-up for Brian. So, to clarify, you guys raised the automotive revenue six-year funnel from 1.8 to 2.3 and the one business from 600 million to 800 million.\n\nIt is -- is the Conti relationship contemplated in both of those numbers, one of those numbers? I'm just trying to -- if you could be a bit precise on what you guys are assuming in the funnel from that relationship and did it materially change when the deal was announced? And I guess my follow-up for Brian, you talked about maybe underperforming normal seasonality as you go into fiscal Q1. Do you -- maybe the last couple of years have been very strange seasonally for the whole semiconductor space given shortages and all kinds of other things going on. If you could maybe give us a little bit of clarity about what you're assuming normal seasonality is for fiscal Q1? Thanks, guys.\n\nFermi Wang -- President and Chief Executive Officer\n\nYou know, I will take on the first question. I will ask Brian to take on the second question. The first question is about the -- our -- how Conti played into that two numbers? I think, you know, Conti's contribution with the current funnel is little and there are some of them. But -- however, I think that we expect that this number of Conti's impact to our funnel will start showing up in next funnel next year.\n\nAnd also, we expect that we don't have any Conti contribution in the one business yet.\n\nBrian White -- Chief Financial Officer\n\nAnd related to your question on normal seasonality in Q1, of course, normal is difficult to define, but the way we looked at it is taking a five-year average. And in that case, the five-year average for Q1 would be a sequential decrease of 4%. And so, as we sit here today, we think that the decrease going into Q1 will be greater than that number. We don't have perfect visibility at this point to what it will be, but we want to provide as much outlook as we can at this time.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nGot it. Thanks, guys. Really appreciate it.\n\nOperator\n\nThank you for your question. The next question will be coming up shortly. One moment, please. And that question will be coming from David Kelley of Jefferies.\n\nYour line is open.\n\nDavid Kelley -- Jefferies -- Analyst\n\nGood afternoon, guys, and thanks for taking my questions. Maybe to follow up on the funnel discussion. You announced a couple of pretty meaningful driver monitoring wins, an e-mirror win as well. So, how should we think about, you know, maybe framing it as the interior contribution to the auto funnel versus, say, the ADAS and autonomous contribution to that funnel growth?\n\nFermi Wang -- President and Chief Executive Officer\n\nSo, first of all, as you can see, for those kinds of design wins, the design cycle is much shorter than ADAS because they are not really safety sensitive so that for ADAS projects, we usually look at, you know, in China more than two years development, outside China has the full year development. For this kind of internal designs, usually, you can think about 12 to 18 months cycle that you can get into production. So, that's why you start seeing more of those design wins. And that's definitely an area that we want to be really having a high market share, and that's what we are doing.\n\nBut that doesn't mean we don't focus on ADAS. In fact, on the contrary, I believe that we are doing well with ADAS, as well as the Level 2-plus. And hopefully, we can give you more design win activity in the future.\n\nDavid Kelley -- Jefferies -- Analyst\n\nOK. Got it. Thank you. And maybe a quick follow-up to your point on kind of the timeline of adoption and specific to Conti, you know, very early days as you demonstrate with them, the customers.\n\nBut any early thoughts on timeline to eventual revenue contribution with this partnership? Are you seeing OEMs push to accelerate development to integration into production timeline faster in ADAS and autonomous as well?\n\nFermi Wang -- President and Chief Executive Officer\n\nWell, first of all, I will leave Conti to answer the potential revenue that they can generate with this relationship. But like we said before, any CV3 design win will take three or four years to get to revenue. And I don't think that timeline has changed.\n\nDavid Kelley -- Jefferies -- Analyst\n\nOK. Got it. Thank you. I appreciate you taking my questions.\n\nOperator\n\nThank you for your question. And one moment while we prepare for the next question. The next question that we have will be coming from Joe Moore of Morgan Stanley. Your line is open.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. I wonder if you could talk to, you know, the pace at which that funnel can start to turn to revenue. You know, I think it's a six-year kind of timeline that you've talked about.\n\nYou know, I assume that's pretty backend loaded given that your numbers are so much bigger than what you're shipping now. But can you give us a sense for how quickly that revenue can roll in and then, you know, how much of that is still -- I don't want to be too precise, but I know there's a probability weighting on some of it. Can you talk to, you know, how much of that we should think of as being a probability-weighted event?\n\nLouis Gerhardy -- Corporate Development and Investor Relations\n\nHey, Joe. Yeah. So, the methodology behind the funnel and how we discount both one and -- you know, pipeline didn't change from our prior practice. And with regards to the distribution of the revenue through the six years of the funnel, it's not linear.\n\nAs you can imagine, it's, you know, exponential in shape where the sixth year is, you know, much higher than the first year. And the reason for that would be, you know, the timing of the revenue that Fermi was just describing on a prior question. But it's also very significantly driven by increased penetration rates of these new technologies. And then most importantly, it's actually the higher ASP of the products that we'll be selling in each of these six years.\n\nFor example, CV3 contributes revenue in years five and six, like we expect, the ASP per chip is much higher than it would be for, say, a DMS, CMS win for the CV25 product. So, those are the factors that cause it to be exponential in shape, not linear.\n\nDavid Kelley -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you for your question. And one moment while we prepare for the next question. The next question that we have is coming from Kevin Wang of Stifel. Please go ahead.\n\nHello? Your line is open.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nHi. Can you hear me?\n\nFermi Wang -- President and Chief Executive Officer\n\nYup.\n\nOperator\n\nYes, we can.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nHi. Sorry. This is Jeremy Kwan, calling on behalf of Tore of Stifel. I guess maybe a question first on the ASPs.\n\nCan you give us any more color in terms of where they stand today? And I understand, you know, once CV3 starts contributing, it's going to go up even more significantly. But can you help us -- just give us more details on where they are today and where you see that? And when you said it's going to grow 20% this year, is that for this fiscal year or up? Thanks.\n\nFermi Wang -- President and Chief Executive Officer\n\nYes, I think the comment is for this fiscal year, it was at the high single digit. And now, I think it would be about $10 ASP right now. And the major contribution come from, you know, the increase of sales all come through the vision chip. And in fact, that's probably the biggest item which could help us to continue to get higher ASP.\n\nNow, with the CV5 really getting into a ramp-up in production and we start assembling CV3, I also expect that our ASP will continue to this uptrend.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you. And I guess a quick question on the opex. You know, I understand some of that is CES for next year or next -- or in January.\n\nI guess, excluding CES, what kind of run rate should we think about as we look to fiscal '24? Thank you.\n\nBrian White -- Chief Financial Officer\n\nSure. We're still bottoming out on our opex budget for next fiscal year. But I guess the way I would think about it at this point is consider the exit velocity of our guidance for fiscal Q4, which, at the midpoint, was about 47.5 million. Going into next fiscal year, we're going to have additional chips in development that would cause that number to increase.\n\nSo, you've got two things to consider. Number one, opex has been increasing throughout fiscal '23. And so, even if opex remained flat at the Q4 forecast level, it would be up on a year-over-year basis. And then, in addition to that, we'll have some additional spending requirements.\n\nThat's about what I can give you at this point. In next quarter's call, I think we can provide some more insight.\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nGreat. That's very helpful. Thank you.\n\nOperator\n\nThank you for your question. One moment while we prepare for the next question. The next question I have is coming from Kevin Cassidy of Rosenblatt. Go ahead, please.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nYeah, thanks for taking my question, and congratulations on the Continental win. And, you know, on the Continental win, are there expectations for them to use the scalability of CV3? You know, will they have a low-end solution and a high-end or maybe three different solutions?\n\nFermi Wang -- President and Chief Executive Officer\n\nYes. First of all, thank you. And also, I believe that your read is right. In fact, in their press release, they do talk about one of the reason they choose CV3 family is because they can use our sensor for structure to apply from low-end to high-end product line.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nI see. And is the Oculii -- or no, Ambarella radar solution included in the overall design, or is it still to be determined?\n\nFermi Wang -- President and Chief Executive Officer\n\nIn a press release, we didn't talk about radar, so I'll keep that. You know, we'll give you more update when we have the right to talk about the potential radar collaborations.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nOK, great. Well, congratulations again.\n\nFermi Wang -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you for your question. One moment while we prepare for the next question. The next question that I have is coming from Tore Svanberg of Stifel. Your line is open.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nYes. Thank you. I had a follow-up question on the Continental win. And I mean, again, congratulations on that.\n\nIf you could just expand a little bit on sort of the -- how the sales strategy works there, because obviously, you're providing some functionalities, but obviously, you know, maybe some other companies will provide others. So, if there's like a full reference platform that Continental is offering, if you could just, you know, add a little bit of context on how you go to market specifically with all the parts that are part of that particular solution.\n\nFermi Wang -- President and Chief Executive Officer\n\nYes. First of all, CV3 will be the domain controller for the system that we are talking to Conti about. And the goal is that there is no other major processing chips on that system. And -- but the CV3 will take in multiple different sensor modality and it will perform not only just the perception but also all the higher-level software functions that the software is provided by Conti.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you. And a follow-up question on CV3, it sounds like you're starting to at least thinking about, you know, leveraging that platform into nonauto applications. I was just wondering both from a sort of capacity and also from a timing perspective, you know, when CV3 could start to venture into other nonauto applications.\n\nAnd I guess the reason why I ask the question is because, you know, you obviously have a lot going on here in the auto space. So, I'm just wondering if you have enough resources to go after, you know, nonauto applications for CV3.\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. So, first of all, using CV3 in a robotic application is definitely a strategy that Ambarella is implementing. And like you said, we are a small company, and we have limited resource. Therefore, we need to target and be focusing on strategy accounts.\n\nIn auto, we have had a few, of obviously, Conti is the first one. There are a few more. But in the robotics space, definitely, our strategy is to have a target customer who has already some products in the market, and as well as they really need performers like CV3 family chips. It doesn't matter who is high and low end because if you look at other robots out there, they have multiple processing silicon in that robot today.\n\nAnd definitely, they can use some kind of domain controller like a CV3 to integrate those functions together and provide not only the better cost but also better system design, as well as power efficiency. So, I think that's definitely a market we will continue to work on.\n\nLouis Gerhardy -- Corporate Development and Investor Relations\n\nYeah, Tore, it's Louis. I'll just add, it's a good question because, you know, global robotics applications are not part of our automotive funnel. So, that is something that's separate and not reflected in the funnel we communicated.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you for all the information. Appreciate it.\n\nOperator\n\nThank you for your question. One moment while we prepare for the next question. The next question I have here is coming from Suji DeSilva of ROTH. Please go ahead.\n\nSuji DeSilva -- ROTH Capital Partners -- Analyst\n\nHi. Fermi, Brian, Louis. I'll add my congratulations on the Continental win. Quick question perhaps for Fermi.\n\nI think you hinted at this in the last -- in Tore's question there, but the software development that's involved to get CV3 into production, how much of that is the Continental and its customers versus Ambarella? I think it's almost -- maybe almost all Continental. And if so, is there an incremental effort that needs to be happening for every customer that adopts CV3 thereafter or is there any leverage from the first one?\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. So, first of all, I think, you know, our role in this relationship is we are strategic Tier 2 to Conti, and we are providing support to them to -- one, the support we need to provide is porting their software onto our CV3, which, you know, we have been talking about this strategy for many years, and we believe we are the one and really focus on this business model versus our competitors. And I think this is really about setting up a group of people helping our customer porting software, and that is -- has probably -- we have factored that into our tapeout planning, as well as our engineering development. So, I think that's not a concern for us.\n\nAnd in fact, we expect that we need to continue to do this kind of service for all of the potential customers.\n\nSuji DeSilva -- ROTH Capital Partners -- Analyst\n\nOK, that helps, Fermi. And then question for Brian perhaps. Brian, you guided the first quarter next year, as well as this year. Are there lingering supply chain post-kitting constraint issues factored into your below seasonal guidance for 1Q or those kind of behind us at that point? Is that purely a statement about softening demand?\n\nBrian White -- Chief Financial Officer\n\nSo, we think that the supply chain issues are, for the most, part behind us and that's something that we don't anticipate to impact our Q1 revenue significantly. What we do see is continued shortening lead times and desire on the part of customers to reduce inventory levels. So, that's really the impact that we're contemplating as we think about Q1 at this point.\n\nSuji DeSilva -- ROTH Capital Partners -- Analyst\n\nOK. Thanks, Brian. Thanks, guys.\n\nOperator\n\nThank you for your question. One moment while we prepare for the next question. And the next question that I have for you is coming from David O'Connor of BNP. Your line is open.\n\nDavid O'Connor -- Exane BNP Paribas -- Analyst\n\nGreat. Thanks for taking my question. One from my side on the CV penetration. Fermi, you mentioned that -- or reiterated 45% for this year.\n\nJust wondering, can you give us any update on what the exit run rates of this year would be so as to kind of baseline those for next year? Then I have a follow-up.\n\nFermi Wang -- President and Chief Executive Officer\n\nYeah, David. We haven't disclosed the run rate, as well as the next year forcast. But I can say that, you know, we expect the CV continue to become a bigger portion of our total revenue for many reasons. One is that they're enabling new markets.\n\nThe other one is the new ASPs. Of course, that -- you know, portion of our CV growth come from, you know, replacing our existing video processing business. But I think that the -- I'm very excited about the new application that we talk about our previous video processing chip can now address. And particularly, CV3 and CV5 opportunity we're talking about today is really a new opportunity we can address.\n\nDavid O'Connor -- Exane BNP Paribas -- Analyst\n\nOK, got it. Thanks for that. And maybe as a follow-up, one for Brian on the sub-seasonal Q1. Brian, you talked about inventory being reduced to customers.\n\nCan we expect by -- or do you expect in exiting Q1 that that inventory that you're seeing there, customers should be cleared? Thank you.\n\nBrian White -- Chief Financial Officer\n\nHey, that's a great question. I think it's one that we don't have great visibility to, so I'm not going to speculate on that. We certainly, in the near term, anticipate that there will be impacts within that time period, and that's why we wanted to provide some visibility. But in terms of when things bottom and so on and when those issues go away, I don't think we have a good feel for that at this point.\n\nDavid O'Connor -- Exane BNP Paribas -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nThank you for your question. One moment while we prepare for the next question. And the next question I have here is coming from Richard Shannon of Craig-Hallum. Your line is open.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nWell, hi, guys. Thanks for taking my questions as well. Maybe I'll ask a question on the IoT side of the business here. Maybe, Fermi, if you can talk bigger picture here over the last year, how the penetration of CV has gone into maybe both sides of the security business and where do you think that will go over the next year or two that'd be great perspective over that time.\n\nThanks.\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. So, I think that's a great question. We continue to see strong IoT design wins in all of the market we're talking about: professional security and the consumer security and also others. The -- I think it's -- like I said before, it's driven -- some of that driven by new applications that we talked about today.\n\nExamples of this, face -- the -- Xiaomi introduce a new lock which is using 3D matrix to identify face. And also, we're talking about other applications like videoconferencing, which is really new market enabled by our CV product line. So, I think from IoT space, outside of China, we are doing quite well. But at the same time, I want to highlight again that with the new U.S.\n\nregulations, we have basically zero play in China in the IoT -- particularly security AI space. I think that's something I want to highlight on. And we talked about [Inaudible] will be zero revenue for us next year.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK, perfect. Thanks for that update. My second question is on Continental here. Looking at from one angle and you've mentioned both today and in past calls regarding having a solution that really addresses all vision-related opportunities, both within and without the car here.\n\nAs I look through the Continental press release from, what, a week or two ago, I didn't see any mention of kind of indoor use cases there. And maybe I've scanned too quickly, but is that being contemplated here, or is that something you can discuss, and/or do you see other OEMs coming through the funnel here that you will have both interior and external use cases because you have that full offering that others don't?\n\nFermi Wang -- President and Chief Executive Officer\n\nRight. So, for the Conti press release, they basically focused on only one application, which is ADAS. And ADAS mainly is for external use. However, I do believe that they appreciate that we offer a complete road map that goes from external to internal.\n\nAnd we'll just say -- I will just say that the press release is targeted only for one application, one possible opportunity between Conti and us.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK, fair enough for that update. That's all for me, guys. Thank you.\n\nFermi Wang -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you for your question. One moment while we prepare for the next question. The next question I have is coming from Ross Seymore of Deutsche Bank. Your line is open.\n\nUnknown speaker -- Deutsche Bank -- Analyst\n\nHi, guys. This is DJ Sebastian on behalf of Ross Seymore. First off, thanks for letting me ask a question here, but I was just hoping to get some color on sort of the revenue split between your IoT and auto segments, both for the reported quarter and the implied guide. Thanks.\n\nBrian White -- Chief Financial Officer\n\nThe approximate split would be about 75-25 IoT versus automotive.\n\nUnknown speaker -- Deutsche Bank -- Analyst\n\nCool. And just a quick follow-up. How should we sort of think about that going into next year? I mean, do you guys see that dynamic changing significantly or are we still going to write sort of the same split for the foreseeable future?\n\nFermi Wang -- President and Chief Executive Officer\n\nWell, like I said, you know, we haven't given any guidance for next year, but like I said, we expect auto percentage will continue to increase because of the funnel that we're building and that should be the trend of where we should -- we are expecting.\n\nUnknown speaker -- Deutsche Bank -- Analyst\n\nAwesome. Thank you so much and congrats.\n\nOperator\n\nThank you for your question. And that concludes today's Q&A session. I would like to turn the call over to Dr. Fermi Wang for closing remarks.\n\nGo ahead, sir.\n\nFermi Wang -- President and Chief Executive Officer\n\nThank you. And thank you all for your time and consideration. We hope to see you at CES or one of the other coming events. Thank you and goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLouis Gerhardy -- Corporate Development and Investor Relations\n\nFermi Wang -- President and Chief Executive Officer\n\nBrian White -- Chief Financial Officer\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nDavid Kelley -- Jefferies -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nJeremy Kwan -- Stifel Financial Corp. -- Analyst\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nSuji DeSilva -- ROTH Capital Partners -- Analyst\n\nDavid O'Connor -- Exane BNP Paribas -- Analyst\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nUnknown speaker -- Deutsche Bank -- Analyst\n\nMore AMBA analysis\n\nAll earnings call transcripts"
}