{
  "companyName": "Mastercard",
  "companyTicker": "MA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/mastercard-ma-q3-2022-earnings-call-transcript/",
  "content": "Mastercard (MA -0.14%)\nQ3 2022 Earnings Call\nOct 27, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning. My name is Audra, and I will be your conference operator today. At this time, I'd like to welcome everyone to the Mastercard Inc. Q3 2022 earnings conference call.\n\nToday's conference is being recorded. [Operator instructions] At this time, I'd like to turn the conference over to Warren Kneeshaw, head of investor relations. Please go ahead.\n\nWarren Kneeshaw -- Head of Investor Relations\n\nThank you, Audra. Good morning, everyone, and thank you for joining us for our third quarter 2022 earnings call. With me today are Michael Miebach, our chief executive officer; and Sachin Mehra, our chief financial officer. Following comments from Michael and Sachin, the operator will announce your opportunity to get into the queue for the Q&A session.\n\nIt is only then that the queue will open for questions. You can access our earnings release, supplemental performance data, and the slide deck that accompany this call in the Investor Relations section of our website, mastercard.com. Additionally, the release was furnished with the SEC earlier this morning. Our comments today regarding our financial results will be on a non-GAAP currency-neutral basis, unless otherwise noted.\n\nBoth the release and the slide deck include reconciliations of non-GAAP measures to GAAP reported amounts. Finally, as set forth in more detail in our earnings release, I would like to remind everyone that today's call will include forward-looking statements regarding Mastercard's future performance. Actual performance could differ materially from these forward-looking statements. Information about the factors that could affect future performance are summarized at the end of our earnings release and in our recent SEC filings.\n\nA replay of this call will be posted on our website for 30 days. With that, I'll now turn the call over to Michael.\n\nMichael Miebach -- Chief Executive Officer\n\nThank you, Warren. Good morning, everyone. Let's get right into it. So the headline is that consumer spending remained resilient, and cross-border travel continues to recover.\n\nWith this backdrop, we delivered strong revenue and earnings growth through the focused execution of our strategy. Third quarter net revenues were up 23% and adjusted operating income up 27%, both versus a year ago on a non-GAAP currency-neutral basis, excluding special items. Now the macroeconomic and geopolitical environment remains uncertain. Inflationary pressures have remained elevated and central banks are continuing to take aggressive steps to bring inflation in line.\n\nTensions remain high with the war in Ukraine and the supply of natural gas to Europe is a concern. Despite all of this, unemployment rates remain low, wages are rising, consumer savings levels remain elevated and credit is readily accessible. In this setting, overall consumer spending has remained resilient, although we are seeing some shifts in what consumers are buying. Looking at our switched volume trends.\n\nDomestic volumes remained steady, showing growth relative to 2019 levels relatively consistent to the second quarter 2022. The trend toward spending on experiences continues. We saw notable strength in airline, lodging, and restaurant spend with a shift away from categories like home furnishings and appliances. The current mix between retail, T&E, and other categories of spend is now broadly similar to pre-pandemic levels.\n\nCross-border. Cross-border continues to recover as border restrictions are progressively relaxed. Cross-border travel in the third quarter has reached 124% of 2019 levels. Relative to 2019 levels, most regions are up sequentially, including a notable improvement in Asia.\n\nCross-border card-not-present ex travel continued to hold up well. Notwithstanding the continued strength in consumer spending, we will continue to watch the environment closely, including fiscal monitoring and other policy actions taken in response to events. This will inform our actions as it always has. Should the market outlook weaken, we are prepared to act quickly to modulate our expenses.\n\nAs we demonstrated during the pandemic, we have the flexibility to respond quickly across a number of levers and will do so while maintaining focus on our three key strategic priorities. The focus on these areas will create new opportunities for growth that starts by solidifying our positions and payments, complemented by our differentiated services lines and our expansion into adjacent activities like open banking and digital identity. Moving on to some examples of how we are progressing against each of these. First, we are expanding in payments by enabling digital transformation with our customers, putting volume growth, expanding acceptance, and capturing new payment flows.\n\nThere are now over 3 billion Mastercards in circulation supported, in part, by programs, such as our digital-first initiative. A digital-first solution starts with the ability for a consumer to acquire and then use a new card digitally in near real time. It's helping customers create a best-in-class digital experience, leading to increased approval rates on average by 2 percentage points; reduce fraud, on average, by 4 basis points; and increase spend per active account, on average, by 10%. To date, we have launched over 200 digital-first customers around the globe.\n\nSantander in Mexico, Chase in the U.K., Citibanamex, Hague in Spain, and Nubank in Brazil are among the latest customers to partner with Mastercard to deliver an end-to-end digital-first customer journey. Also, we're driving growth in volume with new and renewed wins across a broad set of partners. In the U.S., we recently extended our exclusive deal with KeyBank's debit, credit, commercial and small business, as well as deepened our relationship on services. This quarter, in partnership with Chase, we will launch a new co-brand program with DoorDash.\n\nThis deal further expands our presence in the digital food delivery space. We also went live with the Uber Pro Card and enhanced loyalty and payments experience that will help drivers in Korea save on gas, fees, and other expenses. In Europe, we have seen momentum in Italy with IGT securing an expanded deal that includes a credit and prepaid flip, as well as securing the current Mastercard portfolio. And in Latin America, we have renewed our exclusivity agreement with Mercado Libre and secured incremental credit share with Banco Scotiabank Colpatria.\n\nOverall, another great quarter with notable wins. That shift to one area that is sometimes underappreciated, that is how we are enabling growth in payments by giving people and businesses more places to use the MasterCard. We have added more acceptance locations in the last five years than the previous 50, and we have now accepted at more than 90 million merchant locations. The preferential contactless payments that grew over the last two years continues.\n\nMore than half of the in-person switch purchase transactions are now tapped up from approximately one-third pre-pandemic. And this trend will be bolstered by the adoption of new technologies, such as Tap on Phone. Further, our technology and global reach enable growth and acceptance while helping our partners drive their digital strategy. For example, we have signed with McDonald's to use our gateway capabilities, enabling them to easily offer more solutions to new markets beginning in Middle East and Africa.\n\nFinally, we're driving growth in payments while leaning into innovation to capture a prioritized set of new payment flows. We continue to make progress in going after flows in the disbursements and remittances space by expanding into new use cases and geographies. For example, in the U.S. gig economy, we signed a new global agreement with Airbnb to facilitate host payouts using Mastercard Send in select markets.\n\nWe've also expanded with gaming payouts, launching our Gaming Fast payout program. To address account-to-account, cross-border, and domestic payments, we have signed a deal with Pagero, a leading global B2B network and solutions provider that provides accounts payable automation to some of the world's largest corporate brands. We're also growing commercial point-of-sale transactions by targeting small business, corporate T&E, purchasing, and fleet flows. In the U.S., we announced our exclusive co-brand partnership with First National Bank of Omaha to issue the Hello Allice small business card.\n\nThis product offers small business owners industry-leading access to tools, benefits, and services with a focus on equitable access to credit, very important. We also continue to target B2B accounts payable flows by expanding access and reach, leveraging our virtual card capabilities. We signed a deal with Marqeta to enable our next-generation virtual card solution, Instant Pay. This solution intelligently and automatically sends instant payments to suppliers.\n\nWe have also signed an agreement with SAP Taulia to integrate our virtual card solutions into Taulia and SAP solutions, enabling their customers to facilitate virtual cost payments. We're also well-positioned to capitalize on the return of travel with our Mastercard wholesale travel program. In Bahrain, we signed a deal with Infineon for their online travel agency and travel management company, Volumes. And in Europe, we signed a deal with the fintech Swile while going after B2B travel flows in Europe and Latin America.\n\nAs you can see, we continue to make steady progress in addressing our prioritized set of new payment flows. Now turning to services, where we delivered another quarter of strong revenue growth. Our services deliver a diversified revenue stream for Mastercard beyond payments. We accomplished this by adding new service capabilities, as well as extending existing service offerings into new and existing customers.\n\nThere continues to be a tremendous growth opportunity in this space. First off, we're excited about Dynamic Yield's unique personalization platform, which offers a great example of how we're adding new service capabilities. Since complementing the acquisition earlier this year, we have added dozens of new retail and commerce customers. A great example is [inaudible], a German fashion store.\n\nI always share German examples, if I can. They have more than 1,400 stores in Europe. We have deployed our content personalization capabilities to additional markets. In addition, we are expanding our capabilities to financial institutions.\n\nNow beyond adding new services, there's an opportunity to grow by extending existing offerings into new and existing customers. In the third quarter, we signed an agreement with Sky Italia, part of Sky Group, one of Europe's leading media and entertainment companies, to enrich and commercialize a new service to support small businesses. Imburse, a technology provider to insurance companies, is implementing our card-linked services for their micro savings programs with Generali Insurance in Switzerland. And in Spain, we have grown our relationship with CaixaBank with one of our largest European Africa deals.\n\nThe deal enables them to provide a more efficient charge backflow for all the card portfolios. Beyond expanding in payments and extending in services, our third key priority area is embracing new networks. As a reminder, our current focus is on two areas: open banking and digital identity. This quarter, I'll touch on open banking.\n\nWhile open banking is early in the game, it is a tremendous opportunity. We are engaged with a broad set of financial institutions and fintechs who are increasingly interested in a wide range of use cases. And what's unique and interesting here is that we are the partner that brings what is needed to scale and it's still confidence in this space, things like responsible data practices, consumer protections, and deep compliance, all on top of our robust technical capabilities, broad connectivity, and extensive applications. So just to give you a flavor in the U.S., Quicken, a leading provider of financial management solutions, has selected Mastercard as a provider of consumer permission data for its popular simplified budgeting platform.\n\nWe're also working with Fidelity with their innovation in student loan repayment for organizations that want to help their employees improve their financial wellness. And then there's Jack Henry, which will enable community and regional financial institutions to be at the center of their account holders' financial lines. They will do this providing the ability to securely see all of their financial accounts within and outside the primary financial institution in a single view. This will help enable consumers and businesses to make more informed financial decisions.\n\nThis is just the beginning much more to come in open banking. Before wrapping up, I'd like to share an example of how we are incorporating our capabilities across all three strategic pillars. Our strategy to engage in the crypto economy leverages assets across payments, services, and new networks, a combination that yields a truly differentiated value proposition. Here, we're deploying our payment capabilities to enable consumers to spend their crypto holdings on card and cash out their crypto wallets via Mastercard Send.\n\nThis quarter, we partnered with Ebonex who will become our first partner in Australia to issue crypto-funded cards. We're enabling off-ramp solutions with Mastercard Send and recently added five new players in North America and Europe, including Binance supported by Checkout.com and Uber. In all instances, we do not handle crypto but rather take delivery of fiat currency. Our services and new networks capabilities are providing identity, cyber, and consulting services for market participants.\n\nCrypto Secure is an innovative solution designed to bring additional security and trust to this digital ecosystem by helping card issuers address regulatory risks. We also recognize the interest people continue to have buying and holding crypto through trusted businesses like their banks. So last week, we announced Crypto Source, which is designed to give our financial institution partners access to a comprehensive suite of buy, hold, and sell services for select crypto assets. This will be augmented with our proven identity, cyber security, and advisory services.\n\nTo support these upcoming pilot programs, Mastercard is expanding its partnership with Paxos Trust Company to leverage their crypto asset trading and custody services. As you can see, our crypto strategy is bringing together best-in-class capabilities at scale, all built on our core principles of providing strong consumer protections, safety, and security. In summary, we delivered another strong quarter of revenue and earnings growth, aided by a resilient consumer and a continued recovery in cross-border travel. We continue executing against our three strategic priorities.\n\nWe have strong momentum with our customers, offering a diverse set of innovative solutions. We will continue to manage our expenses carefully within this macroeconomic environment, and our well-diversified and flexible business model positions us well for the future. Sachin, over to you.\n\nSachin Mehra -- Chief Financial Officer\n\nThanks, Michael. Turning to Page 3, which shows our financial performance for the quarter on a currency-neutral basis, excluding special items and the impact of gains and losses on our equity investments. Net revenue was up 23%, supported by resilient consumer spending and the continued recovery of cross-border travel relative to 2019 levels. Acquisitions contributed 1 ppt to this growth.\n\nOperating expenses increased 17%, including a 3-ppt increase from acquisitions. Operating income was up 27%, which includes 1-ppt decrease related to acquisitions. EPS was up 22% year over year to $2.68, which includes a $0.06 contribution from share repurchases. During the quarter, we repurchased $1.6 billion worth of stock and an additional $505 million through October 24, 2022.\n\nSo let's turn to Page 4, where you can see the operational metrics for the third quarter. Worldwide gross dollar volume or GDV increased by 11% year over year on a local currency basis. On the same basis, if you exclude Russia from the prior period, GDV increased by 18%. In the U.S., GDV increased by 10% with credit growth of 20%, reflecting, in part, the recovery of spending on travel.\n\nDebit increased 2%. Excluding the impact of the roll-off of a previously discussed customer agreement, debit increased approximately 5%. Outside of the U.S., volume increased 12% with credit growth of 15% and debit growth of 9%. Cross-border volume was up 44% globally for the quarter, reflecting continued improvement in travel-related cross-border spending.\n\nTurning to Page 5. Switched transactions grew 9% year over year in Q3. Excluding Russia from the prior year, switched transactions grew 19% year over year in Q3. Card present and card not present growth rates remained strong.\n\nCard present growth was aided, in part, by increases in contactless penetration in all regions when excluding Russia. Contactless now represents 54% of all in-person switch purchase transactions. In addition, card growth was 5% or 10% if we exclude cards issued by Russian banks from the prior-year card count. Globally, there are 3 billion Mastercard and Maestro-branded cards issued.\n\nNow let's turn to Page 6 for highlights of the revenue line items, again, described on a currency-neutral basis, unless otherwise noted. The increase in net revenue of 23% was primarily driven by domestic and cross-border transaction and volume growth, as well as growth in services, partially offset by growth in rebates and incentives. Acquisitions contributed 1 ppt to this growth. Looking quickly at the individual revenue line items.\n\nDomestic assessments were up 9%, while worldwide GDV grew 11%. The difference is primarily driven by mix. Cross-border volume fees increased 57%, while cross-border volumes increased 44%. The 13-ppt difference is primarily due to favorable mix as higher-yielding ex intra-Europe cross-border volumes grew faster than intra-Europe cross-border volumes this quarter.\n\nTransaction processing fees were up 22%, while switched transactions grew 9%. The 13-ppt difference is primarily due to favorable mix, FX-related revenues, and pricing. Other revenues were up 22%, including a 2-ppt contribution from acquisitions. The remaining growth was driven primarily by our cyber and intelligence and data and services solutions.\n\nFinally, rebates and incentives were up 26%, reflecting the strong growth in volumes and transactions and new and renewed deal activity. Moving on to Page 7. You can see that on a non-GAAP currency-neutral basis, total adjusted operating expenses increased 17%, including a 3-ppt impact from acquisitions. Excluding acquisitions, the remaining increase was primarily due to higher personnel costs to support the continued execution of our strategic initiatives.\n\nTurning now to Page 8. Let's discuss the operating metrics for the first three weeks of October. For your reference, to help you understand the trends in the business ex Russia where we suspended operations in March 2020, we have included an appendix later in the stack to show all the data points from the schedule if you excluded activity from Russian-issued cards from prior periods. As a general comment, our metrics are holding up well in October.\n\nAs expected, the year-over-year growth metrics faced tougher comps as we began lapping periods in 2021 when COVID-related restrictions eased and spending levels started to rebound. However, it is important to note that all metrics continue to hold up well relative to 2019 levels. Going through the metrics, in turn, starting with switched volumes. For the first three weeks of October, we grew 17% year over year, down 1 ppt versus Q3.\n\nSwitch transactions grew 9% year over year through the first three weeks of October, consistent with Q3. As a reminder, Russia has a relatively low average ticket size which results in a larger relative impact to this metric. Overall, cross-border volumes through the first three weeks of October grew 36% year over year, down 8 ppt versus Q3. Cross-border travel had another quarter of strong growth as water restrictions continued to be lifted.\n\nIn the first three weeks of October, cross-border travel was up 62% year over year, down 11 ppt versus Q3 due to more difficult year-ago comps, as I just noted. Cross-border travel is now at 125% of 2019 levels, up 1 ppt from Q3 levels. Cross-border card not present, excluding travel, was up 12% year over year in October, which includes the impact of significant e-commerce promotional activities, and is down 1 ppt from Q3. This metric continues to hold up well in relation to 2019 levels.\n\nTurning to Page 9. I wanted to share our thoughts on Q4. Let me begin by saying that the execution of our strategic priorities is translating into expanded and deeper customer relationships and the broader adoption of our material solutions and differentiated services. Consumer spending remains resilient in the face of macroeconomic headwinds, and cross-border travel continues to recover as border restrictions ease and consumers shift their spending back toward travel.\n\nJust to update you on some metrics we are tracking. Asia, which represented approximately 14% of cross-border inbound travel pre-pandemic in 2019, is at approximately 76% of 2019 levels in Q3, up from about 60% in Q2. We continue to believe there is more room to grow as several travel corridors, particularly in Asia, still remain restricted, and airline industry capacity continues to build back up. We remain well-positioned to capitalize on this growth with our travel-oriented portfolios and service offerings, including access to an extensive airport lounge network and concierge services and our global Mastercard Travel Rewards program, which allows issuers and merchants to connect -- to provide consumers with unique benefits through a simple digital experience.\n\nAs we have laid out, there are a number of factors that could influence future economic growth. These include elevated inflation and rising interest rates, and geopolitical tensions balanced against low unemployment, rising wages, and high savings levels in particular. We are monitoring each of these. As Michael just said, we are prepared to act quickly to adjust our expenses to reflect any meaningful change to top-line growth.\n\nWith respect to the fourth quarter, we expect year-over-year net revenue to grow at the high end of a mid-teens rate on a currency-neutral basis, excluding acquisitions. This is consistent with prior expectations and sequentially reflects, one, generally resilient consumer spending relative to 2019 levels; two, stable to slightly improved cross-border travel growth relative to 2019 levels with some continued improvement into Asia and some moderation within Europe; three, higher rebates and incentives as a percent of gross revenues due to elevated deal activity consistent with seasonal norms; and finally, the lapping of a strong year-ago quarter as border restrictions were lifted in the U.S., U.K., and Canada during Q4 2021. Acquisitions are forecasted to add about 1 ppt to this growth, while foreign exchange is expected to have headwind of approximately 6 to 7 ppt for the quarter. As a reminder, the euro has depreciated significantly year over year and is the primary driver of this headwind.\n\nFrom a sensitivity standpoint, based on the current mix of the business, the annual impact of net -- to net revenue of a $0.01 change in the value of the euro relative to the U.S. dollar is approximately $55 million. From an operating expense standpoint, we expect Q4 operating expenses to grow at a low double-digit rate versus a year ago on a currency-neutral basis, excluding acquisitions and special items. Acquisitions are forecast to add about 3 ppt to this growth.\n\nForeign exchange is expected to be a tailwind of approximately 4 to 5 ppt for the quarter. Other items to keep in mind, on the other income and expense line, we are at an expense run rate of approximately $100 million per quarter given the prevailing interest rates. This excludes gains and losses on our equity investments, which are excluded from our non-GAAP metrics. And finally, we expect a tax rate of approximately 19% in Q4 based on the current geographic mix of our business.\n\nAnd with that, I'll turn the call back over to Warren.\n\nWarren Kneeshaw -- Head of Investor Relations\n\nThanks, Sachin. Audra, we're now ready for the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] We'll take our first question from Sanjay Sakhrani at KBW.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. Good morning. Sachin, I was just wondering if you could just parse out a little bit at the fourth quarter net revenue expectations. It was a little bit lower than we were thinking.\n\nI'm just curious, is it incentives kind of spiking up in the fourth quarter? Or is it just the gross number? Any color there would be helpful. Thanks.\n\nSachin Mehra -- Chief Financial Officer\n\nSure. First, I'm just going to kick it off by saying the fourth quarter thoughts that I've just shared with you are very consistent with what we have shared in our implied fourth quarter numbers when we gave you our full year guidance at the last earnings call. So very consistent in terms of what we'll be sharing with you in terms of fourth quarter. But just a few things I want to kind of emphasize as to what our key assumptions going into the fourth quarter are: one is we continue to believe that there will be a resilient consumer and spending from the consumer relative to 2019 levels will be generally resilient; number two, we are expecting stable to slightly improve cross-border travel growth relative to 2019 levels.\n\nIn terms of rebates and incentives to your question, as a percentage of gross revenues, we expect them to be higher in the fourth quarter. This is very consistent with our seasonal norms. So nothing unusual as far as I'm concerned there. And then also, again, if you look at it on a sequential basis back to comparing fourth quarter to third quarter, there is the lapping effect which I kind of talked about.\n\nSo really, I mean, the summary of what I guess I'm sharing with you is our fourth quarter thoughts are very consistent to what we had actually shared with you previously.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Thank you.\n\nOperator\n\nWe'll move next to Lisa Ellis at MoffettNathason SVB.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nOh, terrific. Good morning, guys. Thanks for taking my question. I wanted a question about business resilience, I guess, looking forward in the face of a potential economic downturn.\n\nI'm just thinking about the fact that over the last several years, Mastercard increased the diversification of the business significantly with more debit, more fast ACH, more services, etc., more B2B. So how do you think about kind of where you are now in terms of resilience of the business if we do, at some point, see a slowdown in the consumer side of spending? Thank you.\n\nMichael Miebach -- Chief Executive Officer\n\nGood morning, Lisa. Thank you for your question. So let me kick off on that one. You imply the answer in your question actually.\n\nIt is the nature of our continued diversification. I mean, just to remind everybody on why are we diversifying, it is to give us a diversified revenue stream, but it's also to differentiate our payments. And all of that plays hand in hand with better services. We're going to see payment volumes come out with better services, it's easier to get into some of the new payment flows.\n\nFor example, our safety security solutions are well sought-after in the B2B space, whether there is fraud issues all over the place. So all that, I think, is a good starting point for us. If I just look back over the last two years where we certainly had a slowdown on the payment side in the macroeconomic overall and services carried today very significantly for us. So we're just going to continue to push harder there.\n\nAnd then new flows, and I gave you a whole range of examples earlier on how we are building out the new flows. And if you just put some light on to commercial POS. So here is, this is existing tools that we have. We don't need to build a lot for it.\n\nIt's a space that we haven't penetrated significantly in the past, and we're ready and we're going in. This is a $14 trillion opportunity that we're going after, which is payments diversification going on, in addition to our services diversification. And earlier on, with the stats on acceptance, just more places where people can spend. In the end, then people will spend, even in a downturn.\n\nIt doesn't actually matter for us what they spend on, that they spend on a MasterCard, we give them more opportunities to do so. So diversification is the name of the game.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nThank you.\n\nOperator\n\nWe'll move next to Darrin Peller at Wolfe Research.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, guys. Thanks. Your model is clearly still showing benefits of inflation. And if you could just kind of remind us, again, the sensitivity in the areas you see in the basis points driven inflation impact.\n\nBut also whether or not there's any pricing changes you guys are interested in employing on the non-basis-point side, whether it's transactions or services, probably more importantly, just given what we've seen or if you've done so already? And then maybe just on a side note on that, on the other side would be the expense management and the willingness, just how willing you are on, for example, marketing to flex there if necessary? Thanks, guys.\n\nSachin Mehra -- Chief Financial Officer\n\nYeah, Darrin, I'll take that question. I guess to your point around inflation. Look, I mean, persistent in place for long periods of time, which causes for a shift in share of wallet away from carded categories into non-product categories would be the one area I would actually flag as a potential headwind as it relates to our business model. But putting that issue aside, the reality is you're very correct about the fact that we charge our basis points in cents per transaction.\n\nOur basis points are of nominal value of spend and that reflects the impact of inflation in there. So the reality is, as we've said in the past, modest inflation and inflation in carded categories, we're generally -- we kind of -- our business model accounts for that because depending on if it's carded, it doesn't matter, like Michael said, whether it's happening in travel or it's happening in food and building, those are carded categories, and you kind of get the benefit of that come through. Look, I mean, as it relates to your question on expenses, we've always remained disciplined on expenses. The thing which we always keep in mind is a few things.\n\nOne, we want to make sure that we're investing in the long-term growth of our business along the three strategic priorities, which Michael talked about. We will continue to do that. That being said, as we demonstrated during the COVID environment, we do have the opportunity to flex our expenses whether it's around marketing, whether it's around professional fees, whether it's around T&E, it all is a function of making sure we are keeping an eye on the top line, keeping an eye on the bottom line while we're actually delivering what we need to do from an expenses standpoint, and we'll continue to do that going forward. The reality is we keep a close eye on to what are the things which are in demand from our customers, what is it that the consumer wants, and we are bouncing our expenses in that regard.\n\nAn example would be, as you remember in COVID, when travel was out of favor, we started to pull back on A&M-related travel. It just didn't make sense for us to be doing at that point in time. So we'll remain flexible on that. And then there are initiatives which we've got which are longer-term initiatives, which will pay off over many, many years in the future, where we have the opportunity to actually pulse the pace at which we're incurring expenses on those to the event -- in the event we start to see a little bit of a slowdown in terms of top line.\n\nYou asked the question on pricing. Our philosophy around pricing is very consistent as it's always been. We price for the value we deliver. And our assumption from a pricing standpoint, whether it's pricing in basis points or cents per transaction is very tightly correlated to the value we're delivering to our customers and to the end consumers, and to our merchant partners.\n\nSo all of that is very consistent at the end of the day. We assume minimal net pricing, net of rebates from a pricing standpoint.\n\nMichael Miebach -- Chief Executive Officer\n\nYeah. I just want to -- Darrin, just want to add one point here. And that is looking back at the last -- over two-and-a-half years now, back to the second quarter of 2020 when revenue was severely impacted by a truly unprecedented event out there. So to the power of the levers that we have and a range of levers that we have to modulate our expenses, hiring, AMM, professional fees, T&E, and your market appetite and all of that, it just showed that we did not have to make any compromises when it comes to driving our strategic priorities.\n\nWe pulled through it on new flows, we pulled through service expansions, and so forth. The model is wide and flexible. That helps us a lot. And as I look forward, there is optimism in how we're going to navigate that.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nThanks, guys.\n\nOperator\n\nWe'll take our next question from Harshita Rawat at Bernstein.\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nGood morning. Michael, Sachin, can you talk about online debit routing in the U.S. that very recently put out clarification approvals? If I recall correctly, last time you ended up gaining market share, but debit was implemented. So how does it impact Mastercard with online debit routing now? Thank you.\n\nMichael Miebach -- Chief Executive Officer\n\nHey, Harshita. Thanks for the question. There's always something in debit routing going on. So here, we have the clarification of the rule by the Fed.\n\nAnd it takes us all the way back to a decade ago when there was this requirement to have two networks on every debit card. And basically, what the Fed here clarified is that this is applying to whether it's a debit transaction that's made online or in-store. So pretty simple, pretty straightforward implementation by mid of 2023. So we have some time, but we will be ready and we'll be implementing.\n\nI think really what that does is we will just continue to compete with all the assets that we have in debit. I'm not really sure what this will do to the market, but we will certainly be there leveraging our technology to win more debit in the United States.\n\nSachin Mehra -- Chief Financial Officer\n\nHarshita, I'll just add one additional comment to what Michael just said, which is, as you know, we've been investing pretty heavily in our services capabilities some of which relate to cyber intelligence. And in an environment where our partners, whether it's the merchants or the issuers need more of our services to better manage their product capabilities in the online environment, we stand ready to do that as well.\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nThanks very much.\n\nOperator\n\nWe'll take our next question from Tien-Tsin Huang at J.P. Morgan.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nHey, thank you. Good morning. Just you mentioned nothing unusual on rebates and incentives, but I just wanted to ask as I sometimes always do with deal activity versus 90 days ago. Any change there? Is your appetite to drive program growth versus maybe more disciplined growth on their side? Or are there changes in timing of deals and implementation, things of that nature? Thanks.\n\nSachin Mehra -- Chief Financial Officer\n\nSure, Tien-Tsin. I can take that. Tien-Tsin, I think you know that we've been active in the marketplace. We've been winning share globally, and that's just part of the strategy of what we want to do, which is on a disciplined, profitable basis, we want to win share and deliver more in the nature of services on that share to optimize and grow our overall net yield.\n\nI'll start with that as kind of the headline. But on your specific question on Q4, on rebates and incentives, nothing unusual. It's a rich pipeline. We continue to be active in the marketplace.\n\nWe're not seeing any changed kind of behavior as it relates to how our issuing partners are in the marketplace. And we just remain active, and that's really the essence of what we're seeing there.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nThanks for the update.\n\nOperator\n\nNext, we'll move to Ashwin Shirvaikar at Citi.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you. Michael, if I can ask about cross-border now that we've seen some normalization in travel? If you could kind of talk about how much more travel improvement there is yet to come in your view and the mix of cross-border now that some of the normalization has happened as we look to travel versus non-travel?\n\nSachin Mehra -- Chief Financial Officer\n\nSure, Ashwin. I can take that question. So first, I kind of mentioned that -- as we said in the last earnings call, we saw opportunity in terms of further recovery in travel. We saw some of that come through in our Q3 numbers.\n\nWe still believe there's potential from a cross-border travel recovery standpoint, in particular, in Asia Pacific. I shared a metric about how Asia Pacific inbound cross-border travel is approximately 76% in Q3 of 2019 levels. So that just goes to show there's some more room to grow there. I mean, there are several markets in Asia Pacific which still remain to be opened.\n\nAlso, airlines are bringing more capacity back on. And as you know, from our personal experiences, getting seats on planes is hard, and it's expensive. And so the reality is all of that should be helpful in terms of the potential for cross-border travel recovery. The other point, which I think you alluded to, Ashwin, is as it relates to the mix and the mix is also important because the mix of cross-border has not reverted back to historical mixes.\n\nSo said differently, if you remember, as we were going through COVID, we first saw recovery take place in intra-Europe. And you know intra-Europe is generally low in yielding. We've recently been seeing a stronger growth of a pattern in ex intra-Europe cross-border. And so the reality is that makes us go back to the pre-pandemic levels at this point in time.\n\nMichael Miebach -- Chief Executive Officer\n\nAnd just one thing to add, it wasn't exactly your question, but that whole space has been in focus for us, pre-pandemic, during the pandemic, and now. While airlines were struggling with really no flights taking off, we were a strong partner, and it showed in how the engagement with airlines and travel-oriented portfolios work now. So we stand well-positioned to benefit from the trend that Sachin just talked about on the services side, as well as in the payments and the co-brand side, so exciting space. I think our bets are paying off.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nWe'll go next to Rayna Kumar at UBS.\n\nRayna Kumar -- UBS -- Analyst\n\nGood morning. Thanks for taking my question. You continue to see very strong growth in Latin America, 29% GDV growth in the quarter. Can you discuss some of the key drivers of that growth and how sustainable you think it could be going into 4Q and into 2023? Thank you.\n\nMichael Miebach -- Chief Executive Officer\n\nRayna, let me start off on that. Latin America, fascinating region for us, highly diverse from a super well-developed Brazil to markets at the other end of the spectrum, high travel markets with the Caribbean, so Mexico. So you have all of that in the mix. It's really interesting when you peel the onion of it and you look at some of these markets and you compare them, two of the largest markets, for example, Brazil and Mexico.\n\nIf you look at the digital penetration in Mexico compared to Brazil, there is so much more potential to go. So there's upside in digitization. There's other issues that require some of our solutions. The region has experienced some fraud issues generally in payments.\n\nSo our safety and security solutions are in great demand and a great driver for growth for us in the region, while the underlying digitalization continues. So you put those trends together, it's all fairly attractive. And then I talked to you about our engagement in the crypto economy. If there's one place in the world where crypto is really in focus, it's in that part of the world, historic pain through high inflation, and so forth.\n\nPeople were thinking crypto might be an answer. A lot of innovation in the space. So across all payments, services, and new payment flows and innovation, this is a region that has -- is showing full momentum for us.\n\nSachin Mehra -- Chief Financial Officer\n\nYeah. Rayna, I'll just bring to life one of the points which Michael talked about in terms of increased trends toward digitalization. As it relates to our performance in Latin America in Q3 and going forward, the reality is we've been very focused on the conversion of Maestro to debit Mastercard. And this has been part of what we as a company have been doing for a very long time.\n\nYou're seeing the fruits of that come through because as you know, as you go down the path of converting Maestro to debit MasterCard, whether it's a companion digital debit Mastercard or it's an actual conversion of the card, it now becomes enabled for online transactions back to the regional trend, which Michael is talking about. So it's all about us trying to enable those cards and we've been seeing good migrations take place from Maestro to debit Mastercard.\n\nOperator\n\nWe'll go next to Jason Kupferberg at Bank of America.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nThanks, guys. Good morning. I wanted to see if you can unpack a little bit what you're seeing in terms of consumer spending across different parts of Europe. And then, Sachin, I wanted to see if you could make just a quick comment around what you guys are envisioning the potential FX headwind to revenue in 2023 just based on current rates.\n\nThanks.\n\nSachin Mehra -- Chief Financial Officer\n\nSure. So, Jason, I'll give you on your first, and then I'll get into the FX question, which you're talking about. So in terms of Europe, we continue to see good Mastercard performance in Europe. Remember, in terms of what you're seeing in our metrics, you're seeing not only what the underlying economies are doing, but also the impact of our share growth, which has been taking place in Europe.\n\nSo it's kind of the amalgamation of all of that, which is coming through. In terms of regional patterns, I would tell you that we're not necessarily in any meaningful change in terms of trends across the continent, in terms of how the spending patterns are taking place. The consumer generally -- back to our comment earlier around consumer being resilient and strength in consumer, that's certainly the case. Now as you think about different markets, in markets like the U.K., we're seeing stronger growth.\n\nA large part of that is being driven by the fact that we've had recent share wins in the U.K. And then there are share wins we've spoken about in the past in Continental Europe, which are still to come to effect, right? So for example, we talked about our win with Deutsche Bank in Germany, that's still to come to effect. So anyway, there's a mix of all of that, which is kind of taking place at this point in time. On your question around FX.\n\nI shared with you in my prepared remarks what the annual impact to net revenue of a $0.01 change in the value of the euro would be relative to the U.S. dollar, which is about $55 million on an annual basis. We wanted to put that out there. So you have a sense on what the potential headwind or tailwind could be depending on what happens with FX rates.\n\nThe hard part is predicting FX rates. And so given the current mix of our business, that's the sensitivity I've just shared with you as it relates to how you should think about what the impact could be for 2023.\n\nOperator\n\nAnd we'll go next to Tim Chiodo at Credit Suisse.\n\nTim Chiodo -- Credit Suisse -- Analyst\n\nGreat. Thank you for taking the question. I want to dig in a little bit on Mastercard Send relative to Visa Direct. I was wondering if you could call out for us and investors, any of the different maybe strategic focus areas, if there are any pricing differences, if there are any mechanical differences or maybe use cases where you seem to be getting traction relative to Visa Direct? That would be extremely helpful.\n\nMichael Miebach -- Chief Executive Officer\n\nAll right. Let me take that. So all the Visa-related stuff, you should ask them, obviously. So I'm not going to do a direct comparison here, but I can tell you how we are thinking about it.\n\nSo first of all, just earlier on, I talked a lot about the crypto space. To just give you one example. Here is an interesting new technology and a growing ecosystem. And what's the way to get out of your crypto wallet balances is, you turn it into fiat and you use Mastercard Send.\n\nWe were right on it from the first day, and we have all ownerships that do exactly that. Then you go around and basically there is new flows. There's geographies, there's use cases. So those are the dimensions on how we are looking at this.\n\nWe're very systematic about it. This has to have ubiquity. We're looking at all regions from a coverage perspective. We're looking at the key use cases.\n\nWe're very selective on the use cases because here you could get lost in 1,000 flowers bloom. The examples that I gave to you on partnering with large global firms like Airbnb, that is the approach, where you're going to say, you partner with somebody, that is in all the regions and covers a use case that just matters to people out there. So that's essentially the approach on Mastercard Send, it has a domestic angle to it. It has a cross-border angle to it.\n\nIt grows at significant rates. We're very happy with it across all of these aspects that I just said. So one thing to add. Earlier, we were talking about the numbers, ex Russia.\n\nSo Russia was a huge success on Send from day one, that's in fact, where a lot of our learnings came from and so we exited Russia, as you know, in March this year. So that is skewing the numbers a little bit, but the learnings are not going away. We're putting that into a whole set of other markets and to the earlier question around Europe. Particularly in Europe, we see some of those learnings translate in other parts of Eastern Europe countries and so forth.\n\nSachin Mehra -- Chief Financial Officer\n\nAnd just to add to what Michael said, particularly on the remittance side, where you're seeing very good traction take place in terms of cross-border remittances and the capabilities we've got there and the capabilities we are building there. Our global reach out there is holding us in really good stead as it relates to how we are able to tap our partners to generate more and more volume down that path. So that's a -- it's a bright spot in terms of the broader remittances piece as well.\n\nTim Chiodo -- Credit Suisse -- Analyst\n\nExcellent. Thank you for all that context.\n\nOperator\n\nWe'll go next to Andrew Jeffrey at Truist Securities.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nHi. Good morning. Thank you for taking the question. Michael, I wonder if you could give us an update on your processing efforts globally, maybe with an emphasis in Europe, whether you're taking share and winning business in processing and how you think that can affect over time both the net revenue yield and maybe the profitability of the business, too?\n\nMichael Miebach -- Chief Executive Officer\n\nAll right. So Andrew, thanks for that question. So starting with Europe, but then we could extend this conversation looking at the Middle East or in Asia. So we have processing assets in those parts of the world.\n\nAnd just to illustrate how this matters, so there is obviously a whole new set of players that are entering the payment space who are -- whose prime zone isn't really the process. They want to have a great financial app. So they're looking downstream for a whole set of solutions that complete what they do, make it relatively easy out of one hand, and that's what we provide. This is really the explanation for some of our progress on the fintech side, on the Neobank side.\n\nThose guys where we have those partnerships, 70% win rate, I'd like to add here is really, to a large extent, coming down to our processing capabilities, which are state-of-the-art modern fintech-oriented processing capability. So it's been a joy for us to watch. In some parts of the world we do partnerships, for example, with Network International, parts of Africa, and so forth. So it's a combination of our own assets where we feel there is scale and differentiation and sometimes it's through partners.\n\nSo overall, there's a good play here in processing, and it's one of the services that we have in our portfolio.\n\nSachin Mehra -- Chief Financial Officer\n\nI'll just add some color as the rates to beyond the processing fees on our efforts around switching and the proportion of our total MasterCard branded transactions, which, as you know, we've been pushing hard to actually get more switching share. And the reality is that is working very nicely. We are seeing growth in our proportion of switch transactions, which now stands at greater than 60% of total transactions worldwide. And that's super important.\n\nParticularly where we're seeing improvements and progress is in Latin America and in Asia Pacific, both of which have been generally low-index markets from a switched transaction share standpoint in the past. So lots of good effort going on there, and we're seeing good progress come through.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nThank you very much.\n\nSachin Mehra -- Chief Financial Officer\n\nSure.\n\nOperator\n\nOur next question comes from Bryan Keane at Deutsche Bank.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nHi. Good morning. Sachin, just wanted to go through the yield improvements again. It sounds like it's a lot of mix and some pricing in there.\n\nHow do we think about the yield going forward into the fourth quarter and into next year? Does -- is there some comps get a little tougher as we get into next year for these yields? Thanks.\n\nSachin Mehra -- Chief Financial Officer\n\nSure. So, Bryan, what you're seeing in the nature of yield improvement quarter over quarter, this is net revenue yield divided by GDV. You can attribute a large part of that to just mix. As you know, our inter cross-border has come back pretty nicely.\n\nAnd as that has come back nicely, that is higher yielding and that gives us the benefit and the tailwind you're seeing on a sequential basis. I will point out that as it relates to Q4, you should expect that the yield will decline some, which is very consistent with what you see every year. That is just the nature of how the business works just because Q3 happens to be a large cross-border quarter and you still tend to see the benefit of that come through and in Q4, you start to see some of that slowdown. Now you asked a question about 2023.\n\nI would tell you, we, as a business continue to remain very focused on driving and maximizing our net revenue yield. And there's multiple factors which are going to influence that, some of which is the mix of cross-border and domestic certainly, but also things around just like we just talked about how we're increasing our proportion of switch transactions, the more the switching we do, the greater the yield gets, and that's what we're focused on. How we talked about the shift from Maestro to Debit Mastercard. Again, lots of focus around that, and so we're very focused on driving that.\n\nAll of which, when you overlay all the services we've been bringing to the market, you get the benefit of that coming through as well. So generally speaking, as I look forward, I kind of feel like our focus as a business from a driving yield standpoint continues. And I don't see anything necessarily which is going to change dramatically going into 2023 from a yield trajectory standpoint.\n\nMichael Miebach -- Chief Executive Officer\n\nYes. And Sachin kind of explained the strategy again. And that's what -- we're trying to be in the payment transaction and you're at profitable levels, but then use our services to continue to improve the overall revenue yield. And that is that combination that makes us look at the future very optimistically.\n\nSo I don't really see anything changing here. These are the tools that we have and we're using them effectively.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nGreat. Thank you both.\n\nOperator\n\nNext, we'll move to Ramsey El-Assal at Barclays.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thank you for taking my question. I had one on rebates and incentives. And more specifically, kind of how the mix of those rebates and incentives have changed over the past several years.\n\nI guess the underlying question is, are you having to incentivize an expanding number of value chain players, fintechs, merchants to kind of support consistent growth? How has that mix evolved over time? And how do you expect it to evolve in the future?\n\nSachin Mehra -- Chief Financial Officer\n\nYeah. So in terms of rebates incentives, the mix in terms of how we're actually incentivizing to generate incremental revenue has not changed fully. We've historically been more focused as we have actually delivered higher levels of rebates and incentives to our issuing partners. That continues to be the case as to where we are actually expanding most of our rebates and incentives dollars, and that really hasn't changed.\n\nAnd as it relates to the mix between rebates and incentives for domestic volumes versus cross-border, I'd say, that mix also hasn't really changed. As you know, cross-border has generally been indexed lower from rebates and incentive standpoint, and that continues very much to be the pattern right now as well, Ramsey.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nOK. So pretty stable environment is what it sounds like. I appreciate it. Thank you.\n\nSachin Mehra -- Chief Financial Officer\n\nYes. Absolutely.\n\nOperator\n\nWe'll move next to David Togut at Evercore ISI.\n\nMichael Miebach -- Chief Executive Officer\n\nDavid, are you there?\n\nOperator\n\nAnd, sir, you may have your line on mute. We're not hearing you.\n\nMichael Miebach -- Chief Executive Officer\n\nAudra, maybe we go to the next, please.\n\nOperator\n\nYes. We'll move next to Bob Napoli at William Blair.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nHi. Thank you, and good morning. Just would like an update on your B2B -- your thoughts around the B2B payments market and the opportunities there? I know you called out a commercial POS of $14 trillion. And what inning are we in? What is -- any thoughts on the changes of that market, the growth of that market? Thank you.\n\nMichael Miebach -- Chief Executive Officer\n\nRight. Yes. So I'm really not into baseball analogies. So that's why -- earlier, I was talking about the first half of the game.\n\nBut to your question, very specifically, B2B, huge opportunity from a volume perspective. We called it out and we cut it down into very distinct types of flows at our investor day at the end of last year to focus on B2B accounts payable on one hand, but there's other B2B flows which we're very active in. For example, through all the illustrations I gave you earlier on virtual card use cases. So virtual card is the current and most immediate answer to go after B2B flows.\n\nThere's the commercial POS piece somewhere which is kind of an in-between space between B2B and small business. That's a huge space with a lot of cash and checks. So you build it up over those into the accounts payable piece. And you know the long-range vision that we have on accounts payable is really the Mastercard Track business payment service piece, where we say over time, we're building a two-sided network here.\n\nThat continues to grow, but that takes time. But we have the large -- we have large players around the table, HSBC, JP, and so forth. So a good initiative for us. But for now, we are very active on virtual cards to solve the issues of buyers and suppliers in the space.\n\nSo we have not moved away this by any stretch of the imagination, this is a huge opportunity, and we're going to go after it.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nAll right. Thank you.\n\nSachin Mehra -- Chief Financial Officer\n\nAudra, I think we have time for one last question.\n\nOperator\n\nWe'll take that question from Jamie Friedman at Susquehanna Financial Group.\n\nJamie Friedman -- Susquehanna International Group -- Analyst\n\nHi. Sachin, transaction processing fees increased 15%, but switched transactions increased 9%. I know you called out in your prepared remarks mix changes. I was just wondering if you could elaborate on that.\n\nSachin Mehra -- Chief Financial Officer\n\nSure. So there are a few things going on right there where our transaction processing fees are growing faster than the underlying driver, one of which is the mix change. And really, remember, when we make cross-border revenues, we make cross-border revenues on a basis-point basis, as well as on a sales per transaction. And the component, which is on basis points since and cross-border volume fees and there's some component of cross-border related sales per transaction that sits in terms of the number of transactions which we process with the same transaction processing fees, which is where the mix effect comes through.\n\nBecause as you've seen, inter cross-border grow at a rapid pace. That's contributing to that delta between what we're seeing in the revenue line and what we're seeing in the driver because cross-border is high-yielding than is domestic. There are a couple of other factors which calls for that differential as well. I talked about FX-related revenues and some level of pricing.\n\nThose are the two other contributors which go into that chain.\n\nJamie Friedman -- Susquehanna International Group -- Analyst\n\nThank you.\n\nMichael Miebach -- Chief Executive Officer\n\nAll right. Let me bring the call to a close. First of all, thanks for your questions. And to all of our investors, thank you for your support.\n\nThis morning, I sent a note to all colleagues here at Mastercard, thanking them for a strong quarter because they are the ones who make all of this happen. So a shout-out to them as always. And with that, we'll talk to you in the next quarter. Thank you very much.\n\nSachin Mehra -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWarren Kneeshaw -- Head of Investor Relations\n\nMichael Miebach -- Chief Executive Officer\n\nSachin Mehra -- Chief Financial Officer\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHarshita Rawat -- AllianceBernstein -- Analyst\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nRayna Kumar -- UBS -- Analyst\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nTim Chiodo -- Credit Suisse -- Analyst\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nBob Napoli -- William Blair and Company -- Analyst\n\nJamie Friedman -- Susquehanna International Group -- Analyst\n\nMore MA analysis\n\nAll earnings call transcripts"
}