{
  "companyName": "Ulta Beauty",
  "companyTicker": "ULTA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/26/ulta-beauty-ulta-q2-2022-earnings-call-transcript/",
  "content": "Ulta Beauty (ULTA 0.91%)\nQ2 2022 Earnings Call\nAug 25, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Ulta Beauty's conference call to discuss results for the second quarter of fiscal 2022. [Operator instructions] And as a reminder, this conference call is being recorded. And it is now my pleasure to introduce Ms. Kiley Rawlins, vice president of investor relations.\n\nThank you, Ms. Rawlins, please proceed.\n\nKiley Rawlins -- Vice President, Investor Relations\n\nThanks, John. Good afternoon, everyone, and thank you for joining us today for our discussion of Ulta Beauty's results for the second quarter of fiscal 2022. Hosting our call are Dave Kimbell, chief executive officer; and Scott Settersten, chief financial officer; Kecia Steelman, chief operating officer, will join us for the Q&A session. This afternoon, we announced our financial results for the second quarter.\n\nA copy of the press release is available in the Investor Relations section of our website. Before we begin, I'd like to remind you that the statements contained in this conference call, which are not historical facts, may be deemed to constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual future results may differ materially from those projected in such statements due to a number of risks and uncertainties, all of which are described in the company's filings with the SEC. We caution you not to place undue reliance on these forward-looking statements, which speak only as of today, August 25, 2022.\n\nWe have no obligation to update or revise our forward-looking statements, except as required by law, and you should not expect to do so. We'll begin this afternoon with prepared remarks from Dave and Scott. Following our prepared comments, we'll open the call for questions. [Operator instructions] As always, the IR team will be available for any follow-up questions after the call.\n\nNow I'll turn the call over to Dave. Dave?\n\nDave Kimbell -- President\n\nThank you, Kiley, and good afternoon. We appreciate your continued interest in Ulta Beauty. The Ulta Beauty team delivered outstanding performance again this quarter. For the second quarter, net sales increased 16.8% to $2.3 billion.\n\nOperating profit increased to 17% of sales and diluted EPS increased 25% to $5.70 per share. We continue to be very pleased with the broad-based strength of our business. For the quarter, all major categories exceeded our expectations, and we increased our market share in prestige beauty versus last year based on point-of-sale data from the NPD Group. Sales in stores and digital channels also increased -- exceeded our expectations with both channels delivering solid comp growth in the quarter.\n\nAnd we saw healthy sales gain from members across all income demographics. Consumer engagement with beauty remains strong, reflecting a deep emotional connection with the category, as well as the continued importance of self-care and wellness. This healthy engagement paired with solid operational execution from our teams, fueled our results. Before we talk about the results, I want to recognize and thank our Ulta Beauty associates.\n\nTheir collaborative commitment to serving our guests, caring for each other and executing our plans with absolute excellence has enabled us to continue navigating a dynamic environment and deliver outstanding results. The strength in our business, despite a turbulent environment reflects the power of our differentiated model and our ability to capitalize on the strength of the overall beauty category. Our unique enduring value proposition continues to drive our success and our strategic framework anchors our focus as we look forward. This afternoon, I want to share an update on our strategic progress.\n\nOur first strategic priority is to drive disruptive growth through an expanded definition of all things beauty. We engage into light beauty enthusiasts with a curated differentiated assortment focused on inclusivity and leading trends, and this approach continues to deliver results. From a category perspective, fragrance and bath, skincare, haircare and makeup all exceeded expectations, delivering double-digit comp growth against the second quarter last year. We are encouraged that the vast majority of our comparable sales growth was fueled by growth from both core and newness with a modest benefit from recently executed price increases.\n\nAs we have discussed on previous calls, we have received a large number of price increases from our brand partners in the first half of this year. Given ongoing cost pressures facing our brand partners, we expect to receive additional increases as we move throughout the rest of the year. Turning to the performance of our core categories, starting with our largest category, makeup. Compared to the second quarter of 2021, both prestige and mass makeup delivered double-digit comp growth.\n\nAs consumers participated in more in-person activities, traveled and increasingly used makeup as a form of self-expression. Guests continue to engage with new brands like Fenty Beauty, R.E.M. Beauty and recently launched About-Face by Halsey, while new products from established brands like Clinique, NYX, e.l.f., and ColourPop also contributed to the sales growth. In addition, the ongoing expansion of MAC and Chanel Beauté into more stores contributed to the strong prestige performance.\n\nHaircare, our second largest category, delivered another quarter of double-digit growth driven by newness and strong engagement in our semiannual Gorgeous Hair Event, a strategic event designed to acquire new guests, increase existing member spend and drive salon penetration. New brands like OLAPLEX, as well as new product launches from Way and Living Proof, contributed to the category growth in the quarter and the initial launch of Dyson's latest Airwrap styling tool with new features and attachment sold out quickly. Guests continue to engage with core professional brands like Redken and Pureology, and our salon backbar takeovers drove strong growth with Joico and recently launched Andrew Fitzsimons. Skincare was one of our best-performing categories this quarter with both prestige and mass delivering double-digit comp growth, driven by new brands and product innovation.\n\nNewness continued to appeal to guests with newer brands, such as Drunk Elephant, Fresh, Supergoop!, and recently launched Vacation, as well as new products from Peach & Lily, OSEA, and Hero cosmetics, contributing to category growth during the quarter. And Skinfatuation, our monthly skincare program, which works to demystify skincare with educational content and focused themes, delivered nice growth for established brands like Tula, Sun Bum, COOLA, and Good Molecules. The fragrance category again delivered strong double-digit comp growth on top of extraordinary growth last year. Compelling newness and strong engagement with our Mother's Day and Father's Day events contributed to this performance.\n\nRecently launched Ulta Beauty exclusive Billie Eilish and Charli D'Amelio Born Dreamer, as well as new scents from Gucci, YSL, and Dior, drove meaningful sales growth. While our monthly Fragrance Crush program drove greater engagement with established brands like Valentino and Armani. In addition, in core category growth, we are investing in three cross-category platforms to increase guest engagement and expand our market share. We know consumers seek beauty brands that are good for the world and align with their values.\n\nAnd Conscious Beauty at Ulta Beauty continues to resonate with guests as it addresses these interests. At the end of the second quarter, 290 brands offered certified products in at least one Conscious Beauty pillar, including newly certified brands, Born Dreamer, About-Face, SE, and Good Light. To increase the visibility of Conscious Beauty and to make it easier for guests to identify products that align with what is important to them, this quarter we refreshed the landing page on ulta.com and added digital badging to all product pages. Now guests can quickly identify certified brands and products across our Conscious Beauty pillars, whether shopping in stores or on our digital channels.\n\nMoving to our efforts to expand and support our assortment of BIPOC brands, we are committed to diversifying our assortments, so all guests can see themselves reflected at Ulta Beauty. In addition to continuing to expand our portfolio of BIPOC brands and enhance our marketing support for these brands, we are focused on driving structural change within the beauty industry. As the leader in beauty, we believe we have a responsibility to take tangible steps to create foundational industry change through the investment of capital and resources. As such, next month, we will officially launch our MUSE Accelerator program focused on early stage BIPOC brands.\n\nThrough this program, we will provide eight diverse leaders, founders and entrepreneurs with resources, mentorship and support to prepare them for retail readiness. I look forward to sharing more about our inaugural class on future calls. Finally, we continue to enhance our wellness shop to support guests as they prioritize self-care. This quarter, we expanded the shop to additional stores and now roughly 750 stores offer guests an elevated cohesive presentation of wellness products to help them easily navigate their personal journey.\n\nToday, we offer a curated omni assortment of more than 140 brands, including newly launched brands, Womeness and Olay, and more than 700 SKUs to help our guests feel their best inside and out. Moving now to our ongoing efforts to evolve the omnichannel experience through a connected physical and digital ecosystem, all in your world. Store traffic trends were strong again this quarter as guests return to in-store shopping and services. While store traffic remained slightly below pre-pandemic levels, the trend continues to improve.\n\nOur services business delivered another quarter of double-digit comp growth, primarily due to increased capacity and new service offerings. In addition, we implemented modest price increases for core services in May. Notably, member engagement with services accelerated from the first quarter, reflecting our ongoing efforts to amplify our salon services and encourage first-time trial through our Member Love offers. As guests return to stores, they are also engaging in our digital channels.\n\nAfter lapping the tremendous digital acceleration prompted by COVID, our e-commerce channel returned to more normalized growth, delivering mid-single-digit comp growth for the quarter. We continue to incentivize guests to try alternative delivery options for e-commerce orders while also investing to improve the guest experience. During the quarter, BOPIS increased 32% to 25% of e-commerce sales, compared to 20% last year. Importantly, we saw a significant improvement in guest satisfaction with the BOPIS experience, reflecting the engagement and focus of our store associates.\n\nWhile limited to 12 markets, guests are also increasing their use of our same-day delivery options, and we continue to be pleased with the AOV and profitability metrics of this fulfillment capability. Between BOPIS, same-day delivery and ship from store, more than a third of our digital orders were fulfilled by stores. We continue to expand and enhance our guest experience across all channels. In our digital channels, our teams continue to deliver a more seamless experience through what we call our digital store of the future.\n\nThis quarter, we introduced new, more engaging products on both ulta.com and our mobile app. We are also improving our physical store experience. Next month, we plan to introduce a new front of store presentation that will allow us to enhance our ability to support more editorial storytelling around newness, events and trends. And later this fall, we will introduce a new layout in select stores to elevate key growth categories, unify the presentation of skincare and makeup, and enhance the store -- the services experience.\n\nLonger term, we are exploring innovative ways to connect our digital and physical stores and deliver forward-thinking guest experiences. This quarter, we officially launched Prisma Ventures, a $20 million fund focused on investing in early stage start-ups and emerging tech entrepreneurs who will shape the future of retail and beauty. To date, the fund has partnered and invested in a variety of start-ups to enable greater personalization, including Haut.AI, Adeptmind, Revea, and ReStyle. And we recently announced an investment in LUUM, a start-up that provides robotic lash extensions, opening new intersections between beauty and robotics.\n\nFinally, we continue to enhance and expand our partnership with Target. During the second quarter, we opened 59 Ulta Beauty at Target shops, ending the quarter with 186 locations. During the quarter, we refreshed the assortment, expanding the fragrance offering, launched two Black-owned brands, Sunday to Sunday and Melanin Haircare, and introduce newness from existing brand partners, including Benefit, Morphe, and Tula. As we anniversary the initial launch of this innovative partnership and reflect on the progress made, we continue to be pleased with overall guest engagement and we are encouraged by the behavior of new members who enter our ecosystem through this new channel.\n\nThe foundation of our partnership is strong, and we are focused on driving further loyalty conversion to unlock even greater value as we scale. Now let me give you an update on some of the steps we're taking to drive love, loyalty, and emotional connection with Ulta Beauty. We have been on a multiyear journey to create a stronger, more emotional connection with our guests and bring our brand purpose to life. Beauty is inherently inclusive.\n\nEvery individual is unique, and beauty can help celebrate this uniqueness. As the leader in the category, we want to move beauty forward, making it a force for good for all and inspiring everyone to discover their own possibilities through the power of beauty. Building on our previous brand equity work, we are launching a new brand equity campaign, beauty and to celebrate the expansive nature of beauty and empower people to embrace their endless possibilities. The campaign will launch with content across paid, owned and earned media with unique elements that we believe will prompt new culturally relevant conversations about beauty and inspire greater inclusivity and positivity in our industry and the world.\n\nThis campaign has performed extraordinarily well in consumer testing, and I'm proud of the efforts Ulta Beauty is making to change the way the world sees beauty. Turning to our loyalty program. We ended the quarter with 38.2 million active members in our Ultimate Rewards loyalty program, 10% above the second quarter last year. In addition to converting new members and reengaging lapsed members, we are maintaining healthy retention rates, especially among our Diamond and Platinum members.\n\nOverall spend per member increased again this quarter, driven by both increased trip frequency and higher average ticket. And our channel metrics remain steady with in-store-only members totaling 76% of members and omnichannel-only members totaling 17%. Over the last several years, we have expanded our CRM capabilities and developed stronger life cycle marketing strategies that will allow us to drive loyal shopping behaviors more precisely through promotional activity. Today, we are leveraging predictive decisioning to target strategic member segments with personalized communications and offers to increase frequency and drive higher lifetime value.\n\nWe are seeing encouraging engagement in these offers, resulting in increases in spend per member. As promotional intensity increases in beauty and across retail, these capabilities enable us to rely less on mass market promotions and leverage more targeted and profitable offers. In May, we launched UB Media, our new retail media network and the response from brand partners has been tremendous. Our brand partners are excited about the opportunity to leverage the power of our exclusive first-party data to transform the way they connect with beauty enthusiasts.\n\nOur team is ramping up well, and we remain excited about the opportunity to unlock a new income stream and drive sales as we enable our brand partners to engage consumers more effectively. In closing, I am incredibly pleased with the strength we have seen across our business so far this year. Our operational and financial performance is a testament to the power of our values-based culture, our business model and the important role beauty plays in our customers' lives. We recognize beauty is not immune to macroeconomic challenges, but the category's deep emotional connection has historically resulted in stronger resilience compared to other discretionary categories.\n\nAnd as our results illustrate, we believe this is even more true today given the importance of self-care and wellness. As we look to the future, we know there will be challenges, particularly with the wide-ranging impact of rising inflation, both on our business and our guests. But we remain confident in the resilience of the beauty category and our ability to lead the beauty category and drive long-term profitable growth. And now I will turn the call over to Scott for a discussion of the financial results.\n\nScott?\n\nScott Settersten -- Chief Financial Officer\n\nThanks, Dave, and good afternoon, everyone. As Dave indicated, our second quarter results were better than we expected. Strong sales growth due to several factors, including the resilience of the beauty category, stronger-than-expected sales growth from stores, and the impact of new brands, drove better-than-expected performance in gross margin and SG&A leverage, resulting in an operating margin of 17%. These results reflect the hard work and commitment of our associates, and I want to thank all of our teams for staying focused on serving our guests and managing our business through this dynamic operating environment.\n\nNow to the financial results, starting with the income statement. Net sales for the quarter increased 16.8%, driven by 14.4% growth in comp sales, a $19 million increase in other revenue and strong new store performance. Transactions for the quarter increased 8.3%, primarily driven by growth from stores. Average ticket increased 5.6%, resulting primarily from an increase in average selling price.\n\nAverage units per transaction were down slightly. The increase in average selling price primarily reflects the impact of product mix and retail price increases executed this year. We estimate that price increases contributed about 300 basis points to the overall comp. During the quarter, we opened seven new stores and relocated four stores.\n\nFor the quarter, gross margin decreased 20 basis points to 40.4% of sales, compared to 40.6% last year. Although we had less total promotional activity during the quarter, overall merchandise margin was lower than last year, primarily due to the impact of brand mix and lapping benefits from favorable inventory reserve adjustments in the second quarter last year. Gross margin was also negatively impacted by higher inventory shrink, primarily due to increased theft across the retail landscape, theft and organized retail crime are increasing, and we are seeing similar trends in our business. We are working diligently to keep our associates and guests safe and to reduce the risk of impact through investment in new fixtures, additional associate training, innovative technology solutions and increased staffing levels.\n\nWe are also working with and supporting retail industry organizations and the Buy Safe Coalition to address opportunities at the legislative level. These gross margin headwinds were partially offset by leverage of fixed costs due to the strong top-line growth and an increase in other revenue. Double-digit growth in supply chain costs persisted into the second quarter, driven by increased freight costs and higher wage rates in our distribution centers. Strong top-line growth enabled us to mitigate the gross margin impact this quarter but as sales growth moderates, we continue to expect that higher supply chain costs, including fuel costs, which are expected to remain above last year, will be a larger headwind to gross margin in the second half of the year.\n\nSG&A increased 15.1% to $534.5 million. As a percentage of sales, SG&A decreased 30 basis points to 23.3%, compared to 23.6% last year. Lower marketing expense and leverage of store payroll and benefits due to higher sales were partially offset by the leverage of corporate overhead primarily reflecting strategic investments as well as higher incentive compensation, reflecting our strong performance. Year to date through the second quarter, we have invested about a third of our plan in support of our strategic initiatives.\n\nAs we discussed last quarter, this year, we are offsetting the incremental marketing expense of the digital campaigns we manage for our brand partners with the vendor income that is a direct reimbursement for these specific costs within total marketing expense. Similar to the first quarter, this resulted in about 70 basis points of favorable impact to SG&A in the second quarter. Operating income increased 17.8% to $391.4 million, compared to $332.3 million last year. As a percentage of sales, operating margin increased 10 basis points to 17%, compared to 16.9% last year.\n\nDiluted GAAP earnings per share increased 25% to $5.70 per share, compared to $4.56 per share last year. Moving to the balance sheet and cash flow statement. Total inventory increased 15.4% to $1.67 billion, compared to $1.44 billion last year. In addition to the impact of 29 additional stores, the increase reflects inventory purchases to support key brand launches and increases in inventory costs as well as ongoing efforts to maintain strong in-stocks of key items to support expected demand.\n\nCapital expenditures were $49.4 million for the quarter, compared to $22.7 million last year. The increase in capital expenditures was primarily related to investments in new, remodeled and relocated stores, supply chain investments and merchandising improvements. Depreciation was $60.9 million, compared to $69 million last year, primarily due to a shift of IT investments from capital to cloud expense. We ended the quarter with $434.2 million in cash and cash equivalents.\n\nDuring the quarter, we repurchased 798,000 shares at a cost of $301.6 million. At the end of the second quarter, we had $1.6 billion remaining under our current $2 billion repurchase authorization. Turning now to our outlook. Reflecting our second quarter performance and sales trends we've experienced so far in August, we are increasing our outlook for fiscal 2022.\n\nWe now expect net sales to be between $9.65 billion and $9.75 billion, with comp sales growth between 9.5% and 10.5%. Our updated outlook reflects year-to-date trends while continuing to consider uncertainties that could impact the second half of the year, particularly during the holiday season. Embedded in our forecast is an expectation for mid-single-digit comp growth in the second half, reflecting the risk of potential shifts in consumer spending due to inflationary pressures, the impact of increased points of distribution for prestige beauty and the likelihood of a more promotional holiday season. We now expect operating margin for the year will be between 14.6% and 14.8% of sales.\n\nWe expect operating margin will deleverage in the second half as sales growth moderates and cost pressures and planned investments have a greater impact. We expect gross margin expansion for the year with leverage of fixed costs and growth in other revenue, partially offset by lower merchandise margin, higher shrink and higher supply chain costs. We continue to expect SG&A expense will deleverage for the year, driven primarily by $60 million to $65 million of expenses related to our strategic priorities, as well as higher wage rate growth across the enterprise, partially offset by lower marketing expense. In addition, we expect inflationary pressure in operating expenses will continue.\n\nThese assumptions result in updated full year guidance for diluted EPS growth between $20.70 and $21.20. One final update. We now expect to spend between $350 million and $400 million in capex in fiscal 2022, including approximately $195 million for supply chain and IT, $180 million for new stores, remodels and merchandise fixtures, and about $20 million for store maintenance and other. We expect depreciation for the year will be around $250 million.\n\nIn closing, we are very pleased with our performance year to date. While we continue to face uncertainties in the current macro environment, we are focused on delivering great guest experiences and driving sustained profitable growth. Longer term, we believe the beauty category will continue to be resilient, and we are confident that we are differentiated and proven model and growth strategy, combined with our outstanding associates will continue to position Ulta Beauty as the preferred beauty destination. And now I'll turn the call back over to our operator to moderate the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from the line of Rupesh Parikh with Oppenheimer. Please proceed with your question.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood afternoon. Thanks for taking my question. Also, congrats on a really strong quarter. So I guess I start -- I want to start out with the consumer.\n\nSo I was curious if you guys are seeing any behavior changes of note and whether you're seeing any side of the trade down or even resistance to price increases? And then just given some concerns out there about volatility and trends, I'm just curious if you're seeing more volatility in the business than what you've seen in the prior months.\n\nDave Kimbell -- President\n\nHi, Rupesh. Thanks for the question. Yeah, the short answer on trade down is no. We're not experiencing that or seeing that at this time, similar to what we talked about last quarter.\n\nWe're seeing strong growth across all aspects of our business. As I mentioned, every category performed in double digits, strength across channels, stores, e-comm services. And as we look at income levels of our guests, we're seeing healthy growth at all income levels. So no real signs or signals of trade down within the marketplace yet.\n\nAnd again, I think that's a reflection of the importance that this category plays in our guest lives, the increasing connection that beauty has, wellness, the desire to express them -- our guests to express themselves to the world in this -- as the world reopens. So the importance of this category is demonstrating itself. And so, so far, we're not seeing it, but we're prepared as we look forward to continue to make any adjustments if and when that behavior starts to show up, as you know, within our model, we're uniquely prepared to adjust. If any of that does show up with our mass to prestige offering, all price points, all different categories.\n\nBut as of now, we're seeing strong growth. As far as throughout the quarter, the quarter started very strong. We did see a slight moderation toward the end of June and early July as you may have seen with other retailers, but the trends picked up toward the end of the quarter, and we're pleased with what we're seeing so far this quarter. So no big concerns or down trends is across any part of our business right now.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nAnd our next question comes from the line of Omar Saad with Evercore ISI. Please proceed with your question.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThank you taking my question. So I just want to confirm, a lot of retailers are saying they thought some deceleration beginning around June. It doesn't sound like you guys are seeing that. And then also on the profitability of the business, gross margin sounds like there's a little bit of pressure there versus last year, but last year was so clean.\n\nIt seems like it's still -- the promotional levels are still well below pre-COVID. Is that a sustainable phenomenon in your opinion? Thanks.\n\nDave Kimbell -- President\n\nLet me just -- I'll start with the deceleration, and Scott can pick up on the gross margin and some of the things we're seeing there. So again, yes, we did -- our quarter in total was strong. We were pleased with the results throughout the quarter. There was a modest slowdown in the trends right at the end of June, early July as a number of things, both, I guess, within retail and in the world around us, we're showing up.\n\nBut again, nothing alarming on our business. And we did see trends return to early in the quarter rates as we got to the end of July and then certainly, as I said, into this quarter. So a modest impact. But again, the category itself, the importance it plays in our guest lives, allowed us to kind of ride through any macro disruption and short-term impacts that we saw throughout the quarter.\n\nScott Settersten -- Chief Financial Officer\n\nAnd as far as gross margin is concerned, again, we're very happy with the results that the business is generating year to date. Our longer-term guidance assumes gross margin is going to moderate somewhat from what we saw last year, again, when we started out with our longer-term algorithm. And again, this year, the sales performance has just been extraordinary. So if you're looking at it year over year, I'd say product mix has something to do with the variability, UB Media mix and how we're accounting for that in the geography and the P&L has something to do with that.\n\nAs we look out toward the remainder of 2022, we've been clear about we expect the promotional environment is probably going to get a little bit tougher, especially what we've seen here across the retail universe here most recently. So moderation as we look to the future. It's still a lot of great levers we have in the business. When we talk about Project SOAR delivering benefits over the longer term.\n\nOur continuous improvement in EFG efforts still with a lot of benefit to generate for the company over the long term. So I think operating margin, we feel good about opportunities to continue to leverage there, but we think gross margin will certainly moderate as we look ahead.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThanks. Well done.\n\nOperator\n\nThank you. And our next question comes from the line of Dana Telsey with the Telsey Advisory Group. Please proceed with your question.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Congratulations on the nice performance. You had mentioned the services business and the improvement there. Can you talk a little bit about what you're seeing there? What that impact could be? And last -- and then next, just on the price increases that you had put in place.\n\nWhere are we in the scale of price increases by category? And how do you see it blending out for the year? Thank you.\n\nKecia Steelman -- Chief Store Operations Officer\n\nThanks, Dana. I'll start and then turn it over to Scott. Our salon team delivered strong quarter growth of double-digit comps during the quarter, and really what we saw with some strength in our hair coloring services. We have strength across all geographies and regions, which was great.\n\nAnd the sales were really fairly consistent throughout the quarter. What we like what we see is these partnerships with our backbar salon takeover event, as Dave was mentioning in his spoken notes that Joico, Andrew Fitzsimons, Kenra are examples of where you can have a salon expert and really engage with the consumer to try a new brand that they've never made tried before. We're also really driving trial through our personalized offers. So we're getting people to come in and try our services, which is really important.\n\nFrom a staffing perspective, we continue to really invest in our education, in our training for our stylists, particularly focusing on textured hair sales. And then from a pricing perspective, Dave was mentioning, that's not really playing into the comp. This is the first time that we've increased our price in the last three years. It was really modest.\n\nSo really, it's through the growth of the core business and services that's driving that comparable off. So I'm really pleased with how the guest is refining coming out of COVID. Scott?\n\nScott Settersten -- Chief Financial Officer\n\nAnd price increases as far as product is concerned throughout the channels. Again, where a number of increases in the second quarter, slightly higher than what we saw in the first quarter. We estimate it's about 300 basis points to total comp for the second quarter. Again, the number of SKUs that have been impacted and the total all impact to our assortment is higher than we expected early in the year, and we expect there to be in the back half of the year.\n\nWe've already been alerted by some of our vendor partners that there's some in the queue now, and we expect there to be more as we get deeper into the year. So we'll continue to update quantitatively on how that impacts our business and how we're thinking about it maybe for 2023 when we get further down the road.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question comes from the line of Mark Altschwager with Baird. Please proceed with your question.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nGood afternoon. Thank you for taking my question. With respect to the recovery you're seeing in the makeup category, what are your current views on whether we're seeing with whether what we are seeing is pent-up replenishment post COVID versus perhaps the early innings of a new innovation-driven cycle that could have some legs to it? And then bigger picture, just based on the trends you're seeing in your business year to date and the projections for the year, calling for low-teens sales growth at the high end, is the 5% to 7% three-year CAGR still the right way to be thinking about the medium-term growth outlook? Thank you.\n\nDave Kimbell -- President\n\nGreat, Mark. Yeah, on makeup, yeah, we're really, really pleased and encouraged with what we're seeing as I mentioned, double-digit growth across mass and prestige. And you know well. You've been following us for a while.\n\nThat category has had its ups and downs and been struggling for a little bit. And so we're really pleased with the results, and we think it's well rounded. There's no doubt there's some elements of maybe pent-up demand, although as we get further into the reopening, we think that's probably a smaller and smaller part of what's driving the business. What we do see happening is just strong innovation across both mass and prestige, really good performance by new brands that we brought in, Fenty, R.E.M., new brand About-Face, great innovation.\n\nOn the mass side with NYX and ColourPop, and e.l.f., and others, but also on the prestige with Benefit, MAC, Clinique, and many others. So we're seeing strong innovation that's really connecting. And it's being fueled by some core trends that we think are here to stay for a while that are driving engagement. And it's kind of an interesting time within makeup right now that we're seeing a combination of very bold, playful looks, kind of retro looks, euphoria type engagement driven engagement that are reminiscent of some of the things we saw back in 2016 that are encouraging.\n\nBut at the same time, there's an equally strong trend around a clean look, glowy, glazed, that are driven by higher usage of foundation and highlighters, which are really important to the category and frankly, have been struggling for a little bit. So we are pleased with the innovation, the -- as people get out and want to express themselves to the world and there are more occasions that's driving more usage and there's some core underlying trends and innovation that are supporting the category. So we're optimistic about the path ahead, and we'll continue to be investing in our makeup business and partnering with our brands to drive this trend for the foreseeable future. As far as our long-term targets, no -- we're not updating or changing that.\n\nSo yes, the outlook that we shared with you last fall is still on our horizon, and so I'd keep that as our long-term guidance.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Krisztina Katai with Deutsche Bank. Please proceed with your question.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nHey, guys, good afternoon, and congratulations on a very nice quarter. I just wanted to follow up on innovation, especially on the skincare and haircare side of the business, which has been really strong. Can you talk about some of the areas of the business that you are seeing this newness that is driving very strong sequential performance? How should we think about some of the product innovation and just potential launch time for any big launches that are coming up? And then secondly, if you could just touch on your expectations and member growth going forward. You're bringing back a lot of lab consumers, are they all back now? Is there still room there to get them back? And then maybe layer in the opportunity that you see from the target partnership?\n\nDave Kimbell -- President\n\nOK. There's a lot of great stuff to talk about in that. Let me just hit a few of that. First, on innovation.\n\nSo yes, I talked about makeup, let's hit on skincare and haircare. And it's that kind of highlights one of the aspects of our business that we're really excited about right now is the strength we're seeing across all of our categories, double-digit growth in every category, which, again, I think is a reflection of the strength of our model and the power of beauty right now. Within skincare, we're seeing the strong growth that's driven by a combination of new behaviors that were strengthened or developed during COVID around skin health and skincare, new brands that we've launched that continue to drive our business, Drunk Elephant, Fresh, Supergoop!, Vacation, new innovation, great innovation across moisturizers, serums, eye creams, acne by brands like Peach & Lily, OSEA, Hero, so many others, Clinique across the entire assortment. The trends that we're seeing in skincare again, we think will help -- will sustain for a while.\n\nWe continue to see skinification that consumers, including young Gen Z consumers, seen the importance of skincare and how that lays the foundation for their overall skin health and their overall look. There is a growth in science or clinically backed or dermatological improvements. So savvy consumers are looking for these active ingredients, and that's been driving a lot of growth. And there's been a lot of innovation around just core hydration as a recognition that that's healthy skin is driven by that.\n\nSo many things coming together to drive that double-digit comp in both mass and prestige on skincare. Haircare, similarly strong growth we think, in strong engagement, both by newness but also the execution of our programs like Gorgeous Hair Events. We benefited from a number of new brands, including OLAPLEX. We're seeing strong innovation across a number of brands like Way and Living Proof.\n\nI mentioned Dyson as being a key to our overall haircare and the innovation that they continue to bring. So in that area, it's hair health, much like skin health, continues to resonate and be important and take a priority. There's a growing trend around shine and the treatments and accessories that help drive that. And of course, texture has been a growing and increasingly important part of the category and Ulta Beauty's expression for the last couple of years, and that continues to be strong.\n\nSo we're seeing strong growth, and we think innovation, consumer behaviors, the connection and the importance of these categories much like makeup will help sustain growth as we look into the future. On members, we're really pleased, 10% growth on members for the quarter, a new record high in our member performance driven by guest acquisition, reactivation, retention. Yes, we've reactivated a number of members, but there are more to get. And as high as retention is, there's always some guests that are dropping out for a number of reasons.\n\nSo there's an always on activity to reactivate members, and we have quite a few a large pool to continue to activate. And there's quite a few beauty enthusiasts as big as we've grown, there's a huge pool of beauty enthusiasts that are not yet members of our program, and we think they should be and we're going after them. One of the ways to do that, Kecia through our target program and what we're doing, so do you want to talk a little bit about that?\n\nKecia Steelman -- Chief Store Operations Officer\n\nYeah. We're really pleased with how our partnership is progressing and the future opportunities that really provide our guests, brand partners Target in Ulta Beauty. We're leaning in. In fact, one of the nuances that we're introducing this next quarter is that we're creating a dedicated field team that as we scale this partnership, they're going to be really focused on training and education with an emphasis really on loyalty and unlocking that loyalty opportunity with not only our existing members, but with new members as they come into the Ulta Beauty at Target.\n\nSo we're excited as we continue to expand and grow, and we feel Ulta Media and Target is another way to drive loyalty members into our ecosystem.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. And the next question comes from the line of Oliver Chen with Cowen. Please proceed with your question.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi. Great quarter. As we think in terms of the guidance, what's embedded with respect to pricing? And how would you speak to that against the promotional needs that you'll have fourth quarter is always a very promotional time and you do a lot of great personalization to drive promotions as well? And a follow-up on the new layout. There can be disruption and customers don't necessarily like new layouts sometimes and your inventory needs to change.\n\nSo I would love your thoughts on timing and execution risk and rationale. It sounds like it's a prudent move to focus on categories, but it comes with different risk factors. Thanks.\n\nScott Settersten -- Chief Financial Officer\n\nYeah. So I'll start that one. So pricing, we said about 300 basis points of price increases reflected in our 2Q results. And all the price increases that we're aware of through our vendor partnerships are embedded in our guidance, right, for the back half of the year.\n\nSo we feel like we have that framed up well. When we think about, again, the second quarter spectacular performance above our expectations. Our updated guidance includes, right, the beat on the second quarter and the trends we've seen so far, early stages of the third quarter. When I think about the top-line trends, and again, back half of the year, we're going to be lapping some stronger performance last year.\n\nWe've referenced the competitive environment. We expect that to be tougher as we get into the back half of the year, the promotional environment, again, you know this well, Oliver, in the fourth quarter holiday. We compete with all of retail for gift giving, right? So it's a whole totally different kind of game for a relatively short period of time. So we expect it to be more competitive, more promotional this year than it was a year ago.\n\nYou've heard us talk about distribution points, additional points of distribution on prestige beauty coming as we get deeper into the year. That's another consideration. Then on the operating income side, we referenced the strategic initiative expenses kind of pushing back later into the year. Some of that's due to just shortages of manpower and delay sometimes in shifting some of the hardware that we need to get some of these projects finalized.\n\nSo again, nothing to be overly concerned with, but there are some delays as there is in all parts of the world right now, it seems. So nothing unusual there. And then some of the costs, right, the increased cost, inflationary pressures we're seeing in the business. It's going to be heavier in the back half of the year than it was the first half of the year.\n\nSo all in, we think we're in a good place, and it's reasonable -- it's a reasonable estimate of the guide and what we expect for the second half of the year.\n\nKecia Steelman -- Chief Store Operations Officer\n\nAnd for new store layouts, we're really focused on our new stores and our planned remodels going forward. While we're always making changes to improving the in-store guest experience, it's been a while since we've really made any significant changes to the store layout itself. Just as a point of reference, our -- today, our merchandise is organized by price point with prestige makeup and skincare in one side of the store and mass makeup and skincare on the other, with fragrance in the middle and haircare in the back and salon. Going forward, we really want to have a merchandise layout to magnify our differentiated assortment and really better reflect how a guest really shops with consolidated categories and intuitive adjacencies.\n\nSo we're going to take mass and prestige makeup together in the front of the store with real clear brand delineation and then also reflect the growth of the category and that's important to the guests that moving skincare upfront. So the mass and prestige skincare are going to be all together, again with clear brand delineation. So you'll be able to tell the difference between mass and prestige, but it will be organized together the way the guest shops it. We're also going to elevate the front of the store to support more editorial storytelling and newness and events and recent trends.\n\nAnd then we're going to also create this new beauty bar at the center of the store that's really going to amplify the service experience and highlight the beauty attainment that is really happening on the sales floor. We're really excited to see this all come to life later yet this fall.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you. Great job on the BIPOC initiatives as well. Best regards.\n\nScott Settersten -- Chief Financial Officer\n\nThanks, Oliver.\n\nOperator\n\nThank you. And our next question comes from the line of Chris Horvers with J.P. Morgan. Please proceed with your question.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks. Good afternoon As a follow-up question, maybe for Scott, could you talk about how your thoughts on the cadence of the back half changed? It seems like your -- you originally said low single digits for the back half, it seems like you're raising the third quarter comp, but keeping 4Q intact, 3Q gets more leverage. But at the same time, it sounds like you're adding a bit more promotion in the fourth quarter and maybe more investments potentially hitting that fourth quarter as well?\n\nScott Settersten -- Chief Financial Officer\n\nChris, you don't need me to answer the question. You already figured it all out. So gold star for you today. So I mean, that's it in essence.\n\nI mean, again, we talk about guidance and estimates on every one of these calls, people have questions. I mean -- and we really do look at it right up to just before the call. And so what we've seen in the last couple of weeks with sales strength. Again, Dave mentioned this late July bounced back just like how it looked early parts of the quarter.\n\nAnd August, we've kind of continued on the same trend. So we're taken up the third quarter, in essence, for the strength there. And we're kind of being careful with the fourth quarter for the reasons we've already stated. We think promotional environment is going to be higher.\n\nAnd so just navigating that balance between the sales line and the margin investment it takes to close that. So that's exactly right.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nSince I answered my own -- since I answered my own question, maybe I can squeeze one in here. I guess maybe can you talk about how the prestige category performed in 2Q versus '19? And was that acceleration relative to what you saw in the first quarter?\n\nDave Kimbell -- President\n\nYeah. The prestige category is up versus 2019. And so we're encouraged by that. You know that prestige has been -- we talked about this had been the laggard, prestige makeup in particular.\n\nAnd now we're seeing that performance come back. Compared to 2019, it would still be -- have the kind of the lowest, I guess, performance, incremental performance over that as these other categories have been strong, like hair care and skincare really throughout the last couple of years. But yes, we're pleased with the performance. We've been working on this for a while.\n\nAs you know, the brands have continued to bring innovation and the combination of changing consumer behaviors, opening up engagement and the innovation that I talked about. And I think with -- specifically within Ulta Beauty, as we've -- our merchants have done just a tremendous job evolving our assortment to make sure we have the brands, the products, the innovation that allow us to gain share and lead in the category. So we're pleased with the overall performance and glad to see prestige performing at a high level.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks. Best of luck.\n\nOperator\n\nAnd the next question comes from the line of Mark Astrachan with Stifel. Please proceed with your question.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nYeah. Thanks, and good afternoon, everyone. Just a brief question, I think. curious about the contribution to Ultimate Rewards members from the Target relationship at year end.\n\nTarget mentioned, I think it was about $1.5 million guest co-linking accounts from their loyalty program to yours. Are those incremental kind of any learnings that you've gotten as those folks have participated in your program as well? Thank you.\n\nDave Kimbell -- President\n\nWe've mentioned in the past that there's been a large number that have linked their accounts, but we haven't shared specific details on number of new members and break out by that, and we're not planning on doing that now. But as Kecia mentioned, we're just -- we're really encouraged by what we're seeing. We're really pleased with the overall partnership. The execution has been strong.\n\nThe consumer reaction has been very positive. And the engagement in Ulta Beauty has really been a positive aspect. So our focus going forward, as I mentioned in the remarks, is to continue to drive that loyalty. That's key to our success is to engage guests in a new way to touch Ulta Beauty and ultimately get them connected to all aspects.\n\nWe're encouraged by what we're seeing, and we're focused on driving that well into the future.\n\nKiley Rawlins -- Vice President, Investor Relations\n\nHey, John, I think we have time for one more question.\n\nOperator\n\nOK. Thank you. And the next question comes from the line of Kelly Crago with Citi. Please proceed with your question.\n\nKelly Crago -- Citi -- Analyst\n\nHi there. Thanks for squeezing me in. I'm just curious, we did notice that you did sort of layer back in another sort of storewide 20% off coupon promotion more recently. And I'm just trying to understand that.\n\nI know you pulled away from it during 2021 just because the business was so strong and promotions across the board are low. But I'm just curious some of the comments you're saying about back half of the year, whether or not you're sort of seeing that tick and that's a response to an uptick in promotions across beauty. So just curious any thoughts on that and if we should kind of expect that to be layered into your promotional strategy going forward? And then secondly, on the same line of thinking, just curious with the promotional environment in some apparel categories and some other categories out there, just wondering if in the past, you've had to sort of step up promotions, even if the beauty category has been strong. Have you had to get more promotional during the holiday period in the past? Just curious on your thoughts there.\n\nThanks.\n\nDave Kimbell -- President\n\nGreat. I'm really glad you asked, Kelly. I do want to clarify, I know there's been some comments about a 20% off storewide customer base wide. That is not -- we have not executed that.\n\nWe haven't all year executed that. And that -- going back in history, we -- that was a trigger that we used frequently. And then pulling that out is core to our strategy of being more purposeful in how we're connecting with our guests. What you may have seen is more targeted.\n\nI mentioned how we've been -- you know we've been on this journey of investing in our personalization and our CRM capabilities. So we use a variety of offers, including 20% off but also points offers or newness offers or other broad communication to pinpoint and target subgroups within our typically smaller subgroups based on a specific behavior that we want to incentivize. One example might be if it's a Diamond member that hasn't shopped with us all year for several months, that guest may get a 20% off coupon, but it's only a small subset of groups. And we test and learn, and we drive, and we understand the profitability and return of doing that.\n\nSo any 20% off has not been. There was an offer just -- if some of you saw this week that came out that was 20% off, that is a comp offer and is not storewide. It is -- we have a strategy within our mass side of the business that is -- as you know, mass tends to be a bit more promotional. So if any of you saw an offer this week that was 20% off, that was not storewide that was focused on our non-prestige side of our business, and we've been doing that particular offer for many years at this time of the year.\n\nSo that's a comp event. So no incremental offers at this point. Now having said that to your second point about promotional intensity going forward. And holidays, Scott has mentioned this as well.\n\nWe are seeing promotional intensity. That's obviously no surprise to any of you on the call, you're seeing it -- you mentioned Kelly apparel, it's happening just across retail right now. We continue to be focused. And in the second quarter, we're able to decrease our promotional intensity.\n\nWe haven't layered in any big programs like I mentioned. But as we look forward, particularly going into the holiday, as Scott mentioned, the competitive set expands in gift giving to really all possible gifts, including apparel. So we're going to watch that. We are more promotional in the fourth quarter in the holiday historically.\n\nWe -- and we see that as a strategic move to be competitive and to make sure we're delivering both on the gifting and the gaming side of our business. So we're watching that carefully. And Scott mentioned, that's kind of incorporated in our guidance going forward. OK.\n\nSo with that, a great question, and thank you, all, again for your interest, and thank you for joining us today. I'll wrap up here. And I want to wrap up by again thanking the entire Ulta Beauty team for their passionate commitment to delivering on our mission, vision, and values every day. Our strong performance is the direct result of our store, DC, and corporate associates working together as one unified Ulta Beauty team to take care of our guests and to take care of each other while driving our business forward.\n\nSo we look forward to speaking to all of you again in early December when we report our third quarter results. Thanks again for joining, and I hope you all have a great evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKiley Rawlins -- Vice President, Investor Relations\n\nDave Kimbell -- President\n\nScott Settersten -- Chief Financial Officer\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOmar Saad -- Evercore ISI -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nKecia Steelman -- Chief Store Operations Officer\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nKelly Crago -- Citi -- Analyst\n\nMore ULTA analysis\n\nAll earnings call transcripts"
}