{
  "companyName": "Cedar Fair",
  "companyTicker": "FUN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/cedar-fair-fun-q3-2022-earnings-call-transcript/",
  "content": "Cedar Fair (FUN 2.10%)\nQ3 2022 Earnings Call\nNov 02, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. My name is Chris and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Cedar Fair Entertainment Company, 2022 third quarter earnings call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions] Thank you. I'll now turn it over to Cedar Fair.\n\nMichael Russell -- Corporate Director, Investor Relations\n\nThank you, Chris, and good morning to everyone. My name is Michael Russell, corporate director of investor relations for Cedar Fair. Welcome to today's earnings call to review our 2022 third quarter results ended September 25th, as well as trends we are seeing through this past Sunday, October 30. Earlier this morning, we distributed via wire service our earnings press release, a copy of which is available under the News tab of our Investors website at ir.cedarfair.com.\n\nOn the call for me this morning are Richard Zimmerman, Cedar Fair's president and CEO; and Brian Witherow, our executive vice president and CFO. Before we begin, I need to remind you the comments made during this call will include forward-looking statements within the meaning of the federal securities laws. These statements may involve risks and uncertainties that could cause actual results to differ from those described in such [Audio gap]. For a more detailed discussion of these risks, you may refer to the company's filings with the SEC.\n\nIn compliance with the SEC's Regulation FD, this webcast is being made available to the media and the general public, as well as analysts, and investors. Because the webcast is open to all constituents and prior notification has been widely and unselectively disseminated, all content on this call will be considered fully disclosed. With that, I'd like to introduce our CEO, Richard Zimmerman. Richard?\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nThank you, Michael, and good morning, everyone. Earlier this morning, we announced record results for the third quarter and for the first 10 months of 2022. As you all know, the third quarter of the year is our biggest and most important quarter, and I'm extremely proud of what our team accomplished over the last few months and since we reopened our parks. There's no better group of professionals in the business.\n\nTogether, we have quickly and effectively addressed the effects of the pandemic on our business and put Cedar Fair back on course to drive significant growth. Our strong recovery and record performance this year has allowed us to deliver on our capital allocation priorities of reducing leverage and returning capital to unitholders. Brian will provide more detail on the state of our balance sheet in just a moment, but I am extremely proud of the fact that we have already reduced net leverage back inside four times adjusted EBITDA in line with pre-pandemic levels. This morning, we also announced that the board has authorized a fourth quarter cash distribution of $0.30 per limited partner unit, which is in line with our third quarter distribution.\n\nIn addition to our quarterly cash distribution, we are returning capital unitholders through our $250 million unit repurchase program, which was initiated in August. In just a few short months, we have repurchased approximately 2.8 million units or 5% of Cedar Fair's outstanding units at an average -- at an aggregate cost of approximately 115 million. We believe that a combination of quarterly cash distribution payments and buying back units is the most effective and value-enhancing path to return capital to our unitholders in the current environment. And we will continue to execute on our capital return plans as we head into 2023.\n\nBefore I turn the call over to Brian to review our financial results in more detail, let me highlight some of the key measures that underlie our outstanding year-to-date performance. First, we set a record for third quarter net revenues, improving on last year's third quarter by 12%. Second, we established a new high in the third quarter for adjusted EBITDA, beating last year's third quarter performance by 9%. Third, our trailing 12-month adjusted EBITDA at the end of the quarter totaled 537 million, which was 6% better than the adjusted EBITDA of 505 million we delivered in fiscal 2019.\n\nFourth, preliminary net revenues year to date through October 30th were 1.86 -- 1.68 billion, a record for the 10-month period despite attendance remaining below historical levels. And finally, trends in our long lead indicators through October, including our season past products, reservation at our resort properties, and group bookings look solid heading into next year. Looking at more recent results. Our Halloween and fall events, which kicked off in mid-September, once again have produced some of our most profitable days of the season.\n\nDespite ongoing economic uncertainty and mounting financial pressures on consumers. During the month of October. Revenues were up approximately 4% to October of last year, driven by higher attendance and continued growth in out-of-park revenues. In-park per capita spending during the month remained in line with October of last year despite a sizable increase in our season pass mix this year.\n\nThe strength of our recent results and our excellent top-line performance through the first 10 months of the year sets the stage for us to deliver the best year in the company's history. Most importantly, our year-to-date results demonstrate our ability to generate record revenues despite attendance remaining below pre-pandemic levels. As we've previously noted, demand levels this year have been impacted by a number of factors, including the anticipated slower recovery of our group channel and inclement weather during key periods of the summer season. Helping offset our demand levels has been the solid trends in guest spending inside our parks as well as at our resorts and adjacent properties.\n\nGuest spending on food and beverage has again led the way, validating the significant investments we've made this year and over the past several years to expand and enhance our in-park offerings. Although price increases have played a part in delivering per cap growth, higher guest spending reflects the success of our investments to deliver higher quality offerings in a more efficient manner, driving increases in transaction counts and average transaction values. With more room for improvement, we will continue to invest behind our F&B strategy in the future. The results from our resort properties, which we consider a differentiator of our business model from others, have also helped offset the demand headwinds.\n\nOur hotels, cottages, and campgrounds quietly generate steady and reliable cash flow, and they play a valuable role in the ecosystem of our parks. Our resort properties extend the stay of our guests to multiple days, create flexibility for our guests to visit our parks multiple times, and represent a sticky demand channel for attendance. We are extremely pleased with the early guest response from our recently completed resort renovations and believe the renovations currently underway at the Knott's Berry Farm Hotel will be a game changer for that property as well. In spite of the pressures on demand we've dealt with this year, we remain true to our revenue and yield management approach, maintaining the integrity of our pricing structures.\n\nLooking ahead, we are optimistic that we can recover a meaningful portion of the shortfall to historical attendance levels as early as next season, led in part by the improving momentum we are seeing around group bookings. With that, I would like to turn the call over to Brian to review our financial results in more detail. Brian?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nThanks, Richard, and good morning, everyone. I'll start by discussing our third quarter operating results compared to last year's third quarter before providing an overview of preliminary year-to-date results through October 30th. I'll wrap up my remarks with an update on our balance sheet and free cash flow outlook. During the quarter, our parks had 1,088 total operating days, compared with 988 operating days in the third quarter of 2021.\n\nThe increase in operating days reflects the impact of the pandemic on last year's operations and the benefit of a return to a normal operating calendar in 2022. As Richard mentioned at the beginning of the call, we delivered an outstanding quarter with meaningful year-over-year increases across our key performance metrics. In the third quarter, we entertained 12.3 million guests and generated record net revenues of $843 million, representing a 12% or $90 million increase compared to the third quarter of 2021. The increase in net revenues was largely attributable to the 100 incremental operating days in the period which contributed to a 1.5 million visit gain in attendance and a 17% or $14 million increase in out-of-park revenues.\n\nThe increase in out-of-park revenues reflects incremental third quarter results at Castaway Bay and Sawmill Creek Resort, two properties that were closed for renovations during the third quarter last year, as well as higher occupancy rates and higher ADRs across the majority of our resort portfolio. As we noted on our last call, the continued strong performance of our resort properties validates the investments we made in recent years to refresh and expand that side of our business. Meanwhile, in-park per capita spending in the quarter totaled $62.62, down 3% compared with the third quarter last year. The decline in per capita in the period was due primarily to lower levels of guest spending on extra charge products and admissions.\n\nThe lower spend on extra charge products was largely the result of lower average daily attendance at several key parts while the slight decline in admissions per cap can be attributed to a higher season pass mix in 2022. Year-to-date season pass attendance represents 58% of our total attendance mix. By comparison, season pass visitation represented 55% of 2021 full year attendance and 51% of 2019 attendance. Offsetting the small pullback in guests spending on extra charge attractions and admissions was continued strength in guest spending within our retail channels, something that was a focus for our park teams coming into the season.\n\nIn the quarter, combined per capita spending on food and beverage, merchandise, and games increased to $22.28, up 2% from last year and up 31% from pre-pandemic levels. The improved per capita levels were driven by increases in transaction counts and average value per transaction and reflects the stickiness of guest spending from year to year. Moving on to the cost front, operating costs and expenses in the third quarter totaled 485 million, compared with 424 million for the third quarter of 2021. The $61 million increase was the result of a $14 million increase of cost of goods sold, a $50 million increase in operating costs and a $3 million decrease in SG&A expense.\n\nIncreases in cost of goods sold reflects higher sales in the quarter, as well as the impact of rising product costs. Despite these cost pressures, cost of goods sold as a percentage of food, merch, and games revenue only increased 150 basis points from the third quarter last year. The increase in operating costs was largely attributable to the 100 incremental operating days in the current period and the related impact on variable cost, including operating supplies and seasonal labor. Based on -- based primarily on the expanded operating calendar, our parks had approximately 1 million more seasonal labor hours in the current period compared to the third quarter last year, accounting for more than 35% of the increase in operating costs.\n\nAlso contributing to the increase in operating costs were higher full time wages related to planned increase in headcount at select parks, higher maintenance, labor rates, and incremental land lease and property tax costs associated with the sale leaseback of the land in California's Great America. The decline in third quarter SG&A expense reflects a decrease in wages, including incentive plan expense, offset by an increase in transaction and credit card fees. These higher fees were driven in part by this year's conversion of all of our properties to cashless, an initiative that has been received very well by our guests and is helping us take labor hours out of the system. Looking a little more deeply at labor costs, while the labor markets this year remain challenging, we are very pleased with the progress we've made around improving our staffing levels and controlling costs.\n\nDuring the quarter, we maintained adequate staffing levels while managing our average seasonal labor rate down 2% from the third quarter last year. And year to date, our average seasonal labor rate remains essentially flat to last year, reflecting the success of our revamped seasonal pay structure implemented for the 2022 season. While there is still more to do, we are extremely pleased with our ability to flatten the growth curve around labor rates, particularly given seasonal labor represents our single largest operating cost. Adjusted EBITDA, which management believes is a meaningful measure of the company's park level operating results, increased $29 million in third quarter to a record 362 million, compared to 333 million for the third quarter of 2021.\n\nThe increase reflects the impact to our incremental operating days in the current quarter and the continued strength in guest spending, offset in part by higher operating costs, particularly for labor and cost of goods sold. Shifting focus to our preliminary results for the month of October and operating trends for the first 10 months of the year, over the past five weeks, our parks entertained a record 3.2 million guests and generated $227 million of net revenues. Based on preliminary results for the five-week period, which had 177 total operating days, the in-park per capita spending was $64.91, and out-of-park revenues totaled a record $21 million. For the comparable five-week period in 2021, which had 176 operating days, net revenues totaled 219 million on total attendance of 3.2 million guests, in-park per capita spending of $64.97 and out-of-park revenues of $19 million.\n\nCompared to October of 2019 demand levels, October attendance this year was up 11%, or approximately 318,000 visits, underscoring the growing demand of our fall events offerings and the benefit of Halloween falling on or near a weekend. Based on these preliminary October results, through the first ten months of the year, we've entertained 24.9 million guests and generated 1.68 billion in net revenues, representing an increase of 22% or 306 million compared to the first 10 months of 2019. Over this same period, in-park per capita spending was $61.72, up 27% from 2019 levels, and out-of-park revenues totaled 195 million, up 40 million or 26% from the same period in 2019. For reference, operating days for the first 10 months of 2022 and 2029 -- 2019 totaled 2,103 days and 2,028 days, respectively.\n\nAs park calendars currently stand, we project that in November and December we will have a total of six incremental operating days compared to last year and 17 additional days compared to November and December of 2019, driven in large part by our efforts to expand the operating calendar in select markets. These additional operating days are projected to be modestly profitable, but more importantly, provide us with incremental opportunities to sell season passes and other advanced purchase commitment products for the 2023 season. Now, turning to our balance sheet, our deferred revenue balance at the end of the third quarter totaled 188 million. This compares to 211 million at the end of the third quarter last year, which included approximately $30 million of COVID-related product extensions at Knott's Berry Farm and Canada's Wonderland into 2022.\n\nExcluding the extensions in the prior year quarter, deferred revenues would have been up approximately $7 million or 4% year over year, including results from early fall sales of 2023 season passes and related all-season products. Compared to September of 2019, third quarter deferred revenues are up 26% or $39 million. With 70% of the season pass sales cycle remaining, including the spring window that accounts for more than 40% of our full program sales, we remain laser focused on driving unit sales higher and matching the record performance of our 2022 season pass program. As Richard mentioned, we have a strong balance sheet position, which we expect to continue to prove as we deliver on our strategic initiatives.\n\nAs of September 25, 2022, Cedar Fair's total available liquidity was $568 million, including 288 million of cash and cash equivalents and 280 million available under our revolving credit facility, which is undrawn. This compares to $319 million of total liquidity at the end of the second quarter of 2022. During the first nine months of the year, cash flow from operations totaled $412 million, besting our comparable 2019 performance by $23 million or 6%. During the nine-month period, we also generated $310 million in the sale leaseback of the land at our Great America Park in Santa Clara, California.\n\nThrough the first nine months of the year, we use $264 million to fully repay the company's term loan, bringing total debt outstanding down to 2.3 billion and net leverage back to pre-pandemic levels at 3.7 times, trailing 12-month adjusted EBITDA at the end of the quarter. During the nine-month period, we used another $17 million to pay cash distributions to our unitholders and $64 million to repurchase units under the unit repurchase program. Regarding capital investments, through the first nine months of the year, we spent $138 million on capex, including investments in new rides and attractions, upgraded and expanded F&B facilities and renovations to several of our resort properties. For the full year, we now anticipate investing approximately 170mil to $180 million on capex.\n\nBy comparison, we're projecting investing 180 million to 200 million on capital projects for the upcoming 2023 season. Lastly, for modeling purposes for the full year 2022, we are projecting cash interest payments of 145 million to $150 million and cash taxes of 40 million to 50 million. With that, I'd like to turn the call back to Richard to share some final thoughts.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nThanks, Brian. While we are extremely pleased with our performance year to date, we are just as excited about the remainder of 2022 and the compelling opportunity that we have to build on our momentum in the coming year. In the weeks ahead, a number of our parks and resort properties will be transforming themselves into winter wonderland and hosting holiday events. These immersive season ending holiday events have proven to be extremely popular with everyone from grandkids to grandparents while offering our loyal season passholders another compelling reason to visit the parks.\n\nWe believe the success of our fourth quarter events, which now account for more than 15% of our annual attendance, is a catalyst for expanding our appeal, as well as the steady growth of our season pass sales program. To ensure our parks remain a top entertainment choice among consumers, We continually improve the quality and breadth of our offerings and enhance our guest experience. That is why we continue to invest a significant amount of our free cash flow back into our properties each year, creating a powerful economic life cycle that benefits our guests, our associates, and our park communities and ultimately drives sustainable growth and value creation for our unitholders. The guest-focused strategies we have in place are producing record results, none more effective than our expanding season pass program offer [Audio gap].\n\nWe are also generating excellent returns from the capital we have invested to improve the quality and scale of our food and beverage offerings. Food and beverage is a top priority for our guests and we are focused on continuing to invest in our capabilities to improve and grow our offerings. For 2023, we are investing in marketable new attractions at five -- at our five largest parks and seven parks overall. These include large scale updates to major sections of our parks and will include the addition of new coasters and the rebirth of iconic rides from the past.\n\nWe are also investing in new high capacity dining facilities, major events to support two 50-year anniversary celebrations and a number of other additions designed to delight our guests. Our marketing team does a great job of creating excitement and urgency around the introduction of new attractions, which historically lift attendance and guest spending and increased season pass sales. On the other side of the coin, we remain committed to optimizing our cost structure and getting back to 2019 margin levels as we get deeper into the recovery. A return to pre-pandemic attendance levels, along with moderating the cost pressures we've experienced over the past few years, will be critical to achieving our margin goals.\n\nComing into the 2022 season, we felt that the fastest and most effective way to facilitate our recovery of the business was to drive attendance and top line revenue by staying connected with our guests and maintaining the quality of the guest experience. This included ensuring our rides, attractions, and retail centers were appropriately staff for the level of demand they generated throughout the season. As expected, this approach led to an increase in seasonal labor hours compared to last year. We helped somewhat offset the impact of higher labor hours by managing our average seasonal labor rate to essentially flat between the years, something I'm extremely proud of in today's market and something that I believe we can build on going forward.\n\nAlthough the macroeconomic environment remains unclear, what drives our optimism for 2023 is solid momentum once again in our season pass programs, an extremely compelling lineup of new marketable attractions planned for next season. Early signs of recovery in our group channel and ongoing strength in guest spending, driven by guest experience we believe is second to none. Should economic headwinds increase heading into next season, our team is prepared to take the necessary measures to respond quickly and appropriately. Finally, I want to take this opportunity to welcome our two new directors, Michelle McKinney Frymire and Jennifer Mason to our board.\n\nMichelle and Jennifer bring to Cedar Fair more than 40 years of executive leadership and senior management experience in the travel, leisure, and hospitality industries. Our board prides itself on best-in-class governance and regularly and actively refreshes its composition with the addition of outstanding new directors like Michelle and Jennifer. They each bring a great fresh perspective to the board that will only strengthen our ability to drive future growth and create value for our unitholders. Chris, that's the end of our prepared remarks.\n\nPlease open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question is from James Hardiman with Citigroup. Your line is open.\n\nJames Hardiman -- Citi -- Analyst\n\nHey, good morning. Thanks for taking my questions here. So a lot of data, a lot of math to sort of sift through here. But basically, since your Labor Day release, it looks like we saw a pretty material deceleration in September, ultimately through the end of the third quarter and then a pretty significant reacceleration in the month of October.\n\nI guess a sort of verify or dispel that just broad narrative and be any wiser as to why you think that's happening.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nJames, great question. I think we would say exactly what you just said, which is September was a tough month in part because of the weather that impacted us in the early part of the month. But I think what we've seen in October is our markets respond to the quality of our Halloween event. We know that with our season pass sales up 20% this year, there were a lot of folks out there that were itching to come.\n\nThe weather was really good in October, but the appeal of our events really carried through. And we saw that through all of our channels, demand group and season pass. Every year we look at October and go, it's been another great October. I think it speaks to the appeal of the product, not just the holiday, but the appeal of the product culturally that people look forward to holidays.\n\nBut overall, we continue to see a strengthening of demand in the fall, and that seems to be an ongoing, almost multi-decade trend.\n\nJames Hardiman -- Citi -- Analyst\n\nMakes sense. And then let's talk about cost for a little bit here. Significant amount of operating expense deleveraged here. I think by my math, that line is up 42% versus 2019.\n\nI guess maybe, I mean, just given that that is so much more than revenues are growing, I don't know if there's a way to do sort of a bridge. I know you now have an incremental lease that is adding to some of your cost, I think, in that line. Obviously, the operating days were up as well, but I'm struggling to sort of bridge the gap in that number, particularly when it sounds like you guys have done a good job in sort of staving off labor increases or at least the wage rate increases.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nJames, I'll let Brian weigh in here. But overall, listen, we've tried to be as transparent as possible as we went through the pandemic about what we thought the effects were. See, labor's our single biggest line and we've been very transparent about what we needed to do in each of our regional markets to be able to get the staff we needed to run our parks and get the experience. When I look back on where we are year to date through the third quarter, we're down approximately a million seasonal hours to 2019.\n\nSo we have focused on efficiencies, but we've also focused on driving the revenue. But when your single, largest line item is going up by a significant percentage, that's the challenge. We think we can work that out over time and get back to pre-pandemic margin levels, but that takes time and it certainly takes a recovery to 2019 attendance levels. Brian?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nYeah, just adding on, James, to Richard's comment. I think the efforts to take hours out of the system are certainly producing. There's more opportunity there to optimize some of those workforce management tools, being able to flatten that growth rate around seasonal labor for the full year, as Richard noted, down slightly in the third quarter is certainly helping. But to your point, there is there's pressure the other way, by the incremental days that are in the system.\n\nAnd then when you look at it versus last year, the recovery of some of the attendance and the variable related cost. But when we look at it overall, I think, you hit on it. Labor is the largest single cost item and it would represent probably more than two-thirds of that increase that you're seeing in the third quarter versus where we were in '19. And that's primarily rate.\n\nWe'll continue to focus on it, as Richard noted. I think there's opportunities, given the momentum we've established more recently, but there's more work to be done.\n\nJames Hardiman -- Citi -- Analyst\n\nAnd let me maybe ask the question a slightly different way. I mean, that line seems to be growing faster than revenues. And so to turn around margins, right, we need to get that line to grow. At least start by getting those two things to grow at a commensurate rate.\n\nAny thoughts on when that might happen? Is there sort of an opportunity to get back on par so it's at least not a big deleverage item?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nYeah. I think as Richard noted in his prepared remarks, I mean, the focus is to get back to those pre-pandemic margin levels. One of the key factors that will assist in accomplishing that is getting back to those pre-pandemic attendance levels, right. We talked about group remaining disrupted.\n\nThat certainly puts more pressure on margins earlier in the season, still somewhat in the third quarter as well. But as we talked about in prior calls, youth and school groups being lost in the spring is a big headwind when it comes to margin. So I think recovering volume, and we feel very good about that. The trends we're seeing in that area as we wrap up 2022 and head into '23, particularly around youth and school.\n\nAnd so I think that's the first step. And then the second piece is we've already started to show some wins in this area. It's flattening out and starting to decelerate that growth, around the labor rate. More of that was accomplished here recently.\n\nI think we'll have to have the benefit of that now for a full season as we roll into 2023 and there's -- and we feel very good about the other the top line metrics. We're seeing gas spend in the park, as I noted my prepared remarks, up 20-plus percent to -- 30-plus percent, I'm sorry, to 2019 levels and 2% still to last year. Some of the emissions per cap pressure we're seeing is really more mix driven, and not a reflection of the consumer pulling back. Just really more of a reflection of season pass growth.\n\nSo I think we think that things are aligned to start seeing that margin expansion. It's just going to take -- it takes more time.\n\nJames Hardiman -- Citi -- Analyst\n\nGot it. Thanks, Brian. Thanks, Richard.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nThanks, James.\n\nOperator\n\nThe next question is from Steve Wieczynski with Stifel. Your line is open.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nHey, guys. Good morning. So Brian or Rich, want to go back to the in-park. You just made some comments about the in-park spend levels, which were down year over year.\n\nAnd it's really one of the first times we've heard of any kind of slowdown in spend levels across multiple consumer verticals that we look at. So is there anything you can help us think about as to maybe what drove that slowdown? And look, I understand you just called out lower spend levels and extra charge products and some negative headwinds from a higher season pass mix. But I guess the question is if you look at the average person, Joe Schmo coming in, are they still spending more as they come in the park versus what they -- where they were last year?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nYes, Steve. It's Brian. I'll reiterate what I said to James' question. When I -- when we split it apart and we look at those peer in-park areas where we take math, a big piece of the math out that season pass represents, right, that impacts admissions more than it affects those in-park spend areas.\n\nWe're still seeing the stickiness and growth, as I noted, up 2% from third quarter of last year when we look at just food and beverage, merch, games. That's transaction count improvement, that's higher average value per transaction. The one in-park area that saw a little bit of pressure was extra charge. Overall, revenues are up based on pricing.\n\nBut given that we're not at a high peak attendance days, particularly in the summer, more July, August at some of our big parks. That's a reflection of some of the disconnect of groups. It's also a reflection of us moving gas off of some of those busier days through our dynamic pricing techniques. That definitely takes -- took some of the demand for fast lane, as an example, down a little bit.\n\nBut overall revenues still up in that as we price more into it. So the one area that we've seen the most pressure is more mathematical or accounting and that's admissions, and that again ties back toward more, more toward that mix. As we noted, we're pushing close to 60% of our attendance coming from season pass this year versus mid-55, 56 range last year.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Gotcha. Thanks for that, Brian. And then second question is you keep talking about trying to get back to those pre-pandemic attendance levels, which I think was around 20 million, 28 million.\n\nI guess as we kind of think about the 2022 winding down at this point, how should we think about '23? And I'm not sure how you really want to take this question, but is it possible to get back to those levels in '23? I mean, I think that would kind of infer, let's call it, a 3.5% to 4% kind of growth rate in terms of attendance. Is that too quick or is and is this more of a '24 type story or is that still a potential in '23?\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nSteve, when I think about what we saw this year, a 20% increase from 2.6 million season pass to 3.2 million, we had more of our loyal customers step up to buying our most expensive ticket, if you think about it as a ticket -- the highest priced ticket. I think that bodes well as we look forward in terms of our ability to mine more out of our existing customer base. We've been transparent from the beginning on the group channel what we thought it would take. You go back to '08, '09, it took a full three years to get back to, to similar levels.\n\nWe see that kind of recovery happening now. I'm really excited. By the way, the phones are ringing, as Brian said, as we in particular look at the big chunk we get back in the spring or early summer, which is the youth and school groups. So I think that combined with one of our strategies and our look at the world coming into it, it's tough to go back 12 months and say, what were we thinking as we went into 2022, but when we looked at this, we felt there'd be pent up demand.\n\nWe've seen that across the board and certainly have seen that up in Canada this year. But we did -- we invested heavily in food and beverage to drive that in-park spend. We thought we could have the demand we needed within the channels. I think the season pass, 20% up shows that.\n\nBut as we look at next year, now we're back to our more traditional approach, which is we're going to have something new in seven different -- in seven of our parks to go talk about. I think it's probably the deepest and most complete product lineup I've seen us have over the course of -- since I've been doing this. I think we have what we need in terms of our marketing folks to go out there and drive demand. So all of that factors into how I kind of look at next year.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Gotcha. Richard, Brian, thank you so much for your comments.\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nThanks, Steve.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nThanks, Steve.\n\nOperator\n\nThe next question is from Chris Woronka with Deutsche Bank. Your line is open.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nHey, guys. Good morning. Thanks for taking the question. I'm going to try to come at the, I guess, the margin question one different way, which is I think you're back to 93% or so of 2019 attendance in the third quarter of '22.\n\nIf you get back to 100 next year, is there -- how much incremental labor you really need to get that, right? The question -- I guess the question or the observation would be, yeah, are you kind of -- with the higher fixed cost base when the parks are open, is there a lot of incremental labor hours that need to come in to make up that final 7% of attendance?\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nChris, when we think about the business model we have -- it's a fair question, I think, a really good question. The incremental attendance on any given day really doesn't drive a lot of extra costs. So every time we drive higher attendance on different days, we really -- that those are our high margin days. Go to October, we just talked about being some of our most profitable days.\n\nThat's really true. So I think the more we can drive back that 7%, the more likely we're going to push deeper into the higher margins. But what I'll also tell you and this is what Brian always says, where we get the growth from sometimes determines the impact on margin, which parks are doing well. And I'll even go to something like our Canadian Park, which is kind of our park in Toronto, Canada, is one of them having a phenomenal year.\n\nBut because the dollar has weakened, that's probably taken our estimate about 50%, 50 basis points off of our consolidated margin because that's not flowing through. So there's a lot of things that impact that. But it's fair question.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nOK. Thanks for that. And then I guess secondly, I know we're not we're not really talking about 2023 yet, but how much confidence do you have based on what you've seen to date in '22 to the kind of move pricing up further, whether it's on certain ticket plans or whether it's on some of the food and merchandise? Do you feel confident if you had to make that decision today that you could take additional price for next season?\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nChris, as I look at our approach, it's always been to take price every year and dynamically price. The early indicator for me would be season pass and we've on average targeted a high single low double digit increase in our pricing. Now, mix will impact what comes through, which far sell, but we think there's an opportunity to always move price. But I also firmly believe when you take price every year, you're sort of training the market and they expect it.\n\nSo our approach is always in dynamic pricing, lean into demand. We -- you always hear me talk about price of value. Our guest got great value this year. That gives us an opportunity to continue to take price.\n\nI'll answer your question a different way, Chris, which is if I go back and look what we saw '08 into '09, the health of the consumer back then, we saw hotel booking dropping -- drop, we're not seeing that. We saw season pass soften considerably, we're not seeing that. And group dried up on us, both corporate and school. We're not seeing that.\n\nSchools are calling us and the phone's ringing. So the things I would be looking at, to answer your question, I don't see them right now. So I'm really confident that we can continue to try and take our approach where we try and both get recover volume with good price.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nOK. Very helpful. Thanks, guys.\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nThanks, Chris.\n\nOperator\n\nThe next question is from Mike Swartz with Truist Securities. Your line is open.\n\nMike Swartz -- Truist Securities -- Analyst\n\nHey, good morning, guys. Maybe just a question on your plans for marketing in '23 and maybe how they differ versus how you've marketed historically. And then look at the -- it sounds like season pass visitation is probably higher than it was pre-pandemic. Group, obviously, we know it's starting to come back, but that single day visitor, is there anything you're planning to do differently to drive those attendance levels back in '23 and beyond?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nYeah, Mike. It's Brian. As we look at where marketing has pivoted or changed over the last couple of years and we've talked about some prior calls shifting during the pandemic out of necessity, away from traditional media more heavily into digital, and as Richard just mentioned a moment ago, we thought coming into this year there was going to be a lot of pent-up consumer demand. And so we were pretty aggressive with paring back our advertising dollars and mining some savings there and trying to ride that pent-up demand wave.\n\nAs we look at 2023, and Richard highlighted what's going to be a very strong, capital program big new attractions going in our five largest parks and seven, eight parks overall, we want to lean into that and make sure that we're not pennywise, dollar foolish on the advertising side. So I think as we look toward '23, we may accelerate some spending around that capital program. I don't think it's going to be material enough and we believe that the returns are there to warrant it. But it will be still a somewhat similar approach, heavy on digital because of the efficiencies, cost wise, but also the flexibility of that, but also getting a little bit back more into mainstream media as we lean into that capital program.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nMike, as we think about marketing, I had Kelly Ford, our CMO, and I were discussing yesterday, we're so excited about the digital shift because as she would tell you, we need to be where the customers are, not where they've been. They're not watching linear TV anymore. We've got to be out there where they are and we're trying to be look forward and invest where we we think we can get them, not just mine the efficiency, but get the most impact.\n\nMike Swartz -- Truist Securities -- Analyst\n\nOK. Perfect. That's helpful. And then just maybe on I think you said season pass sales, if I heard that correctly, were up 20%.\n\nApologize if I missed it. But was that versus '21 or --\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nYeah. I'm sorry. That's full year 2022 versus last year? 2-point -- 3.2 million for full year 2022 versus 2.6 million in '21.\n\nMike Swartz -- Truist Securities -- Analyst\n\nOK. Perfect. That's what I was looking for. Thank you.\n\nOperator\n\nThe next question is from Ben Chaiken with Credit Suisse. Your line is open.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, how's it going?\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nBen.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, good morning. Hey, just going back to cost briefly. Your 3Q flow-through was, I think around 5% now, now it's falling 10% in 2Q. Regardless of how you look at trends, rev is up.\n\nRevenue is up materially and it's not necessarily translating to EBITDA. I guess as you reflect on your business in '22 season to date, do you think you made the right moves on labor hours and rate and/or operating days, or would you change anything?\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nFair question. And certainly we always, Ben, we always look at how we approach the year and what lessons can we learn and what can we mine out of our experience. If you go back to and again, we've been transparent with our interim updates. We took a number of days out of the calendar early on.\n\nWe weren't sure what demand was going to look like in the spring time and we had some challenges on the staffing front. As I look at it and as we think about next year, we want to make sure that we're giving our selves a chance to drive as much revenue as possible. And when we think about how to mine that most effectively, as I said, through year to date, through the end of the third quarter, we've taken over a million hours out. We want to make sure that we're more fine tuning that approach and giving us the ability to drive deeper and recover our margin, continue to drive the revenue, get far more efficient, and I touched on that with Chris's call.\n\nBut as we look forward, I think there's some things that we'll look at. Brian talked about our ability to invest a little bit more in marketing to make sure we're capturing both the demand for one-day tickets, but also make sure we are optimizing those price breaks that are so critical for us for season pass. Brian, anything you want to add?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean, just reiterate, Ben, as we came into this year, the focus was on recovering, volume and driving gas spend. As we said in the prepared remarks, critical that we have all of our revenue centers and our attractions adequately staffed to the expected demand levels. And on a day-by-day basis.\n\nThere were, as Richard noted, times early in the year that we weren't able to open several of our parks because of shortage of staff, more of a shoulder season issue when students weren't out of school yet and we felt that we wouldn't be able to deliver the right guest experience. We unplugged those operating days in a few markets, saved some operating costs. But I think to Richard's point, we hurt ourselves on the revenue line item. So I think we can always get smarter and there's always more upside on the cost side of things and more efficiencies to be gathered.\n\nAs I noted, I think the progress we made around the labor rate structure was huge, probably seeing more benefit of that in Q3 than we did in the first half of the year, and that's going to translate into 2023. But I think you as we look at where -- what we did in 2022, we delivered on what we intend to do, which was to achieve record revenues and record adjusted EBITDA. And we'll get better at margin and optimization of those revenue dollars as we roll forward.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nGotcha. And so just to make sure I'm kind of interpreting -- first of all, that's all super helpful color. I appreciate it. And then just to make sure that I'm interpreting your comments correctly, it sounds like the getting back to '19 margin will be a function of kind of like operating leverage on incremental growth, because it sounds like you guys are talking about like maybe some marketing dollars coming in and driving incremental revenue.\n\nSo the point -- the way that we should be thinking about it is operating leverage on incremental revenues rather than necessarily like absolute costs coming down. Is that fair?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nI'd say it's more heavily skewed toward what you just described. There are definitely some places where we're going to look to mine some more cost efficiencies. And then back to Richard's point, ultimately that yeah, that 2019 margin level and Chris -- Chris' question about if we get back to those attendance levels, can you get to that margin level, part of it's going to depend on the performance, right? I mean, Canada's Wonderland's had a fantastic year, a record performance year for that park coming out of the pandemic. But unfortunately, when we bring that back over to U.S.\n\ndollars, the FX is hurting us, as Richard noted, to the tune of maybe 50, 60 basis points of margin.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nBen, the other thing that I'll jump back to, when we went into the pandemic, a lot of question marks. We issued a billion dollar bond in April of 2020 to make sure we had adequate liquidity. Yeah, you look at what we've done on the capital structure, paying down 90 -- more than 90% of the debt that we incurred to survive the pandemic can get us through the reinstitution of the distribution. Getting down to that 3.7.\n\nI'm really pleased with the rapid recovery, if I could put it that way and I'm really pleased with what we've been able to do with the free cash flow to set the foundation on the capital allocation side for how we create some -- create even more value for our unitholders. And I don't want to step over that because I think the impact of that rapid recovery has really let us get healthy very quickly and that's going to let us drive growth in the future.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nMakes sense. I appreciate it. Thank you.\n\nOperator\n\n[Operator instructions] The next question is from Eric Wold with B. Riley Securities. Your line is open.\n\nEric Wold -- B. Riley Financial -- Analyst\n\nThank you. Good morning, guys. Couple of questions, kind of, somewhat follow up, and a bit on these too much. I guess, one, you talked about obviously the amount of season pass contribution to total attendance well above last year, well above '19.\n\nIs this something you're seeing kind of the demographics coming in the park, given kind of the economy where now you're seeing single day passes getting impacted because of the maybe the lower income consumer that normally wouldn't buy a season pass is going to be impacted there. But you could hold up in-park spending at these elevated levels because that consumer is still there? Is there a read into that or is that looking at it the wrong way from your point of view?\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nNo, what I would say, Eric, good morning. It's Richard and great question. What I would say is when you think about season pass, what we think we saw this year is as we got more into dynamic pricing and priced -- and took the price of our demand tickets on the web up, the gap between the demand ticket and the season pass, we had more people look at that gap and go, let me trade up. So what we're seeing is a trade up to our highest ticket that helped drive the 20% increase in season pass that I referenced earlier.\n\nOnce they get in the park, we continue to sell more all-season dining, more all-season beverage. We're seeing people bundle together a full year's worth of experience in our parks. And then once they come to the park and we track their spending, they spend on other things as well. So people trading up from a one-day ticket to a season pass is always good for our business.\n\nThe question we always get is there an optimal limit? No. We'd like to sell as many season passes as we can because once they come, they keep they keep enjoying the benefit of the park. And even in terms of what we're seeing now, we continue to see an increase in all-season dining. We're up year over year on our -- as we look at that line item for the 2023 passes.\n\nSo they see value there, they come to the park and then once they're to the park, they want to enjoy the visit, where if you go all the way back to '08, '09 and the staycation, people stay close to home. They still want to treat themselves well. And when they come to our parks, they want to indulge themselves a little bit, and that's what we see.\n\nEric Wold -- B. Riley Financial -- Analyst\n\nOK. Got it. And then just another one on labor about it. I mean, you made that decision to staff up early and have you to drive attendance and guest experience in spending the parks and I get all that I get you taking some labor hours out to [Inaudible] maybe there's room there, but you kind of walk through the goal of kind of closing the gap in attendance to leverage the current spend levels.\n\nI guess, what are your early thoughts on what hourly wage pressures may look like next year? And kind of how will you compete maybe against -- I know you kind of paid up early in this cycle to get people in the parks. How are you going to compete, as you think about next year in a way that labor pressure may look like on the hourly wage side?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nYeah, Eric. It's Brian. I think when we look at labor for next year, broad comment, the availability and affordability challenges aren't going away. We believe those are largely structural.\n\nThat said, there have been some tailwinds this year that we've leaned into and benefited from, right? The return of the J-1 visa program brought more international students over at our parks. That was extremely helpful. Our ability to, as I mentioned on the call, sort of put in place a more pay program and a scale more aligned with where we've been in the past. Not everybody at that max level, right? So we'll pay up for certain jobs, we'll pay up for seniority and experience, but the newer, first year associates that come in, or maybe those J-1 visa students are only here for a short period in the summer, we'll keep them at the lower end.\n\nAnd so we still, in each of our markets want to remain the market setter and be the first choice for folks seeking a job during the summer season. And so that's not going to change. But I think leaning into that structure that we did this year, continuing to benefit from some of those same tailwind factors will allow us to offset, significant pressure. I think we'll see if we have to pay up in some markets will pay up because what we do know is if we're not staffed appropriately, we're losing revenue.\n\nAnd I think that's the that's the key message that we want to make sure we deliver. And we saw it play out this year. In some of our markets when staffing was more challenged, our per cap were challenged. When staffing was adequate or at its right level, we were delivering our best per caps on those days.\n\nSo it's critical that we maintain those adequate staffing levels and that'll be the focus.\n\nEric Wold -- B. Riley Financial -- Analyst\n\nPerfect. Thank you both.\n\nOperator\n\nThe next question is from Barton Crockett with Rosenblatt Securities. Your line is open.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nHi. One thing I was wondering about was the October trend, how reasonable it is to think about that as a baseline for what could happen in the other holiday period here at the end of the year in December? And sort of talk about puts and takes around the reasonableness of extrapolating that trend through the balance of the quarter.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nBarton, Richard. Good question. When I think about the appeal of the holiday events, they follow a different time of year. Halloween sort of leads into November, and not all of our Winter Fest events open up right away, but they do open up shortly thereafter.\n\nSo what we've seen is there is such a thing as momentum. When we're top of mind and people visit it and they go home and tell their friends about their visit, it keeps us in the considerations set. So we've always seen that good momentum leads to better next year performance. We've always seen strong spring performance when we have a strong fall.\n\nSo I think it's a really good sign. I think it gives us great momentum. We're starting to see some markets pick up. I anticipate that Canada in particular, which had a great opening winter fest in 2019, given the strength we've seen there all year long and their recent trends, I think they'll have a phenomenal winter fest.\n\nSo I do think with our always normal weather caveat, if it rains, it's tough to get people come out. But with reasonable weather, I anticipate that the momentum we've seen in October is -- sort of sets the table and positions us for a successful winter fest, Knott's Berry Farm season once again.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. That's helpful. And I wanted to step back a little bit on the macro view because you guys are in an interesting position, right? You get you see where the consumer's appetite is and willingness to spend their pricing sensitivity. Also buy a lot of things.\n\nYou pay a lot on labor, you buy a lot of products, you have a capex cycle that'll be buying a lot of commodities, maybe some steel. And we have a Fed right now that's bound and determined to keep raising interest rates until they end this inflationary spiral. And there's a lot of speculation about whether that has to be kind of a wage, cost, spend, kind of cycle that has to be ended. And what I hear from you guys is a lot of sense of strength from the consumer, maybe some easing of some cost pressures.\n\nAnd I'm just wondering how you kind of put that into what you believe is happening macrowise based on your view of the world and how that kind of informs how you think about what the most likely macro setup is as we navigate through next year.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nI'll go back to as we went through the pandemic, we said pre-pandemic that experiences consumers were prioritizing experiences over possessions. Clearly, that wasn't the case during the pandemic. During the heart of it, they prioritized possessions and were buying goods, everything that we're seen as being collaborated by those that I talked to within the broader leisure hospitality world. Hotels are doing good.\n\nYou're continuing to see strong interest in all the different sectors of the leisure and hospitality sector. I think we're back to consumers prioritizing experiences over possessions, whether that's pent-up demand, revenge spending, all those things we've talked about. Experiences are what consumers in the U.S. and in Canada are looking for.\n\nAnd they'll pay up to go get the experiences that they want, particularly after being through the depths of the pandemic, however, it impacted everybody. I do think from broad front, consumers continue to be in pretty good, pretty good shape, even though the lower end is getting increasingly pressured. And our broad macro view is that we think there's a lot of demand that will continue to come back for us. That's code for we continue to see our ability to close the gap on the attendance levels to 2019 being a reasonable estimate of next year.\n\nBrian, anything you want to add?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nNo, I mean, I think you said it well. While there's a lot of uncertainty in the around the macroeconomic environment. And our crystal ball isn't any clearer than anybody else's, all we can look at, Barton, is the trends we are seeing. And as you noted, the most recent trends are October, extremely strong.\n\nunderscoring again, the demand for that event. Great weather in October. We can't ignore that, as Richard noted, but the longer lead indicators. We -- along with those strong attendance numbers, we saw outstanding sales of the 2023, products which tell us the consumer still feel pretty good about looking forward because in some cases these are products they're not going to able to use for another five or six months.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nBut on the flip side of that cost pressures, are you seeing any deceleration? It sounds like maybe wage is less of an issue other things, or is it still as kind of inflationary as it ever has been?\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nYeah. Around labor, I think what we've experienced is the result of strategies that we've deployed. There is certainly still pressure around wage rates. We've just deployed a different strategy that is allowing us to flatten that curve.\n\nAs I noted in other areas, you're right. I mean, we are seeing an acceleration of costs. We noted in terms of the impact it's having on things like cost of goods sold as we work on our capital programs for next year. Those projects are certainly under pressure, increasing costs.\n\nWe're making adjustments within the capital program where we can, to absorb those pressures without sacrificing the impact of the product. It may mean deferring some infrastructure things here or there, but we're certainly doing everything we can to offset those pressures.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. That's helpful. Thank you very much.\n\nOperator\n\nWe have no further questions at this time. I'll turn it over to Richard Zimmerman for any closing comments.\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nAll right. Thank you all for your interest in Cedar Fair. As a heads up, we will be participating in three banking conferences before the end of the year hosted by Stifel in Chicago, Deutsche Bank in West Palm Beach, and Truist in Boston. We hope to have the chance to visit with you at one of these events.\n\nOther wise, I want to wish you and your families a safe and happy holiday season. Michael?\n\nMichael Russell -- Corporate Director, Investor Relations\n\nThanks again, everybody. With additional questions, please feel free to contact our Investor Relations department at (419) 627-2233. And our next earnings call will be held in mid-February after the release of our full-year results for 2022. Chris, that concludes our call today.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Russell -- Corporate Director, Investor Relations\n\nRichard Zimmerman -- President and Chief Executive Officer\n\nBrian Witherow -- Executive Vice President and Chief Financial Officer\n\nJames Hardiman -- Citi -- Analyst\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nMike Swartz -- Truist Securities -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nEric Wold -- B. Riley Financial -- Analyst\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nMore FUN analysis\n\nAll earnings call transcripts"
}