{
  "companyName": "The Estee Lauder Companies",
  "companyTicker": "EL",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/the-estee-lauder-companies-el-q4-2022-earnings-cal/",
  "content": "The Estee Lauder Companies (EL -0.73%)\nQ4 2022 Earnings Call\nAug 18, 2022, 9:30 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Estee Lauder Company's fiscal 2022 fourth quarter and full-year conference call. Today's call is being recorded and webcast. For opening remarks and introductions, I would like to turn the call over to the senior vice president of investor relations, Ms. Rainey Mancini.\n\nRainey Mancini -- Senior Vice President, Investor Relations\n\nHello. On today's call are Fabrizio Freda, president and chief executive officer; and Tracey Travis, executive vice president and chief financial officer. Since many of our remarks today contain forward-looking statements, let me refer you to our press release and our reports filed with the SEC, where you'll find factors that could cause actual results to differ materially from these forward-looking statements. To facilitate the discussion of our underlying business, the commentary on our financial results and expectations is before restructuring and other charges and adjustments disclosed in our press release.\n\nUnless otherwise stated, all net sales growth numbers are in constant currency, and all organic net sales growth excludes the noncomparable impacts of acquisitions, divestitures, brand closures, and the impact of currency translation. You can find reconciliations between GAAP and non-GAAP measures in our press release and on the Investors section of our website. As a reminder, references to online sales include sales we make directly to our consumers through our brand.com sites and third-party platforms. It also includes estimated sales of our products through our retailers' websites.\n\n[Operator instructions] And now I'll turn the call over to Fabrizio.\n\nFabrizio Freda -- President and Chief Executive Officer\n\nThank you, Rainey, and hello to everyone. I'm grateful to be with you today to reflect on our record results for fiscal year 2022 and discuss the drivers of our outlook for fiscal year 2023. We leveraged our strengths amid the prolonged pandemic, the invasion of Ukraine and the onset of higher inflation. Our multiple NGO growth strategy, flexible financial model and exceptional talent enabled us to deliver record performance.\n\nAt the same time, we invested for long-term growth, reflecting our confidence in the vibrancy of prestige beauty now and in the future. We achieved better-than-expected results in our fourth quarter, leading to above guidance organic sales growth of 8% for fiscal year 2022. Reported sales rose 9% despite heightened foreign exchange pressure to end the year. Adjusted operating margin expanded 80 basis points to an all-time high of 19.7%.\n\nWe realized this greater profitability even as our growth engines diversified beyond our highest margin categories. Fragrance, makeup, and hair care delivered double-digit sales growth on a reported basis to complement our robust skin care business. Impressively, nine brands contributed double-digit organic sales growth for the year despite the significant pressure from COVID-19 in Asia Pacific in the fourth quarter. La Mer, Jo Malone London, and Le Labo showcased the strength of our portfolio across our large, scaling, and developing brands, respectively.\n\nMAC, Estee Lauder, and Clinique powered makeup emerging renaissance, with double-digit gains in the category as Jo Malone London and Tom Ford Beauty elevated fragrance to new heights with striking growth. Our geographic diversity has been a distinct benefit during the pandemic, allowing us to create and capture growth where opportunities presented themselves around the world. Asia Pacific led growth in fiscal '20 and '21 as markets in the West were more negatively impacted by COVID-19, while the Americas and EMEA drove growth in 2022 as the East confronted renewed pressure from the virus. Today, our $17.7 billion in annual reported revenues tops pre-pandemic levels by 19% fueled by organic sales growth and enhanced by our acquisitions of Dr.\n\nJart and DECIEM. Adjusted operating margin expanded 220 basis points over the three years. Our trusted brands with the hero products and sought-after innovation have thrived, while our increasingly flexible cost structure has served us well. Our focus on hero product had been a winning strategy.\n\nThis high repeat loyalty-inducing products have grown significantly as a mix of our business since fiscal year 2019. Throughout, we have continued to innovate to propel our hero strategy for the years ahead. Innovation served as a powerful catalyst for growth this year, representing over 25% of sales once again. Our newness exceeded consumer desires due to our exceptional data analytics, R&D and creative capabilities.\n\nLa Mer's Hydrating Infused Emulsion, Estee Lauder Re-Nutriv diamond serum and MACStack mascara are among our breakthrough launches this year, driving favorable earned media value and strong new consumer acquisition. Turning to category performance. Fragrance grew a stunning 32% organically for the year. Jo Malone London, Tom Ford Beauty, Le Labo, KILIAN PARIS and Editions de Parfums Frederic Malle each rose strong double digits and expanded in every region, including excellent results in travel retail in EMEA.\n\nEstee Lauder brand launched the luxury collection, and AERIN contributed double-digit gains. The outstanding performance of our luxury and artisanal portfolio affirms our strategic pivot to this accretive segment of the category. Consumers' behaviors during the market pandemic reinforced fragrance as part of self-care and solidified online as the destination for the category to explore, learn and purchase. Our brands stepped up to create and leverage these new dynamics.\n\nWe capitalized on the recovery in brick and mortar in many markets, realizing high levels of engagement in freestanding stores, while online continue to prosper for the category. Makeup remitted a powerful growth engine in fiscal year 2022. Strong double-digit organic sales gains in the Americas and EMEA more than offset a double-digit decline in Asia Pacific. As markets in the West reopened, leading to more social and professional use educations, the makeup renaissance emerge.\n\nOur brand excelled, with innovative artists as well as new products, which focused on performance, ingredient narratives and skinifications of makeup. We leveraged increased traffic in brick-and-mortar, which allowed us to reestablish our well-loved services in store to realize terrific growth in services. Hair care proved to be a valuable growth engine, contributing double-digit organic sales growth. The unique value proposition and go-to-market strategy for each of Aveda and Bumble and bumble resonated with consumers who increasingly expect the benefits of quality products and performance-based ingredients.\n\nThe skin care category was the most impacted from the resurgence of COVID-19 in Asia Pacific in the second half of the fiscal year as the restriction reduced traffic in brick-and-mortar as well as travel retail and also temporarily curtailed our distribution capacity in Mainland China. In this context, we delivered solid results as excellent performance from La Mer, Clinique, Bobbi Brown offset pressure from other brands. La Mer had a remarkable year. Consumers around the world gravitated to its iconic and robust innovations, embracing newness like The Hydrating Infused Emulsion and the upgrade to The Treatment Lotion to expand their regimens.\n\nGenaissance de la Mer lifted sales further as consumers traded up to the brand ultra-luxury franchise for its artisanal quality, unparalleled efficacy and high-curated experiences. Clinique and Bobbi Brown's success in skin care demonstrated the execution of our sophisticated hero strategy to drive strong repeat and consumer loyalty. Clinique heroes across categories from makeup remover to serum to moisturizer provided it with a winning formula, while Bobbi Brown's global and regional hero philosophy is driving its mix of business in skin care much higher. Looking now at channels.\n\nBoth brick-and-mortar and online served as growth engines for the year as we pushed exciting initiatives to amplify our omnichannel capability. Let me share a few of the highlights. Brick-and-mortar rebounded strongly in the America and EMEA as specialty multi, freestanding stores and department store all contributed. Our Post-COVID Business Acceleration program enabled us to improve the productivity and sustainability of our brand building, experiential brick-and-mortar footprint as intended.\n\nOnline grew mid-single digits organically led by double-digit growth in Asia Pacific. This in high online penetration boosted reported sales growth in the channel to double digits. Our online channel encompassing brand.com, third-party platforms, pure-play retailers and retail.com is now far more than twice as big pre-pandemic fiscal '19. China and the U.S., which already high online penetration, have expanded further, while markets in EMEA have seen a surge in online penetration that are now able to realize the benefits of scale.\n\nDuring the year, we diversified in high-growth channels globally to expand our consumer reach. Estee Lauder, Clinique and Origins initially launched on JD in China, and given the insight gain as well as new consumer acquisition trends, we introduced more brands on JD. Jo Malone London and La Mer launched on Lazada in Southeast Asia, and many brands participated in the emerging Ulta Beauty at Target and Sephora and Kohl's partnership in the U.S., both in store and online. We continue to innovate across the online ecosystem to generate trial and repeat.\n\nIn Latin America, which has historically been a strong market for direct selling, we leverage WhatsApp and drove social selling to represent 30% of online sales in the region. Around the world, our beauty advisors and makeup artists became content creators for always-on creation across social media platforms like TikTok. This showcases the powerful evolution of the reach and scale of our expert advice, which now stands well beyond brick-and-mortar. We also advanced our omnichannel strategy meaningfully this year.\n\nIn North America, most of our freestanding stores are now equipped with fulfillment capability. We also began to stand up these features in EMEA and Asia Pacific. These new capabilities are driving higher average order values and convincing upsell trends. At the same time, we extended the reach of our loyalty programs globally, introducing programs in Japan, Italy and Mexico, and expanding offering in other markets across EMEA and Asia Pacific.\n\nHere, too, the results are compelling. We are realizing greater purchase frequency, higher level of retention from consumer engaged in loyalty programs. During the fiscal year, we also progressed our ESG goals and commitments. We continue to make strides on our climate action strategy, including the expansion of our renewable energy portfolio across our direct operations globally, and we're recognized by a leading NGO for our commitment to source 100% renewable electricity.\n\nIn packaging, we set a more ambitious goal to increase the post-consumer recycled content of our packaging to 25% or more by the end of 2025 and set a new goal to reduce the amount of virgin petroleum packaging to 50% or less by the end of 2030. We expanded employee resource groups, a great source of community and unity. Our network of Black leaders and executives launched in Brazil while wELCome, our group of LGBTQIA+ employees, launched in EMEA. We created a group for our ageless employees and continue to scale our reverse mentoring program globally, pairing more junior talent with senior leaders to share insights and perspectives on trends to drive better business decisions and foster career development.\n\nWe brought our unique signature women leadership program, Open Doors, to our international markets, with continued great success in promoting our next generation of women leaders. We realized important progress with the From Every Chair leadership development program. Its inaugural class has already achieved high level of career mobility in the forms of promotions and new roles for Black employees. We are encouraged by these initial results and look forward to continued success from this sponsorship program, which we created for equitable advancement and professional development of our Black talent.\n\nBefore I talk about the year ahead, let me conclude on fiscal year 2022 by speaking about DECIEM, which complemented our organic sales growth. The Ordinary, DECIEM's ingredient-based brand, diversified in exciting ways over the last few months. The brand launched in India and Malaysia, expanded its hair care offering, and also introduced Multi-Peptide Lash and Brow Serum to extend its authorities in treatment. From each innovation exceeding expectation to outstanding initial results in Nykaa in India, The Ordinary enters fiscal year 2023 with promising opportunities.\n\nNow for the future. We refreshed our 10-year compass to help steer our ambitions and investment for the next decade. The compass reinforced our confidence showcasing the abundant growth opportunities ahead. The drivers are many, led by growing middle class globally and most especially in emerging markets; expanding usage across consumer segments, including ageless and men; and online expansion, fostering consumer access and reach.\n\nFrom the compass, we distilled our three-year strategy. As we look across the next three years, we expect to deliver more balanced growth across categories and regions. Near term, the pandemic and macro factors will likely lead to more valuable growth by category and regions. We are very confident in the strength of our company and in the vibrancy of prestige beauty.\n\nFor fiscal year 2023, we expect to deliver strong organic sales growth fueled by our diversified growth engines and enticing innovation, and to take the opportunity in a volatile year to continue investing for our exciting future to build global share. While the external challenges are many, including inflation, geopolitical uncertainty and currency headwinds, the enduring desirability of our brands with the hero products and high repeat rates is powerful. Additionally, our more effective cost structure, pricing power and strong cash generation should afford us the flexibility to successfully navigate the ongoing complex environment. Innovation is poised to be a catalyst for growth, and we began the year with exciting news.\n\nLet me share insights about two skin care launches. Estee Lauder upgraded Advanced Night Repair Eye Supercharged Gel-Creme addresses the signs of eye agings and reflects consumer modern lifestyles of long screen times and environmental stressors. Offering notable incremental benefits from the original product, this launch demonstrates the pricing power of innovation. Clinique Smart Clinical Repair line extended its fiscal 2022 innovation strength with the launch of Smart Clinical Repair Wrinkle Correcting Cream.\n\nThe moisturizer is coupled with the powerful new claims for Smart Clinical Repair Serum to drive gains in this hero franchise. This year, we expect to reignite growth engines in Asia Pacific as the pressure of COVID-19 abates. We anticipate in-store traffic levels to gradually improve in Mainland China, allowing brick-and-mortar to return to growth to complement ongoing strength online and for tourism trends to Hainan to ultimately accelerate from the most recent post, which began last week. We are confident in the long-term growth opportunity in Mainland China, evidenced by our expansion into almost 100 new doors and three additional cities in fiscal year 2022 as well as our introduction of Aveda last month.\n\nWe are thrilled to enter the hair care category with Aveda, which is vegan and Leaping Bunny-approved, as the brand launched on Tmall and opened its first freestanding store in the market. Fiscal 2023 is set to be a monumental year for us as of our Shanghai innovation lab opens, advancing our ambition to best create for the Chinese consumers, and we begin limited production in our new manufacturing facility near Tokyo, which is our first ever in Asia Pacific. With these two strategic initiatives, we expect to benefit over the next few years from increased speed-to-market and by further expanding our momentum with outstanding locally relevant innovation in this vibrant region. For the Americas and EMEA, we anticipate ongoing strength from our growth engines across categories and channels as well as across developed and emerging markets given the broad-based gains of fiscal year 2022.\n\nFor makeup, which is a vital category in both regions, the emergence of the makeup renaissance give us great confidence going into fiscal year 2023. In North America in particular, our focus turns to granular consumer growth opportunity as we have refined our distribution. To close, we delivered excellent performance in fiscal year 2022, achieving record results while advancing initiatives for consumer acquisition, engagement and high-touch services and experiences to drive trial and repeat levels even higher. Today, our business is not only far bigger and more profitable than the pre-pandemic fiscal year 2019, but our growth drivers are more diversified, our R&D and innovation capabilities are more robust, and our cost structure is more flexible.\n\nWhile the year ahead most certainly has its external challenges, our company is poised for a bright future as the best diversified pure player in prestige beauty with the most talented and passionate employees to whom I extend my deepest gratitude. I will now turn the call over to Tracey.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nThank you, Fabrizio, and hello, everyone. I will briefly cover the fiscal 2022 fourth quarter and full-year results, followed by our thoughts on the outlook for fiscal 2023. Our fourth quarter organic net sales fell 8%, a bit better than we expected, reflecting the disruptions in China related to COVID restrictions, including travel retail in Hainan, as well as the suspension of our commercial business in Russia and Ukraine. These matters more than offset continued growth from the recovery in the Americas and the rest of the EMEA region.\n\nReported sales growth included approximately one percentage point from the addition of sales from DECIEM, while currency translation negatively impacted growth by approximately three percentage points. From a regional perspective, net sales in the Americas rose 9% organically, led by double-digit increases in makeup and fragrance. Consumers continued their return to brick-and-mortar, leading to strong growth in freestanding retail and specialty multi-stores. We grew sales in nearly every market in the region, with particular strength in Canada and across Latin America.\n\nNet sales in our Europe, the Middle East and Africa region decreased 9% organically driven almost entirely by the disruptions in travel retail in China and the suspension of business in Russia and Ukraine. Of the remaining markets in the region, 10 rose double digit as tourists returned to the region, and consumer traffic and brick-and-mortar retail thrived. The makeup, fragrance, and hair care categories rose strong double digits in EMEA, while the decline in skin care reflected the soft travel retail sales in Asia. Global travel retail, which is primarily reported in this region, declined in Asia due to the COVID restrictions in China.\n\nHainan, in particular, was impacted as stores were closed a portion of the quarter, travel was curtailed to the island and courier services for online deliveries were disrupted. However, travel retail in European markets and in the Americas rose triple digits as airport traffic returned and doors in the channel reopened. Net sales in the Asia Pacific region fell 19% organically. Greater China and Korea net sales were the most impacted by the COVID restriction.\n\nHardest hit was Shanghai, where the citywide lockdown lasted two months, impacting our distribution capacity serving all of China through the end of May. Overall, our brands performed well for the important 6.18 holiday festival and maintained top rankings across the beauty space on both Tmall and JD. Elsewhere in Asia, there were some other bright spots. Malaysia, Japan, the Philippines, and Vietnam continued to recover and have begun to reopen to tourism.\n\nLooking now at net sales by product category. Fragrance led organic growth, with net sales rising 22% versus prior year. The fragrance category grew double digits across all regions. Luxury fragrances continue to resonate with consumers looking for indulgence, and our brands, including Tom Ford Beauty, Jo Malone London and Le Labo were once again star performers.\n\nNet sales in makeup rose 8% organically driven by the continued recovery and increased usage occasions in Western markets where makeup is generally the largest category. MAC and Clinique were top brand performers driven by hero products like MAC Studio Fix and the newly launched MACStack mascara as well as Clinique's Almost Lipstick in Black Honey. Continued success and expansion in specialty multi-doors is also aiding category growth. Hair care net sales grew 5% organically.\n\nExcellent performance from Bumble and bumble in specialty multi contributed to growth. The launch of Aveda's vegan hair color in EMEA and a successful activation around the brand's hero and body franchise in Korea also aided category growth. Net sales in skin care were the most impacted by the COVID-related restrictions in China, affecting Greater China, Asian travel retail and Korea. Skin care continues to represent approximately two-thirds of our business in the Asia Pacific region.\n\nNet sales fell 21% in the quarter due to the disruption of the Shanghai distribution center, with the greatest impact felt by Estee Lauder and La Mer brands. Skin care growth benefited from the addition of DECIEM sales in the quarter by approximately three percentage points. Our gross margin declined 370 basis points compared to the fourth quarter last year driven primarily by factors affecting our supply chain. Global transportation delays, port congestion, labor and container shortages and higher costs for both ocean and air transport have increasingly pressured our cost of goods.\n\nUnfavorable category mix from softer skin care sales also contributed to the decline. Operating expenses decreased 9%, driven by the curtailment of spending this quarter as COVID restrictions sharply reduced store traffic in China, including Hainan. We delivered operating income of $207 million for the quarter compared to $385 million in the prior year quarter. Diluted earnings per share of $0.42 included $0.03 dilution from the acquisition of DECIEM.\n\nShifting now to our full-year results. Given the volatility experienced throughout the year, the results reflect the benefit derived from the diversification of our top-line growth as well as the incredible agility of our teams and their ability to effectively manage costs while also simultaneously investing selectively for future growth. Net sales rose 8% organically, with double-digit gains in three out of four product categories and two out of three regions. Sales of our products online continued to thrive even as brick-and-mortar recovered, rising 11% for the year and representing 28% of sales.\n\nAmong brick-and-mortar retail, most channels grew double digit, while department stores ended the year down slightly as pressure from COVID restrictions in Asia offset growth in other regions. And our business in travel retail also grew, ending fiscal 2022 at 27% of sales. Our gross margin fell 60 basis points to 75.8%. Favorable pricing and currency were more than offset by higher supply chain costs, which were more pronounced in the back half of the year; the impact of the acquisition of DECIEM; and higher costs for new products and sets.\n\nOperating expenses declined 150 basis points to 56% of sales. Disciplined expense management and general and administrative costs was the largest contributor to the decline. The changes in our channel mix continue to reduce selling costs, and additionally, we continue to drive more effective resource allocation in our advertising and promotional mix. These favorable trends were partially offset by increased shipping costs.\n\nDuring the year, we continue to create more flexibility in our cost structure to absorb inflation in wages, media and logistics. We achieved significant savings from our cost initiatives, including the Post-COVID Business Acceleration program. This has enabled us to realize greater expense leverage while also reinvesting in areas that support profitable growth, resulting in an overall improvement in our operating margin. Our full-year operating margin was 19.7%, representing an 80 basis point improvement over last year.\n\nThis improvement includes the absorption of 60 basis points of dilution from DECIEM. Our effective tax rate for the year was 21.3%, a 260 basis point increase over the prior year, primarily driven by a lower current-year tax benefit associated with share-based compensation and the prior year favorable impact of the U.S. government issuance of final GILTI tax regulations that provided for a retroactive high-tax exception. Net earnings rose 11% to $2.6 billion, and diluted EPS increased 12% to $7.24.\n\nEarnings per share includes $0.04 accretion from currency translation and $0.05 dilution from the acquisition of DECIEM. The Post-COVID Business Acceleration program is wrapping up, with final estimated restructuring charges of $500 million to $515 million, at the top end of our original projections. We are pleased with the progress we achieved from this program. We realigned our brand portfolio by exiting four designer fragrance brands as well as the BECCA and RODIN brands, and we are streamlining our market distribution for Smashbox and GLAMGLOW to improve their long-term viability.\n\nWe optimized our brick-and-mortar distribution network. We have been and will continue to close underproductive freestanding retail stores as we rebalance our distribution network. By the end of fiscal 2023, we expect to have closed nearly 250 freestanding retail stores under the program. We've also rationalized department store counters and other retail locations, improving our ability to focus our efforts on driving more profitable omnichannel opportunities in our remaining distribution.\n\nWe also approved initiatives to optimize our organization across regions and throughout global functions to reduce complexity, leverage our scale and enhance our go-to-market capabilities. When we are finished executing the program, we expect a net reduction of between 2,500 and 3,000 positions globally. We expect to execute the remaining projects to achieve estimated annualized gross savings of between $390 million and $410 million before taxes beginning in fiscal 2024. A portion of these savings have been and will continue to be reinvested in capabilities that sustain our long-term growth, including data analytics, online, and advertising.\n\nTurning now to our cash flow. We generated $3 billion in cash from operations, a 16% decrease from the $3.6 billion in the prior year period. The primary driver was higher working capital due to the end-of-year disruptions related to the pandemic the past few years as well as inventory to support future growth and to help mitigate the supply chain challenges we have faced in certain raw material and componentry areas. We utilized $1 billion for capital improvements, an increase of approximately $400 million over last year.\n\nWe continue to invest in capacity and other supply chain improvements. We increased consumer-facing investments to support in-store experiences and recovery markets. We renovated office space, and we continue to invest in information technology. We also returned cash to stockholders at an accelerated pace this year as the need for more stringent cash conservation subsided with the progression of the recovery.\n\nDuring the year, we repurchased 7.4 million shares for $2.3 billion, and we paid $840 million in dividends, reflecting the 13% increase in our dividend rate that became effective in our fiscal second quarter. All in all, we delivered a strong year despite significant disruptions, including continued outbreaks of COVID, higher inflation, supply chain constraints and the invasion in Ukraine, and we also continue to invest in foundational capabilities for the future, including new production capacity and innovation to support growth. Now looking ahead to fiscal 2023, we believe that the prestige beauty category has ample opportunities for continued strong growth. Global prestige beauty is expected to grow mid- to high single digits driven by the continued recovery and the gradual reopening of the remaining markets impacted by COVID restrictions.\n\nAdditionally, we look forward to the continued resumption of international travel, especially in Hainan and the rest of Asia. We are concerned, however, that the recovery this fiscal year will once again not be a smooth one. Record inflation and the threat of recession or slowdown in many markets could temporarily dampen consumer enthusiasm and is causing some retailers to be more cautious regarding inventories. The strengthening dollar is putting pressure on our international earnings.\n\nAdditionally, heightened geopolitical tensions could prove to be disruptive. With that backdrop in mind, for the full fiscal year, organic net sales are forecasted to grow 7% to 9%. We discontinued four designer fragrance licenses at the end of fiscal 2022. These brands generated $250 million in sales in fiscal 2022.\n\nIn fiscal '23, we will sell some remaining inventory to the new licensees, primarily in the first half. Sales from both years will be excluded from our organic growth figures. At current levels, currency is projected to be a significant drag on our reported results in fiscal '23 as the U.S. dollar strengthens against key currencies.\n\nBased on July 31 spot rates at 1.018 for the euro, 1.215 for the pound, 6.746 for the Chinese yuan and 13.03 for the Korean won, we expect currency translation to dilute reported sales growth for the full fiscal year by three percentage points as well as an additional one point due to the impacts of foreign currency transactions in key international travel retail markets. There are a few other items impacting our sales growth in fiscal 2023. Our list price increases are expected to add approximately 5.5 points of growth, helping to offset inflationary cost pressures. We take most of our pricing actions at the beginning of our fiscal year.\n\nNew distribution, including new doors in existing markets, new markets for certain brands and expansion on new online platforms, could add another two points. Conversely, the loss of sales in Russia and Ukraine are expected to trim about one percentage point from sales growth. We plan to continue to drive margin expansion through operational efficiencies and cost savings while fueling additional advertising investment where appropriate. Our full-year effective tax rate is expected to be approximately 23%.\n\nDiluted EPS is expected to range between $7.39 and $7.54 before restructuring and other charges. This includes approximately $0.20 of dilution from currency translation. In constant currency, we expect EPS to rise by 5% to 7%. The impact from foreign currency transactions in key international travel retail markets is also expected to negatively impact adjusted diluted earnings per common share growth by six percentage points.\n\nAt this time, we expect organic sales for our first quarter to fall 4% to 6%. The impact of sales from certain designer license exits are expected to dilute reported growth by approximately one point, and currency is expected to be dilutive by approximately three points. Our first quarter sales are expected to be negatively impacted by continued COVID restrictions in China and Hainan. As you may recall, last year, we mentioned that some of our retailers in North America secured holiday shipments earlier due to supply chain concern, contributing one and a half points to our growth in the first quarter of fiscal 2022.\n\nThis year, retailers in the U.S. have been tightening their inventories, causing our net sales to trail retail sale. We expect China and travel retail in APAC to gradually improve throughout the first half of the fiscal year as COVID restrictions lift, and comparisons should ease in the back half of the year as we lap the invasion of Ukraine and the significant impact of COVID restrictions in China. We expect first quarter EPS of $1.22 to $1.32.\n\nCurrency translation is expected to be dilutive to EPS by $0.04. The impact from foreign currency transactions in key international travel retail markets is expected to negatively impact adjusted diluted earnings per common share growth by five percentage points. In closing, we remain confident about the long-term prospects for global prestige beauty and in our strategy to outpace industry growth. Our multiple engines of growth delivered in fiscal 2022, and we anticipate this more diversified growth can continue in the coming year.\n\nAnd importantly, we continue to reinforce the fundamental drivers of our business that both enable and contribute to continued strong future sales and EPS growth. I would like to close by extending our heartfelt gratitude to our employees around the globe for continuing to deliver our results during this challenging macro environment. That concludes our prepared remarks. We'll be happy to take your questions at this time.\n\nOperator\n\n[Operator instructions] Our first question today comes from Dara Mohsenian of Morgan Stanley.\n\nDara Mohsenian -- Morgan Stanley -- Analyst\n\nSo I have a two-part question on China. First, just on the detail side, can you just give us a bit more of a sense on what you've factored in to both Q1 and the full-year guidance on COVID lockdowns? Are you assuming the city restrictions that are in place today continue throughout Q1? And then what do you assume post Q1 in the balance of the year in terms of lingering shutdowns? And then second, it's very hard for us to judge externally your underlying market share performance in China ex supply issues. I'm sure it's difficult for you also. But just any perspective on underlying market share trends as supply returns to normal, perhaps so far in fiscal Q1, that'd be helpful.\n\nAnd if you expect any of the supply issues recently to have an impact on your forward share at all.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nSo I'll start, Dara, regarding China and what we've baked into our assumptions. Clearly, the first quarter, we are seeing some intermittent disruptions. Our distribution center is open. We're actually -- and opened in June, as we mentioned.\n\nSo we were well prepared for the 6.18 holiday festival, as I mentioned in our prepared remarks. We are still seeing some intermittent shutdowns, not whole city shutdowns in China, at the moment, so that is still disrupting brick-and-mortar retail. So we have factored that in certainly to our Q1 expectations for the China market. As it relates to Hainan, as we mentioned also in our prepared remarks and I'm sure you all have seen, Hainan is experiencing a lockdown right now, so all of the doors are closed.\n\nCourier services as well have been suspended for online orders. And we're obviously monitoring that day by day, but that is something that began in the month -- at the beginning of the month of August, and right now, we're expecting that to continue through the end of the month of August with some resumption in September, but not full resumption in September, recognizing that as this situation continues to impact the market, there will be some level of reticence for consumers to travel. But we certainly expect that that will improve in the upcoming months. So I think first quarter and first half, we are expecting some level of muted performance in the region related to these issues.\n\nWe do expect second quarter to be better than first quarter. And then in the second half, obviously, we're anniversarying quite a bit of disruption in the fourth quarter, some of which, began in the third quarter for both Hainan as well as China, and we do expect that we will see strong growth in the second half. For the full year, we do expect China to grow double digit. And so again, we are -- it is a market that we know there is very strong demand for prestige beauty and for our products, and the same with Hainan as well.\n\nSo we are just navigating through these first few months of the year until we get on the other side in the second half.\n\nFabrizio Freda -- President and Chief Executive Officer\n\nAnd I'll comment on market share. As Tracey just said, we do expect for the full year, China to go back growing double digit. We expect strong recovery in Hainan in the second part, in the second semester of the fiscal year, for sure, a gradual recovery before. That's our assumption, which obviously is going to give us also results in market share.\n\nSo speaking about the last -- the Quarter 4, to be clear, the market in China was down 10%. Estee Lauder Company was down 13%. So we lost one point of market share. We are now at 23%, so very strong market share.\n\nI would like to argue that given the lockdown of our distribution center, the impossibility of serving for almost two months, our consumers losing one point of market share temporarily is actually showing that already in June, we started recovery with an outstanding 6.18 event and the management of this. And then to speak about what we are going to do further in the next six months to recover the market share we lost because of the distribution was down, first of all, strong brand portfolio brands. We are going to reinforce it with the launch of Aveda that just started, which is a very important launch entering the hair care, a big and growing category, the luxury hair care, big and growing category in China. We are going to double down on Tmall and entering new successful online distribution that we started with JD, where we still have opportunity of deploying more brands in other areas where we are testing or distributing.\n\nWe have very strong innovation starting with what we discussed in the remarks, which is the Estee Lauder Advanced Night Repair eye product, which -- eye is one of the most important categories in China, and to be clear, it's one of the most important recruitment strategies, is eye products in the market. As you know, we are opening an R&D center this year, and so we are investing at even stronger innovations in the future. We are getting a great strategy to win in key shopping moments. I think that what we demonstrated in ADC in June for the 18.6 event is extraordinary.\n\nIn our team, we are coming out of 40 days down in Shanghai, and they were able to operate successfully a very complex and important event. We are going to do the same with 11.11, hopefully, now in the second quarter. We are also improving our distribution in brick-and-mortar. We are opening new cities and new doors in the existing fast-growing cities.\n\nWe have a new distribution center that we have opened. Actually, we opened this Friday in Guangzhou to mitigate risk of future distribution disruptions, and then this will turn into a definite ongoing new second big distribution center in the beginning of 2023. We believe the Hainan -- despite the current lockdown, which is obviously painful in the short term, but is a super strong opportunities for the long term, the power of Hainan in the future remain intact, and we have strong presence and market share in this operation. And I want to say we have an amazing local team, and this local team, they've been able to manage through these difficulties extremely well, and we believe that's strength on which we can count in the future to continue building market share over time.\n\nThank you for the question.\n\nOperator\n\nThe next question is from Lauren Lieberman of Barclays.\n\nLauren Lieberman -- Barclays -- Analyst\n\nI was struck when you mentioned that pricing this year expecting to be north of 5%. And if I then layer in what you suggested could be a contribution from distribution, it suggests very limited, let's call it, like-for-like door volume growth. So just I was curious if you could comment on that, because thinking about -- you mentioned, Fabrizio, recruitment, you're talking about launching Aveda. It just feels like there's a lot happening that should still be driving unit growth, and so I was curious if you could comment on that.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nYes, Lauren. So I'll start. We did call out, obviously, in our prepared remarks and in the press release a couple of adjustments in our revenue numbers this year. So we did exit our prestige designer licensed businesses.\n\nBasically, we ended those licenses. Our focus is on luxury fragrance and artisanal fragrance. And so we did let those licenses expire. That is about one point of growth.\n\nThe other point is related to the suspension of our operations in Russia and Ukraine. And so that is also contributing another point, if you will, to adjusted growth and to the suppression of growth that you're referring to. And then lastly, the currency impact on revenue also impacts us in terms of our growth algorithm. So if you adjust for all of those items, it's about six points of difference between what we've guided for the full year and where we expect -- where we would expect to end if none of those events had happened.\n\nSo that is the reason why the growth looks a bit muted even with the 5.5% pricing. The other thing I would say again is we are starting the year with a fair amount of disruption as we just spoke about in some of our very important markets. And we are assuming a more gradual recovery, and that, too, impacts our unit growth.\n\nOperator\n\nThe next question is from Nik Modi of RBC Capital Markets.\n\nNik Modi -- RBC Capital Markets -- Analyst\n\nI just wanted to revisit China, just given some of the economic data that we've been seeing recently, and curious if you've witnessed any evidence of any economic pressure impacting consumption. And I know it's hard with all the noise of COVID and the shutdowns, but perhaps maybe some of the markets where you haven't seen a big COVID impact, maybe you can share what trends would look like. Any perspective would be helpful.\n\nFabrizio Freda -- President and Chief Executive Officer\n\nNo, actually, we don't feel this. It's probably the prestige cosmetic, luxury cosmetic segment is more protected because of the big passion of consumers for this category, and as you know, the clear preference for the Chinese consumer for the prestige solutions, which is growing very fast for years now. And the percentage of the prestige for the total market keeps improving. So we don't see this.\n\nThe proof I can give you is that the top of the ranges are growing the fastest also on our brand. La Mer is one of our fastest-growing brands, as an example. So the -- and importantly, the market is very active when there are no restrictions, when there is no issues. So we don't see any -- obviously, we are prudent in the assumptions we are making on the China economy development in the short term as everyone is, but we don't see a very big impact on our business in absence of COVID restrictions situations.\n\nOperator\n\nThe next question is from Rupesh Parikh of Oppenheimer.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nSo, Tracey, I was wondering if you guys can provide more color on the interplay between gross margins and SG&A for the year.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nYes. Obviously, we experienced some gross margin pressure in Q4. It was related to some of the activity that we had to manage through in terms of getting product to market and some of the disruption that's in general in the supply chain. So -- and as we think about the first quarter and the guidance that we've provided, we do expect gross margins to be down as well in the first quarter, not to the same extent as they were in the fourth quarter, and that will gradually improve throughout the year as we're anniversarying some of those disruptions.\n\nSo for the full year, we're expecting gross margins to be around flat at the moment. But the first -- it's a tale of two halves in terms of the first half and some of the things we're anniversarying and some of the pressures that we're seeing on the business. But we do expect for the full-year gross margin to be flat. In terms of SG&A, again, we expect that we will continue to get good SG&A leverage.\n\nI think we're incredibly proud of what our team was able to deliver this past fiscal year and fiscal 2022 in terms of the expense leverage that we were able to deliver. And it's something that we are keenly focused on while also focused on investing in the important areas that drive our long-term growth algorithm. So those are things that we continue to manage throughout the year, and we'll get continued expense leverage this year.\n\nOperator\n\nThe next question is from Mark Astrachan of Stifel.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nWanted to follow up sort of directionally on the last question on gross margin. If you take a look at it even pre-COVID, pre-supply chain and inflationary pressures, adjust for some of the accounting changes kind of going back three, four years ago, it's still kind of down over the last five years, and your expectations were flat this year. I guess kind of the puts and takes, which you're taking out of price. You've got the Post-COVID Business Acceleration plan, so two years of productivity, there's a mix shift in the business toward direct-to-consumer.\n\nI guess maybe if you could talk directionally about kind of what has led the progression down, but more importantly, kind of where do you think it can go over time. Is that high 70s level achievable again? Why or why not? That'd be helpful.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nYes. I think we've seen over the time frame that you're speaking about, and yes, we definitely had accounting changes that impacted the gross margin between expenses and gross margin. But we've seen differences in the business in terms of our mix of business. And so fundamentally -- and I know it's important to understand what's going on in gross margin, but really, what we focus on is operating margin.\n\nAnd as we have seen channel shifts and market shifts, etc., those have impacted the gross margin, perhaps in some cases -- in some of those cases, more negatively, but they have impacted the operating margin quite positively. So at the end of the day, we're focused on delivering operating margin and profitable growth. In terms of whether or not we expect that we will get back to higher levels of gross margin, it is something that we are working on with our supply chain. So between our direct procurement programs, between some of the things we're doing in transportation, the opening of our Japanese plant, which should allow us to be not only closer to the consumer, but even to some of our suppliers for inbound freight should also help us from a gross margin standpoint.\n\nI'm not going to commit that we're going to get back to the gross margins that we were at five or six years ago, but do know that there are things that we see that are opportunities that we're also working on in very close partnership with our supply chain.\n\nOperator\n\nThe next question is from Steve Powers of Deutsche Bank.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nI wanted to focus on makeup, if I could. Obviously, the trajectory there is promising. You've been talking about the makeup renaissance for a while, and it directionally is -- seems to be taking shape. But we're still below '19 levels by a fair degree.\n\nSo I guess, really, the question is, sort of what's your expectation for that recovery to continue the progress you expect to make over the next 12 months? And to some extent, when do you expect to be able to kind of converge with those pre-pandemic levels? And as we talk about that, I'm mostly focused on the top line, but obviously, profitability comes alongside that, and your thoughts on rebuilding profitability in makeup alongside the top line would be helpful as well.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nOK. So let me -- I'll start. In terms of makeup, we continue to be quite bullish on the makeup category. We did see a recovery, particularly in our Western markets.\n\nSo part of the strength that we saw this year, this past fiscal year, in terms of the growth in makeup and the improvement in margin that we saw in makeup was related to recovery, in particular, in brick-and-mortar in our Western markets, so in the Americas as well as in Europe. We are still challenged a bit in makeup in our Eastern markets because of some of the disruption that's going on, in particular, in brick-and-mortar. And -- but we expect makeup to gradually improve as the disruption in those markets improve, and similar to Western markets, as consumers resume their normal social and professional occasions. So that is our expectation in terms of when we'll get back to fiscal '19 levels for makeup, depending on the disruptions this year.\n\nIt may take another year or so. But our makeup brands have fantastic innovation for this year, in particular, the MAC brand, but others as well. And so we're very encouraged in terms of makeup. As it relates to the margin, the makeup category has been particularly hit by the pandemic that is now going on for three years because of the brick-and-mortar distribution of makeup.\n\nAnd in particular, with a few of our makeup brands where services in store are very well loved by our consumers and the in-store experience, that took -- that was a bit of a challenge with doors closed and with traffic down. And traffic is still down in brick-and-mortar. Even in the markets that are in recovery, traffic has not recovered to prior levels, but it's well on its way to do so. So I think one of the reasons why we took some of the actions we did with the Post-COVID Business Acceleration program is take a point of view, to your point, of what that will look like when things are stabilized and what the mix between brick-and-mortar and online should be, and took proactive measures to close some underproductive doors, and largely, that will help the makeup category.\n\nMost -- many of those doors were makeup doors. Some of them were Origins doors. Some of them were Bobbi doors, actually. So that should continue to help to make up category as volume returns to -- in particular, brick-and-mortar.\n\nFabrizio Freda -- President and Chief Executive Officer\n\nYes. I just want to add that the makeup will continue to follow the user education on makeup. So the normalization from a consumer standpoint. This is happening, but it's not yet up to the levels it used to be.\n\nSo it's going there and will be there. So a lot of benefits are still in front of us and not behind us. So we will see further progress over time, particularly in the East where the COVID lockdowns are still creating issues, not only in distribution, but also in consumer usage of makeup. The other important thing is that makeup is really, as Tracey explained, is linked to services.\n\nAnd so to have the proper experience, you need critical mass per store. And the critical mass per store is dependent on traffic, as Tracey said. So this is also getting better. The renaissance is, if you want, at the beginning.\n\nSo more progress is in front of us. And that progress in particular would also impact positively the bottom line and the profitability of the category. So we are in the right direction, and we are not yet done on this.\n\nOperator\n\nThe next question is from Bryan Spillane of Bank of America.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nSo I just wanted to ask -- I think you mentioned in the prepared remarks, you talked a bit about product innovation for '23, and I think also in the press release, you talked about targeted distribution opportunities. So can you just give us a little bit more color on those two items? And I guess one of the things I'm interested in is just, is it sequentially -- especially on the product innovation, is there sequentially -- do we expect, I guess, more of a contribution from new products or product innovation in '23 versus what we've seen in the last two years just because the environment is a little bit maybe more accepting of that? So just some color on those two items would be helpful.\n\nFabrizio Freda -- President and Chief Executive Officer\n\nYes. I'll start on the product innovation. The product innovation is -- was at 25% already last year. This is a very good number, and we believe it's an efficient number.\n\nNow it can be 25% or 30%, depending by quarter. But that's, anyway, very powerful innovation. The thing that we have improved also, the rhythm of innovation. We have innovation really gradually per category, per quarter, per brand in a very sophistic way, market by market to make sure that we can leverage it.\n\nAnd the innovation is strongly supported by sufficient media. And our advertising in total is increasing in fiscal year 2030 in absolute level. And that's listed in the current assumptions guidance. And these advertising -- some part of it is guiding the innovation and the innovation results, but also, a lot of our innovation is attracting earned media value in a fantastic way.\n\nA good example of this has been MACStacks in the last fiscal year. So it's not only paid media, but it's also earned media that is attached to high-quality innovation. And so some of the high-quality innovation is also efficient from a spending standpoint, for a media standpoint for that reason. And then finally, innovation is driving pricing because innovation many times is about improving product, improving product performance or entering benefit areas that are more important for the consumer that's willing to pay more.\n\nAnd so we can invest in our standing products that deliver these results and price for these results as well. So it's a combination of factors why innovation is and will continue to be a very strong driver. And if you assume more or less the same percentage of innovation on a growing business, so innovation in absolute will also increase year after year in absolute level. On distribution, we have opportunities still to increase distribution.\n\nAnd we are doing it particularly online where there are a lot of new online ways to access consumer in efficient and productive way. It's also important to understand that the distribution opportunity at the end is about consumer coverage. It's about covering consumers that have desire today that are not covered. The best example of this is, for example, in emerging markets, starting from China, as an example, where we are covering 148 cities, but demand comes from 600 cities or more, and we serve the cities where there is no physical distribution value online.\n\nThis is happening the same in India. It's happening in Brazil. It's happening in Mexico. It's happening in many of the emerging markets.\n\nSo the new distribution online is covering new consumer in the large majority of cases, and it's very efficient. There is a lot of opportunity. There is some, which are already in this fiscal year, the fiscal year 2023 assumption, and there are many in the medium and long term that we are studying and prepared to do.\n\nOperator\n\nThe next question is from Olivia Tong of Raymond James.\n\nOlivia Tong -- Raymond James -- Analyst\n\nI wanted to ask you a little bit more about the price increases that you're planning, realizing, of course, it's not clearly the same as CPG. But by tier, sort of super luxury, ultra-prestige, how your prices will compare to your peers, especially given that more and more sales are happening in multichannel or online where you'll be closer to other brands or consumers can see multiple brands on one screen? And then if I could just sneak in another question, sort of piggybacking on Bryan's about the distribution -- the targeted expansion of distribution to retailers that provide broader consumer reach. Fairly certain I know what isn't included, but if you could talk a little bit about what that might entail globally and how that -- the channel mix progresses as a result.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nYes. So I'll start, Olivia, on the pricing piece. We have a very sophisticated algorithm for pricing. So we do look at price and by SKU, actually, by brand, by SKU, relative to what the brand has defined as the competitive set for that particular SKU when we consider what pricing we're going to take, for instance, on whether it's on a pricing increase on an existing product or even when we introduce a new product.\n\nSo that's very much taken into consideration. We also, depending on -- because we have a very broad price tier, obviously, of our products from La Mer and Frederic Malle and Tom Ford to Clinique and MAC and The Ordinary, we also look at for our entry-level prestige brands, the gap to their comparable closest mass brand. And so we are also cognizant of that. That has served us quite well in those multi-specialty accounts that you're referring to, where our goal continues to be trading consumers up from mass to prestige.\n\nAnd that has worked quite well for us in those particular accounts. And then you had a follow-up question on distribution, I think.\n\nOlivia Tong -- Raymond James -- Analyst\n\nThat's right. Just understanding when you say you're expanding your distribution to provide a broader consumer reach, what -- I think we all know what that does not entail, but what that does entail globally and what that -- what the implications might be both for sales and profit?\n\nFabrizio Freda -- President and Chief Executive Officer\n\nFrankly, it's what I was explaining in the answer to the previous question. There are -- for example, if you go online in a new partner, with a new partner online, with a new distribution, we cover cities and we cover areas, which are not covered by brick-and-mortar. So these reach consumers that were not reached before. And that's why expand our reach.\n\nThat's the key thing. So in other words, doesn't -- we try to avoid duplication in distribution as much as possible and maximize consumer coverage. And the key strong benefit that we are getting, as I said, particularly in emerging markets, but that's true everywhere in the world, is the fact that we are getting new consumers into our business and sourcing new consumers from mass into prestige. Tracey?\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nYes. And, Olivia, so we mentioned in the prepared remarks, we are introducing Aveda into China. That's expanding distribution for the brand. So one way we expand distribution is introducing products into a new market, as Fabrizio was indicating, other emerging markets.\n\nWe introduced The Ordinary into India via Nykaa. So that's one way that we expand distribution, particularly in a market where consumers had not had that opportunity to purchase that product before unless they traveled. We also expand with our existing retailers. So here in North America, as Ulta and Sephora opened new doors or any other retailer opens new doors, it is our consideration, without being over-retailed from a brick-and-mortar standpoint, of expanding in those stores as well.\n\nAnd that's an expanded -- expansion in terms of distribution. So if our retailer opens 20 new doors this year, we will open those doors with them. And so we include that in our distribution. I think I said in my prepared remarks that we expect around two points of growth this year from distribution.\n\nAnd largely, it's those types of distribution. Fabrizio talked as well about pure plays. Pure plays have been a fantastic way for us to actually -- selective pure plays. We're very selective -- to actually reach new consumers, in particular, younger consumers and -- who are shopping more online and maybe shopping on an apparel site online that we have an opportunity to introduce beauty products to and get a new consumer as well as a new shopping occasion as they're shopping for their apparel products.\n\nSo it's a very thoughtful way that we think about distribution and expanding distribution right now really to focus on reaching new consumers.\n\nOperator\n\nWe have time for one more question from Andrea Teixeira of J.P. Morgan.\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nSo my question is on the cadence of the quarter, of your guidance within the quarter. Besides Hainan consumers are more cautious to travel, you mentioned retail inventory, if I'm not mistaken. I wonder if you're embedding some adjustment to regain compliance in Q1? And if so, the magnitude of that impact that would give us more confidence on the recovery for the remaining nine months. And just a clarification on how much you expect sales to decline in China, including Hainan, in Q1, embedded in your guidance.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nYes. So I'll start with the last, Andrea. We don't give specific market information. So it's embedded in our guidance.\n\nYou can certainly -- as you -- if you think about what we have said previously in terms of the size of those businesses, you can probably back into a little bit in terms of what that impact would be. In terms of the retail inventory situation, we do expect that to improve in the second quarter. That was very specific to the U.S., actually, the Americas, but specific to the U.S. And we do expect that to improve in the second quarter as the holiday season approaches.\n\nAnd we do ship those holiday sets in Q2 that we shipped last year in Q1.\n\nFabrizio Freda -- President and Chief Executive Officer\n\nI think the other part of the question was Hainan. And in Hainan in this moment, they're not ordering. So there is no inventory sold, but they are -- still, what they are selling, they're selling from existing inventory. So there is -- there will be the possibility in the future to rebuild and normalize inventories when COVID abates.\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nAnd the only other thing I would add, and you didn't ask about this, but currency. So as you saw in our guidance, currency is a big impact for us this year. Obviously, if currency rates change, that will improve. But right now, if currency rates remain where they're at, and hopefully won't get worse, then about 70% of the impact of currency, the year-over-year impact of the currency depreciation that we've experienced, is in the first half.\n\nSo that should moderate. We really saw the currency depreciation beginning in the currencies that I mentioned that are the most impactful to us in the second half of our year, really starting in the March, April time frame. So we'll be anniversarying that in the second half. So again, as I mentioned, it's a bit of a tale of two halves and given some of the macro things that are impacting us in this fiscal year.\n\nOperator\n\nThat concludes today's question-and-answer session. If you were unable to join for the entire call, a playback will be available at 1 p.m. Eastern Time today through September 1. To hear a recording of the call, please dial (877) 344-7529, passcode 3602158.\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRainey Mancini -- Senior Vice President, Investor Relations\n\nFabrizio Freda -- President and Chief Executive Officer\n\nTracey Travis -- Executive Vice President and Chief Financial Officer\n\nDara Mohsenian -- Morgan Stanley -- Analyst\n\nLauren Lieberman -- Barclays -- Analyst\n\nNik Modi -- RBC Capital Markets -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nOlivia Tong -- Raymond James -- Analyst\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nMore EL analysis\n\nAll earnings call transcripts"
}