{
  "companyName": "Tupperware Brands",
  "companyTicker": "TUP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/tupperware-brands-tup-q3-2022-earnings-call-transc/",
  "content": "Tupperware Brands (TUP 3.50%)\nQ3 2022 Earnings Call\nNov 02, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the Tupperware Brands Corporation third quarter 2022 earnings conference call. Please note, today's conference is being recorded. [Operator instructions] At this time, I will turn the conference over to Doug Lane, vice president, investor relations and strategy. Mr.\n\nLane, you may begin.\n\nDoug Lane -- Vice President, Investor Relations and Strategy\n\nThank you, operator. Good morning, and welcome to Tupperware Brands third quarter '22 earnings conference call. Joining me today are Miguel Fernandez, president and CEO, and Mariela Matute, CFO. We will be available for Q&A following our prepared remarks.\n\nEarlier this morning, we issued a press release announcing our financial results for the third quarter of 2022, which can be found on our investor relations website. Let me remind you that the following discussion and our responses to your questions reflect management's views as of today, November 2, 2022, and may include forward-looking statements. Actual results may differ materially from such statements. Additional information about factors that could potentially impact our financial results is included in our Form 10-Q for the third quarter of 2022 subsequent filings with the SEC and our press release filed this morning.\n\nPlease review the forward-looking statements disclosure on Page three of today's press release. Please note that all references are being made on a constant currency basis, which reflects the application of the current period foreign exchange rate to any prior period results, enabling comparisons excluding the impact of foreign exchange rate fluctuations. Additionally, in the third quarter of 2021, the company made an accounting change to classify our sold and held-for-sale Beauty and Personal Care businesses as discontinued operations, consistent with our strategy to fix our core. Please also note that all references, unless otherwise noted, are being made on a continuing operations basis.\n\nDuring this call, we'll discuss certain non-GAAP measures, including those we refer to as normalized measures. Additional disclosures regarding these non-GAAP measures including explanations and reconciliations of these measures to the most comparable GAAP measures can be found in today's press release. Finally, a replay of this call will be available on our investor relations website later today. With that, let me turn the call over to you, Miguel.\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nThank you, Doug. Good morning to everyone, and welcome to our third quarter call. We released our third quarter results this morning, which were below our expectations. The global macro environment continues to be challenging, and we're now executing internally at a level or consistency that we believe we should be.\n\nWhile the sales decline in the third quarter was consistent with the trends in the first half of 2022, we had expected improvement on the much easier comparisons. Persistent COVID quarantines in China are impacting consumer behavior in that important market and geopolitical tensions along with inflationary concerns in Europe continue to impact consumer sentiment there. Additionally, actions we've taken internally as part of our turnaround plan have also impacted sales. For example, we have taken pricing decisions to protect our margins.\n\nIn North America, plan changes and IT upgrades have created service issues adversely impacting sales. Fortunately, an improving South American region helped offset some of the decline. Currency headwinds increased in the third quarter and created a 600 basis point hit in our dollar reported sales, and a $0.13 hit to EPS, as the dollar continues to strengthen against most major currencies. Our operating margins suffer as a result of continued inflationary pressures, coupled with the lower-than-expected sales, partially offset by price increases that we continue to implement to mitigate the higher input cost.\n\nWe ended the third quarter with price increases averaging 11% globally, up from an average 7% price increase coming out of the second quarter. Please remember that many of our larger markets such as U.S. and Germany haven't implemented price increases of this magnitude in decades. The good news is that our gross margin held in the mid-60 percentage range, only 90 basis points below that than a year ago, much better than the 400 basis points year-over-year decline that we had in the second quarter, and we expect year-over-year improvement in gross margins in 2022 fourth quarter due to many initiatives underway.\n\nHowever, to improve our operating margins, we believe we need to take further actions to reduce our SG&A which has a large, fixed cost component. We plan to address this over the next two quarters. But rest assured that we remain keenly focused to rightsize our business and find the necessary investment dollars to support future growth. At the beginning of the fourth quarter, we began to have our products sold in 1,900 target stores in the U.S.\n\nThis is an important step in reengaging with today's shoppers, particularly Gen Zs and millennials are more affluent consumers who probably have never been to a Tupperware party. We think it's critical to reach out to a younger and more affluent consumers and bring them into our ecosystem. We believe that once they have the opportunity to more easily access our brand and experience the quality and design of our products, there will be less wanting more. Also, it's important for us to let consumers know that there is only one authentic Tupperware brand.\n\nOnce consumers are in our ecosystem, they can engage with tupperware.com or any member of our independent sales force to have access to our full line of products. It is important for us to leverage what is unique to Tupperware as we open up new channels. First, our brand name. Second, our quality.\n\nThird, the ease of use and functionality of our products. And last, but definitely not least, our independent sales force who have the ability to demonstrate the products and offer the complete line of Tupperware products. We have over 8,500 functional design and utility patents for kitchen and home products from our traditional food storage container to pressure cookers and real designed to work in the microwave. In two or three years, we want to be in many more categories where consumers give us permission to operate.\n\nOur goal is simple, we want to be in every room of the house. After two and a half years of no meetings, we returned to holding in-person sales events in many markets around the world in the third quarter for the first time since 2019. While this impacted our SG&A spending comparison versus previous year, we believe that the return to in-person meetings is critical to the health of our direct selling business. While technology allowed us to survive during the pandemic, there's really no substitute for in-person training and recognition.\n\nThese in-person meetings, events and promotional vacations should improve our sales to lead activity, recurring and retention efforts going forward. But as I've said since I arrived in 2020, the Tupperware brand beyond direct selling. Our goal is to leverage this great brand recognition and expand our product reach outside the direction in channel of distribution. Let's face it.\n\nAccording to the WFDSA Direct selling did $186 billion in retail sales last year, which is tightly compared to the $96 trillion global economy. For perspective, Walmart did $568 billion in sales in the most recent fiscal year on Amazon did $407 billion this last year. Direct selling build the brand through millions of micro entrepreneurs around the world over the past seven decades, and we believe it will continue to be an important part of creating a competitive product ecosystem, but future growth in most of the global markets will come from increasing Tupperware access to broader consumer base through omnichannel distribution and moving its social selling model from analog to digital. Now let's review our third quarter results, starting with our top four markets.\n\nIn the U.S. and Canada, sales were down 15% in the quarter. Comp plan changes, coupled with a second round of price increases in September resulted in a 34% decline in active sales force. Despite the price increases, segment profitability was impacted by lower-than-expected unit volumes, increased discounts and promotions and adverse product mix as we focus on selling excess product inventory and added costs associated to return to the in-person meetings during the quarter.\n\nMexico was down 19% due primarily to service challenges that began earlier in the year and were exacerbated by the failed software upgrade in the third quarter. These ongoing service issues continue to cause reduction in the number of active sales force members. Well, it will take some time to build our sales grows back in Mexico over the next two quarters. Additionally, we have lower B2B sales, which accounted for 600 basis points of the decline.\n\nPrice increases taken in August also dampened sales force activity but helped protect profits with segment margin improving over 300 basis points in the quarter, driven by increased gross margin. Mexico is an important source of cash for us. So protecting the process there is a priority. In Brazil, sales declined 5% in the quarter due to a lower activity rate, which we believe reflects the weak economics of this market and high inflation and macroeconomic and political are  central expression in consumer spending.\n\nWhile this is a deceleration from the second quarter trends, we believe we outpaced our non-cosmetic direct selling peers, reflecting the strength of our brand and the desire for our products to help reduce food costs. Gross margin improved due to favorable pricing of nearly 9% on favorable product mix. However, higher SG&A spending slightly reduced the segment margin versus last year. However, like Mexico, Brazil carries segment margins and free cash flow conversion rates that are above our company average.\n\nAs we look forward, we are cautious with the outlook for this market as the national elections and World Cup this quarter may add volatility to a normal consumer behavior and therefore, our results in the near term. Turning to Asia. China was down 28% versus last year. A rapid rise in COVID cases during the summer resulted in continuous requirements and made for logistical challenges in many parts of the country.\n\nEconomic activity overall remains weak by historical Chinese standards and consumer spending remains soft. Despite the lockdowns, we continue to make investments to upgrade the look and feel of our retail studios, which were approximately the same number as last year, upgrade our outlets opened up our first experience center in Guangzhou in December and begin to pursue of e-commerce opportunity. We also have several new product offerings in the quarter that we believe could add excitement to our sales force and attracting customers. Excluding China, our Asia Pacific business was down 20% with Australia, Indonesia and Malaysia is declining 30% or more, considering the softness we have been seeing in those markets.\n\ndriven primarily by external factors and a compensation plan adjustment. The bright spot in this region continues to be Korea, where sales increased 16% in the quarter, with 9% growth in core direct selling. Sales augmented by an additional 700 basis points in B2B sales, including direct response TV spots. We will implement in Australia, Indonesia and Malaysia, when we know has been working in Korea.\n\nAnother early read of our success of our omnichannel product is in Belgium, where we roll out nationally in the second largest retailer, Delhaize over the summer. This fall during the two of the business weeks. The direct selling business reported 4% growth despite the widespread availability of our product in retail. While it is early days, we are encouraged to see that our omnichannel approach is truly expanding the Tupperware ecosystem to reach more consumers, otherwise we wouldn't have.\n\nWhile we are also increasing the potential of our sales force to create relationships with new customers who saw or purchase our products at retail. We also just published our latest ESG report. We believe we are making good progress toward achieving our 2025 and 2030 committees. We know ESG is important for our shareholders to assess the investment risk, for lenders to provide capital, for retailers concerned about responsible sourcing and for consumers, particularly Gen Z in assessing who they want to do business with and work for.\n\nWe believe we're on track to significantly reduce waste generation and water usage in our manufacturing facilities, reduced greenhouse emissions in our manufacturing facilities and single-use plastic packaging, increase on our use of non-fossil fuels in a sense, and explore the opportunity to reduce return Tupperware products. In fact, our sponsorship of the National Park Foundation is to replace single-use plastic bottles with our reusable products. Lastly, since we set out this company's turnaround plan two and a half years ago, the strategy has remained the same, to build the business as big as the Tupperware brand. That meant shifting our mindset to one that places the consumer in the middle, making sure that we have the right commercial strategies in each of our respective markets to speak to their respective market consumer.\n\nOur 2020 organizational structure was set out to stabilize the layer and simplify our traditional direct selling market and to get them to a place where they are ready to grow. Additionally, our investments have been focused on expanding the Tupperware brand into new channels, while energizing our current ones in the markets where consumers give us permission to do so. As recent embark 2023, we will enter a new chapter in our turnaround plan, creating a unique product ecosystem in the marketplace, by channel, with the right product mix and consistent pricing strategy will be key. And we need to organize accordingly.\n\nI am pleased to show that Hektor Lezama has been promoted to chief commercial officer to holistically oversee our efforts to achieve sustainable growth and improve profitability. He will be responsible for guiding all of our commercial activities around the world. Our omnichannel strategy is an inclusive strategy. The more our brand is easily accessible, the more opportunities we have to bring new consumers to us, whether as customers or sales force members.\n\nWe've seen this business helpful in many markets around the world, where when our sales force adopt the change, we see the tide lifting for all. If you haven't already, please read and consider sharing my LinkedIn post where I share more about the strategy and what it means for this company. And for all of our channels where we do business. As you may know, Doug Lane recently joined our team as our vice president of investor relations and strategy.\n\nDoug has covered Tupperware for many years at sell-side analysts. I was writing on us when the company went into Target some 20 years ago. Unfortunately, our presence in Target was short lived there due to decisions made by prior management. I'm going to now pass the call on to Doug, who wants to provide investors with some perspective on why our approach today is so much different.\n\nDoug?\n\nDoug Lane -- Vice President, Investor Relations and Strategy\n\nThanks, Miguel, and good morning, everybody. Investors have a long memory and are never more skeptical of any explanation that one starting with it's different this time. Yes, back in the fourth quarter of 2001, Tupperware expanded into 62 Super Target stores as part of its integrated Direct Access initiatives or IDA, which included channels outside of direct selling, mostly more kiosks at the time. These IDA initiatives were about a $15 million business in 2001 in North America.\n\nAfter moving into the 62 Super Target stores in the end of 2001, the IDA initiatives increased nearly 60% in 2002 to be approximately $25 million business. The North American segment overall had $268 million in sales and $30 million in segment profits in 2002. Then in the fourth quarter of 2002, the company decided to expand into all 1,100 Target stores nationwide at the time. Party cancellations melted as 2003 progressed and sales force numbers started to decline.\n\nThe 2003 annual sales in North America had dropped 18% and segment profit swung to a $22 million loss from the $30 million in profits the year before. Active sales force by the 2003 fourth quarter declined 24%. As a result of this impact on its direct selling business, the company exited all target stores in the second half of 2003 and the North America segment then return to profitability until 2006. Back then, I strongly believe the problem was that when the stores were open, an independent sales rep was expected to be in the store to do demonstrations and to solicit Target customers to be their personal clients.\n\nThere are two things I can think of that are suspect with this approach. First, shoppers probably are not interested in being engaged in a product discussion while walking the aisle in Target. And secondly, the independent sales rep, especially those working part time probably weren't interested in camping at Target stores, cold calling on their shoppers. Part of the reason one becomes a direct seller is the ability to conduct business on your own schedule.\n\nAs a result, many started to lead the system. This time, the sales force behavior in our omnichannel approach is expected to be unaffected. The ecosystem we are creating will focus on the following. One, brand building and positioning.\n\nTwo, incremental sales taking market share from our competitors; and lastly, lead generation for our sales force. When the customer buys a product at retail, they will be encouraged to scan a QR code to register their products for the lifetime guarantee. And in that process, we will get to know who is buying our products and offer them a consultive follow-up to experience with our sales force. Our expansion into omnichannel will truly leverage the uniqueness of the Tupperware brand and incorporates the learning from the Target test over 20 years ago.\n\nI will now turn the call over to Mariela, who will cover our third quarter performance in more detail.\n\nMariela Matute -- Chief Financial Officer\n\nThank you, Doug. As Miguel mentioned, sales were below expectations. Net sales for the quarter were $303 million, representing a decrease of 20% compared to last year, driven by continued lockdowns in China, along with macroeconomic pressures in Europe, a slowing in North America, partially offset by ongoing strength in South America. Excluding currency, sales declined 14%, which was in line with first half trends.\n\nNet sales in Asia Pacific declined 19% and net sales in China declined by 28% in the quarter, severally impacted by strict lockdowns, as well as declining consumer sentiment. While third quarter GDP of 3.9% rebound from 0.4% in the second quarter, consumer spending remains subdued, particularly in the premium segment. Excluding China, net sales in the remainder of Asia Pacific declined by 20%, driven by significantly lower sale force activity in Indonesia, Malaysia and Australia. One bright spot in this region is Korea, which while still small, is becoming increasingly important.\n\nThe market was up 16% in the quarter, with both direct sale in channel and B2B channel contributing to growth. In Q3, Korea surpassed Indonesia in sales contribution and is now getting close to Malaysia in being the second largest market in the Asia Pacific region. In Europe, net sales declined by 24%, driven primarily by low consumer sentiment, rising inflation and energy costs. Additionally, a timing shift in one of our B2B programs in Germany from the third quarter to the fourth quarter accounted for 100 basis points of the decline.\n\nWith new management in Germany and are looking to consolidate it with other markets to rightsize the business and rationalize the product offering. We are reviewing the sales force incentive programs and promotional plans in order to revitalize and reengage the sales force. Consumer confidence is very low, given rising inflation, particularly energy prices, as well as concerns over possible energy shortages and the conflict in Ukraine. Like other regions, Europe resume holding in-person gatherings with new release running in Germany and Iberia in the first quarter for the first time in over two years.\n\nMoving to the Americas. Net sales in North America declined by 16% in the quarter, driven primarily by lower sales force engagement and productivity, lower unit volumes due to price increases and service delays in Mexico due to an upgrade in IT that moved the last two weeks of orders into Q4. In the U.S. and Canada net sales declined by 15%, driven by lower sales force engagement, partially offset by improving service levels.\n\nCompensation plan changes earlier in the year, along with a second 10% price increase in September adversely impacted sales force activity. Profitability suffered during the quarter despite the price increases due to higher promotional and discount items, higher B2B sales and onetime costs associated with the closing of a third-party logistics provider. Net sales in Mexico declined 19% as service issues, price increases and inflation caused meaningful lower sales force engagement. We increased promotions in advance in the third quarter in order to engage the sales force and already seeing sales force activity increases.\n\nWe do not expect the service issues we have had in Mexico in 2022 will recur in future years. Despite these issues, Mexico remains among our most profitable markets with a strong free cash flow conversion rates. In South America, net sales increased by 7% in the third quarter. driven by strength in Argentina, which continues to leverage social media in its successful recurring efforts, as well as price increases.\n\nBrazil, one of our largest markets had a 5% decline in the quarter. Order activity in the direct selling industry is slowed in the quarter, decreasing 14%. But it performed better than the rest of the non-cosmetics direct sale in market. Average 9% price increases in Brazil and a strong top line growth in Argentina, boost segment profitability in South America by 90 basis points.\n\nNext, moving down the P&L to gross profit. In the third quarter, gross profit was $197 million, which represents a decrease of 21% compared to last year. Gross margin in the third quarter was 64.9%, approximately 90 basis points lower than last year, much better than the gross margin degradation that we experienced earlier in the year as our price increases are beginning to have an impact. The decrease was driven by manufacturing inefficiencies, due to lower volume, higher rise in transportation costs, country and product mix, partially offset by the price increases.\n\nAs pricing adds continue to be taken throughout the third quarter, we anticipate a full variable impact to be seen across the balance of the year. For the full year, we anticipate increasing prices by an average of 15% after coming out of the third quarter at 11%. Continuing on the P&L, SG&A stands was $176 million in the third quarter or 58% as a percentage of sales. This compares to 50.6% on a reported basis for the prior year.\n\nThe increase of 740 basis points was driven by lower sales volume over a relative stable fixed cost base, higher selling expense and investments in technology and in our omnichannel expansion strategy. Adjusted EBITDA for the third quarter was $29 million or 10% of net sales. This represents a sharp decrease compared to the $78 million reported last year, driven by lower volumes and margins. Adjustments in the quarter include approximately $4 million in regearing charges related to manufacturing footprint rationalization to reduce fixed costs and improve distribution.\n\nOur adjusted operating tax rate in the third quarter was 64% as compared to a tax benefit of $12 million in the same quarter last year, and 46% in the second quarter of this year. The operating tax rate was driven by an unfavorable mix of earnings by country, including receiving no tax benefit for substantial entity losses in countries like the U.S. Concurrent with the recent organizational changes, and market volatility, we continue to refine our supply chain and tax planning strategies to achieve a lower overall tax rate. I should also note that for the full year, with pet cash taxes to be lower than in the prior year.\n\nAnd finally, adjusted earnings per share were $0.14 in the third quarter compared to $1.19 last year, driven by all factors previously discussed, including approximately $0.13 of unfavorable foreign currency translation adjustments. Turning now to cash flow. On a reported basis, year-to-date operating cash flow, net of invested activities was an outflow of $88 million. compared to negative $7.4 million last year, driven by lower earnings, together with an increase in working capital in preparation for our omnichannel expansion and excess inventories due to lower-than-expected sales volume.\n\nWe're increasing our focus on cash management, particularly with regards to our manufacturing footprint and on capital management. We also recently amended our credit facility to provide for greater flexibility in anticipation of continued market volatility and the timing of our turnaround plan. We ended the quarter with a consolidated net leverage ratio of 4.17 times with our debt covenants for the third quarter of 4.5 as a maximum. Cash balances at the end of the quarter were $103 million compared to $267 million as of the end of 2021.\n\nTotal debt was $704 million compared to $685 million a year ago. The company's recent credit agreement amendment calls for a maximum leverage ratio to decrease from 4.5 in the third quarter to 4.25 in the following two quarters. While the company is currently in compliance with covenants, we're taking a proactive approach and started discussions with the banks to create additional flexibility as we continue to rightsize the business due to our current revenue trends and accelerate our reengineering actions. Given global economic outlook in which we operate and current consumer sentiment, we have to actively manage cash flow and liquidity.\n\nAs you know, we have been here before. As a reminder, in 2020, we took more than $150 million of cost out. And currently, we have plans to take more than $100 million of fixed costs out over the next three years and expect a reinvestable return. In summary, third quarter net sales declined year over year, and operating margins were below expectations.\n\nWe acknowledge the potential for continued near-term volatility as we continue to address internal challenges and navigate external headwinds. We're also aware that these external headwinds are impacting our ability to execute our turnaround plan and promptly as we would like. You can be sure that we will continue to look at additional ways to rightsize the business and to increase our cash generating capabilities in order to further strengthen our financial foundation. We will be doubling down our reengineering efforts in Q4, and we further rationalize our global manufacturing footprint.\n\nAnd now with this, let's take some questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Anthony Lebiedzinski with Sidoti.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nYes. Good morning and thank you for taking the questions. So first, as far as the conversations that you've had with your lenders about your debt covenants, can you just share more details as to when those conversations started? And then I know -- a two-part question here. So I guess then you talked about the rationalizing inventories.\n\nWhat were inventories because that was disclosed in the balance sheet because you only had a consolidated balance sheet. So if you could just talk about where your inventory is now and plans going forward to reduce the inventories.\n\nMariela Matute -- Chief Financial Officer\n\nAnthony, Mariela here. Thank you for the question. And yes, we continuously talk to our bank's partners as we have a series of engineering actions to take to make Tupperware sustainable for the next 50 years. So the discussions for the next round of the agreement started back in September, and we are proactively doing a five-year plan to ensure that we will have that flexibility to continue our turnaround plan.\n\nYou will see the levels of inventories in our 10-Q that will be published. And we also have started a series of programs across the world to improve our days of inventory turns. And that program includes the manufacturing rationalization, includes fast sales and promotions across the world, across different channels, as well as on SKU rationalization.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nGot it. OK. And then, in terms of the new programs with Target and Amazon, can you give us any early read on those? And what's been the response from your direct sellers? And how are you managing channel conflicts?\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nSo Anthony, this is Miguel. So let me talk to you about the target in one sentence. Target is only four months -- four weeks into the business. And it's ahead of our expectations.\n\nSo we're performing better. We just have to remember that we're going with a very limited number of SKUs into the target stores. And our direct selling workforce they have access to many, many hundreds of different SKUs. So obviously, there you have pockets of people that are a little bit concerned.\n\nBut for the most part, our great sales leaders around, in this case, the U.S., they understand the strategy. And some of them have been reporting already more activity in their own business just because this is a brand activation effort that we also do. So obviously, consumers go and see our brand in Target, and they're looking for some other products, and they contact their sales reps. So it's been great.\n\nAnd as I mentioned in the in my previous remarks, we have a -- we have in Belgium, like the perfect ecosystem where we already are in operating in one of the biggest retail stores around the country, and we have a big penetration in direct selling and both of them are growing. So those are good indicators for us. Obviously, early in the game. Lot to do -- the softness that we saw in the U.S.\n\nwas related to some compensation model adjustments that we did, but completely unrelated to our target initiative. The good thing about Target is that now we're going to go to Stage 2, which includes end caps in all the holiday season. So in three months from now, we're going to be reporting our first full quarter of results in Target.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nOK. Got it. And in terms of -- just my last question here. In terms of just price elasticity or inelasticity, I mean, just in response to your price increases, it sounded like that that had a bigger adverse impact on volumes.\n\nAnd just with the slowing of the economy, it seems like everywhere, should we be concerned about additional discounting pressure in gross margins?\n\nMariela Matute -- Chief Financial Officer\n\nAnthony, Mariela. We have been doing a series of price increases throughout the year, and we have played with two models, a small incremental increases month-over-month or double-digit increases on a quarterly basis. And we are learning as a company. As in many countries, this is the first time we have had to do price increases over a decade.\n\nSo we are plotting the data to understand the elasticity of the program. Anecdotally, we have seen that the month where we do double-digit price increases, we see a sharp volume decline that comes back over time. So we still believe that the price increase program is the right action to protect the economics of the business, as we are not alone in this inflation. Most of the direct sellers, competitors, as well as CPG have done price increases this year across most of the markets.\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nAll right. Thank you and best of luck.\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Jason Bender with Citi Group.\n\nJason Bender -- Citi -- Analyst\n\nGood morning. Thanks for taking the question. Just to come back to the leverage covenant. I get that it's still very early and you have really been discussion for whatever it is two months at this point.\n\nBut can you just speak to your confidence in your ability to get your terms amended? And just kind of assuming you do breach, what should we kind of expect in terms of next steps and your ability to then work out from there?\n\nMariela Matute -- Chief Financial Officer\n\nIt's Mariela. Thank you for the question. And we have a group of very supporting banks, and this is capital allocation exercise. Our priority as a company is to generate cash and improve our working capital, and we have signed that Q4 will be better than Q3 with the actions that we started in Q2 for inventory management and for cost containment.\n\nSo we have put into the forecast a series of scenarios and risks given the volatility of the macroeconomic environment and consumer sentiment. And we have flexibility in both in debt management, as well as EBITDA production. So we're working with the banks, and we expect to have by Q4, a new agreement that will be long-lasting and will facilitate the turnaround plans that we have for the next two years.\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nSo let me add just a quick comment, Jason. So as you know, in our recent history, we've been there before. So we know -- I mean, it's not something that we're proud of, but we have that skill, and we already know how to rightsize the company, how to focus on cash. And obviously, we provide confidence to the banks and everyone that we're going to be in compliant with all of our obligations.\n\nSo it's a rather – we already took, and we know how to drive the company with limited risk.\n\nJason Bender -- Citi -- Analyst\n\nGreat. And just relative to all the investments you've been making to grow capabilities to drive the omnichannel side of the business, just given where you guys are from the leverage ratio in the macro environment, just the overall trends in the business. Is your expectation that you might have to pull back on some of those investments at least in the short term to kind of manage cash?\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nYes. The short answer is yes. We might pull back some. We might delay some more.\n\nThe strategy continues to be the same one we believe is the right one. Obviously, we face some executional issues and a very weak consumer sentiment around the world. And we're managing this company actively, right? And if we see that there is a market that is reacting favorably. We are going to be investing in that market, but -- but the short answer of your question is yes, yes, we're doing that.\n\nAnd in parallel, if I may add, we are taking costs out sequentially. So we already have a plan to take out another $10 million in Q4 that will help to continue rightsizing this business and making Tupperware a very sustainable, profitable for the future. It's important to resize the company and prepare for growth. And in some cases, we will do the trade-off that we invest ahead of growth.\n\nJason Bender -- Citi -- Analyst\n\nGot you. And then, just switching gears. One of the things you've mentioned in terms of kind of catalyzing promotion in the direct selling side of the business has been the return of live person events. Since you've had these events, have you seen any sort of change in activity for those there's members of the sales force who have participated in them versus those who haven't.\n\nCan you just offer some commentary there in terms of what you're seeing in expectations?\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nYes. So let me share with you a little bit of the -- I'm going to call it, sales force analytics. So basically, what we've seen is that the people that have been with us for a longer period of time, I'm going to call it two, three years, they still remain with us. Sometimes not as productive because obviously, the consumer sentiment is low and they don't have as many customers, but they're still engaged with us.\n\nWhat we've been strong is to bring and keep the newer people, right? And I'm talking people with less than two years of experience with us. And that has related correlation, we've never been on an in-person meeting. So they haven't really understood what our DNA was as a company. So they missed out on that, and that's why we show retaining them and training them and so on.\n\nSo now with these new generations of people, we expect, obviously, our retention, our engagement and recurring efforts to start increasing. We have some good news in some of our major markets. But it's too early to tell that that is gaining ground because we just had those events very recently.\n\nJason Bender -- Citi -- Analyst\n\nGot it. Thanks for that color. All the best right now.\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Linda Bolton-Weiser with D.A. Davidson.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nYes, hi. So I'm just wondering if the cost-cutting initiative I guess, the new actions you're undertaking, if there's cash charges associated with any of those actions like for severance and things like that, can you quantify that?\n\nMariela Matute -- Chief Financial Officer\n\nYes, Linda, and that is exactly why we are in discussions with the banks as you probably know, exiting some of the regions that we play today and rightsizing our distribution, supply chain and manufacturing footprint could be costly in terms of severance. Absolutely the right thing to do for the next 20 years. And we are evaluating every scenario with proper return analysis and NPV. And the discussion with the bank is to help us pace those restructuring plans to transform this company at a capacity that our EBITDA production can accept and then have a good liquidity ratio in terms of both debt-to-EBITDA and interest coverage.\n\nSo we are working with the banks and many of our financial advisors to pace these reengineering actions over the next three years. And as of today, we have an estimate that the charges will be in the magnitude of $100 million.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nI'm sorry, could you repeat that number in terms of the charges of the amount?\n\nMariela Matute -- Chief Financial Officer\n\nOn the amount Yes. So we will expect that we are going to have $100 million of additional restructuring over the next three years with an investable return, of course.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nAnd what percentage of that $100 million is cash, roughly?\n\nMariela Matute -- Chief Financial Officer\n\nYes. So the $100 million will be cash, yes.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. That's a pre-tax or after-tax number?\n\nMariela Matute -- Chief Financial Officer\n\nThat would be a pre-tax number.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. And then, can you just talk about -- well, I mean -- so the Target stores, even though it's a small number of SKUs, it's quite a large number of stores. Was there some channel sales shipments in the third quarter or -- in the third quarter? And can you quantify the channel sales shipments?\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nYes. Yes, it was -- there were some, and it was less than $1 million. But what we're seeing right now is that we order in pattern, and there are some SKUs that have exceeded -- greatly exceeded our expectations.\n\nMariela Matute -- Chief Financial Officer\n\nAnd Linda, if I may add on the SKU selection. It's again, not enough data to validate this with data, but the -- some of the sets that we have placed in Target that are very high priced and sometimes double the competition are the first sellers. So because this is the first time in many years that consumers are able to test right their quality of the Tupperware container products. And then, devaluates the pricing and consumers are seeing the quality for the pricing.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. And then, just in terms of this retail initiative, I know you had talked about having to build up some infrastructure to be able to ship to retailers and things. I mean, is that work already done? Or do you still have like more investment to make along those lines?\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nSo it depends on the country, but the bigger ones, most of the investment is already there. In the U.S., it's already there. So we're good to go at least for the first big customers. Obviously, we might require more as we expand our presence in more -- our partnership with more retailers.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nAnd just finally, I mean, obviously, your objective would be to expand into more retailers, I guess. Do you think that just the general stability of the company and your financial condition is going to inhibit perhaps other partnerships with other retailers?\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nNo, I don't think so. I think -- obviously, it takes -- these partnerships take a long time, right, to set up the lineup and it's a year worth of preparing. So we're preparing for that. So I don't see any risk on that.\n\nAnd besides, any cash that we generate in excess of our obligations are going to be dedicated to product and omnichannel because as you know, this is the strategy of the company, and we see it highly beneficial not only for the future of the company, but also for the direct selling workforce because this is how we're going to be attracting a lot more customers to all the Tupperware our products, not only the ones that we are offering in retail.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. Thank you very much.\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nThank you, Linda.\n\nOperator\n\n[Operator instructions] There are no further questions at this time. I'll now turn the call over to Miguel Fernandez for any closing remarks.\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nThank you. In closing, while we're not pleased with our third quarter results, our omnichannel expansion plan remains on track, and we look forward to future penetration into retail channels later this year. We acknowledge that there's plenty of work still remains ahead of us to transform this business. But this quarter marked an incremental progress toward our goal of making the business as big as our iconic brand.\n\nAnd we will continue to build from here on step at a time. Thank you for your time today, and we look forward to talking to you again soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDoug Lane -- Vice President, Investor Relations and Strategy\n\nMiguel Fernandez -- President and Chief Executive Officer\n\nMariela Matute -- Chief Financial Officer\n\nAnthony Lebiedzinski -- Sidoti and Company -- Analyst\n\nJason Bender -- Citi -- Analyst\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nMore TUP analysis\n\nAll earnings call transcripts"
}